{"doi":"10.1088\/0964-1726","coreId":"140490","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/1377","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/1377","10.1088\/0964-1726"],"title":"Characterization of the response of fibre Bragg gratings fabricated in stress\nand geometrically induced high birefringence fibres to temperature and\ntransverse load.","authors":["Chehura, Edmon","Ye, Chen-Chun","Staines, Stephen E.","James, Stephen W.","Tatam, Ralph P."],"enrichments":{"references":[{"id":37941419,"title":"A fibre optic sensor for transverse strain measurement”,","authors":[],"date":"1999","doi":"10.1007\/bf02323553","raw":"C. M. Lawrence, D. V. Nelson, E. Udd, and T. Bennett, 1999, “A fibre optic sensor for transverse strain measurement”, Exp. Mech., 39(3), pp. 202-209.","cites":null},{"id":37941437,"title":"A fibre-optic frequency shifter utilising travelling flexure waves in birefringent fibre”,","authors":[],"date":"1988","doi":"10.1049\/jiere.1988.0042","raw":"C. N. Pannell, R. P. Tatam, J. D. C, Jones, and D. A. Jackson, 1988, “A fibre-optic frequency shifter utilising travelling flexure waves in birefringent fibre”, The J. of the Inst. of Electronic and Radio Engineers, supplement to vol. 58(5), S92-S98.","cites":null},{"id":37941423,"title":"A polarisation-maintaining fibre Bragg grating interrogation system for multi-axis strain sensing”,","authors":[],"date":"2002","doi":"10.1109\/ofs.2002.1000531","raw":"C- C. Ye, S. E. Staines, S. W. James, and R. P. Tatam,  2002, “A polarisation-maintaining fibre Bragg grating interrogation system for multi-axis strain sensing”, Meas. Sci. Technol., 13(9), pp. 1446-1449.   15","cites":null},{"id":37941415,"title":"Application of chirped fibre Bragg grating sensors for damage identification in composites”,","authors":[],"date":"2002","doi":"10.1117\/12.472608","raw":"N. Takeda, Y. Okabe, R. Tsuji, and S. Takeda, 2002, “Application of chirped fibre Bragg grating sensors for damage identification in composites”, Proc. SPIE, 4694, pp. 106-117.   14","cites":null},{"id":37941424,"title":"Characterisation of embedded fiber Bragg grating sensors written in high-birefringent optical fibres subjected to transverse loading”,","authors":[],"date":"2002","doi":"10.1117\/12.472616","raw":"F. Bosia, P. Giaccari, M. Facchini, J. Botsis, H. Limberger, and R. Salathe, 2002, “Characterisation of embedded fiber Bragg grating sensors written in high-birefringent optical fibres subjected to transverse loading”, Proc.  SPIE, 4694, pp. 175-186.","cites":null},{"id":37941427,"title":"Characterisation of the response of fibre Bragg grating sensors written in different types of high birefringent fibres subjected to transverse load.”,","authors":[],"date":"2003","doi":null,"raw":"E. Chehura, C-C. Ye, S. W. James, and R. P. Tatam, 2003, “Characterisation of the response of fibre Bragg grating sensors written in different types of high birefringent fibres subjected to transverse load.”, 16th Int. Conf. on Optical Fiber Sensors (Nara, Japan), (Japan: IEICE), pp. 240-243.","cites":null},{"id":37941420,"title":"Determination of the K-Matrix for the multi-parameter fiber grating sensor in","authors":[],"date":"1998","doi":"10.1117\/12.323418","raw":"D. Nelson, A. Makino, C. Lawrence, J. Seim, W. Schulz, and E. Udd, 1998, “Determination of the K-Matrix for the multi-parameter fiber grating sensor in AD072 Fibercore fiber”, Proc. SPIE, 3489, pp. 79-85.","cites":null},{"id":37941411,"title":"Discrimination between strain and temperature effects using dual-wavelength fibre grating sensors”,","authors":[],"date":"1994","doi":"10.1049\/el:19940746","raw":"M. G. Xu, J. –L. Archambault, L. Reekie, and J. P. Dakin, 1994, “Discrimination between strain and temperature effects using dual-wavelength fibre grating sensors”, Electron. Lett., 30(13), pp. 1085-1087.","cites":null},{"id":37941429,"title":"Fibers for sensors”,","authors":[],"date":"1984","doi":"10.1364\/ofc.1984.me2","raw":"D. N. Payne, 1984, “Fibers for sensors”, Proc. SPIE Int. Soc. Opt. Eng., 514, pp. 353-360.","cites":null},{"id":37941416,"title":"Fibre-optic and ultrasonic measurements for in-situ cure monitoring of graphite\/epoxy composites”,","authors":[],"date":"1999","doi":"10.1177\/002199839903302001","raw":"J.-Y. Chen, S. V. Hoa, C.-K. Jen, and H. Wang, 1999, “Fibre-optic and ultrasonic measurements for in-situ cure monitoring of graphite\/epoxy composites”, J. Compos. Mater., 33(20), pp. 1860-","cites":null},{"id":37941435,"title":"Formation of Bragg gratings in optical fibres by transverse holographic method”,","authors":[],"date":"1989","doi":"10.1364\/ol.14.000823","raw":"G. Meltz, W. W. Morey, and W. H. Glenn, 1989, “Formation of Bragg gratings in optical fibres by transverse holographic method”, Opt. Lett., 14(15), pp. 823.","cites":null},{"id":37941421,"title":"In-situ evaluation of composite structural performance in presence of high stress\/strain gradients using multi-axis fibre grating strain sensors”,","authors":[],"date":"2002","doi":"10.1109\/ofs.2002.1000501","raw":"E. Udd, K. Black, W. Schulz, S. Kreger, M. Kunzler, and D. Heider, 2002, “In-situ evaluation of composite structural performance in presence of high stress\/strain gradients using multi-axis fibre grating strain sensors”, 15th Int. Conf. on Optical Fiber Sensors (Portland OR, USA), (USA: IEEE), pp. 59-62.","cites":null},{"id":37941439,"title":"Inc., Fiber Optic Group,","authors":[],"date":null,"doi":null,"raw":"KVH Industries, Inc., Fiber Optic Group, KVH Headquarters,  50 Enterprise Center, Middletown, RI 02842 USA.","cites":null},{"id":37941441,"title":"Ltd, Electronics and Fibre Optics, C51 Barwell Bussiness Park,","authors":[],"date":null,"doi":null,"raw":"Fujikura Europe Ltd, Electronics and Fibre Optics, C51 Barwell Bussiness Park, Leatherhead Road, Chessington, Surrey, KT9 2NY, UK. FIGURE CAPTIONS","cites":null},{"id":37941417,"title":"Multi-axial strain monitoring in curing glass fibre\/epoxy composites measured using fibre Bragg grating sensors fabricated in high birefringent fibres”,","authors":[],"date":"2003","doi":"10.1088\/0964-1726\/14\/2\/009","raw":"E. Chehura, A. Skordos, C-C. Ye, S. W. James, I. Partridge, and R. P. Tatam, 2003, “Multi-axial strain monitoring in curing glass fibre\/epoxy composites measured using fibre Bragg grating sensors fabricated in high birefringent fibres”, 16th Int. Conf. on Optical Fiber Sensors (Nara, Japan), (Japan: IEICE), pp. 180-183.","cites":null},{"id":37941418,"title":"Multidimensional strain field measurements using fibre optic grating sensors”,","authors":[],"date":"2000","doi":"10.1117\/12.388113","raw":"E. Udd, W. Schulz, J. Seim, E. Haugse, A. Trego, P. Johnson, T. E. Bennett, D. Nelson, and A. Makino, 2000, “Multidimensional strain field measurements using fibre optic grating sensors”, Proc. SPIE, 3986, pp. 255-262.","cites":null},{"id":37941422,"title":"Multiple axis strain sensing using fiber gratings written onto birefringent single mode optical fibre”,","authors":[],"date":"1997","doi":"10.1364\/ofs.1997.otuc4","raw":"E. Udd, D. Nelson, and C. Lawrence, 1997, “Multiple axis strain sensing using fiber gratings written onto birefringent single mode optical fibre”, 12th Int. Conf. on Optical Fiber Sensors (Williamsburg, USA), (Washington, DC: OSA), pp. 48-51.","cites":null},{"id":37941430,"title":"Origins and control of polarization effects in single-mode fibers”,","authors":[],"date":"1983","doi":"10.1109\/jlt.1983.1072121","raw":"S. C. Rashleigh, 1983, “Origins and control of polarization effects in single-mode fibers”, J. Lightwave Technol., LT-1(2), pp. 312-331.","cites":null},{"id":37941434,"title":"Polarisation characteristics of noncircular core single-mode fibers”,","authors":[],"date":"1978","doi":"10.1364\/ao.17.003014","raw":"V. Ramaswamy, W. G. French, and R. D. Standley, 1978, “Polarisation characteristics of noncircular core single-mode fibers”, Appl. Opt., 17(18), pp. 3014-3017.    16","cites":null},{"id":37941431,"title":"Polarization-maintaining fibers and their applications”,","authors":[],"date":"1986","doi":"10.1109\/jlt.1986.1074847","raw":"J. Noda, K. Okamoto, and Y. Sasaki, 1986, “Polarization-maintaining fibers and their applications”, J. Lightwave Technol., LT-4(8), pp. 1071-1089.","cites":null},{"id":37941433,"title":"Preservation of polarization in optical-fiber waveguides with elliptical cores”,","authors":[],"date":"1979","doi":"10.1049\/el:19790275","raw":"R. B. Dyott, J. R. Cozens, and D. G. Morris, 1979, “Preservation of polarization in optical-fiber waveguides with elliptical cores”, Electron. Lett., 15(13), pp. 380-382.","cites":null},{"id":37941426,"title":"Production and characterization of refractive index gratings in high-birefringence fibre optics”,","authors":[],"date":"2003","doi":"10.1016\/s0143-8166(02)00043-x","raw":"I. Abe, R. E. de Goes, J. L. Fabris, H. J. Kalinowski, M. Muller, M. C. Fujihara, R. Falate, B. W. Diesel, R. C. Kamikawachi, and C. L. Barbosa, 2003, “Production and characterization of refractive index gratings in high-birefringence fibre optics”, Opt. Laser. Eng., 39, pp. 537-548.","cites":null},{"id":37941428,"title":"Recent advances in coherent optical fiber communication systems”,","authors":[],"date":"1987","doi":"10.1109\/jlt.1987.1075396","raw":"T. Okoshi, 1987, “Recent advances in coherent optical fiber communication systems”, J. Lightwave Technol., LT-5(1), pp. 44-51.","cites":null},{"id":37941408,"title":"Recent progress in applications of in-fibre Bragg grating sensors”,","authors":[],"date":"1999","doi":"10.1016\/s0143-8166(99)00025-1","raw":"Y. J. Rao, 1999, “Recent progress in applications of in-fibre Bragg grating sensors”, Opt. Laser. Eng., 31, pp. 297-324.","cites":null},{"id":37941414,"title":"Remote structural monitoring of the Cathedral of Como using an optical fibre Bragg grating sensor system”,","authors":[],"date":"2002","doi":"10.1117\/12.472625","raw":"M. P. Whelan, D. Albrecht, and A. Capsoni, 2002, “Remote structural monitoring of the Cathedral of Como using an optical fibre Bragg grating sensor system”, Proc. SPIE, 4694, pp. 242-252.","cites":null},{"id":37941409,"title":"Simultaneous independent temperature and strain measurement using in-fibre Bragg grating sensors”,","authors":[],"date":"1996","doi":"10.1049\/el:19960732","raw":"S. W. James, M. L. Dockney, and R. P. Tatam, 1996, “Simultaneous independent temperature and strain measurement using in-fibre Bragg grating sensors”, Electron. Lett., 32(12), pp. 1133-","cites":null},{"id":37941413,"title":"Simultaneous monitoring of strain and temperature during and after cure of the unsymmetric composite laminate using fibre-optic sensors”,","authors":[],"date":"2003","doi":"10.1088\/0964-1726\/12\/1\/304","raw":"H-K. Kang, D-H. Kang, C-S. Hong, and C-G. Kim, 2003, “Simultaneous monitoring of strain and temperature during and after cure of the unsymmetric composite laminate using fibre-optic sensors”, Smart Mater. Struct., 12, pp. 29-35.","cites":null},{"id":37941412,"title":"Simultaneous strain and temperature measurement of advanced 3-D braided composite materials using an improved EFPI\/FBG system”,","authors":[],"date":"2002","doi":"10.1016\/s0143-8166(02)00014-3","raw":"Y. J. Rao, S. F. Yuan, X. K. Zeng, D. K. Lian, Y. Zhu, Y. P. Wang, S. L. Huang, T. Y. Liu, G. F. Fernando, L. Zhang, and I. Bennion, 2002, “Simultaneous strain and temperature measurement of advanced 3-D braided composite materials using an improved EFPI\/FBG system”, Opt. Laser.  Eng., 38, pp. 557-566.","cites":null},{"id":37941410,"title":"Strain and temperature sensor using a combination of polymer and silica fibre Bragg gratings”,","authors":[],"date":"2003","doi":"10.1016\/s0030-4018(03)01313-0","raw":"H. B. Liu, H. Y. Liu, G. D. Peng, and P. L. Chu, 2003, “Strain and temperature sensor using a combination of polymer and silica fibre Bragg gratings”, Opt. Comm., 219, pp. 139-142.","cites":null}],"documentType":{"type":0.6666666667}},"contributors":[],"datePublished":"2004-08-01T00:00:00Z","abstract":"The transverse load and temperature sensitivities of fibre Bragg gratings (FBGs)\nfabricated in a range of commercially available stress and geometrically induced\nhigh birefringent (HiBi) fibres have been experimentally investigated. The\nwavelength reflected by the FBG in each polarization eigenmode was measured\nindependently and simultaneously using a custom designed interrogation system.\nThe highest transverse load sensitivity, of 0.23 ± 0.02 nm\/(N\/mm), was obtained\nwith HiBi FBGs fabricated in elliptically clad fibre. This was higher than for\nany other HiBi fibre, which, coupled with the small diameter of the fibre, makes\nit a good candidate for an embedded or surface mounted strain sensor. The\nhighest temperature sensitivity of 16.5 ± 0.1 pm °C-1, approximately 27% greater\nthan any other fibre type, was obtained with the HiBi FBG fabricated in Panda\nfibre. HiBi FBG sensors fabricated in D-clad fibre were the only ones to exhibit\nidentical temperature sensitivities for the slow and fast axes (11.5 ± 0.1 pm ","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140490.pdf","fullTextIdentifier":"https:\/\/dspace.lib.cranfield.ac.uk\/bitstream\/1826\/1377\/1\/Characterisation-Bragg%20gratings-Transverse%20load-2004.pdf","pdfHashValue":"e364b5e1b9ea22d2394cc5c1424775446e4eb211","publisher":"Institute of Physics","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/1377<\/identifier><datestamp>2011-09-20T12:04:00Z<\/datestamp><setSpec>hdl_1826_19<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Characterization of the response of fibre Bragg gratings fabricated in stress\nand geometrically induced high birefringence fibres to temperature and\ntransverse load.<\/dc:title><dc:creator>Chehura, Edmon<\/dc:creator><dc:creator>Ye, Chen-Chun<\/dc:creator><dc:creator>Staines, Stephen E.<\/dc:creator><dc:creator>James, Stephen W.<\/dc:creator><dc:creator>Tatam, Ralph P.<\/dc:creator><dc:subject>Transverse strain<\/dc:subject><dc:subject>birefringent fibres<\/dc:subject><dc:subject>multi-axial strain<\/dc:subject><dc:subject>3D strain<\/dc:subject><dc:subject>temperature<\/dc:subject><dc:subject>fibre Bragg grating sensors<\/dc:subject><dc:description>The transverse load and temperature sensitivities of fibre Bragg gratings (FBGs)\nfabricated in a range of commercially available stress and geometrically induced\nhigh birefringent (HiBi) fibres have been experimentally investigated. The\nwavelength reflected by the FBG in each polarization eigenmode was measured\nindependently and simultaneously using a custom designed interrogation system.\nThe highest transverse load sensitivity, of 0.23 ± 0.02 nm\/(N\/mm), was obtained\nwith HiBi FBGs fabricated in elliptically clad fibre. This was higher than for\nany other HiBi fibre, which, coupled with the small diameter of the fibre, makes\nit a good candidate for an embedded or surface mounted strain sensor. The\nhighest temperature sensitivity of 16.5 ± 0.1 pm °C-1, approximately 27% greater\nthan any other fibre type, was obtained with the HiBi FBG fabricated in Panda\nfibre. HiBi FBG sensors fabricated in D-clad fibre were the only ones to exhibit\nidentical temperature sensitivities for the slow and fast axes (11.5 ± 0.1 pm °<\/dc:description><dc:publisher>Institute of Physics<\/dc:publisher><dc:date>2011-09-08T10:02:08Z<\/dc:date><dc:date>2011-09-08T10:02:08Z<\/dc:date><dc:date>2004-08-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>Edmon Chehura, Chen-Chun Ye, Stephen E Staines, Stephen W James and Ralph P Tatam; Characterization of the response of fibre Bragg gratings fabricated in stress and geometrically induced high birefringence fibres to temperature and transverse load. Smart Structures and Materials, 2004, Vol. 13, No. 4, pp888-895<\/dc:identifier><dc:identifier>0964-1726<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1088\/0964-1726\/13\/4\/027<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/1377<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0964-1726","0964-1726"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2004,"topics":["Transverse strain","birefringent fibres","multi-axial strain","3D strain","temperature","fibre Bragg grating sensors"],"subject":["Article"],"fullText":" 1\nTitle of Article \n \nCharacterisation of the response of fibre Bragg gratings fabricated in stress and geometrically \ninduced high birefringence fibres to temperature and transverse load.  \n \nAuthors and addresses   \n \nEdmon Chehura, Chen-Chun Ye, Stephen E. Staines, Stephen W. James, and Ralph P. Tatam* \n \nOptical Sensors Group, Centre for Photonics and Optical Engineering, School of Engineering, \nCranfield University, Cranfield, Bedford, MK43 0AL, UK.  \nTel: +44 1234 754630  \nFax: +44 1234 751566  \nEmail: r.p.tatam@cranfield.ac.uk \n*Correspondence author \n \n \nShort Title \n \nHiBi fibre Bragg grating response to temperature and transverse load. \n \nPACS classification \n42.81.-i \n42.81.Pa \n42.81.Gs \n \n \n \n 2\nAbstract \n \nThe transverse load and temperature sensitivities of fibre Bragg gratings (FBG) fabricated in a \nrange of commercially available stress and geometrically induced high birefringent (HiBi) fibres \nhave been experimentally investigated. The wavelength reflected by the FBG in each polarisation \neigenmode was measured independently and simultaneously using a custom designed interrogation \nsystem. The highest transverse load sensitivity, of 0.23 ±0.02 nm\/(N\/mm), was obtained with HiBi \nFBGs fabricated in elliptically clad fibre. This was ~25% higher than for any other HiBi fibre, \nwhich, coupled with the small diameter of the fibre, makes it a good candidate for an embedded or \nsurface mounted strain sensor. The highest temperature sensitivity of 16.5 ± 0.1 pm\/0C, \napproximately 27% greater than any other fibre type, was obtained with the HiBi FBG fabricated in \nPanda fibre. HiBi FBG sensors fabricated in D-clad fibre were the only ones to exhibit identical \ntemperature sensitivities for the slow and fast axes (11.5 ± 0.1 pm\/0C).  \n \n \nKey Words \n \nTransverse strain, birefringent fibres, multi-axial strain, 3D strain, temperature, fibre Bragg grating \nsensors \n \n \n \n \n \n \n 3\n1. Introduction \n \nA fibre Bragg grating (FBG) is a periodic modulation of the refractive index within the core of an \noptical fibre and acts to couple a forward propagating fibre core mode to a backward propagating \ncore mode at a particular wavelength given by \nΛ= effB n2λ                   (1) \nwhere λB, neff, and Λ are the reflected Bragg wavelength, effective refractive index, and the grating \nperiod respectively. A change in the effective refractive index and\/or the grating period will cause a \nshift in the reflected Bragg wavelength. This has led to FBGs being investigated in a wide range of \napplications for the measurement of strain and to a lesser extent temperature [1-3]. However, the \nmajority of applications have related the change in Bragg wavelength, generally measured using an \noptical spectrometer, to axial strain and\/or temperature acting on the FBG [4-6]. More recently there \nhas been an interest in measuring the transverse strain components in addition to the axial strain \nwith the goal of internal stress measurements in composite materials. Applications for this more \ncomplex approach include structural health monitoring [7], impact and damage detection [8], and \ncure monitoring of composite materials [9,10]. FBG sensors fabricated in high linearly birefringent \n(HiBi) fibres are ideal for these measurements and have been proposed for the measurement of \nmulti-strain components [11].  \n \nThe reflection spectrum from a FBG fabricated in HiBi fibre will consist of two Bragg peaks, one in \neach of the two polarisation axes of the fibre. It has been proposed that the three components of \nstrain and temperature could be measured by co-locating another FBG with a sufficiently different \ncentre wavelength [12]. The result is a system of four simultaneous equations that can be solved for \nthe 4 unknowns using experimental calibration data [13]. The working principle of a HiBi FBG \nsensor was demonstrated recently in curing composites [10,14]. There has been a limited number of \n 4\ninvestigations of the response of HiBi FBG sensors to applied transverse load [12,15-19] and these \nhave focused mainly on elliptical cladding (3M [20]) and bow tie (Fibercore [21]) fibres. There has \nnot been any temperature characterisation of HiBi FBG sensors reported. \n \nThis paper presents the characterisation of FBG sensors, fabricated in both stress and geometrically \ninduced HiBi fibres, to applied transverse load and temperature.  \n \n2. Birefringence in optical fibres \n \nMost fibre optic applications, such as telecommunications and sensors, demand coherent optical \ntransmission, which requires systems capable of controlling the polarisation state of the light \n[22,23]. Fibres that are capable of maintaining the polarisation of the coupled light can be classified \neither as high birefringent or low birefringent fibres. Linearly polarised or circularly polarised \nwaves propagate with small polarisation dispersion in low birefringence fibre but the polarisation \nstate is sensitive to external perturbations such as bends, twists, and temperature, which induce \nadditional birefringence whose magnitude is comparable to or greater than the intrinsic \nbirefringence.  When the intrinsic birefringence is deliberately enhanced to be very large in \ncomparison to that from external perturbations, the result is a fibre with high birefringence that \nmaintains the state of polarisation of light that is matched to a polarisation eigen mode (linear or \ncircular depending on the nature of the induced birefringence) of the fibre.  \n \nFor non-HiBi fibres subjected to a transverse load the birefringence, Bf, is given by [24] \n \n( )( )\nrE\nFppnkB poof πν ⋅+−= 12 1211\n3                    (2) \n \n 5\nwhere ko, no, νp, r, E, F, p11 and p12 are respectively the free space propagation constant, average \nrefractive index of the fibre, Poisson ratio, outer radius of the fibre, Young’s modulus, force per unit \nlength, and the elasto-optic coefficients of the fibre. Equation (2) indicates that the application of a \ntransverse load will alter the birefringence of the fibre.  \n \nInternal birefringence of the fibre is produced by various mechanisms either based on the geometric \neffect of the core or on a stress effect around the core [24,25]. Birefringence is induced in the core \nwhenever its circular symmetry is broken, thus producing an anisotropic refractive index \ndistribution. Such fibres usually have an elliptically shaped core [26] although other types, e.g. \ndumbell core, have been fabricated [27]. Stress induced birefringent fibres are produced from \nasymmetric transverse stress which introduces linear birefringence through elasto-optic refractive \nindex changes in the core [25]. The stress is frozen internally in the fibre during fabrication as the \nresult of different thermal contraction between differently doped regions of the fibre located \nsymmetrically on either side of the core. Elliptical cladding fibres, elliptical jacket fibres, PANDA \nfibres, and bow-tie fibres are examples of stress induced birefringent fibres. Figure 1 shows \nschematics of the HiBi fibres that were used in this work. The slow axis is the axis or plane in \nwhich the stress applying parts or the major axis of the ellipse lie. \n \nThe modal birefringence B is the difference in the effective refractive indices between the two \northogonal modes of the fibre. Birefringence is usually characterised by its beat length Lp, which is \nthe distance after which the input polarisation state is reproduced as the polarisation state evolves \nalong the length of the fibre, that is, the relative phase of the light propagating in the two orthogonal \npolarisation modes change by 2π. \n \nβ\nπλ\nΔ==\n2\nB\nLp                          (3) \n 6\n \nwhere λ and Δβ are the optical wavelength and the change in the mode propagation constant \nrespectively. The shorter the beat length, the higher the birefringence. Modal birefringence, \nproduced by all kinds of internal origins in the high birefringent fibres, is given by [25] \n \nSSOG BBBB ++=                     (4) \n \nwhere BG is the geometric component of the birefringence introduced by the shape of the core, BSO \nis the self-stress component, and BS is the outer stress component. The self-stress component of the \nbirefringence is induced by the thermal expansion difference of the asymmetrical core of the fibre. \nThe outer stress component is introduced from outside the core e.g. by elliptical cladding\/jacket or \nstress applying parts. The birefringence components have been calculated [25] but a knowledge of \nthe physical properties and geometry of the fibres is required which are, in general, unavailable \nfrom commercial manufacturers.    \n \n3.  Experiment \n \nFBG sensors were fabricated in our laboratories into hydrogen loaded stress and geometrically \ninduced HiBi fibres using an injection-seeded frequency-quadrupled Nd:YAG laser operating at a \nwavelength of 266 nm. A two-beam, three mirror interferometric technique [28] was used to \nfabricate FBG sensors of length 5 mm. The HiBi fibre was aligned such that the laser illumination \navoided the stress lobes for the case of stress-induced HiBi fibres. The axes of the stress induced \nHiBi fibre were identified through observation of the diffraction pattern from the fibre when \nilluminated from the side with a Helium Neon laser source [29]. This method could not, however, \nbe used for geometrically induced HiBi fibres as the diffraction pattern from the two polarisation \n 7\naxes was not sufficiently distinctive. The eigen axes of these fibres, apart from the D-clad fibre \nwhose axes are known from the shape of the fibre (Figure 1), had to be identified visually by \nlooking at a polished fibre end through a microscope. The FBG sensors were subjected to transverse \nstress using a loading fixture designed to minimise fibre rotation (Figure 2).  \n \nThe load applied to the FBG sensor was detected using a FUTEK miniature load button with a \ncapacity of 222 N and resolution of 0.1 N.  The output of the load button was recorded through the \ndata acquisition (DAQ) card simultaneously with the wavelength shifts of the gratings using an \ninterrogation system [16] based on a scanning fibre Fabry-Perot (FFP) interferometer coupled to \nhigh birefringent fibre (Figure 3). The super luminescent diode had a 3 dB bandwidth of 50 nm \ncentred at 1560 nm and the measured output power at the fibre pigtail was 0.6 mW. The FFP filter \nhad a finesse of 895 and free spectral range of 5330 GHz (~42.7 nm). The overall extinction ratio of \nthe interrogation system was measured to be 15 ± 0.5 dB. The wavelength resolution of the system \nwas determined from the standard deviation to be 2 pm. A key attribute of this instrument is that it \nmeasures independently and simultaneously the wavelength reflected by the Bragg grating in each \npolarisation eigenmode. \n \nA pair of rotational stages, with angular resolution of 20, was used to rotate the HiBi fibre \ncontaining the FBG sensors to determine the sensitivity as a function of the orientation of the eigen \naxes with respect to the applied load. The length of the stripped fibre section subjected to transverse \nload was 24 mm and both the test and support fibres were of the same fibre type. The test and \nsupport fibres for the D-clad fibre were aligned identically and both fibres were rotated. This \nminimised the variation in the fibre height above the bottom plate thereby minimising fibre rotation. \nThe reference angle (00) for the rotation was not made coincident with either of the eigen axes of \nthe fibre but was arbitrarily chosen. \n 8\n \nThe responses of the HiBi FBG sensors to temperature were investigated by placing the sensors in a \ntube temperature furnace such that there was no strain applied to the sensors. The temperature \nfurnace was fitted with a Eurotherm PID temperature controller. The temperature of the furnace was \nincremented in steps of 10 0C from room temperature to about 150 0C and the data, which was \naveraged over 30 seconds, was recorded after the system reached a steady state. The temperature \nstability of the furnace in the steady state was 0.2 0C. Measurements were also taken as the system \nwas cooled down to room temperature. \n \n4. Results and Discussion \n \nFBGs were fabricated in the six HiBi fibre types shown schematically in Figure 1 and listed in \nTable 1. The fibre parameters are shown in Table 2 and the measured wavelength separation of the \nslow and fast axis FBG peaks are summarised in Table 3.  \n \nThe comparison of the responses of the FBG sensors in elliptical core and elliptical clad HiBi fibres \nis shown in Figure 4. The maximum and minimum load sensitivities in the slow and fast axis are \nsignificantly higher in the elliptical clad fibre. Figure 5 is a similar comparison of Panda and \nTruePhase fibres, both of which use stress rods to generate the birefringence. The maximum load \nsensitivities for the slow axis of each fibre are similar while the minimum sensitivities in the fast \naxes are different. In Figure 6 the maximum sensitivities for the FBG sensors in Bow tie and D-clad \nfibres are shown to be the same, within experimental error, but the minimum sensitivity of the D-\nclad fibre is significantly higher. \n \n 9\nThe load sensitivity is plotted as a function of the angle of rotation of the HiBi fibre containing the \nFBG sensors in Figures 7-9. The maximum and minimum sensitivities are obtained when the load \nwas applied along an eigen axis. This method has also been used to confirm the orientation of the \neigen axes of the HiBi fibres, determined as discussed in section 3. \n \nTable 4 gives a summary of the load sensitivities of the FBG sensors fabricated in different types of \nHiBi fibre when subjected to transverse load. The maximum sensitivity was obtained when the load \nwas applied along an eigen axis of the fibre.  The elliptical clad fibre exhibited the highest \nsensitivity, and this was found in the slow axis. The elliptical clad fibre also showed maximum \nsensitivity in the fast axis when compared to the other fibre types. In general, the maximum \nsensitivity of the slow axis is higher than that of the fast axis with the exception of the Panda and \nelliptical core fibres whose slow and fast axis maximum load sensitivities have similar magnitudes. \nThe greatest differential transverse load sensitivity was measured between the eigen axes of the bow \ntie fibre. \n \nThe high sensitivity of the elliptical clad fibre may be attributed to its smaller diameter (80 µm) as \nwell as to the presence of additional stress around the core created by the elliptical cladding during \nthe manufacturing process. The stresses along the major diameter of the cladding are greater than \nthose along the minor axis direction and this is probably the reason the sensitivity in the slow axis \nof this fibre is greater when compared to that of the fast axis. The fact that the elliptical cladding \ncreates some stress along the minor axis may be the reason the elliptical clad fibre has higher \ntransverse strain sensitivity in its fast axis when compared to other fibre types.  \n \nThere is no additional stress transferred to the core of the elliptical core fibre from its cladding and \nthis is probably the reason the transverse strain sensitivities for this fibre are similar for both the \n 10\nslow and fast axes. It is not easy to infer why the Panda fibre has similar transverse strain \nsensitivities for its fast and slow axes. One possibility is that the stress generated by the stress rods \nof this fibre may be less concentrated along the slow axis when compared to other fibres that use \nstress applying parts (SAPs) since its stress rods are further away from the core (Figure 1).  \n \nFigures 10 - 15 are plots of FBG wavelength shifts as a function of the temperature applied to FBGs \nfabricated in the different types of HiBi fibre. The graphs show plots of the response to temperature \nof the FBGs in both the slow and fast axes of the HiBi fibres. The continuous lines represent the \nmeasured temperature in the fast axis while the dashed lines are for the slow axis.  Lines have been \nomitted in Figure 10 for clarity, since the two graphs are nearly matched.  \n \nTable 5 shows the various HiBi FBG sensors’ sensitivities to applied temperature. The responses \nare linear with R2 values of at least 0.999. The results show that the slow and fast axes of the fibres \ndo not have the same temperature sensitivities. The fast axes of the HiBi fibre are generally more \nsensitive to temperature than the slow axes. The FBG sensors in the stress induced HiBi fibres have \nhigher sensitivities to temperature than those fabricated in the geometrically induced HiBi fibres. \nThe FBGs fabricated in Panda fibre were the most sensitive to temperature. Furthermore the FBG \nsensors in the D-clad HiBi fibre have approximately identical temperature sensitivities for the slow \nand fast axes of the fibre. The greatest differential temperature sensitivity was measured between \nthe eigen axes of the elliptical clad fibre. \n \nThe thermal expansion coefficients of the core and cladding are nearly the same, hence the fast axis \nof fibres with no SAPs or of fibres with the smallest dimension becomes more sensitive to \ntemperature when compared to the slow axis, where the SAPs have a higher thermal expansion \ncoefficient. The thermal stress that was frozen internally in the fibre (due to SAPs) during \n 11\nfabrication may be released by an increase in temperature thus adding to the temperature sensitivity \nof the stress induced HiBi fibres and making them more sensitive than the geometrically induced \nHiBi fibres. The matched temperature sensitivities of the slow and fast axes of the D-clad fibre is \nprobably linked to the D shape of the fibre, since without the D cladding the fibre would have \nbehaved as the normal elliptical core fibre. \n \nThe response of a HiBi FBG sensor to external stimuli is generally considered to be a function of \nthree orthogonal strain components and temperature, a total of four unknowns. Thus a total of four \nFBG sensors, from two co-located HiBi FBGs, will be required to determine the four unknowns \nfrom a system of four simultaneous equations. The asymmetric shape of the D-clad fibre could be \nuseful for fibre alignment during lay up in composite materials. If the fibre is laid with its flat face \nresting in the plane of the specimen, this is likely to minimise any fibre rotation that could change \nthe orientation of the eigen axes. Such a rotation, if not accounted for, could result in the \nmeasurements being interpreted as having shear strain.  \n \n5. Conclusion \n \nFBG sensors were fabricated in stress and geometrically induced birefringent fibres and the slow \nand fast axis wavelength separation range was 0.35 – 0.6 nm. The FBG sensors were subjected to \nknown transverse loads at various orientations of the fibre in the range 0 - 1800. The transverse load \nsensitivity of the FBG sensors in the slow axis of the fibre was higher than that of the fast axes. The \nhighest sensitivity of the FBG sensor is therefore associated with the transverse plane having the \nlongest geometry or the transverse plane in which anisotropy exists. The elliptical clad fibre \nexhibited the highest overall transverse load sensitivity, ~ 25% higher than any of the other fibre \n 12\ntypes. Consequently the high sensitivity of this fibre makes it an ideal sensor for both surface and \nembedded multi-axial strain sensing in which a high strain transfer coefficient is required.  \n \nThe FBGs were subsequently subjected to temperature loads in the range from room temperature to \nabout 150 0C and their responses were found to be linear with R2 values of at least 0.999. In contrast \nto the transverse strain results, the temperature sensitivities of the FBG sensors measured in the fast \naxis of the HiBi fibres was higher compared to that measured in the slow axis. The Panda fibre \nexhibited the highest overall temperature sensitivity, ~ 27 % higher than any of the other fibre types. \nAn interesting result was the matched temperature sensitivities of the fast and slow axes of the HiBi \nFBG sensor in D-clad fibre. The results of our experiments confirm that the method currently \nproposed to measure 3D strain and temperature by co-locating two HiBi FBGs at two different \nwavelengths is applicable. \n \n \n \nAcknowledgements \n \nThis work was supported by the Engineering and Physical Sciences Research Council, UK \n(GR\/M89454).  \n \n \n \n \n \n 13\nReferences \n \n1. Y. J. Rao, 1999, “Recent progress in applications of in-fibre Bragg grating sensors”, Opt. Laser. \nEng., 31, pp. 297-324. \n2. S. W. James, M. L. Dockney, and R. P. Tatam, 1996, “Simultaneous independent temperature \nand strain measurement using in-fibre Bragg grating sensors”, Electron. Lett., 32(12), pp. 1133-\n1134. \n3. H. B. Liu, H. Y. Liu, G. D. Peng, and P. L. Chu, 2003, “Strain and temperature sensor using a \ncombination of polymer and silica fibre Bragg gratings”, Opt. Comm., 219, pp. 139-142. \n4. M. G. Xu, J. –L. Archambault, L. Reekie, and J. P. Dakin, 1994, “Discrimination between strain \nand temperature effects using dual-wavelength fibre grating sensors”, Electron. Lett., 30(13), \npp. 1085-1087. \n5. Y. J. Rao, S. F. Yuan, X. K. Zeng, D. K. Lian, Y. Zhu, Y. P. Wang, S. L. Huang, T. Y. Liu, G. \nF. Fernando, L. Zhang, and I. Bennion, 2002, “Simultaneous strain and temperature \nmeasurement of advanced 3-D braided composite materials using an improved EFPI\/FBG \nsystem”, Opt. Laser.  Eng., 38, pp. 557-566. \n6. H-K. Kang, D-H. Kang, C-S. Hong, and C-G. Kim, 2003, “Simultaneous monitoring of strain \nand temperature during and after cure of the unsymmetric composite laminate using fibre-optic \nsensors”, Smart Mater. Struct., 12, pp. 29-35. \n7. M. P. Whelan, D. Albrecht, and A. Capsoni, 2002, “Remote structural monitoring of the \nCathedral of Como using an optical fibre Bragg grating sensor system”, Proc. SPIE, 4694, pp. \n242-252.  \n8. N. Takeda, Y. Okabe, R. Tsuji, and S. Takeda, 2002, “Application of chirped fibre Bragg \ngrating sensors for damage identification in composites”, Proc. SPIE, 4694, pp. 106-117. \n 14\n9. J.-Y. Chen, S. V. Hoa, C.-K. Jen, and H. Wang, 1999, “Fibre-optic and ultrasonic measurements \nfor in-situ cure monitoring of graphite\/epoxy composites”, J. Compos. Mater., 33(20), pp. 1860-\n1881.  \n10. E. Chehura, A. Skordos, C-C. Ye, S. W. James, I. Partridge, and R. P. Tatam, 2003, “Multi-axial \nstrain monitoring in curing glass fibre\/epoxy composites measured using fibre Bragg grating \nsensors fabricated in high birefringent fibres”, 16th Int. Conf. on Optical Fiber Sensors (Nara, \nJapan), (Japan: IEICE), pp. 180-183. \n11. E. Udd, W. Schulz, J. Seim, E. Haugse, A. Trego, P. Johnson, T. E. Bennett, D. Nelson, and A. \nMakino, 2000, “Multidimensional strain field measurements using fibre optic grating sensors”, \nProc. SPIE, 3986, pp. 255-262. \n12. C. M. Lawrence, D. V. Nelson, E. Udd, and T. Bennett, 1999, “A fibre optic sensor for \ntransverse strain measurement”, Exp. Mech., 39(3), pp. 202-209.  \n13. D. Nelson, A. Makino, C. Lawrence, J. Seim, W. Schulz, and E. Udd, 1998, “Determination of \nthe K-Matrix for the multi-parameter fiber grating sensor in AD072 Fibercore fiber”, Proc. \nSPIE, 3489, pp. 79-85. \n14. E. Udd, K. Black, W. Schulz, S. Kreger, M. Kunzler, and D. Heider, 2002, “In-situ evaluation of \ncomposite structural performance in presence of high stress\/strain gradients using multi-axis \nfibre grating strain sensors”, 15th Int. Conf. on Optical Fiber Sensors (Portland OR, USA), \n(USA: IEEE), pp. 59-62. \n15. E. Udd, D. Nelson, and C. Lawrence, 1997, “Multiple axis strain sensing using fiber gratings \nwritten onto birefringent single mode optical fibre”, 12th Int. Conf. on Optical Fiber Sensors \n(Williamsburg, USA), (Washington, DC: OSA), pp. 48-51. \n16. C- C. Ye, S. E. Staines, S. W. James, and R. P. Tatam,  2002, “A polarisation-maintaining fibre \nBragg grating interrogation system for multi-axis strain sensing”, Meas. Sci. Technol., 13(9), pp. \n1446-1449. \n 15\n17. F. Bosia, P. Giaccari, M. Facchini, J. Botsis, H. Limberger, and R. Salathe, 2002, \n“Characterisation of embedded fiber Bragg grating sensors written in high-birefringent optical \nfibres subjected to transverse loading”, Proc.  SPIE, 4694, pp. 175-186.  \n18. I. Abe, R. E. de Goes, J. L. Fabris, H. J. Kalinowski, M. Muller, M. C. Fujihara, R. Falate, B. \nW. Diesel, R. C. Kamikawachi, and C. L. Barbosa, 2003, “Production and characterization of \nrefractive index gratings in high-birefringence fibre optics”, Opt. Laser. Eng., 39, pp. 537-548.  \n19. E. Chehura, C-C. Ye, S. W. James, and R. P. Tatam, 2003, “Characterisation of the response of \nfibre Bragg grating sensors written in different types of high birefringent fibres subjected to \ntransverse load.”, 16th Int. Conf. on Optical Fiber Sensors (Nara, Japan), (Japan: IEICE), pp. \n240-243.  \n20. 3M United Kingdom PLC, 3M Centre, Cain Road, Bracknell, RG12 8HT, United Kingdom. \n21. Fibercore Limited, Fibercore House, University Parkway, Chilworth Science Park, \nSouthampton, Hampshire, SO16 7QQ, UK. \n22. T. Okoshi, 1987, “Recent advances in coherent optical fiber communication systems”, J. \nLightwave Technol., LT-5(1), pp. 44-51.  \n23. D. N. Payne, 1984, “Fibers for sensors”, Proc. SPIE Int. Soc. Opt. Eng., 514, pp. 353-360. \n24. S. C. Rashleigh, 1983, “Origins and control of polarization effects in single-mode fibers”, J. \nLightwave Technol., LT-1(2), pp. 312-331. \n25. J. Noda, K. Okamoto, and Y. Sasaki, 1986, “Polarization-maintaining fibers and their \napplications”, J. Lightwave Technol., LT-4(8), pp. 1071-1089.  \n26. R. B. Dyott, J. R. Cozens, and D. G. Morris, 1979, “Preservation of polarization in optical-fiber \nwaveguides with elliptical cores”, Electron. Lett., 15(13), pp. 380-382.  \n27. V. Ramaswamy, W. G. French, and R. D. Standley, 1978, “Polarisation characteristics of \nnoncircular core single-mode fibers”, Appl. Opt., 17(18), pp. 3014-3017.  \n 16\n28. G. Meltz, W. W. Morey, and W. H. Glenn, 1989, “Formation of Bragg gratings in optical fibres \nby transverse holographic method”, Opt. Lett., 14(15), pp. 823.  \n29. C. N. Pannell, R. P. Tatam, J. D. C, Jones, and D. A. Jackson, 1988, “A fibre-optic frequency \nshifter utilising travelling flexure waves in birefringent fibre”, The J. of the Inst. of Electronic \nand Radio Engineers, supplement to vol. 58(5), S92-S98. \n30. KVH Industries, Inc., Fiber Optic Group, KVH Headquarters, 50 Enterprise Center, \nMiddletown, RI 02842 USA. \n31. OFS Fitel Denmark I\/S, Priorparken 680, DK-2605 Brøndby, Denmark. \n32. Fujikura Europe Ltd, Electronics and Fibre Optics, C51 Barwell Bussiness Park, Leatherhead \nRoad, Chessington, Surrey, KT9 2NY, UK. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 17\nFIGURE CAPTIONS \n \nFigure 1 \n \nHiBi fibre cross-sectional geometry: (a) Panda and TruePhase fibres, (b) bow tie fibre, (c) D \ncladding and elliptical core fibre, (d) elliptical core fibre, (e) elliptical cladding, and (f) polarisation \naxes configuration. The approximate dimensions of the fibres, in µm, are also provided in the \nfigures and all fibres have an outer cladding diameter of 125 µm with the exception of (e) that has a \ndiameter of 80 µm.  SAP: stress applying parts. All the dimensions, with the exception of the core \ndiameters (provided by the manufacturers), were measured using an optical microscope that had an \nimage shearing facility. \n \nFigure 2 \n \nLoading fixture used to apply uniform transverse strain to HiBi FBG sensors. \n \n \nFigure 3 \n \nSchematic of the interrogation system. SLD: super luminescent diode; FFP-TF: scanning HiBi fibre \ncoupled Fabry-Perot tunable filter; PS: fibre polarisation splitter; DAQ: data acquisition. \n \n \n \n \n \n 18\nFigure 4 \n \nComparison of the maximum and minimum sensitivities to transverse strain for FBGs in the \nelliptical core and clad fibre. ♦: Elliptical clad slow axis; : elliptical clad fast axis; : elliptical \ncore slow axis;×: elliptical core fast axis. \n \nFigure 5 \n \nComparison of the maximum and minimum sensitivities to transverse strain for FBGs in the stress \nrod induced HiBi fibres i.e. Panda and TruePhase fibres.♦: Panda slow axis; : Panda fast axis; : \nTruePhase slow axis;×: TruePhase fast axis. \n \nFigure 6 \n \nComparison of the maximum and minimum sensitivities to transverse strain for FBGs in Bow tie \n(stress induced) and D-clad (geometric induced) HiBi fibres.♦: Bow tie slow axis; : Bow tie fast \naxis; : D-clad slow axis;×: D-clad fast axis. \n \nFigure 7 \n \nTransverse strain sensitivity plotted against angle of rotation for FBG sensors in bow tie fibre. \n \nFigure 8 \n \nTransverse strain sensitivity plotted against angle of rotation for FBG sensors in elliptical clad fibre. \n 19\nFigure 9 \n \nTransverse strain sensitivity plotted against angle of rotation for FBG sensors in Panda fibre. \n \n \nFigure 10 \n \nTemperature response of the D - clad fibre. : Fast axis; : slow axis. \n \nFigure 11 \n \nTemperature response of the elliptical core fibre. : Fast axis; : slow axis. \n \nFigure 12 \n \nTemperature response of the TruePhase fibre. : Fast axis; : slow axis. \n \nFigure 13 \n \nTemperature response of the Panda fibre. : Fast axis; : slow axis. \n \nFigure 14 \n \nTemperature response of the Bow tie fibre. : Fast axis; : slow axis. \n \n 20\nFigure 15 \n \nTemperature response of the elliptical clad fibre. : Fast axis; : slow axis. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 21\nTABLE CAPTIONS \n \nTable 1 \n \nHiBi fibres investigated. \n \n \nTable 2 \n \nParameters of the HiBi fibres investigated. \n \nTable 3 \n \nSlow and fast axis wavelength separation of FBGs fabricated in different types of HiBi fibre. \n \nTable 4 \n \nMaximum and minimum transverse load sensitivities of different HiBi FBG sensors for (a) slow \nand (b) fast axis. \n \nTable 5 \n \nThe sensitivities of different HiBi FBG sensors to temperature in the slow and fast axes of the fibre. \n \n \n \n 22\nFIGURE 1 \n \n \n \n \n \n \n \n \n                                       SAP \n(a) \n \n \n \n \n \n \n \n(b) \n \n \n \n \n \n \n \n(c) \n \n \n \n \n \n \n \n(d) \n \n \n \n \n \n \n \n(e) \n \n \n \n \n \n \n \n(f) \n \n \n \n \n \n \n Slow axis \nFast axis \n20 \n36 \n10 11 8\n24 \n41 \n17 125 \n5 \n7.5 \n \n5 \n7.5 6\n22 \n53 \n 23\nFIGURE 2 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nLoad applied by rotating screw Load button \nLoadGlass plates\nSupport fibre Test fibre \n 24\nFIGURE 3 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nSLD HiBi Fibre coupler FBGs \nRef. FBG \nDAQ box \nPC and \nDAQ card \nPS \nFFP-TF \nDetectors \n 25\nFIGURE 4 \n \n \n \n-0.2\n0\n0.2\n0.4\n0.6\n0.8\n1\n0 1.5 3 4.5\nLoad [N\/mm]\nW\nav\nel\nen\ngt\nh \nsh\nift\n [n\nm\n]\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 26\nFIGURE 5 \n \n \n0\n0.2\n0.4\n0.6\n0.8\n0 1.5 3 4.5\nLoad [N\/mm]\nW\nav\nel\nen\ngt\nh \nsh\nift\n [n\nm\n]\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 27\nFIGURE 6 \n \n \n-0.1\n0.1\n0.3\n0.5\n0.7\n0.9\n0 1.5 3 4.5\nLoad [N\/mm]\nW\nav\nel\nen\ngt\nh \nsh\nift\n [n\nm\n]\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 28\nFIGURE 7 \n \n \n-0.1\n-0.05\n0\n0.05\n0.1\n0.15\n0.2\n0 30 60 90 120 150 180\nAngle [0]\nSe\nns\niti\nvi\nty\n [n\nm\n\/(N\n\/m\nm\n)]\n \n \n \n \n \n \n \n \n \n \n \n \n \nSlow \nFast \n 29\nFIGURE 8 \n \n \n-0.15\n-0.05\n0.05\n0.15\n0.25\n0 30 60 90 120 150 180\nAngle [0]\nSe\nns\niti\nvi\nty\n [n\nm\n\/(N\n\/m\nm\n)]\n \n \n \n \n \n \n \n \n \n \n \n \nSlow\nFast \n 30\nFIGURE 9 \n \n \n-0.05\n0\n0.05\n0.1\n0.15\n0.2\n0 30 60 90 120 150 180\nAngle [0]\nSe\nns\niti\nvi\nty\n [n\nm\n\/(N\n\/m\nm\n)]\n \n \n \n \n \n \n \n \n \n \n \n \n \nSlow \nFast \n 31\nFIGURE 10 \n \n \n0\n0.25\n0.5\n0.75\n1\n1.25\n1.5\n25 45 65 85 105 125 145 165\nTemperature [0C]\nW\nav\nel\nen\ngt\nh \nsh\nift\n [n\nm\n]\n \n \n \n \n \n \n \n \n \n \n \n \n 32\nFIGURE 11 \n \n \n0\n0.2\n0.4\n0.6\n0.8\n1\n1.2\n1.4\n1.6\n1.8\n2\n20 40 60 80 100 120 140 160\nTemperature [0C]\nW\nav\nel\nen\ngt\nh \nsh\nift\n [n\nm\n]\n \n \n \n \n \n \n \n \n \n \n \n \n 33\nFIGURE 12 \n \n \n0\n0.2\n0.4\n0.6\n0.8\n1\n1.2\n1.4\n1.6\n1.8\n2\n20 40 60 80 100 120 140 160\nTemperature [0C]\nW\nav\nel\nen\ngt\nh \nsh\nift\n [n\nm\n]\n \n \n \n \n \n \n \n \n \n \n \n \n 34\nFIGURE 13 \n \n \n0\n0.25\n0.5\n0.75\n1\n1.25\n1.5\n1.75\n2\n2.25\n20 40 60 80 100 120 140 160\nTemperature [0C]\nW\nav\nel\nen\ngt\nh \nsh\nift\n [n\nm\n]\n \n \n \n \n \n \n \n \n \n \n \n \n 35\nFIGURE 14 \n \n \n0\n0.2\n0.4\n0.6\n0.8\n1\n1.2\n1.4\n1.6\n1.8\n2\n20 40 60 80 100 120 140 160\nTemperature [0C]\nW\nav\nel\nen\ngt\nh \nsh\nift\n [n\nm\n]\n \n \n \n \n \n \n \n \n \n \n \n \n 36\nFIGURE 15 \n \n \n0\n0.2\n0.4\n0.6\n0.8\n1\n1.2\n1.4\n1.6\n1.8\n2\n20 40 60 80 100 120 140 160\nTemperature [0C]\nW\nav\nel\nen\ngt\nh \nsh\nift\n [n\nm\n]\n \n \n \n \n \n \n \n \n \n \n \n \n 37\nTABLE 1 \n \n \nFibre Type Type No. Manufacturer \nD - clad 205170-1550D-5 KVH [30] \nElliptical core 205170-1060S KVH \nTruePhase BF 06734-01 OFS Fitel [31] \nPanda SM.15-P Fujikura [32] \nBow tie HB1500 Fibercore [21] \nElliptical clad Fs.pm.7811 3M [20] \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 38\nTABLE 2 \n \n \nFibre Type Cut-off wavelength\/nm Cladding diameter\/μm \nD - clad 1320 125 \nElliptical core 1320 125 \nTruePhase 1470 125 \nPanda 1330 125 \nBow tie 1275 125 \nElliptical clad 1520 80 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 39\nTABLE 3 \n \n \nFibre Type Nominal Bragg \nWavelength\/nm \nMeasured peak \nseparation\/nm \nD - clad 1556 0.60 ± 0.01 \nElliptical core 1550 0.51 ± 0.01 \nTruePhase 1551 0.56 ± 0.01 \nPanda 1547 0.34 ± 0.01 \nBow tie 1549 0.35 ± 0.01 \nElliptical clad 1551 0.54 ± 0.01 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 40\nTABLE 4 \n \n \nFibre Type Slow Axis Sensitivity [nm\/(N\/mm)] \nMinimum                                     Maximum \nD - clad -0.030 ± 0.008 0.18 ± 0.02 \nElliptical core -0.011 ± 0.008 0.12 ± 0.01 \nTruePhase -0.038 ± 0.009 0.15 ± 0.02 \nPanda -0.035 ± 0.008 0.14 ± 0.01 \nBow tie -0.063 ± 0.008 0.18 ± 0.02 \nElliptical clad -0.092 ± 0.008 0.23 ± 0.02 \n(a) \n \nFibre Type Fast Axis Sensitivity [nm\/(N\/mm)] \nMinimum                                      Maximum \nD - clad 0.061 ± 0.009 0.12 ± 0.03 \nElliptical core -0.020 ± 0.008 0.12 ± 0.01 \nTruePhase 0.030 ± 0.009 0.082 ± 0.009 \nPanda 0.014 ± 0.007 0.14 ± 0.01 \nBow tie 0.020 ± 0.008 0.098 ± 0.008 \nElliptical clad 0.011 ± 0.008 0.17 ± 0.01 \n(b) \n \n \n \n \n \n \n \n \n \n \n \n 41\nTABLE 5 \n \n \nFibre type Slow Axis sensitivity [pm\/0C] Fast Axis sensitivity [pm\/0C] \nD - clad 11.5 ± 0.1 11.4 ± 0.1 \nElliptical core 14.2 ± 0.1 14.5 ± 0.1 \nTruePhase 14.5 ± 0.1 14.9 ± 0.1 \nPanda 15.6 ± 0.1 16.5 ± 0.1 \nBow tie 15.0 ± 0.1 15.7 ± 0.1 \nElliptical clad 14.5 ± 0.1 15.6 ± 0.1 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"}