{"doi":"10.1016\/S1350-4487(02)00187-7","coreId":"66025","oai":"oai:dro.dur.ac.uk.OAI2:3681","identifiers":["oai:dro.dur.ac.uk.OAI2:3681","10.1016\/S1350-4487(02)00187-7"],"title":"Spatially-resolved measurement of optically stimulated luminescence and time-resolved luminescence.","authors":["Bailiff, I. K.","Mikhailik, V. B."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-04-01","abstract":"Spatially-resolved measurements of optically stimulated luminescence (OSL) were performed using a two-dimensional scanning system designed for use with planar samples. The scanning system employs a focused laser beam to stimulate a selected area of the sample, which is moved under the beam by a motorised stage. Exposure of the sample is controlled by an electronic shutter. Mapping of the distribution of OSL using a continuous wave laser source was obtained with sub-millimeter resolution for samples of sliced brick, synthetic single crystal quartz, concrete and dental ceramic. These revealed sporadic emission in the case of brick or concrete and significant spatial variation of emission for quartz and dental ceramic slices. Determinations of absorbed dose were performed for quartz grains within a slice of modern brick. Reconfiguration of the scanner with a pulsed laser source enabled quartz and feldspathic minerals within a ceramic sample to be differentiated using a single stimulation wavelength by measuring the time-resolved luminescence spectrum","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66025.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/3681\/1\/3681.pdf","pdfHashValue":"9cc2bc781c19e75a5776e9ae53d1b61e7815d23f","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:3681<\/identifier><datestamp>\n      2011-08-30T08:21:58Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Spatially-resolved measurement of optically stimulated luminescence and time-resolved luminescence.<\/dc:title><dc:creator>\n        Bailiff, I. K.<\/dc:creator><dc:creator>\n        Mikhailik, V. B.<\/dc:creator><dc:description>\n        Spatially-resolved measurements of optically stimulated luminescence (OSL) were performed using a two-dimensional scanning system designed for use with planar samples. The scanning system employs a focused laser beam to stimulate a selected area of the sample, which is moved under the beam by a motorised stage. Exposure of the sample is controlled by an electronic shutter. Mapping of the distribution of OSL using a continuous wave laser source was obtained with sub-millimeter resolution for samples of sliced brick, synthetic single crystal quartz, concrete and dental ceramic. These revealed sporadic emission in the case of brick or concrete and significant spatial variation of emission for quartz and dental ceramic slices. Determinations of absorbed dose were performed for quartz grains within a slice of modern brick. Reconfiguration of the scanner with a pulsed laser source enabled quartz and feldspathic minerals within a ceramic sample to be differentiated using a single stimulation wavelength by measuring the time-resolved luminescence spectrum. <\/dc:description><dc:subject>\n        Optically stimulated luminescence<\/dc:subject><dc:subject>\n         Spatially-resolved OSL<\/dc:subject><dc:subject>\n         Time-resolved luminescence<\/dc:subject><dc:subject>\n         Retrospective dosimetry<\/dc:subject><dc:subject>\n         Polymineral samples.<\/dc:subject><dc:publisher>\n        Elsevier<\/dc:publisher><dc:source>\n        Radiation measurements, 2003, Vol.37(2), pp.151-159 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2003-04-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:3681<\/dc:identifier><dc:identifier>\n        issn:1350-4487<\/dc:identifier><dc:identifier>\n        doi:10.1016\/S1350-4487(02)00187-7<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3681\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1016\/S1350-4487(02)00187-7<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3681\/1\/3681.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["1350-4487","issn:1350-4487"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2003,"topics":["Optically stimulated luminescence","Spatially-resolved OSL","Time-resolved luminescence","Retrospective dosimetry","Polymineral samples."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n14 April 2009\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nBailiff, I. K. and Mikhailik, V. B. (2003) ’Spatially-resolved measurement of optically stimulated luminescence\nand time-resolved luminescence.’, Radiation measurements., 37 (2). pp. 151-159.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1016\/S1350-4487(02)00187-7\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n \n \n \nDurham Research Online \n \nDeposited in DRO: \n14 April 2009 \n \nVersion of attached file: \nAccepted for publication \n \nPeer-review status of attached file: \nPeer-reviewed \n \nCitation for published item: \nBailiff, I. K. and Mikhailik, V. B. (2003) 'Spatially-resolved measurement of optically \nstimulated luminescence and time-resolved luminescence.', Radiation \nmeasurements., 37 (2). pp. 151-159. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1016\/S1350-4487(02)00187-7 \n \n \n \n \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \n \nSpatially-resolved measurement of optically stimulated luminescence and time-resolved \nluminescence \n \nI.K.Bailiff* and V.B.Mikhailik \n \nLuminescence Dosimetry Laboratory, Environmental Research Centre, Dawson Building, \nUniversity of Durham, South Road,  \nDurham DH1 3LE, UK \n \nAbstract \n \nSpatially-resolved measurements of optically stimulated luminescence (OSL) were \nperformed using a two dimensional scanning system designed for use with planar samples. \nThe scanning system employs a focused laser beam to stimulate a selected area of the sample, \nwhich is moved under the beam by a motorised stage. Exposure of the sample is controlled by \nan electronic shutter.  Mapping of the distribution of OSL using a CW laser source was \nobtained with sub-millimeter resolution for samples of sliced brick, synthetic single crystal \nquartz, concrete and dental ceramic. These revealed sporadic emission in the case of brick or \nconcrete and significant spatial variation of emission for quartz and dental ceramic slices.  \nDeterminations of absorbed dose were performed for quartz grains within a slice of modern \nbrick. Reconfiguration of the scanner with a pulsed laser source enabled quartz and \nfeldspathic minerals within a ceramic sample to be differentiated using a single stimulation \nwavelength by measuring the time-resolved luminescence spectrum.  \n \nKeywords: optically stimulated luminescence, spatially-resolved OSL, time-resolved \nluminescence, retrospective dosimetry, polymineral samples \n \n \n \n*Corresponding author: \ne-mail: Ian.Bailiff@durham.ac.uk, fax: 44-0191-374-3619; phone: 44-0191-374-3624  \n 2\nAcknowledgements \nThe work described in this paper was supported by the University of Durham and the \nEuropean Commission within its 5th Framework Programme (1998-2002), Nuclear Fission \nand Radiation Protection, under Contract N° FIGD-CT-2000-00094. The latter is a \ncollaborative project with: Ciemat, Madrid, GSF Neuherberg, Risø National Laboratory and \nthe University of Helsinki. Earlier financial support by the NERC (grantss GR3\/9568 and \nGST\/02\/0756) for development of a prototype scanning system is also acknowledged. We are \ngrateful to Dr. R. Clark for programming, Dr. S. Chyriwsky for assistance in developing the \nprototype scanner and Mr. S. Grainger for technical assistance in sample preparation. We are \ngrateful to Landauer Inc. for donation of Al2O3:C dosemeter powder. \n \n 3\n1. Introduction \nThe determination of absorbed dose by measurement of the integrated luminescence, \nstimulated either thermally or optically, forms the basis of the commonly used techniques in \nluminescence dating and dosimetry. The success of such determinations is critically \ndependent on the ability of the mineral stimulated to yield sufficient luminescence, and it is \nwell known that the sensitivity of minerals found in typical samples may vary by orders of \nmagnitude between not only different mineral types but also the same mineral (e.g. quartz). \nThis is in contrast to synthetic luminescent phosphors, such as those used for dosimetry and \nimaging, that are manufactured to be homogeneous. In the case of the latter, for example, \nstorage phosphors on image plate detectors are used to determine the spatial distribution of \nionising radiation (Thoms and von Seggern, 1996). In dating and retrospective dosimetry \nstudies, typical samples are likely to contain a heterogeneous distribution of minerals \npossessing different sensitivity and dose histories, and the latter presents particular difficulties \nin the case of unheated sediments. The separation and isolation of a particular mineral \ncomponent for luminescence measurements, which requires the fragmentation of the sample \nmatrix, has consequently formed a key part of the development of routine techniques for \nabsorbed dose determination. The use of spatially-resolved detectors has revealed that \nvariations between grains of the same mineral type commonly occur due to differing \nsensitivity (heated and sediment samples) and differing dose histories (sediment samples), and \nboth can lead to complications in absorbed dose evaluation.  Several different forms of \ndetection system capable of spatially-resolved measurement of either optically or thermally \nstimulated luminescence have been reported in the literature, including: image intensifiers \n(Templer and Walton, 1983; Huntley and Kirkey, 1985), photographic films (Hashimoto et \nal., 1989; Hashimoto et al., 1995), imaging photon detectors (Smith et al., 1991; McFee and \nTite, 1994) and CCD-cameras (e.g. Hashimoto et al., 1995, Duller et al., 1997; Spooner, \n2000; Greilich et al., 2002). Although the latest CCD-cameras are claimed to offer high \n 4\nspatial resolution (~10 μm), wide spectral sensitivity and high quantum efficiency, the overall \nsensitivity of these systems still appears to be inferior to PMT-based readers. This is largely \ndue to a lower signal-to-noise ratio and the reported levels of minimal detectable absorbed \ndose are several Gy for samples of K-feldspar (grains, Duller et al., 1997; slices, Greilich et \nal., 2002).  \n \nAnother approach that can be used to perform spatially-resolved measurement of OSL is \nbased on the use of a focused laser beam to stimulate a selected area of sample and to detect \nthe luminescence using a single PMT. By moving the beam across the sample or by moving a \nsample under a fixed beam, executing a scanning action, spatially-resolved measurement of \nthe luminescence can be performed by appropriate control of the photon detection system.  \nThis approach was applied to measure optically stimulated luminescence (OSL) from storage \nphosphor plates used in radiographic systems (Blasse and Grabmaier, 1994), and a one-\ndimensional OSL scanning system was used by Bøtter-Jensen et al. (1995) to record depth-\ndose profiles in ceramic materials. The development of a two dimensional OSL scanning \nsystem for use with planar ceramic samples was demonstrated by Bailiff et al. (1996), and \nsimilar elements of this approach were employed by Duller et al. (1999; 2000) in the \ndevelopment of an automated scanning system. The latter enables OSL measurements to be \nperformed with separated single-grains, where the laser beam is moved discretely to each \ngrain in a 9×9 location grid. In this paper we describe a two-dimensional scanning system that \nis based on the prototype (Bailiff et al. loc. cit) and which can perform measurement of the \nOSL signal from slices (and grains) with a sub-millimeter resolution. The scanner has been \nconfigured to map the distribution of OSL and to perform in situ determinations of absorbed \ndose for grains within a sample matrix (e.g. a ceramic slice). The scanner is used with either a \n 5\ncontinuous wave (CW) or a pulsed laser stimulation source, the latter being used to \ninvestigate the mineral type by measuring time-resolved luminescence (TRL). \n \n2. Instrumentation  \nA schematic diagram of the OSL scanner is shown in Fig. 1; the assembly is contained within \na light-tight housing.  The central component of the apparatus comprises a motorized X-Y \nstage (Physik Instrumente type C-832) on which a sample mount is located. The laser beam is \ndirected onto the sample surface at angle of approximately 45º after passing through an \nelectronically controlled shutter, a cut-off filter (to eliminate residual emission of laser pump \nradiation), neutral density filters selected to vary the stimulation intensity, a long-focus lens, \nand finally a front-surfaced mirror. The detection system, mounted 30 mm directly above the \nsample, comprises a PMT and optical filter system. The beam geometry was adjusted to \nprevent the reflected beam striking the detector. The specification of the detection system \ndiffers when using either the CW or pulsed laser sources and these are discussed further \nbelow. The sample is moved under the path of the beam in a stepwise manner under the PC \ncontrol; after each increment the shutter is opened for a selected stimulation period (e.g. 200 \nms) and the OSL recorded. In terms of scan images presented below the scan starts at the \norigin and proceeds in a raster pattern finishing at the top right corner of the image. Unless \nspecified otherwise, an increment of 250 μm was selected for the measurements described in \nthis paper, resulting in 1600 measurement points per complete scan. Once started, a scan is \nperformed under software control and takes about 30 mins to complete, most of the time \nbeing required for stage movement (~1 s per increment).  \n \nDepending on the nature of the experiment, CW or pulsed laser stimulation was used. The \nconstant intensity source comprised a CW Ar-ion laser (Reliant 250D, Laser Physics), \n 6\noperated in multi-lines mode. When using this source the detection system comprised an EMI \n9635QA PMT and Schott U-340 filters (6 mm), and the signal was fed to an Ortec ACE-\nMCS. Pulsed stimulation was provided by a tuneable optical parametric oscillator (Quanta \nRay MOPO 710) pumped by a Q-switched YAG:Nd laser. The luminescence detection \nsystem is a further development of that described by Clark et al. (1997) and includes a fast \nPMT (EMI 9813QA) and a 2 ns resolution multi-channel scaler (Fast Comtec P7885) that \nenables the measurement of time-resolved luminescence. Two stimulation wavelengths were \nused with the pulsed source, either 500 or 850 nm, and the TRL was recorded using Schott U-\n340 (6 mm) and Schott BG-39 (3 mm) filters in the detection system respectively. \n \nThe optical system focuses the laser beam to a spot, the size of which is adjusted to suit the \nexperiment and measured by use of a photodiode detector and a 50 μm-slit translated across \nthe focal plane. Using the CW source, the beam diameter was adjusted to 250 μm and the \nincident power density set to either 1.5 or 3.6 W cm-2 using appropriate neutral density filters. \nThe lower intensity was used to ‘scan’ the general OSL distribution with reduced trapped \ncharge depletion. \n \nTo obtain precise sample re-positioning, samples (either sliced or granular) were fastened to \nmachined metal plates. Good positioning accuracy of these plates was achieved using an \nadapted spring-loaded corner positioning stage originally manufactured for an optical \nmicroscope; positioning tests showed that the maximum deviation in positioning was about 30 \nμm. This was considered satisfactory given that the spatial resolution of the system is mainly \ndetermined by the beam diameter (set at 250 μm). Repeated experiments, which included \nseveral sample changes followed by scanning, showed no detectable lateral shift of the OSL \nimage.   \n 7\n \nThe control software allows the stage to move to a selected position within the scanned area \nso that an OSL decay curve can be recorded; this facility was employed when measuring CW \nOSL decay curves and the TRL spectra. A high precision diamond impregnated cutting wheel \nwas used to produce slices of known and reproducible thickness (generally less than 1 mm). \nAbsorbed doses were administered to samples using a beta irradiator containing a 90Sr\/90Y  β \nsource, that had been previously calibrated against a 137Cs photon source for granular samples \n(Göksu et al., 1995); a further calibration experiment was performed to determine the \nabsorbed dose for sliced ceramic samples. The dose-rate delivered by the laboratory source to \n1 mm thick ceramic slices mounted on stainless-steel discs was 0.95 ±0.02 Gy min-1. \n \n3. Applications  \n \n3.1. OSL mapping  \nTo illustrate the use of the equipment we include the results of measurements with ceramic \nsamples (bricks) collected for retrospective dosimetry measurements, where the levels of \nabsorbed dose are typically up to several hundred mGy. Examples of other heated and \nunheated materials, including annealed single crystal quartz, were also tested since the range \nof potential use clearly extends beyond ceramics. For the selection of brick samples tested so \nfar and using standard OSL measurement procedures, the detected OSL was found in all cases \nto be concentrated in a few localised ‘spots’ within the 10 x 10 mm scanned areas, and the \nremainder of the cut surface yielded signals that were not significantly above the detector \nbackground. In the example shown in Fig. 2 OSL decay curves were only measurable at the \n‘spots’ labelled A, and B the decay curves for which are shown in insets a and b. Subsequent \nexamination of the slices under an optical microscope confirmed that the low number of \n 8\nemitting spots was not due to a paucity of granular quartz or infrequent exposure of grains at \nthe cut surface.  These observations are consistent with past (Huntley and Kirkey, 1985) and \nrecent findings (e.g. Duller et al., 2000) that have revealed significant variations in the \nsensitivity of single grains for different types of sedimentary quartz.  \n \nCementitious materials are also potentially useful for the retrospective dosimetry (Göksu et \nal., 2002). An OSL scan performed with a slice of modern concrete (Fig. 3) reveals a very \nirregular distribution of OSL and the dynamic range of the detected signal is significantly \nhigher than that found with brick. The dynamic range is due to the geological dose associated \nwith the blend of minerals contained in the matrix; unfortunately the hydrated cement yields \ncomparatively weak luminescence (Göksu et al., 2002). Although differences in the rate of \ndecay are likely to occur due to variations in the optical conditions within grains, the OSL \ndecay curves show differences (Fig. 3, insets a and b) that may reflect mineral type \n(McKeever et al., 1997), curves a and b being indicative of feldspar and quartz respectively. \nWhile tentative identification of the mineral species may be feasible based on decay rates, \ntime resolved measurements can provide a more specific marker, as discussed at a later stage \nin this paper. \n \nDental porcelain, a ceramic of semi-vitreous composition that is of interest in retrospective \ndosimetry (Bailiff et al., 2002a), was also examined.  The measurement of spatially resolved \nOSL is of interest since it potentially offers the opportunity to select a particular mineral \nphase, if required, and also to measure a depth-dose profile where external beta particles and \nsoft x-rays contribute to the external dose.  Fig. 4 shows the spatial variation of the OSL for \ntwo slices of prosthetic tooth (i.e. solid dental porcelain) that were cut perpendicular to the \nmain axis of the tooth, providing a horizontal cross section, measured immediately following \n 9\nthe administration of a beta dose and pre-heating. It is interesting to note that the OSL \nintensity decreases rapidly moving from the tooth core to the surface. Although there is a \nslight drop in beta dose with distance from the central axis, this is not attributed to the radial \ndependence of source dose rate. When originally calibrated, our source produced results \nsimilar to those published recently by Spooner and Allsop (2000), with a difference between \ncentre and the edge of a 10 mm diameter sample of less than 10%.   The observed change in \nOSL intensity is likely to reflect changes in sample sensitivity and reflects a layered structure \nresulting from the manufacturing process. This will be of importance in the study of optical \nand athermal fading effects that are currently under investigation (Bailiff et al., 2002a). \n \nExperiments were undertaken to test the capability of the scanner to measure absorbed dose as \na function of depth in samples subjected to β- irradiation. The surface of a (thick) fragment of \ndomestic porcelain was irradiated using a beta source (estimated sub-surface beta dose, 3 Gy). \nThe fragment was subsequently cut in a direction perpendicular to the surface to provide a \nslice that extended from the surface glaze to the interior. The OSL map obtained for the slice \nis shown in Fig. 5 and, as found by Poolton et al. (1995), the OSL sensitivity of the glaze is \nsignificantly higher (attributed to the presence of Al2O3) than that of the interior matrix that \nappears to have negligible sensitivity. The OSL map from the glaze corresponds well to the \nspatial dimensions of the semi-transparent 250 μm thick glaze layer (Fig. 5). A similar \nexperiment was performed with a 6 mm thick cylindrical pellet (diameter 10 mm) that was \nfabricated by combining granular Al2O3:C (Landauer Inc., 90-150 μm) with a setting binder. \nThe pellet was irradiated using the laboratory β-source, delivering an absorbed dose of \napproximately 800 mGy in the sub-surface material. Slices were cut from the pellet along the \naxis of the cylinder to enable the depth-dose profile to be measured. The recorded distribution \nof the OSL (Fig. 6) shows a steep build-up at the edge and gradual decline to background \n 10\nlevels at about 4 mm below the surface. The general form of the OSL profile agrees well with \nthat expected by calculation (Attix, 1986) and is consistent with a penetration depth of 3.8 \nmm estimated for β−particles in Al2O3 using the continuous slowing down approximation \nrange (CSDA range, 1.51 g cm-2; ICRU Report, 1984). Further calculation of the dose profile \nbased on Monte Carlo simulation of electron transport is to be performed to enable a \nquantitative comparison of profiles to be obtained.  \n \nAn OSL scanning system of the type described here, when compared with a spatially-resolved \ndetector system that employs uniform stimulation across the sample, is expected to be at a \ndisadvantage when measuring transparent or semi-transparent samples. The effects of optical \nscattering may reduce the effective spatial resolution of scanning due to the stimulation of a \nvolume within which many single grains may be located. In this respect, the opacity of a clay-\nbased ceramic matrix provides an important reduction in the level of light scattering between \ngrains. Although a quantitative test to evaluate the extent of these effects in transparent slices \nhas yet to be performed, we examined slices of synthetic quartz to explore the distribution of \nOSL. Slices of 1 mm thickness were cut (orthogonal to the z-axis) from a single bar of \nsynthetic quartz (Sawyer Premium Q grade; see Petrov and Bailiff, 1995), polished and \nannealed at 1000 °C in air. The OSL map obtained with a beta-irradiated slice is shown in \nFig. 7a and b. The distribution of OSL is very inhomogeneous, containing identifiable areas \nthat emit relatively bright luminescence, and with a dynamic range of intensity that extends to \nan order of magnitude within the scanned area. Apart from the issue of spatial resolution \nachieved, the data indicate that the traps are spatially localized on a macroscopic scale, \nprobably reflecting features of crystal formation during hydrothermal growth. Similar spatial \nvariation in the TL and OSL in quartz was reported by Hashimoto et al. (1997) who attributed \nthe striped patterns to the anisotropy of impurity distribution.  Such data suggest that in the \n 11\ncase of sedimentary quartz, the cause of significant variability of the OSL intensity of single \ngrains is related to growth conditions of the progenitor single crystals, although the effects of \nheat treatment is a further factor to take into account in the case of quartz extracted from \nheated materials. \n \n3.2. Dose reconstruction \nHaving established the feasibility of obtaining an OSL map and measuring OSL decay curves \nat specific locations in sliced ceramic, the spatially-resolved determination of absorbed dose \nwas investigated.  This was performed with slices in two stages by: i) scanning, using low \npower and short duration stimulation, to produce an OSL map and identify the location of \n‘spots’ emitting sufficient luminescence; ii) application of a regeneration procedure to \ndetermine the absorbed dose at the spots identified in the mapping. The loss of trapped charge \ndue to depletion during the mapping process was corrected using of the form of the decay \ncurve measured in the second stage and taking into account the differences in the intensity of \nthe stimulation beam. In samples tested so far, the correction for depletion due to the scanning \nprocedure is in the range 5-7%, but this is likely to vary between types of ceramic sample. \nThe reliability of this correction was tested by administering a beta dose of 350 mGy to an \noptically bleached slice, performing a scan to obtain the OSL map, and then determining the \n‘recovered’ dose using a regenerative procedure at the known luminescent spot(s). The \nrecovered value of absorbed dose was 325±35 mGy which corresponds to an average \ndepletion of 7% due to the scan procedure, and this agrees well with the estimate of 6±1 % \nbased on examination of the form of the OSL decay curve for the measurement location.  \n \nThe dose evaluation procedure was tested with slices cut from a 28 year-old brick that had \nbeen obtained from a Russian settlement contaminated by Chernobyl fallout. A sample from \n 12\nthe same brick had been previously examined in detail to obtain absorbed dose determinations \nwith separated coarse grains (Bailiff et al., 2000, 2002b). Since no acid etching treatments \nwere applied to the cut surface, any grains exposed by the cutting process retained an alpha \ndose contribution. Subsequent inspection under a microscope indicated that the exposed \ngrains were generally free of coatings, although other types of ceramic may require some \nform of cleaning treatment to improve the brightness of the luminescence. \n \nOSL maps for slices were obtained and the location of spots exhibiting sufficiently bright \nluminescence identified; a representative example is given in Fig. 8. In a subsequent \nexperiment, the OSL from these areas was confirmed to be due to quartz by examination of \nthe time-resolved luminescence spectrum (see below). Using a regenerative procedure, values \nof absorbed dose of 334±34, 357±27 and 330±22 mGy were obtained (uncertainties are \nprecision only) for the three different spots indicated, yielding an average value of 340±15 \nmGy (s.d. 3). An upper limit of 15 mGy was estimated for the alpha dose contribution using \ntypical parameter values (a=0.1; 125 μm grain dia.; 20 μm penetration) and measured dose-\nrates. After subtraction of the alpha dose contribution, the in-situ grain result is encouragingly \nclose to the consensus value of 325±15 mGy obtained using a multiple-grain procedure with \nquartz extracted from the equivalent depth range in the same brick (Bailiff et al., 2002b). The \nclose agreement in this case may be fortuitous given the precision obtained using a simplified \nregeneration procedure, but it nonetheless points to the feasibility of the in-situ grain approach \nwith sliced ceramics, albeit with their sparse occurrence in the particular samples tested. \n \n3.3. Time resolved measurement  \nAlthough, as discussed above, an indication of mineral type can be inferred by the form of the \nOSL decay curve or by stimulation with IR radiation (to identify feldspars), it can also be \n 13\nobtained by examination of the TRL spectrum. Whereas the TRL associated with quartz and \ndetected in the UV region is dominated by a decay component with a lifetime of 30-40 μs \n(Bailiff, 2000), different types of feldspars exhibit complex decay spectra that have \ncomponent lifetimes of less than 1 μs (Clark et al., 1997; Clark and Bailiff, 1998) and this \ndifference provides a means of differentiating the two mineral species.   \n \nThis approach was used to investigate the mineral composition of brick that had been \ncollected from the Chernobyl and Semipalatinsk regions. Powder XRD spectra indicated that \nthe former contained predominantly quartz and the latter a mixture of quartz and feldspar. A \nslice of the brick from the Semipalatinsk region was first scanned using 850 nm pulsed \nradiation and the OSL map, obtained by measuring the integrated luminescence, contains \nseveral distinctive spots of emission (labelled A-C), as shown in Fig. 9a. The TRL spectra \nobtained at these locations (Fig. 10) are characteristic of feldspathic minerals, having a \ndominant decay component with a lifetime in the range 2- 5 μs (Clark et al., 1997). The OSL \nmap obtained after a second scan, performed using 500 nm stimulation; and shown in Fig 9b \nincludes spots A and B identified under 850 nm stimulation and an additional strongly \nemitting spot D. The TRL spectra for locations A and B were similar in form (the intensity \nwas reduced during the second scan); analysis of the spectrum recorded at location B (Fig 9b) \nindicates two lifetime components of ~ 0.5 μs (dominant) and ~2 μs and this is consistent \nwith the behaviour observed with potassic feldspars when stimulating with IR and changing \nthe detection window from broad band to the UV (Clark and Bailiff, 1998).  This evidence, \ncombined with the measurement of TRL under both IR and visible stimulation at the same \nlocation, strongly suggests that the emitting minerals are feldspathic. Several new brightly \nemitting spots were also resolved under green stimulation and their TRL spectra were found \nto be characteristic of quartz (dominated single component with mean lifetime ~33 μs), as \n 14\nshown by the TRL spectrum recorded at location D (Fig. 11) and is quite distinct from that \nmeasured at location B, attributed to a feldspathic mineral.  The slices of brick from the \nChernobyl region that were the subject of the absorbed dose measurements discussed above \nwere also examined using this approach and the areas used for absorbed dose determination \nwere confirmed to be quartz on the basis of their TRL spectra. \n \nAlthough confirmation of the mineral type (e.g. thin section or electron probe measurements) \nor detailed examination of the TRL spectra has not been attempted here, these results illustrate \nthe potential of the method for differentiating mineral components. While the ceramics \nexamined here are relatively simple in composition, this approach is a potentially powerful \nmeans of mapping the distribution of coarse grains of different mineral types. Moreover, if the \nstimulation source was confined to visible wavelengths only, it is possible to map both quartz \nand feldspar distribution by using a pulsed stimulation source and analysing the data in the \ntime domain. \n \n4. Conclusions \nThe results described in this paper demonstrate the capability of a scanning technique to \nperform mapping of OSL from minerals located in the exposed surface of cut specimens and \nto selectively stimulate areas to produce OSL decay curves. The ability to determine the \nabsorbed dose within a selected area of a ceramic surface provides an important advance for \nuse in retrospective dosimetry. While on one hand the occurrence of a small number of \nluminescing areas is a disadvantage in terms of spatial resolution of absorbed dose \ndeterminations, the brightness of the luminescing areas in the brick types tested allowed the \nmeasurement of absorbed doses as low as ~0.1 Gy in ‘spot’ locations.  When combined with \npulsed laser stimulation and a time-resolved detection technique, the system has the capability \n 15\nto differentiate between feldspar and quartz in mixed mineral samples using a single (visible) \nstimulation wavelength.  On the basis of previous TRL studies more sophisticated mineral \nidentification may be possible. Given the recent availability of compact pulsed laser sources \nand luminescence readers able to measure single grain ,wider access to measurements of this \ntype is now feasible.   \n \nAcknowledgements \nThe work described in this paper was supported by the University of Durham and the \nEuropean Commission within its 5th Framework Programme (1998-2002), Nuclear Fission \nand Radiation Protection, under Contract N° FIGD-CT-2000-00094. The latter is a \ncollaborative project with: Ciemat, Madrid, GSF Neuherberg, Risø National Laboratory and \nthe University of Helsinki. Earlier financial support by the NERC (grantss GR3\/9568 and \nGST\/02\/0756) for development of a prototype scanning system is also acknowledged. We are \ngrateful to Dr. R. Clark for programming, Dr. S. Chyriwsky for assistance in developing the \nprototype scanner and Mr. S. Grainger for technical assistance in sample preparation. We are \ngrateful to Landauer Inc. for donation of Al2O3:C dosemeter powder. \n \nReferences \nAttix, F.H., 1986. Introduction to Radiological Physics and Radiation Dosimetry.  Wiley \nInterscience Publication, New York. \nBailiff, I.K., Clark, R.J., Barnett, S.M., 1996. A high resolution scanning system for \nmeasurement spatially resolved optically stimulated luminescence. Abstract of 8th \nInternational Conference on Luminescence and Electron Spin Resonance Dating, Canberra \nAustralia.  \n 16\nBailiff, I.K., 2000. Characteristics of time-resolved luminescence in quartz. Radiation \nMeasurements 32, 401-405. \nBailiff, I.K., Bøtter-Jensen, L., Correcher, V., Delgado, A., Göksu, H.Y., Jungner, H., Petrov, \nS., 2000. Absorbed dose evaluations in retrospective dosimetry: methodological \ndevelopments using quartz. Radiation Measurements 32, 609-613. \nBailiff, I.K., Correcher, V., Delgado, A., Göksu, Y., Hübner, S., 2002a. Luminescence \ncharacteristics of dental ceramic for retrospective dosimetry – a preliminary study. Radiation \nProtection Dosimetry 101, 519-524. \nBailiff, I.K., Stepanenko, V.F., Göksu, H.Y. Balonov, M., Bøtter-Jensen, L., Chumak, V., \nCorrecher, V., Delgado, A., Golikov, S., Jungner, H., Likhtarev, I. Khamidova, L.G. \nKolizshenkov T.V.,  Meckbach, R., Petrov, S.A., Sholom, S., 2002b. Comparison of \nretrospective luminescence dosimetry with computational modelling in two highly \ncontaminated settlements downwind of the Chernobyl NPP. Health Physics (submitted). \nBlasse, G., Grabmaier, B.C., 1994. Luminescent Materials. Springer-Verlag, Berlin, \nHeidelberg. \nBøtter-Jensen, L., Jungner, H., Poolton, N.R.J., 1995. A continuous OSL scanning method for \nanalysis of radiation depth-dose profiles in bricks. Radiation Measurements 24, 525-529. \nClark, R.J., Bailiff, I.K., Tooley, M.J., 1997. A preliminary study of time-resolved \nluminescence in some feldspars. Radiation Measurements 27, 211-220. \nClark, R.J., Bailiff, I.K., 1998 Fast time-resolved luminescence emission spectroscopy in \nsome feldspars. Radiation Measurements 29, 553-560. \nDuller, G.A.T, Bøtter-Jensen, L., Markey, B.G., 1997. A luminescence imaging system based \non a charge coupled device (CCD) camera. Radiation Measurements 27, 91-99.  \n 17\nDuller, G.A.T, Bøtter-Jensen, L., Kohsiek, P., Murray, A.S., 1999. A high-sensitivity \noptically stimulated luminescence scanning system for measurement of single sand-sized \ngrains. Radiation Protection Dosimetry 84, 325-330. \nDuller, G.A.T, Bøtter-Jensen, L., Murray, A.S., 2000. Optical dating of single sand-sized \ngrains of quartz: sources of variability. Radiation Measurements 32, 453-457. \nGöksu, H.Y., Bailiff, I.K., Mikhailik, V.B., 2002. New approaches to retrospective dosimetry \nusing cementitious building materials. Radiation Measurements (submitted for publication). \nGöksu, H.Y., Bailiff, I.K., Bøtter–Jensen, L., Hutt, G., 1995. Interlaboratory beta source \ncalibration using TL and OSL on natural quartz. Radiation Measurements 24, 479-483.   \nGreilich, S., Glasmacher, U.A., Wagner, G.A., 2002. Spatially resolved detection of \nluminescence – a unique tool for archaeochronometry. Naturwissenschaften 89, 371-375. \nInternational Commission on Radiation Units and Measurements, 1984. Stopping Powers for \nElectrons and Positrons. ICRU Report 37. \nHashimoto, T., Yokosaka, K., Hubuki, H., Hayashi, Y., 1989. Provenance search of dune \nsands using thermoluminescence colour images (TLCIs) from quartz grains. Radiation \nMeasurements 16, 3-10. \nHashimoto, T., Notoya, S. Ojima T., Hoteida, M., 1995. Optically stimulated luminescence \n(OSL) and some other luminescence images from granite slices exposed with radiations, \nRadiation Measurements 24, 227-237. \nHashimoto, T., Katayama, H., Sakaue, H., Hase, H., Arimura, T., Ojima, T., 1997. \nDependence of some radiation induced phenomena from natural quartz on hydroxyl-impurity \ncontents. Radiation Measurements 27, 243-250.  \nHuntley, D.J., Kirkey, J.J., 1985. The use of an image intensifier to study the TL intensity \nvariability of individual grains. Ancient TL 3, 1-4.  \n 18\nMcFee, C.J., Tite, M.S., 1994. Investigations into the thermoluminescence properties of single \nquartz grains using an imaging photon detector. Radiation Measurements 23, 355-360. \nMcKeever, S.W.S., Bøtter-Jensen, L., Agersnap Larsen, N., Duller, G.A.T., 1997. \nTemperature dependence of OSL decay curves: experimental and theoretical aspects. \nRadiation Measurements 27, 161-170.  \nPetrov, S.A., Bailiff, I.K., 1995. The ‘110°C’ peak in synthetic quartz. Radiation \nMeasurements 24, 519-523.  \nPoolton, N.R.J., Bøtter-Jensen, L., Jungner, H., 1995. An optically stimulated luminescence \nstudy of porcelain related to radiation dosimetry. Radiation Measurements 24, 543-549. \nSmith, B.W., Wheeler, G.C.W.S., Rhodes, E.J., Spooner N.A., 1991. Luminescence dating of \nzircon using an imaging photon detector. Nuclear Tracks and Radiation Measurements 18, \n273-278. \nSpooner, N.A., 2000. A photon-counting imaging system (PCIS) for luminescence \napplications. Radiation Measurements 32, 513-521. \nSpooner, N.A., Allsop, A., 2000. The spatial variation of dose rate from 90Sr\/90Y beta sources \nfor use in luminescence dating. Radiation Measurements 32, 49-56. \nTempler, R., Walton, A., 1983. Image intensifier studies of TL in zircons. PACT 9, 299-308.  \nThoms, M., von Seggern, H., 1996. Radiographic imaging with image plates: The influence of \nthe readout intensity on the image quality. Journal of Applied Physics 81, 5887-5895. \n 19\nI.K.Bailiff and V.B.Mikhailik Spatially-resolved measurement of optically stimulated \nluminescence and time-resolved luminescence \nFigure captions  \n \nFig.1. Schematic representation of high-resolution scanning system for measurement of \nspatially-resolved optically stimulated luminescence. \nFig.2. OSL map from a slice of brick collected from the Chernobyl region and decay curves \nmeasured for specified spots (insets). The density scale represents the intensity of the OSL \nsignal detected for the image pixel.  \nFig.3. OSL map from a concrete slice and the decay curves measured for the specified spots \n(a and b).  \nFig.4. OSL maps of dental porcelain slices. Insets show OSL decay curves for specified spots. \nLaboratory dose is 8 Gy. \nFig.5. OSL map of a porcelain slice (cut perpendicular to the surface) and the OSL signal \nprofile. Laboratory dose is 3 Gy.  \nFig. 6. OSL map of a 1 mm thick Al2O3:C slice (cut perpendicular to irradiated surface) and \naverage profile of OSL intensity. Laboratory irradiation performed with a beta source (sub \nsurface dose ~ 0.8 Gy) was in the direction indicated by arrow. The step interval used was 100 \nμm.  \nFigure 7. Isometric (a) and contour (b) OSL intensity maps obtained with a slice of single \ncrystal quartz (Sawyer Premium ‘Q’). The sample was annealed at 1000°C and the dose \nadministered was 2 Gy. The outermost contour line shown in b) corresponds well with the \nphysical shape of the sample. \n 20\nFigure 8. OSL map of a brick slice and regenerative growth curves obtained for the specified \nspots (A-C). The accrued dose was estimated to be: 334±34 (A), 357±27  (B) and 330±22 \nmGy (C). Preheat to 200ºC at 2ºs-1. \nFigure 9. OSL maps of a brick slice (Semipalatinsk) obtained using pulsed laser stimulation: \n(a) stimulation 850 nm (detection filter, BG-39), (b) stimulation 500 nm (detection filter, U-\n340); the incremental step used was 400 μm. The laboratory dose administered was ~70 Gy. \nFigure 10. TRL spectra recorded for specified spots on the brick surface (see Fig. 9) using \npulsed infrared stimulation (850 nm) and BG-39 optical filter. Solid lines represent two-\nexponential fitting to the experimental data: A-τ1=1.5 μs, τ2=9.4 μs; B-τ1=2.0 μs, τ2=6.1 μs; \nC- τ1=1.4 μs, τ2=7.6 μs.  \nFigure 11. TRL spectra recorded for specified spots of the brick surface (see Fig. 9) using \npulsed 500 nm stimulation  (detection filter, U-340). Solid lines represent exponential fitting \nto the experimental data: D- τ1=33 μs, B- τ1=0.5 μs, τ2=2.1 μs.  \n 21\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nLens \nSample \nX-Y motorised \nstage \nLaser beam \nFilter \nShutter \nMirror Y-axis \nX-axis \nPMT\nFilter \n 22\n0 2 4 6 8 10\n0\n2\n4\n6\n8\n10\n 133.3  --  200.0\n 66.67  --  133.3\n 0  --  66.67\n 333.3  --  400.0\n 266.7  --  333.3\n 200.0  --  266.7\nB\nA\nDistance (mm)\nD\nis\nta\nnc\ne \n(m\nm\n)\n0 5 10 15 20 25\n0\n100\n200\n300\n400\n O\nS\nL \nin\nte\nns\nity\n (a\n.u\n.)\n Time (s)\n0 5 10 15 20 25\n0\n100\n200\n300\n400\n500\nb\na\n O\nS\nL \nin\nte\nns\nity\n (a\n.u\n.)\n Time (s)\n \n 23\n0 2 4 6 8 10\n0\n2\n4\n6\n8\n10\n 1.833E4  --  2.2E4\n 1.467E4  --  1.833E4\n 1.1E4  --  1.467E4\n 7333  --  1.1E4\n 3667  --  7333\n 0  --  3667\nB\nA\nDistance (mm)\nD\nis\nta\nnc\ne \n(m\nm\n)\n0 5 10 15 20 25\n0\n2000\n4000\n6000\n8000\n10000\n O\nSL\n in\nte\nns\nity\n (a\n.u\n.)\n Time (s)\n Time (s)\n O\nSL\n in\nte\nns\nity\n (a\n.u\n.)\nb\n0 5 10 15 20 25\n0\n200\n400\n600\n800\n1000\n1200\na\n \n \n 24\n0 2 4 6 8 10\n0\n2\n4\n6\n8\n10\n \n \n 437.5  --  500.0\n 375.0  --  437.5\n 312.5  --  375.0\n 250.0  --  312.5\n 187.5  --  250.0\n 125.0  --  187.5\n 62.50  --  125.0\n 0  --  62.50\nDistance (mm)\nD\nis\nta\nnc\ne \n(m\nm\n)\n0 5 10 15 20 250\n5000\n10000\n \n  Time (s)\n0 5 10 15 20 250\n5000\n10000\n Time (s)\n \n0 2 4 6 8 10\n0\n2\n4\n6\n8\n10\n \n \n D\nis\nta\nnc\ne \n(m\nm\n)\n 1750  --  2000\n 1500  --  1750\n 1250  --  1500\n 1000  --  1250\n 750.0  --  1000\n 500.0  --  750.0\n 250.0  --  500.0\n 0  --  250.0\n \n 25\n0 2 4 6 8 10\n100\n200\n300\n400\n500\n600\n700\nA-A section\nAA\nDistance (mm)\nO\nSL\n in\nte\nns\nity\n (a\n.u\n.)\n0 2 4 6 8 10\n0\n2\n4\n6\n8\n10\n Distance (mm)\n D\nis\nta\nnc\ne \n(m\nm\n)\nGlazeCeramic \n \n \n 666.7  --  800.0\n 533.3  --  666.7\n 400.0  --  533.3\n 266.7  --  400.0\n 133.3  --  266.7\n 0  --  133.3\n \n 26\n0 2 4 6 8 10\n0\n1000\n2000\n3000\n4000\n5000\nDistance (mm)\nO\nSL\n in\nte\nns\nity\n (a\n.u\n.)\n0 2 4 6 8 10\n0\n2\n4\n6\n8\n10\n Distance (mm)\n D\nis\nta\nnc\ne \n(m\nm\n)\n 4813  --  5500\n 4125  --  4813\n 3438  --  4125\n 2750  --  3438\n 2063  --  2750\n 1375  --  2063\n 687.5  --  1375\n 0  --  687.5\n \n 27\n0 2 4\n6\n8\n10 0\n2\n4\n6\n8\n10\n2000\n4000\n6000\n8000\n10000\nba\n \nO\nSL\n in\nte\nns\nity\n (a\n.u\n.)\nDis\ntan\nce \n(m\nm)\nDistance (mm)\n0 2 4 6\n0\n2\n4\n6\n8\n10\n D\nis\nta\nnc\ne \n(m\nm\n)\n  Distance (mm)\n \n 28\n0 2 4 6 8 10\n0\n2\n4\n6\n8\n10\nC\nB\nDistance (mm)\nD\nis\nta\nnc\ne \n(m\nm\n)\n 393.8  --  450.0\n 337.5  --  393.8\n 281.3  --  337.5\n 225.0  --  281.3\n 168.8  --  225.0\n 112.5  --  168.8\n 56.25  --  112.5\n 0  --  56.25\n0.0 0.2 0.4 0.6 0.8 1.0\n0\n5000\n10000\n15000\n20000\nA\nB\nA\nC\n Dose (Gy)\n \n \n 29\n0 2 4 6 8 10\n0\n2\n4\n6\n8\n10\n \n \nB\nA\nD\nλex=500 nm U-340\nλex=850 nm BG-39\n 1750  --  2000\n 1500  --  1750\n 1250  --  1500\n 1000  --  1250\n 750.0  --  1000\n 250.0  --  750.0\n 250.0  --  250.0\n 0  --  250.0\nDistance (mm)\nD\nis\nta\nnc\ne \n(m\nm\n)\n0 2 4 6 8 10\n0\n2\n4\n6\n8\n10\nb\na\n \n \nD\nis\nta\nnc\ne \n(m\nm\n) C\nB\nA\n \n 264.4  --  300.0\n 228.8  --  264.4\n 193.1  --  228.8\n 157.5  --  193.1\n 121.9  --  157.5\n 86.25  --  121.9\n 86.25  --  86.25\n 15.00  --  86.25\n \n 30\n0 10 20 30 40 50\n1\n10\n100\n1000\n10000\nC\nB\nA\nO\nS\nL \nin\nte\nns\nity\n (a\n.u\n.)\nTime (μs)\n \n 31\n0 50 100 150 200 250\n1\n10\n100\nB\nD\nO\nSL\n in\nte\nns\nity\n (a\n.u\n.)\nTime (μs)\n \n \n"}