{"doi":"10.1029\/2009JA014063","coreId":"69142","oai":"oai:eprints.lancs.ac.uk:28158","identifiers":["oai:eprints.lancs.ac.uk:28158","10.1029\/2009JA014063"],"title":"Electron loss rates from the outer radiation belt caused by the filling of the outer plasmasphere: The calm before the storm","authors":["Borovsky, J. E.","Denton, Michael H."],"enrichments":{"references":[{"id":959595,"title":"A comprehensive survey of plasmasphere refilling at geosynchronous orbit,","authors":[],"date":"2001","doi":null,"raw":"Su, Y.-J., M. F. Thomsen, J. E. Borovsky, and D. J. Lawrence (2001), A comprehensive survey of plasmasphere refilling at geosynchronous orbit, J. Geophys. Res., 106, 25,615.","cites":null},{"id":953532,"title":"A coordinated study of energetic electron precipitation and D region electron concentrations over Ottawa during disturbed conditions,","authors":[],"date":"1976","doi":null,"raw":"Larsen, T. R., J. B. Reagan, W. L. Imhof, L. E. Montbriand, and J. S. Belrose (1976), A coordinated study of energetic electron precipitation and D region electron concentrations over Ottawa during disturbed conditions, J. Geophys. Res., 81, 2200, doi:10.1029\/JA081i013p02200.","cites":null},{"id":948452,"title":"A densitytemperature description of the outer electron radiation belt during geomagnetic storms,","authors":[],"date":"2009","doi":null,"raw":"Denton, M. H., J. E. Borovsky, and T. E. Cayton (2009), A densitytemperature description of the outer electron radiation belt during geomagnetic storms, J. Geophys. Res., doi:10.1029\/2009JA014183, in press.","cites":null},{"id":943875,"title":"A statistical look at plasmaspheric drainage plumes,","authors":[],"date":"2008","doi":null,"raw":"Borovsky, J. E., and M. H. Denton (2008), A statistical look at plasmaspheric drainage plumes, J. Geophys. Res., 113, A09221, doi:10.1029\/ 2007JA012994.","cites":null},{"id":953014,"title":"A survey of equatorial magnetospheric wave activity","authors":[],"date":"1990","doi":null,"raw":"Koons, H. C., and J. L. Roeder (1990), A survey of equatorial magnetospheric wave activity between 5 and 8 RE, Planet. Space Sci., 38, 1335, doi:10.1016\/0032-0633(90)90136-E.","cites":null},{"id":954986,"title":"An examination of the structure and dynamics of the outer plasmasphere using multiple geosynchronous satellites,","authors":[],"date":"1994","doi":null,"raw":"Moldwin, M. B., M. F. Thomsen, S. J. Bame, D. J. McComas, and K. R. Moore (1994), An examination of the structure and dynamics of the outer plasmasphere using multiple geosynchronous satellites, J. Geophys. Res., 99, 11,475, doi:10.1029\/93JA03526.","cites":null},{"id":956707,"title":"Atmospheric response to NOy source due to energetic electron precipitation,","authors":[],"date":"2005","doi":null,"raw":"Rozanov, E., L. Callis, M. Schlesinger, F. Yang, N. Andronova, and V. Zubov (2005), Atmospheric response to NOy source due to energetic electron precipitation, Geophys. Res. Lett., 32, L14811, doi:10.1029\/ 2005GL023041. Sandel,B.R.,andM.H.Denton(2007),Globalviewofrefillingoftheplasmasphere, Geophys. Res. Lett., 34, L17102, doi:10.1029\/2007GL030669.","cites":null},{"id":954147,"title":"Auroral Boundary Index from","authors":[],"date":"1990","doi":null,"raw":"Madden, D., and M. S. Gussenhoven (1990), Auroral Boundary Index from 1983 to 1990, Tech. Rep. GL-TR-90-0358, Air Force Geophys. Lab., Hanscom Air Force Base, Mass, 21 Dec.","cites":null},{"id":955619,"title":"Auroral ionization and excitation by incident energetic electrons,","authors":[],"date":"1963","doi":null,"raw":"Rees, M. H. (1963), Auroral ionization and excitation by incident energetic electrons, Planet. Space Sci., 11, 1209, doi:10.1016\/0032-0633(63)90252-6.","cites":null},{"id":945137,"title":"Baker (2006a), Observation of two distinct, rapid loss mechanisms during the 20","authors":[],"date":"2003","doi":null,"raw":"Bortnik, J., R. M. Thorne, T. P. O’Brien, J. C. Green, R. J. Strangeway, Y. Y. Shprits, and D. N. Baker (2006a), Observation of two distinct, rapid loss mechanisms during the 20 November 2003 radiation belt dropout event, J. Geophys. Res., 111, A12216, doi:10.1029\/2006JA011802.","cites":null},{"id":945395,"title":"Bell (2006b), Temporal signatures of radiation belt electron precipitation induced by lightning-generated MR whistler waves: 2. Global signatures,","authors":[],"date":null,"doi":null,"raw":"Bortnik, J., U. S. Inan, and T. F. Bell (2006b), Temporal signatures of radiation belt electron precipitation induced by lightning-generated MR whistler waves: 2. Global signatures, J. Geophys. Res., 111, A02205, doi:10.1029\/2005JA011398.","cites":null},{"id":950202,"title":"Calculation of pitch angle and energy diffusion coefficients with the PADIE code,","authors":[],"date":"2005","doi":null,"raw":"Glauert, S. A., and R. B. Horne (2005), Calculation of pitch angle and energy diffusion coefficients with the PADIE code, J. Geophys. Res., 110, A04206, doi:10.1029\/2004JA010851.","cites":null},{"id":959227,"title":"Comment on ‘‘Solar-atmospheric coupling by electrons (SOLACE), 3, Comparisons of simulations and observations 1979– 1997, issues and implications’’ by","authors":[],"date":"2002","doi":null,"raw":"Siskind, D. E. (2002), Comment on ‘‘Solar-atmospheric coupling by electrons (SOLACE), 3, Comparisons of simulations and observations 1979– 1997, issues and implications’’ by Linwood B. Callis et al., J. Geophys. Res., 107(D22), 4633, doi:10.1029\/2001JD001141.","cites":null},{"id":957524,"title":"Comparative study of outer-zone relativistic electrons observed by Akebono and CRRES,","authors":[],"date":"2005","doi":null,"raw":"Seki, K., Y. Miyoshi, D. Summers, and N. P. Meredith (2005), Comparative study of outer-zone relativistic electrons observed by Akebono and CRRES, J. Geophys. Res., 110, A02203, doi:10.1029\/2004JA010655.","cites":null},{"id":960454,"title":"Competition between acceleration and loss mechanisms of relativistic electrons during geomagnetic storms,","authors":[],"date":"2004","doi":null,"raw":"Summers, D., C. Ma, and T. Mukai (2004), Competition between acceleration and loss mechanisms of relativistic electrons during geomagnetic storms, J. Geophys. Res., 109, A04221, doi:10.1029\/2004JA010437.","cites":null},{"id":952778,"title":"Daily changes in global cloud cover and Earth transits of the heliospheric current sheet,","authors":[],"date":"2004","doi":null,"raw":"Kniveton, D. R., and B. A. Tinsley (2004), Daily changes in global cloud cover and Earth transits of the heliospheric current sheet, J. Geophys.","cites":null},{"id":16683358,"title":"Effects of geomagnetic storms in the lower ionosphere, middle atmosphere and troposphere,","authors":[],"date":"1996","doi":null,"raw":"Lastovicka, J. (1996), Effects of geomagnetic storms in the lower ionosphere, middle atmosphere and troposphere, J. Atmos. Terr. Phys., 58, 831, doi:10.1016\/0021-9169(95)00106-9.","cites":null},{"id":961961,"title":"Electromagnetic hiss and relativistic electron losses in the inner zone,","authors":[],"date":"1975","doi":"10.1029\/JA080i004p00600","raw":"Tsurutani, B. T., E. J. Smith, and R. M. Thorne (1975), Electromagnetic hiss and relativistic electron losses in the inner zone, J. Geophys. Res., 80, 600.","cites":null},{"id":950771,"title":"Electron density and plasmapause characteristics at 6.6 RE: A statistical study of GEOS 2 relaxation sounder data,","authors":[],"date":"1984","doi":null,"raw":"Higel, B., and W. Lei (1984), Electron density and plasmapause characteristics at 6.6 RE: A statistical study of GEOS 2 relaxation sounder data, J. Geophys. Res., 89, 1583, doi:10.1029\/JA089iA03p01583.","cites":null},{"id":946838,"title":"Energetic electron components at geosynchronous orbit,","authors":[],"date":"1989","doi":null,"raw":"Cayton, T. E., R. D. Belian, S. P. Gary, T. A. Fritz, and D. N. Baker (1989), Energetic electron components at geosynchronous orbit, Geophys. Res. Lett., 16, 147, doi:10.1029\/GL016i002p00147.","cites":null},{"id":954725,"title":"Energetic outer zone electron loss timescales during low geomagnetic activity,","authors":[],"date":"2006","doi":null,"raw":"Meredith, N. P., R. B. Horne, S. A. Glaurt, R. M. Thorne, D. Summers, J. M. Albert, and R. R. Anderson (2006), Energetic outer zone electron loss timescales during low geomagnetic activity, J. Geophys. Res., 111, A05212, doi:10.1029\/2005JA011516.","cites":null},{"id":955330,"title":"Energetic particle precipitation effects on the Southern Hemisphere stratosphere in","authors":[],"date":"2007","doi":null,"raw":"Randall, C. E., V. L. Harvey, C. S. Singleton, S. M. Bailey, P. F. Bernath, M. Codrescu, H. Nakajima, and J. M. Russell (2007), Energetic particle precipitation effects on the Southern Hemisphere stratosphere in 1992– 2005, J. Geophys. Res., 112, D08308, doi:10.1029\/2006JD007696.","cites":null},{"id":961165,"title":"Energetic radiation belt electron precipitation: A natural depletion mechanism for stratospheric ozone,","authors":[],"date":"1997","doi":"10.1126\/science.195.4275.287","raw":"Thorne, R. M. (1997), Energetic radiation belt electron precipitation: A natural depletion mechanism for stratospheric ozone, Science, 195, 287.","cites":null},{"id":941462,"title":"Evaluation of quasi-linear diffusion coefficients for EMIC waves in a multispecies plasma,","authors":[],"date":"2003","doi":null,"raw":"Albert, J. M. (2003), Evaluation of quasi-linear diffusion coefficients for EMIC waves in a multispecies plasma, J. Geophys. Res., 108(A6), 1249, doi:10.1029\/2002JA009792.","cites":null},{"id":957229,"title":"Excitation processes in the aurora and airglow 1. Absolute intensities, relative ultra-violet intensities and electron densities in high latitude aurora,","authors":[],"date":"1954","doi":null,"raw":"Seaton, M. J. (1954), Excitation processes in the aurora and airglow 1. Absolute intensities, relative ultra-violet intensities and electron densities in high latitude aurora, J. Atmos. Terr. Phys., 4, 285, doi:10.1016\/0021-9169(54)90060-4.","cites":null},{"id":955266,"title":"Experimental observations of a large addition to the electron inner radiation belt after a solar flare event,","authors":[],"date":"1968","doi":null,"raw":"Pfitzer, K. A., and J. R. Winckler (1968), Experimental observations of a large addition to the electron inner radiation belt after a solar flare event, J. Geophys. Res., 73, 5792, doi:10.1029\/JA073i017p05792.","cites":null},{"id":952433,"title":"Fully adiabatic changes in storm time relativistic electron fluxes,","authors":[],"date":"1997","doi":null,"raw":"Kim, H.-J., and A. A. Chan (1997), Fully adiabatic changes in storm time relativistic electron fluxes, J. Geophys. Res., 102, 22,107, doi:10.1029\/ 97JA01814.","cites":null},{"id":948151,"title":"Geomagnetic storms driven by ICME- and CIR-dominated solar wind,","authors":[],"date":"2006","doi":null,"raw":"Denton, M. H., J. E. Borovsky, R. M. Skoug, M. F. Thomsen, B. Lavraud, M. G. Henderson, R. L. McPherron, J. C. Zhang, and M. W. Liemohn (2006), Geomagnetic storms driven by ICME- and CIR-dominated solar wind, J. Geophys. Res., 111, A07S07, doi:10.1029\/2005JA011436.","cites":null},{"id":956948,"title":"Global view of refilling of the plasmasphere,","authors":[],"date":"2007","doi":null,"raw":null,"cites":null},{"id":942561,"title":"High-Z energetic particles at geosynchronous orbit during the great solar proton event series of","authors":[],"date":"1992","doi":null,"raw":"Belian, R. D., G. R. Gisler, T. Cayton, and R. Christensen (1992), High-Z energetic particles at geosynchronous orbit during the great solar proton event series of October 1989, J. Geophys. Res., 97, 16,897, doi:10.1029\/ 92JA01139.","cites":null},{"id":949629,"title":"Inner edge of the electron plasma sheet: Empirical models of boundary location,","authors":[],"date":"1999","doi":null,"raw":"Elphic, R. C., M. F. Thomsen, J. E. Borovsky, and D. E. McComas (1999), Inner edge of the electron plasma sheet: Empirical models of boundary location, J. Geophys. Res., 104, 22,679.","cites":null},{"id":947362,"title":"Longitudinal and seasonal variations in plasmaspheric electron density: Implications for electron precipitation,","authors":[],"date":"2007","doi":null,"raw":"Clilverd, M. A., N. P. Meredith, R. B. Horne, S. A. Glauert, R. R. Anderson, N. R. Thomson, F. W. Menk, and B. R. Sandel (2007), Longitudinal and seasonal variations in plasmaspheric electron density: Implications for electron precipitation, J. Geophys. Res., 112, A11210, doi:10.1029\/ 2007JA012416.","cites":null},{"id":16683166,"title":"Magnetospheric dynamics and mass flow during the","authors":[],"date":"1993","doi":null,"raw":"Borovsky,J.E.,M.F.Thomsen,D.J.McComas,T.E.Cayton,andD.J.Knipp (1998a), Magnetospheric dynamics and mass flow during the November 1993 storm, J. Geophys. Res., 103, 26,373, doi:10.1029\/97JA03051.","cites":null},{"id":942284,"title":"Magnetospheric plasma analyzer for spacecraft with constrained resources,","authors":[],"date":"1993","doi":null,"raw":"Bame, S. J., D. J. McComas, M. F. Thomsen, B. L. Barraclough, R. C. Elphic, J. P. Glore, J. T. Gosling, J. C. Chavez, E. P. Evans, and F. J. Wymer (1993), Magnetospheric plasma analyzer for spacecraft with constrained resources, Rev. Sci. Instrum., 64, 1026, doi:10.1063\/1.1144173.","cites":null},{"id":944847,"title":"McComas (1998b), The transport of plasma sheet material from the distant tail to geosynchronous orbit,","authors":[],"date":null,"doi":null,"raw":"Borovsky, J. E., M. F. Thomsen, R. C. Elphic, T. E. Cayton, and D. J. McComas (1998b), The transport of plasma sheet material from the distant tail to geosynchronous orbit, J. Geophys. Res., 103, 20,297, doi:10.1029\/97JA03144.","cites":null},{"id":16683373,"title":"Measurements and intensity of energetic electrons at the equator at 6.6 RE,","authors":[],"date":"1968","doi":null,"raw":"Lezniak, T. W., R. L. Arnoldy, G. K. Parks, and J. R. Winkler (1968), Measurements and intensity of energetic electrons at the equator at 6.6 RE, Radio Sci., 3, 710.","cites":null},{"id":16683367,"title":"Measurements of early and late-time plasmasphere refilling as observed from geosynchronous orbit,","authors":[],"date":"1999","doi":null,"raw":"Lawrence, D J., M. F. Thomsen, J. E. Borovsky, and D. J. McComas (1999), Measurements of early and late-time plasmasphere refilling as observed from geosynchronous orbit, J. Geophys. Res., 104, 14,691, doi:10.1029\/1998JA900087.","cites":null},{"id":958060,"title":"Mewaldt (2003), Atmospheric losses of radiation belt electrons,","authors":[],"date":null,"doi":null,"raw":"Selesnick, R. S., J. B. Blake, and R. A. Mewaldt (2003), Atmospheric losses of radiation belt electrons, J. Geophys. Res., 108(A12), 1468, doi:10.1029\/2003JA010160.","cites":null},{"id":953272,"title":"Modeling the effects of radial diffusion and plasmaspheric hiss on outer radiation belt electrons,","authors":[],"date":"2007","doi":null,"raw":"Lam, M. M., R. B. Horne, N. P. Meredith, and S. A. Glauert (2007), Modeling the effects of radial diffusion and plasmaspheric hiss on outer radiation belt electrons, Geophys. Res. Lett., 34, L20112, doi:10.1029\/ 2007GL031598.","cites":null},{"id":948682,"title":"Modelling of the outer electron belt flux dropout and losses during magnetic storm main phase,","authors":[],"date":"2000","doi":null,"raw":"Desorgher, L., E. Fluckiger, P. Buhler, and A. Zehnder (2000), Modelling of the outer electron belt flux dropout and losses during magnetic storm main phase, Adv. Space Res., 26, 167, doi:10.1016\/S0273-1177(99)01044-3.","cites":null},{"id":16683376,"title":"Multispacecraft observations of the outer zone electron variation during the November 3–4, 1993, magnetic storm,","authors":[],"date":"1997","doi":null,"raw":"Christensen, J. B. Blake, M. D. Looper, R. Nakamura, and S. G. Kanekal (1997), Multispacecraft observations of the outer zone electron variation during the November 3–4, 1993, magnetic storm, J. Geophys. Res., 102, 14,123, doi:10.1029\/97JA01101.","cites":null},{"id":950535,"title":"Nighttime auroral energy deposition in the middle atmosphere,","authors":[],"date":"1984","doi":null,"raw":"Goldberg, R. A., C. H. Jackman, J. R. Barcus, and F. Soras (1984), Nighttime auroral energy deposition in the middle atmosphere, J. Geophys. Res., 89, 5581, doi:10.1029\/JA089iA07p05581.","cites":null},{"id":955906,"title":"Note on the penetration of energetic electrons into the Earth’s atmosphere,","authors":[],"date":"1964","doi":null,"raw":"Rees, M. H. (1964), Note on the penetration of energetic electrons into the Earth’s atmosphere, Planet. Space Sci., 12, 722, doi:10.1016\/0032-0633(64)90236-3.","cites":null},{"id":946626,"title":"Numerical modeling of the synchronous orbit particle analyzer,","authors":[],"date":"2007","doi":null,"raw":"Cayton, T. E., and R. D. Belian (2007), Numerical modeling of the synchronous orbit particle analyzer, Los Alamos Natl. Lab. Rep. LA-14335, Los Alamos, N. M., June.","cites":null},{"id":947128,"title":"Observation of a decrease in mid-latitude whistler-mode signal occurrence prior to geomagnetic storms,","authors":[],"date":"1993","doi":null,"raw":"Clilverd, M. A., T. D. G. Clark, A. J. Smith, and N. R. Thomson (1993), Observation of a decrease in mid-latitude whistler-mode signal occurrence prior to geomagnetic storms, J. Atmos. Terr. Phys., 55, 1479, doi:10.1016\/0021-9169(93)90113-D.","cites":null},{"id":954446,"title":"Outer zone relativistic electron acceleration associated with substorm-enhanced whistler mode chorus,","authors":[],"date":"2002","doi":null,"raw":"Meredith, N. P., R. B. Horne, R. H. A. Iles, R. M. Thorne, D. Heynderickx, and R. R. Anderson (2002), Outer zone relativistic electron acceleration associated with substorm-enhanced whistler mode chorus, J. Geophys. Res., 107(A7), 1144, doi:10.1029\/2001JA900146.","cites":null},{"id":958879,"title":"Outward radial diffusion driven by losses at magnetopause,","authors":[],"date":"2006","doi":null,"raw":"Shprits, Y. Y., R. M. Thorne, R. Friedel, G. D. Reeves, J. Fennell, D. N. Baker, and S. G. Kanekal (2006), Outward radial diffusion driven by losses at magnetopause, J. Geophys. Res., 111, A11214, doi:10.1029\/ 2006JA011657.","cites":null},{"id":953880,"title":"Pitch-angle diffusion of radiation belt electrons within the plasmasphere,","authors":[],"date":"1972","doi":null,"raw":"Lyons, L. R., R. M. Thorne, and C. F. Kennel (1972), Pitch-angle diffusion of radiation belt electrons within the plasmasphere, J. Geophys. Res., 77, 3455, doi:10.1029\/JA077i019p03455.","cites":null},{"id":946381,"title":"Plasmasphere dynamics in the duskside bulge region: A new look at an old topic,","authors":[],"date":"1993","doi":null,"raw":"Carpenter, D. L., B. L. Giles, C. R. Chappell, P. M. E. Decreau, R. R. Anderson, A. M. Persoon, A. J. Smith, Y. Corcuff, and P. Canu (1993), Plasmasphere dynamics in the duskside bulge region: A new look at an old topic, J. Geophys. Res., 98, 19,243, doi:10.1029\/93JA00922.","cites":null},{"id":959259,"title":"Plasmaspheric hiss intensity variations during magnetic storms,","authors":[],"date":"1974","doi":null,"raw":"Smith, E. J., A. M. A. Frandsen, B. T. Tsurutani, R. M. Thorne, and K. W. Chan (1974), Plasmaspheric hiss intensity variations during magnetic storms, J. Geophys. Res., 79, 2507, doi:10.1029\/JA079i016p02507.","cites":null},{"id":945918,"title":"Precipitating relativistic electrons: Their long-term effect on stratospheric odd nitrogen levels,","authors":[],"date":"1991","doi":null,"raw":"Callis, L. B., D. N. Baker, J. B. Blake, J. D. Lambeth, R. E. Boughner, M. Natarajan, R. W. Klebesadel, and D. J. Gorney (1991), Precipitating relativistic electrons: Their long-term effect on stratospheric odd nitrogen levels, J. Geophys. Res., 96, 2939, doi:10.1029\/90JD02184.","cites":null},{"id":16683364,"title":"Precipitation of radiation belt electrons induced by obliquely propagating lightning-generated whistlers,","authors":[],"date":"2001","doi":null,"raw":"Lauben, D. S., U. S. Inan, and T. F. Bell (2001), Precipitation of radiation belt electrons induced by obliquely propagating lightning-generated whistlers, J. Geophys. Res., 106, 29,745, doi:10.1029\/1999JA000155.","cites":null},{"id":952166,"title":"Properties of ELF electromagnetic waves in and above the Earth’s ionosphere deduced from plasma wave experiments on the OVI-17 and Ogo 6 satellites,","authors":[],"date":"1975","doi":null,"raw":"Kelley, M. C., B. T. Tsurutani, and F. S. Mozer (1975), Properties of ELF electromagnetic waves in and above the Earth’s ionosphere deduced from plasma wave experiments on the OVI-17 and Ogo 6 satellites, J. Geophys. Res., 80, 4603, doi:10.1029\/JA080i034p04603.","cites":null},{"id":945665,"title":"Radial diffusion analysis of outer radiation belt electrons during the October 9, 1990, magnetic storm,","authors":[],"date":"2000","doi":null,"raw":"Brautigam, D. H., and J. M. Albert (2000), Radial diffusion analysis of outer radiation belt electrons during the October 9, 1990, magnetic storm, J. Geophys. Res., 105, 291, doi:10.1029\/1999JA900344.","cites":null},{"id":956455,"title":"Radiation belt electron precipitation into the atmosphere: Recovery from a geomagnetic storm,","authors":[],"date":"2007","doi":null,"raw":"Rodger, C. J., M. A. Clilverd, N. R. Thomson, R. J. Gable, A. Seppala, E. Turuned, N. P. Meredith, M. Parrot, J.-A. Sauvaud, and J.-J. Berthelier (2007), Radiation belt electron precipitation into the atmosphere: Recovery from a geomagnetic storm, J. Geophys. Res., 112, A11307, doi:10.1029\/2007JA012383.","cites":null},{"id":959523,"title":"Refilling of geosynchronous flux tubes as observed at the equator by","authors":[],"date":"1985","doi":null,"raw":"Sojka, J. J, and G. L. Wrenn (1985), Refilling of geosynchronous flux tubes as observed at the equator by GEOS 2, J. Geophys. Res., 90,6 3 7 9 , doi:10.1029\/JA090iA07p06379.","cites":null},{"id":951026,"title":"Relativistic electron acceleration and precipitation during resonant interactions with whistler-mode chorus,","authors":[],"date":"2003","doi":null,"raw":"Horne, R. B., and R. M. Thorne (2003), Relativistic electron acceleration and precipitation during resonant interactions with whistler-mode chorus, Geophys. Res. Lett., 30(10), 1527, doi:10.1029\/2003GL016973.","cites":null},{"id":959894,"title":"Relativistic electron pitch-angle scattering by electromagnetic ion cyclotron waves during geomagnetic storms,","authors":[],"date":"2003","doi":null,"raw":"Summers, D., and R. M. Thorne (2003), Relativistic electron pitch-angle scattering by electromagnetic ion cyclotron waves during geomagnetic storms, J. Geophys. Res., 108(A4), 1143, doi:10.1029\/2002JA009489.","cites":null},{"id":951856,"title":"Relativistic electron precipitation by EMIC waves from self-consistent global simulations,","authors":[],"date":"2008","doi":null,"raw":"Jordanova, V. K., J. Albert, and Y. Miyoshi (2008), Relativistic electron precipitation by EMIC waves from self-consistent global simulations, J. Geophys. Res., 113, A00A10, doi:10.1029\/2008JA013239.","cites":null},{"id":942839,"title":"Relativistic electrons in the outer-zone: An 11 year cycle; Their relation to the solar wind,","authors":[],"date":"1996","doi":null,"raw":"Belian, R. D., T. E. Cayton, R. A. Christiansen, J. C. Ingraham, M. M. Meier, G. D. Reeves, and A. J. Lazarus (1996), Relativistic electrons in the outer-zone: An 11 year cycle; Their relation to the solar wind, in Workshop on the Earth’s Trapped Particle Environment, edited by G. D. Reeves, AIP Conf. Proc., 383, 13.","cites":null},{"id":960190,"title":"Relativistic theory of wave-particle resonant diffusion with application to electron acceleration in the magnetosphere,","authors":[],"date":"1998","doi":null,"raw":"Summers, D., R. M. Thorne, and F. Xiao (1998), Relativistic theory of wave-particle resonant diffusion with application to electron acceleration in the magnetosphere, J. Geophys. Res., 103, 20,487.","cites":null},{"id":944142,"title":"Relativistic-electron dropouts and recovery: A superposed epoch study of the magnetosphere and the solar wind,","authors":[],"date":"2009","doi":null,"raw":"Borovsky, J. E., and M. H. Denton (2009), Relativistic-electron dropouts and recovery: A superposed epoch study of the magnetosphere and the solar wind, J. Geophys. Res., 114, A02201, doi:10.1029\/2008JA013128.","cites":null},{"id":951579,"title":"Ring current asymmetry from global simulations using a high-resolution electric field model,","authors":[],"date":"2003","doi":null,"raw":"Jordanova, V. K., A. Boonsiriseth, R. M. Thorne, and Y. Dotan (2003), Ring current asymmetry from global simulations using a high-resolution electric field model, J. Geophys. Res., 108(A12), 1443, doi:10.1029\/ 2003JA009993.","cites":null},{"id":942031,"title":"Satellite and rocket studies of relativistic electrons and their influence on the middle atmosphere,","authors":[],"date":"1993","doi":null,"raw":"Baker, D. N., R. A. Goldberg, F. A. Herrero, J. B. Blake, and L. B. Callis (1993), Satellite and rocket studies of relativistic electrons and their influence on the middle atmosphere, J. Atmos. Terr. Phys., 55, 1619, doi:10.1016\/0021-9169(93)90167-W.","cites":null},{"id":962262,"title":"Satellite observations of lightning-induced electron precipitation,","authors":[],"date":"1998","doi":"10.1029\/97JA02878","raw":"Voss, H. D., M. Walt, W. L. Imhof, J. Mobilia, and U. S. Inan (1998), Satellite observations of lightning-induced electron precipitation, J. Geophys. Res., 103, 11,725.","cites":null},{"id":962547,"title":"Shadowing of electron azimuthal-drift motions near the noon magnetopause,","authors":[],"date":"1972","doi":null,"raw":"West, H. I., R. M. Buck, and J. R. Walton (1972), Shadowing of electron azimuthal-drift motions near the noon magnetopause, Nature Phys. Sci., 240,6 .","cites":null},{"id":956176,"title":"Significance of lightning-generated whistlers to inner radiation belt electron lifetimes,","authors":[],"date":"2003","doi":null,"raw":"Rodger, C. J., M. A. Clilverd, and R. J. McCormick (2003), Significance of lightning-generated whistlers to inner radiation belt electron lifetimes, J. Geophys. Res., 108(A12), 1462, doi:10.1029\/2003JA009906.","cites":null},{"id":946140,"title":"Solar-atmospheric coupling by electrons (SOLACE): 2. Calculated stratospheric effects of precipitating electrons,","authors":[],"date":"1998","doi":null,"raw":"Callis, L. B., M. Natarajan, J. D. Lambeth, and D. N. Baker (1998), Solar-atmospheric coupling by electrons (SOLACE): 2. Calculated stratospheric effects of precipitating electrons, J. Geophys. Res., 103, 28,421, doi:10.1029\/98JD02407.","cites":null},{"id":948901,"title":"Some effects of diamagnetic ring currents on Van Allen radiation,","authors":[],"date":"1961","doi":null,"raw":"Dessler, A. J., and R. Karplus (1961), Some effects of diamagnetic ring currents on Van Allen radiation, J. Geophys. Res., 66, 2289, doi:10.1029\/ JZ066i008p02289. Elphic,R.C.,M.F.Thomsen,andJ.E.Borovsky(1997),Thefateoftheouter plasmasphere, Geophys. Res. Lett., 24, 365, doi:10.1029\/97GL00141.","cites":null},{"id":957761,"title":"Source and loss rates of radiation belt relativistic electrons during magnetic storms,","authors":[],"date":"2006","doi":null,"raw":"Selesnick, R. S. (2006), Source and loss rates of radiation belt relativistic electrons during magnetic storms, J. Geophys. Res., 111, A04210, doi:10.1029\/2005JA011473.","cites":null},{"id":943374,"title":"Substorm electron injections: Geosynchronous observations and test particle simulations,","authors":[],"date":"1998","doi":null,"raw":"Birn, J., M. F. Thomsen, J. E. Borovsky, G. D. Reeves, D. J. McComas, R. D. Belian, and M. Hesse (1998), Substorm electron injections: Geosynchronous observations and test particle simulations, J. Geophys. Res., 103, 9235, doi:10.1029\/97JA02635.","cites":null},{"id":947540,"title":"Superposed epoch analysis of high-speed-stream effects at geosynchronous orbit: Hot plasma, cold plasma, and the solar wind,","authors":[],"date":"2008","doi":null,"raw":"A11203 BOROVSKY AND DENTON: RADIATION BELT ELECTRON LOSS RATES 10 of 12 A11203Denton, M. H., and J. E. Borovsky (2008), Superposed epoch analysis of high-speed-stream effects at geosynchronous orbit: Hot plasma, cold plasma, and the solar wind, J. Geophys. Res., 113, A07216, doi:10.1029\/2007JA012998.","cites":null},{"id":944659,"title":"The ‘‘calm before the storm’’ in CIR\/magnetosphere interactions: Occurrence statistics, solar-wind statistics, and magnetospheric preconditioning,","authors":[],"date":"2006","doi":null,"raw":"Borovsky, J. E., and J. T. Steinberg (2006), The ‘‘calm before the storm’’ in CIR\/magnetosphere interactions: Occurrence statistics, solar-wind statistics, and magnetospheric preconditioning, J. Geophys. Res., 111, A07S10, doi:10.1029\/2005JA011397.","cites":null},{"id":944407,"title":"The calm before the storm in CIR\/magnetosphere interactions, Eos Trans.","authors":[],"date":"2005","doi":null,"raw":"Borovsky, J. E., and J. T. Steinberg (2005), The calm before the storm in CIR\/magnetosphere interactions, Eos Trans. AGU, 86(52), Fall Meet. Suppl., Abstract SM54A-05.","cites":null},{"id":943677,"title":"The differences between CMEdriven storms and CIR-driven storms,","authors":[],"date":"2006","doi":null,"raw":"Borovsky, J. E, and M. H. Denton (2006), The differences between CMEdriven storms and CIR-driven storms, J. Geophys. Res., 111, A07S08, doi:10.1029\/2005JA011447.","cites":null},{"id":949867,"title":"The diffuse aurora: A significant source of ionization in the middle atmosphere,","authors":[],"date":"1997","doi":null,"raw":"Frahm, R. A., J. D. Winningham, J. R. Sharber, R. Link, G. Crowley, E. E. Gaines, D. L. Chenette, B. J. Anderson, and T. A. Potemra (1997), The diffuse aurora: A significant source of ionization in the middle atmosphere, J. Geophys. Res., 102, 28,203, doi:10.1029\/97JD02430.","cites":null},{"id":962821,"title":"The dynamics of energetic electrons in the Earth’s outer radiation belt during 1968 as observed by the Lawrence Livermore National Laboratory’s spectrometer on Ogo 5,","authors":[],"date":"1981","doi":"10.1029\/JA086iA04p02111","raw":"West, H. I., R. M. Buck, and G. T. Davidson (1981), The dynamics of energetic electrons in the Earth’s outer radiation belt during 1968 as observed by the Lawrence Livermore National Laboratory’s spectrometer on Ogo 5, J. Geophys. Res., 86,2 1 1 1 . J. E. Borovsky, Los Alamos National Laboratory, Mail Stop D466, Los Alamos, NM 87545, USA. (jborovsky@lanl.gov) M. H. Denton, Department of Communication Systems, Lancaster University, Lancaster LA1 4WA, UK. A11203 BOROVSKY AND DENTON: RADIATION BELT ELECTRON LOSS RATES 12 of 12 A11203","cites":null},{"id":958317,"title":"The effect of midlatitude electron precipitation on the geoelectric field,","authors":[],"date":"1988","doi":null,"raw":"Sheldon, W. R., J. R. Benbrook, and G. J. Byrne (1988), The effect of midlatitude electron precipitation on the geoelectric field, J. Atmos. Terr. Phys., 50, 1019, doi:10.1016\/0021-9169(88)90090-6.","cites":null},{"id":949396,"title":"The fate of the outer plasmasphere,","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":952664,"title":"The geomagnetic field,","authors":[],"date":"1985","doi":null,"raw":"Knecht, D. J., and B. M. Schuman (1985), The geomagnetic field, in Handbook of Geophysics and the Space Environment, edited by A. S. Jursa, p. 4-1, Natl. Tech. Inf. Serv., Springfield, Va.","cites":null},{"id":961382,"title":"The importance of energetic particle precipitation on the chemical composition of the middle atmosphere,","authors":[],"date":"1980","doi":"10.1007\/BF01586448","raw":"Thorne, R. M. (1980), The importance of energetic particle precipitation on the chemical composition of the middle atmosphere, Pure Appl. Geophys., 118, 128.","cites":null},{"id":946858,"title":"The morphology of the bulge region of the plasmasphere,","authors":[],"date":"1970","doi":null,"raw":"Chappell, C. R., K. K. Harris, and G. W. Sharp (1970), The morphology of the bulge region of the plasmasphere, J. Geophys. Res., 75,3 8 4 8 , doi:10.1029\/JA075i019p03848.","cites":null},{"id":961912,"title":"The role of the global electric circuit in solar and internal forcing of clouds and climate,","authors":[],"date":"2007","doi":"10.1016\/j.asr.2007.01.071","raw":"Tinsley, B. A., G. B. Burns, and L. Zhou (2007), The role of the global electric circuit in solar and internal forcing of clouds and climate, Adv.","cites":null},{"id":947857,"title":"The superdense plasma sheet in the magnetosphere during high-speed-stream-driven storms: Plasma transport timescales,","authors":[],"date":"2009","doi":null,"raw":"Denton, M. H., and J. E. Borovsky (2009), The superdense plasma sheet in the magnetosphere during high-speed-stream-driven storms: Plasma transport timescales, J. Atmos. Sol. Terr. Phys., 71, 1045–1058, doi:10.1016\/j.jastp.2008.04.023.","cites":null},{"id":958978,"title":"Thorne (2007), Parameterization of radiation belt electron loss timescales due to interactions with chorus waves,","authors":[],"date":null,"doi":null,"raw":"Shprits, Y. Y., N. P. Meredith, and R. M. Thorne (2007), Parameterization of radiation belt electron loss timescales due to interactions with chorus waves, Geophys. Res. Lett., 34, L11110, doi:10.1029\/2006GL029050.","cites":null},{"id":944910,"title":"Thorne (2007), The dual role of ELF\/VLF chorus waves in the acceleration and precipitation of radiation belt electrons,","authors":[],"date":null,"doi":null,"raw":"Bortnik, J., and R. M. Thorne (2007), The dual role of ELF\/VLF chorus waves in the acceleration and precipitation of radiation belt electrons, J. Atmos. Sol. Terr. Phys., 69, 378, doi:10.1016\/j.jastp.2006.05.030.","cites":null},{"id":958614,"title":"Time dependent radial diffusion modeling of relativistic electrons with realistic loss rates,","authors":[],"date":"2004","doi":null,"raw":"A11203 BOROVSKY AND DENTON: RADIATION BELT ELECTRON LOSS RATES 11 of 12 A11203Shprits, Y. Y., and R. M. Thorne (2004), Time dependent radial diffusion modeling of relativistic electrons with realistic loss rates, Geophys. Res.","cites":null},{"id":961629,"title":"Timescale for MeV electron microburst loss during geomagnetic storms,","authors":[],"date":"2005","doi":"10.1029\/2004JA010882","raw":"Thorne, R. M., T. P. O’Brien, Y. Y. Shprits, D. Summers, and R. B. Horne (2005), Timescale for MeV electron microburst loss during geomagnetic storms, J. Geophys. Res., 110, A09202, doi:10.1029\/2004JA010882.","cites":null},{"id":951311,"title":"Timescale for radiation belt electron acceleration by whistler mode chorus waves,","authors":[],"date":"2005","doi":null,"raw":"Horne, R. B., R. M. Thorne, S. A. Glauert, J. M. Albert, N. P. Meredith, and R. R. Anderson (2005), Timescale for radiation belt electron acceleration by whistler mode chorus waves, J. Geophys. Res., 110, A03225, doi:10.1029\/2004JA010811.","cites":null},{"id":943126,"title":"Trakhtengerts","authors":[],"date":"1990","doi":null,"raw":"Bespalov, P. A., A. Grafe, A. G. Demekhov, and V. Y. Trakhtengerts (1990), Some aspects of the dynamics of the asymmetric ring current, Geomagn. Aeron., 30, 628.","cites":null},{"id":953815,"title":"Treilhou (2000), Precipitation of relativistic electrons by interaction with electromagnetic ion cyclotron waves,","authors":[],"date":null,"doi":null,"raw":"Lorentzen, K. R., M. P. McCarthy, G. K. Parks, J. E. Foat, R. M. Millan, D. M. Smith, R. P. Lin, and J. P. Treilhou (2000), Precipitation of relativistic electrons by interaction with electromagnetic ion cyclotron waves, J. Geophys. Res., 105, 5381, doi:10.1029\/1999JA000283.","cites":null},{"id":941726,"title":"Using quasi-linear diffusion to model acceleration and loss from wave-particle interactions,","authors":[],"date":"2004","doi":null,"raw":"Albert, J. M. (2004), Using quasi-linear diffusion to model acceleration and loss from wave-particle interactions, Space Weather, 2, S09S03, doi:10.1029\/2004SW000069.","cites":null},{"id":946309,"title":"Whistler evidence of the dynamic behavior of the duskside bulge in the plasmasphere,","authors":[],"date":"1970","doi":null,"raw":"Carpenter, D. L. (1970), Whistler evidence of the dynamic behavior of the duskside bulge in the plasmasphere, J. Geophys. Res., 75, 3837, doi:10.1029\/JA075i019p03837.","cites":null},{"id":960696,"title":"Why Kp is such a good measure of magnetospheric convection,","authors":[],"date":"2004","doi":null,"raw":"Thomsen, M. F. (2004), Why Kp is such a good measure of magnetospheric convection, Space Weather, 2, S11004, doi:10.1029\/2004SW000089.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-11","abstract":"Measurements from seven spacecraft in geosynchronous orbit are analyzed to determine the decay rate of the number density of the outer electron radiation belt prior to the onset of high-speed-stream-driven geomagnetic storms. Superposed-data analysis is used with a collection of 124 storms. When there is a calm before the storm, the electron number density decays exponentially before the storm with a 3.4-day e-folding time: beginning about 4 days before storm onset, the density decreases from ∼4 × 10−4 cm−3 to ∼1 × 10−4 cm−3. When there is not a calm before the storm, the number density decay is very small. The decay in the number density of radiation belt electrons is believed to be caused by pitch angle scattering of electrons into the atmospheric loss cone as the outer plasmasphere fills during the calms. This is confirmed by separately measuring the density decay rate for times when the outer plasmasphere is present or absent. While the radiation belt electron density decreases, the temperature of the electron radiation belt holds approximately constant, indicating that the electron precipitation occurs equally at all energies. Along with the number density decay, the pressure of the outer electron radiation belt decays, and the specific entropy increases. From the measured decay rates, the electron flux to the atmosphere is calculated, and that flux is 3 orders of magnitude less than thermal fluxes in the magnetosphere, indicating that the radiation belt pitch angle scattering is 3 orders weaker than strong diffusion. Energy fluxes into the atmosphere are calculated and found to be insufficient to produce visible airglow","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69142.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/28158\/1\/art_971.pdf","pdfHashValue":"98792e3d185f2c52650767adc997128276f14185","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:28158<\/identifier><datestamp>\n      2018-01-24T02:52:37Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Electron loss rates from the outer radiation belt caused by the filling of the outer plasmasphere: The calm before the storm<\/dc:title><dc:creator>\n        Borovsky, J. E.<\/dc:creator><dc:creator>\n        Denton, Michael H.<\/dc:creator><dc:description>\n        Measurements from seven spacecraft in geosynchronous orbit are analyzed to determine the decay rate of the number density of the outer electron radiation belt prior to the onset of high-speed-stream-driven geomagnetic storms. Superposed-data analysis is used with a collection of 124 storms. When there is a calm before the storm, the electron number density decays exponentially before the storm with a 3.4-day e-folding time: beginning about 4 days before storm onset, the density decreases from ∼4 × 10−4 cm−3 to ∼1 × 10−4 cm−3. When there is not a calm before the storm, the number density decay is very small. The decay in the number density of radiation belt electrons is believed to be caused by pitch angle scattering of electrons into the atmospheric loss cone as the outer plasmasphere fills during the calms. This is confirmed by separately measuring the density decay rate for times when the outer plasmasphere is present or absent. While the radiation belt electron density decreases, the temperature of the electron radiation belt holds approximately constant, indicating that the electron precipitation occurs equally at all energies. Along with the number density decay, the pressure of the outer electron radiation belt decays, and the specific entropy increases. From the measured decay rates, the electron flux to the atmosphere is calculated, and that flux is 3 orders of magnitude less than thermal fluxes in the magnetosphere, indicating that the radiation belt pitch angle scattering is 3 orders weaker than strong diffusion. Energy fluxes into the atmosphere are calculated and found to be insufficient to produce visible airglow.<\/dc:description><dc:date>\n        2009-11<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/28158\/1\/art_971.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1029\/2009JA014063<\/dc:relation><dc:identifier>\n        Borovsky, J. E. and Denton, Michael H. (2009) Electron loss rates from the outer radiation belt caused by the filling of the outer plasmasphere: The calm before the storm. Journal of Geophysical Research, 114 (A11203). pp. 1-12. ISSN 0148-0227<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/28158\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1029\/2009JA014063","http:\/\/eprints.lancs.ac.uk\/28158\/"],"year":2009,"topics":[],"subject":["Journal Article","PeerReviewed"],"fullText":"Electron loss rates from the outer radiation belt caused by the filling\nof the outer plasmasphere: The calm before the storm\nJoseph E. Borovsky1 and Michael H. Denton2\nReceived 10 January 2009; revised 29 June 2009; accepted 22 July 2009; published 7 November 2009.\n[1] Measurements from seven spacecraft in geosynchronous orbit are analyzed to\ndetermine the decay rate of the number density of the outer electron radiation belt prior to\nthe onset of high-speed-stream-driven geomagnetic storms. Superposed-data analysis is\nused with a collection of 124 storms. When there is a calm before the storm, the electron\nnumber density decays exponentially before the storm with a 3.4-day e-folding time:\nbeginning about 4 days before storm onset, the density decreases from \u00024 \u0003 10\u00044 cm\u00043 to\n\u00021 \u0003 10\u00044 cm\u00043. When there is not a calm before the storm, the number density\ndecay is very small. The decay in the number density of radiation belt electrons is believed\nto be caused by pitch angle scattering of electrons into the atmospheric loss cone as the\nouter plasmasphere fills during the calms. This is confirmed by separately measuring\nthe density decay rate for times when the outer plasmasphere is present or absent. While\nthe radiation belt electron density decreases, the temperature of the electron radiation belt\nholds approximately constant, indicating that the electron precipitation occurs equally at\nall energies. Along with the number density decay, the pressure of the outer electron\nradiation belt decays, and the specific entropy increases. From the measured decay rates,\nthe electron flux to the atmosphere is calculated, and that flux is 3 orders of magnitude less\nthan thermal fluxes in the magnetosphere, indicating that the radiation belt pitch angle\nscattering is 3 orders weaker than strong diffusion. Energy fluxes into the atmosphere are\ncalculated and found to be insufficient to produce visible airglow.\nCitation: Borovsky, J. E., and M. H. Denton (2009), Electron loss rates from the outer radiation belt caused by the filling of the outer\nplasmasphere: The calm before the storm, J. Geophys. Res., 114, A11203, doi:10.1029\/2009JA014063.\n1. Introduction\n[2] The outer portions of the plasmasphere build up and\ndrain away with changes in geomagnetic activity [e.g.,\nChappell et al., 1970; Carpenter et al., 1993; Elphic\net al., 1997; Sandel and Denton, 2007], the buildup occur-\nring when geomagnetic activity is weak and the drainage\noccurring when geomagnetic activity strengthens. During\nrecurrent high-speed-stream-driven storms, the outer plas-\nmasphere goes through an episodic cycle of slowly building\nup in density and then rapidly draining [Borovsky et al.,\n1998a; Borovsky and Steinberg, 2006; Borovsky and\nDenton, 2008]. During recurrent high-speed-stream-driven\nstorms the number density of the outer electron radiation\nbelt at geosynchronous orbit also goes through an episodic\ncycle [Borovsky et al., 1998a].\n[3] Prior to most high-speed-stream-driven storms,\nintervals of unusually calm geomagnetic activity occur\n[Borovsky and Steinberg, 2005, 2006]. The working defini-\ntion of a calm is a period where Kp dips below 1 and remains\nbelow 1.5 for at least 6 h. As explained by Borovsky and\nSteinberg [2006], these ‘‘calms before the storms’’ are\ncaused by a Russell-McPherron effect acting on the Parker\nspiral magnetic field ahead of the sector reversal in the CIR\n(corotating interaction region): When it is Russell-McPherron\nfavorable to have a storm after the CIR it is therefore\nRussell-McPherron favorable to have a calm before the\nCIR. This tendency for calms to occur before high-speed-\nstream-driven storms is demonstrated in Figure 1 (top),\nwhere the superposed average of the Kp index is plotted\nfor 124 high-speed-stream-driven storms, where the zero\nepoch is the onset of storm levels of convection. The plot\nbegins 20 days prior to storm onset. As can be seen, for the\nfirst 15 days of the plot the superposed average of the Kp\nindex maintains at about 2.3 (gray dashed curve). Then about\n5 days before storm onset the superposed average begins a\nsystematic decrease. This average is decreasing because of\nthe tendency of calms to occur before storms and the\nindividual calms have various durations [cf. Borovsky and\nSteinberg, 2006]. During these calms before the storms [see\nalso Clilverd et al., 1993; Borovsky et al., 1998a], the outer\nplasmasphere builds up out to large radii in the dipolar\nportions of the magnetosphere [Denton and Borovsky,\n2008]. This buildup of cold-plasma density prior to storm\nonset can be seen in Figure 1 (bottom); the buildup begins\nabout 5 days prior to storm onset in the superposed average of\nthe measured cold-plasma density at geosynchronous orbit. It\nis anticipated that when the outer plasmasphere is present,\nJOURNAL OF GEOPHYSICAL RESEARCH, VOL. 114, A11203, doi:10.1029\/2009JA014063, 2009\nClick\nHere\nfor\nFull\nArticle\n1Los Alamos National Laboratory, Los Alamos, New Mexico, USA.\n2Department of Communication Systems, Lancaster University, Lan-\ncaster, UK.\nCopyright 2009 by the American Geophysical Union.\n0148-0227\/09\/2009JA014063$09.00\nA11203 1 of 12\nplasma waves that reside in the plasmasphere can pitch angle\ndiffuse radiation belt electrons into the atmospheric loss cone\n[e.g., Smith et al., 1974; Kelley et al., 1975; Albert, 2004;\nSummers et al., 2004; Shprits and Thorne, 2004], wherein the\nelectrons are lost from the magnetosphere. Indeed, the\nnumber density of the outer radiation belt decreases with\ntime in the days prior to high-speed-stream-driven storm\nonset [e.g., Borovsky et al., 1998a, Figure 13; Denton et al.,\n2009, Figure 7]. Other loss mechanisms, such as outward\nradial diffusion [e.g., Brautigam and Albert, 2000; Shprits et\nal., 2006], magnetopause shadowing [e.g., West et al., 1972;\nLi et al., 1997; Desorgher et al., 2000; Bortnik et al., 2006a],\nand the Dst effect [e.g., Dessler and Karplus, 1961; Kim and\nChan, 1997], should be reduced in importance during these\ngeomagnetically calm intervals.\n[4] Unlike high-speed-stream-driven storms wherein\ncalms tend to occur prior to storm onset, calms do not\ntend to occur prior to coronal-mass-ejecta-driven storms\n[Borovsky and Denton, 2006]. In general, magnetic-cloud-\ndriven (CME-driven) geomagnetic storms do not show a\nsubstantial loss of radiation belt electrons before the storm\n[cf. Denton et al., 2009, Figure 8].\n[5] Preliminary measurements of d(log(n))\/dt from one\nspacecraft in 1993 and 1994 showed that the loss rates of\nouter radiation belt electrons are higher during days when\nthe outer plasmasphere is present than times when the outer\nplasmasphere is not seen [Borovsky and Steinberg, 2006].\nThese preliminary measurements yielded a loss rate for the\nradiation belt number density with an exponential e-folding\ntime of 2.6 days in the presence of the plasmasphere. In that\nBorovsky and Steinberg [2006] study, this electron loss rate\nwas overestimated owing to the inclusion of some radiation\nbelt dropouts in the measurements.\n[6] Recently, Meredith et al. [2006] measured the rela-\ntivistic-electron flux decay rates for the outer electron\nradiation belt in the region 3.0 < L < 5.0 during geomag-\nnetically quiet periods: e-folding times for the fluxes of 1.5\nto 6.5 days were obtained. These flux decay rates were\nsimilar to rates obtained from prior investigations in the\n2.0 < L < 5.0 region of the magnetosphere [e.g., Lyons et\nal., 1972; West et al., 1981; Seki et al., 2005].\n[7] Flux decay rates have also been measured for\nelectrons in the inner radiation belt [e.g., Pfitzer and\nWinckler, 1968; Tsurutani et al., 1975; Selesnick et al.,\n2003; Selesnick, 2006; Baker et al., 2007].\n[8] In this report, the loss rates of electrons from the outer\nelectron radiation belt at geosynchronous orbit will be\nmeasured using data superposition of 124 high-speed-\nstream-driven storms. The temporal changes in the number\ndensity of the outer electron radiation belt will be compared\nfor storms with calms beforehand and storms without calms\nbeforehand.\n[9] This manuscript is organized as follows. In section 2\nthe spacecraft measurements and data analysis techniques\nutilized are discussed. In section 3 the measurements of the\nelectron loss rates before storms are presented. In section 4\nthose loss rate measurements are used to calculate the fluxes\nof electrons into the upper atmosphere before geomagnetic\nstorms. Section 5 contains discussions about the mecha-\nnisms leading to the electron loss, about the fluxes of\nelectrons into the atmosphere, and about relativistic-electron\ndropouts at storm onset. Section 6 contains a summary of\nfindings.\n2. Density-Temperature Description of Outer\nElectron Radiation Belt\n[10] Measurements of the number density n and the\ntemperature T of the outer electron radiation belt at geosyn-\nchronous orbit are obtained as follows. The omnidirectional\nfluxes of energetic electrons are measured every 10 s by the\nSynchronous Orbit Particle Analyzer (SOPA) [Belian et al.,\n1992; Cayton and Belian, 2007] onboard 7 satellites in\ngeosynchronous orbit (6.6 RE). The electrons are measured\nin the energy range \u000230 keV to >2 MeV. Relativistic\nbi-Maxwellian fits to the measured electrons fluxes are\nmade every 10 s [cf. Cayton et al., 1989; Cayton and\nBelian, 2007]. The bi-Maxwellian fitting describes two\npopulations of electrons: a ‘‘soft’’ population of electrons\nwith a temperature of \u000230 keV and a ‘‘hard’’ population of\nelectrons with a temperature of \u0002150 keV. The ‘‘soft’’\npopulation is the suprathermal tail of the electron plasma\nsheet, which is strongly modulated at geosynchronous orbit\nby the occurrence of substorms [Lezniak et al., 1968; Birn et\nal., 1998]. The hard component is the outer electron\nradiation belt [Cayton et al., 1989; Belian et al., 1996].\nFigure 1. For 124 high-speed-stream-driven storms, (top)\nthe superposed average of the Kp index and (bottom) the\nsuperposed average of the local-time-averaged cold-plasma\ndensity are plotted for 20 days prior to storm onset to\n20 days after storm onset. The cold-plasma density is\nmeasured at geosynchronous orbit by the multisatellite\nMPA plasma detectors.\nA11203 BOROVSKY AND DENTON: RADIATION BELT ELECTRON LOSS RATES\n2 of 12\nA11203\n[11] From the 10-s-resolution density and temperature\nmeasurements, median values of the density and tempera-\nture are calculated for every 30 min of measurement [cf.\nDenton et al., 2009]. Taking only the median values reduces\nthe influence of outliers when the fits are noisy.\n[12] Changes in the number density n of the outer\nelectron radiation belt are taken to be an indicator of the\nloss and gain of electrons from the magnetosphere and\nchanges in the temperature T of the outer electron radiation\nbelt are taken to be an indicator of the heating and cooling\nof the radiation belt electron population [cf. Denton et al.,\n2009; J. E. Borovsky and M. H. Denton, Examining the\nspecific entropy (density of adiabatic invariants) of the outer\nelectron radiation belt, submitted to Journal of Geophysical\nResearch, 2009].\n[13] To measure the loss rates of electrons from the outer\nradiation belt before storms, superposed data analysis for\nhigh-speed-stream-driven storms will be utilized. The t = 0\ntrigger for the data superposition will be the onset of storm\nlevels of convection in the magnetosphere (storm onset).\nRelativistic-electron dropouts occur at about the time of\nstorm onset [Borovsky and Denton, 2009], so with the\nsuperposed-epoch technique relativistic-electron dropouts\ncan be clearly excluded from the measurements of electron\nloss rate. This will provide estimates of the electron loss\nrates prior to storms that are superior to the measurements\nmade by Borovsky and Steinberg [2006]. The superposed-\nepoch analysis techniques follow the methodology of\nDenton et al. [2006].\n[14] The superposed-epoch data analysis is performed on\n124 high-speed-stream-driven storms that occurred between\n1993 and 2006. The 124 events were collected by identify-\ning corotating interaction regions (CIRs) in the solar wind\n(e.g., east\/west flow deflections followed by sustained\nelevated wind speed) and then requiring a sustained level\nof high Kp (a storm) following the passage of the CIR\n[Denton and Borovsky, 2008, 2009; Borovsky and Denton,\n2008, 2009]. If the storm in the Kp index did not repeat with\na 27-day period, then the storm event was not included in\nthe collection.\n3. Density Loss During Calms Before Storms\n[15] In each of the three plots of Figure 2, the base-10\nlogarithm of the number density n of the outer electron\nradiation belt is plotted in color as a function of time\n(horizontal axis) and local time (vertical axis). Figure 2\n(top) is from a superposition of data from 124 high-speed-\nstream-driven storms, Figure 2 (middle) is from a superpo-\nsition of data from a subset of 41 high-speed-stream-driven\nstorms that definitely did not have calms beforehand, and\nFigure 2 (bottom) is from a superposition of a subset of 24\nstorms that clearly had well-defined calms beforehand. (59\nstorms wee note definitely in one category or the other.) In\nall three plots of Figure 2 time t = 0 is chosen to be the onset\nof storm levels of magnetospheric convection. Specifically,\nstorm onset is detected by a strong rise in the Kp index [cf.\nElphic et al., 1999; Thomsen, 2004], with the final onset\ntime calculated to \u000230 min time resolution using changes in\nthe MBI (Midnight Boundary Index) [Madden and Gussen-\nhoven, 1990] to determine the time at which convection is\nequivalent to convection at a Kp value of 4+. In Figure 2\n(top) it is seen that the number density of the outer electron\nradiation belt decreases with time before high-speed-stream-\ndriven storms. As can be seen by comparing Figure 2\n(middle) and Figure 2 (bottom), for the storms with calms\nbeforehand (Figure 2, bottom) the number density of the\nouter electron radiation belt at geosynchronous orbit\ndecreases steadily with time in the days before the storm,\nwhereas for the storms without calms (Figure 2, middle) the\nnumber density does not decrease as strongly prior to the\nstorm onset. Note in Figure 2 (bottom) for the storms with\ncalms that the number density decreases with time at all\nlocal times.\nFigure 2. The base-10 logarithm of the number density of\nthe outer electron radiation belt at geosynchronous orbit is\nplotted as functions of time (horizontal) and local time\n(vertical) for data superpositions triggered on storm\nonset. (top) The superposition is from 124 high-speed-\nstream-driven storms. (middle) The superposition is from\na subset of 41 high-speed-stream-driven storms without\ncalms beforehand. (bottom) The superposition is from a\nsubset of 24 high-speed-stream-driven storms with calms\nbeforehand.\nA11203 BOROVSKY AND DENTON: RADIATION BELT ELECTRON LOSS RATES\n3 of 12\nA11203\n[16] In Figure 3 the local-time-averaged logarithm of the\nnumber density n of the outer electron radiation belt at\ngeosynchronous orbit is plotted as a function of time before\nthe onset of high-speed-stream-driven storms. The three\ncurves are for all 124 storms (black curve), storms without\ncalms (blue curve), and storms with calms (red curve). The\nthree curves represent the vertical integrals of the data in the\nthree plots of Figure 2. In the time range from 4 days to 1\/2\nday before the storm onset, all three curves are fit with\nexponential functions (smooth curves in Figure 3) and the\nparameters of the fits are indicated. For the superposition of\nall high-speed-stream-driven storms (black curve), there is a\ndistinctive decay of the number density n of the outer\nelectron radiation belt in the days before storm onset: the\nexponential fit has a density e-folding time of 6.1 days.\nNote in Figure 3 the drastic difference in the number density\ndecay rates between the storms with calms (red) and the\nstorms without calms (blue). For storms with calms before-\nhand, the number density of the outer electron radiation belt\nat geosynchronous orbit begins to decay about 4 days prior\nto storm onset: the logarithmic average of the number\ndensity decreases from \u00024 \u0003 10\u00044 cm\u00043 to \u00021 \u0003 10\u00044 cm\u00043\nin a few days. For storms with calms the exponential fit to the\nnumber density is of the form\nn ¼ 1:26\u0003 10\u00044 expð\u0004t=3:4 dayÞcm\u00043 ð1Þ\nvalid for t = \u00044 days to t = \u00040.5 day, an exponential decay\nwith a 3.4-day e-folding time. For the storms without calms\nthe exponential fit of the number density before the storm is\n3.43 \u0003 10\u00044 exp(\u0004t\/24.4 day) cm\u00043 valid for t = \u00044 days\nto t = \u00040.5 day, an exponential decay with a 24.4-day\ne-folding time. The decay rate is much stronger before the\nonset of storms with calms beforehand than it is before\nthe onset of storms without calms beforehand.\n[17] In Figure 4 the local time dependence of the temporal\ndecay of the number density of the outer electron radiation\nbelt at geosynchronous orbit is examined. In Figure 4 (left)\nand Figure 4 (right), exponential fits to the number density\nin the time range t = \u00044 days to t = \u00040.5 day (before storm\nonset) are plotted: The fits are to measurements taken at\nlocal noon (blue curves), local dawn (green curves), local\ndusk (red curves), and local midnight (black curves). The\nfits in Figure 4 (left) are for superpositions of data from 24\nstorms with calms beforehand and the fits in Figure 4 (right)\nare from 41 storms without calms beforehand. The func-\ntional forms of the fitted exponentials are indicated near\neach curve. As can be seen in Figure 4 (left), during calms\nthe decay of the number density occurs at all local times\nwith essentially the same decay rate (the same e-folding\ntime).\n[18] In Figure 5 several quantities describing the outer\nelectron radiation belt at geosynchronous orbit are plotted as\nfunctions of time before high-speed-stream-driven storms.\nFigures 5a, 5c, 5e, and 5g pertain to storms with calms\nbeforehand, and Figures 5b, 5d, 5f, and 5h pertain to storms\nwithout calms beforehand. In Figures 5a and 5b the number\ndensity n of the outer electron radiation belt is plotted, in\nFigures 5c and 5d the temperature T of the outer electron\nradiation belt is plotted, in Figures 5e and 5f the pressure\nP = nkBT of the outer electron radiation belt is plotted, and\nin Figures 5g and 5h the specific entropy S = T\/n2\/3 of the\nouter electron radiation belt is plotted. Also plotted in gray\nFigures 5g and 5h is the relativistically corrected specific\nentropy Srel = T\/n\n2\/3 (1 + T\/2mc2) (cf. Borovsky and\nDenton, submitted manuscript, 2009). Time t = 0 is the\nonset of storm levels of magnetospheric convection. Expo-\nnential fits to the various curves are shown in gray in\nFigure 5 and the fit parameters are indicated in Figures 5a–\n5h and in Table 1. As can be seen in Figures 5c and 5d, the\ntemperature of the outer electron radiation belt at geosyn-\nchronous orbit is nearly constant with time as the number\ndensity does or does not decay. The decay of the number\ndensity n for the storms with calms beforehand (Figures 5a,\n5c, 5e, and 5g) leads to a temporal decay of the energy\ndensity (pressure P) of the outer electron radiation belt\nbefore the storm (Figure 5e): this temporal decay is approx-\nimately exponential with time (see fit). The specific entropy\nS has been shown to be a useful one-parameter description of\nthe evolution of the outer electron radiation belts during all\ntypes of geomagnetic storms (Borovsky and Denton, sub-\nmitted manuscript, 2009). The temporal decrease in the\nnumber density at constant temperature produces an increase\nin the specific entropy S (Figure 5g) of the outer electron\nradiation belt: this temporal increase is approximately expo-\nnential with time (see fits). The entropy changes throughout\nthe phases of high-speed-stream-driven storms are discussed\nin greater detail by Borovsky and Denton (submitted man-\nuscript, 2009). For the storms without the calms (Figures 5b,\nFigure 3. The local-time-averaged logarithm of the\nnumber density of the outer electron radiation belt at\ngeosynchronous orbit is plotted as a function of time for\ndata superpositions triggered on storm onset. The black\ncurve is for 124 high-speed-stream-driven storms, the blue\ncurve is for a subset of 41 storms without calms beforehand,\nand the red curve is for a subset of 24 storms with cams\nbeforehand. Exponential fits to the data in the time range t =\n\u00044 days to t = \u00040.5 day are shown as the smooth curves.\nA11203 BOROVSKY AND DENTON: RADIATION BELT ELECTRON LOSS RATES\n4 of 12\nA11203\n5d, 5f, and 5h), the strong decrease of the pressure does not\noccur nor does the strong increase in the specific entropy\noccur.\n[19] In Table 1 the fit parameters from Figure 5 for the\nnumber density n, temperature T, pressure P, specific entropy\nS, and relativistically corrected specific entropy Srel are\ncollected for storms with calms (Figures 5a, 5c, 5e, and 5g)\nand for storms without calms (Figures 5b, 5d, 5f, and 5h).\n4. Electron Flux to the Atmosphere\n[20] The electron flux from the outer electron radiation\nbelt into the atmosphere is calculated as follows. The total\nnumber of electrons N in a flux tube of volume V is N = nV,\nwhere n is the number density of electrons in the flux tube.\nTaking the time derivative of this expression, the rate of\nchange of the total number of electrons in the flux tube is\ngiven by\ndN=dt ¼ Vdn=dt; ð2Þ\nwhere dn\/dt is the rate of change of the number density n in\nthe magnetosphere. Assuming that pitch angle scattering\ninto the atmosphere is the only avenue for loss from the flux\ntube, the loss rate dN\/dt of electrons from the flux tube is\ngiven by the flux of electrons Fatm into the atmosphere times\nthe cross-sectional area Aatm of the flux tube in the\natmosphere times 2 for two atmospheres (northern and\nsouthern):\ndN=dt ¼ 2FatmAatm: ð3Þ\nEquating expressions (2) and (3) yields\nFatm ¼ ðV=2AatmÞdn=dt; ð4Þ\nwhere V\/Aatm is the ratio of the volume of a flux tube to its\ncross-sectional area in the atmosphere and dn\/dt is the rate\nof decay of the number density in the magnetosphere. By\nconservation of magnetic flux in the flux tube at the\natmosphere and at the equator BatmAatm = BeqAeq, the area\nof the flux tube in the atmosphere Aatm can be expressed in\nterms of the area at the equator Aeq as\nAatm ¼ AeqðBeq=BatmÞ; ð5Þ\nwhere Beq and Batm are the magnetic field strengths in the\nflux tube at the equator and at the atmosphere. With\nexpression (5) for Aatm, expression (4) becomes\nFatm ¼ ð1=2ÞðV=AeqÞðBatm=BeqÞdn=dt: ð6Þ\nAt geosynchronous orbit (6.6 RE), V\/Aeq = 7.6 \u0003 109 cm\n(obtained by integrating a dipole field from one atmosphere\nto the other atmosphere [cf. Borovsky et al., 1998b,\nFigure 4]), Batm = 0.56 gauss [e.g., Knecht and Schuman,\n1985], and Beq = 96 nT (the median value as measured by\nthe GOES 10 satellite in 2000–2003). The time derivative\nof expression (1) for n yields dn\/dt = 4.29 \u0003 10\u000410 exp(\u0004t\/\n3.4 day) cm\u00043s\u00041 valid for t = \u00044 days to t = \u00040.5 day.\nUsing these values, expression (6) becomes\nFatm ¼ 950 e\u0004t=3:4 daycm\u00042s\u00041: ð7Þ\nFigure 4. (left) For 24 storms with calms beforehand and (right) for 41 storms without calms\nbeforehand, exponential fits to the superposed data are shown. The blue curve is for a 3-h-wide local time\nband around local noon, the green curve is for a 3-h-wide band around local dawn, the red curve is for a\n3-h-wide band around local dusk, and the black curve is for a 3-h-wide band around local midnight.\nA11203 BOROVSKY AND DENTON: RADIATION BELT ELECTRON LOSS RATES\n5 of 12\nA11203\nAt peak (t = \u00044 days) the electron flux into the atmosphere\nis Fatm = 3080 cm\n\u00042s\u00041.\n[21] Note that if the precipitation rate of radiation belt\nelectrons is not symmetric with local time [e.g., Selesnick et\nal., 2003; Clilverd et al., 2007; Jordanova et al., 2008], then\nthe fluxes to the atmosphere will be larger than expression\n(7) at some local times and lower than expression (7) at\nother local times.\n[22] In the magnetosphere the thermal flux of electrons in\nthe outer radiation belt is Fmag \u0005 nvTe where vTe is the\nthermal velocity of the radiation belt electrons. At t =\n\u00044 days, the number density of the outer electron radiation\nbelt is n \u0005 4 \u0003 10\u00044 cm\u00043 and the temperature is T =\nFigure 5. (a, c, e, g) For a superposition of data from 24 high-speed-stream-driven storms with calms\nbeforehand and (b, d, f, h) for a superposition of data from 41 high-speed-stream-driven storms without\ncalms beforehand, the number density (Figures 5a and 5b), temperature (Figures 5c and 5d), pressure\n(Figures 5e and 5f), and specific entropy (Figures 5g and 5h) are plotted. The time t = 0 is the onset of\nstorm convection. In Figures 5g and 5h, the gray curves are the relativistic version of the specific entropy.\nA11203 BOROVSKY AND DENTON: RADIATION BELT ELECTRON LOSS RATES\n6 of 12\nA11203\n170 keV (see Figure 5), which gives vTe \u0005 1.6 \u0003 1010 cm\/s.\nThese values give Fmag \u0005 6.5 \u0003 106 cm\u00042s\u00041 at peak.\nComparing this value 6.5 \u0003 106 for the thermal flux in the\nmagnetosphere to the value 3080 of the flux into the\natmosphere at t = \u00044 days finds\nFatm=Fmag \u0005 1=2100: ð8Þ\nIf strong diffusion of the radiation belt electrons were\noperating, the ratio in expression (8) would have a value on\nthe order of unity. Since the ratio is \u000210\u00043, the diffusion of\nelectrons into the loss cone is \u00023 orders of magnitude\nweaker than strong diffusion.\n[23] Realizing that the particle pressure is the thermal\nenergy density, the energy flux into the atmosphere from the\nouter electron radiation belt can be calculated from the\ndecreasing pressure in the magnetosphere as follows. The\ntotal thermal energy content E of a flux tube of volume V is\nE = PV. Taking the time derivative of this, the loss rate of\nthermal energy dE\/dt is hence\ndE=dt ¼ VdP=dt: ð9Þ\nThe loss rate of thermal energy from the flux tube into the\natmosphere is\ndE=dt ¼ FE2Aatm; ð10Þ\nwhere FE is the thermal energy flux into the atmosphere and\nAatm is the area of the flux tube in the atmosphere. Equating\nexpressions (9) and (10) yields\nFE ¼ ðV=2AatmÞdP=dt: ð11Þ\nAgain using expression (5) for Aatm, this becomes\nFE ¼ ð1=2ÞðV=AeqÞðBatm=BeqÞdP=dt: ð12Þ\nThe temporal profile of the pressure of the outer electron\nradiation belt at geosynchronous orbit before a storm\nwith a calm is of the form (see Figure 5 and see Table 1) P =\n4.66\u0003 10\u00043 exp(\u0004t\/4.1 day) nPa, so the time derivative of the\npressure is of the form dP\/dt = 1.33\u0003 10\u000416 exp(\u0004t\/4.1 day)\nerg cm\u00042 s\u00041 (where 1 nPa = 108 erg cm\u00043 was used). Using\nthis value of dP\/dt along with V\/Aeq = 7.6 \u0003 109 cm, Beq =\n96 nT, and Batm = 0.56 gauss, the energy flux into the\natmosphere from the outer electron radiation belt at\ngeosynchronous orbit is FE = 2.94 \u0003 10\u00044 exp(\u0004t\/4.1 day)\nerg cm\u00042 s\u00041 before the storm. At its strongest (time t =\n\u00044 days), this energy flux is FE = 7.8 \u0003 10\u00044 erg cm\u00042 s\u00041.\nThis energy flux is subvisual, with a flux of about 1 erg cm\u00042\ns\u00041 being required to produce visual airglow [Seaton, 1954;\nDalgarno et al., 1965]. (Note that since the radiation belt\nelectrons deposit their energy deeper in the atmosphere\nthan typical aurora, collisional quenching of the 5577-A˚\nemission will require an energy flux of greater than\n1 erg cm\u00042 s\u00041 to produce visible emission.)\n5. Discussion\n[24] The discussion in this section focuses on three topics:\n(1) the interpretation of the observed decay in the number\ndensity of the outer electron radiation belt at geosynchro-\nnous orbit, (2) the potential consequences of the fluxes of\nradiation belt electrons into the atmosphere, and (3) the\nrelativistic-electron dropouts at the onset of high-speed-\nstream-driven storms which follow in time the slow decay\nduring calms.\n5.1. Interpretation of Loss: Waves in the Plasmasphere\n[25] The greatly enhanced loss of electrons from the outer\nradiation belt during calms before storms is believed to be\ncaused by the buildup of the outer plasmasphere during the\ncalms [Borovsky and Steinberg, 2005, 2006], leading to\npitch angle scattering of the radiation belt electrons by\nplasma waves in the plasmasphere [Smith et al., 1974;\nKelley et al., 1975; Albert, 2004; Summers et al., 2004;\nShprits and Thorne, 2004]. During these calms other loss\nmechanisms such as the Dst effect, radial diffusion, and\nmagnetopause shadowing should be reduced. The specific\nplasma wave candidates to pitch angle scatter the electrons\nof the outer radiation belt are (whistler mode) plasmaspheric\nhiss [cf. Lyons et al., 1972;Meredith et al., 2006; Lam et al.,\n2007], lightning-generated whistlers [cf. Voss et al., 1998;\nLauben et al., 2001; Rodger et al., 2003; Bortnik et al.,\n2006b], and electromagnetic ion cyclotron waves [cf.\nSummers and Thorne, 2003; Albert, 2003].\n[26] The differences in the rates of decay between periods\nof calms versus periods that are not calm has been inter-\npreted as the result of their being an outer plasmasphere\nversus their being no outer plasmasphere. However, calms\ncan occur without the outer plasmasphere building up, and\nconversely there can be a built-up outer plasmasphere in the\nabsence of calm. Indeed, an inspection the 24 storms with\ncalms beforehand finds several cases without outer plasma-\nspheres and an inspection of the 41 storms without calms\nbeforehand finds several such cases with built-up outer\nplasmaspheres.\n[27] To clarify the role that the outer plasmasphere plays\nin the decay of the electron-radiation-belt density, a set of\nhigh-speed-stream-driven storms that have built-up outer\nplasmaspheres before onset is compared with a set of high-\nspeed-stream-driven storms without built-up outer plasma-\nspheres beforehand. The temporal profile of the superposed\ntemperature of the outer electron radiation belt is plotted in\nFigure 6 (top) and the temporal profile of the superposed\nnumber density of the outer electron radiation belt is plotted\nTable 1. Exponential Fits for the Range \u00044 Days to \u00040.5 Day Before the Onset of High-Speed-Stream-Driven Storms\nStorms With Calms Storm Without Calms\nNumber density n (cm\u00043) 1.26 \u0003 10\u00044 e\u0004t\/3.40 day 3.43 \u0003 10\u00044 e\u0004t\/24.5 day\nTemperature T (keV) 177 e\u0004t\/189.8 day 150.4 e\u0004t\/48.8 day\nPressure P (nPa) 4.66 \u0003 10\u00043 e\u0004t\/4.07 day 8.82 \u0003 10\u00043 e\u0004t\/16.2 day\nSpecific entropy S (eV cm2) 7.71 \u0003 107 e+t\/5.50 day 3.37 \u0003 107 e+t\/164.1 day\nRelativistic specific entropy Srel (eV cm\n2) 9.11 \u0003 107 e+t\/5.47 day 3.93 \u0003 107 e+t\/185.6 day\nA11203 BOROVSKY AND DENTON: RADIATION BELT ELECTRON LOSS RATES\n7 of 12\nA11203\nin Figure 6 (bottom); the green curves are for 14 storms with\nno calms beforehand and with an absence of outer plasma-\nspheric plasma and the red curves are for 11 storms with\ncalms beforehand that also have built-up outer plasma-\nspheres at geosynchronous orbit for 2 or more days prior\nto storm onset. The absence or presence of a built-up outer\nplasmasphere is determined by an examination of the cold-\nplasma measurements made by the Magnetospheric Plasma\nAnalyzer (MPA) [Bame et al., 1993] onboard the Los\nAlamos geosynchronous satellites; at geosynchronous orbit\nthe outer plasmasphere is present when dense cold plasma is\nmeasured at most local times [e.g., Sojka and Wrenn, 1985;\nLawrence et al., 1999; Su et al., 2001] and the outer\nplasmasphere is absent when dense cold plasma is only\nseen for a few hours of local time in the dusk sector. (The\ncold plasma in the dusk sector is the duskside bulge of the\nplasmasphere extending beyond geosynchronous orbit [cf.\nChappell et al., 1970; Higel and Lei, 1984; Moldwin et al.,\n1994]). The determination of where in local time dense cold\nplasma resides is made by a visual inspection of the MPA\ndaily ion-energy color spectrograms from the multiple\ngeosynchronous satellites; roughly, a cold-plasma number\ndensity of 10 cm\u00043 represents the presence of plasmaspheric\nmaterial. As can be seen in Figure 6 (bottom), before storm\nonset the radiation belt electron density decays strongly in\ntime for storms wherein there is a built up outer plasma-\nsphere in comparison with storms wherein the outer plasma-\nsphere is absent. For storms with confirmed outer\nplasmaspheres the exponential decay of the number density\nhas an e-folding time of 3.0 days, compared to the 11.6-day\ne-folding time for storms without outer plasmaspheres. This\n3.0-day decay (Figure 6) is slightly faster than the 3.4-day\ndecay measured for storms with calms (Figures 3 and 5);\nsome calms do not have built-up plasmaspheres. The 11.6-day\ndecay (Figure 6) is faster than the 24.5-day decay measured\nfor storms without calms (Figures 3 and 5); some intervals\nof no calm do have built-up plasmaspheres. The decay rates\nof Figure 6 are better measures of the decay rates when the\nouter plasmasphere is definitely present (decay rate =\n3.0 days) and definitely absent (decay rate = 11.6 days).\nAs noted at the beginning of section 5.1, the 3.0-day decay\nrate for storms with outer plasmaspheres present may be\nmeasurements of the decay of the electron radiation belt\nowing to whistler mode hiss and electromagnetic ion\ncyclotron waves in the outer plasmasphere. Conversely,\nthe 11.6-day decay rate for storms without outer plasma-\nspheres present may be measurements of the decay of the\nelectron radiation belt owing to whistler mode hiss and\nelectromagnetic ion cyclotron waves in the duskside bulge\nof the plasmasphere [e.g., Carpenter, 1970; Koons and\nRoeder, 1990; Bespalov et al., 1990; Lorentzen et al.,\n2000; Jordanova et al., 2003] and to whistler mode chorus\nwaves outside the plasmapause [e.g., Glauert and Horne,\n2005; Thorne et al., 2005; Shprits et al., 2007]. Note that\nwhistler mode chorus is also anticipated to heat the electron\nradiation belt [cf. Summers et al., 1998; Meredith et al.,\n2002; Horne and Thorne, 2003; Horne et al., 2005; Bortnik\nand Thorne, 2007] in addition to scattering its electrons into\nthe loss cone: As can be seen by examining the green curve\nin Figure 6 (top), no significant change in the temperature of\nthe outer electron radiation belt is seen as the number\ndensity decays in the absence of an outer plasmasphere.\n[28] Note that ejecta-driven geomagnetic storms do not\nshow a trend of decaying number density of the outer\nelectron radiation belt at geosynchronous orbit in the days\nbefore storm onset (cf. Borovsky and Denton, submitted\nFigure 6. For data superpositions of high-speed-stream-\ndriven storms, the (top) local-time-averaged temperature\nand (bottom) number density of the outer electron radiation\nbelt at geosynchronous orbit are plotted as a function of\ntime. Time t = 0 is the storm onset. The green curves are for\n14 storms without calms beforehand and without built-up\nouter plasmaspheres. The red curves are for 11 storms with\ncalms beforehand and with built-up outer plasmaspheres.\nThe smooth curves are exponential fits of the data between\nt = \u00044 days and t = \u00040.5 day.\nA11203 BOROVSKY AND DENTON: RADIATION BELT ELECTRON LOSS RATES\n8 of 12\nA11203\nmanuscript, 2009, Figure 10). This may be because ejecta-\ndriven storms do not tend to have calms occurring before\nstorm onset [Borovsky and Steinberg, 2006; Borovsky and\nDenton, 2006] and hence they do not tend to have built-up\nouter plasmaspheres before the storms.\n5.2. Fluxes of Energetic Electrons Into the Atmosphere\n[29] In section 4 it was calculated that the electron fluxes\nfrom the outer electron radiation belt at geosynchronous\norbit into the atmosphere are about Fatm \u0005 3080 cm\u00042s\u00041 at\ntheir highest during calms before high-speed-stream-driven\nstorms if the precipitating fluxes are uniform in local time.\n(If the precipitating fluxes are not uniform in local time, the\nfluxes will be higher than 3080 cm\u00042s\u00041.) These fluxes into\nthe atmosphere are about 1\/2100 times as strong as thermal\nfluxes in the outer electron radiation belt in the magneto-\nsphere, indicating that the diffusion into the loss cone\nduring calms is 3 orders of magnitude weaker than strong\ndiffusion. In section 4 it was also calculated that the energy\nflux of these radiation belt electrons is on the order of FE \u0005\n7.8 \u0003 10\u00044 erg cm\u00042 s\u00041 (if it is uniform in local time).\nThese 7.8 \u0003 10\u00044 erg cm\u00042 s\u00041 fluxes are subvisual in\nterms of the production of airglow.\n[30] Even though the relativistic-electron fluxes to the\natmosphere during calms before storms are subvisual, the\nprecipitation of these electrons into the atmosphere should\nnot be ignored [cf. Thorne, 1980; Baker et al., 1993;\nLastovicka, 1996; Siskind, 2002]. Precipitating electrons\nwith energies of 150 keV and above deposit most of their\nenergy at altitudes of about 75 km and lower [e.g., Rees,\n1963, 1964]. The effects of energetic electrons on atmo-\nspheric chemistry [e.g., Thorne, 1997; Callis et al., 1991,\n1998; Rozanov et al., 2005; Randall et al., 2007], iono-\nspheric profiles [e.g., Larsen et al., 1976; Goldberg et al.,\n1984; Frahm et al., 1997; Rodger et al., 2007], atmospheric\nelectricity [e.g., Sheldon et al., 1988; Tinsley et al., 2007],\nand climate [e.g., Lastovicka, 1996; Kniveton and Tinsley,\n2004] are presently being considered. Calms before storms\nprecondition the magnetosphere for the storms in several\nways [cf. Borovsky and Steinberg, 2006; Borovsky and\nDenton, 2006]. This enhanced precipitation from the outer\nelectron radiation belts during calms may provide an avenue\nfor the solar wind upstream of CIRs to precondition the\natmosphere and the ionosphere for the high-speed-stream-\ndriven storms. Preconditioning aside, there may be impor-\ntant atmospheric and ionospheric effects in the days leading\nup to storms and we suggest that future research projects\ncould discern such effects statistically by means of super-\nposed-epoch studies such as the studies of this report.\n5.3. Electron Fluxes Into the Atmosphere During\nRelativistic-Electron Dropouts\n[31] In comparison with the electron fluxes during calms\nbefore the storms, the electron fluxes from the outer\nradiation belt into the atmosphere during relativistic-elec-\ntron dropouts at storm onset are more than an order of\nmagnitude more intense. In a relativistic-electron dropout\nthe number density decreases by more than 1 \u0003 10\u00044 cm\u00043\nin about 6 h [Borovsky and Denton, 2009; Borovsky and\nDenton, submitted manuscript, 2009]. This gives a dn\/dt\nvalue of dn\/dt \u0005 5 \u0003 10\u00049 cm\u00043 s\u00041, which is 3.5 times\nlarger than the dn\/dt = 1.4 \u0003 10\u00049 cm\u00043 s\u00041 value for\ncalms. During relativistic-electron dropouts the loss of\nelectrons probably does not occur at all local times, but\nrater it is confined to the plasmaspheric drainage plume in\nthe afternoon sector. At geosynchronous orbit, plumes are\nabout 4 h wide in local time at the onset of high-speed-\nstream-driven storms [Borovsky and Denton, 2008], which\nboosts the local flux by a factor of 24\/4 = 6. With the 3.5\nfactor increase in dn\/dt and the factor 6 increase for local\ntime effects, the electron flux into the atmosphere is Fatm \u0005\n2 \u0003 105 cm\u00042 s\u00041. For n = 2 \u0003 10\u00044 cm\u00043 and T = 170 keV,\nthe thermal flux in the outer electron radiation belt in the\nmagnetosphere is Fmag \u0005 3.2 \u0003 106 cm\u00042 s\u00041. Comparing\nthese two numbers finds Fatm\/Fmag \u0005 1\/16. The pitch angle\ndiffusion rate during relativistic-electron dropouts is about 1\norder of magnitude weaker than strong diffusion. If the\nprecipitation of electrons from the outer radiation belt maps\nto only a portion of the plasmaspheric drainage plume\nduring relativistic-electron dropouts, then the flux to the\natmosphere is higher and the diffusion may be strong\ndiffusion.\n[32] During the relativistic-electron dropouts at storm\nonset, the energy flux into the atmosphere from the outer\nradiation belt is larger than the energy flux during calms\nbefore the storms. With dn\/dt = 5 \u0003 10\u00049 cm\u00043 s\u00041, T =\n170 keV, and a 5-h wide plume, the estimated energy flux\ninto the atmosphere is FE \u0005 0.9 erg cm\u00042 s\u00041, approxi-\nmately the 1 erg cm\u00042 s\u00041 to produce visible airglow.\n6. Summary\n[33] There is a slow decay of the number density n of the\nouter electron radiation belt at geosynchronous orbit during\ncalms before high-speed-stream-driven storms. The decay\nstarts about 4 days prior to storm onset. When there is no\ncalm before the storm, the decay in the number density is\nvery slight. No calm, no loss. The specific findings of this\nstudy are the following.\n[34] 1. The decay of the number density is believed to be\ncaused by electrons being pitch angle scattered into the\natmospheric loss cone by plasma waves in the outer plasma-\nsphere, which grows during the calms.\n[35] 2. When storms without outer plasmaspheres before-\nhand are compared with storms with outer plasmaspheres\nbeforehand, a distinct difference in the decay rate of the\nnumber density of the outer electron radiation belt at\ngeosynchronous orbit is observed. The e-folding lifetime\nof the number density is 3.0 days when the outer plasma-\nsphere is present and the lifetime is 11.6 days when the\nouter plasmasphere is absent.\n[36] 3. The number density decay rate during the calms\nbefore the storms is fit as n = 1.26 \u0003 10\u00044 e\u0004t\/3.40 day cm\u00043\n(valid for t = \u00044 days to t = \u00040.5 day), which has an\nexponential e-folding decay time of 3.4 days.\n[37] 4. The rate of decay of the number density n of the\nouter electron radiation belt at geosynchronous orbit is\nsimilar at all local times.\n[38] 5. During calms before storms, as the number density\nn steadily decays, the temperature T of the outer electron\nradiation belt at geosynchronous orbit stays approximately\nconstant. The temperature remaining constant as the elec-\ntrons precipitate to the atmosphere indicates that the pitch\nA11203 BOROVSKY AND DENTON: RADIATION BELT ELECTRON LOSS RATES\n9 of 12\nA11203\nangle scattering into the loss cone acts equally at all\nenergies.\n[39] 6. During calms before storms, as the number density\nof the outer electron radiation belt decreases the pressure P\nof the outer electron radiation belt decreases. If there is no\ncalm, there is no decrease in the pressure of the outer\nelectron radiation belt. This pressure is equal to the thermal\nenergy density of the outer electron radiation belt.\n[40] 7. During calms before storms, as the number density\nof the outer electron radiation belt decreases the specific\nentropy S of the outer electron radiation belt increases. If\nthere is no calm, there is no increase in the specific entropy\nof the outer electron radiation belt.\n[41] 8. The flux of outer radiation belt electrons into the\natmosphere is 3 orders of magnitude less than the thermal\nflux of outer radiation belt electrons in the magnetosphere,\nindicating that the scattering into the loss cone is 3 orders of\nmagnitude slower than strong diffusion.\n[42] 9. The deposition of energy into the atmosphere by\nthe precipitating outer radiation belt electrons at geosyn-\nchronous orbit during calms is too small to produce visible\nairglow.\n[43] 10. Relativistic-electron dropouts at storm onset\nfollow the decay of the outer electron radiation belt during\ncalms before the storms. If there is a calm before the storm,\nthe relativistic-electron dropout is deeper [Borovsky and\nDenton, 2009; Borovsky and Denton, submitted manu-\nscript, 2009]. During relativistic-electron dropouts the local\nfluxes of electrons into the atmosphere are much higher (but\nbriefer) than during calms before storms.\n[44] Acknowledgments. The authors wish to thank Tom Cayton for\nproviding the density-temperature fits for the SOPA energetic particle data\nset and to thank Reiner Friedel for his help. J.E.B. wishes to thank the\nDepartment of Communication Systems at Lancaster University for their\nhospitality, and M.H.D. wishes to thank the Space Science and Applications\nGroup and LANL for their hospitality. This work was supported by the\nNASA Living with a Star TR&T Program and by the Los Alamos National\nLaboratory LDRD Program.\n[45] Amitava Bhattacharjee thanks Richard Denton and another\nreviewer for their assistance in evaluating this paper.\nReferences\nAlbert, J. M. (2003), Evaluation of quasi-linear diffusion coefficients for\nEMIC waves in a multispecies plasma, J. Geophys. Res., 108(A6), 1249,\ndoi:10.1029\/2002JA009792.\nAlbert, J. M. (2004), Using quasi-linear diffusion to model acceleration and\nloss from wave-particle interactions, Space Weather, 2, S09S03,\ndoi:10.1029\/2004SW000069.\nBaker, D. N., R. A. Goldberg, F. A. Herrero, J. B. Blake, and L. B. Callis\n(1993), Satellite and rocket studies of relativistic electrons and their\ninfluence on the middle atmosphere, J. Atmos. Terr. Phys., 55, 1619,\ndoi:10.1016\/0021-9169(93)90167-W.\nBaker, D. N., S. G. Kanekal, R. B. Horne, N. P. Meredith, and S. A. Glauert\n(2007), Low-altitude measurements of 2–6 MeV electron trapping life-\ntimes at 1.5 \u0006 L \u0006 2.5, Geophys. Res. Lett., 34, L20110, doi:10.1029\/\n2007GL031007.\nBame, S. J., D. J. McComas, M. F. Thomsen, B. L. Barraclough, R. C.\nElphic, J. P. Glore, J. T. Gosling, J. C. Chavez, E. P. Evans, and F. J.\nWymer (1993), Magnetospheric plasma analyzer for spacecraft with con-\nstrained resources, Rev. Sci. Instrum., 64, 1026, doi:10.1063\/1.1144173.\nBelian, R. D., G. R. Gisler, T. Cayton, and R. Christensen (1992), High-Z\nenergetic particles at geosynchronous orbit during the great solar proton\nevent series of October 1989, J. Geophys. Res., 97, 16,897, doi:10.1029\/\n92JA01139.\nBelian, R. D., T. E. Cayton, R. A. Christiansen, J. C. Ingraham, M. M.\nMeier, G. D. Reeves, and A. J. Lazarus (1996), Relativistic electrons in\nthe outer-zone: An 11 year cycle; Their relation to the solar wind, in\nWorkshop on the Earth’s Trapped Particle Environment, edited by G. D.\nReeves, AIP Conf. Proc., 383, 13.\nBespalov, P. A., A. Grafe, A. G. Demekhov, and V. Y. Trakhtengerts (1990),\nSome aspects of the dynamics of the asymmetric ring current, Geomagn.\nAeron., 30, 628.\nBirn, J., M. F. Thomsen, J. E. Borovsky, G. D. Reeves, D. J. McComas,\nR. D. Belian, and M. Hesse (1998), Substorm electron injections:\nGeosynchronous observations and test particle simulations, J. Geophys.\nRes., 103, 9235, doi:10.1029\/97JA02635.\nBorovsky, J. E, and M. H. Denton (2006), The differences between CME-\ndriven storms and CIR-driven storms, J. Geophys. Res., 111, A07S08,\ndoi:10.1029\/2005JA011447.\nBorovsky, J. E., and M. H. Denton (2008), A statistical look at plasma-\nspheric drainage plumes, J. Geophys. Res., 113, A09221, doi:10.1029\/\n2007JA012994.\nBorovsky, J. E., and M. H. Denton (2009), Relativistic-electron dropouts\nand recovery: A superposed epoch study of the magnetosphere and the\nsolar wind, J. Geophys. Res., 114, A02201, doi:10.1029\/2008JA013128.\nBorovsky, J. E., and J. T. Steinberg (2005), The calm before the storm in\nCIR\/magnetosphere interactions, Eos Trans. AGU, 86(52), Fall Meet.\nSuppl., Abstract SM54A-05.\nBorovsky, J. E., and J. T. Steinberg (2006), The ‘‘calm before the storm’’ in\nCIR\/magnetosphere interactions: Occurrence statistics, solar-wind statis-\ntics, and magnetospheric preconditioning, J. Geophys. Res., 111, A07S10,\ndoi:10.1029\/2005JA011397.\nBorovsky, J. E., M. F. Thomsen, D. J.McComas, T. E. Cayton, and D. J. Knipp\n(1998a), Magnetospheric dynamics and mass flow during the November\n1993 storm, J. Geophys. Res., 103, 26,373, doi:10.1029\/97JA03051.\nBorovsky, J. E., M. F. Thomsen, R. C. Elphic, T. E. Cayton, and D. J.\nMcComas (1998b), The transport of plasma sheet material from the dis-\ntant tail to geosynchronous orbit, J. Geophys. Res., 103, 20,297,\ndoi:10.1029\/97JA03144.\nBortnik, J., and R. M. Thorne (2007), The dual role of ELF\/VLF chorus\nwaves in the acceleration and precipitation of radiation belt electrons,\nJ. Atmos. Sol. Terr. Phys., 69, 378, doi:10.1016\/j.jastp.2006.05.030.\nBortnik, J., R. M. Thorne, T. P. O’Brien, J. C. Green, R. J. Strangeway, Y. Y.\nShprits, and D. N. Baker (2006a), Observation of two distinct, rapid loss\nmechanisms during the 20 November 2003 radiation belt dropout event,\nJ. Geophys. Res., 111, A12216, doi:10.1029\/2006JA011802.\nBortnik, J., U. S. Inan, and T. F. Bell (2006b), Temporal signatures of\nradiation belt electron precipitation induced by lightning-generated MR\nwhistler waves: 2. Global signatures, J. Geophys. Res., 111, A02205,\ndoi:10.1029\/2005JA011398.\nBrautigam, D. H., and J. M. Albert (2000), Radial diffusion analysis of\nouter radiation belt electrons during the October 9, 1990, magnetic storm,\nJ. Geophys. Res., 105, 291, doi:10.1029\/1999JA900344.\nCallis, L. B., D. N. Baker, J. B. Blake, J. D. Lambeth, R. E. Boughner,\nM. Natarajan, R. W. Klebesadel, and D. J. Gorney (1991), Precipitating\nrelativistic electrons: Their long-term effect on stratospheric odd nitro-\ngen levels, J. Geophys. Res., 96, 2939, doi:10.1029\/90JD02184.\nCallis, L. B., M. Natarajan, J. D. Lambeth, and D. N. Baker (1998),\nSolar-atmospheric coupling by electrons (SOLACE): 2. Calculated stra-\ntospheric effects of precipitating electrons, J. Geophys. Res., 103,\n28,421, doi:10.1029\/98JD02407.\nCarpenter, D. L. (1970), Whistler evidence of the dynamic behavior of the\nduskside bulge in the plasmasphere, J. Geophys. Res., 75, 3837,\ndoi:10.1029\/JA075i019p03837.\nCarpenter, D. L., B. L. Giles, C. R. Chappell, P. M. E. Decreau, R. R.\nAnderson, A. M. Persoon, A. J. Smith, Y. Corcuff, and P. Canu (1993),\nPlasmasphere dynamics in the duskside bulge region: A new look at an\nold topic, J. Geophys. Res., 98, 19,243, doi:10.1029\/93JA00922.\nCayton, T. E., and R. D. Belian (2007), Numerical modeling of the syn-\nchronous orbit particle analyzer, Los Alamos Natl. Lab. Rep. LA-14335,\nLos Alamos, N. M., June.\nCayton, T. E., R. D. Belian, S. P. Gary, T. A. Fritz, and D. N. Baker (1989),\nEnergetic electron components at geosynchronous orbit, Geophys. Res.\nLett., 16, 147, doi:10.1029\/GL016i002p00147.\nChappell, C. R., K. K. Harris, and G. W. Sharp (1970), The morphology of\nthe bulge region of the plasmasphere, J. Geophys. Res., 75, 3848,\ndoi:10.1029\/JA075i019p03848.\nClilverd, M. A., T. D. G. Clark, A. J. Smith, and N. R. Thomson (1993),\nObservation of a decrease in mid-latitude whistler-mode signal occur-\nrence prior to geomagnetic storms, J. Atmos. Terr. Phys., 55, 1479,\ndoi:10.1016\/0021-9169(93)90113-D.\nClilverd, M. A., N. P. Meredith, R. B. Horne, S. A. Glauert, R. R. Anderson,\nN. R. Thomson, F. W. Menk, and B. R. Sandel (2007), Longitudinal and\nseasonal variations in plasmaspheric electron density: Implications for\nelectron precipitation, J. Geophys. Res., 112, A11210, doi:10.1029\/\n2007JA012416.\nDalgarno, A., I. D. Latimer, and J. W. McConkey (1965), Corpuscular\nbombardment and N2\n+ radiation, Planet. Space Sci., 13, 1008,\ndoi:10.1016\/0032-0633(65)90160-1.\nA11203 BOROVSKY AND DENTON: RADIATION BELT ELECTRON LOSS RATES\n10 of 12\nA11203\nDenton, M. H., and J. E. Borovsky (2008), Superposed epoch analysis of\nhigh-speed-stream effects at geosynchronous orbit: Hot plasma, cold\nplasma, and the solar wind, J. Geophys. Res., 113, A07216,\ndoi:10.1029\/2007JA012998.\nDenton, M. H., and J. E. Borovsky (2009), The superdense plasma sheet in\nthe magnetosphere during high-speed-stream-driven storms: Plasma\ntransport timescales, J. Atmos. Sol. Terr. Phys., 71, 1045 – 1058,\ndoi:10.1016\/j.jastp.2008.04.023.\nDenton, M. H., J. E. Borovsky, R. M. Skoug, M. F. Thomsen, B. Lavraud,\nM. G. Henderson, R. L. McPherron, J. C. Zhang, and M. W. Liemohn\n(2006), Geomagnetic storms driven by ICME- and CIR-dominated solar\nwind, J. Geophys. Res., 111, A07S07, doi:10.1029\/2005JA011436.\nDenton, M. H., J. E. Borovsky, and T. E. Cayton (2009), A density-\ntemperature description of the outer electron radiation belt during geo-\nmagnetic storms, J. Geophys. Res., doi:10.1029\/2009JA014183, in press.\nDesorgher, L., E. Fluckiger, P. Buhler, and A. Zehnder (2000), Modelling of\nthe outer electron belt flux dropout and losses during magnetic storm main\nphase, Adv. Space Res., 26, 167, doi:10.1016\/S0273-1177(99)01044-3.\nDessler, A. J., and R. Karplus (1961), Some effects of diamagnetic ring\ncurrents on Van Allen radiation, J. Geophys. Res., 66, 2289, doi:10.1029\/\nJZ066i008p02289.\nElphic, R. C.,M. F. Thomsen, and J. E. Borovsky (1997), The fate of the outer\nplasmasphere, Geophys. Res. Lett., 24, 365, doi:10.1029\/97GL00141.\nElphic, R. C., M. F. Thomsen, J. E. Borovsky, and D. E. McComas (1999),\nInner edge of the electron plasma sheet: Empirical models of boundary\nlocation, J. Geophys. Res., 104, 22,679.\nFrahm, R. A., J. D. Winningham, J. R. Sharber, R. Link, G. Crowley, E. E.\nGaines, D. L. Chenette, B. J. Anderson, and T. A. Potemra (1997), The\ndiffuse aurora: A significant source of ionization in the middle atmo-\nsphere, J. Geophys. Res., 102, 28,203, doi:10.1029\/97JD02430.\nGlauert, S. A., and R. B. Horne (2005), Calculation of pitch angle and\nenergy diffusion coefficients with the PADIE code, J. Geophys. Res.,\n110, A04206, doi:10.1029\/2004JA010851.\nGoldberg, R. A., C. H. Jackman, J. R. Barcus, and F. Soras (1984), Night-\ntime auroral energy deposition in the middle atmosphere, J. Geophys.\nRes., 89, 5581, doi:10.1029\/JA089iA07p05581.\nHigel, B., and W. Lei (1984), Electron density and plasmapause character-\nistics at 6.6 RE: A statistical study of GEOS 2 relaxation sounder data,\nJ. Geophys. Res., 89, 1583, doi:10.1029\/JA089iA03p01583.\nHorne, R. B., and R. M. Thorne (2003), Relativistic electron acceleration\nand precipitation during resonant interactions with whistler-mode chorus,\nGeophys. Res. Lett., 30(10), 1527, doi:10.1029\/2003GL016973.\nHorne, R. B., R. M. Thorne, S. A. Glauert, J. M. Albert, N. P. Meredith, and\nR. R. Anderson (2005), Timescale for radiation belt electron acceleration\nby whistler mode chorus waves, J. Geophys. Res., 110, A03225,\ndoi:10.1029\/2004JA010811.\nJordanova, V. K., A. Boonsiriseth, R. M. Thorne, and Y. Dotan (2003),\nRing current asymmetry from global simulations using a high-resolution\nelectric field model, J. Geophys. Res., 108(A12), 1443, doi:10.1029\/\n2003JA009993.\nJordanova, V. K., J. Albert, and Y. Miyoshi (2008), Relativistic electron\nprecipitation by EMIC waves from self-consistent global simulations,\nJ. Geophys. Res., 113, A00A10, doi:10.1029\/2008JA013239.\nKelley, M. C., B. T. Tsurutani, and F. S. Mozer (1975), Properties of\nELF electromagnetic waves in and above the Earth’s ionosphere deduced\nfrom plasma wave experiments on the OVI-17 and Ogo 6 satellites,\nJ. Geophys. Res., 80, 4603, doi:10.1029\/JA080i034p04603.\nKim, H.-J., and A. A. Chan (1997), Fully adiabatic changes in storm time\nrelativistic electron fluxes, J. Geophys. Res., 102, 22,107, doi:10.1029\/\n97JA01814.\nKnecht, D. J., and B. M. Schuman (1985), The geomagnetic field, in\nHandbook of Geophysics and the Space Environment, edited by A. S.\nJursa, p. 4-1, Natl. Tech. Inf. Serv., Springfield, Va.\nKniveton, D. R., and B. A. Tinsley (2004), Daily changes in global cloud\ncover and Earth transits of the heliospheric current sheet, J. Geophys.\nRes., 109, D11201, doi:10.1029\/2003JD004232.\nKoons, H. C., and J. L. Roeder (1990), A survey of equatorial magneto-\nspheric wave activity between 5 and 8 RE, Planet. Space Sci., 38, 1335,\ndoi:10.1016\/0032-0633(90)90136-E.\nLam, M. M., R. B. Horne, N. P. Meredith, and S. A. Glauert (2007),\nModeling the effects of radial diffusion and plasmaspheric hiss on outer\nradiation belt electrons, Geophys. Res. Lett., 34, L20112, doi:10.1029\/\n2007GL031598.\nLarsen, T. R., J. B. Reagan, W. L. Imhof, L. E. Montbriand, and J. S.\nBelrose (1976), A coordinated study of energetic electron precipitation\nand D region electron concentrations over Ottawa during disturbed con-\nditions, J. Geophys. Res., 81, 2200, doi:10.1029\/JA081i013p02200.\nLastovicka, J. (1996), Effects of geomagnetic storms in the lower iono-\nsphere, middle atmosphere and troposphere, J. Atmos. Terr. Phys., 58,\n831, doi:10.1016\/0021-9169(95)00106-9.\nLauben, D. S., U. S. Inan, and T. F. Bell (2001), Precipitation of radiation\nbelt electrons induced by obliquely propagating lightning-generated\nwhistlers, J. Geophys. Res., 106, 29,745, doi:10.1029\/1999JA000155.\nLawrence, D J., M. F. Thomsen, J. E. Borovsky, and D. J. McComas\n(1999), Measurements of early and late-time plasmasphere refilling as\nobserved from geosynchronous orbit, J. Geophys. Res., 104, 14,691,\ndoi:10.1029\/1998JA900087.\nLezniak, T. W., R. L. Arnoldy, G. K. Parks, and J. R. Winkler (1968),\nMeasurements and intensity of energetic electrons at the equator at 6.6\nRE, Radio Sci., 3, 710.\nLi, X., D. N. Baker, M. Temerin, T. E. Cayton, E. G. D. Reeves, R. A.\nChristensen, J. B. Blake, M. D. Looper, R. Nakamura, and S. G. Kanekal\n(1997), Multispacecraft observations of the outer zone electron variation\nduring the November 3–4, 1993, magnetic storm, J. Geophys. Res., 102,\n14,123, doi:10.1029\/97JA01101.\nLorentzen, K. R., M. P. McCarthy, G. K. Parks, J. E. Foat, R. M. Millan,\nD. M. Smith, R. P. Lin, and J. P. Treilhou (2000), Precipitation of rela-\ntivistic electrons by interaction with electromagnetic ion cyclotron waves,\nJ. Geophys. Res., 105, 5381, doi:10.1029\/1999JA000283.\nLyons, L. R., R. M. Thorne, and C. F. Kennel (1972), Pitch-angle diffusion\nof radiation belt electrons within the plasmasphere, J. Geophys. Res., 77,\n3455, doi:10.1029\/JA077i019p03455.\nMadden, D., and M. S. Gussenhoven (1990), Auroral Boundary Index from\n1983 to 1990, Tech. Rep. GL-TR-90-0358, Air Force Geophys. Lab.,\nHanscom Air Force Base, Mass, 21 Dec.\nMeredith, N. P., R. B. Horne, R. H. A. Iles, R. M. Thorne, D. Heynderickx,\nand R. R. Anderson (2002), Outer zone relativistic electron acceleration\nassociated with substorm-enhanced whistler mode chorus, J. Geophys.\nRes., 107(A7), 1144, doi:10.1029\/2001JA900146.\nMeredith, N. P., R. B. Horne, S. A. Glaurt, R. M. Thorne, D. Summers, J. M.\nAlbert, and R. R. Anderson (2006), Energetic outer zone electron loss\ntimescales during low geomagnetic activity, J. Geophys. Res., 111,\nA05212, doi:10.1029\/2005JA011516.\nMoldwin, M. B., M. F. Thomsen, S. J. Bame, D. J. McComas, and K. R.\nMoore (1994), An examination of the structure and dynamics of the outer\nplasmasphere using multiple geosynchronous satellites, J. Geophys. Res.,\n99, 11,475, doi:10.1029\/93JA03526.\nPfitzer, K. A., and J. R. Winckler (1968), Experimental observations of a\nlarge addition to the electron inner radiation belt after a solar flare event,\nJ. Geophys. Res., 73, 5792, doi:10.1029\/JA073i017p05792.\nRandall, C. E., V. L. Harvey, C. S. Singleton, S. M. Bailey, P. F. Bernath,\nM. Codrescu, H. Nakajima, and J. M. Russell (2007), Energetic particle\nprecipitation effects on the Southern Hemisphere stratosphere in 1992–\n2005, J. Geophys. Res., 112, D08308, doi:10.1029\/2006JD007696.\nRees, M. H. (1963), Auroral ionization and excitation by incident energetic\nelectrons, Planet. Space Sci. , 11 , 1209, doi:10.1016\/0032-\n0633(63)90252-6.\nRees, M. H. (1964), Note on the penetration of energetic electrons into the\nEarth’s atmosphere, Planet. Space Sci., 12, 722, doi:10.1016\/0032-\n0633(64)90236-3.\nRodger, C. J., M. A. Clilverd, and R. J. McCormick (2003), Significance of\nlightning-generated whistlers to inner radiation belt electron lifetimes,\nJ. Geophys. Res., 108(A12), 1462, doi:10.1029\/2003JA009906.\nRodger, C. J., M. A. Clilverd, N. R. Thomson, R. J. Gable, A. Seppala,\nE. Turuned, N. P. Meredith, M. Parrot, J.-A. Sauvaud, and J.-J. Berthelier\n(2007), Radiation belt electron precipitation into the atmosphere: Recov-\nery from a geomagnetic storm, J. Geophys. Res., 112, A11307,\ndoi:10.1029\/2007JA012383.\nRozanov, E., L. Callis, M. Schlesinger, F. Yang, N. Andronova, and V.\nZubov (2005), Atmospheric response to NOy source due to energetic\nelectron precipitation, Geophys. Res. Lett., 32, L14811, doi:10.1029\/\n2005GL023041.\nSandel, B. R., andM. H. Denton (2007), Global view of refilling of the plasma-\nsphere, Geophys. Res. Lett., 34, L17102, doi:10.1029\/2007GL030669.\nSeaton, M. J. (1954), Excitation processes in the aurora and airglow 1.\nAbsolute intensities, relative ultra-violet intensities and electron densities\nin high latitude aurora, J. Atmos. Terr. Phys., 4, 285, doi:10.1016\/0021-\n9169(54)90060-4.\nSeki, K., Y. Miyoshi, D. Summers, and N. P. Meredith (2005), Comparative\nstudy of outer-zone relativistic electrons observed by Akebono and\nCRRES, J. Geophys. Res., 110, A02203, doi:10.1029\/2004JA010655.\nSelesnick, R. S. (2006), Source and loss rates of radiation belt relativistic\nelectrons during magnetic storms, J. Geophys. Res., 111, A04210,\ndoi:10.1029\/2005JA011473.\nSelesnick, R. S., J. B. Blake, and R. A. Mewaldt (2003), Atmospheric\nlosses of radiation belt electrons, J. Geophys. Res., 108(A12), 1468,\ndoi:10.1029\/2003JA010160.\nSheldon, W. R., J. R. Benbrook, and G. J. Byrne (1988), The effect of mid-\nlatitude electron precipitation on the geoelectric field, J. Atmos. Terr.\nPhys., 50, 1019, doi:10.1016\/0021-9169(88)90090-6.\nA11203 BOROVSKY AND DENTON: RADIATION BELT ELECTRON LOSS RATES\n11 of 12\nA11203\nShprits, Y. Y., and R. M. Thorne (2004), Time dependent radial diffusion\nmodeling of relativistic electrons with realistic loss rates, Geophys. Res.\nLett., 31, L08805, doi:10.1029\/2004GL019591.\nShprits, Y. Y., R. M. Thorne, R. Friedel, G. D. Reeves, J. Fennell, D. N.\nBaker, and S. G. Kanekal (2006), Outward radial diffusion driven by\nlosses at magnetopause, J. Geophys. Res., 111, A11214, doi:10.1029\/\n2006JA011657.\nShprits, Y. Y., N. P. Meredith, and R. M. Thorne (2007), Parameterization\nof radiation belt electron loss timescales due to interactions with chorus\nwaves, Geophys. Res. Lett., 34, L11110, doi:10.1029\/2006GL029050.\nSiskind, D. E. (2002), Comment on ‘‘Solar-atmospheric coupling by elec-\ntrons (SOLACE), 3, Comparisons of simulations and observations 1979–\n1997, issues and implications’’ by Linwood B. Callis et al., J. Geophys.\nRes., 107(D22), 4633, doi:10.1029\/2001JD001141.\nSmith, E. J., A. M. A. Frandsen, B. T. Tsurutani, R. M. Thorne, and K. W.\nChan (1974), Plasmaspheric hiss intensity variations during magnetic\nstorms, J. Geophys. Res., 79, 2507, doi:10.1029\/JA079i016p02507.\nSojka, J. J, and G. L. Wrenn (1985), Refilling of geosynchronous flux tubes\nas observed at the equator by GEOS 2, J. Geophys. Res., 90, 6379,\ndoi:10.1029\/JA090iA07p06379.\nSu, Y.-J., M. F. Thomsen, J. E. Borovsky, and D. J. Lawrence (2001), A\ncomprehensive survey of plasmasphere refilling at geosynchronous orbit,\nJ. Geophys. Res., 106, 25,615.\nSummers, D., and R. M. Thorne (2003), Relativistic electron pitch-angle\nscattering by electromagnetic ion cyclotron waves during geomagnetic\nstorms, J. Geophys. Res., 108(A4), 1143, doi:10.1029\/2002JA009489.\nSummers, D., R. M. Thorne, and F. Xiao (1998), Relativistic theory of\nwave-particle resonant diffusion with application to electron acceleration\nin the magnetosphere, J. Geophys. Res., 103, 20,487.\nSummers, D., C. Ma, and T. Mukai (2004), Competition between accelera-\ntion and loss mechanisms of relativistic electrons during geomagnetic\nstorms, J. Geophys. Res., 109, A04221, doi:10.1029\/2004JA010437.\nThomsen, M. F. (2004), Why Kp is such a good measure of magnetospheric\nconvection, Space Weather, 2, S11004, doi:10.1029\/2004SW000089.\nThorne, R. M. (1997), Energetic radiation belt electron precipitation: A\nnatural depletion mechanism for stratospheric ozone, Science, 195, 287.\nThorne, R. M. (1980), The importance of energetic particle precipitation on\nthe chemical composition of the middle atmosphere, Pure Appl. Geo-\nphys., 118, 128.\nThorne, R. M., T. P. O’Brien, Y. Y. Shprits, D. Summers, and R. B. Horne\n(2005), Timescale for MeV electron microburst loss during geomagnetic\nstorms, J. Geophys. Res., 110, A09202, doi:10.1029\/2004JA010882.\nTinsley, B. A., G. B. Burns, and L. Zhou (2007), The role of the global\nelectric circuit in solar and internal forcing of clouds and climate, Adv.\nSpace Res., 40, 1126.\nTsurutani, B. T., E. J. Smith, and R. M. Thorne (1975), Electromagnetic\nhiss and relativistic electron losses in the inner zone, J. Geophys. Res., 80,\n600.\nVoss, H. D., M. Walt, W. L. Imhof, J. Mobilia, and U. S. Inan (1998),\nSatellite observations of lightning-induced electron precipitation, J. Geo-\nphys. Res., 103, 11,725.\nWest, H. I., R. M. Buck, and J. R. Walton (1972), Shadowing of electron\nazimuthal-drift motions near the noon magnetopause, Nature Phys. Sci.,\n240, 6.\nWest, H. I., R. M. Buck, and G. T. Davidson (1981), The dynamics of\nenergetic electrons in the Earth’s outer radiation belt during 1968 as\nobserved by the Lawrence Livermore National Laboratory’s spectrometer\non Ogo 5, J. Geophys. Res., 86, 2111.\n\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\nJ. E. Borovsky, Los Alamos National Laboratory, Mail Stop D466, Los\nAlamos, NM 87545, USA. (jborovsky@lanl.gov)\nM. H. Denton, Department of Communication Systems, Lancaster\nUniversity, Lancaster LA1 4WA, UK.\nA11203 BOROVSKY AND DENTON: RADIATION BELT ELECTRON LOSS RATES\n12 of 12\nA11203\n"}