{"doi":"10.1136\/bmj.329.7467.679","coreId":"66064","oai":"oai:dro.dur.ac.uk.OAI2:3375","identifiers":["oai:dro.dur.ac.uk.OAI2:3375","10.1136\/bmj.329.7467.679"],"title":"Making clinical governance work.","authors":["Degeling,  P. J.","Maxwell,  S.","Iedema,  R.","Hunter,  D. J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-09-01","abstract":"Clinical governance has been described as \"by far the most high-profile vehicle for securing culture change in the new NHS.\"1 However, the government's past preoccupation with delivery and top down performance management has undermined its developmental potential.2 To be effective, clinical governance should reach every level of a healthcare organisation. It requires structures and processes that integrate financial control, service performance, and clinical quality in ways that will engage clinicians and generate service improvements.3 We strongly endorse this view. Because clinicians are at the core of clinical work, they must be at the heart of clinical governance. Recognition of this fact by clinicians, managers, and policy makers is central to re-establishing \"responsible autonomy\" as a foundation principle in the performance and organisation of clinical work. We look at problems with the prevailing model of clinical governance and describe an alternative approach","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66064.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/3375\/1\/3375.pdf","pdfHashValue":"1de3769d4f38e5c5d7d09a778800cf5379139be5","publisher":"BMJ Publishing Group","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:3375<\/identifier><datestamp>\n      2011-08-25T14:41:05Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Making clinical governance work.<\/dc:title><dc:creator>\n        Degeling,  P. J.<\/dc:creator><dc:creator>\n        Maxwell,  S.<\/dc:creator><dc:creator>\n        Iedema,  R.<\/dc:creator><dc:creator>\n        Hunter,  D. J.<\/dc:creator><dc:description>\n        Clinical governance has been described as \"by far the most high-profile vehicle for securing culture change in the new NHS.\"1 However, the government's past preoccupation with delivery and top down performance management has undermined its developmental potential.2 To be effective, clinical governance should reach every level of a healthcare organisation. It requires structures and processes that integrate financial control, service performance, and clinical quality in ways that will engage clinicians and generate service improvements.3 We strongly endorse this view. Because clinicians are at the core of clinical work, they must be at the heart of clinical governance. Recognition of this fact by clinicians, managers, and policy makers is central to re-establishing \"responsible autonomy\" as a foundation principle in the performance and organisation of clinical work. We look at problems with the prevailing model of clinical governance and describe an alternative approach. <\/dc:description><dc:publisher>\n        BMJ Publishing Group<\/dc:publisher><dc:source>\n        British medical journal, 2004, Vol.329(7467), pp.679-681 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2004-09-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:3375<\/dc:identifier><dc:identifier>\n        issn:0959-8138<\/dc:identifier><dc:identifier>\n        issn: 1468-5833<\/dc:identifier><dc:identifier>\n        doi:10.1136\/bmj.329.7467.679<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3375\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1136\/bmj.329.7467.679<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3375\/1\/3375.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0959-8138","issn: 1468-5833","issn:0959-8138"," 1468-5833"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2004,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n10 November 2009\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nDegeling, P. J. and Maxwell, S. and Iedema, R. and Hunter, D. J. (2004) ’Making clinical governance work.’,\nBritish medical journal., 329 (7467). pp. 679-681.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1136\/bmj.329.7467.679\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \nDurham Research Online \n \nDeposited in DRO: \n11 November 2009 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status of attached file: \nPublished version \n \nCitation for published item: \nDegeling, P. J. and Maxwell, S. and Iedema, R. and Hunter, D. J. (2004), ‘Making clinical \ngovernance work.’, British medical journal, 329 (7467), pp. 679-681. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1136\/bmj.329.7467.679 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nEducation and debate\nMaking clinical governance work\nPieter J Degeling, Sharyn Maxwell, Rick Iedema, David J Hunter\nThe current focus on quality and safety means most doctors have negative views about clinical\ngovernance. But done properly, clinical governance has the power to improve NHS performance\nClinical governance has been described as “by far the\nmost high-profile vehicle for securing culture change\nin the new NHS.”1 However, the government’s past\npreoccupation with delivery and top down perform-\nance management has undermined its developmental\npotential.2 To be effective, clinical governance should\nreach every level of a healthcare organisation. It\nrequires structures and processes that integrate\nfinancial control, service performance, and clinical\nquality in ways that will engage clinicians and generate\nservice improvements.3 We strongly endorse this view.\nBecause clinicians are at the core of clinical work, they\nmust be at the heart of clinical governance.\nRecognition of this fact by clinicians, managers, and\npolicy makers is central to re-establishing “responsible\nautonomy” as a foundation principle in the perform-\nance and organisation of clinical work. We look at\nproblems with the prevailing model of clinical govern-\nance and describe an alternative approach.\nImproving quality from the top down or\nfrom the bottom up?\nClinical governance was conceived as being local in\nboth its orientation and in its operation (fig 1). As a\nbottom-up mechanism, it was intended to inspire and\nenthuse and create a no-blame learning environment\ncharacterised by excellent leadership, highly valued\nstaff, and active partnership between staff and\npatients.1\nThe reality in most trusts, however, is far removed\nfrom these high hopes. The clinical governance\narrangements established meet the formal require-\nments of central bodies such as the Commission for\nHealth Improvement (now the Healthcare Commis-\nsion). They also reflect the government’s past emphasis\non inspection and performance management.5 6\nHence, in most trusts the operations of the stand alone\n“silos” (fig 2) are oriented to ensure that a trust’s senior\nmanagement can satisfy its accountability on centrally\ndetermined generic performance measures.\nGiven their focus on abstracted issues such as risk,\nsafety, and quality, the people who staff these silos tend\nto treat clinical work as an undifferentiated aggregate.\nThis means that they are neither disposed nor\nequipped to consider the full range of clinical, organi-\nsational, and interpersonal processes that are entailed\nin, for example, treating a fracture or supporting a\npatient in self managing a chronic disease.\nFlawed model\nThe failure to take account of variations in clinical\nwork has two main effects on clinical governance.\nFirstly, it is removed from the day to day concerns of\nclinical staff. For example, clinical governance is\nincapable of tackling questions such as: “How can we\nimprove our procedures for a normal delivery?” or\n“how we provide a year of care for a patient with diabe-\ntes?” Secondly, by divorcing issues of risk and safety\nfrom the specifics of providing care to a nominated\npatient group, the prevailing model encourages\nclinicians to view clinical governance as a management\ndriven exercise that has exploded their paperwork to\nthe detriment of patient care.6 7 This perception has\nresulted in many staff rejecting clinical governance as\nyet another misconceived attempt by politicians to\nextend their control over frontline care.6 7\nWhat needs to be done?\nIf clinical governance is going to work, its developmen-\ntal focus needs to be strengthened. This requires\nimplementation of a model which recognises clini-\ncians’ central role in the design, provision, and\nimprovement of care. The model must also be\nstructured to change how clinical work is conceived,\nperformed, and organised. We therefore need to be\nclear about what can and needs to be done to encour-\nage and support doctors, nurses, allied health workers,\nand managers to:\nx Accept the interconnections between the clinical\nand resource dimensions of care\nNational Institute for Clinical Excellence\nNational service frameworks\nClear standards\nof service\nPatient and public\ninvolvement\nProfessional\nself regulation\nCommission for Health Improvement\nNational performance framework\nNational patient and user survey\nMonitored\nstandards\nClinical\ngovernance\nLifelong\nlearning\nDependable\nlocal delivery\nFig 1 Initial government model of clinical improvement structures4\nCentre for Clinical\nManagement\nDevelopment,\nUniversity of\nDurham, Stockton\non Tees TS17 6BH\nPieter J Degeling\nprofessor for clinical\nmanagement\ndevelopment\nSharyn Maxwell\nresearch fellow\nSchool for Health,\nUniversity of\nDurham\nDavid J Hunter\nprofessor of health\npolicy and\nmanagement\nCentre for Clinical\nGovernance\nResearch, University\nof New South\nWales, Sydney,\nAustralia\nRick Iedema\nsenior lecturer\nCorrespondence to:\nD J Hunter\nd.j.hunter@\ndurham.ac.uk\nBMJ 2004;329:679–82\n679BMJ VOLUME 329 18 SEPTEMBER 2004 bmj.com\nx Recognise the need to balance clinical autonomy\nwith transparent accountability\nx Support the systematisation of clinical work\nx Subscribe to the power sharing implications of\nmore integrated and team based approaches to clinical\nwork and its evaluation.\nAlternative model of clinical governance\nThe self governance of clinical performance and\norganisation by multidisciplinary teams requires struc-\ntures and practices that will encourage multidiscipli-\nnary teams to engage in conversations that are focused\non the detailed composition of care for specific condi-\ntions. Such conversations would deal with questions\nsuch as:\nx Are we doing the right things? (Given assessed health\nneeds and existing resource constraints, are we\ndelivering value for money? For common conditions,\nhow appropriate and effective are the services we offer?)\nx Are we doing things right? (Are we managing clinical\nperformance according to national codes of clinical\npractice? For common conditions, how systematised are\nour care processes and how are we performing on risk,\nsafety, quality, patient evaluation, and clinical outcomes?)\nx Are we keeping up with new developments and what\nare we doing to extend our capacity to undertake clinical\nwork in these areas? (What strategies are in place for\nservice and professional development for each condi-\ntion? What are we doing about clinical mentoring, lead-\nership development, and staff appraisal and review?)\nEnabling these conversations requires action at the\nlevel of both clinical practice and organisational struc-\nture. At the practice level, it requires the development\nand implementation of integrated care pathways for\nhigh volume case types—for example, normal deliver-\nies, hip replacements, patients with chronic obstructive\npulmonary disease. These pathways describe the diag-\nnostic and therapeutic events that will appreciably\naffect the quality, outcomes, and cost of care. Use of\nintegrated care pathways for systematising care\nextends the evidence base, strengthens service integra-\ntion, and improves clinical effectiveness, quality, and\ntechnical efficiency as well as patients’ satisfaction and\nclinicians’ work experience.8–12\nIntegrated care pathways are not immutable\ndocuments setting out inviolable treatment regimens.\nVariation remains an expected feature of clinical\npractice. What is at stake is the learning a clinical team\ncan derive from these variations. When variation\noccurs, documentation of the variances can become\npart of structured interprofessional conversations. It is\nneither realistic nor useful to consider systematising all\nclinical work. Nevertheless, about half of a hospital’s\nclinical workload is accounted for by a relatively small\nnumber of conditions that are amenable to systematisa-\ntion (box)13.\nAt the level of structure, we need to set in place\nclinical governance arrangements along the lines\ndepicted in figure 3. In this model, clinical governance\nbecomes a mechanism for encouraging and support-\ning clinicians in specialist units to systematically and\nroutinely review their unit’s performance on its high\nvolume case types. For example, figure 3 depicts an\northopaedics unit reviewing its care for patients with\nfractured neck of femur. This review would involve sur-\ngeons, nurses, rehabilitation physicians, physiothera-\npists, occupational therapists, mental health specialists,\nand social workers. The same structure could apply in\nprimary care, with each clinical unit (a general practice\nor community nursing service) reporting on the year\nof care provided to patients with conditions such as\ndiabetes, chronic obstructive pulmonary disease, or\nchronic heart disease. The reports for each clinical\ncondition would include data on evidence, cost,\noutcomes, clinical effectiveness, quality, safety, adverse\nevents, variance, and complaints.\nWhere we are and where we want to be\nThe existing and proposed clinical governance\narrangements differ in the processes that each engen-\nder and the types of conversations they are structured\nto produce. In the existing model, the clinical work of\nthe trust is conceived and talked about as an undiffer-\nTrust\nClinical governance committee\nRisk m\nanagem\nent\nClinical audit\nClinical effectiveness\nQuality assurance\nStaff developm\nent\nResearch and developm\nent\nFig 2 “Silo” organisational structure of clinical governance\nTrust clinical governance arrangement\nTrust\/Management board\/Chief executive officer\nDivisional clinical governance structure\nHip replacem\nent type 1\nHip replacem\nent type 2\nKnee replacem\nent type 1\nFractured neck of fem\nur\nFracture type 2\nFig 3 Pathway focused clinical governance in acute settings\nPatient activity of four NHS trusts in England\nduring 2000-213 categorised into 547 health\nrelated groups\n• 30 health related groups accounted for 46% of all\nemergency inpatient episodes and 39% of all\nemergency generated bed days\n• 30 groups accounted for 53% of inpatient elective\nepisodes and 47% of elective bed days\n• 30 groups accounted for 75% of day elective\nepisodes\nEducation and debate\n680 BMJ VOLUME 329 18 SEPTEMBER 2004 bmj.com\nentiated aggregation. Consequently, the detailed\ncomposition of clinical work is regarded as something\nthat lies solely within the purview of the clinicians\nimmediately involved. General acceptance of this\nopaque and ultimately privileged conception of clinical\nwork reinforces the pernicious separation between cli-\nnicians and managers that continues to plague too\nmany healthcare organisations.14–17\nIn contrast, a pathway based model of clinical gov-\nernance goes beyond the issues that are the focus of\nrisk managers and quality coordinators. Based in a\ncondition-specific conception of clinical work, it invites\nthe people who do the work to define, describe, assess,\nand manage what they do as teams. It explicitly recog-\nnises the centrality of clinicians to the performance\nand organisation of clinical work and provides\nclinicians with a medium for integrating the clinical,\nresource, and organisational aspects of care. In doing\nso it provides a way for ensuring the responsible\nautonomy of clinicians. As all professions jointly and\nroutinely enact the methods, structures, and processes\noutlined above, they will enfold the authority of a\nsystem of clinical self governance “into the soul”18 and\nrealise its developmental potential.\nContributors and sources: PJD has a disciplinary background of\npolitical science, policy studies and health services management.\nSM has a disciplinary background in health services\nmanagement and economics. RI has experience in semiotics,\nlinguistics, and organisational studies. DJH’s background is\npolitical science, policy studies andmedical sociology. The paper\nis based on ideas and concepts developed during research\nprojects on the organisational preconditions for clinical work\nsystematisation conducted over the past 15 years. This paper\narose out of meta-level discussions about the findings of several\nof these projects conducted in Australia, England, and Wales.\nThe chief investigator on all these projects was PJD. SM and RI\nwere co-investigators on several projects. DJH has supported\nmore recent, similar work in the UK by PJD and SM; he acted as\na sounding board for the ideas presented.\nCompeting interests: None declared.\n1 Leatherman S, Sutherland K. The quest for quality in the NHS: a mid-term\nevaluation of the ten-year quality agenda. London: Nuffield Trust, 2003.\n2 Gray A, Harrison S, eds. Governing medicine: theory and practice.\nBuckingham: Open University Press, 2004. (Chapters 2, 6, 8, 11, 12.)\n3 Scally G, Donaldson LJ. Looking forward: clinical governance and the\ndrive for quality improvement in the new NHS in England. BMJ\n1998;317:61-5.\n4 Secretary of State for Health. A first class service. Quality in the new NHS.\nLeeds: NHS Executive, 1998. www.nhshistory.net\/a_first_class_service.\nhtm (accessed 3 Sep 2004).\n5 Degeling P, Maxwell S, Macbeth F, Kennedy J, Coyle B. The impact of\nCHI: some evidence from Wales.Qual Primary Care 2003;11:147-57.\n6 Degeling P, Macbeth F, Kennedy J, Maxwell S, Coyle B, Telfer B.\nProfessional subcultures and clinical governance implementation in NHS Wales:\na report to the National Assembly for Wales. Durham: Centre for Clinical\nManagement Development, University of Durham, and College of Medi-\ncine, University of Wales, 2002.\n7 Degeling P, Kennedy J, Macbeth F, Telfer B, Maxwell S, Coyle B.\nPractitioner perspectives on objectives and outcomes of clinical govern-\nance: some evidence from Wales. In: Gray A, Harrison S, eds. Governing\nmedicine: theory and practice. Buckingham:Open University Press, 2004:60-\n77.\n8 Gregory C, Pope S, Werry D, Dobek P. Reduced length of stay and\nimproved appropriateness of care with a clinical path for total knee or\nhip arthroplasty. J Qual Improvement 1996;22:617-27.\n9 Johnson S. Pathways of care: what and how? J Managed Care 1997;1:15-7.\n10 Flynn AM. Case management: a multidisciplinary approach to the evalu-\nation of cost and quality standards. J Nurs Care Qual 1993;1:58-66.\n11 Guiliano KK, Poirier CE. Nursing care management: critical pathways to\ndesirable outcomes.Nurs Manage 1991;22:52-5.\n12 Poole DL. Care profiles, pathways and protocols. Physiotherapy\n1994;80:256-66.\n13 Degeling P, Maxwell S, Kennedy J, Coyle B. Commissioning for\nperformance—but what is the work? An analysis of the commissioning\nimplications of activity data in four health economies in northern\nEngland. Public Manage Money (in press).\n14 Edwards N, Marshall M. Doctors and managers. BMJ 2003;326:116-7.\n15 Marnoch G. Doctors and management in the National Health Service.\nBuckingham: Open University Press, 1996.\n16 Degeling P. Reconsidering clinical accountability. An examination of\nsome dilemmas inherent in efforts to bolster clinician accountability. Int J\nHealth Plann Manage 2000;15:3-16.\n17 Degeling P, Kennedy J, Hill M.Mediating the cultural boundaries between\nmedicine, nursing and management—the central challenge in hospital\nreform.Health Serv Manage Res 2001;14:36-48.\n18 Rose N. Identity, genealogy, history. In: Hall S, du Gay P, eds. Questions of\ncultural identity. London: Sage, 1996:128-50.\n(Accepted 28 June 2004)\nCommentary: Model could work\nNigel Edwards\nDegeling and colleagues provide an excellent\ncase study of how an activity designed to help improve\nthe quality and safety of health care runs the risk of\nbeing seen as an unhelpful managerial imposition.1\nThe reasons why this has happened and the possible\nresponses to it provide some important insights\ninto the more general project of improving the\nNHS.\nOne of the biggest problems in many healthcare\nsystems is the gulf between the front line clinical staff\nand policymakers and managers. In most organisa-\ntions a strong link exists between the top of the organi-\nsation and the front line, and commands issued at the\ncentre will generally be understood and implemented.\nIn health care, however, the hierarchy is often\ndisconnected, resulting in two separate discussions—\none for policy makers, managers, and politicians about\ntheir aspirations and interests and a second for\nclinicians about their work. Both are legitimate, but\nproblems arise because these two fail to connect or\ninteract dysfunctionally. Matters are often made worse\nby the use of jargon and language that alienates front\nline staff because it is often rather abstract and does not\nrelate to the realities of their work.\nSummary points\nClinicians are at the core of clinical work and should also be at the\nheart of clinical governance\nMany trusts’ clinical governance arrangements treat clinical work as\nan undifferentiated aggregate\nFailure to take account of the detailed composition of clinicians’ work\nresults in their disengagement from management\nIntegrated care pathways are needed for common (high volume)\nconditions\nA mechanism is required to support all those involved in patient care\nin systematic evaluation of their overall performance\nEducation and debate\nNHS\nConfederation,\nLondon SW1E 5ER\nNigel Edwards\npolicy director\nnigel.edwards@\nnhsconfed.org\nBMJ 2004;329:681–684\n681BMJ VOLUME 329 18 SEPTEMBER 2004 bmj.com\n"}