{"doi":"10.1177\/1476718X07076679","coreId":"65747","oai":"oai:dro.dur.ac.uk.OAI2:4917","identifiers":["oai:dro.dur.ac.uk.OAI2:4917","10.1177\/1476718X07076679"],"title":"What children know and can do when they start school and how this varies between countries.","authors":["Merrell,  C.","Tymms,  P."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-06-01","abstract":"This large-scale study describes what children know and can do when they start school in Scotland. The description became possible because a third of Scottish Authorities are involved in a single, broadly based, on-entry baseline assessment of children. The study also looked at variations by home background, sex, age and pre-school experience within Scotland. Comparisons were then made with the cognitive development of children starting school in England, New Zealand and Western Australia, concentrating on children whose first language was English. Surprising differences were found between Scotland and other countries. New Zealand also stood out on some measures. The results are discussed in terms of pre-school provision and what on-entry assessment can and cannot tell us","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65747.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/4917\/1\/4917.pdf","pdfHashValue":"44c1eaef694e9a8bb1447156385e6b7058cb35a6","publisher":"Sage","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:4917<\/identifier><datestamp>\n      2016-07-06T10:49:18Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        What children know and can do when they start school and how this varies between countries.<\/dc:title><dc:creator>\n        Merrell,  C.<\/dc:creator><dc:creator>\n        Tymms,  P.<\/dc:creator><dc:description>\n        This large-scale study describes what children know and can do when they start school in Scotland. The description became possible because a third of Scottish Authorities are involved in a single, broadly based, on-entry baseline assessment of children. The study also looked at variations by home background, sex, age and pre-school experience within Scotland. Comparisons were then made with the cognitive development of children starting school in England, New Zealand and Western Australia, concentrating on children whose first language was English. Surprising differences were found between Scotland and other countries. New Zealand also stood out on some measures. The results are discussed in terms of pre-school provision and what on-entry assessment can and cannot tell us.<\/dc:description><dc:publisher>\n        Sage<\/dc:publisher><dc:source>\n        Journal of early childhood research, 2007, Vol.5(2), pp.115-134 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2007-06-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:4917<\/dc:identifier><dc:identifier>\n        issn:1476-718X<\/dc:identifier><dc:identifier>\n        issn: 1741-2927<\/dc:identifier><dc:identifier>\n        doi:10.1177\/1476718X07076679<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4917\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1177\/1476718X07076679<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4917\/1\/4917.pdf<\/dc:identifier><dc:rights>\n        The final definitive version of this article has been published in the Journal Journal of Early Childhood Research 5\/2 2007 © <SAGE Publications Ltd 2007> by SAGE Publications Ltd at the Journal Journal of Early Childhood page: http:\/\/ecr.sagepub.com\/ on SAGE Journals Online: http:\/\/online.sagepub.com\/\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1476-718X","1476-718x","issn: 1741-2927"," 1741-2927"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n04 November 2008\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nMerrell, C. and Tymms, P. (2007) ’What children know and can do when they start school and how this varies\nbetween countries.’, Journal of early childhood research., 5 (2). pp. 115-134.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1177\/1476718X07076679\nPublisher’s copyright statement:\nThe final definitive version of this article has been published in the Journal Journal of Early Childhood Research 5\/2\n2007 ¡SAGE Publications Ltd 2007¿ by SAGE Publications Ltd at the Journal Journal of Early Childhood page:\nhttp:\/\/ecr.sagepub.com\/ on SAGE Journals Online: http:\/\/online.sagepub.com\/\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online \n Deposited in DRO:\n04 November 2008\nVersion of attached file:\nAccepted\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nMerrell, C. and Tymms, P. (2007) 'What children know and can do when they start school and how this varies\nbetween countries.', Journal of early childhood research., 5 (2), pp.\u0000115-134.\nFurther information on publishers website:\nhttp:\/\/dx.doi.org\/10.1177\/1476718X07076679\nPublishers copyright statement:\nThe final definitive version of this article has been published in the Journal Journal of Early Childhood Research\n5\/2 2007 © <SAGE Publications Ltd 2007> by SAGE Publications Ltd at the Journal Journal of Early Childhood\npage: http:\/\/ecr.sagepub.com\/ on SAGE Journals Online: http:\/\/online.sagepub.com\/\u0000\u0000\n \n \n \n \nWhat Children Know And Can Do When They Start \nSchool And How This Varies Between Countries \n \n \n \n 1\nAbstract \nThis large-scale study describes what children know and can do when they \nstart school in Scotland. The description became possible because a third of Scottish \nAuthorities are involved in a single, broadly based, on-entry baseline assessment of \nchildren. The study also looked at variations by home background, sex, age and pre-\nschool experience within Scotland. Comparisons were then made with the cognitive \ndevelopment of children starting school in England, New Zealand and Western \nAustralia, concentrating on children whose first language was English. Surprising \ndifferences were found between Scotland and other countries. New Zealand also stood \nout on some measures. The results are discussed in terms of pre-school provision and \nwhat on-entry assessment can and cannot tell us. \n \n \n \nKeywords: baseline assessment, Scotland, pre-school, international comparisons \n \n 2\nIntroduction \nChildren typically start school in Scotland when they are aged 5 years \nalthough this will vary by up to 6 months.  Although pre-school experience is not a \nstatutory requirement, most children will have attended nursery and\/or playgroup, and \nthis will be for different durations depending on local policy and parental choice.  \nScotland has a curriculum framework for children aged 3 – 5 years (Scottish \nExecutive, 2001) and then from the start of formal school, teachers work within the 5 \n– 14 guidelines (Scottish Executive, 2000).  There is currently considerable interest in \nearly years education within Scotland, reflected by the Scottish Executive’s action to \ncommission a review of international perspectives on early years education (Stephens, \n2006), and the analysis in this paper contributes to the debate by looking at the \ncognitive development of children starting school in Scotland in the specific areas of \nvocabulary acquisition, phonological awareness, early reading and early mathematics.  \nRasch measurement is used to create equal interval scales from which direct \ncomparisons between areas of development can be made.  This method of analysis \nprovides a model, which can be applied to the development of children in other \ncountries.  Children’s cognitive development is also analysed in relation to age, sex, \nsocial background, special needs and first language. \n \nThe developmental profile of children starting school in Scotland is then \ncompared with children in three other English-speaking countries: England, New \nZealand and Western Australia.  A good number of international studies, for example \nTIMSS, PISA and PIRLS, have looked at the attainment levels of pupils after several \nyears of schooling but without a common baseline measure of children at the start of \nformal schooling these studies cannot compare the educational progress across \ncountries.  A common assessment on entry to formal schooling also provides a basis \nfor a comparison of the pre-school policies and programmes of different countries.  In \na recently published longitudinal study, Van de Rijt et al. (2003) did use a common \nassessment at three time-points to compare the early numeracy development of young \nchildren in different European countries.  Children were aged five and six years at the \ntime of the first assessment, the second assessment was conducted half way through \nthe year and the final assessment was administered one year after the first when the \n 3\nchildren were, aged six and seven.  Almost 1,900 children from Germany, Belgium, \nGreece, The Netherlands, United Kingdom and Slovenia participated.  This gave \napproximately 300 children per country.  A single assessment that covered the broad \naspects of early numeracy was translated for use in the different countries and \nadministered to children on an individual basis.  Van de Rijt et al. were able to report \nthe attainment and progress of children over one full year during which some children \nwere in full-time education and others did not attend school at all. They concluded \nthat the assessment was appropriate for making international comparisons.  Their \nresults indicated that differences in the numeracy development of the children in the \nparticipating countries were small, which was surprising given the variation between \ncountries in early education policy, and they suggested that further qualitative work \nwas necessary to be able to interpret the data fully.  There might also be an issue with \nthe representativeness of each sample to the country as a whole although the authors \ndid describe the sampling procedure for each country. \nThe analysis in this paper, which compares the starting points of children in \nfour English-speaking countries, adds weight to the possibility of a more broadly \nbased international study of children starting school, extending the potential of the \ncurrent international studies.  It also builds upon other recently published work \n(Tymms, Merrell and Jones, 2004, Tymms and Merrell, 2004, Van de Rijt et al. \n2003), by using larger sample sizes. \n \n 4\nMeasures \nThe PIPS On-entry Baseline Assessment is one of several projects run from \nthe Curriculum, Evaluation and Management (CEM) Centre at Durham University \n(CEM Centre, 2005, Fitz-Gibbon, 1996, Tymms, 1999a, Tymms and Coe, 2003), \nwhich aim to provide schools with data on the attainment, progress and attitudes of \ntheir pupils.  The CEM Centre provides assessments and monitoring systems for \nchildren aged 3 – 18 years.  Schools (and sometimes whole education authorities) \nsubscribe to the projects.  The CEM Centre provides the necessary assessments and \nthen marks and analyses the data for schools, and provides them with standardised \nfeedback on the attainment, attitudes and progress of their pupils.  As a result of the \nservice, the CEM Centre holds large longitudinal datasets that can be further analysed \nfor research purposes such as this paper.  One particular assessment, the PIPS On-\nentry Baseline Assessment (PIPS-BLA) is administered within the first six weeks of a \nchild starting compulsory education.  The assessment, which is computer-delivered, is \nadministered individually and the whole procedure takes approximately 20 minutes \nper child.  It is used in several countries around the world1 with translations and \ncultural adaptations being made where necessary.  Children start school at different \nages in different countries and an explanation of how this is controlled for will be \nprovided in later sections. \nThe content of the PIPS-BLA is based on those factors which previous \nresearch has shown to be the best predictors of later success or difficulty at school (for \na review of the relevant literature, see Tymms and Middleton, 1995 and Tymms \n1999b).  These reflect the general developmental level of a child rather than the \noutcome of any specific curriculum, which is important for an assessment given at the \nstart of school.  The style of presentation of the assessment has been designed to be \nattractive and appealing to children, and teachers have repeatedly reported that \nchildren find the experience of completing the PIPS-BLA an enjoyable one. \nThe following areas are assessed: \n• Writing – the child is asked to write his\/her own name and the quality of \nwriting is scored against examples. \n                                                 \n1 England, Germany, Hong Kong, New Zealand, Scotland, Slovenia, South Africa, The \nNetherlands, Wales, Western Australia. \n 5\n• Vocabulary – the child is asked to identify objects embedded within a picture. \n• Ideas about reading – assesses concepts about print. \n• Repeating Words – the child hears a word and is asked to repeat it in this \nassessment of phonological awareness. \n• Rhyming Words – the child selects a word to rhyme with a target word from a \nchoice of three options in this assessment of phonological awareness. \n• Letter identification – a fixed order of mixed upper and lower case letters. \n• Word recognition and reading.  This starts with word recognition and moves \non to simple sentences that the child is asked to read aloud.  The words within \nthese sentences are high frequency and common to most reading schemes.  \nThis is followed by a more difficult comprehension exercise which requires \nthe child to read a passage and at certain points select one word from a choice \nof three that best fits that position in the sentence. \n• Ideas about mathematics – assessment of understanding of the vocabulary \nassociated with mathematical concepts. \n• Counting and Numerosity – the child is asked to count four objects.  These \ndisappear from the screen and then the child is asked how many objects they \nsaw.  This is repeated with seven objects. \n• Sums – addition and subtraction problems presented without symbols. \n• Shape identification. \n• Digit identification – single, two-digits and three-digits. \n• Maths problems – including sums with symbols. \n \nThe computer program presents the child with questions (aurally) and \ndepending on the nature of the question, the child responds either by pointing to the \nanswer from the choice of options on the screen or by saying the answer.  The teacher \ncontrols the pace of the assessment and records the child’s response on-screen.  The \nprogram selects the next appropriate question.  The way that the assessment works is \nillustrated by referring to the section relating to vocabulary.  In this section a child is \n 6\nshown a scene and asked to point to an item in that scene.  The first scene is of a \nkitchen and for the first item the child is asked to identify the ‘carrots’.  The program \ncontinues with further, progressively more difficult, vocabulary items until finally it \nbecomes too difficult for the child.  At that point the program moves onto the next \nsection. Each section operates independently using a bank of items, which are \npresented to the child in an order of increasing difficulty.  It follows a pre-determined \n‘stopping rule’ sequence. When a child gets three consecutive items wrong or four \nwrong altogether in a section, the program moves straight on to the next section. \nThe PIPS-BLA is extremely reliable.  In England, the overall test-retest \nreliability (excluding phonological awareness) is 0.98.  This high test-retest reliability \nhas been found in other countries too (see for example, Van der Hoeven-van \nDoornum, 2005). The test-retest reliability of the phonological awareness section was \nsomewhat lower at 0.63.  The internal reliabilities for the subscales analysed in this \nreport are as follows: \n \n     Number of Items Chronbach’s  \n     Alpha \nVocabulary     23     0.86 \nPhonological Awareness   17     0.86 \nConcepts about Print    10     0.76 \nLetter Identification    26     0.97 \nWord recognition and Sentences  20     0.93 \nIdeas about Maths      7     0.60 \nCounting and Numerosity     4     0.83 \nSimple Sums       8     0.83 \nDigit Identification    21     0.91 \nShape Identification      5     0.62 \nMaths Problems    24     0.78 \nReading2          0.95 \nMathematics3         0.93 \n                                                 \n2 Includes writing, concepts about print, letter identification, word recognition and sentences. \n3 Includes ideas about maths, counting and numerosity, simple sums, digit identification,  \n  shape identification and maths problems. \n 7\n The reliability of some of the sub-scales is quite low because there are so few \nitems in them, however the scales that form the main focus of this paper (vocabulary, \nreading, phonological awareness and mathematics) are high, reading and mathematics \nparticularly so. \nThe PIPS-BLA recognises the importance of, and assesses, personal, social \nand emotional development, attitudes and behaviour although these are not analysed \nor discussed in this paper. \n \nSample \nThis study was restricted to children who completed the PIPS-BLA in the \n2002-3 academic year and whose first language was English.  Sample sizes for each \ncountry are indicated in Table 1. \nINSERT TABLE 1 HERE \n \nSchools use the PIPS-BLA with all children in a year-group and do not select \nor exclude particular sub-sets, such as children with special educational needs.  The \ndata from England and Scotland were representative of each country4 but the Western \nAustralia and New Zealand samples were not guaranteed to be representative of those \ncountries as a whole. The schools in those two countries joined the PIPS project by \nchoice and their national representativeness has yet to be demonstrated. \n \n                                                 \n4 In Scotland, a third of all education authorities chose to use the PIPS-BLA, which meant that \nall pupils starting school in those authorities were assessed.  Therefore, the Scottish Secondary 4, 5 and \n6 statutory assessments were compared against the country as a whole to confirm the representatives of \nthe sample.  The schools using the PIPS-BLA were not significantly different to the national norms.  In \nEngland, the End of Key Stage 2 statutory assessments (conducted at the end of primary school) were \nused to confirm that the sample was nationally representative.   \n 8\nAnalysis \nPart 1: The Cognitive Profile of Children Starting School In \nScotland \n \nWhat do children know and what can they do when they start school in \nScotland?  Rasch measurement was used to estimate the relative difficulties of the \nitems for the entire PIPS-BLA and for each section separately.  Rasch measurement \norders items on an equal interval scale which is measured in Logits.  An everyday \nexample of an equal interval scale is a ruler, which measures the length of objects in \ncentimetres.  However, unlike the measurement of length on a ruler, the Logit values \nare calculated using the probability of success or failure on each assessment item.  \n(For further information about Rasch measurement see Bond and Fox, 2001.)  A Logit \nvalue of 0 was chosen to represent the mean of the item difficulty estimates and the \nmore positive the Logit value, the more difficult the item in relation to others in the \nassessment.  The more negative the Logit value, the easier the item in relation to \nothers in the assessment.  A great advantage of Rasch measurement is that children \ncan be placed on the same scale as the items and a distribution of their abilities plotted \nalongside the item difficulties. \n \nFigure 1 gives an overview of the range of development of children on entry to \nschool.  It takes examples of items from each of the reading and phonological \nawareness, mathematics and vocabulary sections.  Items are ordered from the most \ndifficult (highest Logit value) to the easiest (lowest Logit value) and the distribution \nof pupils’ scores is plotted alongside.  Next to the Logit scale, the letter ‘M’ on the \nright side of the dividing line shows the position of the mean of the item difficulties \nand the ‘M’ on the left side of the dividing line shows  mean of the pupil abilities.  \nThe Figure indicates that children of average ability are very likely to be able to: \ncount to at least 7, identify all single digit numbers and name about half the letters.  \nTechnically, when a child’s name appears opposite an item she or he has a 50:50 \nchance of getting the item right. The further child is above an item the greater the \nchance he or she has of being able to answer it correctly and vice versa. \n \n 9\nINSERT FIGURE 1 HERE \n  \nHow Does The Cognitive Profile Vary? \nHow does the cognitive profile vary by key factors? Data on age, gender, \nhome background and pre-school experience were collected at the time of the PIPS-\nBLA and the analyses below show how the cognitive profile varies in relation to these \nvariables. All results were significant at least at the 0.01 level unless otherwise stated. \nSex \nTable 2 (Sex) indicates the advantage to girls over boys in standard deviation \nunits (Effect Sizes5) for the four areas being considered.  \n \nINSERT TABLE 2 HERE \n \nIn general, the girls started school in Scotland a little ahead of the boys, \nalthough in mathematics there was no difference.  The greatest difference between \nboys and girls was in the reading section where there was an advantage of about a \nfifth of a standard deviation.  There was a similar but slightly smaller advantage in \nphonological awareness and in vocabulary there was just 0.06 of a standard deviation, \nwhich was statistically significant but educationally not important.  It is worth \npointing out also that the spread of scores for the girls was less than boys for both \nvocabulary and for mathematics, although not for phonological awareness or for \nreading.  The implication of the standard deviation differences is that the girls form a \nmore homogeneous group than the boys.  Extreme scoring groups, the very highest \nand the very lowest, will have a greater preponderance of boys amongst them.  For \nexample, in the dataset considered here amongst those with the top 5% of scores for \nmathematics 64% were boys. In the bottom 5% the figure was 54% boys. \n \n                                                 \n5 The metric “effect size” is chosen because of its increasing use in educational research, its \napplicability across studies and the potential for its use in meta analyses. \n 10\nHome Background \n \nHome background has long been established as being an important variable \nwhen looking at children's performance at school, especially when no earlier cognitive \nmeasure is available.  There is a variety of ways of looking at home background and a \nwidely used measure in the UK is the entitlement to free school meals (FSM), which \ngives a dichotomous outcome.  In the UK, children from families with a low financial \nincome are entitled to receive a mid-day meal at school free of charge each day and \ntherefore FSM is a crude indicator of the level of deprivation of a child. Table 3 \nshows the advantage to children without entitlement to free school meals over those \nwith entitlement in standard deviation units (Effect Sizes) for the four areas being \nconsidered. \n \nINSERT TABLE 3 HERE \nQuite clearly in each of the 4 sections there were large differences between the \naverage scores of pupils from the groups with and without entitlement to free school \nmeals.  This was most noticeable for reading and mathematics where the difference \namounted to nearly 7\/10 of a standard deviation and almost as much in vocabulary \nand rather less in phonics.  It might be that it was rather less in phonological \nawareness because that part of the assessment only contained 17 items and was less \nreliable than the other measures. The overall general pattern averages out at about \n7\/10 of a standard deviation. \n \nPre-school Experience \n \nINSERT TABLE 4 HERE \nContrary to expectations, the relationship between the amount of pre-school \nexperience and PIPS-BLA scores was weak as shown in Table 4.  The amount of pre-\nschool experience recorded varied from 0 full-time terms to 6 and it was expected that \na strong relationship would be found.  On analysis, only a minimal link was found for \nmathematics (0.03 of a standard deviation unit per term). For a child attending pre-\nschool for six terms the advantage was 0.18 standard deviation units, which is not of \ngreat educational importance.  By comparison in England a very clear and uniform \n 11\nrelationship was found in the same year group amounting to typically around 0.1 \nstandard deviation unit per term of attendance at pre-school.  Figures 2 and 3 show a \nvery strong and clear relationship between mathematics and the amount of pre-school \nin England but not for Scotland.  The values on the Y-axis of Figures 2 and 3 are \nmean scores with error bars denoting the 95% confidence interval.  To find such a \nweak relationship effect is a little odd and at this stage no clear explanation is \napparent. The pre-school curriculum in Scotland focuses on learning through play and \nmight emphasise the development of different skills to the curriculum in England, \nhowever, the Foundation Stage in England also places importance on child \ndevelopment, practical play and outdoor activity, and indeed Taylor Nelson Sofres \nand Aubrey (2002) found from a survey conducted in 2001 of head-teachers and \nteachers that that ethos was supported.  Further qualitative research is necessary to \nexplore the possible reasons for this finding..  \nINSERT FIGURE 2 HERE \nINSERT FIGURE 3 HERE \n \nAge \nThe Effect Sizes reported in Table 5 are the difference in scores between the \nyoungest children (four and a half years old) and the oldest children (five and a half \nyears old) starting school in Scotland.  These are compared with children starting \nschool in England (age four and five respectively) for each section of the PIPS-BLA. \nINSERT TABLE 5 HERE \n \nClearly the age of children is of considerable importance in their cognitive \ndevelopment.  To quantify the relationship between age and measured attainment, \nregression analyses were carried out to estimate the difference that a year makes.  \nThat is essentially the difference between youngest and the oldest children starting \nschool in Scotland. Comparing the youngest with the oldest, the difference amounts to \nabout half a standard deviation unit.  The difference was slightly higher for \nmathematics, rising to two thirds of a standard deviation, and a little less for \nphonological awareness and vocabulary. Generally, the pattern can be translated into \na figure of about 0.05 per month.  There was a stronger relationship in England.  That \n 12\nis to be expected, at least to some extent, since the mean age of children starting \nschool was lower than in Scotland and age is a more important factor for younger \nchildren than older.  \n \nSummary: What children know and can do when they start school in \nScotland \nIn the first part of this analysis the PIPS-BLA was used to describe what \nchildren know and can do when they start school in Scotland. This was presented in \ncharts derived from Rasch analyses. It showed a very large range of cognitive \ndevelopment. In the top 1% were fluent readers and children who were very adept at \nworking with numbers and had extensive vocabularies. They could read passages \nwhich included words such as “everyone” and do problems such as “What is 3 fewer \nthan 7?” In the lowest 1% were children whose progress towards literacy had reached \nthe stage of recognising the activities of reading and writing without themselves \nhaving skills in those activities. They knew mathematically relevant words such as \nbiggest and smallest but had difficulty counting just a few objects. \nThe age, sex and home background of the children showed systematic links to \ntheir developmental levels. \nThere was no difference between girls and boys in their average starting points \nfor mathematics but older children and those from more affluent homes had higher \nstarting points.  The amount of pre-school experience was positively related to the \nstarting point in mathematics, but to a very small extent.  Important though age and \nhome background were, they were small in comparison to the very large differences \nbetween pupils more generally. Similar results were found for vocabulary, reading \nand phonological awareness. \nOne surprising result was the very weak relationship found between the \namount of pre-school experience and the PIPS-BLA scores at the start of compulsory \neducation in Scotland. \n \nPart 2: Do children starting school in England, New \nZealand, Scotland and Western Australia have the \nsame age related development profile? \n 13\n \nIn this section the starting points of children in England, New Zealand (NZ), \nScotland and Western Australia (WA) are compared.  \nBefore starting the comparative analyses, Rasch measurement was used to \nscale the items in the four sub-tests independently within each country.  The relative \ndifficulties of the items for the four countries were then compared. The purpose was \nto identify any items in the assessments that functioned differently between countries. \nThe results showed very few differences. The strongest agreements were in \nmathematics, where the correlations of the difficulties of the items in the four \ncountries were all 0.99. This is so high that no further preliminary action was needed \nbefore making comparisons. \nThe difficulties of the reading items were also strongly related but not quite so \nstrongly. The correlations between countries for the reading, vocabulary and \nphonological awareness sections are shown in Tables 6, 7 and 8 respectively. \nINSERT TABLE 6 HERE \nThe lowest correlation was for the items difficulties between Scotland and \nNew Zealand but the figure (0.94) was felt to be sufficiently high to allow further \nanalysis to proceed. \nA similar analysis for the vocabulary items showed that two words were \nparticularly difficult in the antipodes compared with the UK. They were pigeon and \nwasp and therefore these were excluded from further analysis. The correlations, \nexcluding these items, are shown in Table 7. \n \nINSERT TABLE 7 HERE \n \nAs with the reading correlations it was felt that the lowest figure (0.95) was \nsufficiently high to proceed with further analysis. \nThe phonological awareness section was less satisfactory as the correlations in \nTable 8 show. \nINSERT TABLE 8 HERE \n 14\n \nThe correlations between the item difficulties for Scotland and the other \ncountries might appear to be high for social science work but figures of 0.91 leave \nsomething to be desired as a basis for comparing countries and the correlations with \nScottish data were the lowest in the table. Further, when the difficulties of specific \nitems were compared it was not possible to pick out just one or two items as being \nproblematic with a view to dropping them from the analysis.  The point of this \nanalysis was to ascertain if any items seemed to be culturally biased and relatively \nmore easy or difficult for children in a particular country.  The items in the \nphonological awareness section gave different outcomes for pupils in Scotland \ncompared with pupils in England and New Zealand and as a result it was thought to \nbe inappropriate to proceed with comparisons of that section. \nFor each of the three other sections (mathematics, reading and vocabulary) the \ndatasets for Western Australia, New Zealand, England and Scotland were combined \nand then Rasch scales were created. The children were then put into eleven age \ncategories corresponding to increments of 3 months each. The lowest had a mean age \nof 4.2 years and the highest of 6.6 years. The average scaled scores were then plotted \nagainst age to produce Figures 4, 5 and 6 below.  \nThe first thing to notice from the figures is the difference in the age of children \nstarting school in different countries.  The pupils in England tend to be the youngest \nalthough there is some overlap with Scotland and New Zealand.  The New Zealand \nsample is quite interesting in that all children start school immediately after their fifth \nbirthday.  The three charts show generally very similar patterns indicating that the \ncognitive growth patterns of children whose first language is English is similar in \nScotland when compared with England, Western Australia and New Zealand. But, \ndespite the general pattern, there were differences and these are examined in more \ndetail below. \nINSERT FIGURE 4 HERE \n \nThe vocabulary scores rise steadily with age and the four countries are very \nmuch in line with one another. There is suggestion that the vocabulary scores of the \n 15\nyounger children in Scotland are higher than similar children from England but this is \njust a suggestion. \nINSERT FIGURE 5 HERE \nThe reading chart shows some clear differences from the vocabulary chart. \nThe Scottish children now fall increasingly behind the children from the three other \ncountries as the age increases. The English and Western Australian results form an \nunbroken continuum and the New Zealand scores are higher. The younger Scottish \nchildren are in line with the scores of children of the same age in England but for the \noldest children there is a discrepancy of 0.38 standard deviation units (Effect Size) or \nabout just over five months of development compared with similarly aged children in \nWestern Australia. \nINSERT FIGURE 6 HERE \nThe pattern for mathematics is very similar to the pattern for reading. The \nEnglish and Western Australian children follow a continuum and the Scottish children \nshow increasing discrepancies from Western Australia for older children. For the \noldest group starting school in Scotland there is a discrepancy of about 0.31 standard \ndeviation units (Effect size). This is equivalent to nearly four months of development. \nUnlike the reading data, the New Zealand results for mathematics are in line with the \nresults for the other countries. \n \nFurther investigation \nFactor analyses of the PIPS-BLA maths and reading scores suggested that \nthose things which would be expected to be taught at school, such as word \nrecognition, reading simple sentences and more formally presented maths problems, \nand which are usually not taught to children before the start of school form a different \nfactor from those that are acquired more naturally (Tymms 1999). By developing \n‘more naturally’ we mean that for areas such as vocabulary, a child is interacting with \ntheir environment and engaging in conversations with other children and adults.  An \nunderstanding of the concepts of print is once again developed from interaction with \nadults and exposure to a range of literature.  Other sections of the PIPS-BLA \n(Repeating Words, Rhyming Words, Ideas about Maths, Counting and Numerosity, \nShape Identification, Addition and Subtraction problems presented without formal \n 16\nnotation, and Single Digit Identification) reflect areas that will develop as a \nconsequence of a child’s interactions with their environment, adults and other \nchildren. It was therefore hypothesised that the higher scores of older children outwith \nScotland were the result of more formal teaching in the pre-school setting. This would \nfit with the findings reported in the PIRLS encyclopaedia (Mullis, Martin, Kennedy, \nand Flaherty, 2002) which compares pre-school curricular among the PIRLS \ncountries. However, further analysis did not support this hypothesis. The most formal \nparts of the assessment (formal sums, the identification of numbers greater than nine \nand the reading of words, sentences and paragraphs) showed little difference between \nchildren from Scotland compared with those from the other countries, with the \nexception of the oldest children from Scotland who were a little behind the other \ncountries. Further, the identification of single digit numbers, counting and simple \ninformal sums were also more or less in line with the results for England and Western \nAustralia, although once again the scores for Scotland were a little lower for older \nchildren. \nBut the greatest discrepancies were for Concepts about Print and letter \nidentification. Children of all ages in Scotland were consistently lower than the other \ncountries.  Interestingly, Concepts about Print scores were particularly high for New \nZealand, the country in which the work of Marie Clay, who pioneered Reading \nRecovery and invented the Concepts about Print scale, has been so important. \n \nSummary: Comparison of the developmental profiles of children starting \nschool in four English-speaking Countries \nScottish children start school at the age of 5 years on average. This is six \nmonths later than in England but the same as in New Zealand. In that country \nhowever, children start on or after their fifth birthday whereas in Scotland they \ngenerally start between the ages of 4.5 and 5.5. In Western Australia they start about \nsix months later. \nAfter taking age into account, the starting points of children in the four areas \nare very similar. However, older Scottish children appear to be behind in mathematics \nand early reading but not in vocabulary.  It is not easy to come to clear conclusions as \nto why the data for Scotland should differ in some cases quite markedly from other \ncountries.  However, in Part 1 of the analysis it was noted that the relationship \n 17\nbetween the outcome measures on the baseline assessment and pre-school experience \nwas weak, and it could be that there is a connection here.  It may be that the kind of \npre-school provision being provided outside Scotland is different from the kind of \nprovision provided within Scotland, but without further information about the pre-\nschool curricula of the different countries it is difficult to draw any conclusions.  It is \nalso difficult to know exactly what the long-term consequences of the differences seen \nabove are likely to be.  However, the data do raise questions about possible \ndifferences between pre-school in Scotland and the other countries.   \n \n 18\nConcluding Comments \n \nFunding from the Scottish Executive Education Department enabled the data \nfrom Scotland to be analysed in fine detail.  This analysis raised some very interesting \nissues and also provided a template for the analysis of PIPS-BLA data from other \ncountries should funds become available. \nResearch reports invariably call for more research and the call is heard so \noften that it can fall on deaf ears. But we believe that there are findings in this paper \nthat urge further investigation. Two specific questions could profitably be addressed: \n• Why is there such a weak link between the pre-school experience for \nchildren in Scotland and their starting points at school? \n• Why do older children starting school in Scotland seem to be starting \nschool at a lower level than children in other countries? \n Such questions suggest qualitative work in the first instance, which would \nseek to explore differences between Scotland and other countries in the approach to \npre-school. It would be important to link this to a review of the evidence base of pre-\nschool practice. \nIn calling for this work we are aware that it may be taken as an implied \ncriticism of current provision but this would be a misreading of our intentions. The \nresearch has thrown up some puzzling findings that need further investigation. We \nreally do not know why we have found what we have found. \nIn addition to investigating aspects of cognitive development it would be \ninteresting to look at the personal, social and emotional development of children in \nrelation to age of starting school. \n 19\nReferences \nBond, T. G. and C. M. Fox (2001). Applying the Rasch Model: Fundamental  \nMeasurement in the Human Sciences. Mahwah, NJ: Lawrence Erlbaum  \nAssociates. \nCEM Centre 2005: website www.cem.dur.ac.uk \nFitz-Gibbon, C.T. (1996), Monitoring Education: Indicators, Quality and \nEffectiveness. London: Cassell. \nMullis, I.V.S., Martin, M.O., Kennedy, A.M., & Flaherty, C.L. (2002), PIRLS \nEncyclopedia: A Reference Guide to Reading Education in the Countries \nParticipating in IEA’s Progress in International Reading Literacy Study \n(PIRLS), Chestnut Hill, MA: Boston College. \nhttp:\/\/timss.bc.edu\/pirls2001i\/PIRLS2001_Pubs_ER.html. \nScottish Executive (2000) The Structure and Balance of the Curriculum: 5 – 14 \nNational Guidelines.  Dundee: Learning and Teaching Scotland. \nScottish Executive (2001) Curriculum Framework For Children 3 – 5, Dundee: \nLearning and Teaching Scotland. \nStephens, C. (2006) Early Years Education: Perspectives From A Review Of The \nInternational Literature, \nhttp:\/\/www.scotland.gov.uk\/Resource\/Doc\/92395\/0022116.pdf \nTaylor Nelson Sofres and Aubrey, C. (2002) Implementing The Foundation Stage In \nReception Classes.  Brief Number 350 published by Department for Education \nand Skills. \nTymms, P. (1999a). Baseline Assessment and Monitoring in Primary Schools: \nAchievements, Attitudes and Value-added Indicators. London: David Fulton \nPublishers. \nTymms, P. B. (1999b) Baseline assessment, value-added and the prediction of reading. \nJournal of Research in Reading, 22(1), 27-36. \nTymms, P., & Coe, R. (2003). Celebration of the Success of Distributed Research \nwith Schools: the CEM Centre, Durham. British Educational Research \nJournal, 29(5), 639-653. \nTymms, P. Merrell, C. and Jones, P. (2004), Using Baseline Assessment Data To \nMake International Comparisons British Educational Research Journa,l 30(5) \np673 - 689 \nTymms, P.B. and Merrell, C, (2004), On-entry baseline assessment across cultures in \nAnning, A. et al (Eds.) Early Childhood Education: Society and Culture, \nLondon: Sage. \nTymms, P. and Middleton, P. (1995), Value-Added 5 – 7, Report on Progress,  \nCurriculum Evaluation and Management Centre, University of Durham. \n \nVan der Hoeven-van Doornum, A. (2005) Development on scale, instruction at  \n measure: Study for a system of value added indicators in primary education,  \n  Nijmegen: ITS, Radboud Universiteit Nijmegen.. \n \nVan de Rijt, B., Godfrey, R., Aubrey, C., Luit, van, J.E.H., Ghesquiere, P., Torbeyns,  \n 20\nJ., Hasemann, K., Tancig, S., Kavkler, M., Magajna, L. and Tzouriadou, M.  \n(2003) The Development of Early Numeracy in Europe. Journal of Early  \nChildhood Research 1(2): 155 – 180. \n 21\nFigure 1 Cognitive Profile of Children Starting School in Scotland \n \n \n \nLogits         Distribution          Map of items \n  of                 Difficult \n                        children \n \n \n \n    6                +  42-17=? \n                     | \n                     |  What is 21 more than 32? \n                     | \n    5             .  +  What is 8 more than 13?  What is a quarter of 8? \n                  .  | \n                  .  |  15+21=? \n                  .  |  What is half of six? \n    4             .  +   \n                  .  |  9-6=? \n                  .  |  7+3=? \n                  .  |   \n    3             .  +  What is 3 more than 8? \n                  .  |  Point to some cosmetics. \n                  .  |   \n                 .#  |  Read simple sentences, e.g. ‘The cat went for a walk’. \n    2           .##  +  Identify several two-digit numbers. \n               .###  |  Read high-frequency words e.g. dog, tree. \n              .####  |  Point to a capital letter. \n            .######  |   \n    1     .########  +   \n        .##########  |  Point to a microscope. \n      .############  |  Identify all letters. \n      .############  |  Point to a hexagon. \n    0 .############ M+M Identify approx half of letters. \n       .###########  |  Do informally presented subtraction problems. \n         .#########  |  Repeat 3-syllable words correctly. \n           .#######  |  Identify all single digits. \n   -1       .######  +  Understand meaning of math concepts such as ‘most’ and ‘least’. \n               Point to first letter of his\/her first name. \n              .####  |  Detect some rhyming words. \n               .###  |  Count to 7 and recall counting 7 objects. \n                .##  |   \n   -2            .#  +  Identify half of single digits. \n                 .#  |  \n                  .  |  Count to 4. \n                  .  |   \n   -3             .  +  Point to some cherries. \n                  .  |  Point to a kite. \n                  .  | \n                  .  |   \n   -4             .  +  Understand the meaning of math concept of ‘smallest’. \n                  .  |  Point to someone writing and someone reading. \n                     |  \n                  .  |  Point to a fork. \n   -5             .  +  Point to some carrots. \n \n            \n            Easy \n \n 22\nTable 1  Samples of children in 2003 whose first language was English \nCountry Number of pupils \nScotland 8,652 \nEngland 65,258 \nWestern Australia 10,630 \nNew Zealand 5,870 \n \n  \nTable 2  Sex \nSection Advantage to \ngirls \nSD boys SD girls \nVocabulary 0.06 1.00 0.97 \nPhonological \nawareness \n0.15 0.97 0.97 \nReading 0.21 1.00 0.99 \nMathematics 0.00* 1.05 0.95 \n* Not significant \n \nTable 3  Home background \nSection Advantage to \nthose without free \nmeals \nSD with FSM SD no FSM \nVocabulary 0.62 0.99 0.97 \nPhonological \nawareness \n0.45 1.01 0.96 \nReading 0.69 0.97 0.98 \nMathematics 0.68 1.04 0.99 \n \n \nTable 4  Pre-school experience \nSection Advantage for \neach term in pre-\nschool \nComparative \nresult from \nEngland \nVocabulary 0.01* 0.10** \nPhonological \nawareness \n0.01* 0.07** \nReading 0.01* 0.10** \nMathematics 0.03 0.11** \n*Not significant \n 23\nTable 5 Age \nSection Scotland \nGain per year \nEngland \nGain per year \nVocabulary 0.41 0.66 \nPhonological \nawareness \n0.34 0.68 \nReading 0.56 0.85 \nMathematics 0.66 0.98 \n \nTable 6  Correlation between difficulties of 56 reading items6 \n  WA NZ England \nNZ .99   \nEngland .97   .96  \nScotland .96 .94 .99 \n \n \nTable 7  Correlation between difficulties of 17 vocabulary items7 \n  WA NZ England \nNZ .96   \nEngland .97 .96  \nScotland .95 .96 .99 \n \n \nTable 8  Correlation between difficulties of 17 phonological awareness items8 \n  WA NZ England \nNZ .98   \nEngland .96 .98  \nScotland .91 .91 .95 \n**  Correlation is significant at the 0.01 level (2-tailed). \n \n \n                                                 \n6 A few infrequently presented items with large errors were omitted. \n7 A few infrequently presented items with large errors were omitted. \n8 A few infrequently presented items with large errors were omitted. \n 24\nFigure 2 Mathematics and Terms in Pre-school in Scotland \n16853311946173513771209N =\nData for Scotland\nTerms in preschool\n6543210\nM\nat\nhe\nm\nat\nic\ns\n.2\n.1\n0.0\n-.1\n-.2\n-.3\n-.4\n-.5\n \nFigure 3 Mathematics and Terms in Pre-school in England \n100234926424226738245012921887N =\nData for England\nTerms in pre-school \n6.005.004.003.002.001.00.00\n M\nat\nhe\nm\nat\nic\ns\n.4\n.2\n0.0\n-.2\n-.4\n-.6\n-.8\n \n \n 25\n Figure 4 Vocabulary \n \n \nAge Category\n9.008.007.006.005.004.003.002.001.00\nS\nco\nre\n3.5\n3.0\n2.5\n2.0\n1.5\n1.0\n.5\nNew Zealand\nEngland\nScotland\nWestern Australia\nS\nco\nre\nS\nco\nre\nS\nco\nre\n 26\nFigure 5 Reading \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nAge Category\n9.008.007.006.005.004.003.002.001.00\nSc\nor\ne\n1.0\n.5\n0.0\n-.5\n-1.0\n-1.5\n-2.0\n-2.5\n-3.0\nNew Zealand\nEngland\nScotland\nWestern Australia\nSc\nor\ne\nSc\nor\ne\nSc\nor\ne\nFigure 6 Mathematics \n \n \n  \nAge Category\n9.008.007.006.005.004.003.002.001.00\nS\nco\nre\n1.0\n.5\n0.0\n-.5\n-1.0\n-1.5\n-2.0\n-2.5\n-3.0\nNew Zealand\nEngland\nScotland\nWestern Australia\nS\nco\nre\nS\nco\nre\nS\nco\nre\n 27\n"}