{"doi":"10.1080\/09687760108656772","coreId":"14089","oai":"oai:generic.eprints.org:762\/core5","identifiers":["oai:generic.eprints.org:762\/core5","10.1080\/09687760108656772"],"title":"Usage, attitudes and workload implications for a Web-based learning environment","authors":["Collis, Betty","Messing, John"],"enrichments":{"references":[{"id":194632,"title":"A report of the TeleTOP survey',","authors":[],"date":"2000","doi":null,"raw":"Messing, J.  (2000a),  'A report of the TeleTOP survey', May 2000,  internal report, D1NKEL Institute, University of Twente.","cites":null},{"id":194633,"title":"A study of the use of on-line supported learning facilities at Charles Sturt University',","authors":[],"date":"2000","doi":null,"raw":"Messing, J. (2000b), 'A study of the use of on-line supported learning facilities at Charles Sturt University', ED-MEDIA 2000 World Conference on Educational Multimedia,  Hypermedia and Telecommunications,  28 June, Montreal, Canada.","cites":null},{"id":194634,"title":"A survey of course Web sites and online syllabi',","authors":[],"date":"2000","doi":null,"raw":"Rankin, W. (2000),  'A survey of course Web sites and online syllabi', Educational Technology, 40 (2), 38-42.","cites":null},{"id":194635,"title":"Course support systems: the first generation',","authors":[],"date":"1999","doi":null,"raw":"Robson, R.  (1999),  'Course support systems: the first generation', International Journal of Educational Telecommunications,  5 (4),  131-42.","cites":null},{"id":445640,"title":"Didactics for Web learning environments: active learning',","authors":[],"date":"2000","doi":"10.1076\/1049-4820(200012)8:3;1-d;ft257","raw":"Van der Veen, J., De Boer, W., and Collis, B. (2000),  'Didactics for Web learning environments: active learning', Technical Report, TeleTOP Alpha-Beta Project, DINKEL Institute, University of Twente.","cites":null},{"id":194631,"title":"Evaluating teaching initiatives which employ resource based learning', available at http:\/\/www.ultibase.rmit.edu.au\/Articles\/lingp2.htm.","authors":[],"date":"1997","doi":null,"raw":"Ling,  P.  (1997),  'Evaluating  teaching  initiatives  which  employ resource  based  learning', available at http:\/\/www.ultibase.rmit.edu.au\/Articles\/lingp2.htm.","cites":null},{"id":194626,"title":"Evaluation TeleTOP and C@mpus+ 1998\/99, End Report,","authors":[],"date":"1999","doi":null,"raw":"Bloemen, P.  (1999),  Evaluation  TeleTOP  and C@mpus+  1998\/99,  End Report,  Faculty of Educational Science and Technology, University ofTwente, Enschede, NL.","cites":null},{"id":194628,"title":"Flexible Learning in a Digital World.&quot; Experiences and Expectations,","authors":[],"date":"2001","doi":"10.1016\/s0360-1315(02)00022-2","raw":"Collis, B.,  and Moonen, J.  (2001),  Flexible Learning in  a Digital  World.&quot; Experiences  and Expectations,  London: Kogan Page.","cites":null},{"id":194629,"title":"How do instructors design a WWW-based course-support environment?',","authors":[],"date":"1999","doi":"10.1006\/jnca.1999.0098","raw":"De Boer, W. and Collis, B. (1999),  'How do instructors design a WWW-based course-support environment?',  in  B.  Collis  and  R.  Oliver  (eds.),  Proceedings  of ED-MEDIA-99  Worm Conference  on  Educational  Multimedia,  Hypermedia  and  Telecommunications,  Vol.  1., 299-304, Charlottesville, VA: AACE.","cites":null},{"id":445638,"title":"It's not just the tool, but the educational rationale that counts', EDMEDIA","authors":[],"date":"2000","doi":null,"raw":"Salomon, G.  (2000),  'It's not just the tool, but the  educational rationale that counts', EDMEDIA  2000  World  Conference  on  Educational  Multimedia,  Hypermedia  and Telecommunications,  28 June, Montreal, Canada.","cites":null},{"id":445639,"title":"Strategic requirements for a system to generate and support WWW-based environments for a faculty',","authors":[],"date":"1999","doi":null,"raw":"Tielemans, G., and Collis, B.  (1999),  'Strategic requirements  for a  system to generate and support  WWW-based  environments  for  a  faculty',  in  B.  Collis  and  R.  Oliver  (eds.), Proceedings of ED-MEDIA 1999:  World Conference  on Educational Multimedia,  Hypermedia and Telecommunications,  Vol. 1,346-51, Charlottesville, VA: AACE.","cites":null},{"id":194630,"title":"TeleTOP at the Telematics Faculty', internal report,","authors":[],"date":"1999","doi":null,"raw":"Fisser, P., Kamp, I. Van de, and Slot, C. (1999),  'TeleTOP at the Telematics Faculty', internal report, DINKEL Institute, University of Twente, Enschede, NL.","cites":null},{"id":1877069,"title":"The adaptation and use of a WWW-based coursemanagement system within two different types of faculties at the University of Twente',","authors":[],"date":"2000","doi":null,"raw":"Collis,  B.,  and  De  Boer,  W.  (2000),  'The  adaptation and use  of a  WWW-based  coursemanagement system within  two  different types  of faculties  at  the  University of Twente', ED-MEDIA  2000  Worm  Conference  on  Educational  Multimedia,  Hypermedia  and Telecommunications,  28 June, Montreal, Canada.","cites":null},{"id":194627,"title":"The adaptation and use of a WWW-based coursemanagement system within two different ypes of faculties at the University of Twente',","authors":[],"date":"2000","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2001","abstract":"At the University of Twente, a locally developed Web-based learning environment called the TeleTOP system is being implemented throughout the university after being first developed and used in the Faculty of Educational Science and Technology, followed by use in the Department of Telematics. Studying the usage choices of instructors with regard to tools offered by the system, as well as the instructors' workload implications and attitudes, is valuable not only for the implementation activities in the rest of the university, but more generally for those studying the impact on educational practice of Web-based learning environments containing course-management tools. This paper reports on a study of thirty-three TeleTOP using instructors from the two faculties at the end of the 1999–2000 academic year. The results show that instructors feel that a major benefit of using the system is that it is a catalyst for a re-evaluation of one's own teaching; many instructors do not make use of the tailoring options; decisions about use of the system and the provision of feedback are based on the current instructional practices of the instructor; and instructors perceive increases in their workload to be a problem (whenin fact the actual amounts of time spent vary considerably and include instructors with minimal investments)","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14089.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/762\/1\/ALT_J%2DVol09_No1_2001_Usage%2C_attitudes_and__workload_.pdf","pdfHashValue":"cc5d590b02acf799a38549f1df004131b97e0bd9","publisher":"Taylor and Francis Ltd","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:762<\/identifier><datestamp>\n      2011-04-04T08:54:15Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/762\/<\/dc:relation><dc:title>\n        Usage, attitudes and workload implications for a Web-based learning environment<\/dc:title><dc:creator>\n        Collis, Betty<\/dc:creator><dc:creator>\n        Messing, John<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        At the University of Twente, a locally developed Web-based learning environment called the TeleTOP system is being implemented throughout the university after being first developed and used in the Faculty of Educational Science and Technology, followed by use in the Department of Telematics. Studying the usage choices of instructors with regard to tools offered by the system, as well as the instructors' workload implications and attitudes, is valuable not only for the implementation activities in the rest of the university, but more generally for those studying the impact on educational practice of Web-based learning environments containing course-management tools. This paper reports on a study of thirty-three TeleTOP using instructors from the two faculties at the end of the 1999–2000 academic year. The results show that instructors feel that a major benefit of using the system is that it is a catalyst for a re-evaluation of one's own teaching; many instructors do not make use of the tailoring options; decisions about use of the system and the provision of feedback are based on the current instructional practices of the instructor; and instructors perceive increases in their workload to be a problem (whenin fact the actual amounts of time spent vary considerably and include instructors with minimal investments).<\/dc:description><dc:publisher>\n        Taylor and Francis Ltd<\/dc:publisher><dc:date>\n        2001<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/762\/1\/ALT_J-Vol09_No1_2001_Usage%2C_attitudes_and__workload_.pdf<\/dc:identifier><dc:identifier>\n          Collis, Betty and Messing, John  (2001) Usage, attitudes and workload implications for a Web-based learning environment.  Association for Learning Technology Journal, 9 (1).  pp. 17-25.  ISSN 0968-7769 (print)\/1741-1629 (online)     <\/dc:identifier><dc:relation>\n        10.1080\/09687760108656772<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/762\/","10.1080\/09687760108656772"],"year":2001,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Usage, attitudes and workload implications for a \nWeb-based learning environment \nBetty Collis* and John Messing** \n*University of Twente, Netherlands \n**Charles Sturt University, Australia \nemail: collis@edte.utwente.nl \nAt the University of Twente, a locally developed Web-based learning environment called \nthe TeleTOP system is' being implemented throughout the university after being first \ndeveloped and used in the Faculty of Educational Science and Technology, followed by \nuse in the Department of Telematics. Studying the usage choices of instructors with \nregard to tools offered by the system, as well as the instructors' workload implications \nand attitudes, is valuable notonly for the implementation activities in the rest of the \nuniversity, but more generally for those studying the impact on educational praetice of \nWeb-based learning environments containing course-management tools. This paper \nreports on a study of thirty-three TeleTOP-using instructors from the two faculties at the \nend of the 1999-2000 academic year. The results how that instructors feel that a major \nbenefit of using the system is that it is a catalyst for a re-evaluation of one's own \nteaching,\" many instructors do not make use of the tailoring options; decisions about use \nof the system and the provision of feedback are based on the current instructional \npractices of the instructor,\" and instruetors perceive increases in their workload to be a \nproblem (when in fact the actual amounts of time spent vary considerably and include \ninstructors with minimal investments). \nThe TeleTOP system at the University of Twente \nThe tools and features of Web-based course-management systems vary (see \nhttp:llwww.ctt.bc, callandonlinel, for an analysis and comparison of several commercially \navailable systems) but typically include tools to support he organization of the course, \ntools to support communication, t ols to support student activities uch as submission of \nassignments and collaborative work, and 'back-office' tools to handle user registration, \nmaintenance of user data, and, in some systems, tools to tailor the view of a course site \nmade available to a registered user (Robson, 1999). Although many tools and features are \n17 \nBetty Collis and John Messing Usage, attitudes and workload implications for a Web-based learning environment \navailable in such Web-based learning environments, it is not the case that instructors \nnecessarily make use of all these tools and features. Rankin (2000) for example, notes that \n'most instructors have failed to take full advantage of the growing resources available to \nthem online'. Rankin suggests that the creation and incorporation of templates into course \nWeb sites could be a strategy to provide instructors with a simple and effective way of \ndeveloping their Web-accessible materials. Such templates are the basic building blocks of \nthe TeleTOP learning environment used at the University of Twente. \nIn the Faculty of Educational Science and Technology, there has been extensive pioneering \nexperience with the use of Web-based tools and functionalities since early 1994 (for a \nreview, see Collis and Moonen, 2001). In 1997, the faculty management decided to move \nfrom its pioneer experiences to a faculty-wide systematic use of a Web-based course- \nmanagement learning environment. The decision was not technology-driven, but strategic \nand educational. Firstly, it was strategic in that the faculty decided actively to pursue a new \ncohort: working students wishing to stay in their jobs and home communities. Secondly, it \nwas educational in that these working students were not to be treated as a distinct 'distance \neducation' cohort, but instead all students, regardless of location, were to benefit from a \nnew version of the educational philosophy of the faculty, with the students as active \ncontributors to their courses. Such aspirations had to be grounded in the reality base of the \ninstructors: their available time, their willingness to use a Web-based system, their \nwillingness to adapt to new cohorts of students and to a process of educational change. \nBecause no existing system could be located that satisfied the core functional requirements \nderived to support his educational vision (Tielemans and Collis, 1999), the TeleTOP team \nproduced its own system (for more information, see http:llteletop, edte. utwente, nl). \nA critical feature of the TeleTOP system is that instructors can determine themselves, \nbefore or during a course, which of more than thirty features or tools they wish to have in \ntheir course environments. These choices can be changed at any time, by the instructor, \nwithout need for technical-support staff intervention. The standard features from which \ninstructors could choose in 1999-2000 were: news; roster (a complex, matrix structure via \nwhich assignments can be submitted, feedback given, course study materials made \navailable, and course structure and time-tabling visualized); course information; email \ncentre (allowing the instructor or students to f rm aliases for groups of students as well as \nsend emails to any individual associated with the course); discussion forums; question and \nanswer features; chat; various types of groupware tools; a glossary feature; t mplates for \nstudent presentations; a template for creating a page of Web links grouped into categories; \nmultimedia rchives; publication bibliographies; a quiz creation and management tool; \nadministration tools for the instructor; search tools for both the Domino database itself \nand generally; and a variety of other options. In addition, instructors can request ools or \nfeatures of particular value to their own courses. This list of choices is offered to the \ninstructor as a clickable list via the TeleTOP Decision Support Tool, also part of the \nTeleTOP system (DeBoer and Collis, 1999). \nComparison of use in a social science and technical faculty, 1998-1999 \nThe first version of the TeleTOP system was developed in the 1997-8 academic year nd \nserved as the basis for twenty-four ' e-engineered' courses in the Faculty of Educational \nScience and Technology in the 1998-9 academic year. Also during the 1998-9 academic \nyear, the Department of Telematics wanted to make use of TeleTOP for its courses, so \n18 \nAir-] Volume 9 Number I \npreparations began for the use of the system in that department to start full-scale in the \n1999-2000 academic year, with three pilot courses during 1998-9. During the 1998-9 \nacademic year, evaluations were carried out of the TeleTOP experiences, in both the \neducation and telematics faculties (Bloemen, 1999; De Boer and Collis, 1999; Fisser, \nKamp, Van de and Slot, 1999). The most significant results of these evaluations indicated \nthat instructors and students were satisfied with the TeleTOP system and believed it was \ncontributing to positive changes in educational practice. There did not seem to be much \ndifference between the instructors in the two faculties in terms of the functions they chose \nwith the Decision Support Tool. However, points of concern in both the education and \ntelematics faculties were that the instructors: \n• were concerned about he higher time investments hat would be needed on their parts; \n• felt that they were spending large amounts of time in giving personalized feedback, \nwhile students did not always perceive the feedback as helpful or timely enough. \nEvaluation based on experiences in the 1999-2000 academic year \nIn the 1999-2000 academic year, over eighty courses in the education faculty (all of the \nfirst- and second-year courses, all of the core courses in the Masters programme of the \nfaculty, and a variety of the remaining courses) were re-engineered pedagogically and \ntechnically. In addition, all of the first-year courses in the telematics department (as well as \ncourses in other faculties in our university and courses in a law faculty at another \nuniversity, see Collis and De Boer, 2000) were converted. During the same period, the \ndecision was made by the university management to extend the use of TeleTOP \nthroughout the entire university so that students would have a consistent and powerful \nsystem to support their leaming regardless of what faculty they attended. Thus the \nexperiences of the two pioneering faculties became of particular importance in a practical \nsense as well as a conceptual perspective. Is TeleTOP suitable for use in other sorts of \nfaculties different from the social-science s tting in which it was created? How do technical- \nsubject instructors respond? In particular, an evaluation was conducted (Messing, 2000a) \nstarting from the results of the 1998-9 experiences and including the following questions: \n• What differences are detectable in the experiences of instructors in the two faculties (a \nsocial science and a technical faculty) in their use of TeleTOP, with regard to \ninstructors' perceptions of learning impact? \n• Why do instructors choose to use or not use certain TeleTOP features? \n• What generalizations about workload changes, particularly with respect to the handling \nof feedback, can be made? \nThe remainder of this article discusses the main results of this evaluation. \nMethod for the 1999-2000 evaluation \nThe subjects consisted of instructors in the Faculty of Educational Science and \nTechnology (called internally by the initials 'TO') and the Telematics department of the \nFaculty of Computer Science (called internally 'TE') who had redesigned and taught \ncourses during the 1999-2000 academic year using the TeleTOP system. A total of thirty- \nthree instructors, twelve from the Telematics department and the remainder from the \n19 \nBetty Co#is and john Messing Usage, a~itudes and workload implications for a Web-based learning environment \nFaculty of Educational Science and Technology responded. This represents a return rate of \n75 per cent of the instructors using TeleTOP from the Telematics department and over 60 \nper cent of the instructors using TeleTOP from the Faculty of Educational Science and \nTechnology. Of the respondents from the education faculty, eleven had also used TeleTOP \nin the 1998-9 academic year while for ten their use of TeleTOP in the 1999-2000 year was \ntheir first experience. Forty courses were represented in these responses ( everal instructors \nhad more than one course in the sample). \nA survey instrument consisting of checklist-type choices with opportunities for open- \nended responses was prepared, piloted and revised. The questionnaire consisted of two \nparts, one a general summary of experiences and attitudes toward the use of the TeleTOP \nenvironment, and the second specific to each course that the instructor taught. Most of the \ndata were collected by a combination of the survey and individual interviews with \ninstructors during the last month of the 1999-2000 academic year. \nResults \nThe following are some main aspects of the results (Messing, 2000a). \nWhat is new in your teaching as a result of using TeleTOP? \nThe majority of the open-ended responses to these questions focused on improved \nopportunities for feedback provision. These were both qualitative, in terms of new ways of \nproviding feedback (for example, peer evaluation), and also procedural (faster provision, \nvia the course site, with feedback available on the course site, feedback to groups via the \nsite). Other new teaching aspects included the reuse of student work as models, more \npersonal feedback and improvements to presentation of material. \nHave your students had a better learning experience than before? \nThe overwhelming majority of respondents were positive about the use of TeleTOP, even \nthough they may have had some criticisms of one or more components. The primary \nreason for this positive attitude was a conviction of the value of a Web-based environment \nfor learning. An interesting reference was made a number of times to the fact that he \nintroduction of this new approach to teaching and learning provided a valuable \nopportunity for the instructor to re-think course goals, content and teaching strategies, \nwhich in turn impacted on the students. \nWith respect o TeleTOP providing a better learning experience than without it, nearly \ntwo-thirds of all the respondents indicated that the result was a better learning experience \nfor students. The justifications were frequently not related to TeleTOP as such but had \nmore to do with the process of systematically implementing a new teaching strategy \ninvolving the use of Web-based tools. A second general category of remarks was that \nTeleTOP provided increased flexibility for students as well as instructors. Providing a more \nflexible timeframe for the learning process rather than a rigid synchronization was seen as \nan important convenience factor for the student as well as the instructor. Having access to \ninformation and communication, assignments and feedback, regardless of location, was \ncited as an important benefit o both students and instructors; \nInstructors also noted that their use of TeleTOP resulted in 'more activity and instruction \nof students' accompanied by 'an overview of the tempo of the learning and level of \nparticipation'. Students are 'stimulated to react\/comment more int nsely' with new options \n20 \nAIt-J Volume 9 Number I \nadded to the learning process, for example, 'giving students the opportunity to exchange \ninformation greater student interaction'. The course becomes 'more personal for \nstudents'. Finally, many instructors noted practical benefits (with educational \nimplications) for students and themselves via the use of TeleTOP. \nI f  there were no p sitive changes in the learning experience, why not? \nHowever positive such observations were, the fact remained that approximately one-third \nof the respondents did not believe that their use of TeleTOP improved the learning \nexperience in their courses (although none indicated that they felt the learning experience \nwas worse). Examination of the justifications for this attitude revealed that many of these \nrespondents admitted that they or their students were not using TeleTOP to its full \npotential or were simply using minimalist strategies to meet policy requirements. ('My \nmaterial is basically a set of lectures, TeleTOP is not used to add anything extra'.) This is \nnot an uncommon situation. Salomon (2000) calls it the 'domestification' of technology, to \ndo nothing more than applying it to existing 'housekeeping'. Messing (2000b) analysed \ndata from a comparable study, in which less than 10 per cent of a set of courses were able \nto meet even minimal criteria for conscientious use. Clearly there is a need to ensure that \npolicies involving a Web-based learning environment are not just given token service. \nUse and perceived value of TeleTOP features \nThe use and perceived value of TeleTOP features were measured by asking respondents o\nindicate which of the core set of TeteTOP features they had chosen for their courses, why \nthey had or had not chosen the feature, and to give their rating of the different components \naccording to usefulness. Figure 1 shows the percentage of feature selection for the two \nfaculties. \nA brief description of these features follows. The captions refer to, from left to right: news; \nroster; course information; email; discussion; question and answer; chat; 'BSCW' (the \nname of a shared workspace application); Workspace (a different groupware tool, also \nwith shared workspace functionalities, but less complex than BSCW); presentation (where \nstudent work can be presented in a sort of showcase area); glossary; Web links; \nmultimedia; publications; quiz (quiz-making tools); search; and free (to be designated as \nrequested by the instructor). These are not the only functionalities available in TeleTOP, \nbut rather the ones most commonly chosen by the instructors. There is no requirement \nimposed by the system or by either the Faculty of Educational Science and Technology or \nthe Telematics Department as to what instructors must choose. The choice and \ncombination is left to the instructor and can be altered at any time via a simple 'decision- \nsupport tool' in the system. The 'roster' is the most flexible and versatile of the \nfunctionalities. It is a tool by which an instructor can build a matrix to serve some sort of \norganizational role in the course (such as, one row per week or one row per topic; different \nrows for different groups, etc.). Also, each cell in the roster can be linked to different \ntemplates which in turn can be used for combinations of instructor-submitted r sources \nand student-submitted assignments and resources. \nAs with the situation in the Faculty of Educational Science and Technology in the 1998-9 \nacademic year (De Boer and Collis, 1999), the most highly rated features were the \norganizational ones (roster, news, and course information), a view shared in both faculties. \nBy virtue of user choices, the organizational features have become a de faeto core. The \n21 \nBetty Col\/is and John Messing Usage, attitudes and workload imptications for a Web-based learning environment \nFeature use by faculty \n\/ \n• Feature use (TO) [] Feature use (TE) ! \n00% \n8o% \n60% \nF- \n40% \n20% ~~-  \n. . . .  I |  | \n, p , , , \n,1. \n~ ~ 8 g :~  .o  . _  ® o ,- = -, ~ .~ \nz o 5 0_ ~ o_ ~ ~= ~_ a ~ u_ \nnn \nFigure h Use of TeleTOP features by faculty ('TO' ore the Dutch inidals for the Faculty of Educational \nScience and Technology, TE' for the Department of Telematics). \nroster was becoming a key component for a resource-based learning (RBL) approach \n(Ling, 1997), indicating a shift from teacher-based l cturing to resource-based information \norganization. \nIn terms of differences between the faculties, it can be seen that the Education Faculty \nmade considerably greater use of the email possibilities in the system, while the Telematics \nDepartment made greater use of the frequently asked questions area. In a comparison of \nchoices within the Education Faculty itself between the 1998-9 and 1999-2000 academic \nyears (De Boer and Collis, 1999) only three features showed any significant change. In the \nsecond cycle (1999-2000) there was a marked increase in the Faculty of Educational \nScience and Technology in the use of Web links (52 per cent up to 96 per cent) and \nfrequently asked questions (5 per cent up to 37 per cent), and a decrease in the use of the \nglossary feature (71 per cent down to 44 per cent). The use of the roster, email, course \ninformation and news was full in both cycles. Analysis of the reasons for choosing or not \nchoosing aparticular feature revealed that the decisions about he use of a tool were based \nlargely on the current practices of the instructors, but that a migration from support of \nexisting practices to support of new practices can evolve over time and experience. \nFeedback and workload \nThe increased activity of students leads to an increased need for feedback from the \ninstructor. In the Faculty of Educational Science and Technology, for example, the average \ncourse included more than six rounds of student submissions, for assignments, discussions, \n22 \nAIt-J Volume 9 Number I\npartial versions of final projects, etc. For most instructors, this was much more interaction \nthan they had been involved with before using TeleTOP. Instructors expressed many \nconcerns about he time needed for feedback as well as the management of feedback. In \nanother study, Van der Veen, De Boer and Collis (2000) analysed the types of feedback \ngiven by instructors in the Education Faculty in the 1999-2000 academic year and found \nthe majority of instructors gave the most labour-intensive form of feedback: personal \ncomments to each individual student (see Table 1). Many instructors took a pragmatic \napproach in limiting the time they spent giving feedback. \nType of Feedback ~ ~ \n~o ~ ~ ~ E~ ° \nType of assignment ~= ~_ o. \nI. Searching for new 5 \ninformation \n2. Case studies 3 \n3. Role play \n4. Reports I \n5. Production of 2 \nmultimedia \nproducts \n6. Assignments 6 \nrelated to theory \n7. Skill practice I \n8. Testing, quiz \nI 6 \nI 4 \nI I \nI \nI 3 6 \n2 8 \n3 4 \nI I \nTotal 18 2 2 8 I 31 \nTable I: Forms of feedbacl~ Faculty of Educational Science and Technology 999-2000, thirty-one \ncourses. \nIn general, in both faculties, instructors in their first year of use simply tried to adapt their \nexisting practices to TeleTOP or bypassed TeleTOP and persisted with their normal \nroutine. More generally, instructors were asked to provide stimates of the amount of time \nthey spent in organizing and delivering TeleTOP-based material. The estimates were \ncollected for time spent prior to the start of the teaching period and time spent during the \nteaching period. There was a wide variability in the responses (of the twenty-nine giving \nestimates, the total time spent ranged between 6 and 488 hours with ten between 6and 32 \nhours, thirteen between 38 and 80 hours, and eight between 102 and 488 hours (with six of \nthese eight in the range 102-62 hours). Most instructors indicated that they just could not \nmake a good estimate and were thus just guessing. For a 'new TeleTOP' course, instructors \nwere likely to require a preparation time somewhere between 30 per cent and 150 per cent \nof the time allocated to the delivery of the course. Furthermore, the preparation time in \n23 \nBetty Collis and John Messing Usage, attitudes and workload implications for a Web-based learning environment \nsubsequent sessions is likely to be reduced but not dramatically. However, the data revealed \nthat those instructors most familiar with the system spent the most time. In subsequent \ninterviews it became clear that these persons were also pioneers in the area, who regularly \nspent considerable time on preparation and delivery of their courses, trying new \nmethodologies and technologies. For the majority of instructors, it cannot be said that \ntheir estimated time involvement for a semester-long course was excessive; however, \nbaseline data from their ordinary situations were not available. \nConclusions \nOn the whole the strategy of progressive implementation f TeleTOP appears to have been \npositively received in both the Education Faculty and the Telematics department. In both, \nthe existing practices and skills of an instructor play an important role in determining how \na Web-based system will be adopted and used. Instructors are most likely to begin by \nchoosing aspects of a system that reflect heir current ways of teaching, and then gradually \nmove to new instructional approaches and new features. A system should be flexible \nenough so that instructors can find a comfortable starting-point, but are stimulated rather \nthan constrained by the system in moving beyond that starting-point. TeleTOP appears to \noffer these characteristics. \nWorkload is a significant consideration; most instructors felt that their workload had \nincreased but found it difficult to quantify where or by how much. While the accuracy of \ninstructor self-report with respect o workload is likely to be poor, it does seem that \nworkload concerns are a relevant issue. Instructors pending the most time were pioneers \nputting in large amounts of time by choice, not because the new ways of teaching and of \nusing the technology forced an increased workload upon them. Many instructors invested \nlittle time by either relative or absolute standards, and thus workload concerns may be for \nmany instructors a matter of perception rather than of fact. The benefits of reduced face- \nto-face contact and greater flexibility in location (working from home or any part of the \nworld) were recognized as real advantages, but the disadvantages of greater time involved \nin preparation and in more instances of contact with students, were also keenly felt. \nManaging to work 'smarter' with this technology rather than simply working harder is a \ngoal that has not yet been achieved. \nThe answer to the general question underlying this study - 'are technical-subjects \ninstructors different from social-science instructors in their needs for a Web-based learning \nsystem?' - appears to be that the differences are not substantial. The experiences with \nTeleTOP in both faculties how that instructors will use new tools, if they perceive their \neducational relevance and management feasibility. However, there seem to be indications \nthat the use of the tools beyond a minimum level will vary according to the individual \nunless sustained initiatives are in place to stimulate more creative teaching and learning \napproaches (Collis and Moonen, 2001). Getting instructors over the first obstacle of usage \nis a major step, and the faculties at the University of Twente are moving through this in \nrapid fashion. Getting instructors to delve more deeply into tailoring, and into finding \nworkload-sustainable m thods to handle different groups of students with different views \nof a course, is the challenge for the next period at the University of Twente. This problem \nwill be even more difficult to confront han the initial implementation challenge. \n24 \nAIt-J Volume 9 Number I \nReferences \nBloemen, P. (1999), Evaluation TeleTOP and C@mpus+ 1998\/99, End Report, Faculty of \nEducational Science and Technology, University ofTwente, Enschede, NL. \nCollis, B., and De Boer, W. (2000), 'The adaptation and use of a WWW-based course- \nmanagement system within two different ypes of faculties at the University of Twente', \nED-MEDIA 2000 Worm Conference on Educational Multimedia, Hypermedia and \nTelecommunications, 28 June, Montreal, Canada. \nCollis, B., and Moonen, J. (2001), Flexible Learning in a Digital World.\" Experiences and \nExpectations, London: Kogan Page. \nDe Boer, W. and Collis, B. (1999), 'How do instructors design a WWW-based course-support \nenvironment?', in B. Collis and R. Oliver (eds.), Proceedings of ED-MEDIA-99 Worm \nConference on Educational Multimedia, Hypermedia nd Telecommunications, Vol. 1., \n299-304, Charlottesville, VA: AACE. \nFisser, P., Kamp, I. Van de, and Slot, C. (1999), 'TeleTOP at the Telematics Faculty', internal \nreport, DINKEL Institute, University of Twente, Enschede, NL. \nLing, P. (1997), 'Evaluating teaching initiatives which employ resource based learning', \navailable at http:\/\/www.ultibase.rmit.edu.au\/Articles\/lingp2.htm. \nMessing, J. (2000a), 'A report of the TeleTOP survey', May 2000, internal report, D1NKEL \nInstitute, University of Twente. \nMessing, J. (2000b), 'A study of the use of on-line supported learning facilities at Charles Sturt \nUniversity', ED-MEDIA 2000 World Conference on Educational Multimedia, Hypermedia and \nTelecommunications, 28 June, Montreal, Canada. \nRankin, W. (2000), 'A survey of course Web sites and online syllabi', Educational Technology, \n40 (2), 38-42. \nRobson, R. (1999), 'Course support systems: the first generation', International Journal of \nEducational Telecommunications, 5 (4), 131-42. \nSalomon, G. (2000), 'It's not just the tool, but the educational rationale that counts', ED- \nMEDIA 2000 World Conference on Educational Multimedia, Hypermedia and \nTelecommunications, 28 June, Montreal, Canada. \nTielemans, G., and Collis, B. (1999), 'Strategic requirements for a system to generate and \nsupport WWW-based environments for a faculty', in B. Collis and R. Oliver (eds.), \nProceedings of ED-MEDIA 1999: World Conference on Educational Multimedia, Hypermedia \nand Telecommunications, Vol. 1,346-51, Charlottesville, VA: AACE. \nVan der Veen, J., De Boer, W., and Collis, B. (2000), 'Didactics for Web learning environments: \nactive learning', Technical Report, TeleTOP Alpha-Beta Project, DINKEL Institute, University \nof Twente. \n25 \n"}