{"doi":"10.1016\/j.jastp.2009.08.007","coreId":"69135","oai":"oai:eprints.lancs.ac.uk:28202","identifiers":["oai:eprints.lancs.ac.uk:28202","10.1016\/j.jastp.2009.08.007"],"title":"First incoherent scatter radar observations of ionospheric heating on the second electron gyro-harmonic.","authors":["Kosch, M.J.","Gustavsson, B.","Heinselman, C.","Pedersen, T.","Rietveld, M.T.","Spaleta, J.","Wong, A.","Wang, W.","Mutsio, C.","Bristow, B.","Hughes, J."],"enrichments":{"references":[{"id":939478,"title":"Heater-induced altitude descent of the EISCAT UHF ion-line overshoot: Observations and modeling.","authors":[],"date":"2006","doi":null,"raw":"Ashraﬁ, M., Kosch, M.J., Honary, F., 2006. Heater-induced altitude descent of the EISCAT UHF ion-line overshoot: Observations and modeling. Adv. Space Res. 38, 2645–2652.","cites":null},{"id":939748,"title":"Spatio-temporal evolution of HFinduced artiﬁcial optical emissions, radar backscatter and Stimulated Electromagnetic Emissions at EISCAT.","authors":[],"date":"2007","doi":null,"raw":"Ashraﬁ, M., Kosch, M.J., Kaila, K., Honary, F., 2007. Spatio-temporal evolution of HFinduced artiﬁcial optical emissions, radar backscatter and Stimulated Electromagnetic Emissions at EISCAT. J. Geophys. Res. 112, A05314, doi:10.1029\/ 2006JA011938.","cites":null},{"id":940006,"title":"Unambiguous evidence of HF pump-enhanced airglow at auroral latitudes.","authors":[],"date":"1999","doi":null,"raw":"Br¨ andstr¨ om, B.U.E., Leyser, T.B., Steen, A., Rietveld, M.T., Gustavsson, B., Aso, T., Ejiri, M., 1999. Unambiguous evidence of HF pump-enhanced airglow at auroral latitudes. Geophys. Res. Lett. 26, 3561–3564.","cites":null},{"id":940139,"title":"HF radio wave acceleration of ionospheric electrons: analysis of HF-induced optical enhancements.","authors":[],"date":"2008","doi":null,"raw":"Gustavsson, B., Eliasson, B., 2008. HF radio wave acceleration of ionospheric electrons: analysis of HF-induced optical enhancements. J. Geophys. Res. 113 doi:10.1029\/2007JA012913.","cites":null},{"id":940430,"title":"The electron distribution during HF pumping, a picture painted with all colours.","authors":[],"date":"2005","doi":null,"raw":"Gustavsson, B., Sergienko, T., Kosch, M.J., Rietveld, M.T., Br¨ andstr¨ om, B.U.E., Leyser, T.B., Isham, B., Gallop, P., Aso, T., Ejiri, M., Grydeland, T., Steen, A., LaHoz, C., Kaila, H., Jussila, J., Holma, H., 2005. The electron distribution during HF pumping, a picture painted with all colours. Ann. Geophys. 23, 1747–1754.","cites":null},{"id":940710,"title":"Electron gyroharmonic effects in ionization and electron acceleration during HF pumping in the ionosphere.","authors":[],"date":"2006","doi":null,"raw":"Gustavsson, B., Leyser, T.B., Kosch, M.J., Rietveld, M.T., Steen, A., Br¨ andstr¨ om, B.U.E., Aso, T., 2006. Electron gyroharmonic effects in ionization and electron acceleration during HF pumping in the ionosphere. Phys. Rev. Lett. 97, 190052.","cites":null},{"id":941017,"title":"First estimates of altitude distribution of HF-pump enhanced emissions at 6300 and 5577A: a comparison between observations and theory.","authors":[],"date":"2008","doi":null,"raw":"Gustavsson, B., Kosch, M., Wong, A., Pedersen, T., Heinselman, C., Mutiso, C., Bristow, B., Hughes, J., Nielsen, K., Wang, W., 2008. First estimates of altitude distribution of HF-pump enhanced emissions at 6300 and 5577A: a comparison between observations and theory. Ann. Geophys. 26, 3999–4012.","cites":null},{"id":941028,"title":"A model of the enhanced airglow excited by rfradiation. Radio Sci.","authors":[],"date":"1974","doi":null,"raw":"Haslett, J.C., Megill, L.R., 1974. A model of the enhanced airglow excited by rfradiation. Radio Sci. 9, 1005–1019.","cites":null},{"id":941275,"title":"High-latitude HF-induced airglow displaced equatorwards of the pump beam.","authors":[],"date":"2000","doi":null,"raw":"Kosch, M.J., Rietveld, M.T., Hagfors, T., Leyser, T.B., 2000. High-latitude HF-induced airglow displaced equatorwards of the pump beam. Geophys. Res. Lett. 27, 2817–2820.","cites":null},{"id":941541,"title":"High-latitude pump-induced optical emissions for frequencies close to the third electron gyro-harmonic.","authors":[],"date":"2002","doi":null,"raw":"Kosch, M.J., Rietveld, M.T., Kavanagh, A.J., Davis, C., Yeoman, T., Honary, F., Hagfors, T., 2002. High-latitude pump-induced optical emissions for frequencies close to the third electron gyro-harmonic. Geophys. Res. Lett. 29, 2112–2115.","cites":null},{"id":941752,"title":"Artiﬁcial optical emissions at HAARP for pump frequencies near the third and second gyroharmonic.","authors":[],"date":"2005","doi":null,"raw":"Kosch, M.J., Pedersen, T., Hughes, J., Marshall, R., Gerken, E., Senior, A., Sentman, D., McCarrick, M., Djuth, F., 2005. Artiﬁcial optical emissions at HAARP for pump frequencies near the third and second gyroharmonic. Ann. Geophys. 23, 1585– 1592.","cites":null},{"id":942050,"title":"Artiﬁcial optical emissions in the thermosphere induced by powerful radio waves: an observational review.","authors":[],"date":"2007","doi":null,"raw":"Kosch, M.J., Pedersen, T., Rietveld, M.T., Gustavsson, B., Grach, S.M., Hagfors, T., 2007a. Artiﬁcial optical emissions in the thermosphere induced by powerful radio waves: an observational review. Adv. Space Res. 40 (3), 365–376.","cites":null},{"id":942109,"title":"Coordinated optical and radar observations of ionospheric pumping for a frequency pass through the second electron gyro-harmonic at rgy loss energy loss","authors":[],"date":"2007","doi":null,"raw":null,"cites":null},{"id":942363,"title":"Temporal evolution of pump beam self-focusing at HAARP.","authors":[],"date":"2007","doi":null,"raw":"Kosch, M.J., Pedersen, T., Mishin, E., Starks, M., Gerken-Kendall, E., Sentman, D., Oyama, S., Watkins, B., 2007c. Temporal evolution of pump beam self-focusing at HAARP. J. Geophys. Res. 112, A08304, doi:10.1029\/2007JA012264.","cites":null},{"id":942640,"title":"Simultaneous measurements of high-frequency pumpenhanced airglow and ionsopheric temperatures at auroral latitudes. Adv. Polar Upper Atmos.","authors":[],"date":"2000","doi":null,"raw":"Leyser, T.B., Gustavsson, B., Br¨ andstr¨ om, B.U.E., Steen, ˚ A., Honary, F., Rietveld, M.T., Aso, T., Ejiri, M., 2000. Simultaneous measurements of high-frequency pumpenhanced airglow and ionsopheric temperatures at auroral latitudes. Adv. Polar Upper Atmos. Res. 14, 1–11.","cites":null},{"id":942792,"title":"Powerful electromagnetic waves for active environmental research in geospace.","authors":[],"date":"2009","doi":null,"raw":"Leyser, T.B., Wong, A.Y., 2009. Powerful electromagnetic waves for active environmental research in geospace. Rev. Geophys. 47, RG1001, doi:10.1029\/ 2007RG000235.","cites":null},{"id":942919,"title":"Re-examination of the O3P -4 O1D excitation rate by thermal impact.","authors":[],"date":"1991","doi":null,"raw":"Mantas, G.P., Carlson, H.C., 1991. Re-examination of the O3P -4 O1D excitation rate by thermal impact. Geophys. Res. Lett. 18, 159–162.","cites":null},{"id":943201,"title":"Unreported optical emissions generated during ionospheric heating.","authors":[],"date":"2008","doi":null,"raw":"Mutiso, C.K., Hughes, J.M., Sivjee, G.G., Pedersen, T., Gustavsson, B., Kosch, M.J., 2008. Unreported optical emissions generated during ionospheric heating.","cites":null},{"id":943456,"title":"Persistent enhancement of the HF pump-induced plasma line measured with a UHF diagnostic radar at HAARP.","authors":[],"date":"2006","doi":null,"raw":"Oyama, S.-I., Watkins, B., Djuth, F.T., Kosch, M.J., Bernhardt, P., Heinselman, C.J., 2006. Persistent enhancement of the HF pump-induced plasma line measured with a UHF diagnostic radar at HAARP. J. Geophys. Res.11, A06309, doi:10.1029\/ 2005JA011363.","cites":null},{"id":943740,"title":"New electron energy transfer rates for vibrational excitation of N2.","authors":[],"date":"1998","doi":null,"raw":"Pavlov, A.V., 1998a. New electron energy transfer rates for vibrational excitation of N2. Ann. Geophys. 16, 176–182.","cites":null},{"id":943993,"title":"New electron energy transfer and cooling rates by excitation of O2.","authors":[],"date":null,"doi":null,"raw":"Pavlov, A.V.,1998b. New electron energy transfer and cooling rates by excitation of O2. Ann. Geophys. 16, 1007–1013.","cites":null},{"id":944247,"title":"Cooling rate of thermal electrons by electron impact excitation of ﬁne structure levels of atomic oxygen.","authors":[],"date":"1999","doi":null,"raw":"Pavlov, A.V., Berrington, K.A., 1999. Cooling rate of thermal electrons by electron impact excitation of ﬁne structure levels of atomic oxygen. Ann. Geophys. 17, 919–924.","cites":null},{"id":944520,"title":"First observations of HF heater-produced airglow at the high frequency active auroral research program facility: thermal excitation and spatial structuring. Radio Sci.","authors":[],"date":"2001","doi":null,"raw":"Pedersen, T.R., Carlson, H.C., 2001. First observations of HF heater-produced airglow at the high frequency active auroral research program facility: thermal excitation and spatial structuring. Radio Sci. 36, 1013–1026. Beam: 1 A l t i t u d e ( k m ) 0530 0600 0630 ( e V m − s − ) Beam: 2 Electron energy loss 0500 0530 0600 0630 Column electron energy loss Time (UT) Beam: 3 0500 0530 0600 0630 Beam: 4 ( e V \/ s m )","cites":null},{"id":944547,"title":"Magnetic zenith enhancement of HF radio-induced airglow production at HAARP.","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":944792,"title":"Quantitative determination of HF radio-induced optical emission production efficiency at high latitudes.","authors":[],"date":"2008","doi":null,"raw":null,"cites":null},{"id":945087,"title":"Observations and theory of the formation of stable auroral red arcs.","authors":[],"date":"1975","doi":null,"raw":null,"cites":null},{"id":945225,"title":"Measurements of HF-enhanced plasma and ion lines at EISCAT with high altitude resolution.","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":945464,"title":"Ionospheric electron heating, optical emissions and striations induced by powerful HF radio waves at high latitudes: aspect angle dependence.","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":945761,"title":"Correction to ionospheric electron heating, optical emissions, and striations induced by powerful HF radio waves at high latitudes: aspect angle dependence.","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":945991,"title":"First EISCAT observations of the modification of F-region electron temperatures during RF heating at harmonics of the electron gyro frequency.","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":946055,"title":"The heating of the high latitude ionosphere by high power radio waves.","authors":[],"date":"1989","doi":"10.1016\/0370-1573(89)90005-7","raw":null,"cites":null},{"id":946288,"title":"Ionospheres: Physics, Plasma Physics, and Chemistry.","authors":[],"date":"2004","doi":"10.1088\/0741-3335\/43\/2\/701","raw":null,"cites":null},{"id":946560,"title":"Analysis of excitation of the 630.0 nm airglow during a heating experiment in","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":946779,"title":"Electron energy transfer rates in the ionosphere.","authors":[],"date":"1972","doi":"10.1016\/0032-0633(72)90001-3","raw":null,"cites":null},{"id":16681109,"title":"Coordinated optical and radar observations of ionospheric pumping for a frequency pass through the second electron gyro-harmonic at HAARP.","authors":[],"date":"2007","doi":null,"raw":"Kosch, M.J., Pedersen, T., Mishin, E., Oyama, S., Hughes, J., Senior, A., Watkins, B., Bristow, B., 2007b. Coordinated optical and radar observations of ionospheric pumping for a frequency pass through the second electron gyro-harmonic at HAARP. J. Geophys. Res. 112, A06325, doi:10.1029\/2006JA012146.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-12","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69135.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/28202\/1\/art_972.pdf","pdfHashValue":"5a7b34cdde160c982953ed4e5c3e5e71b3914c89","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:28202<\/identifier><datestamp>\n      2018-01-24T02:52:50Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        First incoherent scatter radar observations of ionospheric heating on the second electron gyro-harmonic.<\/dc:title><dc:creator>\n        Kosch, M.J.<\/dc:creator><dc:creator>\n        Gustavsson, B.<\/dc:creator><dc:creator>\n        Heinselman, C.<\/dc:creator><dc:creator>\n        Pedersen, T.<\/dc:creator><dc:creator>\n        Rietveld, M.T.<\/dc:creator><dc:creator>\n        Spaleta, J.<\/dc:creator><dc:creator>\n        Wong, A.<\/dc:creator><dc:creator>\n        Wang, W.<\/dc:creator><dc:creator>\n        Mutsio, C.<\/dc:creator><dc:creator>\n        Bristow, B.<\/dc:creator><dc:creator>\n        Hughes, J.<\/dc:creator><dc:date>\n        2009-12<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/28202\/1\/art_972.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/j.jastp.2009.08.007<\/dc:relation><dc:identifier>\n        Kosch, M.J. and Gustavsson, B. and Heinselman, C. and Pedersen, T. and Rietveld, M.T. and Spaleta, J. and Wong, A. and Wang, W. and Mutsio, C. and Bristow, B. and Hughes, J. (2009) First incoherent scatter radar observations of ionospheric heating on the second electron gyro-harmonic. Journal of Atmospheric and Solar-Terrestrial Physics, 71 (17-18). pp. 1959-1966. ISSN 1364-6826<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/28202\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1016\/j.jastp.2009.08.007","http:\/\/eprints.lancs.ac.uk\/28202\/"],"year":2009,"topics":[],"subject":["Journal Article","PeerReviewed"],"fullText":"ARTICLE IN PRESS\nJournal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1959–1966Contents lists available at ScienceDirectJournal of Atmospheric and Solar-Terrestrial Physics1364-68\ndoi:10.1\n\u0002 Corr\nE-mjournal homepage: www.elsevier.com\/locate\/jastpFirst incoherent scatter radar observations of ionospheric heating\non the second electron gyro-harmonicM.J. Kosch a,\u0002, B. Gustavsson b, C. Heinselman c, T. Pedersen d, M.T. Rietveld e, J. Spaleta f,\nA. Wong g, W. Wang g, C. Mutiso h, B. Bristow f, J. Hughes h\na Communication Systems, Lancaster University, Lancaster LA1 4WA, UK\nb Department of Physics and Technology, University of Tromsø, N-9037 Tromsø, Norway\nc Stanford Research Institute International, Menlo Park, CA 94025, USA\nd Space Vehicles Directorate, Air Force Research Laboratory, Hanscom AFB, MA 01731, USA\ne EISCAT Scientific Association, Ramfjordmoen, Ramfjordbotn N-9027, Norway\nf Geophysical Institute, University of Alaska, Fairbanks, AK 99775, USA\ng HIPAS Observatory, Two Rivers, AK 99716, USA\nh Physical Science Dept., Embry-Riddle Aeronautical University, FL 32114, USAa r t i c l e i n f o\nArticle history:\nReceived 20 March 2009\nReceived in revised form\n29 July 2009\nAccepted 22 August 2009\nAvailable online 2 September 2009\nKeywords:\nAuroral ionosphere\nActive experiments26\/$ - see front matter & 2009 Elsevier Ltd. A\n016\/j.jastp.2009.08.007\nesponding author.\nail address: m.kosch@lancaster.ac.uk (M.J. Kosa b s t r a c t\nWe report first results from a unique experiment performed at the HIPAS ionospheric modification\nfacility in conjunction with the Poker Flat incoherent scatter radar in Alaska. High-power radio waves at\n2.85MHz, which corresponds to the second electron gyro-harmonic at \u0002245km altitude, were\ntransmitted into the nighttime ionosphere. Clear evidence of F-region ionospheric electron temperature\nenhancements were found, for the first time at this pump frequency, maximizing when the pump\nfrequency is close to the second gyro-harmonic and double resonance. This is consistent with previous\npump-enhanced artificial optical observations. We estimate the plasma heating efficiency to be\napproximately double that for higher pump frequencies.\n& 2009 Elsevier Ltd. All rights reserved.1. Introduction\nIonospheric modification resulting from high frequency (HF)\nhigh-power radio waves has found many applications in plasma\nphysics (Leyser and Wong, 2009). Artificial optical emissions\nresulting from pump waves with O-mode polarization, are now\nroutinely observed in the F-region at high latitudes since the\noriginal discovery in 1999 (Bra¨ndstro¨m et al., 1999). The pump\nwaves interact with the ionospheric plasma, causing instabilities,\nwhich accelerate electrons up to 60 eV or more (Gustavsson et al.,\n2005). These electrons collide with the atmospheric O atoms and\nN2 molecules to produce aurora in the same way natural electron\nimpact from precipitation does. Most of the important artificially\nstimulated auroral optical emissions have now been observed\n(Gustavsson and Eliasson, 2008) with the brightest optical\nemissions at O1D 630nm and O1S 557.7nm. A review of HF\npump-induced artificial optical phenomena is presented by Kosch\net al. (2007a). In addition, the plasma is heated with electron\ntemperatures up to 3500K (Leyser et al., 2000), which can result\nin ion upwelling, and ion temperatures up to a few hundred Kll rights reserved.\nch).(Rietveld et al., 2003, 2004). However, plasma temperature\nenhancements are suppressed when pumping on a gyro-harmonic\nfrequency (Robinson et al., 1996; Gustavsson et al., 2006) higher\nthan the second electron gyro-harmonic. To date, the plasma\ntemperature for pump frequencies near the second gyro-harmonic\nhave not been reported, which is the objective of this manuscript.\nBoth the pump-induced optical emissions (Kosch et al., 2000;\nPedersen and Carlson, 2001) and electron temperature enhance-\nments (Rietveld et al., 2003, 2004) maximize sharply parallel to\nthe local magnetic field line direction. Pedersen et al. (2003)\nfound the full-width-at-half-maximum of the optical emissions to\nbe 71. Rietveld et al. (2003, 2004) found the electron temperature\nenhancement could drop from 3200 to 1800K for 61 off the\nmagnetic zenith despite having the same pump power. The so-\ncalled magnetic zenith effect can boost the optical emission\nintensity by up to an order of magnitude and is the result of pump\nbeam self-focusing (Kosch et al., 2007c).\nThe EISCAT and HAARP ionospheric modification facilities,\nlocated in Norway and Alaska, respectively, are capable of\nstimulating a wide range of plasma instabilities, including\nparametric decay instabilities, upper-hybrid resonance and the\nthermal parametric instability. Kosch et al. (2002) showed that\nartificial optical emissions are closely associated with the upper-\nhybrid resonance (UHR), which is stimulated typically a few\nARTICLE IN PRESS\nM.J. Kosch et al. \/ Journal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1959–19661960kilometers below the HF reflection altitude (fo= fp) according to\nf0\n2= fUHR\n2= fp\n2= fGH\n2, where fo is the pump frequency, fp the local\nplasma frequency, and fGH the electron gyro-frequency. fGH is a\nfunction of magnetic field strength and therefore altitude in the\nionosphere. Upper-hybrid resonance has a symbiotic relationship\nwith meter-scale magnetic field-aligned plasma density irregula-\nrities, called striations, which are observed as enhanced back-\nscatter by the SuperDARN radars (Kosch et al., 2002; and\nreferences therein). The artificial optical emissions and striations\nare both suppressed when pumping on a gyro-harmonic\nfrequency (Kosch et al., 2002; Gustavsson et al., 2006) higher\nthan the second electron gyro-harmonic. However, Kosch et al.\n(2007b) found no minimum in SuperDARN radar backscatter for\npumping on the second gyro-harmonic. In addition, Kosch et al.\n(2005) found an optical maximum for pump frequencies just\nabove second electron gyro-harmonic (about 7kHz), i.e. the\nopposite compared to higher gyro-harmonics.\nHaslett and Megill (1974) first reported unusually large optical\nenhancements when pumping the ionosphere at twice the\nelectron gyro-frequency. The pump-induced optical emissions\non the second gyro-harmonic have similar intensities compared to\nhigher pump frequencies, which used an order of magnitude more\nHF power (Kosch et al., 2007a). Pedersen et al. (2008) showed that\nfor modest effective radiated power (ERP) less than 40 MW, the\ninduced optical intensity was linearly related to ERP. In addition,\nthey show data from a HAARP experiment (their Fig. 1) of optical\nenhancements from ionospheric pumping at 3.3 and 2.84MHz\nwith 42.4 and 32.1MW ERP, respectively, within the same half\nhour period. Although not directly addressed by the authors, it is\neasily shown that 630nm optical emission intensity at 2.84MHz,\ni.e. on the second gyro-harmonic, is approximately double that at\n3.3MHz, i.e. away from the second gyro-harmonic, including\nlinear compensation for the change in ERP. This result has been\nsubsequently confirmed at HAARP using 2.85 and 3.15MHz pump\nfrequencies (Pedersen, unpublished manuscript).\nFor O-mode pumping near the second electron gyro-harmonic\nfrequency, Kosch et al. (2007b) have determined which groupings\nof mechanisms are acting. For pump frequencies below the second\ngyro-harmonic in an over-dense ionosphere, two parametric\ndecay instabilities are active. First, the pump wave can decay\ninto an ion-acoustic and electron Langmuir waves. These can be\ndetected as strong enhancements in the ion- and plasma-lines of\nincoherent scatter radars (Rietveld et al., 2000). Unfortunately,\nsuch enhancements also prevent plasma temperature analysis of\nthe radar spectra. Second, the pump wave can decay into an\nelectron-Bernstein and lower-hybrid waves. The latter can be\ndetected by SuperDARN radars as lower-hybrid caviton collapse.\nFor pump frequencies above the second electron gyro-harmonic in\nan over-dense ionosphere, two parametric decay instabilities and\nthe thermal parametric instability are active. First, the pump wave\ncan decay into an ion-acoustic and electron Langmuir waves, as\nbefore. Second, the pump wave can decay into an upper-hybrid\nand lower-hybrid waves. The former can be detected by Super-\nDARN radars as striations. Third, the thermal parametric instabil-\nity results in upper-hybrid waves and striations, which can be\ndetected by SuperDARN radars, as before. Finally, for pump\nfrequencies above the second gyro-harmonic in an under-dense\nionosphere where for foF2+0.5MHz (Pedersen et al., 2003), one\nparametric decay instability and the thermal parametric instabil-\nity are active. First, the pump wave can decay into an upper-\nhybrid and lower-hybrid waves, as before. Second, the thermal\nparametric instability results in upper-hybrid waves and stria-\ntions, also as before. Both mechanisms can be detected by\nSuperDARN radars as striations. Once upper-hybrid resonance is\nno longer possible in the under-dense ionosphere all optical\nemissions cease.To measure the plasma temperature resulting from HF\npumping of the ionosphere, an incoherent scatter radar is\nnecessary. Currently, the only available experimental combination\nfor the second electron gyro-harmonic frequency is the HIPAS\nionospheric modification facility, operating on 2.85MHz, and the\nnewly inaugurated Poker Flat Advanced Modular Incoherent\nScatter Radar (AMISR), called PFISR, both located in Alaska. The\nEISCAT facility does have two co-located incoherent scatter radars,\nbut the minimum pump frequency only reaches down to the third\nelectron gyro-harmonic (\u00024MHz). For a few years (1980–1985),\nEISCAT did have second gyro-harmonic pumping capability\n(2.75MHz), but a thorough survey of the archive data shows that\nno suitable experiment was ever performed. Unfortunately, the\nHAARP ionospheric modification facility does not have an\nincoherent scatter radar available. Here we report the first\nelectron temperature observations resulting from ionospheric\npumping on the second electron gyro-harmonic.2. Results and discussion\nOn 19 March 2007 the HIPAS facility in Alaska (64.871N,\n146.841W) was operated in a 6-min cycle of 3 phases: 2min on\npulsing, 2min continuous wave, and 2min off. Operations started\nat 04:24UT and ended at 06:58UT. The HF pump beam was\npointed parallel to the magnetic field line direction (771 elevation,\n2041 azimuth) with O-mode polarization for continuous wave\npumping, transmitting at 2.85MHz with \u000232MW ERP in the\ncentre of the beam, and a full beam width of 23.31. 2.85MHz\ncorresponds to the second electron gyro-harmonic at \u0002245km\naltitude over HIPAS. Pointing the beam into the magnetic zenith is\ndone specifically because it greatly enhances the optical emissions\n(Kosch et al., 2000; Pedersen and Carlson, 2001) and electron\ntemperature enhancements (Rietveld et al., 2003, 2004). During\nthe pulsing phase, the beam pointing was 771 elevation and 2461\nazimuth. From 04:24 to 06:08UT pulsing consisted of 50ms on\nevery 4 s, and from 06:12 to 06:58UT pulsing consisted of 50ms\non every second. The pulse modes did not produce any detectable\neffects for our purpose. Here we focus on the continuous wave\ntransmissions only.\nThe College ionosonde (64.91N, 148.01W) is used to character-\nize the ionosphere. A frequency sweep, starting at 0.2MHz, was\ndone every 2min. Although College is \u000255km west of HIPAS, the\nfields of view overlap in the F-layer. Geomagnetic activity was\nvery low on 19\/03\/2007 with Kpo =1\u0003 in the 12h up to and\nincluding the experiment. Fig. 1 shows HF reflection (solid curve),\nupper-hybrid resonance (dashed curve), and second electron the\ngyro-harmonic (dot-dashed curve) altitudes, all for 2.85MHz. The\nionosphere is over-dense until \u000205:40UT, thereafter under-\ndense. Double resonance, i.e. where the upper-hybrid frequency\nalso equals the gyro-harmonic frequency, occurs for the interval\n\u000205:58–06:06UT. Upper-hybrid resonance stops at \u000206:08UT.\nFig. 1 shows that HF reflection and upper-hybrid resonance both\ncease shortly after intersecting with the second gyro-harmonic\naltitude. Hence, for almost the entire experiment, the HIPAS pump\nfrequency corresponded to pumping below the second gyro-\nharmonic. Unfortunately, the mechanisms acting in this frequency\nregime produce low intensity optical emissions compared to\nabove the second gyro-harmonic (Kosch et al., 2007b, c).\nThe first useful optical recordings started at \u000205:20UT due\nto sunset, using 630nm (8 s exposures every 10 s) and 557.7nm\n(7 s exposure every 10 s). The sky was completely clear of clouds.\nFig. 2 shows un-calibrated background-subtracted images of the\npump-induced artificial optical emissions at 630nm taken from\nHIPAS at the end of each continuous wave pump cycle. The\nintensity and size of the optical emission region remains fairly\nARTICLE IN PRESS\nTime (UT)\nA\nlti\ntu\nde\n (k\nm\n)\n04:00 04:12 04:24 04:36 04:48 05:00 05:12 05:24 05:36 05:48 06:00 06:12 06:24\n100\n150\n200\n250\n300\n350\n400\nfp=2.85 MHz\nfUH=2.85 MHz\n2fe=2.85 MHz\nHF−CW\nHF−pulsed\nFig. 1. HF reflection (solid curve), upper-hybrid resonance (dashed curve), and second electron gyro-harmonic (dot-dashed curve) altitudes, taken from the College\nionosonde for 2.85MHz. HIPAS was operated in pulsed (grey panels) and continuous wave (black panels) modes with other periods having no transmissions.\nFig. 2. Un-calibrated background-subtracted images of the pump-induced artificial optical emissions at 630nm taken from HIPAS at the end of each continuous wave pump\npulse. The field of view is \u0002451. North and west are to the top and right of the images, respectively. The ‘‘halo’’ apparent in the earlier images is an artifact of background\nsubtraction caused by declining twilight.\nM.J. Kosch et al. \/ Journal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1959–1966 1961constant throughout the experiment, fading towards the end as\nthe pump frequency exceeds the ionospheric critical frequency. A\ndetailed description of the optical results from this experiment\ncan be found in Gustavsson et al. (2008). In addition, Mutiso et al.\n(2008) reported the first observation of the O+ 732nm optical\nemission from this campaign. Here we focus on the radar results.\nThe Poker Flat Incoherent Scatter Radar (PFISR, 65.131N,\n147.471W) observed the ionosphere with four beams, beam 1\npointing into the local magnetic zenith, and beams 2, 3 and 4\nintersecting near the local zenith over HIPAS at approximately\n300, 240 and 200km, respectively. The experimental geometry is\nshown in Fig. 3. From the pre-programmed beams available,\nbeams 2, 3 and 4 corresponding to azimuth angles of 145.341,\n135.131, 129.241, and elevation angles of 82.121, 79.581, 76.821,\nrespectively, were closest to the desired positions. The radar wasswept through all four beams, alternating long pulse with 35km\nrange resolution and alternating code with 4.5 km range\nresolution, and a total integration time of 6.144 s. The PFISR is\nlocated 29.3 km east and 28.7 km north of HIPAS, and the antenna\nface is tilted northward. Hence, unfortunately, it is impossible for\nPFISR to intersect with the magnetic field line passing through\nHIPAS. This is a significant geometric limitation of the experiment\nas the PFISR beams can only intersect the HIPAS beam near its\n\u00031dB power contour for the chosen altitudes when HIPAS is\npointed into its local magnetic zenith, as was the case on 19\/03\/\n2007. The geometry corresponds to PFISR pointing \u000271 away from\nHIPAS’s magnetic zenith, i.e. on the edge of the region of\nmaximum optical intensity and electron temperature\nenhancement. The geometry effectively precludes PFISR\nobservations of any advantage from the self-focusing effect\nARTICLE IN PRESS\nM.J. Kosch et al. \/ Journal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1959–19661962within the HF pump beam (Kosch et al., 2007c), which is\nassociated with a significant gain in pump power density. If\nanything, PFISR is pointing into a region of diminishing pump\npower as self-focusing progresses. PFISR construction was not\ncompleted at the time of the campaign, and the alternating code\ndata were very noisy, so we focus on the long-pulse data only.\nFig. 4 shows the PFISR ion-line long-pulse data, post-integrated\nto 30.72 s, for each of the four beams used. The pump-on periods\nwhich show enhanced plasma density, especially apparent in the\nPFISR field-aligned beam 1 around 200–250 km prior to 05:30UT,\ncorrespond to the ion-line enhancement phenomenon. These are\nobserved at EISCAT (Ashrafi et al., 2006, 2007) and HAARP (Kosch\net al., 2007b; Oyama et al., 2007) and are associated with pump-\ninduced Langmuir turbulence, not real plasma density−100 −50 0 50\n−150\n−100\n−50\n0\n50\nBeam 4\nBeam 3\nEast of HIPAS (km)\nBeam 2\nBeam 1\nN\nor\nth\n o\nf H\nIP\nA\nS\n (k\nm\n)\nFig. 3. A sketch of the experimental geometry. All distances are relative to the\nHIPAS site (green circle). PFISR is located at the red square. The direction of the 4\nradar beams are shown as red lines, with black markers at 210, 240 and 274km.\nThe blue ovals denote the HIPAS beam \u00033dB contour for 210 km (solid), 240km\n(dashed) and 274km (dash-dotted) altitude. The blue cross shows the magnetic\nfield line position for 210km altitude.(For interpretation of the references to color\nin this figure legend, the reader is referred to the web version of this article.)\n100\n200\n300\n400\n500\nA\nlti\ntu\nde\n (k\nm\n) Beam: 1\n0500 0530 0600 0630\n100\n200\n300\n400\n500\nA\nlti\ntu\nde\n (k\nm\n)\nTime (UT)\n05\nBeam: 2\nlog10 Electron de\n0500 0530 0600 0630\nTime (UT)\nElectron tempe\nFig. 4. Poker Flat Incoherent Scatter Radar observations of electron density (upper p\ndirections from long-pulse data, post-integrated to 30.72 s. HIPAS was operated in pu\nhaving no transmissions.enhancements. Data prior to 05UT are not shown because it is\ncontaminated by the pump-induced ion-line enhancement. From\n\u000205:30UT onwards, the ion-line overshoot increases in altitude,\ndisappearing after 05:41UT. This consistent with the ionosonde\ndata (see Fig. 1), which shows a similar increase in altitude of the\nHF reflection altitude, with reflection ceasing around 05:40UT. It\nis the pump-driven parametric decay instability near the HF\nreflection altitude, where the pump wave decays into an electron\nLangmuir wave and an ion-acoustic wave, which manifests itself\nas the ion-line enhancement (Kosch et al., 2007b). This is expected\nto cease when HF reflection ceases, as shown in Figs. 1 and 4.\nFig. 4 also shows some electron temperature enhancements,\nalthough the plot cannot be taken completely at face value\nbecause the PFISR spectra affected by the ion-line enhancement\nmay not be correctly analysed. However, there are altitudes and\ntimes without the ion-line enhancement where modest electron\ntemperature enhancements are apparent. Electron temperature\nenhancements seen after 05:48UT in beam 1, 05:36UT in beams 2\nand 3, and 05:30UT in beam 4 are not contaminated and may be\ntaken at their face value. No ion temperature enhancements were\nfound (not shown). The relatively modest effective radiated power\nof the HIPAS facility coupled to the relatively short pump periods\n(2min) mitigate against ion temperature enhancements. Such\nobservations at EISCAT are associated with high effective radiated\npowers (\u0002200MW) and pump periods up to 8min (Rietveld et al.,\n2003, 2004).\nFig. 5 shows the calibrated intensity at 630nm of the pump-\ninduced artificial optical emissions above twilight background.\nThe continuous wave pump-on periods clearly show O1D\nenhancements up to 100 Rayleighs above background. This is\nconsistent with the 4R\/MW calibration (4*32=128R) found by\nPedersen et al. (2008). The optical background is variable due to\nfaint natural airglow. The optical enhancements remain strong up\nto \u000206UT whilst upper-hybrid resonance remains possible (see\nFigs. 1 and 2). Once upper-hybrid resonance ceases, the optical\nenhancements decline but are still evident up to 06:22UT,\nsustained by patches of ionosphere with enhanced plasma\ndensity.\nFig. 5 also shows the electron temperature taken from the\nthree PFISR beams intersecting the HIPAS pump beam at three\ndifferent altitudes, post-integrated to 30.72 s. The data gaps are\nfrom HF-contaminated ion-line enhanced spectra that could not\nbe analysed, which have been removed. Electron temperature\nenhancements up to \u0002500K above background are evident,Beam: 3\n00 0530 0600 0630\nTime (UT)\nBeam: 4 log\n10  n\ne  (m\n−3)108\n1010\n1012\n0500 0530 0600 0630\nTime (UT)\nT\ne  (K\n)\n500\n1000\n1500\n2000\n2500\n3000\nnsity (m−3)\nrature (K)\nanels) and electron temperature (lower panels) with altitude in 4 different look\nlsed (grey panels) and continuous wave (black panels) modes with other periods\nARTICLE IN PRESS\n04:00 04:12 04:24 04:36 04:48 05:00 05:12 05:24 05:36 05:48 06:00 06:12 06:24\n1000\n1500\n2000\nTime (UT)\nE\nle\nct\nro\nn \nte\nm\npe\nra\ntu\nre\n (K\n)\nh=204 km\nh=240 km\nh=274 km\n04:00 04:12 04:24 04:36 04:48 05:00 05:12 05:24 05:36 05:48 06:00 06:12 06:24\n0\n50\n100\n150\nIn\nte\nns\nity\n (R\nay\nle\nig\nh)\nI(6300)\nHF−CW\nHF−pulsed\nFig. 5. Calibrated background-subtracted intensity of the pump-induced artificial optical emissions at 630nm (upper panel). Electron temperature taken from the 3 long-\npulse PFISR beams intersecting the HIPAS pump beam at 3 different altitudes, post-integrated to 30.72 s (lower panel). HIPAS was operated in pulsed (grey panels) and\ncontinuous wave (black panels) modes with other periods having no transmissions.\nM.J. Kosch et al. \/ Journal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1959–1966 1963starting right from the first HIPAS continuous wave pulse at\n04:26UT. Just as is the case for the optical emissions, electron\ntemperature enhancements continue up to 06:22UT, hence there\nis a clear association with the optical emissions as well as upper-\nhybrid resonance. This is consistent with the findings at EISCAT\nfor higher pump frequencies (Kosch et al., 2002; Gustavsson et al.,\n2006). It is also noted that the maximum electron temperature\nenhancement occurs for the HIPAS continuous wave pulses at\n06:02 and 06:08UT when the ionosonde data (see Fig. 1) shows\nthat double resonance is active. This is consistent with the optical\nintensity maximum observed at HAARP (Kosch et al., 2005,\n2007b), although it is not obvious in the HIPAS optical data. In\naddition, there is another maximum for the pulse at 05:32UT,\ncorresponding to the time when the pump frequency was close to\nthe ionospheric critical frequency. In this situation, the plasma\ndensity vertical gradient is small, thereby giving a long interaction\npath for the pump wave. Hence, it is expected that coupling\nbetween the pump wave and the plasma would maximize.\nThe electron temperature enhancements are relatively modest\ncompared those observed at EISCAT, which can be up to 3500K\n(Leyser et al., 2000; Rietveld et al., 2003, 2004). However, given\nthat the PFISR beams do not intersect the HIPAS magnetic field\nline, i.e. not at the point of maximum power in the centre of the\npump beam, as described above, it is probable that the peak\nelectron temperature in the centre of the HIPAS pump beam is up\nto \u0002900K, based on EISCAT beam-swinging experiments (Riet-\nveld et al., 2003, 2004). Simple geometric considerations (see\nFig. 3) and modeling of the HIPAS beam show that the PFISR beams\nwere probing plasma illuminated by \u000225MW effective radiated\npower, excluding any reduction due to pump beam self-focusing,\nwhich is approximately an order of magnitude less than that\ntypically used at EISCAT for similar experiments. HIPAS achieved\n500\/25=20K\/MW at 2.85MHz, possibly more if pump beam self-\nfocusing is taken into account, whereas EISCAT achieved 1400\/\n200=7K\/MW at 4.544MHz for a similar geometry, i.e. 61 away\nfrom the magnetic field line direction. Unfortunately, the pump\npower effect on electron temperature enhancements has never\nbeen quantified for nighttime experiments. Assuming linearity,\nand adjusting for the difference in plasma density associated withthe pump frequency at HIPAS (2.85MHz) and EISCAT (4.544MHz),\nthe difference in ERP at HIPAS (25MW) and EISCAT (200MW), and\nthe approximate height difference between the HIPAS (220km)\nand EISCAT (280km) experiments, the observed electron tem-\nperature difference between HIPAS (500K) and EISCAT (1400K)\nindicates that the plasma heating efficiency on the second\ngyro-harmonic is approximately double that for a higher\npump frequency ðð2:852=4:5442Þ \u0004 ð500=1400Þ \u0004 ð2802=2202Þ \u0004\nð200=25Þ ¼ 1:82Þ for the same pump beam geometry relative to\nthe magnetic field line, which is consistent with the fact that the\noptical intensity produced on the second gyro-harmonic is greater\nthan for higher pump frequencies of the same HF power (Pedersen\net al., 2008). However, the experiment described here was almost\nentirely for pumping below the second gyro-harmonic (see Fig. 1).\nHAARP experiments show that the optical emissions can more\nthan double for pumping above the second gyro-harmonic (Kosch\net al., 2005, 2007b, c). Hence, it is expected that the electron\ntemperature enhancement might be even greater, possibly by\nanother factor of two, than those reported here for this frequency\nregime.\nThe Kodiak SuperDARN radar was operated in a special mode\n03–06UT, thereafter performing a standard scan of 16 beams\nevery 2min at one frequency. In the special mode, the radar was\nswept through frequencies close to 8, 9, 10, 11 and 12MHz, and\ncycling through beams 1–3 only, with 1 s integration and 15km\nrange resolution, making a 15 s cycle. Frequency selection in each\nband was automatically adjusted to achieve minimum inter-\nference. Fig. 6 shows SuperDARN Kodiak radar backscatter power\naveraged over beams 1–3 and frequencies 9.8–10.2MHz for the\nrange gate over HIPAS. Backscatter enhancements of 10–15dB\noccur during the continuous wave phase of each HIPAS cycle. The\nbackscatter enhancement prior to 04:24UT is due to HIPAS\ntransmitter tune-up. It is clear that the backscatter does not go\ncompletely back to the initial background state, as seen prior to\n04:10UT, when the pump is turned off. This may be due to the\nrelatively short pump-off period (2min) and ionospheric\npreconditioning during the pump-on phases (4min) and is\nconsistent with HAARP observations (Kosch et al., 2005, 2007b).\nThe Doppler shift (not shown) is less than 750m\/s but not\nARTICLE IN PRESS\nFig. 6. SuperDARN Kodiak radar backscatter power averaged over beams 1–3 and frequencies 9.8–10.2MHz for the range gate over HIPAS (gate 50 at 930 km range). Special\nmode radar operations ceased at 06 UT before the experiment ended.\nM.J. Kosch et al. \/ Journal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1959–19661964persistently equal to zero and therefore the backscatter is not due\nto ground scatter. The spectral width parameter (not shown) is\nless than 25m\/s, which indicates a relatively hard target\nconsistent with ionospheric modification experiments. These are\nthe first observations of HIPAS-induced SuperDARN radar\nbackscatter modulation. These observations correspond to the\nparametric decay instabilities of Langmuir and electron-Bernstein\nwaves being active, i.e. not upper-hybrid resonance, because most\nof the experiment occurred for pump frequencies below the\nsecond gyro-harmonic. Therefore, the Kodiak radar HIPAS-induced\nbackscatter comes from lower-hybrid wave caviton collapse and\nnot field-aligned striations, as described by Kosch et al. (2007b).\nThe observed electron temperature profiles give direct esti-\nmates of the pump-induced electron heating after integrating the\none-dimensional energy equation:\n3\n2\nnekB\n@Teðz; tÞ\n@t\n¼ @\n@z\nKeðTeÞ @Teðz; tÞ\n@z\n\u0002 \u0003\nþQHF ðz; tÞ \u0003 Qoðz; tÞ \u0003 LeðTeÞ\nwhere ne and Te are the electron density and temperature,\nrespectively, kB Boltzmann’s constant, Ke heat flux, QHF pump\nenergy input, Qo the heat input from other sources, Le the electron\nenergy loss function, t time, and z altitude. The electron cooling is\ncalculated with electron temperature observations from the last\n90 s of the pump-on and pump-off periods, during which we\nconsider Te to be at steady state. Taking the difference leads to:Z z1\nzo\nQHF ¼\nZ z1\nzo\nLeðTHFe Þ \u0003 LeðTOFFe Þdz\nþ KeðTOFFe Þ\n@TOFFe\n@z\n\u0004\u0004\u0004\u0004\n\u0004\u0004\u0004\u0004\nz1\nzo\n\u0003 KeðTHFe Þ\n@THFe\n@z\n\u0004\u0004\u0004\u0004\n\u0004\u0004\u0004\u0004\nz1\nzo\nWe integrate the electron energy loss function (Le) from 150 to\n375km. The heat flux (Ke(Te)(qTe\/qz)) is small through the lower\nboundary, for both pump-on and pump-off conditions. Unfortu-\nnately, we cannot take into account the energy lost by heat\nflowing up to altitudes higher than 375km because the PFISR data\nhave low signal-to-noise ratio at high altitudes. However, this\nshould be a relatively minor correction when considering that the\nelectron temperature modulation at altitudes above 350 km is\nsignificantly reduced compared to 250km (not shown). The\nprocesses taken into account for electron cooling are elasticcollisions with ions and the major neutral species (e.g. Schunk and\nNagy, 2004) with cooling rates from Rees and Roble (1975) and\nStubbe and Varnum (1972), rotational and vibrational excitation\nof N2 and O2 with cooling rates from Pavlov (1998a, b), cooling\ndue to excitation of the fine structure levels of O (Pavlov and\nBerrington, 1999), and excitation of O1D with cooling rates\ncalculated from the excitation rate of Mantas and Carlson\n(1991). By integrating the electron energy losses we get an\nestimate of the energy transferred from the pump wave to the\nionospheric electrons.\nThe total pump-induced electron heating with altitude is\nshown in Fig. 7 upper panel, and integrated in altitude from 150 to\n375km is shown in Fig. 7 lower panel, for all four PFISR beams.\nThere is significant modulation due to HF pumping, ranging from\n6\u00041012 to 6\u00041013 eV\/m2\/s. The data are also adversely affected\nby the ion-line enhancement phenomenon, especially in the\nearlier part of the experiment. The electron temperature is\nmeasured by PFISR near the \u00031dB contour of the HF pump\nbeam. Taking this into account as well as the lower power density\nof HIPAS, the energy-transfer efficiency is comparable to that\nwhich Sergienko et al. (2000) used to model the electron\ntemperature above EISCAT, and that which Robinson (1989)\nestimated was deposited to explain anomalous absorption\nobservations.\nBy measuring the electron temperature profile at different cuts\nthrough the HF beam it is in principle possible to estimate the\nvariation of the energy-transfer efficiency as a function of effective\nradiated power and angle relative to magnetic zenith. However,\nthe PFISR beams cut the HIPAS beam at approximately similar\ncontours of the antenna pattern and angles relative to the\nmagnetic field, making it difficult to draw any conclusions about\ngeometric variations in heating efficiency. Such work requires co-\nlocated ionospheric modification and incoherent scatter radar\nfacilities.3. Conclusion\nThe discovery at HAARP that bright pump-induced artificial\noptical emissions, which are due to accelerated electrons, occur\nARTICLE IN PRESS\nBeam: 1\nA\nlti\ntu\nde\n (k\nm\n)\n100\n200\n300\n0500\n400\n0530 0600 0630\n1013\n1014\n(e\nV\nm\n−2\ns−\n1 )\nBeam: 2\nElectron energy loss\n0500 0530 0600 0630\nColumn electron energy loss\nTime (UT)\nBeam: 3\n0500 0530 0600 0630\nBeam: 4 (eV\n\/sm\n3)\n105\n1010\n0500 0530 0600 0630\nFig. 7. Modeled electron energy losses to the neutrals and ions with altitude (top panels). Modeled height-integrated electron energy loss rate (bottom panels). Each\ncolumn corresponds to a different PFISR look direction. HIPAS was operated in pulsed (light grey panels) and continuous wave (dark grey panels) modes with other periods\nhaving no transmissions.\nM.J. Kosch et al. \/ Journal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1959–1966 1965for pump frequencies a few kilohertz above the second electron\ngyro-harmonic frequency in the ionospheric F-layer clearly\nindicates that powerful wave-plasma resonances are taking place.\nUnfortunately, the HAARP facility does not have a co-located\nincoherent scatter radar to diagnose the plasma. The EISCAT\nionospheric modification facility does have two co-located\nincoherent scatter radars, but the minimum pump frequency\nonly reaches down to the third electron gyro-harmonic. Although\nthe experiment geometry was unfavourable, the only available\npossibility was to use the HIPAS ionospheric modification facility\nin conjunction with the newly inaugurated PFISR in Alaska. This\nhas clearly demonstrated the enhanced artificial optical emissions\ncorrespond to enhanced ionospheric electron temperatures,\npeaking for pump frequencies near the second electron gyro-\nharmonic frequency and near double resonance. In addition, the\nefficiency of plasma heating is likely to be approximately double,\nor more, for pumping near the second gyro-harmonic compared to\nhigher frequencies, based on the intensity of the pump-induced\noptical emissions. We also report the first SuperDARN radar\nobservation of enhanced HF backscatter over HIPAS.Acknowledgements\nFunding for HIPAS operations is gratefully acknowledged from\nThe International Foundation for Science, Health and Environ-\nment. We acknowledge the assistance of P. O’Connor in processing\nthe optical images.References\nAshrafi, M., Kosch, M.J., Honary, F., 2006. Heater-induced altitude descent of the\nEISCAT UHF ion-line overshoot: Observations and modeling. Adv. Space Res.\n38, 2645–2652.\nAshrafi, M., Kosch, M.J., Kaila, K., Honary, F., 2007. Spatio-temporal evolution of HF-\ninduced artificial optical emissions, radar backscatter and Stimulated Electro-\nmagnetic Emissions at EISCAT. J. Geophys. Res. 112, A05314, doi:10.1029\/\n2006JA011938.\nBra¨ndstro¨m, B.U.E., Leyser, T.B., Steen, A., Rietveld, M.T., Gustavsson, B., Aso, T., Ejiri,\nM., 1999. Unambiguous evidence of HF pump-enhanced airglow at auroral\nlatitudes. Geophys. Res. Lett. 26, 3561–3564.\nGustavsson, B., Eliasson, B., 2008. HF radio wave acceleration of ionospheric\nelectrons: analysis of HF-induced optical enhancements. J. Geophys. Res. 113\ndoi:10.1029\/2007JA012913.\nGustavsson, B., Sergienko, T., Kosch, M.J., Rietveld, M.T., Bra¨ndstro¨m, B.U.E., Leyser,\nT.B., Isham, B., Gallop, P., Aso, T., Ejiri, M., Grydeland, T., Steen, A., LaHoz, C.,Kaila, H., Jussila, J., Holma, H., 2005. The electron distribution during HF\npumping, a picture painted with all colours. Ann. Geophys. 23, 1747–1754.\nGustavsson, B., Leyser, T.B., Kosch, M.J., Rietveld, M.T., Steen, A., Bra¨ndstro¨m, B.U.E.,\nAso, T., 2006. Electron gyroharmonic effects in ionization and electron\nacceleration during HF pumping in the ionosphere. Phys. Rev. Lett. 97, 190052.\nGustavsson, B., Kosch, M., Wong, A., Pedersen, T., Heinselman, C., Mutiso, C.,\nBristow, B., Hughes, J., Nielsen, K., Wang, W., 2008. First estimates of altitude\ndistribution of HF-pump enhanced emissions at 6300 and 5577A: a\ncomparison between observations and theory. Ann. Geophys. 26, 3999–4012.\nHaslett, J.C., Megill, L.R., 1974. A model of the enhanced airglow excited by rf-\nradiation. Radio Sci. 9, 1005–1019.\nKosch, M.J., Rietveld, M.T., Hagfors, T., Leyser, T.B., 2000. High-latitude HF-induced\nairglow displaced equatorwards of the pump beam. Geophys. Res. Lett. 27,\n2817–2820.\nKosch, M.J., Rietveld, M.T., Kavanagh, A.J., Davis, C., Yeoman, T., Honary, F., Hagfors,\nT., 2002. High-latitude pump-induced optical emissions for frequencies close\nto the third electron gyro-harmonic. Geophys. Res. Lett. 29, 2112–2115.\nKosch, M.J., Pedersen, T., Hughes, J., Marshall, R., Gerken, E., Senior, A., Sentman, D.,\nMcCarrick, M., Djuth, F., 2005. Artificial optical emissions at HAARP for pump\nfrequencies near the third and second gyroharmonic. Ann. Geophys. 23, 1585–\n1592.\nKosch, M.J., Pedersen, T., Rietveld, M.T., Gustavsson, B., Grach, S.M., Hagfors, T.,\n2007a. Artificial optical emissions in the thermosphere induced by powerful\nradio waves: an observational review. Adv. Space Res. 40 (3), 365–376.\nKosch, M.J., Pedersen, T., Mishin, E., Oyama, S., Hughes, J., Senior, A., Watkins, B.,\nBristow, B., 2007b. Coordinated optical and radar observations of ionospheric\npumping for a frequency pass through the second electron gyro-harmonic at\nHAARP. J. Geophys. Res. 112, A06325, doi:10.1029\/2006JA012146.\nKosch, M.J., Pedersen, T., Mishin, E., Starks, M., Gerken-Kendall, E., Sentman, D.,\nOyama, S., Watkins, B., 2007c. Temporal evolution of pump beam self-focusing\nat HAARP. J. Geophys. Res. 112, A08304, doi:10.1029\/2007JA012264.\nLeyser, T.B., Gustavsson, B., Bra¨ndstro¨m, B.U.E., Steen, A˚., Honary, F., Rietveld, M.T.,\nAso, T., Ejiri, M., 2000. Simultaneous measurements of high-frequency pump-\nenhanced airglow and ionsopheric temperatures at auroral latitudes. Adv.\nPolar Upper Atmos. Res. 14, 1–11.\nLeyser, T.B., Wong, A.Y., 2009. Powerful electromagnetic waves for active\nenvironmental research in geospace. Rev. Geophys. 47, RG1001, doi:10.1029\/\n2007RG000235.\nMantas, G.P., Carlson, H.C., 1991. Re-examination of the O3P -4 O1D excitation\nrate by thermal impact. Geophys. Res. Lett. 18, 159–162.\nMutiso, C.K., Hughes, J.M., Sivjee, G.G., Pedersen, T., Gustavsson, B., Kosch, M.J.,\n2008. Unreported optical emissions generated during ionospheric heating.\nGeophys. Res. Lett. 35, L14103, doi:10.1029\/2008GL034563.\nOyama, S.-I., Watkins, B., Djuth, F.T., Kosch, M.J., Bernhardt, P., Heinselman, C.J.,\n2006. Persistent enhancement of the HF pump-induced plasma line measured\nwith a UHF diagnostic radar at HAARP. J. Geophys. Res. 11, A06309, doi:10.1029\/\n2005JA011363.\nPavlov, A.V., 1998a. New electron energy transfer rates for vibrational excitation of\nN2. Ann. Geophys. 16, 176–182.\nPavlov, A.V., 1998b. New electron energy transfer and cooling rates by excitation of\nO2. Ann. Geophys. 16, 1007–1013.\nPavlov, A.V., Berrington, K.A., 1999. Cooling rate of thermal electrons by electron\nimpact excitation of fine structure levels of atomic oxygen. Ann. Geophys. 17,\n919–924.\nPedersen, T.R., Carlson, H.C., 2001. First observations of HF heater-produced\nairglow at the high frequency active auroral research program facility: thermal\nexcitation and spatial structuring. Radio Sci. 36, 1013–1026.\nARTICLE IN PRESS\nM.J. Kosch et al. \/ Journal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1959–19661966Pedersen, T.R., McCarrick, M., Gerken, E., Selcher, C., Sentman, D., Carlson, H.C.,\nGurevich, A., 2003. Magnetic zenith enhancement of HF radio-induced airglow\nproduction at HAARP. Geophys. Res. Lett. 30 doi:10.1029\/2002GL016096.\nPedersen, T., Esposito, R., Starks, M., McCarrick, M., 2008. Quantitative determina-\ntion of HF radio-induced optical emission production efficiency at high\nlatitudes. J. Geophys. Res. 113 doi:10.1029\/2008JA013502.\nRees, M.H., Roble, R.G., 1975. Observations and theory of the formation of stable\nauroral red arcs. Rev. Geophys. Space Phys. 13, 201–242.\nRietveld, M.T., Isham, B., Kohl, H., La Hoz, C., Hagfors, T., 2000. Measurements of\nHF-enhanced plasma and ion lines at EISCAT with high altitude resolution. J.\nGeophys. Res., 7429–7439.\nRietveld, M.T., Kosch, M.J., Blagoveshchenskaya, N.R., Kornienko, V.A., Leyser, T.B.,\nYeoman, T.K., 2003. Ionospheric electron heating, optical emissions and\nstriations induced by powerful HF radio waves at high latitudes: aspect angle\ndependence. J. Geophys. Res. 108, 1141, doi:10.1029\/2002JA009543.\nRietveld, M.T., Kosch, M.J., Blagoveshchenskaya, N.F., Kornienko, V.A., Leyser, T.B.,\nYeoman, T.K., 2004. Correction to ionospheric electron heating, opticalemissions, and striations induced by powerful HF radio waves at high\nlatitudes: aspect angle dependence. J. Geophys. Res. 109, A04306,\ndoi:10.1029\/2004JA010460.\nRobinson, T.R., Honary, F., Stocker, A.J., Jones, T.B., Stubbe, P., 1996. First EISCAT\nobservations of the modification of F-region electron temperatures during RF\nheating at harmonics of the electron gyro frequency. J. Atmos. Terr. Phys. 58,\n385–395.\nRobinson, T.R., 1989. The heating of the high latitude ionosphere by high power\nradio waves. Phys. Rep. 179, 79–209.\nSchunk, R.W., Nagy, A.F., 2004. Ionospheres: Physics, Plasma Physics, and\nChemistry. Cambridge Univ. Press, Cambridge.\nSergienko, T., Gustavsson, B., Steen, A., Bra¨ndstro¨m, U., Rietveld, M., Leyser, T.B.,\nHonary, F., 2000. Analysis of excitation of the 630.0 nm airglow during a\nheating experiment in Tromso on February 16, 1999. Phys. Chem. Earth (B) 25,\n531–535.\nStubbe, P., Varnum, W.S., 1972. Electron energy transfer rates in the ionosphere.\nPlanet. Space Sci. 20, 1121–1126.\n"}