{"doi":"10.1017\/S0047279408002559","coreId":"65197","oai":"oai:dro.dur.ac.uk.OAI2:6549","identifiers":["oai:dro.dur.ac.uk.OAI2:6549","10.1017\/S0047279408002559"],"title":"The evolution of choice policies in UK housing, education and health policy.","authors":["Greener,  I.","Powell,  M."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-01-01","abstract":"Scholarship in social policy in recent years has examined how policy positions users in a range of roles, particularly most recently in terms of their roles as ‘choosers’ through the increased use of markets in welfare. This article considers how choice policies have positioned users since the creation of the modern welfare state, presenting a history of choice policies, but also a comparative examination of how they have differed in the UK between housing, education and healthcare. It concludes by suggesting that although approaches to choice vary considerably between the three public services examined, policy-makers often appear unaware of these differences, leading to mistaken assumptions that policies can be transferred or transplanted unproblematically","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65197.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/6549\/1\/6549.pdf","pdfHashValue":"9f4c2d0e960492a4637b889d317aa55c53134fa5","publisher":"Cambridge University Press","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:6549<\/identifier><datestamp>\n      2011-12-14T09:28:51Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        The evolution of choice policies in UK housing, education and health policy.<\/dc:title><dc:creator>\n        Greener,  I.<\/dc:creator><dc:creator>\n        Powell,  M.<\/dc:creator><dc:description>\n        Scholarship in social policy in recent years has examined how policy positions users in a range of roles, particularly most recently in terms of their roles as ‘choosers’ through the increased use of markets in welfare. This article considers how choice policies have positioned users since the creation of the modern welfare state, presenting a history of choice policies, but also a comparative examination of how they have differed in the UK between housing, education and healthcare. It concludes by suggesting that although approaches to choice vary considerably between the three public services examined, policy-makers often appear unaware of these differences, leading to mistaken assumptions that policies can be transferred or transplanted unproblematically.<\/dc:description><dc:publisher>\n        Cambridge University Press<\/dc:publisher><dc:source>\n        Journal of social policy, 2009, Vol.38(1), pp.63-82 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2009-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:6549<\/dc:identifier><dc:identifier>\n        issn:0047-2794<\/dc:identifier><dc:identifier>\n        issn: 1469-7823 <\/dc:identifier><dc:identifier>\n        doi:10.1017\/S0047279408002559<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6549\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1017\/S0047279408002559<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6549\/1\/6549.pdf<\/dc:identifier><dc:rights>\n        Copyright © Cambridge University Press 2008. This paper has been published by Cambridge University Press in \"Journal of social policy\" (38 : 1 (2009) 63-82) http:\/\/journals.cambridge.org\/action\/displayAbstract?fromPage=online&aid=2771036<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1469-7823","issn:0047-2794"," 1469-7823","0047-2794"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n24 March 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nGreener, I. and Powell, M. (2009) ’The evolution of choice policies in UK housing, education and health\npolicy.’, Journal of social policy., 38 (1). pp. 63-82.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1017\/S0047279408002559\nPublisher’s copyright statement:\nCopyright Cambridge University Press 2008. This paper has been published by Cambridge University Press in\n”Journal of social policy” (38 : 1 (2009) 63-82)\nhttp:\/\/journals.cambridge.org\/action\/displayAbstract?fromPage=onlineaid=2771036\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \n \nDurham Research Online \n \nDeposited in DRO: \n24 March 2010 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status: \nPublished version \n \nCitation for published item: \nGreener, I. and Powell, M. (2009) 'The evolution of choice policies in UK housing, education \nand health policy.', Journal of social policy., 38 (1). pp. 63-82. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1017\/S0047279408002559 \n \nPublisher’s copyright statement: \nCopyright © Cambridge University Press 2008. This paper has been published by \nCambridge University Press in \"Journal of social policy\" (38: 1 (2009) 63-82) \nhttp:\/\/journals.cambridge.org\/action\/displayAbstract?fromPage=online&aid=2771036 \n \n \n \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nhttp:\/\/journals.cambridge.org Downloaded: 24 Mar 2010 IP address: 129.234.252.67\nJnl Soc. Pol., 38, 1, 63–81 C© 2008 Cambridge University Press\ndoi:10.1017\/S0047279408002559 Printed in the United Kingdom\nThe Evolution of Choice Policies in UK\nHousing, Education and Health Policy\nIAN GREENER∗ and MARTIN POWELL∗∗\n∗School of Applied Social Sciences, University of Durham, 32 Old Elvet, Durham DH1 3HN\nemail: ian.greener@durham.ac.uk\n∗∗Health Services Management Centre, University of Birmingham, Park House,\n40 Edgbaston Park Road, Birmingham B15 2RT\nemail: m.powell@bham.ac.uk\nAbstract\nScholarship in social policy in recent years has examined how policy positions users in\na range of roles, particularly most recently in terms of their roles as ‘choosers’ through the\nincreased use of markets in welfare. This article considers how choice policies have positioned\nusers since the creation of the modern welfare state, presenting a history of choice policies, but\nalso a comparative examination of how they have differed in the UK between housing, education\nand healthcare. It concludes by suggesting that although approaches to choice vary considerably\nbetween the three public services examined, policy-makers often appear unaware of these\ndifferences, leading to mistaken assumptions that policies can be transferred or transplanted\nunproblematically.\nIntroduction\nIn recent years, scholarship has become increasingly sensitive to the way that\npolicy positions public service users in particular roles (Deacon and Mann, 1999;\nGreener, 2002; Hoggett, 2001). Le Grand (1997, 2003), for example, suggests users\nin public services are often treated as ‘pawns’, with little ability to express choice\nover service provision, when instead they ought to be sovereign ‘queens’. In this\nview, welfare policy creates incentives that shape the relationships between those\nthat deliver services and those that receive them.\nOne of the central means that policy has attempted to make service users\nsovereign is through the extension of the choices available to them (Minister of\nState for Department of Health et al., 2005; Newman and Vidler, 2006; Clarke\net al., 2007; Jordan, 2005; McAteer, 2005). Extending choice in public services\nappears a simple, common-sense solution, an approach to public reform that\ncan be applied to different services. However, despite a great deal of theoretical\nliterature on the extension of choice and consumerism in society more generally,\nthere is a lack of empirical work examining the development of public service\nchoice, or explorations of what choice-based reforms are meant to achieve. Does\nhttp:\/\/journals.cambridge.org Downloaded: 24 Mar 2010 IP address: 129.234.252.67\n64 ian greener and martin powell\nthe use of choice mechanisms create a single approach to public reform, or are\nthe types of choices given to service users very different, attempting to achieve\ndifferent goals in different services?\n6, in his examination of choice policy in the UK (6, 2003), presents the\nmost complete analysis of these questions so far, suggesting choice is used for\ndifferent goals in different public services (see especially pp. 250–1). The Labour\ngovernment, however, appears to use the term ‘choice’ more or less generically,\nas a single approach to reform that can be transferred between public services\n(Minister of State for Department of Health et al., 2005). This also has a great\ndeal in common with Le Grand’s recent work that argues for a further extension\nof choice policies, particularly through devolved budgets (Le Grand, 2007).\nThis article presents an analysis of the post-war development of policies to\nextend choice in healthcare, education and housing. It asks, where increased user\nchoice was offered, how were the reforms meant to work, and what were their\nexpressed goals? Were these policies attempting to create ‘queens’ by making\nservice users sovereign, as Le Grand advocates or, as 6 suggests, do the goals of\nchoice-based reforms vary according to the service examined? If the intention is\nto position users as ‘queens’, what problems might such reforms encounter?\nThe method chosen here is a distinctive one. A corpus of policy documents\nfrom three UK service areas was assembled: housing, education and healthcare.\nHousing was chosen because of the presence of a dominant private market in that\nsector, and the use of extending choice policies from the Right to Buy since the\n1980s. In education, school choice has been emphasised over a similar time period,\nbut choices offered are between predominantly public providers. In healthcare,\nthere is also overwhelming public provision, but choice policies since the 1980s\nhave often meant an increased use of private funds to purchase private care. As\nsuch, the three areas cover the spectrum from private to public provision, with\npolicies in place that attempt to extend choice for at least two decades.\nThe assembled policy documents totalled three-quarters of a million words,\nand were supplemented by secondary readings of policy texts from each of the\nservice areas, along with visits to the national archives to provide additional\nbackground, and a witness seminar was organised to examine findings from the\npapers. The witness seminar covered policy in the Thatcher and Major eras, and\nwas organised with the help of the Institute of Historical Research in London,\ninviting policy-makers, civil servants and academics active in that period to\ndiscuss their memories of policy-making at that time.\nPolicy is treated here as the deliberate articulation of a government’s aims,\nrecognising fully that there are substantial differences between policy planning\nand policy implementation (Paige, 2007). However, it contends that examining\nhow the meaning of ‘choice’ varies both over time and between services through\nan analysis of published policy offers a means of looking for both similarities and\ndifferences, as well as providing an outline of its historical development.\nhttp:\/\/journals.cambridge.org Downloaded: 24 Mar 2010 IP address: 129.234.252.67\nevolution of choice policies in uk housing, education and health policy 65\nThe article proceeds by an analysis of each decade from the 1940s, exploring\nthe similarities and differences to user choice across the three services. A greater\nemphasis is placed on later policy as more examples of choice appear there. The\narticle concludes by answering the questions raised above.\nThe 1940s\nAt the founding of the modern welfare state, choice policies varied considerably\nfrom service to service. In housing (Ministry for Reconstruction, 1945), user\nchoice was not considered at all, confirming to some extent the conventional\nwisdom that choice was not a driver of policy until much later. After\nwartime, rebuilding was the main concern instead. In education (Ministry for\nReconstruction, 1943), however, choice is present. There were concerns that for\nchoices between schools to be ‘real’, ‘conditions in the different types of secondary\nschools must be broadly equivalent’ (s.28).1 Choices were therefore between types\nof school (grammar, modern and technical), but with the eleven-plus exam\nrestricting entry opportunities. It was also unclear on what basis parents were\nmeant to make school choices on behalf of their children because of the lack\nof publicly available information comparing them. This was also the case in\nhealthcare, where patients were expected to choose their GPs with nothing other\nthan a list of practitioners in their local area (Ministry of Health, 1944). Patients\nwere given a choice of GP, and were meant to make this choice on the basis of\nforming a long-term ‘association’ relationship with their family doctor rather\nthan being able to move practice if things did not work out.\nPolicy in the 1950s\nThe first post-war Conservative government was elected in 1951. What difference\ndid this make to the choices available to users? In the 1950s, housing policy\nemphasised local authorities getting landlords to treat their tenants as customers\nand attempting to create a private rental marketplace, but with no notion that\nsocial housing users should receive the same treatment (Ministry of Housing and\nLocal Government, 1953). The government recognised that houses were in short\nsupply, and encouraged private enterprise to become involved to replenish the\nhousing stock, beginning a new policy theme: the need to have a vibrant private\nhousing market in order for real choice to be in place.\nIn education (Ministry of Education, 1958), the government emphasised\nthe importance of choosing the correct school, with parents encouraged to take\nadvice to that end. It was an ‘important objective of Government policy to ensure\nthat young people and their parents know what the education service has to offer\nthem’ (s.36). Public officials were there to advise parents rather than provide\nthem information to choose for themselves, so it was an expert-led model. The\nhttp:\/\/journals.cambridge.org Downloaded: 24 Mar 2010 IP address: 129.234.252.67\n66 ian greener and martin powell\ngovernment was also concerned that local authorities were undermining parental\nchoice by closing grammar schools and replacing them with comprehensives:\nBut it is quite another matter when a local authority proposes to bring to an end an existing\ngrammar school . . . in order that a new comprehensive school may enjoy a monopoly of the\nabler children within its area. It cannot be right that good existing schools should be forcibly\nbrought to an end, or that parents’ freedom of choice should be so completely abolished. (s.16)\nOnly in healthcare does choice appear to become relatively unimportant.\nProposals for increasing choice for patients did not appear to be a priority at\nthis time; instead, the priority was the need to keep the service within its budget\n(Webster, 1994).\nThe 1960s\nIn the 1960s, choices in public services were typically made by planners and experts\nrather than service users. If service users wanted choice, they had to find a way\nof accessing the private sector. In 1963, the outgoing Conservative government\nspelt out this view on housing choice: ‘In a free country the householder must be\nprepared to meet the cost of his house where he is able to do so. Otherwise he will\nhave little freedom of choice’ (Ministry of Housing and Local Government, 1963:\ns.75). The following Labour government, in contrast, was silent on choice: their\n1965 document was instead concerned about applying a corporatist solution to\nhouse-building by coordinating the activities of building societies and builders.\nThere was little mention of the housing users (Ministry of Housing and Local\nGovernment, 1965).\nThe most significant education policy document of the 1960s was circular\n10\/65 (Department for Education and Skills, 1965) which extended comprehensive\neducation (Chitty, 2004). However, it is rather atypical and so was not included in\nthe analysis here. The result – the rapid extension of comprehensive education –\nled to a reduction of school choice, the implications of which were to be felt in\nthe next decade.\nIn healthcare, policy documents were, as with the 1965 housing document,\nconcerned with the application of planning techniques (see, for example,\nMinister of Health, 1962). Choices, where they were discussed, were made by\nplanners or experts, with user choices only available through private purchase of\nwelfare services. This appeared to reflect the technocratic ‘Keynesian-plus’ policy\n(Pemberton, 2000) of the time in which the voice of the user was largely ignored\nin favour of the expert instead.\nHousing policy therefore summed up the government’s approach to choice in\nthe 1960s: if users wanted choices, they had to find the resources to access private\nproviders. In education, the state had deliberately set about removing choice,\nbelieving its new comprehensive schools could provide most appropriately for\nthe needs of children.\nhttp:\/\/journals.cambridge.org Downloaded: 24 Mar 2010 IP address: 129.234.252.67\nevolution of choice policies in uk housing, education and health policy 67\nPolicy in the 1970s\nIn housing in the 1970s there was a choice between rental and purchase but, despite\nthe presence of a significant private housing market, there was no evidence of\na more consumerist discourse in housing as compared to other services. In 1971\nthe aim of policy was to provide ‘a decent home for every family at a price\nwithin their means’ which was to be achieved by offering ‘a fairer choice between\nowning a home and renting one’ (Department of the Environment, 1971: s. 5). The\nextension of ownership was to be achieved through schemes such as cooperative\nhousing, which blurred the boundaries between social and private housing, and\nwas described in the witness seminar by former Chief Charity Commissioner\nJohn Stoker as being a central part of the development of housing policy before\nthe Thatcher era (Witness Seminar, 2006: 58).\nThe extension of home ownership was explicitly opposed by the Labour\ngovernment of 1974–79 because of concerns it might involve people taking on\ntoo much responsibility; ‘it would be no kindness to tempt into the financial\nresponsibilities of home ownership those who simply would not manage the\nmortgage payments’ (Department of the Environment, 1977: 7.09). Labour policy\nalso rejected the Right to Buy council homes because ‘it would be anomalous for\nthe Government to direct its policies and priorities to the assistance of areas of\nhousing stress and at the same time to accept a substantial depletion of the kind\nof stock they are encouraging authorities to provide’ (11.38). To modern eyes, this\nappears rather patronising, but was written at a time when social housing was\nmore widespread and consumer aspirations lower.\nIn education, greater choice over curriculum was initially to be given to\nsecondary school students: ‘The wider the span of student motivation, the greater\nthe need to match it with a wide and flexible choice of course’ (Secretary of State\nfor Education and Science, 1972: s.108). However, as with housing, the following\nLabour government had concerns about allowing students greater choice. Labour\nexpressed concerns about students making poor choices, with particular concerns\nover girls (Department for Education and Skills, 1977): ‘care must be taken to\nsee that girls do not by their choices limit the range of educational and career\nopportunities open to them’ (2.17).\nIn healthcare choice occurred as a means of crossing boundaries between\nthe previously unmentioned private sector and public healthcare as the ‘right for\npeople to have an opportunity to exercise a personal choice to seek treatment\nprivately’ (Secretary of State for Health and Social Services, 1972: s.23), breaking a\nlong-held taboo of not mentioning the private sector in health policy documents.\nIn the public sector, the user was to receive ‘services best suited to his needs,\nhis convenience and, as far as practicable, his choice’ (s.48), but with no clear\nmechanisms being put in place to achieve this goal.\nIn Conservative policy documents, the 1970s represent the beginning of a\nconsumerist discourse in terms of choice grounded in terms of offering private\nhttp:\/\/journals.cambridge.org Downloaded: 24 Mar 2010 IP address: 129.234.252.67\n68 ian greener and martin powell\nprovision for those able to pay, and an aspiration for better service for those that\ncould not. Labour, however, appeared to believe that choice could be debilitating\nas well as enabling, and presented public organisational solutions based on the\ngreater application of planning instead.\nThe 1980s\nBy the 1980s, the Thatcher government was in power, and a new emphasis on\nchoice appeared across the public services (Clarke and Newman, 1997). Former\nPrincipal Private Secretary Nigel Forman described Thatcher’s reforms as being\nintroduced in the name of ‘people, citizens or subjects being less beholden to\nthe state and its work’ (Witness Seminar, 2006: 5). The housing document of\n1987 summarises Conservative policy during their first two terms (Department\nof the Environment, 1987). The Right to Buy introduced in 1980 had ‘proved to be\none of the most successful reforms undertaken by the present Government’ (2.10)\nbecause ‘Clearly the majority of people wish to own their own homes’ (1.7). Home\nownership was justified as giving people ‘independence; it gives them a sense of\ngreater personal responsibility; and it helps to spread the Nation’s wealth more\nwidely’ (1.7). In the witness seminar, John Stoker suggested the ‘right-to-buy and\nconsumer interest is obvious, it being linked with the political idea of the time of\na property-owning democracy’ (Witness Seminar, 2006: 12).\nPublic housing provision was criticised: ‘Local authority housing allocation\nmethods can all too easily result in inefficiencies and bureaucracy, producing\nqueuing and lack of choice for the tenant’ (1.11). The means to overcome\nbureaucracy was through ‘offering a variety of forms of ownership and\nmanagement; this will help to break down the monolithic nature of large estates’\n(1.4) and ‘ensuring greater private sector involvement in housing investment;\nproviding wider choice for the consumer and the tenant’ (7.8).\nIn housing, private sector providers were the key partners for extending\nchoices for tenants, and the Right to Buy the means of becoming a fully fledged\nconsumer. Labour’s reservations of the 1970s had been entirely left behind.\nIn education, many of the debates of the previous decade were reassessed.\nParental choice was to be extended through the Assisted Places scheme, which\nwas put in place because of the ‘abolition of the Direct Grant Grammar Schools’\n(Department for Education and Skills, 1985: s.195) and through the use of the\nindependent school sector which made ‘a significant contribution’ through the\n‘additional choices it offers parents’ (s.288).\nThe central feature of secondary education policy of the 1980s was the\nNational Curriculum. The 1985 document stated: ‘There should be an element\nof choice in the curriculum for the 4th and 5th years but the choice of options\nshould not allow pupils to undertake a programme that is insufficiently broad\nor balanced’ (s.66). The curriculum was to be designed so that ‘it is likely that\nhttp:\/\/journals.cambridge.org Downloaded: 24 Mar 2010 IP address: 129.234.252.67\nevolution of choice policies in uk housing, education and health policy 69\n80–85 per cent of each pupil’s time needs to be devoted to subjects which are\ncompulsory or liable to constrained choices’ (s.69). At the same time as choice\nwas limited to schools, however, it was extended at sixth form level. AS levels\nwere introduced to widen ‘the choice of subject combinations available to A level\nstudents’ (s.111).\nParents were encouraged in the 1980s to choose their child’s school\nfrom between public and private providers as the latter made ‘a significant\ncontribution through the additional choices it offers parents’ (s.288). Parents\nbecame proxy ‘choosers’ of schools on behalf of their children, but former\neducation correspondent Peter Wilby suggested that ‘the differences between\nschools that they might base that choice on would disappear because everyone\nwould have to teach the same national curriculum’ (Witness Seminar, 2006: 16).\nWith curriculum differences removed, school type (independent or public)\nappeared to be the basis upon which parents were meant to make their choice.\nIn healthcare the NHS Management Inquiry reported in 1983 (Department\nof Health and Social Security, 1983), but choice was not an important concept.\nThe Chair of the Committee, supermarket Chief Executive Roy Griffiths, wanted\nmanagers to be accountable to patients locally, and for doctors to provide a\nbetter service to patients while understanding their decisions carried resource\nimplications. By 1988, Thatcher had come to see the NHS as a ‘bottomless financial\npit’ (Thatcher, 1993), and had come to believe that significant reform was required.\n‘Working for Patients’ (Secretary of State for Health, 1989) introduced a ‘quasi-\nmarket’ into healthcare, and introduced patient choice in a number of contexts.\nPatients should exercise a ‘real choice between GPs’ (7.4): an emphasis not on\nmaking a choice of GP for the long term as in 1944, but instead on changing doctor\n‘without any hindrance at all’ (7.7), a more short-term, transactional notion of\nGP selection.\nThe Conservative government again emphasised the role of the private sector\nin offering choices to patients. The choice of private medicine was one that was\ngood for the NHS: ‘People who choose to buy health care outside the Health\nService benefit the community by taking pressure off the Service and add to the\ndiversity of provision and choice’ (1.18). The private sector was both source of\nextra capacity and competition to the NHS as ‘introducing more choice into\nthe provision of services will greatly increase the opportunities for managers to\nbuy in services from the private sector where this will improve the services to\npatients’ (9.12).\nPatients were also to be offered additional choices in other aspects of\nhealthcare, with choices over ‘time or place of treatment’ (1.12), to a ‘wider\nchoice of meals’ (1.13), but without the mechanisms through which this was to\noccur being made explicit.\nIn healthcare, patients were encouraged to be more selective of their GP,\nwho then made choices about secondary care on their behalf (a principal-agent\nhttp:\/\/journals.cambridge.org Downloaded: 24 Mar 2010 IP address: 129.234.252.67\n70 ian greener and martin powell\nmodel of care). The greater use of the private sector for secondary treatment\nwas meant to introduce both competition and extra capacity there. Patients were\nalso encouraged to expect a better standard of food and a say over where and\nwhen they would be treated, although it is not clear they ever received much say\nin any of these areas (Le Grand et al., 1998). These reforms were put in place\nto address what Sir Graham Hart, then Deputy Secretary at the Department of\nHealth, described as the ‘perceived inability of the NHS to manage within the\nresources that were being made available to it . . . the Department of Health did\nnot see patients as consumers in any sense we would now recognise’ (Witness\nSeminar, 2006: 29)\nPolicy in the 1980s presented very different choices in the three services\nexamined here. In housing, the private sector became central to offering tenants\nmore choices, and the Right to Buy the means to become a fully fledged housing\nconsumer. In education, student choice was substantially reduced with the\nintroduction of the national curriculum, but parent choice emphasised in terms\nof choosing between public and private providers, with far less scope for choice\navailable to parents unable to afford independent school fees or whose children\ndid not receive assisted places. In healthcare patients had a choice of GPs, and\nincreasingly had the opportunity to experience private provision through its\nentry as both competitor and provider of extra capacity to the NHS. Choice\nwas beginning to appear between public providers (in healthcare), but was still\nmore commonly used in reference to the choices the more affluent could afford\nbetween public and private provision (in housing and education).\nPolicy in the 1990s\nThe 1992 Conservative government introduced new themes in policy, including\nperhaps most memorably the use of Charters. In housing, the Right to Buy\ncontinued to be celebrated as a ‘revolution’ because ‘Home ownership must\nremain at the heart of our policies. It is after all what most people want’\n(‘introduction’) (Department of the Environment, 1995). The policy was extended\nto leasehold and higher-value houses on the grounds of its previous success. The\nCouncil Tenants’ Charter introduced a range of rights including the Right to\nManage, which entailed tenants taking over their estates as they ‘can start off by\ntaking responsibility for a limited range of functions, and then broaden it as their\nconfidence and experience grows’ (‘tenant involvement in CCT’). The general\napproach to policy was that it ‘acknowledges that public provision cannot and\nshould not be all pervading and that we need to empower people to make their\nown decisions and to accept individual responsibility for the choices they make’\n(‘introduction’). Home ownership was still perceived to be the gold standard of\nhousing policy, as responsibility there lay ‘where it belongs – with borrowers,\nlenders and the insurance industry’ (‘income support’). Individuals accepting\nhttp:\/\/journals.cambridge.org Downloaded: 24 Mar 2010 IP address: 129.234.252.67\nevolution of choice policies in uk housing, education and health policy 71\ngreater responsibility for their own housing was a repeated theme throughout\nthe document.\nThe Conservatives wanted to introduce greater private provision into\nhousing where at all possible. The private sector was to be used to break ‘down\nold barriers and concepts of who should do what, and opening up new areas\nof activity to choice and competition’ (‘introduction’). Rental deregulation was\nnecessary because present systems ‘discouraged investment and reduced choice\nfor tenants’ (‘private tenants – key facts’).\nIn education, documents in both 1992 and 1996were based on an extension of\nparental choice (Department for Education and Employment, 1996; Department\nfor Education, 1992). In 1992, choice was extended through the creation of\ngrant-maintained schools that opened ‘the way to greater variety in education’\n(‘introduction’). New schools gave parents an additional choice with ‘the right\nof parents to choose, in a secret ballot, whether their child’s school should apply\nto transfer out of the control of the LEA and become grant-maintained’ (7.1).\nThe government claimed its approach to reform was to achieve ‘Diversity,\nchoice and excellence . . . with each child having an opportunity to realise\nhis or her full potential, liberating and developing his or her talents’ (15.7).\nIt was necessary to create as much parental choice as possible because ‘In\nmany cases parental wishes expressed through choice of school will drive\nimprovements. We shall make sure parents have comprehensive and timely\ninformation so that they can play their part to the full’ (1.66). Diversity offered\nthe opportunity for schools to specialise on the grounds again that it ‘means\nincreased choice for parents and pupils’ (10.2). School choice had changed from\nbeing based on a decision (resources permitting) between independent and\npublic schools, to one between new kinds of public schools and the independent\nsector.\nThe 1996 education document continued to emphasise choice, giving\nschools greater powers to select their pupils, ‘extending choice and diversity by\nencouraging new grammar schools, giving schools more power to select pupils,\nand developing the specialist schools programme’ (‘introduction’).\nBy 1997, Labour had returned to power under the Blair promise that the\ntop three priorities for government would be ‘education, education, education’.\nChoice was far less apparent (Department for Education and Employment,\n1997). There was the possibility of greater choice over school meals provided\nthey met ‘minimum nutritional standards’ (s.48). Schools could still opt out of\nlocal authority control, but required ‘a ballot of parents which would provide a\nmechanism for testing whether parents agreed with that choice’. Finally, choice\nwas linked to information: ‘Parents must have the information they need to\nsee what different schools can offer and to assess their choices realistically’\n(‘consultation’). Labour’s approach to choice appeared to lack the enthusiasm of\ntheir predecessors.\nhttp:\/\/journals.cambridge.org Downloaded: 24 Mar 2010 IP address: 129.234.252.67\n72 ian greener and martin powell\nThe last health White Paper of the Conservative era (Secretary of State\nfor Health, 1996) made a link between choice and the greater availability of\ninformation for patients, not in order to choose treatment but instead to support\nan improved lifestyle. It was now the role of the NHS ‘to provide information to\npatients and the public so they can make informed choices about their own lives,\nknow what action to take to help themselves, know when and how to seek help,\nand so they can take part in decisions and choices about care and treatment’\n(‘information’). Outside of this new context, choice was barely apparent –\nsuggesting a ‘becalming’ of policy of the 1990s after the introduction of the\ncontentious internal market (Wainwright, 1998).\nIn 1997, Labour produced a health White Paper (Secretary of State for Health,\n1997). In common with education policy, there was little mention of choice.\nThere was a move back toward producer-led choices, with discussions about\nnew Primary Care Groups and how new budgeting arrangements will ‘give GPs\nthe maximum choice about the treatment option that suits individual patients’\n(s.9.8). Choices were being made on behalf of patients rather than by them.\nIn housing policy in the 1990s, the Conservatives continued to celebrate home\nownership, particularly through the Right to Buy, because of the responsibility it\ngave to individuals. This was in marked contrast with the Labour documents of the\n1970s, which took exactly the opposite view. There also appeared to be a growing\nconsensus of the need to extend choice and competition into public housing\nthrough the use of private finance. In education the Conservatives presented a\nmodel where school choice was central, and to be achieved by attaining diversity\nof provision, allowing schools to specialise, and by parents choosing between\nthese different types of public providers to drive up standards. In healthcare\nchoices were discussed more in terms of lifestyle than choices between competing\nhealthcare providers. Service choices appeared to be mostly in the hands of\nproviders again.\nLabour did not appear to regard choice as being particularly important\nupon returning to office in 1997. Their approach was more conciliatory to\npublic professionals and appeared to place greater trust in them than had their\nConservative predecessors (Greener, 2004). Both the Conservatives and Labour\nplaced a greater emphasis upon the role of presenting users with information:\nthrough league tables and OFSTED reports in schools; and with public health\ninformation in healthcare.\nThe 2000s\nIn the 2000 Labour housing policy document (Department of the Environment,\nTransport and the Regions, 2000), the government claimed its approach\nto housing was ‘regulatory’ (5.35), and that it was passing responsibility to\n‘individuals to provide for their own homes where they can, providing help\nhttp:\/\/journals.cambridge.org Downloaded: 24 Mar 2010 IP address: 129.234.252.67\nevolution of choice policies in uk housing, education and health policy 73\nfor those who cannot’ (1.5). The leasehold reforms of the 1990s were extended\nby allowing tenants to take over the running of their ‘block’ even where they did\nnot purchase it. Labour acknowledged that the Right to Buy had been a success\nbut that the policy had problems that result in a need for ‘further options to\nhelp people on low incomes to meet the costs of maintaining their homes’ (4.35).\nLabour extended the Right to Buy to ‘non-heterosexual couples’ and gave the\nsame tenancy rights to same-sex partners.\nGreater social housing choice was to be achieved through ‘customer choice-\nbased letting’ with the provision of information central to ‘bring information\nabout the entire social housing market in an area . . . much closer to potential\noccupiers’ (9.27). Choice in social housing was also justified because ‘as we\nenter this new millennium it is right that our policies should work towards\ngiving people the choice they expect in other avenues of life’ (‘Foreword’) – a\nconsumerist justification for reform.\nThe use of ‘social landlords’ was justified by the need for increased\ninvestment, which was the result of ‘Years of under investment in social housing’\nthat have ‘left a £19billion repair backlog’ (‘Foreword’). This was further extended\nthrough the use of stock options (Stock Options Appraisal Executive Group, 2004)\nwhich transformed the ownership of social housing in order to attempt to meet\ndecent homes standards by 2010. Labour appeared to be attempting to extend\nand modify Conservative policies to make them more inclusionary, but going\nvery much with their grain.\nThe 2001 education document (Department for Education and Skills, 2001)\nquoted a speech from the Prime Minister suggesting a goal of public reform was\n‘greater choice of the consumer’ (1.8). However, the document itself is rather\nmuted in terms of its use of choice, only using it to offer ‘greater choice between\nworthwhile options at 14’ (2.35) in an attempt to build bridges between academic\nand vocational qualifications. This choice was to be made through the provision\nof information and guidance through Learning Mentors and the Connexions\nservice.\nBy 2005, driven by the Prime Minister demanding irreversible and structural\nreforms in welfare (Barber, 2007), a strong emphasis on extending choice\nappeared again (Department for Education and Skills, 2005). Local authorities\nhad to ‘work with the newly-created Schools Commissioner to ensure more\nchoice, greater diversity and better access for disadvantaged groups to good\nschools in every area’ (‘Executive summary’). There was to be provision of\n‘dedicated choice advisers to help the least well-off parents to exercise their\nchoices’ (‘Executive summary’), and, to extend choice to the disadvantaged, the\nuse of ‘customised yellow buses’ was considered to allow children to move easily\nfrom their homes to good schools. Technology allowed parents to make ‘more\ninformed choices about schools in their area and make representations to the\nlocal authority about provision’ (s.188), so parents could not only choose between\nhttp:\/\/journals.cambridge.org Downloaded: 24 Mar 2010 IP address: 129.234.252.67\n74 ian greener and martin powell\nschools, but also challenge local authorities where they believed provision was\nnot up to standard.\nSchool diversity came from proposals for schools to be given increased\nchoices to ‘have the freedom to shape their own destiny in the interests of parents\nand children’ (2.2), primarily through applying to become ‘Trust schools’ which\nwill ‘harness the external support and a success culture, bringing innovative and\nstronger leadership’ (2.5) and which will, if necessary, lead to taking over the\nrunning of local failing schools. The overall approach to reform in 2005 was\nperhaps best summarised by the phrase ‘to expand choice, create real diversity of\nprovision, and to ensure that the benefits of choice are available to all’ (s.1.29).\nThere was a clear continuity with Conservative policy, with choice being linked\nto diversity and then back to choice again, something of a circular argument with\nno clear notion of how improvements were meant to occur in practice.\nIn healthcare, 2000 saw the publication of the NHS Plan (Secretary of State\nfor Health, 2000). The document reminded patients that they had ‘the right to\nchoose a GP’ (10.5) and that ‘to make an informed choice of GP, a wider range\nof information about GP practices will be published’ (10.5). As in 1989, this was\na principal-agent approach in which patients chose GPs and GPs chose care on\nbehalf of their patients.\nPatients were given new choices about the way they accessed health services:\nthey were ‘to have choice emailing or phoning their practice for advice and\nbooking appointments online’ (1.11) and the right to ‘treatment at a time and\nhospital of the patient’s choice’ (10.20) if their scheduled operation was cancelled.\nThe idea of responding to the ‘individual’ patient was ubiquitous in the NHS\nPlan: ‘today successful services thrive on their ability to respond to the individual\nneeds of their customers’ (2.12). There was a drive to improve the complaints\nprocedures in which ‘the government will act to reform the complaints procedure\nto make it more independent and responsive to patients’ (10.21), giving patients\nnot only the right to be heard in their interactions with health professionals, but\na reassertion of the right to complain if they were not.\nBy 2006 (Department of Health, 2006), choice mechanisms were extended\nfurther – it was not GPs but patients that made decisions about where they should\nbe treated: ‘In the NHS, patients now have more choice of the hospital that they\ngo to, with resources following their preferences . . . driving down maximum\nwaiting times’ (s.3). As in education, choice was to be supported where necessary:\n‘Individuals, their families and other carers need to understand the services that\nare available in order to make good choices, and they need to receive maximum\nsupport in obtaining their chosen service – wherever it is provided’ (8.42).\nGPs found themselves in new roles as patient choice was extended. Practices\nwere to ‘redesign care pathways to match patients’ needs and wishes’ (6.8) with\nthe relationship between GPs presented as a competitive one: ‘To ensure that\nthere are real choices for people, we will introduce incentives to GP practices to\nhttp:\/\/journals.cambridge.org Downloaded: 24 Mar 2010 IP address: 129.234.252.67\nevolution of choice policies in uk housing, education and health policy 75\noffer opening times and convenient appointments which respond to the needs\nof patients in their area’ (1.9). Finally, healthier choices in lifestyle and food\ncontinued to be emphasised for individuals: ‘We will introduce a new NHS ‘Life\nCheck’ for people to assess their lifestyle risks and to take the right steps to make\nhealthier choices. This will be a personalised service in two parts’ (s.14).\nAcross the three policy areas, there were strong continuities between Labour\nand Conservative policy, with Labour’s most distinctive difference being their\nconcern to address inequalities, such as extending the Right to Buy to same-sex\ncouples. Choice was to be supported where individuals were unable to decide for\nthemselves, and the private sector used to secure funding for public providers (in\nhousing, education and healthcare) or to create competition (in healthcare). After\n2000, Labour’s policy became noticeably more radical than their Conservative\npredecessors’: allowing private organisations to oversee social housing, creating\nTrust Schools with additional freedoms to work outside of local authority control\nand attempting to put choice in the hands of patients rather than doctors.\nConclusion\nThe three services examined here have different histories in terms of their use\nof choice in policy. In housing, choice was something available only to private\nhouse purchasers at the end of the war, with subsequent policy attempting to get\nlocal authorities to develop a private rental market to offer tenants choices. The\n1960s appear to see a removal of user choice, and a focus on planning instead,\nwith the Right to Buy explicitly rejected by the Labour government of the late\n1970s, but becoming one of the Thatcher government’s most celebrated reforms\nof the 1980s, remaining firmly in place since. Social housing tenants have been\ngiven additional choices in terms of the way their estates are managed, and the\nprivate sector has been increasingly used as a means of repairing infrastructure\nand building new homes. Governments of the 1980s, 1990s and 2000s advocate\nchoice in either private or public housing because of the increased personal\nresponsibility it is thought to bring.\nIn education, parental choice has been present in policy throughout the\npost-war period. Initially it was choice between modern, grammar and technical\nschools, but the choice between public and private provision in education\nhas been emphasised since the 1980s. In that decade, curriculum choices were\nrestricted because of concerns that career-limiting choices were being made by\nstudents. In the 2000s, parents are encouraged to be active participants and drive\nchoice agendas where local authorities are perceived to be slow in acting on\nthem. Choice has been linked strongly to diversity since the 1990s, with a greater\ndiversity of school providers allowing increased parent choice, but choice also\ndriving greater diversity of provision. It is unclear from policy documents how a\ngreater diversity of providers is meant to drive up school standards, but the link\nhttp:\/\/journals.cambridge.org Downloaded: 24 Mar 2010 IP address: 129.234.252.67\n76 ian greener and martin powell\nFigure 1. Choice goals in housing, education and health\nbetween choice and diversity (rather than the more obvious one of choice and\nschool improvement or responsiveness) is made repeatedly.\nIn healthcare, there has been a movement from associational choice to\ntransactional choice of GP: a change from patients making a choice of the family\ndoctor they wish to treat them for the foreseeable future, to a situation where\npatients are encouraged to change GP practice if they find services not up to the\nstandards they demand. Choices of secondary care were to be made by GPs in the\n1980s, but have increasingly been moved into patients’ hands since then. As such,\nhealthcare is the area that comes closest to treating users as sovereign ‘queens’, in\nLe Grand’s terms. However, patients are often unaware of available information\nsources regarding care choices (Greener, 2005), and the first patient information\nbooklets offered little more than the availability of transport links and the trust’s\noverall healthcare commission rating (Easington Primary Care Trust, 2006).\nIndeed, it is still contested whether patients actually want healthcare choices at\nall (Fotaki et al., 2005).\nThere appear to be three separate goals linked to choice reforms in the\nservices examined here. In housing, choice is linked to the public taking greater\nresponsibility; in education, it is linked to a diversity of provision; and in\nhealthcare, it is linked to the goal of improved responsiveness. These differences\nare shown in Figure 1.\nhttp:\/\/journals.cambridge.org Downloaded: 24 Mar 2010 IP address: 129.234.252.67\nevolution of choice policies in uk housing, education and health policy 77\nIn housing, most recent policy attempts to give social housing users the same\nresponsibilities as private owners. This is a stakeholder-type model of choice in\nwhich individuals improve their communities through taking pride in their\nhomes. Homes are the primary assets of families, passed down through genera-\ntions and forming the bedrock of support and wealth available to them. Policy\nattempts to extend these ideas to social housing and to private tenants by trying\nto get the public to engage in the Right to Manage or the Right to Buy, while at the\nsame time outright ownership is still preferred. In housing, choice is linked to re-\nsponsibility, and to the public becoming stakeholders in their local communities.\nIn education, choice is meant to lead to education providers becoming more\ndiverse, which in turn is meant to lead to greater choice. This argument appears\ncircular, with choice creating diversity, and diversity creating choice, with the\nrather counter-intuitive suggestion that parents choose schools on the basis of\ntheir type rather than on the basis of their exam results or OFSTED reports.\nChoice is linked to diversity in an attempt to proliferate the range and type of\nschool providers available for parents. The focus on diversity is often presented as\nan end in itself, with only a tenuous link to either improved standards or increased\nresponsiveness, and then it unclear as to whether an increase in responsiveness\nwould be geared towards students, parents or to the needs of the economy. That\ndiversity is seen as an end to itself and can be contrasted to the situation in\nScotland where parents do not often even request a particular school for their\nchildren to attend. In the words of one commentator\nsouth of the border has grown much more diverse over the past 20 years. England has a dizzying\nvariety of secondary schools in addition to community comprehensives and faith schools.\nThese include: foundation schools, CTCs, academies, specialist schools, grammar schools and,\nshortly, trust schools. Scotland has none of this variety. (Baker, 2007)\nThe question of how a diversity of providers is meant to improve standards is\nleft open, and persists despite government claims that education represents the\nparadigm example of where extending user choice has worked (Minister of State\nfor Department of Health et al., 2005).\nStudents have been presented as unable to make the right educational choices\nfor themselves, and the National Curriculum was introduced to try to make sure\nthat they study the right subjects. Students are viewed as flawed consumers,\nunable to make choices about their courses because of the fear that they might\njeopardise their future as a result. Parents are positioned as choosers of schools,\nbut also lobbyists for improvements in local provision.\nIn healthcare choice is directly linked to improving responsiveness for\nlocal healthcare providers, challenging professionals to treat patients more as\nconsumers, and expecting patients to choose the best providers of care. Resources\nare meant to follow patient choices, with the best providers thriving when\nchosen. Choice is linked to greater provider responsiveness, with competition\nbetween providers who differentiate themselves on the grounds of quality of\nhttp:\/\/journals.cambridge.org Downloaded: 24 Mar 2010 IP address: 129.234.252.67\n78 ian greener and martin powell\ncare offered rather than the nature of standardised service offered. The evidence-\nbased medicine movement attempts to standardise treatment so that it conforms\nas much as possible to what the ‘gold standard’ of randomised-controlled trials\nsuggests is best for the patients’ treatment on average (Muir Gray, 1996). There\nis potential for treatment to become more diverse with the introduction of\ncomplementary and alternative therapies, as suggested in recent public health\ndocuments (for example, Department of Health, 2006), but in healthcare choice\nappears to be about attempting to increase the responsiveness of providers of\npredominantly standardised services.\nResponsiveness in healthcare is important in two ways. First, responsive\nservices are those that treat patients in a timely fashion. This is clearly important\nwhere patients are enduring real suffering and have to wait for care. The most\nvisible targets within the NHS for a number of years have been waiting lists. The\nsecond type of responsiveness is in terms of the care offered by NHS providers,\nwith the government’s agenda to challenge clinicians to become more user-\ncentric. This suggests a model of patients as consumers, with patients active\nchoosers of their care and driving reform through their choices.\nThe healthcare market is in many respects the opposite of the one found\nin education, with providers offering effectively standardised services, whereas\nin education diversity of provision is meant to be the driver of choice in the\nmarketplace. Equally, whereas in healthcare patients are generally unaware of\nthe availability of information that might assist their choices, in education\nstandardised information about school performance is relatively easy to obtain\n(Greener, 2003). Healthcare, of the three cases examined here, most closely\nresembles the economy theory of the market, being based on organising providers\ninto competitive relationships with one another, and attracting patients by\noffering responsive care.\nHowever, many patients do not know how to access available information or\nhave the expertise to be able to choose rationally between providers. In the words\nof one of the Witness Seminar participants (who worked in both New Labour\nand Conservative governments):\nOne could not, as others have said, trust the patients or the public. They did not have the\nknowledge. They did not have the information to make direct choices themselves. (Witness\nSeminar, 2006: 40)\nParents, in contrast, seem able to choose between schools on the basis of infor-\nmation about exam results and OFSTED reports, but in policy documents choice\nis linked not to results but to school diversity. In healthcare, choice is flawed\nby patients lacking the expertise to make choices between care providers who\noffer a standardised treatment, whereas in education parents may have the\nexpertise to make choices between schools, but schools are meant to be achieving\nimprovement not through improved responsiveness but through diversity of\nprovision instead.\nhttp:\/\/journals.cambridge.org Downloaded: 24 Mar 2010 IP address: 129.234.252.67\nevolution of choice policies in uk housing, education and health policy 79\nTABLE 1. Emergent models of choice in housing, education and health\nArea Choice linked to User is Market characteristics\nHousing Responsibility\nthrough ownership\nor local active\ntenant involvement\nStakeholder Individual\/family\nownership or right\nto manage\nEducation Diversity of provider Parents as chooser\nand lobbyist\nStudents as flawed\nconsumer\nInformation driven –\nExam results,\nOFSTED reports\nHealthcare Responsiveness\nbased on\nA – time (waiting lists)\nB – Produce\nresponsiveness\nConsumer – but lacking\nability to choose\nSimilar service offerings\nTime and quality\ndifferentiation\nTable 1 summarises these three emergent models of choice arising from the\nanalysis above.\nThe positioning of users in these services is far more subtle than Le Grand’s\ntypology, of public service users being either pawns or queens, and suggests that\nan analysis of user positions in public policy must make use of a wider range of\nthe possible roles they are required to occupy. It also seems that policy-makers\noften do not appear to realise that choice policies in areas of welfare reform are\nvery different from one another, both in terms of the mechanisms they utilise,\nand the goals they are trying to achieve. At worst, this creates the possibility of\nthoughtless attempts at transfer between policy areas: the extension of choice\nin healthcare, for example, is often suggested because of its perceived success in\neducation. There is also the second danger that choice policies are presented as\nbeing uniform in nature and in goals (Minister of State for Department of Health\net al., 2005), when they appear, on more careful analysis, to be very different.\nAcknowledgements\nThanks to the anonymous reviewers for their suggestions on how this paper might be improved,\nand to the ESRC for funding the empirical work within it under a grant funded through the\n‘Cultures of Consumption’ programme.\nNote\n1 The use of an electronic corpus means that references to policy documents will be given in\nterms of either the name or the number of the nearest heading rather than the page number\nof the original.\nReferences\n6, P. (2003), ‘Giving consumers of British public services more choice: what can be learned from\nrecent history?’, Journal of Social Policy, 32: 2, 239–70.\nhttp:\/\/journals.cambridge.org Downloaded: 24 Mar 2010 IP address: 129.234.252.67\n80 ian greener and martin powell\nBaker, M. (2007), ‘The problem with school “choice”’, BBC News, http:\/\/news.bbc.co.uk\/\n1\/hi\/education\/6413811.stm, accessed 15 May 2008.\nBarber, M. (2007), Instruction to Deliver: Tony Blair, the Public Services and the Challenge of\nAchieving Targets, London: Portoco’s Publishing.\nChitty, C. (2004), Education Policy in Britain, Basingstoke: Palgrave Macmillan.\nClarke, J. and Newman, J. (1997), The Managerial State, London: Sage.\nClarke, J., Newman, J., Smith, N., Vidler, E. and Westmarland, L. (2007), Creating Citizen-\nConsumers: Changing Publics and Changing Public Services, London: Paul Chapman\nPublishing.\nDeacon, A. and Mann, K. (1999), ‘Agency, modernity and social policy’, Journal of Social Policy,\n28: 3, 413–35.\nDepartment for Education (1992), Choice and Diversity: A New Framework for Schools, Cmnd\n2021, London: HMSO.\nDepartment for Education and Employment (1996), Self-Government for Schools, London:\nHMSO.\nDepartment for Education and Employment (1997), Excellence in Schools, London: HMSO.\nDepartment for Education and Skills (1965), The Organisation of Secondary Education (Circular\n10\/65), London: HMSO.\nDepartment for Education and Skills (1977), Education in Schools: A Consultative Document,\nLondon: HMSO.\nDepartment for Education and Skills (1985), Better Schools, Cmnd 9469, London: HMSO.\nDepartment for Education and Skills (2001), Schools – Achieving Success, London: HMSO.\nDepartment for Education and Skills (2005), Higher Standards, Better Schools for All, London:\nHMSO.\nDepartment of Health and Social Security (1983), NHS Management Inquiry, London: HMSO.\nDepartment of Health (2006), Our Health, Our Care, Our Say, Cmnd 6737, London: HMSO.\nDepartment of the Environment (1971), A Fair Deal for Housing, Cmnd 4728, London: HMSO.\nDepartment of the Environment (1977), Housing Policy – a Consultative Document, Cmnd 6851,\nLondon: HMSO.\nDepartment of the Environment (1987), Housing – the Government’s Proposals, Cmnd 214,\nLondon: HMSO.\nDepartment of the Environment (1995), Our Future Homes: Opportunity, Choice, Responsibility,\nCmnd 2901, London: HMSO.\nDepartment of the Environment Transport and the Regions (2000), Quality and Choice:\nA Decent Home for All, London: HMSO.\nEasington Primary Care Trust (2006),Choosing your Hospital, Peterlee: Easington Primary Care\nTrust.\nFotaki, M., Boyd, A., Smith, L., McDonald, R., Roland, M., Sheaff, R., Edwards, A. and Elwyn,\nG. (2005), ‘Patient choice and the organization and delivery of health services: scoping\nreview’, London: NCCSDO.\nGreener, I. (2002), ‘Agency, social theory and social policy’,Critical Social Policy, 22: 73, 688–706.\nGreener, I. (2003), ‘Patient choice in the NHS: the view from economic sociology’, Social Theory\nand Health, 1: 1, 72–89.\nGreener, I. (2004), ‘The three moments of New Labour’s health policy discourse’, Policy and\nPolitics, 32: 3, 303–16.\nGreener, I. (2005), ‘The role of the patient in healthcare reform: customer, consumer or\ncreator?’, in S. Dawson and C. Sausmann (eds.), Future Health Organisations and Systems,\nBasingstoke: Palgrave.\nHoggett, P. (2001), ‘Agency, rationality and social policy’, Journal of Social Policy, 30: 1, 37–\n56.\nJordan, B. (2005), ‘Public services and the service economy: individualism and the choice\nagenda’, Journal of Social Policy, 35: 1, 143– 62.\nLe Grand, J. (1997), ‘Knights, knaves or pawns? Human behaviour and social policy’, Journal of\nSocial Policy, 26: 2, 149–69.\nhttp:\/\/journals.cambridge.org Downloaded: 24 Mar 2010 IP address: 129.234.252.67\nevolution of choice policies in uk housing, education and health policy 81\nLe Grand, J. (2003),Motivation, Agency and Public Policy: Of Knights, Knaves, Pawns andQueens,\nOxford: Oxford University Press.\nLe Grand, J. (2007), The Other Invisible Hand, Woodstock: Princeton University Press.\nLe Grand, J., Mays, N. and Mulligan, J. (1998), Learning from the NHS Internal Market, London:\nKings Fund.\nMcAteer, M. (2005), ‘The government’s choice agenda’, Consumer Policy Review, 15: 3, 79–84\nMinister of Health (1962), A Hospital Plan for England and Wales, Cmd 1604, London: HMSO.\nMinister of State for Department of Health, Minister of State for Local and Regional Government\nand Minister of State for School Standards (2005), The Case for User Choice in Public\nServices, London: HMSO.\nMinistry for Reconstruction (1943), Education Reconstruction, Cmnd 6458, London: HMSO.\nMinistry for Reconstruction (1945), Housing, Cmnd 6609, London: HMSO.\nMinistry of Education (1958), Secondary Education for All, Cmnd 604, London: HMSO.\nMinistry of Health (1944), A National Health Service, London: HMSO.\nMinistry of Housing and Local Government (1953), Houses: the Next Step, Cmnd 8996, London:\nHMSO.\nMinistry of Housing and Local Government (1963), Housing, Cmnd 2050, London: HMSO.\nMinistry of Housing and Local Government (1965), The Housing Program 1965–1970, Cmnd\n2838, London: HMSO.\nMuir Gray, J. (1996), Evidence-based Health Care, New York: Churchill Livingstone.\nNewman, J. and Vidler, E. (2006), ‘Discriminating customers, responsible patients, empowered\nusers: consumerism and modernisation of health care’, Journal of Social Policy, 35: 2,\n193–209\nPaige, R. (2007), Revisiting the Welfare State, Maidenhead: Open University Press.\nPemberton, H. (2000), ‘Policy networks and policy learning: UK economic policy in the 1960s\nand 1970s’, Public Administration, 78: 4, 771–92.\nSecretary of State for Education and Science (1972), Education: A Framework for Expansion,\nCmnd 5174, London: HMSO.\nSecretary of State for Health and Social Services (1972), The National Health Service\nReorganisation: England, London: HMSO.\nSecretary of State for Health (1989), Working for Patients, London: HMSO.\nSecretary of State for Health (1996), The NHS: A Service with Ambitions, London: HMSO.\nSecretary of State for Health (1997), The New NHS: Modern, Dependable, London: HMSO.\nSecretary of State for Health (2000), The NHS Plan: A Plan for Investment, A Plan for Reform,\nLondon: HMSO.\nStock Options Appraisal Executive Group (2004), Decent Homes for All, Romford: CLS.\nThatcher, M. (1993), The Downing Street Years, London: Harper Collins.\nWainwright, D. (1998), ‘Disenchantment, ambivalence and the precautionary principle: the\nbecalming of British health policy’, International Journal of Health Services, 28: 3, 407–26\nWebster, C. (1994), ‘Conservatives and consensus: the politics of the National Health Service\n1951–64’, in A. Oakley and S. Williams (eds.), The Politics of the Welfare State, London:\nUniversity College Press.\nWitness Seminar (2006), Consumerism and Choice in the Conservative Internal Market 1987–\n1992 (draft transcript), University of London: Institute for Historical Research.\n"}