{"doi":"10.3366\/3594052","coreId":"102209","oai":"oai:epubs.surrey.ac.uk:1660","identifiers":["oai:epubs.surrey.ac.uk:1660","10.3366\/3594052"],"title":"Through a Glass Darkly: The Many Sides of Paul Taylor's Choreography","authors":["Kane, Angela"],"enrichments":{"references":[],"documentType":{"type":0.7777777778}},"contributors":[],"datePublished":"2003-01-01","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1660<\/identifier><datestamp>\n      2017-10-31T14:02:41Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6172747368756D616E736369656E636573:7363686F6F6C5F61727473:64616E6365<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1660\/<\/dc:relation><dc:title>\n        Through a Glass Darkly: The Many Sides of Paul Taylor's Choreography<\/dc:title><dc:creator>\n        Kane, Angela<\/dc:creator><dc:date>\n        2003-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1660\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Kane, Angela  (2003) Through a Glass Darkly: The Many Sides of Paul Taylor's Choreography   Dance Research, 21 (2).  pp. 90-129.      <\/dc:identifier><dc:relation>\n        10.3366\/3594052<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1660\/","10.3366\/3594052"],"year":2003,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Through a Glass Darkly: The Many Sides of Paul Taylor's Choreography\nAuthor(s): Angela Kane\nSource: Dance Research: The Journal of the Society for Dance Research, Vol. 21, No. 2\n(Winter, 2003), pp. 90-129\nPublished by: Edinburgh University Press\nStable URL: http:\/\/www.jstor.org\/stable\/3594052\nAccessed: 04\/12\/2008 04:57\nYour use of the JSTOR archive indicates your acceptance of JSTOR's Terms and Conditions of Use, available at\nhttp:\/\/www.jstor.org\/page\/info\/about\/policies\/terms.jsp. JSTOR's Terms and Conditions of Use provides, in part, that unless\nyou have obtained prior permission, you may not download an entire issue of a journal or multiple copies of articles, and you\nmay use content in the JSTOR archive only for your personal, non-commercial use.\nPlease contact the publisher regarding any further use of this work. Publisher contact information may be obtained at\nhttp:\/\/www.jstor.org\/action\/showPublisher?publisherCode=eup.\nEach copy of any part of a JSTOR transmission must contain the same copyright notice that appears on the screen or printed\npage of such transmission.\nJSTOR is a not-for-profit organization founded in 1995 to build trusted digital archives for scholarship. We work with the\nscholarly community to preserve their work and the materials they rely upon, and to build a common research platform that\npromotes the discovery and use of these resources. For more information about JSTOR, please contact support@jstor.org.\nEdinburgh University Press is collaborating with JSTOR to digitize, preserve and extend access to Dance\nResearch: The Journal of the Society for Dance Research.\nhttp:\/\/www.jstor.org\nTHROUGH A GLASS DARKLY: \nTHE MANY SIDES OF PAUL TAYLOR'S \nCHOREOGRAPHY \nAngela Kane \nThe excitement and intrigue of working with primary dance \nresources was first revealed to me when Clement Crisp hired me \nto undertake archive research for his co-authored book, London \nContemporary Dance Theatre: The First 21 Years (with Mary Clarke) \nduring the late- 1980s. Previously, I had been inspired by his dance \nhistory classes at the Laban Centre and it was through his \nencouragement that I began to write for The Dancing Times and \nother periodicals. This secondJubilee issue, celebrating 50 years of \nClement's writing, is a fitting occasion for me to acknowledge his \nsupport and enthusiasm over the years. Dance's supreme word- \nsmith, wit and bon vivant, it was through his not-too-subtle prodding \nduring the early 1990s that I came to pursue doctoral research into \nPaul Taylor's choreography. One of the main aims of my thesis was \nto challenge the over-simplistic classification of Taylor's work into \n'light' and\/or 'dark' categories and, through analysis of different \nstructural and thematic forms, to propose instead an alternative \nand more open approach to reading Taylor's dances. What follows \nis a revised version of the penultimate chapter of my doctoral \nthesis. Thank you, Clement: but for whom ...! \nI would also like to thank Taylor company dancer, Orion \nDuckstein, for allowing me to use photographs from his personal \ncollection to accompany this article and to Terence Kane for his \ntechnical help with all things photographic. \nOne of the oldest and most popular dances in Paul Taylor's current \nrepertory is Aureole (1962). It was the success of this plotless, lyrical \nwork at the 1962 American Dance Festival and soon after in New \nYork which persuaded Taylor to focus exclusively on his own \nchoreography and his own group of dancers.' Aureole was also the \nfirst of his works to be re-staged, initially by the Royal Danish \nBallet in 1968 and by scores of ballet and modern dance com- \n90 \nTHROUGH A GLASS DARKLY \npanies thereafter. However, the impact of Aureole on Taylor's \nsubsequent career has tended to overshadow other important \nworks created during the 1960s - the majority of which no longer \nsurvive in repertory - and it has led to certain misconceptions \nabout the range and sequencing of his dances. \nIt was undoubtedly the thematic, structural and dynamic con- \ntrasts between Aureole and Taylor's next American Dance Festival \ncommission, Scudorama (1963), which prompted some writers to \nidentify an alternating light\/dark choreographic sequence. \nArguably, Taylor himself initiated such a polarity when he decided \nto make Scudorama 'as dark as Aureole is sunny, fragmented rather \nthan integrated'.3 Importantly though, he has also identified a \nthird type of dance work within his one hundred-plus corpus: \nI categorize my dances as pretty ones and ugly ones. ... Then there's an \nin-between category ... works that are just funny.4 \nPiece Period, first performed in November 1962, established \nTaylor's 'in-between' category, both chronologically and themati- \ncally, and it confirms that he was creating different types of dances \n- and not simply alternating between light and dark themes - \nas early as 1962-3. In contrast to Aureole's formal lyricism and \nScudorama's dramatic, disturbing scenes, Piece Period was described \nat its premiere as 'a delicious lampoon'5 and 'a spoof'.6 Moreover, \nsuch choreographic diversity was recognised at the time. In \nreference to the sequence of works spanning Junction (1961), Aureole, \nPiece Period and Scudorama, Allan Hughes noted that, \nWithin a year, [Taylor] has created four pieces that are almost as unlike each \nother - outwardly- as they are from his previous works.7 \nI would argue that while Aureole can be seen as a turning-point \nin terms of Taylor's subsequent career, many of its dance-music \nideas had been initiated in Junction the previous year - which, like \nAureole, was choreographed to a compilation of Baroque music. \nNevertheless, it is important to acknowledge Hughes as one of \nthe first writers to distinguish between different types of Taylor \nchoreography. \nIn order to demonstrate just how wide-ranging Taylor's 1960s \nchoreography was, Aureole, Piece Period and Scudorama will be dis- \ncussed separately, as three different types of dance work. A more \nrecent work, Roses (1985), will then be analysed in order to show \n91 \nDANCE RESEARCH \nhow Taylor went on to create other types of dances later in his \ncareer. Discussion of each of these four works will also propose \nthem as contrasting prototypes for four different strands of \nchoreographic development. Respectively: Aureole established \nTaylor's plotless, lyrical style; Piece Period consolidated his \nhumorous style - which had been initiated in Three Epitaphs as early \nas 1956; and Scudorama was a further development from Insects and \nHeroes (1961) in terms of what Taylor has described as his 'non- \nstory stories'.8 Scudorama confirmed his interest in probing difficult \nsubject matter - most particularly amoral behaviour and social \nmalaise - through non-linear, often multi-layered, narratives. Roses \nestablished another prototype much later in Taylor's career, that is, \nit represented his first truly romantic work.9 In the same way that \nhis Americana works can be distinguished from the 'non-story \nstories' of Scudorama nd its successors - not only by their specifi- \ncally American subject matter, but also through their contrasting \ntreatment of themes and characters - Roses suggests a different \nkind of optimism and order than Aureole and, thus, it constitutes a \ndifferent type of antithesis, both stylistically and philosophically, to \nScudorama. \nTwo crucial disclaimers are necessary. First, because Taylor's chor- \neography is so diverse, any categorisation of it can only be made \naccording to certain types of works and\/or certain patterns of \nprogression. It is impossible to pigeon-hole either his style overall \nor any one of his dances because his choreography presents \nmultiple possibilities - sometimes even within a single work. \nSignificantly, as early as 1966, Taylor attempted to combine ideas \nfrom four types of dances - that is, from Aureole, Piece Period, \nScudorama nd From Sea to Shining Sea - in the hour-long work, Orbs, \nand thereby further confounded any simple classification of his \nwork into dark and\/or light categories. It follows, therefore, that \nwhile it is possible to identify key characteristics which distinguish \nparticular prototypes from one another, such characteristics are \nnot always exclusive to subsequent works created within each \nchoreographic strand. \nSecondly, the notion of four prototype works - Aureole, Piece \nPeriod, Scudorama, and Roses - spawning four strands of choreo- \ngraphic development is neither exhaustive nor finite. Similarly, \nthe range of dance examples used in this article to illustrate certain \n92 \nTHROUGH A GLASS DARKLY \npoints is representative rather than comprehensive. The four \ncategories focus specifically on Taylor's choice and treatment of \nsubject matter and even this singular approach lends itself to a \nconsideration of other categories or sub-categories. For example, \nan idea I have developed elsewhere is the use of ritual in several of \nTaylor's works'? and another categorisation could be based upon \nhis use of social dance in works such as Piece Period, Company B \n(1991) and Piazzolla Caldera (1997). Other choreographic features \ncould also form the basis for categorisation, for example, Taylor's \nrecurrent movement preferences; his choice and treatment of \nmusic- an obvious sub-group here would be his extended series \nof works to Baroque music; or his association with particular \ndesigners. As Robert Greskovic proposes, \nOne way to sort out the dances of Paul Taylor is to group them according to \ninitial motivation - to where they begin. One group could be made of works \nthat come out of an intent to create a particular image. Another, out of, or \naround if you will, decor specifications. Yet another comes, seemingly, directly \nfrom the chosen piece of music.\" \nA more recent classification should also be identified at this \npoint, partly because it makes reference to some of the same works \nconsidered in the four strands below and also to highlight the \npotential for overlap in any categorisation of Taylor's chor- \neography. In his review of Spindrift (1993), Bruce Fleming proposed \nfour types of Taylor work, ranging from Column A: 'the pretty \nones'; Column B: 'the ugly works'; Column C: 'the witty ones' and \nColumn D: 'the movement-premise ones'.l2 While most of the \ndance examples cited by Fleming in Columns A, B and C corre- \nspond with those considered in the first three categories below, \nthere are significant differences. For example, he includes Roses \nalongside Aureole, Airs (1978), Arden Court (1981), Esplanade (1975) \nand Mercuric Tidings (1982) in Column A; in Column B, he places \nBig Bertha (1970) and Speaking in Tongues (1988) alongside Last Look \n(1985), thus overlooking a distinctive Americana group of works \nin Taylor's corpus; and in his 'movement-premise' column, he \nincludes Images (1977) - which will be considered below within \nTaylor's plotless, lyrical category- and Snow White (1983) which is \ndriven more by Taylor's perverse story-telling and characterisation \nthan by particular movement concerns. \nIn reference to Spindrift specifically, Fleming does acknowledge \n93 \nDANCE RESEARCH \nthe difficulty in classifying Taylor's choreography because many of \nhis works manifest contrasting elements: \nPart of Spindrift is a movement-premise work ... Spindrift is also a witty (Column \nC) work. It is, furthermore, at times an ugly work ... as well as a pretty one.' \nHowever, I would question Fleming's view that Spindrift 'primarily \nbelongs in Column B'14, that is, his 'ugly' category. As the following \ndiscussion aims to prove, there are important thematic, movement \nand musical parallels between Spindrift and both Aureole and Airs, \nthereby aligning it most closely to Taylor's 'A' trilogy. \nI. THE 'A5 TRILOGY AND BEYOND \nAlthough Aureole was considered atypical at its premiere in 1962,15 \nin retrospect it can be seen as the prototype for a series of plotless, \nlyrical works in which the intrinsic nature of the dance medium is \nboth the subject and substance of Taylor's choreography. Works in \nthis category are characterised by a close contrapuntal relationship \nbetween dance and accompaniment. Almost all of them use pre- \ntwentieth century music and a majority are choreographed to \nBaroque music. Significantly, Taylor's highly successful A' trilogy \nuses music by Handel (Aureole and Airs) and Boyce (Arden Court), \nand three more recent works, Brandenburgs (1988), Cascade (1999) \nand Promethean Fire (2002) are set to music byJ. S. Bach. In all of \nthese, Taylor has discerned not only the general style and mood of \nthe Baroque genre but also many of its rhythmic patterns, melodic \nlines and complex textures. Spatial patterns and groupings match \nthe sweep and weave of the music. The dancers' movements and \ninter-relationships echo its celebratory nature - including cadenza \ndisplays of technical skill which is another characteristic of this \nmusical genre. (Another recurrent trait is that in Aureole, Airs and \nCascade, the music is scored for solo instruments set against a ripieno \norchestra.) \nEven though Taylor cannot read a music score, his choreography \ncorresponds closely with the formal structure of his accompani- \nment. As Clive Barnes claimed when comparing Taylor to other \nchoreographers: \n... few, if any, are so adept at what might be called dance orchestration - that \nperfect blending of dance with music so that the dance not merely reflects the \nmusic's moods and catches its rhythms, but actually mirrors its very structure. ' \n94 \nTHROUGH A GLASS DARKLY \nA clue to Taylor's acute aural response can be discerned in his \nchoice and sectioning of music. Significantly, although he follows \nthe general shape of Baroque music - that is, clearly delineated \nand symmetrically ordered sections in contrasting tempi and \ntextures - his accompaniment is actually an arrangement of music \nfrom unrelated scores.'7 In Aureole, he mixes two concerti grossi \nwith two sections of Handel's oratorio, Jephtha; in Airs, he sets \nsections of four different concerti grossi alongside three of Handel's \noperas and the oratorio, Solomon;'8 Arden Court uses sections from \nfive symphonies by Boyce; and both Cascade and Promethean Fire \ncombine sections from three different compositions byJ. S. Bach.'9 \nTaylor's ability to match the dominant key and instrumentation \nof one musical section to another without the aid of a score is \nuncanny. No music purist would attempt such 'boxing and coxing' \nbut I believe that he has approached these hallowed scores in such \na daring way most probably because of his lack of formal training. \nWhereas Taylor's contrasting series of 'dark', dramatic works \nhave tended to generate their own unique dance vocabulary and \nstructures, works in this plotless, lyrical category manifest similar \nmovement concerns. Thus, they not only constitute a significant \nstrand of development in terms of his choice and treatment of \nformalist subject matter; they also represent the most continuous \nseries of works through which key elements of the 'Taylor style' can \nbe discerned. Importantly, many of Taylor's signature movements \nwere first codified in Aureole and they recur in subsequent works in \nthis category. For example, his characteristic contraction and \nspiral, 'C', 'V' and 'wrap' arms and 'overhead switches' are evident \nacross his entire series of works to Baroque music; as are particular \nsteps such as the 'piddly-poops', the 'pump step' and a low, skim- \nming travelling step which is simply known as the Aureole run'.20 \nImportantly, too, these works are all characterised by a sinuous, \nsuccessive use of the torso. The initiation of movement comes from \ndeep in the pelvis, emanates up through the spine and shoulders, \nand out into the arms - unlike the separate, shuddering torso \nmovements and stiff limbs in works such as Dust (1977), Last Look \n(1985) and The Word (1998). Former dancer Victoria Uris describes \nTaylor's successive use of the torso as 'being iron from the hips \ndown and willow from the waist up'2' while Cathy McCann \ndescribes it as moving 'from deep in your core'.22 When explaining \nhow Taylor dancers execute these same torso-arm movements in \n95 \nDANCE RESEARCH \nturns, Christopher Gillis says, 'your body becomes like the helm of \na ship, your arms following in tow like seaweed'.23 \nAt its premiere, Aureole was described as a 'white ballet' 24 and as \n'almost a Les Sylphides 1962' 25 because of its formalist choreography \nand simple design. However, as DeborahJowitt argues, \nA piece like Aureole may be formal, serene, musical, like the best sort of ballet, \nbut it's couched in Taylor's highly idiosyncratic style - with parallel feet, \nloosely swinging arms, jutting hips, scrunchings-in of the whole torso. The \nweight of the dancer is also peculiar to him; it's spongy, yet buoyant, the \ngestures like small banners or huge sails fluttering or billowing in response to \na gentle wind.2\" \nJowitt identifies a crucial difference in Taylor's use of body weight. \nSimilarly, former dancer Linda Kent, who has restaged Taylor's \nchoreography for other companies and as part of her work at the \nJuilliard School, distinguishes between classical ballet's continual \nquest for the vertical and Taylor's initiation of movement and \nrelationship to gravity as follows: \nI love to set Paul's works on ballet companies, but it's an incredible challenge, \nextremely draining. It has to do with the use of the torso and the use of the \nback to make the arms move. It's more movement from the inside out, the \nuse of weight going into the floor rather than rising from it or tippy-toeing \nacross it.27 \nWorking with rather than against gravity is a fundamental concept \nof all modern dance styles and, in Taylor's choreography, the \ndistribution and transference of body weight are crucial dis- \ntinguishing factors. His use of body symmetry and of plie ensure \na secure base for jumps and turns, and the contraction and under- \ncurve are important features both in movements sur place and \nduring travelling. \nThe contraction is seldom used as a dramatic statement in itself, \nunlike its highly expressive and connotative counterpart in Martha \nGraham's work. More often, it initiates a sustained, concave \nmovement of the whole torso, which is echoed by rounded and \ninwardly-rotated arms. (This is in marked contrast, in terms of \nboth contour and intent, to the use of the upper spine and arms - \nrotated outwardly with hyper-extended elbows and flexed wrists - \nin a Graham contraction.) \nSimilarly, in a majority of Taylor's choreography, the under- \ncurve functions simply as a transitional device28 but, in some of his \nplotless works, momentarily it becomes the main focus. It is seen \n96 \nTHROUGH A GLASS DARKLY \nin its most definitive form in the Fifth Movement of Airs, during \nthe opening section of the female double duet and again for two \nwomen in the 'Totem Birds' section of Images. In canon, one \nwoman in each pair in Airs and both women in unison in Images \nslide first into fourth position plie and then step through into \nfourth croise en releve. The plie is initiated by a soft torso contraction, \naccompanied by a deep sagittal rotation in the pelvis - that is, a \ncurving backwards and under- and the releve' is then initiated by \na release. In Taylor's choreography, the undercurve is most often \nperformed in the forward-backward plane but the 'little hip \ndance' )2 in the Third Movement of Aureole can also be seen as \nderivative. Here, a similar pendulum movement of the pelvis - this \ntime in the lateral plane - and deep demi-plie are used to initiate a \ntransfer of body weight from one foot to the other. \nTaylor identifies another crucial difference between his chor- \neography and that of classical ballet: 'people get lyricism and ballet \nmixed up together'.3? He identifies the problem as follows: \nIf you look at some of the steps, we might share the occasional saute, but [some \npeople] see it as ballet because of an overall lyrical feeling.3 \nTaylor's early explorations of 'scribbles',32 which found their full \nform in Junction, were an important precursor to the long, seam- \nless phrases which characterise his choreography - and most \nparticularly, the extended adagio sections in many of his plotless \nworks. However, Taylor's sense of flow differs markedly from \nthe evenly-metred phrasing of much classical ballet. Whereas \nthe latter constantly reaffirms certain codified positions, his \nchoreography requires legibility through space and time. An obvious \nexample of this is his solo in the Second Movement of Aureole. \nAlthough an extended adagio solo for a single male dancer was \natypical in 1962, this became a regular feature in several \nsubsequent works. Other solos for Taylor himself include those in \ntwo sections of 9 Dances With Music by Corelli (1965), solos in Orbs \nand a second 'earth father'33 role in Guests of May (1972). After he \nretired from performing, he created contrasting adagio solos for \ntwo women in Airs and extended male solos in Arden Court, Spindrift, \nCascade (which also has an entire section for a female soloist) and \nDandelion Wine (2000). Similarly, several of Taylor's plotless, lyrical \nworks contain extended adagio duets, as for example, his duet with \nElizabeth Walton in the Fourth Movement of Aureole, and other \n97 \nDANCE RESEARCH \nlimpid male-female duets in Airs (Seventh Movement), Arden Court \n(Sixth Movement) Mercuric Tidings (Second Movement), Cascade \n(Fifth Movement) and in the central section of Promethean Fire. \nIn all of Taylor's plotless works, allegro sections also require \na sense of on-going momentum - whether the movement is \nperformed sur place or travelling, the emphasis is on patterning \nthrough space rather than on 'peak' moments. In the Second \nMovement of Airs, for example, three male-female couples per- \nform a series of fast port de bras. Known as the 'semaphore section', \nthe dancers alternate between standing and kneeling while moving \ntheir arms through 1st, 5th and 2nd positions. Executed correctly, \nthis section should be a kaleidoscope of constantly changing whole \nbody patterns. However, because of the quick, bouncy tempo, \ndancers unfamiliar with Taylor's style tend to over-emphasise the \narms, striking and holding conventional ballet positions rather \nthan originating each movement through the torso and making \nrapid shifts of body weight. \nJean Nuchtern describes Taylor's long series of fast movements \nas 'like run-on sentences'34 and such clarity at speed is immediately \nevident in two of his most recent plotless works, Cascade and \nPromethean Fire. In the former, the curtain rises on five men grouped \nclosely together at centre stage. In unison, they perform a flourish \nof fast tilts, turns and floor-based movements to Bach's tripping \nkeyboard arpeggios. Although each of their movements is clearly \ndefined, they form one long, unbroken phrase which, in typical \nTaylor fashion, crosses several bars of music before coming to \na momentary pause. (Significantly, while echoing the shape and \nrhythmic detail of his accompaniment, Taylor tends to cross- \nphrase several bars of music rather than follow the structure of \nindividual lines- which is another key difference from much \nclassical ballet where both choreography and accompaniment re- \ngroup on the first beat, the downbeat, of each bar.35) Similarly, in \nthe opening and closing sections of Promethean Fire, the full force \nof all sixteen dancers running at break-neck speed in follow-the- \nleader lines and then criss-crossing within an inch of one another \nis both dizzyingly breathless and yet, spatially and musically, highly \nlegible. \nThe most remarkable aspect of Taylor's musicality is his struc- \ntural grasp of a wide range of musical styles. Other works in this \nfirst category include Mercuric Tidings and two works to twentieth \n98 \nTHROUGH A GLASS DARKLY \ncentury music, Polaris (1976) and Spindrift. Of the three, Mercuric \nTidings is the most closely related to Taylor's Baroque series in both \nits choreography and use of accompaniment. It is set to sections \nfrom Franz Schubert's first two symphonies, which were composed \nduring the early-nineteenth century and which built upon many of \nthe technical and structural developments of Baroque music and \nof eighteenth-century classicism. As Barnes suggested in his review \nof the premiere of Mercuric Tidings: \n... even if Schubert lovers might wince at the mayhem committed on the \ntruncated music, they must by the same token exult in the way that Taylor has \ncaptured the sheer exuberance of the youthful Schubert, and recognized how \nat times his style reached back in period beyond Beethoven to Haydn and even \nearlier.36 \nPolaris and Spindrift also derive their formalist choreography \nfrom their accompaniment - respectively, a commissioned score \nby Donald York and Arnold Schoenberg's String Quartet Concerto \n(1933). Indeed, these two works epitomise how Taylor's \nchoreography is not only influenced by his particular choice of \naccompaniment but also how some of his works in this first \ncategory, devoid of any literal or narrative theme, are also read in \na particular way. Taylor's aim in Polaris was two-fold: he wanted to \nshow how the positive and negative space of a proscenium arch \nstage is delineated by both dancers and design; and how individual \ndancers transpose movement through their different physiques \nand personalities. The defining spatial element is 'a kind of square \ncage made of metal piping'37 designed by Alex Katz; its five \ncardinal points - the centre and each of the four corners - being \nthe anchor points for the dancers' movements both in and outside \nthe cube. York's score is in two contrasting styles and Taylor \nuses two different casts of five dancers for each section. (Jennifer \nTipton's lighting is also different in each section.) While the music \nfor Part I is 'much lighter and more lyrical' than Part II, which is \n'more dynamic and heavier',38 the choreography in both sections \nis identical. However, through the dancers' individual technical \nnuances and their response to the contrasting accompaniments, \nthe two parts appear different. At its premiere, Barnes described \nPolaris as 'an experiment in focus' in which 'the very same dances \ntake on quite different shades of kinetic significance'.39 \nSpindrift, too, can be seen as a formalist work because of its \nemphasis on movement, musicality, complex spatial patterns \n99 \nDANCE RESEARCH \nand the dancers' on-stage relationships. Moreover, as suggested \npreviously when questioning Fleming's classification, Taylor's \nchoice of accompaniment for Spindrift connects it most closely \nto Aureole and Airs. Schoenberg's concerto was a re-working of \nHandel's Concerto Grosso, opus 6, number 7 and it was one of several \ntranscriptions of pre-twentieth century scores which the composer \nmade following his development of atonal music during the early \n1900s. The closest parallels, choreographically, in Spindrift are to \nAureole rather than Airs (although Taylor's references to whirlpools, \nbreaking waves, seaspray and marine life can also be seen as a \nwater-based alternative to his exploration of clouds, gusts and \ncurrents in Airs). Taylor revisits previous territory in Spindrift but, \nlike Schoenberg, he introduces a new twist to former ideas. In fact, \nhis initial idea for Spindrift was the exact opposite of that for Aureole. \nWhereas the earlier work had set out to explore how only five \ndancers could fill a proscenium arch stage through their space- \ndevouring travelling steps and numerous entrances and exits, \nTaylor's first idea for Spindrift was to keep the main protagonist \n(Andrew Asnes) on stage for the entire work.40 Also, in the same \nway that Schoenberg introduced dissonance into Handel's original \nmusic, Taylor modifies some key movements from Aureole through \nan atypically asymmetric body stance. An example of such dis- \ntortion is an oblique, one-handed version of the hands-on-hips \nmotif which had accompanied many of the travelling steps in both \nAureole and Airs. In Spindrift, it becomes a key motif in the opening \nLargo-Allegretto.41 It is used as a formal greeting between Asnes \nand two groups of dancers. Initially, their movements are con- \nversational, but as Schoenberg's orchestration starts to shift key \nabruptly, the soloist-group relationship begins to fracture, too. \n(Another prominent example of re-worked movements from \nAureole occurs in the Second Movement Largo where Asnes \nperforms the same forward developpes and promenades as Taylor \nhimself did in the Second Movement solo of Aureole. In contrast \nto the control and seamless adagio phrasing in the earlier work, \nmany of Asnes' steps are accompanied by extreme torsion and \naccentuated backward tilts which create an overall feeling of off- \nbalance.) \nAnother signature work which needs to be considered in this \nfirst plotless, lyrical category is Esplanade. The mournful, enigmatic \nmood of the Second Movement Adagio makes this work extremely \nI00 \nTHROUGH A GLASS DARKLY \nFig. 1. Esplanade: Michelle Fleet and Andy LeBeau. ? Orion Duckstein. \nIOI \nDANCE RESEARCH \ndifficult to classify. As BarryJohnson noted, Esplanade 'is an excel- \nlent example of the doubleness of Taylor's dances, their refusal \nto be one thing'.42 However, many of the gestures and dancer-to- \ndancer relationships in the Adagio are the same as those in other \nsections of the work. As with Polaris and Spindrift, Taylor confirms \nthat when similar movements are performed in different contexts, \nthey signify different types and\/or layers of meaning. Essentially \nthough, Esplanade manifests a majority of characteristics which \nallies it most closely to Taylor's other works to Baroque music. \nWith reference to Aureole, Airs and Arden Court, Susan Reiter \nproposed that, \nIt may seem cavalier to group Esplanade, with its imaginatively non-step- \noriented choreography and its ties to Taylor's early 'nightmare alphabet' focus \non posture and gesture, with the other three works set to baroque music; it \nappears to have less in common with them than they appear to have with each \nother. It certainly stands on its own as a unique, groundbreaking Taylor \nlandmark, yet at the same time Esplanade has links to the other three dances. \nIt shares with them moments of calm and exquisitely tender partnering, seen \nmost vividly in Esplanade's fourth movement, a soothing mirror-image counter- \npoint to the equally meditative second movement's evocation of suffering and \nabandonment. 13 \nIt is important to note that Reiter's article was published soon \nafter the premiere of Musical Offering and that in a later article,44 she \nexcludes this work from Taylor's plotless, lyrical series to Baroque \nmusic. I would support such a separation because of Musical \nOffering's overt ritual theme and its unique movement style, and a \nsimilar separation can be made within the series of works which \nTaylor has created to music by Claude Debussy, namely, Guests of \nMay, Images, Moonbine (1994) and Arabesque (1999). Peter Williams \nargued that Guests of May is 'from the same family tree as Aureole'45 \nand N. R. Gillespie deemed it 'another of Taylor's primarily lyrical \nessays with three entirely different moods to fit the three different \npieces'.46 Likewise, Taylor has described Images as, \nmore or less a lyric piece. At times there is an archaic side - to give the flavor \nof an early society. But it's in no way authentic.4 \nSignificantly, his starting point for Images had been music by \nSchubert but mid-way through the rehearsal process, he switched \nto three sections from Debussy's Images, which is where Taylor's \ntitle originated. Moreover, as the following statement confirms, his \napproach to the work was essentially formalist: \n102 \nTHROUGH A GLASS DARKLY \nWhen I began this piece, I started on something completely different. ... \nNothing happened. So then, I grabbed the first music I could find - several \nDebussy piano pieces - and started over. Without doing a lot of homework or \nthinking about it, it just came out.43 \nArabesque is, like Esplanade, essentially a plotless work, although \nthe lyric style and Utopian mood are interrupted by \na single pantomimic incident: the lethal obscuring of vision. (Imagine the Dark \nAngel section of Balanchine's Serenade followed by Oedipus' final passage in \nGraham's Night Journey.)49 \nWhile recognising a potentially dramatic connotation in the \nmoment described by Tobi Tobias above, Anna Kisselgoff \nperceives Arabesque as a predominantly formalist work: \nThe imagery suggests one of Mr. Taylor's musings on the antiquity of his \nimagination; it has a familiar ritualized aspect with occasionally archaic \npostures. \nAt the same time the work's deepest values lie in its experiments with structure, \nextraordinary speed and music.50 \nConversely, in its treatment of both subject matter and accom- \npaniment, Moonbine is closer to Taylor's other archaic works \nsuch as Musical Offering and Runes (1975), where one or more \nprotagonists preside over some mysterious but highly-organised \ncommunal ritual. Significantly, although the Labanotation score \nindicates that 'There is no linear story line in Moonbine',51 it does \nreveal that, \nWhen beginning to choreograph Moonbine, Mr. Taylor mentioned Shirley \nJackson's The Lottery to the dancers. ... The dance may refer to the story \nobliquely. ... Games and ritual are hinted at, a 'Blind Man's Bluff game turned \ndeadly serious', as Mr. Taylor put it.52 \nThus, while all four works draw inspiration from the impres- \nsionistic form and mood of their accompaniment and all of them \nacknowledge an historical connection between Debussy's music \nand the choreography of Vaslav Nijinsky- most particularly, \nbecause of the rigorous two-dimensional movement style which \ncharacterises each of the four works - only one work, Guests of May, \ncan be described unequivocally as plotless and two others, Images \nand Arabesque, are - like Esplanade - only predominantly so. \n103 \nDANCE RESEARCH \n2. NON-STORY NARRATIVES \nScudorama was the prototype for a series of dramatic works in which \nTaylor presents non-linear and often multi-layered narratives. \nAlthough it did not survive in repertory beyond the 1960s, it was \nsucceeded by several key works which continued to explore a \nsimilar type and treatment of theme. Many of these concern 'ugly' \ncharacters (to use Fleming's generic term) and 'layered, elusive \nscenarios'.53 Also, as previous discussion intimated, this group of \nworks is characterised by a particularly wide-ranging movement \nvocabulary. Fleming acknowledges the latter characteristic thus: \nNearly every one of those Taylor pieces (usually from Column B) at which we \nturn to the person next to us and say 'Wasn't that strange?' is in a new dialect.54 \nSome writers consider Taylor's vocabulary limited, as for example: \nArlene Croce ('he never used a lot of steps anyway'55); Alastair \nMacaulay ('The lexicon of Taylor dance steps isn't large'5\"); and \nDon McDonagh ('Taylor's dance vocabulary tends to be restricted \nto a small palette of movements which he combines and \nrecombines in a variety of interesting ways'57). Works considered \nin this category disprove such a view, especially when a distinction \nis made between the notion of a limited movement vocabulary and \nthat of a wide one containing few codified steps. Moreover, while \nTaylor's plotless, lyrical works manifest similar choreographic \nconcerns (including some uniquely-named steps), the range of \nmovements and dynamics in all of his other work is extremely \nvaried. An important source for such diversity is his wide \nrepertoire of postures, gestures and pedestrian movement - the \nantithesis of the lyric, virtuosic idiom in Taylor's A' trilogy. \nElizabeth Kendall suggests other key sources: \nInstead of shutting himself up inside of it [modern dance], Taylor set out to \ndiscover all the things that have dancing in them; sports, vaudeville, circuses, \nmelodrama, ballets, pageants, revels, tumbling and all kinds of human \nactivity. 8 \nTaylor himself identifies another reason why his movement range \ndiffers from the highly-codified vocabularies of other modern \ndance choreographers: \nDance can be and is a composite of so many ingredients. I have no particular \nstyle or dance philosophy like rise and fall, contraction release. ... I like a broad \npalette to choose from.5' \nI04 \nTHROUGH A GLASS DARKLY \nThis has resulted in what Laura Jacobs describes as 'one of the \nmost impersonal movement vocabularies in the history of dance'60 \nand she goes on to explain that Taylor's steps \nare not pulled out of his own body or soul. In fact, the majority of them come \nfrom the school-yard - leaps, skips, dashes of the sort you might see in a game \nof tag, and an arm-pumping walk. To these, Taylor adds jerks, lurches, spasms, \nand other kinetic scraps when it suits him.'; \nTaylor's dramatic works manifest distinct movement 'dialects' \nor 'palettes' but they can be grouped together according to certain \ntypes of movement and dynamics, as Marcia Siegel's description \nof Scudorama helps to demonstrate: \nAnonymous dancers, dressed sometimes in street clothes and sometimes in \nleotards, struggled and writhed in the impotent fury of nightmare. With its \nstrong distorted movement, empty relationships, and shocking images - like a \nsquirming pile of bodies on the floor - the dance gave an impression of the \nfutility and isolation of modern life that was at once realistic and abstract.62 \nDistorted, discordant types of movement and stark, disturbing \nimages are common to all of the works in this second category. \nWhen returning to the movement content of Scudorama in a later \naccount of the work, Siegel proposed that \nAlthough he never again made a dance so intensely angry, so desolate, traces \nof Scudorama keep appearing, the goalless flailing and lashing motions; the \nfrequent use of fast crawling and other earth-hugging locomotion that makes \nthe dancers look not like animals but like tortured humans; the twisting, \nknotting body shapes and other grotesqueries; the forced speeds at which some \nrisky things are taken; and the solemn but inexplicably sinister ceremonies that \nare so characteristic of his dances.63 \nKisselgoff makes a specific connection between the types of move- \nment in Scudorama nd JNightshade: 'Both have a great deal of on-the- \nside, up-from-the-slime slithering on the floor';64 and in a review of \nLast Look, DanielJacobson's description of the movement content \nclosely resembles that of Siegel's for Scudorama: \nThe piece opens and closes with the same image - a pile of twitching bodies, \ncast-off dolls in a human refuse heap, victims of some late-twentieth century \nscourge (pick your favorite catastrophe). These lost souls awaken from their \ncryogenic sleep, rise like zombies, and, as if driven by some mutation of the \ncentral nervous system, jerk, jump, whirl, and stamp like tangled marionettes, \nthrowing themselves against the floor and one another. Their agonized spasms \nare infused with an intentional fury, anger grounded in despair.65 \n105 \nDANCE RESEARCH \nOf greatest importance, however, in determining a connection \nbetween Scudorama nd other works in this series is Taylor's choice \nand treatment of subject matter. Scudorama was his first represen- \ntation of evil and social disintegration, and he would return to \nthese or to the related themes of social oppression, prejudice and \nexclusion in many subsequent works. As indicated previously, \nTaylor had intended Scudorama to be the 'dark' antithesis in \nrepertory to Aureole and in 'Down with Choreography', he revealed \nanother intended polarity: \nScudorama is less concerned with style than with a slightly vulgar look. The \nnasty things the dancers do are related, in my mind at least, to Dante's Inferno, \nwhich he wrote in the coarse vernacular, rather than his Paradiso, which he \nwrote in a loftier manner.\"' \nAureole and Scudorama can be seen, therefore, as the dance equiv- \nalents of Dante's heaven and hell. Importantly, though, whereas \nGraham chose allegory and ancient myths in order to critique \nhuman weakness, Scudorama initiated a series of works about the \nunderside of contemporary society. \nThe overriding feature common to all of Taylor's dramatic \nworks is his structuring of unrelated episodes as non-cumulative \nnarratives. Their 'stream of consciousness' structure can thus \nbe compared to the early-twentieth century developments in \nliterature augered by Marcel Proust's romanfleuve style of writing \nand to the mid-1950s innovations in existentialist drama. In both, \nthe notion of a 'plot' is either non-existent or secondary to the \ndisparate, self-contained episodes which comprise the work. How- \never, in the same way that much of Proust's writing is plotless but \nhighly-structured, Taylor's non-story narratives are equally strict \nin form. Even though Barnes claimed that, 'it is surely illogical to \nexpect dance to conform to the tenets of a well-made play',67 the \nstructuring of Taylor's dramatic works most closely resembles that \nof an existentialist play. Like Samuel Beckett's Waitingfor Godot, his \nnon-story narratives are essentially event-less. There is no sense of \ncause and effect to determine why his choreography unfolds as it \ndoes. Moreover, in contrast to Taylor's Americana works where \ntime is important- both in terms of locating events and characters \nin particular historical periods and in structuring scenes in \nchronological sequence- his dramatic works are more concerned \nwith the 'here-and-now', that is, with a fluid juxtaposition of \nvignettes about the world as Taylor knows or imagines it. \nio6 \nTHROUGH A GLASS DARKLY \nEqually significant is the fact that although many of his dramatic \nworks can be described as contemporary morality tales, Taylor is \nnot a moralist. Conversely, asJowitt proposes, \none of the most remarkable aspects of his work for me has been his rather \nmedieval presentation of evil as an active force.68 \nThis is in marked contrast to works such as Graham's Heretic (1930) \nand Clytemnestra (1958), Humphrey's The Shakers (1931) and With \nMy Red Fires (1936), and Limon's The Moor's Pavane (1949) where \nsuffering or salvation are the thematic resolution to sin. \nIn Taylor's dramatic works, one or more leading characters are \noften 'outsider' figures, as are the male soloist in Private Domain, the \ndeformed characters in Dust and the alienated victims in Last Look. \nCroce defined Dust as 'your basic Taylor Totentanz of cripples, \nlepers, and mutants'69 while Taylor himself revealed it was the \nresult of 'a subconscious stream of action that just bubbled up'.70 \nBarnes suggests that a similar process influenced the creation \nof Private Domain. With reference to the 'the random bubbles' of \nTaylor's accompaniment, he proposed that \nXenakis treats music as a trampoline for his thoughts. Chumps of sound \nbounce upward with no normal - or rather traditional - structural relevance, \nand yet with an almost sculptural rightness. ... And this strange, structural \ninsubstantiality has been seized upon by Taylor - he has understood these \nfugitive visual possibilities and given them the flesh of his dancers.71] \nBoth the subject matter and structure of Xightshade also evolved \nfrom a spontaneous flow of unrelated ideas. As Taylor explained, \nI left the work intentionally vague as to meaning. It's a kind of fevered dream \ninspired by a book of etchings by Max Ernst.72 \nHilton Als' proposition that JNightshade 'should be viewed as a danse \nand poeme macabre with its own internal logic73 is particularly \ngermane, both to a discussion of Vightshade and to all of Taylor's \nnon-linear narratives. Much of the coherence - or 'logic' - in \nVightshade revolves around three archetypal characters, all of whom \nfunction as surreal dream figures within a Victorian melodrama \nabout social and sexual repression. Kisselgoff, after describing the \nsecondary characters dressed in frock coats and bustles as 'fairly \nconventional on the outside', provides a more detailed delineation \nof the 'three key characters': \nElie Chaib too wears a frock coat, but he has a mop of hair and a brown mask \n107 \nDANCE RESEARCH \nthat makes him completely the terrifying and seductive figure that Victoria \nUris, in a black negligee and a mane of loose hair, both desires and fears in her \nsexual fantasies. \nAnd then there is Carolyn Adams, as the Noble Savage, in stylized African \ncostume, whose fleeting passage among the characters immediately stirs up \ntheir repressed emotions.74 \nFollowing Adams' retirement in 1982, Taylor removed any racial \ninference simply through a change of costume to: \na child in a sashed pink party dress, her character no longer that of the noble \nsavage but still ambiguously innocent. The notion that her purity is actually \ndestructive, still setting off evil every time she flits through or skims across, has \nbeen retained.75 \nBy focusing exclusively on the notion of innocence - thereby \ncreating a character similar to that of Flora in HenryJames' The \nTurn of the Screw - Taylor further highlighted the ambiguity of the \ndream characters in Jightshade, in terms of their real or imagined \npresence within the Victorian melodrama. Significantly, when \nasked to identify key aspects of Taylor's choreography, two former \ndancers, Raegan Wood and Andrew Asnes, cited his 'intentional \nambiguity' as particularly important.76 \nA later work in this series, The Word, is also intentionally \nambiguous. The female protagonist represents an overtly cor- \nrupting force - 'In rehearsals, Mr. Taylor suggested that she was \n\"a Devil\".'77 Yet her relationship to the rest of the cast (costumed \nidentically in tight-fitting shirts, ties, breeches and leather boots, \ntheir slicked-down hair giving them a severe, schoolboy appear- \nance) is never made explicit. It is only through studying the \nLabanotation score that Taylor's key themes and images can be \ngleaned, many of which are realised choreographically through \nsolos for individual members of the ensemble. For example, in the \nopening section, Dancer A is an 'accolite' [sic] who \nis announcing a procession or event led by Dancer C, the Warlord. A feels \nwrathful, unworldly and frightened by C. ... During the course of his solo, he \nworks himself into a religious frenzy.78 \nThe Warlord 'represents unquestioning acceptance of dogma';79 \nDancer R performs a 'self-flagellation solo';80 while Taylor \ndescribed Dancer U as \na combination of the Virgin Mary andJoan of Arc; someone who sees visions \nand hears voices. In her solo, her body is repeatedly twisting or shifting in \nIo8 \nTHROUGH A GLASS DARKLY \nopposite directions at once. ... U is picked up and carried offstage aloft, like \nan icon in a religious parade.8 \nAn exhibition of Byzantine art- and particularly the painting, \nIcon with the Heavenly Ladder of John Klimax depicting 'demons pulling \ndown the faithful as they try to climb to heaven'82 - was the inspir- \nation for The Word. Taylor and his composer, David Israel, visited \nthe exhibition during the Spring of 1997 and both of them saw the \npainting as 'a parallel to a present-day struggle with a loss of faith, \nnot just in God, but in anything'.83 As Mary Cargill recognised, The \nWord 'is anti-authoritarian rather than simply anti-Christian'.84 \nThe Labanotation score of The Word also identifies some of the \nmovement imagery used by Taylor in rehearsals, which corre- \nsponds closely to descriptions of several other works in this second \ncategory. For example, glossary information for the male quintet in \nthe fifth section reveals that: \nIn this dance particularly, Mr. Taylor stressed the movement quality with \nadjectives such as hunched, twisted, contorted, ginched, punched, whiplash, \nand gargoyle-like.\"5 \nLike any creative artist, Taylor's choreography does not evolve \nin a vacuum. The randomness and indeterminacy of events \nand experiences in his daily life, together with his spontaneous \napproach during the rehearsal process, inevitably help not only to \ngenerate but also to shape a specific 'stream' of choreographic \nideas and structures for each new work. Annette Grant defines the \nvarious sources and influences which help to shape a particular \nwork as 'circumstantial linkages'86 and the term is particularly \napposite regarding Taylor's dramatic works. In the case of The \nWord, he came upon another important source by chance: \n... one night, channel surfing on TV, I saw a ceremony inducting new officers \ninto the police, and the candidates sat and stood and spoke, unsmilingly, in \nperfect unison. This struck me somehow related to the stiff formalism of \nByzantium.87 \nThis latter source- which consolidated Taylor's emphasis on con- \ntemporary issues about conformity - was a key determinant of the \nstiff, regimented movement style and homomorphic character- \nisation in The Word, both of which differ significantly from his other \nanti-religious work, Speaking in Tongues. (The latter is considered \nin the earlier Dance Research article as part of Taylor's Americana \ncategory - see note 9.) \nIog \nDANCE RESEARCH \nOne final point needs to be made about Taylor's uncon- \nventional treatment of subject matter and structures in his \ndramatic works. Even though the origins of many of his ideas \nare random and unrelated, and he 'prepares tier upon tier of \nimprobable ideas',88 the decisions which he makes during the \ngestation of a new work ultimately impose a high degree of \nchoreographic structure and coherence - which relates back to the \nearlier parallel proposed between Taylor's choreography and a \nProustian novel. As Taylor acknowledges at the end of his \nautobiography: \neach new dance is a new beginning, a new place to discover; and though each \none may be related to a past one, at some point in the making, if I'm lucky, it \nshows me its own special face, though it's not always in the country that I had \nexpected it to be. ... Most begin as a swamp; all pose a danger of slippery \nfooting. The only firm ground seems to be a certain craft that I've learned by \ntrial and error.\" '\n3. FIBLE-FABLE, FRIPPERY AND FUN \nIn his autobiography, Taylor also writes about the 'transforming \nalchemy'9\" which occurs during the creative process and which \nhelps to determine the particular terrain or 'country' of a new \nwork. This phenomenon is particularly relevant to a discussion of \nhis humorous works because what emerges through the vicissitudes \nof the rehearsal process is often of a different subject and tone from \nhis original conception. Piece Period is a prime example of this. \nTaylor had intended it to be a direct response to both the national \nand period styles of Beethoven, Haydn, Scarlatti, Vivaldi and \nother pre-twentieth century composers. Thus, like Junction and \nAureole, it was musically-inspired. Initially, he had entitled the work \n'Period Piece' because of his formalist approach to each of the \nseven pieces of music. However, when he realised that others found \nthe work funny, he transposed the two words. \nBarnes noted early on that 'Taylor never sets out to be funny'91 \nand this is confirmed by long-time Taylor associate Bettie deJong: \nhis humor always comes from the movement and surprises us. He doesn't ask \nus to be funny ourselves ... Paul isn't by nature a funny, joke-telling sort of guy, \nbut he knows when movements look funny.'2 \nTaylor has an ability not only to recognise and develop humour in \nhis choreography; but also to distinguish between different types. \nIIO \nTHROUGH A GLASS DARKLY \nThese range from 'dark' or macabre to witty, manic or slapstick. \nBarnes makes a further distinction: \nThere's a black humor that runs crooked straight down Mr. Taylor's artistic \nbackbone - it is ghoulish, misanthropic and yet somehow funny. Occasionally \nit is funny-peculiar, and often funny-uncomfortable.\"3 \nIn the same way that Taylor structures separate scenes in \nsequential order in his dramatic works, many of his humorous \nworks are also episodic in form. Since he more often than not \nadopts a 'stream of consciousness' approach during the creation of \na new work and because he has a broad movement vocabulary to \ndraw upon, it follows that, potentially, many of his works could \nevolve either as darkly dramatic or humorously so. Thus, there are \ncertain structural and movement parallels between many of his \nhumorous works and those considered in his 'non-story stories' \ncategory above. (The exception is a sub-group of works in this third \ncategory which were 'plotted' more schematically prior to the start \nof the rehearsal process and which tend to have a more linear \nnarrative structure and specific characters - and, thus, they share \nsome similarities with his Americana works. This sub-group of \ncomic works, such as Agathe's Tale, Snow White, The Sorcerer's Sofa and \nIn the Beginning will be considered later in this section.) \nTaylor has categorised his humorous works thus: \nThere are all kinds of humor and I think through the years I've used them all \n- sheer humor, the biting kind, the snide, the ironic, the plain silly things we \nall do sometimes.'\"4 \nThe most important question, however, is what qualifies Piece Period \nas 'a delicious lampoon';95 Party Mix as 'a wickedly funny satire';96 \nPublic Domain as 'potentially one of [Taylor's] funniest works';97 \nMinikin Fair as 'wacky';98 and The Sorcerer's Sofa as 'a giddy and \narchly cartoonish demonstration of some of Taylor's most pun- \nhappy thinking'?99 \nIn a review of Public Domain's first performances, Barnes iden- \ntified three ways in which Taylor incorporates comic elements: \nthrough 'such dada devices as a large ball proceeding across the \nstage only to be chased by a very small ball' [which is similar to the \npredominance in Piece Period of 'pranks-with-props'100]; 'private \njokes, such as when Taylor himself, who broke his leg on the last \nEuropean tour, comes whirling on with a crutch' and 'occasional \nIII \nDANCE RESEARCH \ndigs at other ballets'.' ? In a later review, Jack Anderson's account \nof Public Domain spans two paragraphs but since this is one of the \nbest hypotheses of Taylor's manipulation of comic material dis- \ncovered to-date - and it includes specific dance examples to \nilluminate his ideas - I have included it in full here: \nIt's a funny dance set to a tape collage of musical snippets, all in the public \ndomain, plus bits of Medea, The Importance of Being Earnest, and W. C. Fields. But \nnow just try to answer this question: what makes these funny things funny? ... \nWhat makes a movement comic is the context in which it is placed. There are \nsome imperturbable adagios which seem not in the least comic in themselves; \nbut when they are followed by balls rolling across the stage, the incongruity of \nthis juxtaposition makes the total effect comic. Sometimes Taylor will combine \ntwo types of movement, neither particularly comic in itself, but in such a way \nthat the combination makes them seem comic. Thus, finger-snapping, in itself, \nmay be jaunty, but it is not necessarily comic, while a mass of bodies oozing \nacross the stage may be downright threatening; but when the bodies ooze \nand snap their fingers simultaneously, this amalgam of two dissimilar types \nof movement becomes comic because the movements are preposterously \nunrelated. \nTaylor also employs movements which are indeed related to each other, \nbut which no 'serious' choreographer would include because of associations \nthey have in other contexts. In a sequence of arm gestures Taylor throws in \nthe familiar hitch-hiker's gesture; it's certainly an arm gesture and therefore \ntheoretically appropriate to the sequence, but because it has such a specific \nmeaning its presence renders the otherwise abstract passage ridiculous. \nFinally, Taylor fashions comedy by showing movements which might very well \noccur during a theatrical performance but which (like preparations for and \nrecoveries from steps) audiences are not ordinarily expected to see. Thus, after \nimposing groupings and displays of movement, the dancers walk casually \naway: dancers might do this backstage or with the curtain down, but they don't \nusually let an audience see them doing it, for seeing it makes their 'serious' \nemoting seem foolish.'1' \nBy comparing and combining the elements outlined by Anderson \nand Barnes, it is possible to propose six crucial ways in which \nTaylor shapes a comic work. These are: \ni) the context in which he sets a particular series of movements \nor tableaux; \nii) the manner in which he combines different types of move- \nments; \niii) the inclusion of pedestrian gestures which have specific \ncultural connotations; \niv) the inclusion of esoteric dance activities [Anderson] and 'in \njokes' [Barnes]; \n112 \nTHROUGH A GLASS DARKLY \nv) the manipulation of props; \nvi) intertextual references to other dance works - drawn from \nTaylor's own repertory and from the classical and modern \ndance canons. \nLost, Found and Lost is arguably the work which best illustrates all \nof these elements and, thus, it has been chosen as the main work \nfor analysis in this third section. It incorporated Events I from \nTaylor's Seven New Dances concert (1957), thus creating an intertext \nand also highlighting - as previous discussion of Polaris also \ndemonstrated - how similar movements are perceived differently \nin different contexts. Although Taylor's original idea was simply to \ncreate a work 'about Ennui and Alienation',103 at its premiere, \ncritics described Lost, Found and Lost as 'the most civilised hoot in \nyears glossy, sophisticated'\"4 and as 'zany and elegant at the \nsame time, and just possibly a gibe at today's avant garde'.?05 \nImportantly, even before a single movement has been performed, \nan aura of sophistication and satire is conveyed through the \ncontext in which Taylor has placed this particular work. The \ncurtain rises on a cast of ten dancers all dressed identically in 'black \nspangly and whispily veiled unisex costumes'.l0? They are seen \nagainst a stark white background and floor (designed by Alex \nKatz), and \nover the whole thing Taylor's composer, Donald York, pours a sludge of fifties \nMuzak ... played in the style of Mantovani.\"'7 \nAlthough Lost, Found and Lost does not incorporate props per se, a \nhumorous design element is that of odd shoes. Most of the dancers \nwear matching black jazz shoes but a few - in what appears to be \na random distribution of colour - wear only one black shoe paired \nwith a brightly-dyed one. \nThe manner in which Taylor combines codified dance move- \nments with a wide range of pedestrian stances and gestures is the \nmost significant and pervasive reason why Lost, Found and Lost can \nbe categorised as a humorous work. Tobias believes that 'Most \nof our laughter ... comes from the wry juxtapositions Taylor \nengineers'.'08 Moreover, the types of movements which Tobias \nidentifies in her review of Lost, Found and Lost closely resemble those \nin Anderson's description of Private Domain: \n[Taylor] culls movement from ordinary body language: arms folded, arms \nakimbo, chin resting thoughtfully in cupped hands. These 'found' fragments \nII3 \nDANCE RESEARCH \nalready look peculiar - seen in isolation or joined with no logical transitions. \nImagine them, then, mixed arbitrarily with short takes from several dance \nworlds: Martha Graham's, Taylor's own, Broadway, classical ballet - Odette's \nwingspread, for one thing, and classroom jump practice.'19 \nTaylor includes quotations in Lost, Found and Lost from both his own \nrepertory and that of other choreographers- although Tobias' \nreference to Swan Lake is tenuous. The 'wingspread' arms motif is \nmore likely a quotation from Taylor's Cloven Kingdom. Additionally, \nin Lost, Found and Lost, Taylor satirizes some of the more mundane \naspects of contemporary western culture. \nThe choreography includes recognizable situations which inspire laughter, \nsuch as a hilarious waiting line the dancers form leading toward one of the \nwings. Each adopts his or her own withdrawn, impatient pose as they slowly \nedge forward one by one. Other moments are more fleeting yet similarly \nstriking - one dancer sizing up another with a disdainful glance; a tight cluster \npulling itself together as if to perform some grand flourish, and then merely \nbending over slightly. \nAlthough poses play a large part in the work, there is also a great deal of \nbusy, antic movement. Mostly, it erupts without warning and stops just as \nsuddenly. 1' \nIt is also interesting to note the very different ways in which \nTaylor quotes from his own repertory in Ab Ovo Usque Ad Mala \n(From Soup to Nuts) and in his Americana work, Danbury Mix (1988). \nThe former is 'an exploration of total silliness set to the music of \nP.D.Q Bach'11 and Jacobson identifies some of the work's key \ncomic element thus: \nAb Ovo gives us the inspired silliness of a Max Sennett comedy goosed up \nwith the free-ranging libido of Mel Brooks. Taylor mocks his penchant for \nglamorous, hypermasculine men by having the boys in Ab Ovo, absurdly hairy \nbody-builders in ridiculous Greek tunics, mince and scurry about like \nsquirrels, while one of them, in leopard-skin cape and jock strap ... does a \ncampy flamenco to the strains of 'Hernando's Hideaway'. Taylor also mocks \nthe sentimental excesses of a work such as Sunset in the lovesick swooning of \nthe men.\"2 \nIt is the tongue-in-cheek manner in which the intertextual \nreferences in Ab Ovo Usque Ad Mala are made that renders them \ncomic puns rather than critiques of other dance forms. Conversely, \nalthough Danbury Mix was considered 'introspective with every \nTaylorism from crawls to pretzels in the air\"'3 and it re-presented \nimages and phrases from Junction, From Sea to Shining Sea, Esplanade, \nSyzygy and other works, the references were intended more as a \nII4 \nTHROUGH A GLASS DARKLY \nserious retrospective- both of previous Taylor choreography and \nof past historical events - than as a parody or Dadaist pastiche. \nIn Ab Ovo Usque Ad Mala, the puns are presented \nin one-liners, each seemingly a non sequitur in terms of what went before. A \nbeatific attitude turn, for example, provokes (what else?) the low-down-hands- \ncrisscrossing-over-knees of the Charleston. The high point of this nutty \nexcursion is a series of three little pas de deux in the course of which every \nludicrous impulse and accident that has befallen a couple with pretensions \nto exaltation - be it in the studio or bedroom - duly makes a five-second \nappearance. \"4 \nAs in Lost, Found and Lost, it is the collective impact of the six comic \nelements cited previously which enables Ab Ovo Usque Ad Mala to \nbe categorised as one of Taylor's humorous works. \nIn reference to Piece Period, Public Domain, Foreign Exchange (1970) \nand Sports and Follies (1974), Siegel notes that 'the comedy comes \nfrom what the dancers do rather than any prearranged plots \nor situations'.11 This is also the case in Lost, Found and Lost and Ab \nOvo Usque Ad Mala. There are, however, a few humorous works in \nwhich Taylor adopts a more conventional story-telling approach. \nAgathe's Tale (1967) and In the Beginning (2003) are arguably his most \nlinear narratives and both involve clearly defined characters: \nAgathe, Satan, Raphael and Orphan Pan in the former, and in the \nlatter, Jehovah and Adam and Eve. Snow White (1983) also re-tells \na well-known story but here, Taylor subordinates the traditional \nfairy tale in order to focus on the theme of narcissism. In so doing, \nhe not only subverts the original concept of good (Snow White) \ntranscending evil (the Wicked Stepmother); he also gives greater \nprominence to other themes, such as the alter-ego representation \nof the Queen (Taylor's Wicked Stepmother) and the Prince, who \n'disconcertingly doubles, in some frighteningly Freudian life, as the \nwicked irredescently [sic] cloaked Queen'.16 \nIn a preview of Snow White, Rob Baker noted that \nMartha Graham may have done a Greek legend or two, but she and her fellow \nmoderns never got around to fairy tales by the Brothers Grimm, and their \ndances seldom had a smile to them.\"7 \nand, as Terry Teachout suggests laconically, 'How dare a \nmodernist be so much fun?'.18 \nI\"5 \nDANCE RESEARCH \n4. LATE-FLOWERING LOVE \nAlthough Taylor had incorporated quasi-romantic duets into \nearlier choreography - as for example, in the fourth movements of \nboth Aureole and Esplanade, and in the 'dream' sequence of Le Sacre \ndu Printemps (1980) where the Girl appears to the Private Eye in \nhis prison cell - Sunset (1983) was the first of his works to explore \ndifferent types of male-female relationships as one of its main \nthemes. As Croce noted, Sunset was \na study of sexual relations (men and men as well as men and women) ... and \nit is also a long look at a side of Taylor - a defenselessly [sic] emotional side - \nthat doesn't often emerge.ll \nBoth Sunset and Equinox (1984) can be seen as the precursors to \nTaylor's first truly romantic work, Roses; a connection which Taylor \nhimself acknowledged: \nfrom the time I made Sunset - a notion of another kind of love has been \ncreeping up on me. I felt that Sunset was a very revealing dance as far as \nemotional climate is concerned, not just about romance between men and \nwomen but about camaraderie among men. \n12 \nReiter suggests an earlier starting-point for this emotional \nexpression in Taylor's choreography. She regards Mercuric Tidings \nnot only as the transitional work, both choreographically and \nmusically, between his series of Baroque works and 'his romantic \ntrilogy';'12 she also suggests that the work \nenters a deeper, more maturely romantic mode in its second movement that \nprefigures Taylor's more deliberate focus on romance and passion in the later \nworks.122 \nReiter does have a point regarding this particular adagio section \nin Mercuric Tidings and other writers also concur. For example, \nKisselgoff described it as 'a romance by three successive couples' 23 \nand Tobias deemed it 'an extension of Taylor's ongoing com- \nmentary on the character of love'.124 However, as earlier discussion \ndemonstrated, Mercuric Tidings is essentially plotless. Like the duets \nof Aureole and Esplanade, the main emphasis in the choreography \nfor all three couples is on formal elements rather than on different \nfacets of a male-female relationship. The distinction is difficult \nto demonstrate, particularly since the romantic subject matter of \nRoses and the more recent Eventide (1997) is conveyed through \nformal elements rather than by a conventional narrative or specific \nTHROUGH A GLASS DARKLY \ncharacters. Nevertheless, the crucial difference is that in Mercuric \nTidings, any romantic connotation is incidental. The main aim of \nthe second section adagio is to create a dynamic contrast to the \ntwo quicksilver allegro sections and, as Mindy Aloff suggests, the \ndancers 'seem not to have switched genres so much as lowered \ntheir idling times'.12 \nI would, however, support Reiter's view that Equinox was 'a sort \nof way station between Sunset and Roses' 12_ and I would then argue \nthat Roses was the prototype for Eventide. The duet material for the \ntwo main couples in Equinox - Elie Chaib and Linda Kent as the \n'lovers-in-experience' and Kate Johnson and Kenneth Tosti as \nthe 'lovers-in-innocence' 27_ presaged the distinction which Taylor \nwould make in Roses between the 'White Couple' and the five \npreceding duets128 and between the main couple and the other \nduets in Eventide. Croce's first review of Roses identified another \nimportant distinction between the 'White' and 'Black' couples, one \nwhich she believes added another layer of romanticism to the \nwork. In her analysis of the two pieces of music used- Richard \nWagner's Siegfried Idyll (1870) followed by Heinrich Baermann's \nAdagiofor Clarinet and Strings (1820s) - she noted that: \nIf Taylor had used the white couple (Cathy McCann and David Parsons or \nKateJohnson and Thomas Evert) at the start of the piece, the music for the \nduet ... would have compelled him to buildforward to the music of the Siegfried \nIdyll, which accompanies the ensemble section. Instead, he builds backwards, \ncontradicting the chronology of the two pieces of music and the chronological \nimplications of their respective musical idioms.'12 \nThe major significance of this is that: \nWe seem to have moved backwards in time to another era and another range \nof sentiment. Thus juxtaposed, the two scores do not just form a meditation \non two periods of Romanticism spanned by Wagner, they also provide the basis \nfor Taylor's essay in retrospection.'\"\" \nThis sense of looking back in time in Roses, as represented by the \nrelationship of the 'White Couple', and by the half-century gap \nin his choice of accompaniment, is coincidental. However, it \nwas certainly an aspect of Eventide. This is confirmed by the \nLabanotation score, which identifies the subject matter thus: \nIt is the memory of a long relationship and the pain of leaving remembered. \nIt is all in the past. The costumes evoke a period piece - the exact period is \nunimportant - the fact that it is in the past is the important point. \nI17 \n(a) Heather Berest andJames Samson \n(withJulie Tice and Michael \nTrusnovec behind). \n(b) Heather Berest andJames Samson. \n(c) Julie Tice and Michael Trusnovec. \n(d) Amy Young and Takehiro Ueyama. i i b \n(() - ~ ~ ~ ~ ~ I (d \n--- _-- iii---  -- 2S - --- \nFig. 2. Roses. ( Orion Duckstein. \nTHROUGH A GLASS DARKLY \nFig. 3. Roses: The 'White Couple', Silvia Nevjinsky and Patrick Corbin. \n( Orion Duckstein. \nEach duet could be seen as the same couple, or different couples with similar \ntypes of relationship at different stages. The fact that each duet is dressed \nidentically is a way of indicating that each duet presents different aspects of \nthe same relationship.':\" \nThere are five pairs of dancers in Eventide and the main clue, \nchoreographically, to Taylor presenting them as the same couple \nat different stages of their relationship can be found in the two \nduets for the main couple (originally, Francie Huber and Patrick \nCorbin). Their first duet occurs in the second section of the work, \nthe 'Carol'. Here, Corbin represents the attentive, supportive \npartner to Huber who appears distant and disinterested. Their \nnext duet occurs in the penultimate section, 'Musette' - that is, \nafter the changing state of their relationship has been alluded to \nby the duets for four other couples.'32 Corbin begins in the same \nposition as the female dancer from the previous section had \nfinished (Rachel Berman in 'Ballad Part II'), but this time, 'the \nroles have been reversed'.'33 \nSome critics recognised Taylor's intended double reading on \nfirst sight of Eventide. Kisselgoff, for example, described the five \ncouples as \n\"9 \nDANCE RESEARCH \nghosts of the past or aspects of the same pair; very obviously, they amplify an \nidea, which traces the course of life and loss. Courtship at its beginning, ecstasy \nand passion; all these are distilled in five contrasting duets.'34 \nGia Kourlas, however, noted a subtle difference from Roses: \nit's a darker and more melancholic side of love than Roses depicted. Four \ncouples drift in and out of the scene, portraying lovers filled with an unsettling \nsense of regret or loss.'5 \nI believe that the reason why Taylor turned to romantic subject \nmatter during the mid-1980s and then returned to it again a \ndecade later was because of his relationship with two distinct \ngroups of dancers. By 1983, his company consisted of several \nsenior dancers who had worked with him since the mid-1970s. By \nthe late-1980s, these same dancers had retired or left to work \nelsewhere. (That Taylor created the 'White Couple' in Roses on \nCathy McCann and David Parsons is also significant because, at \nthat time, they were also a couple off-stage.) With Eventide, Taylor \ncame full-circle, with the next generation of dancers who had \njoined his company in the late- 1980s and early- 1990s. (By the late- \n1990s, Huber was the most senior female dancer, havingjoined the \ncompany in 1987, while Corbin, who joined the company in 1989, \nis currently the company's senior male dancer.) \nThis article has considered four different types of works in Taylor's \ncorpus and, in so doing, it has sought to highlight just how diverse \nhis choreography is. Discussion has addressed some wider aspects \nrelating to Taylor's choreography, as for example, the debates \nconcerning the lyricism - as opposed to classicism - of his plotless \nworks and the extent of his movement vocabulary. Models and \ncriteria for analysing his dramatic and humorous works have also \nbeen considered. \nAlan M. Kriegsman has described Taylor's diversity as 'poly- \ndexterity\"\"36 and it is this aspect of his choreography which makes \nit so difficult to classify. Moreover, as Anderson suggested when \nreviewing a recent New York season: \nTaylor has done more than create different kinds of dances. He often has \ndifferent kinds of things happen in a single dance. He has devised a few total \npuzzlers. More often, however, his dances are easily accessible at some level: \nno wonder they are so popular. Yet his creations also have underlying mysteries \nor contradictions.137 \n120 \nTHROUGH A GLASS DARKLY \nThe aim of my doctoral thesis - and of this reworked article - \nhas been to unravel some of those mysteries and contradictions. \nNOTES \nTaylor created his first choreography, Jack and the Beanstalk, in 1954 and although he \npresented concerts of his own work regularly in New York, he was most acclaimed during \nthe 1950s as a leading member of the Martha Graham Dance Company (1955-61) and for \nhis solo in the 1959 Graham-George Balanchine co-production Episodes. The latter led to \nTaylor making several guest appearances with the New York City Ballet during its 1959-61 \nseasons. \n2 Although Junction (1961) and Private Domain (1969) were revived as recently as the 1990s, \nother key works such as Inlsects anld Heroes (1961), Piece Period (1962), Scudorama (1963), Finom \nSea to Shining Sea (1965), Orbs (1966), Agathe's Tale (1967) and Public Domain (1968) have not \nbeen performed for many years. \n3Taylor (1987), p. 169. \n4 Taylor, cited in Brown (1980). \nTerry (1962). 6 Hughes (1962b). 7 Hughes (1963), p. 30. \n8 Taylor in Anderson (1980), p. 69. He first used the term to describe the subject matter of \nInsects alzd Heroes which initiated his interest in developing non-linear narratives. \n9 My doctoral thesis also analysed a fifth work, From Sea to Shining Sea (1965), and proposed \nit as the prototype for a series of Americana works such as Big Beitha (1970), American Genlesis \n(1973), Speaking in Tongues (1988), Conpany B (1991) and Oh, olu Kid! (1999). This section of \nthe thesis was developed and published as 'Heroes and Villains: Paul Taylor's Le Sacre du \nPrimteips (The Rehearsal) and other American Tales' in the Winter 1999 issue of Dance \nResearch. (Kane, 1999) The article considered both the problematic use of the term \nAmericana' and Taylor's choice and treatment of American themes. Recent works wvhich I\nwould add to this category are Black Tuesday (2001) and Dream Girls (2002). \n10 Kane (1995). In a paper presented at the 1995 CORD conference, I considered four \ntypes of ritual in Taylor's choreography: \ni. The dance-specific rituals of Sports and Follies (1974), Le Sacre du Printemps (The Rehearsal) \nand Fact and Fancy (1991), where the daily cycle of rehearsal and performance is \npresented as highly organised, habitual activity. \nii. The ceremonial pastiches and parodies of From Sea to Shining Sea, Danbury lIix (1988) \nand The Sorcerer's Sofa (1989). \niii. Works such as Pary Alix (1963), Orbs, American Genesis (1973), Cloven Kingdom (1976) and \nSpeaking in Tongues (1988) which provide a critique of specific social contexts and \npractices \nixv Works such as Runes (1975), ... Byzantium (1984), and Musical Offering (1986) which \npresent ritual as ancient and solemn process. \nGreskovic (1982), p. 33. \n12 Fleming (1994), p. 16. 3 Ibid. \n'4 Ibid. \n15 Auieole's subject matter, enhanced by its simple white costumes and lighting, and \nmellifluous Handel music was certainly different from the work of other American modern \ndance choreographers, which at that time was synonymous with social comment, sombre \naccompaniment and 3-D design. It was also in marked contrast to the nascent postmodern \ndance with its pedestrian, task-oriented, mixed-media explorations of non-proscenium \nstages. \n121 \nDANCE RESEARCH \n16 Barnes (1982b). \n17 The exception is Musical Offering which, because of its underlying theme of death and \nfarewell, does not fit comfortably in this first category. \n18 In Airs, the sixth movement allegro from Handel's Concerto in F major is preceded by part \nof the overture from Berenice and followed by the 'Musette' of the overture from Alcina. \nTaylor then uses the Arrival of the Queen of Sheba' from Solomon before returning to Alcina \nfor the closing adagio finale. 9 The three concertos chosen for Cascade are numbers 4, 5 and 7. Taylor uses a modern \npiano transcript of Bach's orchestration, which was scored originally for harpsichord and \norchestra. In Promethean Fire, he uses Leopold Stokowski's transcriptions of Toccata & Fugue \nin D minor, Prelude in Eftat minor and Chorale Prelude, BWV 680. \n20 Taylor admits that this 'run with flyaway arms' was 'a direct and intentional steal from \nMartha's Canticlesfor Innocent Comedians' (Taylor, 1987, p. 135). \n21 Uris in Lobenthal (1987), p. 30. Significantly, current company dancer Patrick Corbin \nreiterates Uris' metaphor for Taylor's contrasting use of the upper and lower body: 'Legs \nlike an oak and arms like a willow'. (Correspondence with author, August 1994.) \n22 Correspondence with author (February 1994). When asked to identify particular \ncharacteristics which she considered to be typically 'Taylor' in style, McCann's full \ndescription was: \nFirst: a sense of moving from your torso involving your back in all arm, chest, pelvis and \nultimately leg moves you move from deep within your core. \n23 Gillis in Lobenthal (1985), p. 14. \n24 Hughes (1962a). \n25 Horst (1962), p. 104. \n26 Jowitt (1979a), p. 76. \n27 Kent in Steele (1985) p. 11. C. Kent has been teaching at theJuilliard School since leaving \nTaylor's company in 1989. Importantly, it was stagings of Sunset in 1995 6 and Roses 1997 8 \nfor herJuilliard students which were the basis for the two Labanotation scores by former \nTaylor company notator, Sandra Aberkalns. \n28 Here, I would like to acknowledge former Taylor dancer, Mary Cochran, as the first to \nidentify the term 'undercurve' in this context. (Correspondence with author, 1994.) \n29 Dan Wagoner in Tobias (1978). \n30 Taylor in Berman (1988), p. 21. \n3Taylor in Ulrich (1988), p. E-6. \n2 The Labanotation score for Public Domain (1968) includes the following introductory note \nby Moekle (1980 2), p. ii: \nA scribble is a characteristic movement style of the choreographer. Scribbles are defined \nby the notator, from rehearsal notes, as fast, free, rough, messy, broken, wild, loose, bursts \nof pure energy, nonlinear and without shape. \n33 Taylor saw his role in Aureole as 'some kind of earth father who goes round blessing things' \n(1987, p. 136). Similarly, Kisselgoff (1972) described his role in Guests of AIay as that of \n'a benevolent jolly green giant, an earth father'. \n34 Nuchtern (1979), p. 30. \n35 Another dance-music difference which Taylor tends to use as a visual and kinetic contrast \nis to maintain a steady dance rhythm across a musical retard. An obvious example of this \noccurs in Airs. Following the 'Flower' formation in the First Movement, the dancers begin \nwalking in different directions on the third count of the bar. While the Largo of Handel's \nConcerto in B major is in 3\/4 time, the dancers' phrase is counted in sixes, i.e. it crosses two bars. \nAfter twelve bars, the music retards but the dancers 'continue to keep the same tempo \nestablished previously till the end of the movement'. (Introductory notes to the \nLabanotation score; Moekle, 1978-81, p. 16.) A similar contrast occurs at the end of the \nnext section when, once again, the dancers keep their current tempo as the music retards.) 36 Barnes (1982b). \n122 \nTHROUGH A GLASS DARKLY \n3Taylor in Rosen (1979), p. 90. \n3Susan McGuire (1996). Conversation with author, London, 4 September. \n9Barnes (1976). \n40 This was what Taylor originally intended. However, as the work progressed in rehearsals, \n'he got bored with this idea'. (Bettie deJong- interview with author, San Francisco, 10 April \n1999.) In the completed work, Asnes exits briefly at the end of the second section. \n41 The Largo and Allegretto are two separate sections of Handel's concerto but they have \nbeen elided by both Schoenberg and Taylor. 42 Johnson (1999). \n43 Reiter (1986), p. 65. \n44 Reiter (1993). When discussing Taylor's 'angelic' works, Rieter argues that Musical Offering \n'sits uncomfortably in this category', p. 6. \n45 Williams in Goodwin, Percival and Williams (1973), p. 34. \n6Gillespie (1972), p. 26. \n47 Taylor in Kisselgoff (1977). \n48 Ibid. \n4Tobias (2000), p. 62. \n5Kisselgoff (2000), p. El. \n51 Ferguson (1994), p. v. \n52 Ibid., p. viii. The Lottery is one ofJackson's short stories about a small-town community's \nbehaviour on the day of its annual lottery. By a process of elimination, drawing names out \nof a black box, one villager is 'chosen' (as in Le Sacre du Printemps) as the victim to be stoned \nby the rest of the community. \n3 Jacobson (1989), p. 69. \n54 Fleming (1994), p. 17. \n55 Croce (1977). [Restated in Going to the Dance, p. 32.] \n56 Macaulay (1988), p. 110. \n57 McDonagh (1990), p. 141. \n58 Kendall (1980),p. 11. \n59 Taylor in Rosen (1979), p. 88. \n60 Jacobs (1988), p. 22. 61 Ibid. \n62 Siegel (1973), p. 203. 63 Siegel (1985a), pp. 301-2. It is important to note that Siegel was writing several years \nbefore the creation of LastLook (1985). In a subsequent review, she recognised that 'Scudorama \nis gone, but the new Last Look could be its older, flashier but equally desolate cousin' (Siegel, \n1985b, p. 452). 64 Kisselgoff (1979b), p. D28. \n6 Jacobson (1989), p. 70. \n66 Taylor in Cohen (1965), p. 100. Taylor made public this connection to Dante's epic \npoem, Divine Comedy, in late-1963. By the time of Scudorama's New York premiere in \nDecember, the programme included a verse from the Inferno, Canto III, 34-6: \n'What souls are these who run through this Black haze?' \nAnd he to me: 'These are the nearly soulless \nwhose lives concluded neither blame nor praise.' 67 Barnes, in Barnes, Goodwin and Williams (1965), p. 24. \n68 Jowitt (1979a), p. 77. \n69 Croce (1977). [Restated in Going to the Dance, p. 33.] \n70 Taylor in anon. (1977). \n71 Barnes (1969b). \n72 Taylor in Welsh (1980), p. B-5. The book to which Taylor refers is Ernst's Une Semaine de \nbonte.Jowitt (1979b, p. 77) describes the book as, \nA terrifying collection of etchings of opulent, half-naked women in bondage preyed upon \n123 \nDANCE RESEARCH \nby bird-headed or lion-headed gentlemen, violence in railway carriages, whispered con- \nversations and witnessing eyes. 73 Als (1984), p. 41. \n74 Kisselgoff (1979a). \n75 Kisselgoff (1984), p. C15. \n76 Correspondence with author (both 1994). \n77 Hoffman (1998 2000), p. v. \n78 Ibid., p. 2. The score also identifies the dancers on whom these roles were created: \nA: Andy LeBeau; C: Richard Chen See; R: originally Rachel Berman and now Amy Young; \nU: originally Francie Huber and now Heather Berest. The leading female role was created \non Lisa Viola (who is identified in Labanotation score as dancer V). \n79 Ibid., p. 22. 80 Ibid., p. vi. \n81 Ibid. \n82 Ibid., p. v. \n83 Israel in Grant (1998), p. 4, AR. \n84 Cargill (1998), p. 24. \n85 Hoffman (1998-2000), p. vi. \n86 Grant (1998), p. 4, AR. 87 Taylor in Grant (1998), p. 4, AR. \n88 Macaulay (1988),p. 115. \n89 Taylor (1987), p. 360. 90 Ibid., p. 213. \n91 Barnes in Sorrell (1966), p. 65. \n92 deJong in Steele (1986), p. 2C. \n93 Barnes (1977). \n94 Taylor in Rosen (1979), p. 90. \n95 Terry (1962). 96 Barnes in Sorrell (1966), p. 65. \n97 Anderson (1969), p. 80. \n98 Greskovic (1990), p. 4. 99 Ibid. \n'00 Hering (1963), p. 28. \no0 Barnes (1969a), p. 24. 102 Anderson (1977), p. 40. \n103 Taylor in Moekle (undated). Unfortunately, this partial score is simply a brief series of \nnotes about the work. \n104 Barnes (1982a). \n105 Tobias (1982), p. 73. \n106 Barnes (1982a). \n107 Croce (1982b), p. 164. \n108 Tobias (1982), p. 73. \n109 Ibid. \n10 Reiter (1982), p. 29. \n111 Shapiro (1986), p. 84. P . Q Bach is a pseudonym used by the contemporary American \ncomposer, Peter Schickele. \n2 Jacobson (1989), p. 68. \n11 Kisselgoff(1988), p. 16. \n114 Tobias (1986), p. 87. \n5 Siegel(1974),p. 71. \n116 Barnes (1983), p. 57. \n17 Baker (1983), p. 6. \n18 Teachout (1993),p. 3. \nI24 \nTHROUGH A GLASS DARKLY \nCroce (1987), p. 75. \n20 Taylor in Tobias (1985), p. 54. \n121 Reiter (1986), p. 65. The trilogy to which Reiter refers is Sunset, Equinox and Roses. 122 Ibid. \n13 Kisselgoff (1982). \n124 Tobias (1982), p. 74. \n1Aloff (1982),p. 33. \n26 Reiter (1986), p. 68. \n2 Ibid. The point being made here is a development from Reiter's original idea, \nparticularly since she singles out the Johnson-Tosti duet as the one in which 'Taylor \nconfronts passion more openly than he has before'. In Roses, it is the White Couple who are \nthe 'lovers in experience'. \n128 The Labanotation score of Roses identifies the main couple as the 'White Couple' and \nthe other five as the 'Black Couples' (Aberkalns, 1997-9). 29 Croce (1985), p. 119. \n10 Ibid. \n131 Ferguson (1997), p. vi. \n32 The Labanotation score includes specific reference to these stages. For example, the \ncouple in 'Christmas Dance' is the youngest: 'movement is playful and light' (Ferguson, \n1997, p. vi). The couple in the 'Moto Perpetuo' section are like 'two butterflies playing tag'; \nthey are 'sexually mature, more knowing what the game is' (p. vii). \n133 Taylor in Ferguson (1997), p. vii. In 'Ballad Part II', the female dancer is first wooed by \nher partner then rejected. \n134 Kisselgoff (1997), p. C13. \n13 Kourlas (1997), p. 59. \n136 Kriegsman (1978), p. D1. \n37 Anderson (2000), p. 739. \nBIBLIOGRAPHY \nAberkalns, Sandra (1997-9). Roses, New York: Dance Notation Bureau. \n[Labanotation score] \nAloft, Mindy (1982). Reviews 3: Mindy Aloft, Dance Magazine, Vol. LXVI, No. 8, \nAugust, pp. 32-4. \nAls, Hilton (1984). Big Bertha and Nightshade, Ballet Review, Vol. 12, No. 3, Fall, \npp. 41-2. \nAnderson,Jack (1969). Paul Taylor Dance Company, Dance Magazine, Vol. XLII, \nNo. 1,January, pp. 79-80. \nAnderson, Jack (1977). Paul Taylor: Surface and Substance, Ballet Review, Vol. 6, \nNo. 1, pp. 39-44. \nAnderson,Jack (1980). Choreographic fox: Paul Taylor, Dance Magazine, Vol. LIV, \nNo. 4, April, pp. 68-73. \nAnderson, Jack (2000). New York Newsletter, The Dancing Times, Vol. 90, No. \n1076, May, pp. 739, 741. \nAnon. (1977). The Terrific Tempo of Paul Taylor, Time Magazine, 18 July. \n[Incomplete cutting, Paul Taylor Dance Company archive.] \nBaker, Rob (1983). The man who made Snow White dance, Daily News, 3 April, \npp. 5-6 [Leisure section]. \nBarnes, Clive (1969a). Private View: Transatlantic commentary, Dance andDancers, \nVol. 20, No. l,January, pp. 22-4. \n125 \nDANCE RESEARCH \nBarnes, Clive (1969b). Paul Taylor's 'Private Domain', The New York Times. \n[Incomplete cutting, c.8 May, Paul Taylor Dance Company archive. The \nreview cites 'Private Domain, given for first time last night'.] \nBarnes, Clive (1976). Dance: Paul Taylor's 'Polaris' Is Given Premiere in \nNewport', The New York Times. [Incomplete cutting, c.29 August, Paul Taylor \nDance Company archive. The review cites 'The 1976 American Dance \nFestival ... ended here last night'.] \nBarnes, Clive (1977). Dance: Taylor Tale, The New York Times, 3June. \nBarnes, Clive (1982a). Paul Taylor dancers with their sensuous 'lost-found' \nimages, New York Post, 15 April. \nBarnes, Clive (1982b). Taylor: master at work, NAew York Post, 21 April. \nBarnes, Clive (1983). Taylor adds a wild touch to fairytale, New York Post, 14 April, \np. 57. \nBarnes, Clive, Noel Goodwin and Peter Williams (1965). Taylor from Three \nSides, Dance and Dancers, Vol. 16, No. 1,January, pp. 22-30, 47. \nBerman, Janice (1988). Paul Taylor: Still Battling With Ballet, Newsday, 3 April, \nPartII\/pp. 11, 21. \nBrown, Alan M. (1980). The Diverse Styles of Paul Taylor, The Los Angeles Times, \n2 January, Calendar section. \nCargill, Mary (1998). The Word, Dance View, Vol. 15, No. 3, pp. 24-6. \nCohen, Selma Jeanne, ed. (1965). The Modern Dance - Seven Statements of Belief, \nMiddletown, Connecticut: Wesleyan University Press, pp. 91-102. \nCroce, Arlene (1977). Taylor in Excelcis, The New Yorker, 20 June. [Reprinted in \nGoing to the Dance, pp. 31-4.] \nCroce, Arlene (1982a). Going to the Dance, New York: Alfred A. Knopf. \nCroce, Arlene (1982b). Finders Keepers, TheNew Yorker, 10 May, pp. 163-7. \nCroce, Arlene (1985). Modern Love, The New Yorker, 29 April, pp. 119-21. \nCroce, Arlene (1987). Zeitgeist, The New Yorker, 6July, pp. 70, 75-6. \nCroce, Arlene (1989). Sun and Shade, The New Yorker, 1 May, pp. 78-80. \nFerguson, Sian (1994). Moonbine, New York: Dance Notation Bureau. \n[Labanotation score.] \nFerguson, Sian (1997). Eventide, New York: Dance Notation Bureau. \n[Labanotation score.] \nFleming, Bruce (1994). Towards a Theory of Taylor; or, Why We Love Paul, The \nNew Dance Review, Vol. VI, No. 4, Summer-Fall, pp. 16-19. \nGillespie, N[oel] R. (1972). Reviews - Paul Taylor Dance Company, Dance \nMagazine, Vol. XLVI, No. 7,July, p. 26. \nGoodwin, Noel, John Percival and Peter Williams (1973). Monsters and \nMinstrels, Dance and Dancers, Vol. 24, No. 9, September, pp. 33-6. \nGrant, Annette (1998). In a Departure, A Plunge Into Darkness, The New York \nTimes, 1 March, p. 4, AR [Arts and Leisure section]. \nGreskovic, Robert (1982). Brooklyn, Ballet News, Vol. 3, No. 7,January, p. 33. \nGreskovic, Robert (1990). Ashes of Roses, The New Dance Review, Vol. III, No. 1, \nJuly-September, pp. (1)-5. [The cover page is unpaginated.] \nHarris, Dale (1989). Dance: The Two Faces of Paul Taylor, The Wall Street Journal, \n25 April. \nHering, Doris (1963). The Paul Taylor Dance Company - Hunter Playhouse, \nDance Magazine, Vol. XXXVII, No. 1,January, p. 28. \n126 \nTHROUGH A GLASS DARKLY \nHoffman, Robin (1998-2000). The Word, New York: Dance Notation Bureau. \n[Labanotation score.] \nHorst, Louis (1962). The American Dance Festival, Dance Observer, Vol. 29, No. 7, \nAugust-September, pp. 104-5. \nHughes, Allen (1962a). Dance: Debut of Aureole', a Modern 'White Ballet', The \nNew York Times, 6 August. \nHughes, Allen (1962b). Paul Taylor Dancers at Hunter College, The New York \nTimes, 9 November. \nHughes, Allen (1963). Paul Taylor - Dance or Dada?, Dance 62, Vol. l,January, \npp. 30-1. [The publication included the following note: 'Dance 62 is a bonus \noffering for subscribers to Dance Perspectives and is not for sale'.] \nJacobs, Laura (1988). Taylor-Made and Frippery, The New Leader, 2 May, pp. \n22-3. \nJacobson, Daniel (1989). Private Domains in Public Spaces, Ballet Review, Vol. 17, \nNo. 1, Spring, pp. 67-75. \nJohnson, Barry (1999). Beneath the clever steps, The Paul Taylor Dance \nCompany tangles with the American spirit, The Oregonian, 22 October. \n[www.oregonlive.com] \nJowitt, Deborah (1979a). A Fishy Conversation with an Obliging Giant, The \nVillage Voice, 23 April, pp. 76-7. [Reprinted in The Dance in Mind, pp. 45-50.] \nJowitt, Deborah (1979b). How Do You Like Your Nightmares?, The Village Voice, \n14 May, p. 77. \nJowitt, Deborah (1985). The Dance in Mind, Boston: David R. Godine. \nKane, Angela (1995). Rites of purpose - the relevance of ritual in Paul Taylor's \nchoreography, Dance, Myth and Ritual: The Americas and the Caribbean, 1995 \nCongress on Research in Dance conference paper. \nKane, Angela (1999). Heroes and Villains: Paul Taylor's Le Sacre du Printemps (The \nRehearsal) and other American tales, Dance Research, Vol. 17, No. 2, Winter, \npp. 47-72. \nKendall, Elizabeth (1980). American Mongrel, Ballet News, Vol. 1, No. 10, April, \npp. 11-14,35-6. \nKisselgoff, Anna (1972). Dance: 4 by Paul Taylor, The New York Times, \n1 December. \nKisselgoff, Anna (1977). Paul Taylor's Creative Surge Is Still Going Strong, The \nNew York Times, 29 May. \nKisselgoff, Anna (1979a). Dance: Paul Taylor Presents Nightshade Premiere, The \nNew York Times, 21 April. \nKisselgoff, Anna (1979b). Paul Taylor's Ambiguities, The New York Times, 29 April, \npp. D8, D28. \nKisselgoff, Anna (1982). Dance: Taylor's Troupe 'With Mercuric Tidings', The \nNew York Times, 22 April. \nKisselgoff, Anna (1984). Dance: Paul Taylor, The New York Times, 26 March, C15. \nKisselgoff, Anna (1988). Dance: City Ballet Acts as Host to Paul Taylor's Troupe, \nThe New York Times, 14 May, p. 16. \nKisselgoff, Anna (1997). Expanding the Trite to Reveal New Poetry, The New York \nTimes, 27 February, pp. C13-14. \nKisselgoff, Anna (2000). Paul Taylor Tickles Eyes and Ears, Seriously, The New \nYork Times, 2 March, p. E 1. \n127 \nDANCE RESEARCH \nKourlas, Gia (1997). Taylor-Made, Time Out (New York), 27 February-6 March, \np. 59. \nKriegsman, Alan M. (1978). Imagination in Motion - The Unexpected Moves of \nPaul Taylor, The Washington Post, 27 January, pp. D1, D3. \nLobenthal,Joel (1985). Christopher Gillis: Dancing for Paul Taylor, Ballet Review, \nVol. 13, No. 2, Summer, pp. 10-22. \nLobenthal, Joel (1987). Victoria Uris: Dancing for Paul Taylor, Ballet Review, Vol. \n15, No. 1, Spring, pp. 26-37. \nMacaulay, Alastair (1988). The Music Man, The Jew Yorker, 2 May, pp. 110, \n113-15. \nMcDonagh, Don (1990). Paul Taylor - Advanced Ideas and Conventional \nTheater, The Rise & Fall & Rise of Modern Dance, London: Dance Books, pp. \n138-46. [First published in 1970.] \nMoekle,Janet (1978-81). Airs, New York: Dance Notation Bureau. [Labanotation \nscore.] \nMoekle, Janet (1980-2). Public Domain, New York: Dance Notation Bureau. \n[Labanotation score.] \nMoekle,Janet (undated). Lost, Found and Lost, New York: Dance Notation Bureau. \n[Incomplete Labanotation score.] \nNuchtern,Jean (1979). Taylor's Domain, The Soho Weekly News, 26 April, p. 30. \nReiter, Susan (1982). Reports - New York, Ballet News, Vol. 4, No. 1,July, pp. \n29-30. \nReiter, Susan (1986). Baroque and Beyond with Paul Taylor, Ballet Review, Vol. 14, \nNo. 3, Fall, pp. 65-71. \nReiter, Susan (1993). Celestial In Spite of Itself, DanceView, Vol. 10, No. 3, Spring, \npp. 6-11. \nRosen, Lillie F. (1979). Talking with Paul Taylor, Dance Scope, Vol. 13, Nos. 2-3, \nWinter\/Spring, pp. 82-92 ['Special Double Issue']. \nShapiro, Laura (1986). Dancing's Mr. Sunshine, N\/ewsweek, 21 April, p. 84. \nSiegel, Marcia B. (1973). At the Vanishing Point, New York: Saturday Review Press. \n[First published in 1968.] \nSiegel, Marcia B. (1974). Liberation in a cocoon, Dance Magazine, Vol. XLVIII, \nNo. 12, December, p. 71. \nSiegel, Marcia B. (1985a). The Shapes of Change, Boston: Houghton Mifflin \nCompany. [First published in 1979.] \nSiegel, Marcia B. (1985b). Thirty Years in Eden's Dustbin, Hudson Review, Fall, \npp. 449-54. \nSorrell, Walter (1966). The Dance Has Many Faces, New York: Columbia University \nPress. [First published in 1951.] \nSteele, Mike (1985). Taylor dances merely venerable at 30, Minneapolis Star and \nTribune, 1 March, p. 11C. \nSteele, Mike (1986). Leading dancer turns spectator, AMinneapolis Star and Tribune, \n18January, p. 2C. \nTaylor, Paul (1987). Private Domain, New York: Alfred A. Knopf. \nTeachout, Terry (1993). Notes Toward the Definition of Paul Taylor, The New \nDance Review, Vol. V, No. 2, Winter, pp. 3-6. \nTerry, Walter (1962). Dance - Paul Taylor, New York Herald Tribune, 9 November. \nTobias, Tobi (1978). Interview with Dan Wagoner, New York: Dance Collection of \n128 \nTHROUGH A GLASS DARKLY \nthe New York Public Library. [Audio tape, MGZTC 3-971, Reel 4.] \nTobias, Tobi (1982). Finders Keepers, JLew York, 3 May, pp. 73-4. \nTobias, Tobi (1985). A Conversation with Paul Taylor and George Tacit, Dance \nMagazine, Vol. LIX, No. 4, April, pp. 54-60. \nTobias, Tobi (1986). A Few Green Leaves, New York, 21 April, pp. 87-8. \nTobias, Tobi (2000). To Pay Paul, New York, 20 March, p. 62. \nUlrich, Allan (1988). Taylor-made, San Francisco Examiner, 23 October, pp. E-l, \nE-6. \nWelsh, Anne Marie (1980). The life of Paul Taylor: Creativity amid adversity, The \nWashington Star, 13 January, pp. B-1, B-5. \nI29 \n"}