{"doi":"10.1007\/s00585-997-0692-z","coreId":"67704","oai":"oai:eprints.lancs.ac.uk:35244","identifiers":["oai:eprints.lancs.ac.uk:35244","10.1007\/s00585-997-0692-z"],"title":"CUTLASS\/IMAGE observations of high latitude convection features during substorms","authors":["Yeoman, T.K.","Lühr, H."],"enrichments":{"references":[{"id":807326,"title":"A multisatellite case study of the expansion of a substorm current wedge in the near-Earth magnetotail,","authors":[],"date":"1990","doi":null,"raw":"Lopez, R. E., and A. T. Y. Lui, A multisatellite case study of the expansion of a substorm current wedge in the near-Earth magnetotail, J. Geophys., Res., 95, 8009±8017, 1990.","cites":null},{"id":804119,"title":"A new magnetic coordinate system for conjugate studies at high latitudes,","authors":[],"date":"1989","doi":null,"raw":"Baker, K. B., and S. Wing, A new magnetic coordinate system for conjugate studies at high latitudes, J. Geophys. Res., 94, 9139± 9143, 1989.","cites":null},{"id":808670,"title":"A synthesis of magnetospheric substorm models,","authors":[],"date":"1991","doi":null,"raw":"Lui, A. T. Y., A synthesis of magnetospheric substorm models, J. Geophys. Res., 96, 1849±1856, 1991.","cites":null},{"id":804371,"title":"CDAW 9 analysis of magnetospheric events of May 3, 1986: event","authors":[],"date":"1993","doi":null,"raw":"Frank, R. D. Elphinstone, J. S. Murphree, J. F. Fennel, R. E. Lopez, and T. Nagai, CDAW 9 analysis of magnetospheric events of May 3, 1986: event C, J. Geophys. Res., 98, 3815±3834, 1993.","cites":null},{"id":16628812,"title":"Characteristics of high-speed ion ¯ows in the plasma sheet,","authors":[],"date":"1990","doi":null,"raw":"Baumjohann, W., G. Paschmann, and H. Lu È hr, Characteristics of high-speed ion ¯ows in the plasma sheet, J. Geophys. Res., 95, 3801±3809, 1990.","cites":null},{"id":804863,"title":"Characteristics of high-speed ion flows in the plasma sheet,","authors":[],"date":"1990","doi":null,"raw":null,"cites":null},{"id":811639,"title":"CRRES\/Ground-based multi-instrument observations of an interval of substorm activity,","authors":[],"date":"1994","doi":"10.1007\/s00585-994-1158-1","raw":"Yeoman, T. K., H. Lu È hr, R. W. H. Friedel, S. Coles, M. Grande Â , C. H. Perry, M. Lester, P. N. Smith, H. J. Singer, and D. Orr, CRRES\/Ground-based multi-instrument observations of an interval of substorm activity, Ann. Geophysicae, 12, 1174±1191, 1994. 702 T. K. Yeoman, H. Lu È hr: CUTLASS\/IMAGE observations of high-latitude convection features during substorms","cites":null},{"id":16628822,"title":"Current ¯ow in auroral loops and surges inferred from ground-based magnetic observations,","authors":[],"date":"1988","doi":null,"raw":"Space Sci., 36, 1359±1380, 1988. Kisabeth, J. L., and G. Rostoker, Current ¯ow in auroral loops and surges inferred from ground-based magnetic observations, J.","cites":null},{"id":16628894,"title":"Current disruption in the Earth's magnetosphere: observations and models,","authors":[],"date":"1996","doi":null,"raw":"Lui, A. T. Y., Current disruption in the Earth's magnetosphere: observations and models, J. Geophys, Res., 101, 13,067±13,088, 1996.","cites":null},{"id":808901,"title":"Current disruption in the Earth’s magnetosphere: observations and models,","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":805939,"title":"Current flow in auroral loops and surges inferred from ground-based magnetic observations,","authors":[],"date":"1988","doi":null,"raw":null,"cites":null},{"id":805169,"title":"Darn\/ Superdarn: a global view of the dynamics of high-latitude convection,","authors":[],"date":"1995","doi":null,"raw":"Greenwald, R. A., K. B. Baker, J. R. Dudeney, M. Pinnock, T. B. Jones, E. C. Thomas, J.-P. Villain, J. -C. Cerisier, C. Senior, C. Hanuise, R. D. Hunsucker, G. Sofko, J. Koehler, E. Nielsen, R. Pellinen, A. D. M. Walker, N. Sato, and H. Yamagishi, Darn\/ Superdarn: a global view of the dynamics of high-latitude convection, Space Science Reviews, 71, 761±796, 1995.","cites":null},{"id":811114,"title":"Ground magnetic signatures of moving elongated plasma clouds,","authors":[],"date":"1990","doi":null,"raw":"Wei, C. Q. and L. C. Lee, Ground magnetic signatures of moving elongated plasma clouds, J. Geophys. Res., 95, 2405±2418, 1990.","cites":null},{"id":16628814,"title":"Ground-based observations of ®eld-aligned currents in the auroral zone: Methods and results,","authors":[],"date":"1987","doi":null,"raw":"Glassmeier, K.-H., Ground-based observations of ®eld-aligned currents in the auroral zone: Methods and results, Ann. Geophysicae, 5, 115±126, 1987.","cites":null},{"id":804919,"title":"Ground-based observations of field-aligned currents in the auroral zone: Methods and results,","authors":[],"date":"1987","doi":null,"raw":null,"cites":null},{"id":809453,"title":"High spatial and temporal resolution observations of the ionospheric cusp.","authors":[],"date":"1995","doi":null,"raw":"Pinnock, M., A. S. Rodger, J. R. Dudeney, F. Rich, and K. B. Baker, High spatial and temporal resolution observations of the ionospheric cusp. Ann. Geophysicae, 13, 919±925, 1995.","cites":null},{"id":803910,"title":"hr: CUTLASS\/IMAGE observations of high-latitude convection features during substorms 701 G. Paschmann, Bursty bulk flows in the inner central plasma sheet,","authors":[],"date":"1992","doi":null,"raw":null,"cites":null},{"id":806706,"title":"Ionospheric convection and the substorm cycle,","authors":[],"date":"1992","doi":null,"raw":"Lockwood, M. and S. W. H. Cowley, Ionospheric convection and the substorm cycle, Proceedings of ICS-I, ESA SP-335, 99±109, 1992.","cites":null},{"id":16628821,"title":"Joint two-dimensional observations of ground magnetic and ionospheric electric ®elds associated with auroral zone currents 3. Auroral zone currents during the passage of a westward travelling surge,","authors":[],"date":"1981","doi":null,"raw":"Inhester, B., W. Baumjohann, R. A. Greenwald, and E. Nielsen, Joint two-dimensional observations of ground magnetic and ionospheric electric ®elds associated with auroral zone currents 3. Auroral zone currents during the passage of a westward travelling surge, J. Geophys.,49, 155±162, 1981. Kirkwood, S., H. J. Opgenoorth, and J. S. Murphree, Ionospheric conductivities, electric ®elds and currents associated with auroral substorms measured by the EISCAT radar, Planet.","cites":null},{"id":805717,"title":"Joint two-dimensional observations of ground magnetic and ionospheric electric fields associated with auroral zone currents 3. Auroral zone currents during the passage of a westward travelling surge,","authors":[],"date":"1981","doi":null,"raw":null,"cites":null},{"id":16628798,"title":"Lu È hr: CUTLASS\/IMAGE observations of high-latitude convection features during substorms 701G. Paschmann, Bursty bulk ¯ows in the inner central plasma sheet,","authors":[],"date":"1992","doi":null,"raw":"Angelopoulos, V., W. Baumjohann, C. F. Kennel, F. V. Coroniti, M. G. Kivelson, R. Pellat, R. J. Walker. H. Lu È hr, and T. K. Yeoman, H. Lu È hr: CUTLASS\/IMAGE observations of high-latitude convection features during substorms 701G. Paschmann, Bursty bulk ¯ows in the inner central plasma sheet, J. Geophys. Res., 97, 4027±4039, 1992.","cites":null},{"id":808331,"title":"Multi-instrument ground-based observations of a travelling convection vortices event,","authors":[],"date":"1996","doi":null,"raw":"Lu È hr, H., M. Lockwood, P. E. Sandholt, T. L. Hansen, and T. Moretto, Multi-instrument ground-based observations of a travelling convection vortices event, Ann. Geophysicae, 14, 162± 181, 1996.","cites":null},{"id":804583,"title":"Neutral line model of substorms: past results and present view,","authors":[],"date":"1996","doi":null,"raw":"Baker, D. N., T. I. Pulkkinen, V. Angelopoulos, W. Baumjohann, and R. L. McPherron, Neutral line model of substorms: past results and present view, J. Geophys. Res., 101, 12, 975±13,010, 1996. Baumjohann, W., R. J. Pellinen, H. J. Opgenoorth, and E. Nielsen, Joint two-dimensional observations of ground magnetic and ionospheric electric ®elds associated with auroral zone currents: current systems associated with local auroral break-ups, Planet.","cites":null},{"id":16628918,"title":"Polarization characteristics of Pi2 pulsations and implications for their source mechanisms: in¯uence of the westward travelling surge,","authors":[],"date":"1983","doi":null,"raw":"Samson, J. C., and G. Rostoker, Polarization characteristics of Pi2 pulsations and implications for their source mechanisms: in¯uence of the westward travelling surge, Planet. Space Sci., 31, 435±458, 1983.","cites":null},{"id":810331,"title":"Polarization characteristics of Pi2 pulsations and implications for their source mechanisms: influence of the westward travelling surge,","authors":[],"date":"1983","doi":null,"raw":null,"cites":null},{"id":806209,"title":"Polarization patterns of Pi2 magnetic pulsations and the substorm current wedge,","authors":[],"date":"1973","doi":null,"raw":"Geophys. Res., 78, 5573±5584, 1973. Lester, M., W. J. Hughes, and H. J. Singer, Polarization patterns of Pi2 magnetic pulsations and the substorm current wedge, J.","cites":null},{"id":811609,"title":"Polarization, propagation and MHD wave modes of Pi2 pulsations: SABRE\/ SAMNET results,","authors":[],"date":"1991","doi":"10.1016\/0032-0633(91)90104-I","raw":null,"cites":null},{"id":16628924,"title":"Quantitative models of the magnetospheric magnetic ®eld: methods and results,","authors":[],"date":"1990","doi":null,"raw":"Tsyganenko, N. A., Quantitative models of the magnetospheric magnetic ®eld: methods and results, Space Sci. Rev., 54, 75±186, 1990.","cites":null},{"id":810878,"title":"Quantitative models of the magnetospheric magnetic field: methods and results,","authors":[],"date":"1990","doi":null,"raw":null,"cites":null},{"id":16628903,"title":"Radar observations of auroral zone ¯ows during a multiple-onset substorm,","authors":[],"date":"1995","doi":null,"raw":"Morelli, J. P., R. J. Bunting, S. W. H. Cowley, C. J. Farrugia, M. P. Freeman, E. Friis-Christensen, G. O. L. Jones, M. Lester, R. V. Lewis, H. Lu È hr, D. Orr, M.Pinnock, G. D. Reeves, P. J. S. Williams, and T. K. Yeoman, Radar observations of auroral zone ¯ows during a multiple-onset substorm, Ann. Geophysicae, 13, 1144±1163, 1995. Opgenoorth, H. J., R. J. Pellinen, W. Baumjohann, E. Nielsen, G. Marklund, and L. Eliasson, Three dimensional current ¯ow and particle precipitation in a westward travelling surge (observed during the Barium-GEOS rocket experiment), J.","cites":null},{"id":809203,"title":"Radar observations of auroral zone flows during a multiple-onset substorm,","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":807582,"title":"Simultaneous observation of the poleward expansion of substorm electrojet activity and the tailward expansion of current sheet disruption in the near-Earth magnetotial,","authors":[],"date":"1993","doi":null,"raw":"Lopez, R. E., H. E. J. Koskinen, T. I. Pulkkinen, T. Bo È singer, R. W. McEntire, and T. A. Potemra, Simultaneous observation of the poleward expansion of substorm electrojet activity and the tailward expansion of current sheet disruption in the near-Earth magnetotial, J. Geophys. Res., 98, 9285±9295, 1993.","cites":null},{"id":809147,"title":"Substorm correlated absorption on a 3200 km transauroral HF propagation path,","authors":[],"date":"1996","doi":null,"raw":"Milan, S. E., T. B. Jones, M. Lester, E. M. Warrington, and G. D. Reeves, Substorm correlated absorption on a 3200 km transauroral HF propagation path, Ann. Geophysicae, 14, 182±190, 1996.","cites":null},{"id":811357,"title":"The high-latitude convection response to an interval of substorm activity,","authors":[],"date":"1996","doi":"10.1007\/s00585-996-0518-4","raw":"Yeoman, T. K., and M. Pinnock, The high-latitude convection response to an interval of substorm activity, Ann. Geophysicae, 14, 518±532, 1996.","cites":null},{"id":807843,"title":"The IMAGE magnetometer network,","authors":[],"date":"1994","doi":null,"raw":"Lu È hr, H., The IMAGE magnetometer network, STEP International Newsletter, 4, (10), 4±6, 1994. Lu È hr, H., and K. Schlegel, Combined measurements of EISCAT and the EISCAT magnetometer cross to study W bands, J.","cites":null},{"id":16628840,"title":"The ionospheric plasma ¯ow and current patterns of travelling convection vortices: a case study,","authors":[],"date":"1993","doi":null,"raw":"Lu È hr, H., W. Blawert, and H. Todd, The ionospheric plasma ¯ow and current patterns of travelling convection vortices: a case study, J. Atmos. Terr. Phys., 55, 1717±1727, 1993.","cites":null},{"id":808076,"title":"The ionospheric plasma flow and current patterns of travelling convection vortices: a case study,","authors":[],"date":"1993","doi":null,"raw":null,"cites":null},{"id":16628829,"title":"The ionospheric signatures of ¯ux transfer events and solar wind dynamic pressure changes,","authors":[],"date":"1990","doi":null,"raw":"Lockwood, M., S. W. H. Cowley, P. E. Sandholt, and R. P. Lepping, The ionospheric signatures of ¯ux transfer events and solar wind dynamic pressure changes, J. Geophys. Res., 95, 17, 113± 135, 1990.","cites":null},{"id":807038,"title":"The ionospheric signatures of flux transfer events and solar wind dynamic pressure changes,","authors":[],"date":"1990","doi":null,"raw":null,"cites":null},{"id":810050,"title":"The magnetotail and substorms,","authors":[],"date":"1973","doi":null,"raw":"Russell, C. T., and R. L. McPherron, The magnetotail and substorms, Space Sci. Rev., 15, 205±266, 1973.","cites":null},{"id":806469,"title":"The response of ionospheric convection in the polar cap to substorm activity,","authors":[],"date":"1995","doi":null,"raw":"Lester, M., M. Lockwood, T. K. Yeoman, S. W. H. Cowley, H. Lu È hr, R. Bunting, and C. J. Farrugia, The response of ionospheric convection in the polar cap to substorm activity, Ann. Geophysicae, 13, 147±158, 1995.","cites":null},{"id":809745,"title":"Towards a self-consistent non-linear theory of radar-auroral backscatter,","authors":[],"date":"1986","doi":null,"raw":"Robinson, T. R., Towards a self-consistent non-linear theory of radar-auroral backscatter, J. Atmos. Terr. Phys., 48, 417±422, 1986. Rostoker, G., S.-I. Akasofu, J. Foster, R. A. Greenwald, Y. Kamide, K. Kawasaki, A. T. Y. Lui, R. L. McPherron, and C. T. Russell, Magnetospheric substorms ± de®nition and signatures, J.","cites":null},{"id":805445,"title":"Transient phenomena in the magnetotail and their relation to substorms,","authors":[],"date":"1979","doi":null,"raw":"Hones, E. W. Jr., Transient phenomena in the magnetotail and their relation to substorms, Space Sci. Rev., 23, 393±410, 1979.","cites":null},{"id":810597,"title":"Variations in the polar cap area during intervals of substorm activity on","authors":[],"date":"1990","doi":null,"raw":"Taylor, J. R., T. K. Yeoman, M. Lester, B. A. Emery, and D. J. Knipp, Variations in the polar cap area during intervals of substorm activity on March 20±21, 1990 deduced from AMIE convection patterns, Ann. Geophysicae, 14, 879±887, 1996.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1997","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/67704.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/35244\/1\/art_438.pdf","pdfHashValue":"0c06059c373a6ed0dc1cec10ef385c897eb87477","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:35244<\/identifier><datestamp>\n      2018-01-24T03:06:45Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        CUTLASS\/IMAGE observations of high latitude convection features during substorms<\/dc:title><dc:creator>\n        Yeoman, T.K.<\/dc:creator><dc:creator>\n        Lühr, H.<\/dc:creator><dc:date>\n        1997<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/35244\/1\/art_438.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1007\/s00585-997-0692-z<\/dc:relation><dc:identifier>\n        Yeoman, T.K. and Lühr, H. (1997) CUTLASS\/IMAGE observations of high latitude convection features during substorms. Annales Geophysicae, 15 (6). pp. 692-702. ISSN 0992-7689<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/35244\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1007\/s00585-997-0692-z","http:\/\/eprints.lancs.ac.uk\/35244\/"],"year":1997,"topics":[],"subject":["Journal Article","PeerReviewed"],"fullText":"CUTLASS\/IMAGE observations of high-latitude convection features\nduring substorms\nT. K. Yeoman1, H. Lu¨hr2\n1 Department of Physics and Astronomy, University of Leicester, University Road, Leicester, LE1 7RH, UK\n2 GeoForschungsZentrum Postdam, Telegrafenberg, D-14473 Postdam, Germany\nReceived: 18 September 1996 \/Revised: 24 January 1997 \/Accepted 10 February 1997\nAbstract. The CUTLASS Finland HF radar has been\noperational since February 1995. The radar frequently\nobserves backscatter during the midnight sector from a\nlatitude range 70–75° geographic, latitudes often asso-\nciated with the polar cap. These intervals of backscatter\noccur during intervals of substorm activity, predomi-\nnantly in periods of relatively quiet magnetospheric\nactivity, with Kp during the interval under study being 2-\nand SKp for the day being only 8-. During August 1995\nthe radar ran in a high time resolution mode, allowing\nmeasurements of line-of-sight convection velocities\nalong a single beam with a temporal resolution of\n14 s, and measurement of a full spatial scan of line-of-\nsight convection velocities every four minutes. Data\nfrom such scans reveal the radar to be measuring return\nflow convection during the interval of substorm activity.\nFor three intervals during the period under study, a\nreduction in the spatial extent of radar backscatter\noccurred. This is a consequence of D region HF\nabsorption and its limited extent in the present study\nis probably a consequence of the high latitude of the\nsubstorm activity, with the electrojet centre lying\nbetween 67° and 71° geomagnetic latitude. The high\ntime resolution beam of the radar additionally demon-\nstrates that the convection is highly time dependent.\nPulses of equatorward flow exceeding \u0018600 m s)1 are\nobserved with a duration of \u00185 min and a repetition\nperiod of \u00188 min. Their spatial extent in the CUTLASS\nfield of view was 400–500 km in longitude, and 300–\n400 km in latitude. Each pulse of enhanced equatorward\nflow was preceded by an interval of suppressed flow and\nenhanced ionospheric Hall conductance. The transient\nfeatures are interpreted as being due to ionospheric\ncurrent vortices associated with field aligned current\npairs. The relationship between these observations and\nsubstorm phenomena in the magnetotail is discussed.\n1 Introduction\nSubstorm physics remains a very active field and in spite\nof recent progress towards an understanding of the\nsubstorm process, that understanding is as yet incom-\nplete. The magnetospheric processes which lead to the\nexpansion phase onset, the location of this onset region\nand the relationship between the possible magneto-\nspheric source regions and the ionospheric phenomena\ninvolved in substorm breakup are still a matter for\ndebate. A topic of particular interest is the spatial and\ntemporal development of the ionospheric conductivities\nand electric field in the auroral electrojets, which are\nknown to be highly time-dependent (e.g. Kirkwood\net al., 1988) and which combine to produce the charac-\nteristic ground magnetic perturbations during the sub-\nstorm expansion phase. Localised electrojet features in\nwhich ionospheric flows were suppressed to values as\nlow as 50 m s)1 and accelerated up to values as high as\n1 km s)1 have been observed within a few minutes,\naccompanied by conductance variations between 20 and\n100 S (Morelli et al., 1995), whilst Yeoman and Pinnock\n(1996) observed the evolution of the overall convection\npattern on a time scale of only \u001810 min. This study\nexploits for the first time the potential for HF radars to\nmake very high time resolution (14 s) measurements of\nthe ionospheric plasma convection velocity during the\nhighly dynamic substorm expansion phase and relates\nthese signatures to the local ground magnetic field\nmeasurements. The HF radar technique is particularly\nuseful in the high conductivity, low electric field region\nof the ionospheric location of substorm onset where a\ndrop out in E region backscatter, indicative of low flow\nvelocity (a consequence of VHF E region radar instru-\nmental threshold e\u0080ects, see, e.g. Robinson, 1986), has\nhampered previous VHF radar studies (Baumjohann\net al., 1981; Inhester et al., 1981; Opgenoorth et al.,\n1983). However, substorm-associated HF absorption\nhas, in the past, limited the use of HF radars to a smallCorrespondence to: T. K. Yeoman\nAnn. Geophysicae 15, 692–702 (1997) Ó EGS – Springer-Verlag 1997\nnumber of studies where extensive regions of velocity\nmeasurements were possible (Morelli et al., 1995;\nYeoman and Pinnock, 1996).\nIn the present study an analysis of HF radar\nmeasurements of ionospheric convection and the loca-\ntion and dynamics of the auroral electrojets from\nground magnetometers is presented. This demonstrates\nthat for intervals of quiet magnetic activity, when the\nmain substorm electrojets are at high latitudes (\u001870°\ngeomagnetic), HF absorption has only a limited e\u0080ect\non the radar observations of the substorm expansion\nphase. Furthermore these observations provide a con-\ntext for data from the high time resolution beam of the\nCUTLASS Finland radar, which has revealed new\nobservations of transient convection vortices in the\nsubstorm expansion phase. These vortices are charac-\nterised with the radar and magnetometer data and their\nrelationship with magnetotail phenomena is discussed.\n2 Instrumentation\nThe ionospheric convection velocities in this study are\nprovided by the Finland radar of the Co-operative UK\nTwin-Located Auroral Sounding System (CUTLASS).\nCUTLASS is a bistatic HF coherent radar, with stations\nin Finland and Iceland, and forms part of the interna-\ntional SuperDARN chain of HF radars (Greenwald\net al., 1995). Each radar of the system is a frequency\nagile (8–20 MHz) radar, routinely measuring the line-of-\nsight (1-o-s) Doppler velocity and spectral width of, and\nthe backscattered power from, ionospheric plasma\nirregularities. The radars form 16 beams of separation\n3.24°. Each beam is gated into 75 range bins, each of\nlength 45 km in standard operations. During standard\noperations the dwell time for each beam is 7 s, giving a\nfull 16 beam scan, covering 52° in azimuth and over\n3000 km in range (an area of over 4 ´ 106 km2), every 2\nmin. Common-volume data from the two stations can\nbe combined to provide convection velocities perpen-\ndicular to the magnetic field, although the interval under\nstudy here occurred before the completion of the Iceland\nradar. For this interval the Finland radar was operating\na non-standard scan mode. In this mode, rather than the\nusual anticlockwise sweep through beams 15, 14, 13,..., 0\nthe sequence 15, 9, 14, 9, 13, 9,..., 1, 9, 0, 9 was\nemployed. This allows the construction of full 16 beam\nscans at a reduced temporal resolution of 4 min, in\naddition to the provision of high time resolution (14 s)\ndata along a single look direction (in this case beam 9, a\nbeam which approximately overlies the main meridional\nchain of the IMAGE array). Such radar modes were first\nused by Pinnock et al., (1995) for studies of the\nionospheric footprint of the cusp. This dataset is\nsupplemented here by data from ground magnetome-\nters, provided by stations from two arrays, the UK Sub-\nAuroral Magnetometer Network (SAMNET) (Yeoman\net al. 1990), and the International Monitor for Auroral\nGeomagnetic E\u0080ects, IMAGE) (Lu¨hr, 1994). The in-\nstruments are fluxgate magnetometers. SAMNET has a\nsampling interval of 5 s and the IMAGE array has 10 s\nsampling for the interval under consideration here. The\nIMAGE data is presented in X, Y, Z coordinates, where\nX is geographic northwards, Y geographic eastwards\nand Z is vertically downwards. All data have had a quiet\nday mean subtracted. The field-of-view of the CUT-\nLASS Finland radar, together with the locations of the\nground magnetometers used in this study, are illustrated\nin Fig. 1.\n3 Observations\nFigure 2 presents the X and Z component magnetic field\nmeasurements from a subset of the IMAGE array,\nforming a meridional chain from Svalbard to northern\nScandinavia. Mid-latitude Pi2 measurements from both\nthe IMAGE and SAMNET arrays (OUJ only shown,\nfiltered between 200 and 20 s, bottom panels of Fig. 2)\nhave been used to provide a reference onset time for the\nsubstorm onsets\/intensifications studied in this work\n(Rostoker et al., 1980). The times of these mid-latitude\nPi2s for the eight substorm events identified by this\nFig. 1. Locations of the field-of-view of the CUTLASS Finland\nradar together with the IMAGE and SAMNET magnetometer\nstations used in this study. Beam 9 of CUTLASS Finland, which is\nsampled at a high rate, is marked by a dashed line\nT. K. Yeoman, H. Lu¨hr: CUTLASS\/IMAGE observations of high-latitude convection features during substorms 693\nmechanism are marked in Fig. 2 by vertical lines and are\n(\u008b 1 minute): 19:52, 20:08, 20:26, 20:33, 20:57, 22:08,\n22:19, and 22:54 UT.\n3.1 Ground-based magnetic response\nThe mid-latitude X andY component magnetic field data\nfrom the SAMNET array, as well as timing the substorm\nonset\/intensification, have been utilised here to deter-\nmine the longitudinal position of the substorm current\nwedge (SCW) for each onset\/intensification (see e.g.\nLester et al., 1983; Yeoman et al., 1991). The north, X,\nand vertical, Z, components of the magnetic field\nmeasured by the higher latitude IMAGE stations can\nbe employed in a similar fashion to the SAMNET X and\nY component data, to provide information on the\nlocation of the substorm-enhanced westward electrojet\n(e.g. Kisabeth and Rostoker, 1973; Samson and Rostok-\ner, 1983) and hence the latitude of the centre of the\nelectrojet. The high-latitude stations can also give an\nindication of the longitude of the westward travelling\nsurge.\nThe mid-latitude magnetometer bay structure (not\nshown) provides the following picture of the longitudi-\nnal development of the substorms during this interval.\nAt 19:52 UT a broad SCW was observed the location of\nwhich, relative to the ground instrumentation, is un-\nclear. At 20:08 UT another substorm onset was\nobserved to the east of the ground magnetometers.\nNeither of these onsets was centred near auroral zone\nmagnetometers displayed in Fig. 2, and no strong\ncurrent systems are observed local to these magnetom-\neter stations. At 20:26 UT a stronger substorm expan-\nsion phase onset signature was observed. The SCW for\nthis event was centred east of the magnetometer arrays,\nwith the upward field aligned current (FAC) between the\nlongitudes of KVI and NUR. An intensification of this\nsubstorm occurred at 20:33 UT. Both these onsets had\nmagnetic signatures of moderately strong current sys-\ntems near the auroral zone instrumentation. Subse-\nquent to this a small substorm signature was observed\nwest of the instrumentation at 20:57 UT. Stronger\nsubstorm activity was observed later at 22:08 UT. The\nSCW for this event was centred over the longitude\nof NOR with the upward FAC to the west of the\ninstrumentation. There was a further intensification of\nthis event at 22:19 UT. The final substorm event in the\ninterval is a distant event to the west of the instrumen-\ntation at 22:54 UT.\nFig. 2a, b. Ground magnetograms from the IMAGE array a X\ncomponents, bZ components. A subset of the IMAGE array, forming\na meridional chain from Svalbard to northern Scandinavia, is\ndisplayed.Abandpass filtered (200 – 20 s) trace fromOUJ, highlighting\nPi2 pulsation activity, is included in the bottom panel. Substorm\nexpansion phase onset\/intensifications are marked with vertical lines\n694 T. K. Yeoman, H. Lu¨hr: CUTLASS\/IMAGE observations of high-latitude convection features during substorms\nThe IMAGE magnetograms in Fig. 2 reveal clear\nmagnetic field perturbations due to local auroral\nsubstorm current systems for onsets, 3, 4, 6 and 7. At\n20:26 UT a substorm-enhanced westward electrojet\ncentred between MAS and SOR is clearly visible in the\nX and Z component magnetic field. This is coincident\nwith mid-latitude magnetometer observations of an\nupward FAC just to the west of the IMAGE stations\nof Svalbard. The largest electrojet signature observed in\nthe X component for this onset is at SOR. Seven minutes\nlater an intensification of this expansion phase onset is\nobserved, at 20:33 UT. This intensification sees the\nelectrojet centre, deduced from the strongest negative X\ncomponent perturbation and the positive Z component\nperturbation of the magnetic field at BJN, move\npoleward to just south of BJN. This onset has also\nexpanded to the west. The transient Z component\nobserved at SOR at this time is most probably due to\ncoastal induction e\u0080ects. The substorm onset indicated\nby Pi2 activity at 20:56 UT is not very clear in the\nIMAGE magnetograms. At JAN, however, 25° to the\nwest, the expected decrease in the X component is\nobserved. The westward electrojet to the east at BJN\nappears to intensify only after 21:05 UT, and it is this\nintensification which will be at the centre of the\nsubsequent study. The substorm onset at 22:08 UT is\ncentred between the latitudes of SOR and BJN, with the\nlargest auroral zone signatures in fact being observed to\nthe west of these stations at JAN. The centre of the\nintensification at 22:19 UT moves north and east, close\nto BJN.\n3.2 Radar measurements of ionospheric convection\nData from the 4-min full 16-beam scans of the radar\n(not shown) reveal the following overall pattern: prior to\n\u001820:30 UT the west-pointing beams of the radar were\nobserving line-of-sight flow away from the radar and the\neast-pointing beams, flow toward the radar. Such flows\nare indicative of return flow in the dusk convection cell.\nFrom 20:30 UT through to 22:30 UT flow across the\nentire field-of-view of the radar was toward the radar,\nindicative that the radar was in a region of equatorward\nflow in the convection reversal region between the two\nmain cells of return flow. The flow during these times\nwas fairly slow, not in general exceeding 200 m s)1. After\n22:30 UT a pattern of flow toward the radar in the west-\npointing beams and line of sight flow away from the\nradar in the east-pointing beams was observed, indicat-\ning that the radar had moved into the return flow region\nof the dawn convection cell.\nA summary of the convection velocity response to the\ninterval of substorm activity is given in Fig. 3a. This\nfigure presents the CUTLASS high time resolution line-\nof-sight Doppler velocity measurements from beam 9\nfrom 19:00–24:00 UT. The line-of-sight velocity is\ndisplayed as a function of time and geomagnetic latitude\n(throughout this study altitude adjusted corrected geo-\nmagnetic, or AACGM, coordinates, based on Baker and\nWing, 1989 are employed). A colour scale representation\nis used, with flow toward the radar (equatorward flow,\npositive Doppler velocity) plotted in blue and flow away\nfrom the radar (poleward flow, negative Doppler\nvelocity) plotted in red. Beam 9 is the high time\nresolution beam which most closely overlies the meri-\ndional magnetometer chain displayed in Fig. 2, and is\nillustrated as a dashed line in Fig. 1. The line-of-sight\nvelocity in beam 9 is toward the radar from 19:00–23:20\nUT, indicative of the dusk sector return flow and\nequatorward flow described in the preceding paragraph.\nAfter 23:20 UT flow is predominantly away from the\nradar as the radar enters the dawn return flow convec-\ntion cell.\nOne clear substorm-associated signature in the HF\nradar data in Fig. 3a are the periods of reduced\nbackscatter in the intervals 20:07–20:12 UT, 20:27–\n20:44 UT and 22:02–22:24 UT. These ‘‘dropouts’’ in\nradar backscatter are clearly correlated with five of the\nsubstorm onsets, and smaller dropouts may be corre-\nlated with the other three. The first of these dropouts in\nbackscatter is observed at the same time as a substorm\nonset, the mid-latitude magnetic signature of which\nplaces it to the east of beam 9 of the radar. The second,\nand largest, is observed during the substorm onset and\nsubsequent intensification which occurred close to the\nauroral instrumentation, although centred to the east, at\n20:26 UT and 20:33 UT respectively. The final dropout\noccurred during the later substorm event which was\nagain nearby the ground instrumentation but this time\ncentred to the west. In spite of these dropouts, the\nCUTLASS Finland radar records some backscatter\nthroughout the interval of substorm activity, and a\nsubstantial band of backscatter, extending from 65°–73°\ngeomagnetic, some 890 km, is observed for the majority\nof the interval under study. The minimum coverage of\nthe radar occurs at 20:33 UT, when the data is reduced\nto a narrow band of 2° (\u0018220 km) between 65° and 67°\ngeomagnetic latitude.\n3.3 Expansion phase convection\nIn addition to the overall ionospheric convection and\nHF absorption features associated with the substorm\nprocess outlined in the previous section, a number of\nvery dynamic features are observed in the geomagnetic\nfield between 20:50 and 21:40 UT. In Fig. 2 these can be\nseen most clearly in the X component magnetic field at\nBJN. The magnetic signatures of these dynamic features\nin the X and Y component at BJN and SOR are\npresented in more detail in Fig. 4, along with the line of\nsight velocity from beam 9, range gate 25 of the\nCUTLASS Finland radar, which lies close to overhead\nof BJN. In spite of the expansion phase onset and\nintensification at 20:27 and 20:33 UT, which have\nresulted in a restriction of HF backscatter in the interval\n20:27–20:44 UT, measurements of ionospheric velocity\nare available from 8° of magnetic latitude after that\ntime. In Fig. 4 the magnetic signatures can clearly be\nseen to be accompanied by dynamic convection velocity\nmeasurements. The equatorward velocity pulses mea-\nT. K. Yeoman, H. Lu¨hr: CUTLASS\/IMAGE observations of high-latitude convection features during substorms 695\nFig. 3. a Line-of-sight velocity from beam 9 of the CUTLASS\nFinland radar, as a function of magnetic latitude and time, showing\ndynamic convection velocity features and intervals of substorm-\nassociated HF absorption. Substorm expansion phase onsets\/intensi-\nfications are marked with vertical lines. Positive Doppler velocities are\ntowards the radar (equatorwards) and negative Doppler velocities are\naway from the radar (polewards); b CUTLASS Finland line-of-sight\nvelocities as a function of magnetic latitude and time. The equivalent\ncurrent intensities derived from the magnetic field data from SOR,\nBJN and HOP are overlaid at the magnetic latitude appropriate for\neach station. The upper panel presents an estimate of the Hall\nconductance, derived from the BJN magnetic field and the line-of-\nsight velocity from the overlying range gate (see text for details)\n696 T. K. Yeoman, H. Lu¨hr: CUTLASS\/IMAGE observations of high-latitude convection features during substorms\nsured by CUTLASS are marked in the figure by shaded\nbars. In Fig. 4 it is apparent that, for the central three\nvelocity perturbations at least, negative perturbations in\nthe Y component at BJN are associated with pulses of\nstrong equatorward flow measured in beam 9 of the\nCUTLASS Finland radar, although the magnetic sig-\nnatures lead the flow signatures by \u001870 s. This o\u0080set is\ndiscussed in more detail in Sect. 4.2. There is evidence of\nslight negative Y perturbations in the first and last\nvelocity pulses. These pulses are typically of 5 min\nduration, with an inter-pulse interval of about 3 min.\nThey peak at a line-of-sight flow of \u0018600 m s)1. The\nspatial extent of these pulses can be measured using the\n4-min resolution, 16 beam scan of the CUTLASS radar.\nCare needs to be taken with this data, as the duration of\nthe scan is comparable with the duration of the velocity\npulses. In Fig. 5, however, the scan from 21:10:17 to\n21:14:17 UT is displayed. A greyscale representation is\nused, with flow toward the radar plotted in dark shading\nand flow away from the radar plotted in light shading.\nThe whole of this scan occurred during the third\nequatorward velocity pulse displayed in Fig. 4, and thus\ntemporal e\u0080ects are not preventing an estimation of the\napparent spatial extent of the pulse. The pulse can be\nseen to occupy some 5–6 beams of the CUTLASS scan,\ncorresponding to 400–500 km in longitude, and some 7–\n9 range gates, corresponding to 300–400 km in latitude,\nalthough the pulse is present in the observed backscatter\nup to its poleward edge, and thus it may well have a\ngreater poleward extent than that measured here. In\nadditional to quantifying the spatial extent of the\nvelocity pulses, the scan data from CUTLASS can, in\nconjunction with the high time resolution data from\nbeam 9, reveal any propagation e\u0080ects in the data. The\nradar data do not reveal any measurable azimuthal\npropagation e\u0080ects in the pulses of ionospheric velocity,\nrather they appear to form in a given position, grow,\nand then decay. Azimuthally separated IMAGE stations\ncan give additional information on any propagation of\nthe pulses. Such magnetometer data provide some\nevidence for an eastward propagation of the features,\nshowing either a small or a zero time delay between\nazimuthally separated magnetometer stations.\n4 Discussion\n4.1 HF absorption\nAn important feature in the HF radar observations of\nionospheric convection during substorms is the periods\nof reduced backscatter in the intervals 20:07–20:12 UT,\n20:27–20:44 UT and 22:02–22:24 UT. These reductions\nin observed backscatter are the result of D region\nabsorption of the radar’s HF radiation as a consequence\nof enhanced energetic particle precipitation during the\nFig. 4. Line of sight velocity data from beam 9, range gate 25 of the\nCUTLASS Finland radar (top panel) which approximately overlies\nBJN, and the X and Y components of the magnetic field measured at\nBJN and SOR. The times of equatorward velocity pulses are marked\nby shaded bars\nFig. 5. Line of sight velocity data from a 4 min, 16 beam\nanticlockwise scan of the CUTLASS Finland radar recorded between\n21:10:17–21:14:17 UT, indicating the spatial extent of one of the\nequatorward velocity pulses shown in Fig. 4. The locations of\nIMAGE magnetometer stations are also indicated\nT. K. Yeoman, H. Lu¨hr: CUTLASS\/IMAGE observations of high-latitude convection features during substorms 697\nsubstorm process (e.g. Milan et al., 1996). In spite of\nthese dropouts, the CUTLASS Finland radar records\nbackscatter throughout the interval of substorm activ-\nity, with a substantial band extending over some 890 km\nfor the majority of the interval under study and a\nminimum coverage 220 km. The significant losses of HF\nbackscatter are confined to events close enough to the\ninstrumentation for large auroral zone electrojet pertur-\nbations to be observed in the nearby ground magneto-\nmeters, and occur regardless of whether these currents\nare centred to the west or east of the instruments.\nPreviously HF radar studies of the substorm expansion\nphase have been limited as a consequence of this\nabsorption process, with relatively few studies published\nwith an extensive region of HF backscatter (Morelli\net al., 1995; Yeoman and Pinnock, 1996). The limited\ne\u0080ect of HF absorption in the present study is probably\na consequence of the relatively high latitude of the\nsubstorm activity recorded here, with the electrojet\ncentre lying between 67° and 71° geomagnetic latitude.\nThese high-latitude substorm onsets occur during an\ninterval of quiet magnetic activity, with Kp during the\ninterval being 2- and SKp for the day being only 8-.\nThese magnetic activity conditions have enabled HF\nbackscatter from a region covering 65°–73° geomagnetic\nunder the summer, night time conditions prevailing\nhere.\n4.2 Transient convection features\nThe observation of the temporal and spatial extent of\ntransient bursts of equatorward flow in the substorm\nexpansion phase provided by such high time resolution\nCUTLASS HF radar data is new, although some\nevidence of bursty flows, associated with substorms,\nhas been seen before (Lester et al., 1995; Morelli et al.,\n1995). The morphology of the ionospheric flows causing\nthe CUTLASS observations can be further investigated\nby comparing the convection velocity measurements\nmade by the CUTLASS radar with the magnetic field\nvariations measured by the IMAGE magnetometer\nstations in the Svalbard region. One likely candidate\nmechanism is a pattern of vortical ionospheric currents,\nproduced by pairs of upward and downward field\naligned currents in the magnetosphere. The magnetic\nfield signature of such a current system for a homoge-\nneous conductivity distribution has been modelled by\nWei and Lee (1990) and the plasma streamlines in the\nionosphere and the resultant ground magnetic field\nsignature are displayed in Fig. 6. The magnetic field\nvariations associated with the CUTLASS velocity pulse\nmeasurements can be identified from the polarities of the\nchanges in the X and Y components of the magnetic field\nmeasured in the region of the velocity pulse, such as\nthose presented in Fig. 4. The polarities of the field\nchanges can be compared with those expected from the\nmodelling presented in Fig. 6. The polarities of the X\nand Y component magnetic field measurements from the\nIMAGE stations on Svalbard and in northern Scandi-\nnavia are qualitatively consistent with the picture of a\nHall current vortex from a pair of field aligned currents.\nFor the first equatorward flow pulse (observed between\n20:50 and 20:54 UT) this current system, based on the\nIMAGE magnetometer observations, appears to be\ncentred over BJN. The subsequent two pulses are\nslightly south and east of this. These magnetometer\nobservations are consistent with the locations of the\nequatorward flows observed with the CUTLASS radar\nin each case. The full scan data from the CUTLASS\nradar (Fig. 5) has in addition allowed an estimate of the\nsize of the vortex system to be made, and it appears to\nbe of order 500 km extent in both latitude and\nlongitude. This interpretation assumes an essentially\nstationary pair of current vortices growing and fading in\nthe radar field-of-view.\nAlthough the high time resolution beam 9 has\nenabled a study of the substorm-associated flow tran-\nsients, a full characterisation of the flow vortex as\npresented in Fig. 5 is hampered by 4-min full scan\nperiod. An estimate of the vortex size can only be\nattempted when the whole of a radar scan occurs during\nthe velocity pulse and thus temporal e\u0080ects are not\npreventing a proper estimation of the spatial extent of\nthe pulse. Even in such a case the monostatic nature of\nthe radar data means that the measurements are\ndominated by the north-south velocity components.\nThe use of magnetometer equivalent currents, discussed\nnext in this section and illustrated in Fig. 3 and Fig. 7,\nprovide the best indication of the vortical nature of the\nionospheric flows.\nAn alternative interpretation to the sequence of\nmagnetic field and velocity perturbations associated\nwith the transient features is that they are caused by a\nmotion of the current systems, analogous to that of an\nW-band (e.g. Lu¨hr and Schlegel, 1994). Such a motion is\nsuggested by a phase delay of the Y component at HOP\nof about 40 s with respect to HOR. An appropriate way\nto visualise moving transient current features is to plot\nsequences of equivalent current vectors from a chain of\nstations which is approximately perpendicular to the\ndirection of motion. For an E region current system\nwith a spatial extent of greater than the E region height,\nand assuming a horizontally uniform ionospheric con-\nductivity, then the ground magnetic field deflections, b,\nFig. 6. a Plasma streamlines associated with a pair of field aligned\ncurrents, marked by up-arrow and down-arrow symbols. b and c show\nthe Bx and By magnetic field perturbations associated with the\nstreamlines in a (after Wei and Lee, 1990)\n698 T. K. Yeoman, H. Lu¨hr: CUTLASS\/IMAGE observations of high-latitude convection features during substorms\ncan be related to an ionospheric equivalent current\nintensity, J, by\nJx \u0088 ÿ 2l0\nby Jy \u0088 2l0\nbx; \u00851\u0086\nwhere x and y indicate the northward and eastward\ncomponents respectively. Since the features appear to\nmove eastwards, according to the observed propagation\ndelay, the current vectors have to be plotted against an\ninverted time scale to give a correct image of the spatial\ncurrent distribution (see e.g. Lu¨hr and Schlegel, 1994).\nFigure 7 presents such equivalent current patterns\nderived from IMAGE stations NAL through SOR for\nthe most active period 20:55 to 21:51 UT. The time\nseries at HOP has been shifted by 40 s to make it fit the\nstations along the meridian. During the interval dis-\nplayed at least five vortices centred near BJN, and\nshowing alternating senses of rotation can be identified:\n20:57:30 UT (anticlockwise, ACW), 21:00:30 UT (clock-\nwise, CW), 21:03:30 UT (ACW), 21:07:10 UT (CW) and\n21:11:30 UT (ACW). Clockwise and anticlockwise\ncurrent vortices are associated with downward and\nupward FACs respectively (Fig. 6).\nIn the case of a time-stationary current system\nmoving overhead, temporal variations can converted\ninto spatial scales. The deduced time delay between\nHOR and HOP implies an eastward propagation speed\nof £ 6 km s)1, depending on the orientation of the\ncurrent front. Since the vortex centres are separated by\n\u00183 min, this converts to a distance between antiparallel\nFAC filaments of £ 1800 km. This derived separation is\nsignificantly larger than the width of the high flow\nregion determined by the CUTLASS radar. This is likely\nto be due in part to the e\u0080ect of the CUTLASS scanning\nmode. The CUTLASS Finland scan during this interval\nran from east to west. If the current vortex features\npropagate eastwards, then the observed longitudinal\nextent is given by\nk \u0088 kc 1\u0087 vfeaturevscan\n\u0012 \u0013\n\u0081 1000 km \u00852\u0086\nwhere kc = 500 km is the width of the feature deduced by\nCUTLASS, vfeature \u0088 6 km s)1 is the eastward velocity of\nthe current features and vscan \u0088 5:5 km s)1 is the velocity\nof the CUTLASS scan at the latitude of BJN. With this\ncorrection both estimates become more consistent.\nUnfortunately the propagation cannot be confirmed by\nthe azimuthally separated IMAGE stations TRO and\nKEV further south. This may be a consequence of the\nvortex feature being smaller at these latitudes and thus\nthese magnetograms being dominated by other e\u0080ects.\nThe observed signaturemaywell actually arise from some\ncombination of growth\/fading and propagation.\nAn examination of the line of sight velocity from a\nsingle range-beam cell during the impulsive convection\nfeatures presented in the top panel of Fig. 4, in addition\nto clearly demonstrating the equatorward pulses (pos-\nitive Doppler velocity) also reveals a suppression of flow\nprior to each burst of flow for pulses 1, 3, 4 and 5. The\nmorphology, duration, repetition rate and spatial extent\nof these features are very similar to the impulsive\nelectrojet signatures seen with the PACE radar at Halley,\nAntarctica, by Morelli et al. (1995). Morelli and co-\nworkers interpreted these reductions in flow as being a\nconsequence of very high ionospheric conductivity due\nto particle precipitation during the substorm cycle, with\nthe subsequent equatorward pulses occurring when the\nconductivity dropped after precipitation halted.\nThe impulsive vortex features described occur during\na period of equatorward flow of \u0018200 m s)1, and follow\non 18–70 min after the substorm expansion phase onset.\nThere is no evidence of Pi2 pulsation activity accompa-\nnying the features, unlike the observations of Morelli\net al., (1995) where the majority of impulsive features\nwere accompanied by Pi2 waves.\nThe relationship between the ionospheric velocity\n(and hence the electric field) and the ground magnetic\nfield can be examined further by combining the deduced\nequivalent current intensities with the ionospheric\nvelocities. As the equivalent Hall currents JH are related\nto the ionospheric electric field, E, and hence the plasma\nconvection velocity, v, via the height integrated Hall\nconductance,\nP\nH , by\nJH \u0088\nX\nH\nE \u0088\nX\nH\nvB; \u00853\u0086\nwhere B is the magnetic field strength, in the present\nexperimental arrangement an estimate of the Hall\nconductance may be calculated from (Lu¨hr et al.,\n1993, 1996).X\nH\n\u0019 ÿ 2\nl0\nby\nvxB\n: \u00854\u0086\nFigure 3b displays the beam 9 line-of-sight velocities,\nrepresented as a colour scale, as a function of magnetic\nFig. 7. Equivalent current patterns deduced from IMAGE magne-\ntometer data. The current vectors have been plotted versus an inverted\ntime axis. This is appropriate for visualising eastward moving features.\nThe time series at HOP has been shifted by 40 s to account for the\npropagation delay\nT. K. Yeoman, H. Lu¨hr: CUTLASS\/IMAGE observations of high-latitude convection features during substorms 699\nlatitude. The equivalent current intensities derived from\nthe magnetic field data from SOR, BJN and HOP are\noverlaid at the magnetic latitude appropriate for each\nstation. The magnetic field data has been high-pass\nfiltered at 1200 s to remove the background field before\ncalculating the equivalent current intensities. The upper\npanel presents an estimate of the Hall conductance,\nderived from the BJN magnetic field, again high-pass\nfiltered at 1200 s and the CUTLASS Finland line-of-\nsight velocity from the overlying range gate.\nA number of interesting features can be seen in\nFig. 3b. The intervals of enhanced equatorward flows\nclearly correlate with strong poleward Hall currents, as\nexpected. The Y component equivalent currents provide\nadditional information about the azimuthal flow in the\nionosphere, which was not available from the line-of-\nsight data from the CUTLASS Finland high time\nresolution beam. These equivalent current measure-\nments confirm the vortical nature of the flow transients.\nIt is also interesting to note that the flow suppressions\npreceding the flow enhancements represent intervals of\nconsiderable (equatorward) currents. This high current,\nlow electric field region is reflected in the deduced Hall\nconductance measurements (upper panel of Fig. 3b),\nwhich show enhancements in the Hall conductance of\n10–40 S. The background Hall conductance derived\nfrom the present technique is largely dependent on the\nbackground magnetic field, which is di\u0081cult to deter-\nmine exactly. Hence these Hall conductance measure-\nments are probably best regarded as enhancements on\nthe background E region Hall conductance, rather than\nabsolute measurements of it. The shaded bars in the\nupper panel of Fig. 3b represent intervals when the\ncalculation of\nP\nH broke down, leading to nonsensical\nresults. These intervals coincide with the beginnings of\nthe high conductivity conditions, and are likely to be a\nconsequence of strong conductivity gradients associated\nwith particle precipitation. The breakdown of the\ntechnique does illustrate the limitations of the technique\nemployed, and measurements of this type will soon be\nenhanced in this region by the EISCAT Svalbard\nincoherent scatter radar. A careful comparison of the\nmagnetic field and radar data reveals that there is a\nsystematic phase di\u0080erence between the ionospheric\nflows and the magnetic field deflections. This can be seen\nin Fig. 4 where the negative deflections of the BJN Y\ncomponent lead the flowbursts on average by some 70 s,\nwhich corresponds to 17% of the cycle time. Consider-\ning the earlier mentioned eastward propagation of the\nfeatures this means that the high equatorward flow\nvelocities are located some 400 km west of the peaks in\npoleward equivalent current. Such displacement be-\ntween flows and current is another indicator of iono-\nspheric conductivity gradients. In such a situation\nequivalent currents cannot be simply regarded as Hall\ncurrents, but rather a more rigorous treatment such as\nthat of Glassmeier (1987) has to be applied in order to\ndeduce the ionospheric currents and conductivities. The\nfull analysis of these quantities is, however, beyond the\nscope of this study.\n4.3 Relationship to magnetotail phenomena\nThe dynamic variations of ionospheric electric field and\ncurrents and localised FAC systems presented here\nclearly have important implications for the energetics of\nmagnetosphere-ionosphere coupling during substorms.\nThey may also have implications for the substorm onset\nprocess in the magnetotail. Although there are a number\nof competing substorm onset theories (see e.g. Lui, 1991)\none of the critical issues of recent years common to all\nhas been the location of the substorm onset region.\nDebate on this issue has centred around two substorm\nonset theories. The near Earth neutral line (NENL)\ntheory is a longstanding theory of substorm onset\n(Russell and McPherron, 1973; Hones 1979) which\nproposes the neutral line onset region to be located at\n>20 RE downtail (see e.g. Baker et al., 1996 for a recent\nreview). The current disruption model is a more recent\ntheory which, in contrast, puts onset at a distance of 6–8\nRE (see e.g. Lui, 1996). There is a considerable body of\nrecent evidence that substorm onset occurs in the very\nnear Earth region, subsequently propagating tailward\n(Lopez and Lui, 1990; Lopez et al., 1993), with\nreconnection following in the more distant magnetotail.\nIn a case study, Yeoman et al. (1994) identified substorm\nonset at \u00187 RE. In a subsequent study of the same\ninterval Yeoman and Pinnock (1996) identified the\nionospheric signatures of magnetotail reconnection\nsome 27 min later, implying an X line location of 43\nRE. In a statistical study of substorm onset and polar\ncap dynamics Taylor et al. (1996) calculated typical\ndelays of 20–50 min between substorm onset and the\ndestruction of open flux, corresponding to NENL\nlocations of 35–75 RE. However other recent studies\nhave suggested that NENL reconnection is the process\nwhich initiates substorm onset, with the near-Earth\nsignatures a consequence of the more distant tail process\n(e.g. Baker et al., 1993).\nThe duration, repetition rate and morphology of the\nimpulsive features presented here is very similar to that\nof flux transfer events on the dayside (e.g. Lockwood\net al., 1990), and this might suggest that the source\nmechanism is transient reconnection at the NENL. If\nthese features are signs of reconnection they occur some\n17–70 min after the substorm expansion phase onset and\nthe transient ionospheric features may have been pro-\nduced by earthward flowbursts in the tail such as those\nreported by e.g. Baumjohann et al. (1990), and Ange-\nlopoulos et al. (1992). Magnetotail flowbursts have a\ntypical time scale of \u00181 min and occur in bursty\nintervals of typical duration \u001810 min. The ionospheric\nvortex observations presented here have a time scale\nbetween these two limits. Impulsive current disruption\nin the nearer-Earth tail region could also produce the\nobserved features, although they would be expected to\nbe associated with near-Earth magnetic field dipolarisa-\ntion and hence Pi2 pulsations.\nA sequence of ionospheric convection vortices of\nalternating sense of rotation, whose motion is largely\ndirected azimuthally rather than meridionally, has been\n700 T. K. Yeoman, H. Lu¨hr: CUTLASS\/IMAGE observations of high-latitude convection features during substorms\nobserved. The latitude of convection vortices created by\nvelocity shears in the magnetotail would be expected to\nlie poleward of the electrojet, whereas the observations\npresented here lie just poleward of the centre of the\nelectrojet. This suggests that the observed ionospheric\nconvection vortices may be features created by the\nmagnetotail flowbursts rather than corresponding di-\nrectly to them. In spite of these reservations, it is\npossible to calculate the magnetotail parameters implied\nby the ionospheric observations and compare them to\nthose found in magnetotail bursty bulk flows (BBFs).\nMapping using the Tsyganenko T89 magnetic field\nmodel for Kp = 1 (see Tsyganenko, 1990) suggests that\nthe vortical features map some 40–50 RE downtail\n(although there is considerable uncertainty in this figure,\nand T89 is known to overestimate this parameter), and\noccupy a region of \u001812 RE in the Y direction. Most BBF\nobservations have been made at \u001820 RE and have\nsuggested a Y extent of \u001810 RE or less. If the vortical\nfeatures represent a loss of open flux due to tail\nreconnection then the measured voltage associated with\nthe vortices, of \u001830 kV, can be calculated, assuming a\nspherical polar cap, using the method of Lockwood and\nCowley (1992) to represent a flux closure rate of\n\u00183 ´ 104 Wb s)1, representing \u00187 ´ 106 Wb per flow-\nburst and or \u00182 ´ 107 Wb for the sequence of vortices.\nThis is similar to that estimated during BBFs by\nAngelopoulos et al. (1992) and compares with a rate of\nloss of open flux of 5 ´ 105 Wb s)1 measured during the\nexpansion phase using the AMIE technique by Taylor\net al. (1996). In the study of Taylor et al. (1996) this rate\nof flux closure corresponded to a flux loss of \u0018109 Wb\nduring the expansion phase, as a result of a number of\nsubstorm intensifications during an active magnetic\nstorm period.\n5 Summary\nDuring the interval 19:00–24:00 UT the CUTLASS\nFinland radar moved from the return flow region of the\ndusk convection cell, through the convection reversal\nregion, where relatively slow antisunward flow was\nobserved for around two hours from 20:30 UT, through\nto 22:30 UT, and into the return flow region of the dawn\nconvection cell. During this interval eight substorm\nonset\/intensifications occurred. For three intervals dur-\ning the period under study, a reduction in the spatial\nextent of radar backscatter occurred. The limited e\u0080ect\nof HF absorption in the present study is probably a\nconsequence of the high latitude of the substorm\nactivity, with the electrojet centre lying between 67°\nand 71° geomagnetic latitude during the interval. These\nhigh latitude substorm onsets occur during an interval\nof quiet magnetic activity, with Kp during the interval\nbeing 2- and SKp for the day being only 8-. These\nmagnetic activity conditions have enabled HF backscat-\nter to be recorded from a region covering 65°–73°\ngeomagnetic latitude.\nDuring the period 20:40 UT to 21:40 UT, an interval\nin the expansion phase of a substorm onset, slow\nequatorward flow of less than 200 m s)1 was observed\nover most of the field of view of the CUTLASS radar.\nThis interval was punctuated by short intervals of\nsuppressed flow, followed by the observation of pulses\nof more intense equatorward ionospheric flows, exceed-\ning \u0018600 m s)1. These pulses had a duration of 3–5 min\nand a repetition period of \u00188 min. Their spatial extent in\nthe CUTLASS field of view was 400–500 km in longi-\ntude, and 300–400 km in latitude. They are interpreted\nas signatures of ionospheric current vortices associated\nwith pairs of field aligned currents, with their apparent\nspatial and temporal extent probably caused by a\ncombination of growth\/fading and propagation.\nEach pulse of enhanced equatorward flow was\npreceded by an interval of suppressed flow and en-\nhanced ionospheric Hall conductance. This sequence is\nconsistent with the signature expected from a pair of\nfield aligned currents. An interval of enhanced energetic\nparticle precipitation associated with an upward field\naligned current would cause an increase in electron\ndensity and hence ionospheric Hall conductance, with\ncurrent continuity then requiring a reduction in the\nionospheric electric field and drift velocity. Recombina-\ntion then lowers the conductance, and a strong iono-\nspheric flow is observed, in the form of a pair of current\nvortices.\nIn the ionospheric electric field and ground magnetic\nfield signatures presented here, the distribution of\nmagnetometer stations, and the CUTLASS high time\nresolution data have enabled a determination of the\nmorphology of the impulsive electrojet features. The\nrelationship between these observations and substorm\nphenomena in the magnetotail remains open to debate,\nas does the implication for the near-Earth neutral line\n(NENL) and current disruption models for substorm\nexpansion phase onset.\nHF radars have been demonstrated to be very\nvaluable tools for high time resolution studies of the\nionospheric convection signatures of substorms. The\ntransient features revealed demonstrate the highly\ndynamic nature of current, conductivity and electric\nfield, observations which have important implications\nfor the energetics of magnetosphere-ionosphere cou-\npling and magnetospheric onset region of the substorm.\nThe HF radars and ground-based magnetometer arrays\nhave provided highly complementary datasets which\nhave helped to resolve the ambiguities inherent in such\nvery dynamic phenomena.\nAcknowledgements. We would like to thank Dr Dave Milling,\nUniversity of York, for providing the SAMNET data. The\nCUTLASS HF radars are deployed and operated by the University\nof Leicester, and are jointly funded by the UK Particle Physics and\nAstronomy Research Council, the Finnish Meteorological Insti-\ntute, and the Swedish Institute for Space Physics.\nTopical Editor D. Alcayde thanks R. E. Lopez and J. P. Villain\nfor their help in evaluating this paper.\nReferences\nAngelopoulos, V., W. Baumjohann, C. F. Kennel, F. V. Coroniti,\nM. G. Kivelson, R. Pellat, R. J. Walker. H. Lu¨hr, and\nT. K. Yeoman, H. Lu¨hr: CUTLASS\/IMAGE observations of high-latitude convection features during substorms 701\nG. Paschmann, Bursty bulk flows in the inner central plasma\nsheet, J. Geophys. Res., 97, 4027–4039, 1992.\nBaker, K. B., and S. Wing, A new magnetic coordinate system for\nconjugate studies at high latitudes, J. Geophys. Res., 94, 9139–\n9143, 1989.\nBaker, D. N., T. I. Pulkkinen, R. L. McPherron, J. D. Craven, L. A.\nFrank, R. D. Elphinstone, J. S. Murphree, J. F. Fennel, R. E.\nLopez, and T. Nagai, CDAW 9 analysis of magnetospheric\nevents of May 3, 1986: event C, J. Geophys. Res., 98, 3815–3834,\n1993.\nBaker, D. N., T. I. Pulkkinen, V. Angelopoulos, W. Baumjohann,\nand R. L. McPherron, Neutral line model of substorms: past\nresults and present view, J. Geophys. Res., 101, 12, 975–13,010,\n1996.\nBaumjohann, W., R. J. Pellinen, H. J. Opgenoorth, and E. Nielsen,\nJoint two-dimensional observations of ground magnetic and\nionospheric electric fields associated with auroral zone currents:\ncurrent systems associated with local auroral break-ups, Planet.\nSpace. Sci., 29, 431–447, 1981.\nBaumjohann, W., G. Paschmann, and H. Lu¨hr, Characteristics of\nhigh-speed ion flows in the plasma sheet, J. Geophys. Res., 95,\n3801–3809, 1990.\nGlassmeier, K.-H., Ground-based observations of field-aligned\ncurrents in the auroral zone: Methods and results, Ann.\nGeophysicae, 5, 115–126, 1987.\nGreenwald, R. A., K. B. Baker, J. R. Dudeney, M. Pinnock, T. B.\nJones, E. C. Thomas, J.-P. Villain, J. -C. Cerisier, C. Senior, C.\nHanuise, R. D. Hunsucker, G. Sofko, J. Koehler, E. Nielsen, R.\nPellinen, A. D. M. Walker, N. Sato, and H. Yamagishi, Darn\/\nSuperdarn: a global view of the dynamics of high-latitude\nconvection, Space Science Reviews, 71, 761–796, 1995.\nHones, E. W. Jr., Transient phenomena in the magnetotail and\ntheir relation to substorms, Space Sci. Rev., 23, 393–410, 1979.\nInhester, B., W. Baumjohann, R. A. Greenwald, and E. Nielsen,\nJoint two-dimensional observations of ground magnetic and\nionospheric electric fields associated with auroral zone currents\n3. Auroral zone currents during the passage of a westward\ntravelling surge, J. Geophys.,49, 155–162, 1981.\nKirkwood, S., H. J. Opgenoorth, and J. S. Murphree, Ionospheric\nconductivities, electric fields and currents associated with\nauroral substorms measured by the EISCAT radar, Planet.\nSpace Sci., 36, 1359–1380, 1988.\nKisabeth, J. L., and G. Rostoker, Current flow in auroral loops and\nsurges inferred from ground-based magnetic observations, J.\nGeophys. Res., 78, 5573–5584, 1973.\nLester, M., W. J. Hughes, and H. J. Singer, Polarization patterns of\nPi2 magnetic pulsations and the substorm current wedge, J.\nGeophys. Res., 88, 7958–7966, 1983.\nLester, M., M. Lockwood, T. K. Yeoman, S. W. H. Cowley, H. Lu¨hr,\nR. Bunting, and C. J. Farrugia, The response of ionospheric\nconvection in the polar cap to substorm activity, Ann.\nGeophysicae, 13, 147–158, 1995.\nLockwood, M. and S. W. H. Cowley, Ionospheric convection and\nthe substorm cycle, Proceedings of ICS-I, ESA SP-335, 99–109,\n1992.\nLockwood, M., S. W. H. Cowley, P. E. Sandholt, and R. P. Lepping,\nThe ionospheric signatures of flux transfer events and solar\nwind dynamic pressure changes, J. Geophys. Res., 95, 17, 113–\n135, 1990.\nLopez, R. E., and A. T. Y. Lui, A multisatellite case study of the\nexpansion of a substorm current wedge in the near-Earth\nmagnetotail, J. Geophys., Res., 95, 8009–8017, 1990.\nLopez, R. E., H. E. J. Koskinen, T. I. Pulkkinen, T. Bo¨singer, R. W.\nMcEntire, and T. A. Potemra, Simultaneous observation of the\npoleward expansion of substorm electrojet activity and the\ntailward expansion of current sheet disruption in the near-Earth\nmagnetotial, J. Geophys. Res., 98, 9285–9295, 1993.\nLu¨hr, H., The IMAGE magnetometer network, STEP Internation-\nal Newsletter, 4, (10), 4–6, 1994.\nLu¨hr, H., and K. Schlegel, Combined measurements of EISCAT\nand the EISCAT magnetometer cross to study W bands, J.\nGeophys. Res., 99, 8951–8959, 1994.\nLu¨hr, H., W. Blawert, and H. Todd, The ionospheric plasma flow\nand current patterns of travelling convection vortices: a case\nstudy, J. Atmos. Terr. Phys., 55, 1717–1727, 1993.\nLu¨hr, H., M. Lockwood, P. E. Sandholt, T. L. Hansen, and\nT. Moretto, Multi-instrument ground-based observations of a\ntravelling convection vortices event, Ann. Geophysicae, 14, 162–\n181, 1996.\nLui, A. T. Y., A synthesis of magnetospheric substorm models, J.\nGeophys. Res., 96, 1849–1856, 1991.\nLui, A. T. Y., Current disruption in the Earth’s magnetosphere:\nobservations and models, J. Geophys, Res., 101, 13,067–13,088,\n1996.\nMilan, S. E., T. B. Jones, M. Lester, E. M. Warrington, and G. D.\nReeves, Substorm correlated absorption on a 3200 km trans-\nauroral HF propagation path, Ann. Geophysicae, 14, 182–190,\n1996.\nMorelli, J. P., R. J. Bunting, S. W. H. Cowley, C. J. Farrugia, M.\nP. Freeman, E. Friis-Christensen, G. O. L. Jones, M. Lester, R.\nV. Lewis, H. Lu¨hr, D. Orr, M.Pinnock, G. D. Reeves, P. J. S.\nWilliams, and T. K. Yeoman, Radar observations of auroral\nzone flows during a multiple-onset substorm, Ann. Geophysicae,\n13, 1144–1163, 1995.\nOpgenoorth, H. J., R. J. Pellinen, W. Baumjohann, E. Nielsen,\nG. Marklund, and L. Eliasson, Three dimensional current flow\nand particle precipitation in a westward travelling surge\n(observed during the Barium-GEOS rocket experiment), J.\nGeophys. Res., 88, 3138–3152, 1983.\nPinnock, M., A. S. Rodger, J. R. Dudeney, F. Rich, and K. B. Baker,\nHigh spatial and temporal resolution observations of the\nionospheric cusp. Ann. Geophysicae, 13, 919–925, 1995.\nRobinson, T. R., Towards a self-consistent non-linear theory of\nradar-auroral backscatter, J. Atmos. Terr. Phys., 48, 417–422,\n1986.\nRostoker, G., S.-I. Akasofu, J. Foster, R. A. Greenwald, Y. Kamide,\nK. Kawasaki, A. T. Y. Lui, R. L. McPherron, and C. T. Russell,\nMagnetospheric substorms – definition and signatures, J.\nGeophys. Res., 85, 1663–1668, 1980.\nRussell, C. T., and R. L. McPherron, The magnetotail and\nsubstorms, Space Sci. Rev., 15, 205–266, 1973.\nSamson, J. C., and G. Rostoker, Polarization characteristics of Pi2\npulsations and implications for their source mechanisms:\ninfluence of the westward travelling surge, Planet. Space Sci.,\n31, 435–458, 1983.\nTaylor, J. R., T. K. Yeoman, M. Lester, B. A. Emery, and D. J.\nKnipp, Variations in the polar cap area during intervals of\nsubstorm activity on March 20–21, 1990 deduced from AMIE\nconvection patterns, Ann. Geophysicae, 14, 879–887, 1996.\nTsyganenko, N. A., Quantitative models of the magnetospheric\nmagnetic field: methods and results, Space Sci. Rev., 54, 75–186,\n1990.\nWei, C. Q. and L. C. Lee, Ground magnetic signatures of moving\nelongated plasma clouds, J. Geophys. Res., 95, 2405–2418, 1990.\nYeoman, T. K., and M. Pinnock, The high-latitude convection\nresponse to an interval of substorm activity, Ann. Geophysicae,\n14, 518–532, 1996.\nYeoman, T. K., D. K. Milling, and D. Orr, Pi2 pulsation\npolarization patterns on the U.K. Sub-auroral Magnetometer\nNetwork (SAMNET), Planet. Space Sci. 38, 589–602, 1990.\nYeoman, T. K., M. Lester, D. K. Milling and D. Orr, Polarization,\npropagation and MHD wave modes of Pi2 pulsations: SABRE\/\nSAMNET results, Planet. Space Sci., 39, 983–998, 1991.\nYeoman, T. K., H. Lu¨hr, R. W. H. Friedel, S. Coles, M. Grande´,\nC. H. Perry, M. Lester, P. N. Smith, H. J. Singer, and D. Orr,\nCRRES\/Ground-based multi-instrument observations of an\ninterval of substorm activity, Ann. Geophysicae, 12, 1174–1191,\n1994.\n702 T. K. Yeoman, H. Lu¨hr: CUTLASS\/IMAGE observations of high-latitude convection features during substorms\n"}