{"doi":"10.1017\/S0029665110000030","coreId":"102816","oai":"oai:epubs.surrey.ac.uk:2358","identifiers":["oai:epubs.surrey.ac.uk:2358","10.1017\/S0029665110000030"],"title":"Non-alcoholic fatty liver disease: the hepatic consequence of obesity and the metabolic syndrome.","authors":["Moore, JB"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-05","abstract":"Non-alcoholic fatty liver disease (NAFLD) is now the most common liver disease in both adults and children worldwide. As a disease spectrum, NAFLD may progress from simple steatosis to steatohepatitis, advanced fibrosis and cirrhosis. An estimated 20-35% of the general population has steatosis, 10% of whom will develop the more progressive non-alcoholic steatohepatitis associated with markedly increased risk of cardiovascular- and liver-related mortality. Development of NAFLD is strongly linked to components of the metabolic syndrome including obesity, insulin resistance, dyslipidaemia and type 2 diabetes. The recognition that NAFLD is an independent risk factor for CVD is a major public health concern. There is a great need for a sensitive non-invasive test for the early detection and assessment of the stage of NAFLD that could also be used to monitor response to treatment. The cellular and molecular aetiology of NAFLD is multi-factorial; genetic polymorphisms influencing NAFLD have been identified and nutrition is a modifiable environmental factor influencing NAFLD progression. Weight loss through diet and exercise is the primary recommendation in the clinical management of NAFLD. The application of systems biology to the identification of NAFLD biomarkers and factors involved in NAFLD progression is an area of promising research","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2358<\/identifier><datestamp>\n      2017-10-31T14:05:46Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6865616C7468616E646D65646963616C:62696F736369656E6365735F6D65646963696E65:6E7574726974696F6E<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2358\/<\/dc:relation><dc:title>\n        Non-alcoholic fatty liver disease: the hepatic consequence of obesity and the metabolic syndrome.<\/dc:title><dc:creator>\n        Moore, JB<\/dc:creator><dc:description>\n        Non-alcoholic fatty liver disease (NAFLD) is now the most common liver disease in both adults and children worldwide. As a disease spectrum, NAFLD may progress from simple steatosis to steatohepatitis, advanced fibrosis and cirrhosis. An estimated 20-35% of the general population has steatosis, 10% of whom will develop the more progressive non-alcoholic steatohepatitis associated with markedly increased risk of cardiovascular- and liver-related mortality. Development of NAFLD is strongly linked to components of the metabolic syndrome including obesity, insulin resistance, dyslipidaemia and type 2 diabetes. The recognition that NAFLD is an independent risk factor for CVD is a major public health concern. There is a great need for a sensitive non-invasive test for the early detection and assessment of the stage of NAFLD that could also be used to monitor response to treatment. The cellular and molecular aetiology of NAFLD is multi-factorial; genetic polymorphisms influencing NAFLD have been identified and nutrition is a modifiable environmental factor influencing NAFLD progression. Weight loss through diet and exercise is the primary recommendation in the clinical management of NAFLD. The application of systems biology to the identification of NAFLD biomarkers and factors involved in NAFLD progression is an area of promising research.<\/dc:description><dc:date>\n        2010-05<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2358\/1\/JBMoore_NutSocPaper_forSSOL.pdf<\/dc:identifier><dc:identifier>\n          Moore, JB  (2010) Non-alcoholic fatty liver disease: the hepatic consequence of obesity and the metabolic syndrome.   Proc Nutr Soc, 69 (2).  pp. 211-220.      <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/doi:10.1017\/S0029665110000030<\/dc:relation><dc:relation>\n        10.1017\/S0029665110000030<\/dc:relation><dc:language>\n        eng<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2358\/","http:\/\/dx.doi.org\/doi:10.1017\/S0029665110000030","10.1017\/S0029665110000030"],"year":2010,"topics":[],"subject":["Article","PeerReviewed"],"fullText":" 1\n \n \n \nSymposium on ‘Over-nutrition: consequences and solutions’ \n \n \nSession 2: Non-alcoholic Fatty Liver Disease:  The Hepatic Consequence of Obesity and the \nMetabolic Syndrome \n \n \nJ. Bernadette Moore \nNutritional Sciences Division, Faculty of Health and Medical Sciences, University of Surrey, \nGuildford, Surrey, GU2 7XH, UK \n \n \n \n \n \nKeywords: Non-alcoholic fatty liver disease: Metabolic Syndrome: Systems biology \n \n \nCorresponding author: \nDr. J. Bernadette Moore \nFaculty of Health and Medical Sciences  \nUniversity of Surrey  \nGuildford, Surrey  \nGU2 7XH, UK \nEmail: j.b.moore@surrey.ac.uk \nTel: +44 1483686405 \nFax: +44 1483686401 \n \n \nAbbreviations: NAFLD, non-alcoholic fatty liver disease; NASH, non-alcoholic steatohepatitis; \nALT,  alanine aminotransferase; GGT, gamma glutamyl transpeptidase, MRI, magnetic resonance \nimaging;  1H MRS, proton magnetic resonance spectroscopy; ROS, reactive oxygen species; \nSREBP1, sterol regulatory element-binding protein-1; ChREBP, carbohydrate responsive element-\nbinding protein; NHANES III, Third National Health and Nutrition Examination Survey; SNP, \nsingle nucleotide polymorphism; PNPLA3, patatin-like phospholipase domain-containing protein \n3; SIBO, Small intestinal bacterial overgrowth; ATP III, Adult Treatment Panel III;  \n \n \n \n \n 2\nAbstract 1 \nNon-alcoholic fatty liver disease (NAFLD) is now the most common liver disease in both adults 2 \nand children worldwide.  A disease spectrum, NAFLD progresses from simple steatosis to 3 \nsteatohepatitis, advanced fibrosis and cirrhosis.  An estimated 20-35% of the general population has 4 \nsteatosis and 10% of these will develop the more progressive non-alcoholic steatohepatitis 5 \nassociated with significant increased risk of cardiovascular- and liver-related mortality.  6 \nDevelopment of NAFLD is strongly linked to components of the metabolic syndrome including 7 \nobesity, insulin resistance, dyslipidaemia and type 2 diabetes.  The recognition that NAFLD is an 8 \nindependent risk factor for cardiovascular disease is a major public health concern.  There is 9 \ntremendous need for a sensitive, non-invasive test for early detection and staging of NAFLD that 10 \ncould also be used to monitor response to treatment. The cellular and molecular aetiology of 11 \nNAFLD is multi-factorial; genetic polymorphisms influencing NAFLD have been identified and 12 \nnutrition is a modifiable environmental factor influencing NAFLD progression.  Weight loss 13 \nthrough diet and exercise is the primary recommendation in the clinical management of NAFLD. 14 \nThe application of systems biology to the identification of NAFLD biomarkers and factors involved 15 \nin NAFLD progression is an area of promising research. 16 \n 17 \n 18 \n 3\nIntroduction 1 \nNon-alcoholic fatty liver disease is the pathological accumulation of fat in the liver in the absence 2 \nof alcohol intake. Described initially only 30 years ago(1, 2), it is now the leading cause of liver 3 \ndisease in developed countries with an estimated prevalence of 20-30% in the general population. 4 \nThe occurrence of non-alcoholic fatty liver disease (NAFLD) is strongly linked to obesity, insulin 5 \nresistance and other components of the metabolic syndrome. From a nutrition and public health 6 \nperspective, the two major concerns are the rising incidence of NAFLD in children, and the 7 \nconvincing evidence that NAFLD is an independent risk factor for cardiovascular disease. 8 \nThe term NAFLD encompasses a spectrum of histologically defined liver disorders. Disease can 9 \nprogress from macrovesicular lipid accumulation in the hepatocyte known as steatosis, to non-10 \nalcoholic steatohepatitis (NASH), steatosis in the presence of inflammatory infiltrate possibly with 11 \nsome fibrosis, to outright fibrosis, cirrhosis and even hepatocellular carcinoma. A combination of 12 \nenvironmental and genetic factors determines individual risk of NAFLD development and 13 \nprogression, with a clear role for nutrition as a modifiable environmental risk factor. Pathogenesis 14 \nof NAFLD was initially envisaged as a “two-hit process”(3) with fat accumulation in hepatocyte 15 \nviewed as the primary insult and increased oxidative stress leading to inflammation being the 16 \nsecond “hit” in progression to NASH and fibrosis.  At the cellular level however, mechanisms 17 \ninfluencing disease progression are clearly multi-factorial and dependent on numerous genetic and 18 \nenvironmental interactions. Future analysis and modeling of NAFLD progression must account for 19 \nthis complexity in a systems biology fashion. 20 \n 21 \nDiagnosis 22 \nThe majority of NAFLD cases are identified after an incidental finding of either elevated liver 23 \nenzymes on routine blood tests or suspected fatty liver on abdominal imaging in patients 24 \nconsuming little or no alcohol.(4)   After the exclusion of excessive alcohol consumption which is 25 \ngenerally defined as more than 20 g\/day in men and 10 g\/day in women, alternate causes of fatty 26 \nliver (nutritional, genetic, viral, metabolic, drug) must also be excluded prior to diagnosis of 27 \nNAFLD.  While liver enzymes such as alanine aminotransferase (ALT) and gamma glutamyl 28 \ntranspeptidase (GGT) levels may be found elevated, they are not specific to NAFLD and 29 \nfurthermore the full histological spectrum of NAFLD has been observed in patients with normal 30 \nALT levels.(5)  Non-invasive imaging techniques used for diagnosis of NAFLD include ultrasound, 31 \ncomputed tomography, magnetic resonance imaging (MRI) and proton magnetic resonance 32 \nspectroscopy (1H MRS), each with its own set of advantages and disadvantages.(6) While all these 33 \ntechniques yield information about fat distribution in the liver, MRI and 1H MRS can quantify the 34 \n 4\ntotal amount of fat in the liver.  In a population study using 1H MRS to assess liver fat, almost a 1 \nthird of subjects had hepatic steatosis and 79% of those with steatosis had normal ALT levels.(7)  2 \nThese data highlight the concern that NAFLD prevalence as assessed by liver enzyme alterations is 3 \ngrossly under estimated.   4 \nUltrasound-based transient elastography and magnetic resonance elastography are currently 5 \nbeing investigated for their ability to stage liver fibrosis.(8, 9)  However a BMI greater than 28 was 6 \nshown to cause transient elastography to fail(10), and  magnetic resonance elastography remains 7 \nexperimental.(11)   Although algorithms combining biochemical markers and patient parameters 8 \nhave been developed for predicting steatosis(12), steatohepatitis(13) and fibrosis(14) in NAFLD, these  9 \nrequire independent population validation and still lack sensitivity and specificity for widespread 10 \nuse. Histological assessment of liver biopsies remains the gold standard for diagnosing and staging 11 \nNASH.  However, liver biopsy is invasive and associated with significant morbidities(15) and rare 12 \ncases of mortality(16) precluding its routine use in screening for NAFLD or for repeated assessment 13 \nof either disease progression or response to therapy.  Furthermore, as histological lesions are not 14 \nevenly distributed in the liver, considerable sampling error and misdiagnosis exists.(17)  15 \nConsequently, the identification and validation of noninvasive biomarkers capable of diagnosing 16 \nand staging NAFLD is a research priority.(18)   17 \n 18 \nEpidemiology 19 \nThe lack of an inexpensive, noninvasive screening test for fatty liver disease means the true 20 \npopulation prevalence for NAFLD remains unknown.  Evidence from autopsy(19, 20) and imaging(7, 21 \n21, 22) studies demonstrates NAFLD prevalence in 20-35% of populations worldwide with 10% of 22 \nthese cases being NASH.  Prevalence is much higher among the obese(20, 23-27) and type 2 23 \ndiabetics(28-30) where NAFLD is found in 70-80% of patients, and advanced disease, NASH and 24 \nfibrosis, is found in 25-70% of these cases.  Distinct ethnic differences in the prevalence of NAFLD 25 \nexist.(7, 31)  The largest multiethnic population study to date with 2,287 subjects(7), found the highest 26 \nfrequency of NAFLD in Hispanics (45%) compared to whites (33%) and blacks (24%); a gender 27 \ndifference was only observed in Caucasians (42% men, 24% women). 28 \n Shockingly, NAFLD is now the most common cause of liver disease in children.   Incidence of 29 \npaediatric NAFLD has risen sharply in the last three decades corresponding with the worldwide 30 \nincrease in childhood obesity.   A retrospective review of paediatric autopsy reports in the United 31 \nStates found fatty liver in 13% of children and 38% of obese children between 2 and 19 years 32 \nold.(32)  Estimates of NAFLD prevalence in obese children using ultrasonography range from 45-33 \n60%(33-36), though no survey has been carried out in a UK population.  However, the International 34 \n 5\nObesity Task Force has concluded the lowest estimated prevalence of hepatic steatosis to be 27.9% 1 \namong obese children in the European Union.(37)  Of particular concern are very recent datasets 2 \nshowing that NAFLD in overweight and obese children is not only strongly associated with 3 \ncardiovascular risk factors(38), but also atherosclerosis as measured by carotid intima-media 4 \nthickness.(39) Since 7% of boys and 10% of girls aged 5-18 in the United Kingdom were obese in 5 \n2006(40) (28% and 36% overweight respectively), paediatric NAFLD warrants significant clinical 6 \nand research attention. 7 \n 8 \n 9 \nNAFLD development 10 \nThe pathogenesis of NAFLD begins with accumulation of lipid in the liver.  As only a minority of 11 \npatients with hepatic steatosis progress to the necroinflammatory steatohepatitis and develop 12 \nfibrosis, Day(3) originally conceptualized that a second “hit” was required to induce cellular events 13 \n(e.g. oxidative stress) leading to inflammation, cell death and fibrosis.  As with all complex 14 \ndiseases, it is now recognized that the phenotypic expression of NAFLD depends on a myriad of 15 \ngenetic, behavioral and environmental interactions.(41)  16 \nWhile hepatic steatosis can be simplistically viewed as an imbalance between the processes of 17 \nlipid accumulation and lipid disposal, the cellular and molecular regulation of hepatic metabolism 18 \nis intricate and has been the subject of a recent extensive review.(42) Fat in the liver is acquired from 19 \nthe diet, de novo lipogenesis or circulating NEFA and removed through VLDL secretion or by β-20 \noxidation.  Derangements in each of these pathways have been associated with NAFLD.   21 \nTraditionally it appeared that lipid accumulation in the liver occurred in the context of obesity and 22 \nperipheral insulin resistance, with lipid coming from an elevated plasma NEFA pool caused by 23 \nincreased activity of hormone-sensitive lipase and increased lipolysis from engorged adipocytes. 24 \nMultiple lines of evidence suggest this explanation is likely to be too naïve; indeed it has been 25 \npostulated that systemic insulin resistance might be secondary to NAFLD. (43) 26 \nStable isotope research in NAFLD patients has shown that, although 60% of the TAG in the 27 \nliver comes from the peripheral NEFA pool, elevations in fasting de novo lipogenesis also 28 \ncontribute significantly.(44) Additional work has observed both an increase in adipose lipolysis, and 29 \nincreased VLDL-TAG secretion from the liver in NAFLD patients. (45)  However, not only was the 30 \nincrease in VLDL-TAG secretion not sufficient enough to deal with the increase in hepatic TAG 31 \ncontent in these patients, the VLDL-TAG was derived predominantly from “nonsystemic” NEFA, 32 \neither from de novo lipogenesis or lipolysis of visceral fat.  This is interesting in the light of very 33 \n 6\nrecent 1H-MRS and MRI data showing that hepatic lipid content directly correlates to visceral fat 1 \nlevels.(46)   This study highlights ethnic differences in the manifestations of insulin resistance; 2 \nalthough Hispanics and African Americans have similar frequencies of insulin resistance, African 3 \nAmericans are less likely to have NAFLD, hypertriglyceridaemia and elevated visceral fat depots.  4 \nThese data, as well as data showing NAFLD in nonobese individuals with normal glucose and lipid 5 \nlevels(47), mean NAFLD can and does occur without the backdrop of insulin resistance. 6 \n Once steatosis is established, multiple mechanisms contribute to lipid-induced cellular injury.(48)  7 \nIncreased mitochondrial β-oxidation of NEFA leads to an increase in reactive oxygen species 8 \n(ROS). Mitochondrial defects have been observed in NAFLD patients and impairment of the 9 \nrespiratory chain also produces ROS and leads to extra-mitochondrial NEFA oxidation in the 10 \nperoxisomes and microsomes producing further ROS.  The overall increase in oxidative stress leads 11 \nto lipid peroxidation, DNA and protein damage and ultimately cell death.  In addition the aldehyde 12 \nbyproducts of lipid peroxidation increase production of proinflammatory cytokines and recruit 13 \ninflammatory cells into the liver.   Inflammation and the activation of hepatic stellate cells leads to 14 \ncollagen production and the initiation of fibrosis. 15 \n Lastly, the pathogenesis of NAFLD is also mediated by transcription factors such as the sterol 16 \nregulatory element-binding protein-1 (SREBP1), the carbohydrate responsive element-binding 17 \nprotein (ChREBP) and the PPARs which are reviewed elsewhere(49), and influenced by circulating 18 \ncytokines and adipokines.  Adding additional complexity, the levels of all these molecules will 19 \ndepend on both genetic polymorphisms and the presence or absence of disease (e.g. obesity or 20 \nimmune).  Clinical studies reviewed by Tsochatzis and colleagues(50) have shown low levels of the 21 \nanti-inflammatory adiponectin and high levels of the pro-inflammatory resistin, TNF-α and IL-6 22 \ncytokines in NAFLD patients.  Genetic polymorphisms in these cytokines have also been 23 \ninvestigated in NAFLD patients as described later. 24 \n 25 \n 26 \nNAFLD progression and associated mortality 27 \nThe prognosis of patients with NAFLD depends on the histological stage of the disease.  Simple 28 \nsteatosis may have a relatively benign course with no increased risk of mortality, whereas NASH 29 \nmay progress quite rapidly and is associated with significant increased risk of mortality.(51-54)  30 \nProgression in NAFLD is difficult to assess, requiring years of follow up and repeat biopsies which 31 \nare prone to sampling errors.(17, 55)  The longest prospective study of the natural history of NAFLD 32 \nusing repeat biopsies had a mean follow-up of 13.7 years and 129 patients(54).  This study showed 33 \n 7\nthat 47% of patients presenting with steatosis progressed to NASH and 25-50% of patients 1 \npresenting with NASH developed advanced fibrosis or cirrhosis in 8-13 years (Fig. 1).  Although it 2 \nunderscores the fact that patients with steatosis can and do develop steatohepatitis, mortality was 3 \nnot changed in the group presenting with steatosis, whereas survival was significantly lower in 4 \npatients that had presented with NASH (70% versus 80% in reference population, P = 0.01).  5 \nPatients with NAFLD associated cirrhosis have been shown to have a very poor 10 year prognosis, 6 \nwith 50% needing a liver transplant, 20% dying from a liver-related cause and 7% developing 7 \nhepatocellular carcinoma.(56)   Bleakly, a very recent study on the natural history of NAFLD in 8 \nchildren demonstrates that paediatric NAFLD is also progressive and can result in end stage liver 9 \ndisease and death.(57)  In this cohort of 66 children followed over a mean of 6.4 years, 2 children 10 \nunderwent liver transplantation and 2 children died, while observed serial biopsies showed 11 \nprogression in 80% of patients.   12 \nMultiple risk factors have been associated with NAFLD progression including older age(23, 24, 58), 13 \nBMI(24, 53, 58), insulin resistance(54), diabetes(59, 60), metabolic syndrome(61) and histological NASH 14 \nupon diagnosis(52, 54, 62).  A current systematic review of ten studies examined risk factors for 15 \nprogression from NASH to advanced fibrosis.(63) Using multivariate analysis this study found only 16 \nage and presence of inflammation on initial biopsy to independently predict progression in 221 17 \npatients over a 5.3 year follow-up.  The well documented limitations associated with systematic 18 \nreviews(64), particularly the choice and heterogeneity of included studies in this case, likely explain 19 \nwhy obesity, BMI and diabetes were not statistically significant predictors in this analysis. 20 \n Data regarding the mortality risks associated with NAFLD are somewhat conflicting.  The first 21 \npopulation-based cohort study examining NAFLD and mortality determined survival among 420 22 \nNAFLD patients, identified through imaging or biopsy, after a mean follow-up of 7.6 years.(65)  In 23 \nagreement with case series from specialist clinics(52, 54, 60), NAFLD was found associated with 24 \nsignificantly lower survival and increased risk of mortality from liver disease.  After 10 years 25 \nfollow-up (n=161), survival was 77% versus 87% in the general population.    Subsequently 3 26 \nindependent groups have analyzed data from the Third National Health and Nutrition Examination 27 \nSurvey (NHANES III) of the United States for mortality risk among suspected NAFLD cases based 28 \non elevated ALT levels.(66-68)  While both Ong(66) and Dunn(67) found NAFLD associated with an 29 \nincrease in overall mortality, Ong found NAFLD associated with a huge increase in liver associated 30 \nmortality, whereas Dunn found NAFLD among 45-54 year olds dramatically linked to 31 \ncardiovascular disease (CVD) mortality.  Conversely, Ruhl(68) did not find elevated ALT levels 32 \nassociated with all-cause or CVD mortality but did find a significant association with liver related 33 \nmortality.  Differences are likely explained by variations in study design, patient selection strategy 34 \n 8\nand statistical analysis.  While these studies have the advantage of very large samples sizes from a 1 \nrepresentative sample of the general population, diagnosis of NAFLD is based on elevated ALT 2 \nlevels which do not differentiate between steatosis and steatohepatitis and, as previously 3 \nmentioned, are likely to severely under assess NAFLD incidence and therefore the magnitude of 4 \nmortality risk.  Regardless, the data in total show NAFLD is far from a benign diagnosis. 5 \n 6 \n 7 \nGenetic and environmental factors associated with NAFLD development and progression 8 \nThe development of NAFLD is strongly linked to obesity and insulin resistance.  However, as there 9 \nare obese and diabetic individuals who do not have NAFLD, and since NAFLD can occur in 10 \nnormal weight individuals with normal glucose and lipid levels(47), there are obviously multiple 11 \ngenetic and environmental factors determining NAFLD development and progression (Fig. 2).   12 \n Initial evidence for a genetic component to NAFLD comes from familial clustering studies(69, 70) 13 \nand the ethnic variation in NAFLD prevalence(7).  Various genetic single nucleotide polymorphisms 14 \n(SNPs) have been investigated in NAFLD including SNPs in the adiponectin(71, 72), IL-6(73), TNF-15 \nα(74), and apolipoprotein E(75) genes among others.  Investigated in a “candidate gene” fashion in 16 \nsmall cohorts, these studies have yielded somewhat conflicting results in different populations.  In 17 \n2008 the first genome-wide association scan in a large multiethnic population targeting NAFLD, 18 \nidentified the PNPLA3 (Patatin-like phospholipase domain-containing protein 3, also known as 19 \nadiponutrin) gene strongly associated with hepatic triglyceride content.(76) Allele variants of the 20 \nPNPLA3 gene associated with high and low amounts of hepatic fat were found enriched in 21 \nHispanics and African-Americans respectively, correlating with the high and low prevalence of 22 \nNALFD in these populations.(7)  Remarkably, PNPLA3 was also independently identified in a 23 \nseparate population-based genome-wide scan as one of two genetic loci influencing plasma levels 24 \nof ALT.(77) Undoubtedly as genome sequencing continues to get cheaper and faster, studies of this 25 \ntype will reveal more genes causal in NAFLD pathogenesis. 26 \n Nutrition and physical activity are important environmental factors determining risk of NAFLD.  27 \nExcess food intake and lack of exercise contribute to weight gain which has been shown to 28 \ncontribute to the progression of liver fibrosis in NAFLD patients.(54)  Specific dietary factors may 29 \nalso play either protective or antagonistic roles in the development and progression of NAFLD.   30 \nAssessment of nutrient intakes in NAFLD has been done in Italian(78), Japanese(79), Israeli(80) and 31 \nUS(81) populations; no UK cohort has been assessed to date.    Increased consumption of meat and 32 \nsoft drinks and low consumption of fish were associated with NAFLD cases as opposed to control.  33 \n 9\nUnsurprisingly, low intakes of PUFA and high intakes of saturated fat and cholesterol were also 1 \nassociated with NAFLD.  Data from two randomised controlled trial have shown beneficial effects 2 \nfrom six months dietary supplementation with n-3 PUFA in NAFLD compared to dietary advice 3 \nalone. (82, 83)   Reductions in fatty liver observed by ultrasonography as well as improvements in 4 \nserum ALT and triglyceride levels were significantly greater in those supplemented with n-3 5 \nPUFA.  In both trials the patients receiving PUFA were more likely to have complete fatty liver 6 \nregression suggesting a beneficial therapeutic effect for n-3 PUFA supplementation in NAFLD.  7 \nOther studies have found higher carbohydrate and lower fat diets associated with more progressive 8 \ndisease.(84, 85) Conversely, very recent animal data alarmingly shows that, in both mice(86) and 9 \nnonhuman primates(87), exposure to a maternal high fat diet leads to development and progression 10 \nof NAFLD in the offspring.  11 \n Given the role of oxidative stress in NAFLD pathogenesis several studies have examined 12 \nantioxidant supplementation as an intervention in NAFLD.  A recent Cochrane review of six very 13 \nsmall and extremely diverse clinical trials did not find enough data to recommend either for or 14 \nagainst the use of antioxidant supplements in NAFLD patients.(88)  However, data from pilot 15 \nstudies(89, 90) and one double-blind, randomized, placebo-controlled trial(91) have shown sufficient 16 \npositive effects with Vitamin E supplementation in NAFLD patients that this supplement is now the 17 \nsubject of two ongoing multicenter trials.  The “Pioglitazone versus Vitamin E versus Placebo for 18 \nthe Treatment of Non-diabetic Patients with Non-alcoholic Steatohepatitis” (PIVENS) trial(92) in 19 \nadults and the “Treatment of Non-alcoholic Fatty Liver Disease in Children” (TONIC) trial(93) both 20 \ninvolve 96 weeks of treatment and will measure improvements in histology as well as ALT levels.  21 \nWhile the PIVENS trial has 3 arms and includes a placebo group, the TONIC trial in children will 22 \ncompare metformin treatment to Vitamin E supplementation.   Data from these trials, whether 23 \nnegative or positive, should end the debate on efficacy of Vitamin E supplementation in NAFLD. 24 \n Small intestinal bacterial overgrowth (SIBO) may be an additional environmental factor 25 \ninvolved in NAFLD pathogenesis where dietary supplements such as probiotics could have a 26 \nbeneficial effect.   Evidence from animal studies shows that SIBO increases gut permeability 27 \nleading to portal endotoxaemia and increased circulating inflammatory cytokines both of which 28 \nhave been implicated in the progression of NAFLD.(94)  Several reports have found SIBO 29 \nassociated with progressive NAFLD(95-97) and in one small human study, treatment with antibiotics 30 \nresulted in an increase in fasting insulin levels.(97)  Limited evidence from animal models and one 31 \npreliminary human study suggest supplementation with the probiotic VSL#3 may possibly be 32 \nbeneficial in NAFLD, but data is mixed.(98-100)  More research in this area is warranted. 33 \n 34 \n 10\n  1 \nNAFLD, the metabolic syndrome and CVD risk 2 \nThe metabolic syndrome was originally defined as a cluster of CVD risk factors with insulin 3 \nresistance considered the underlying pathogenic factor.(101)  The third report of the National 4 \nCholesterol Education Program Expert Panel on Detection, Evaluation, and Treatment of High 5 \nBlood Cholesterol in Adults (Adult Treatment Panel III [ATP III]) defines metabolic syndrome as 6 \nbeing any three or more of five variables: increased waist circumference,  hypertriglyceridaemia, 7 \nhypertension, low HDL cholesterol, and hyperglycaemia.(102)  Metabolic syndrome is highly 8 \nprevalent among NAFLD patients in multiple populations and is strongly associated with 9 \nprogressive disease.(61, 103-105)  Equally, a Japanese prospective study (N=3147) demonstrated that 10 \npatients with metabolic syndrome, as defined by ATP III, were 4 to 11 times (men and women 11 \nrespectively) more likely to have developed NAFLD upon follow-up.(106) Likewise, children with 12 \nmetabolic syndrome as defined by ATP III have been shown to be 5 times more likely to have 13 \nNAFLD.(38) This strong relationship between NAFLD and the metabolic syndrome has led to the 14 \ndescription of NAFLD as the hepatic component of the metabolic syndrome.   15 \n Indeed, in the last five years NAFLD has emerged as an independent risk factor for CVD.  16 \nSeveral studies have observed increased carotid intima-media thickness (IMT) and carotid plaques 17 \nin NAFLD patients, including children.(39, 107-111) Although there has been some conflicting 18 \nwork(112), a systematic review found that carotid plaques were 2 to 3 times more likely to be 19 \nobserved in NAFLD patients and IMT was strongly associated with NAFLD.(113)  Furthermore, 20 \nmultiple population studies have observed increased CVD events in NAFLD patients diagnosed by 21 \nultrasonography and demonstrated that the increased risk for CVD in NAFLD is independent of 22 \nconventional risk factors and components of the metabolic syndrome.(114-116) These data add to 23 \npopulation data where elevated liver enzymes have also been associated with increased risk for 24 \nCVD.(67, 117)   25 \nEssentially as the treatment of NAFLD involves correcting the same metabolic factors involved 26 \nin CVD, it is prudent that all patients with NAFLD be evaluated for early atherosclerosis.  27 \nLikewise, patients presenting with the metabolic syndrome or a high Framingham risk score(118) 28 \nshould be evaluated for the presence of NAFLD.  Children identified with NAFLD or the metabolic 29 \nsyndrome should be strongly counseled to avoid smoking, increase their physical activity and 30 \nimprove their nutrition in order to prevent the development of cardiovascular disease. 31 \n 32 \n 33 \nThe potential of systems biology 34 \n 11\nSystems biology is the study of a biological system (cell, tissue, organism) viewed as an 1 \nintegrated and interacting network of genes, proteins and biochemical reactions.  This methodology 2 \ncombines computational modeling with experimental biology in order to discover emergent 3 \nproperties that arise from studying a system as a whole; it is these properties that ultimately 4 \ndetermine how a system is controlled or regulated.  In a systems approach one begins by 5 \nconstructing a predictive model from which a hypothesis is formed and then tested experimentally 6 \nby perturbing the system.  Experimental techniques are generally the global approaches of 7 \ngenomics, proteomics and metabolomics.  Data obtained from these multiple approaches are 8 \nintegrated and compared to the original model, which is refined in an iterative process.  In the 9 \ncontext of human health it is believed that systems biology is essential to future drug discovery and 10 \nindeed, to a future of personalized, predictive and preventative medicine.(119)  In this vision, drug 11 \ntargets would be rational and identified through the analysis of normal and disease perturbed 12 \nnetworks, while an individual could have their genome sequenced and in combination with 13 \nextensive blood analyses would be able to obtain a “probabilistic future health history”.  Although 14 \nsystems biology is in its infancy and this vision still seems far off, global approaches have been 15 \napplied to NAFLD and these datasets are relevant to the future creation of an integrated “systems” 16 \nmodel of NAFLD. 17 \n Proteomic technologies are still evolving and analysis of a complete proteome, in the manner of 18 \nDNA microarray analysis of complete genomes, has yet to be realized.  However, as disease 19 \nbiomarkers and drug targets are most likely to be proteins, proteomics is viewed as central to 20 \nsystems biology and key to predictive medicine.(120)  In the context of NAFLD, proteomic 21 \ntechniques have been used to analyze adipose(121), liver(122) and most recently serum(123) samples in 22 \nNAFLD patients.  Ultimately it is most likely that a serum diagnostic or prognostic tool for 23 \nNAFLD would be comprised of a panel of proteins, and this research highlights the power of 24 \nsystems methodologies for identifying candidate protein biomarkers. Significantly in the study by 25 \nBell and colleagues(123) their “potential biomarker panel” comprising of 6 proteins demonstrated 26 \ngreater diagnostic utility than ALT to differentiate between their patient groups. It is also 27 \nnoteworthy that Charlton(122) and Bell(123) independently identified lumican, a protein that activates 28 \ntransforming growth factor-beta and smooth muscle actin, elevated in both liver and serum from 29 \nNASH patients.  These studies have given insight into NAFLD pathogenesis and have identified 30 \ncandidate disease biomarkers worthy of prospective validation.   31 \n 32 \n 33 \nConclusion 34 \n 12\nNon-alcoholic fatty liver disease is highly prevalent with an estimated 20-30% of the UK 1 \npopulation effected.  Research on the natural history of NAFLD has demonstrated that even simple 2 \nsteatosis can not be considered benign as 47% of these patients will progress to NASH in 8-13 3 \nyears.  An estimated 25-50% of patients with NASH will progress to advanced fibrosis and 4 \ncirrhosis.  In real numbers this is 300,000 to 1.8 million cases in the UK, 50% of whom will require 5 \na liver transplant to avoid death.  It is clear that a diagnosis of NAFLD is associated with increased 6 \nrisk of mortality from liver- and cardiovascular-related events and the British Liver Trust has 7 \ndemonstrated that liver disease is the only major cause of death still increasing yearly in the 8 \nUK.(124)  An additional public health concern is the rising incidence of NAFLD in children who are 9 \nnot exempt from risk of cardiovascular disease, the need for liver transplants or early death.  Part of 10 \nthe challenge in assessing the burden of NAFLD in the population is the lack of a non-invasive 11 \nscreening test for NAFLD.   12 \nWhile NAFLD incidence is strongly linked to insulin resistance and the metabolic syndrome, the 13 \ndevelopment and progression of NAFLD involves a myriad of molecular and cellular events that 14 \nare influenced by both genetic and environmental factors.  Determination of the critical factors 15 \ninvolved in disease progression will identify possible therapeutic targets for treatment of NAFLD 16 \nand may form the basis of prognostic tests. Proteomic studies are beginning to identify serum and 17 \nliver proteins found altered in NAFLD. The modeling of NAFLD protein and gene regulatory 18 \nnetworks in a systems biology fashion is most likely to yield diagnostic, prognostic and therapeutic 19 \ntargets for NAFLD and more research of this type is urgently needed.   20 \n 21 \n 22 \nAcknowledgements 23 \nThe author thanks David J. Nolan and Professor Linda M. Morgan for critical review of the 24 \nmanuscript.  This review article involved no specific grant from any funding agency in the public, 25 \ncommercial or not-for-profit sectors. The author declares no conflict of interest.   26 \n 13\n1. Adler M & Schaffner F (1979) Fatty liver hepatitis and cirrhosis in obese patients. Am J 1 \nMed 67, 811-816. 2 \n2. Ludwig J, Viggiano TR, McGill DB et al. (1980) Nonalcoholic steatohepatitis: Mayo Clinic 3 \nexperiences with a hitherto unnamed disease. Mayo Clin Proc 55, 434-438. 4 \n3. Day CP & James OF (1998) Steatohepatitis: a tale of two \"hits\"? Gastroenterology 114, 5 \n842-845. 6 \n4. Vuppalanchi R & Chalasani N (2009) Nonalcoholic fatty liver disease and nonalcoholic 7 \nsteatohepatitis: Selected practical issues in their evaluation and management. Hepatology 8 \n49, 306-317. 9 \n5. Mofrad P, Contos MJ, Haque M et al. (2003) Clinical and histologic spectrum of 10 \nnonalcoholic fatty liver disease associated with normal ALT values. Hepatology 37, 1286-11 \n1292. 12 \n6. Schwenzer NF, Springer F, Schraml C et al. (2009) Non-invasive assessment and 13 \nquantification of liver steatosis by ultrasound, computed tomography and magnetic 14 \nresonance. J Hepatol 51, 433-445. 15 \n7. Browning JD, Szczepaniak LS, Dobbins R et al. (2004) Prevalence of hepatic steatosis in an 16 \nurban population in the United States: impact of ethnicity. Hepatology 40, 1387-1395. 17 \n8. Yoneda M, Yoneda M, Mawatari H et al. (2008) Noninvasive assessment of liver fibrosis 18 \nby measurement of stiffness in patients with nonalcoholic fatty liver disease (NAFLD). Dig 19 \nLiver Dis 40, 371-378. 20 \n9. Huwart L, Sempoux C, Vicaut E et al. (2008) Magnetic resonance elastography for the 21 \nnoninvasive staging of liver fibrosis. Gastroenterology 135, 32-40. 22 \n10. Foucher J, Castera L, Bernard PH et al. (2006) Prevalence and factors associated with 23 \nfailure of liver stiffness measurement using FibroScan in a prospective study of 2114 24 \nexaminations. Eur J Gastroenterol Hepatol 18, 411-412. 25 \n11. Salameh N, Larrat B, Abarca-Quinones J et al. (2009) Early detection of steatohepatitis in 26 \nfatty rat liver by using MR elastography. Radiology 253, 90-97. 27 \n12. Poynard T, Ratziu V, Naveau S et al. (2005) The diagnostic value of biomarkers 28 \n(SteatoTest) for the prediction of liver steatosis. Comp Hepatol 4, 10. 29 \n13. Poynard T, Ratziu V, Charlotte F et al. (2006) Diagnostic value of biochemical markers 30 \n(NashTest) for the prediction of non alcoholo steato hepatitis in patients with non-alcoholic 31 \nfatty liver disease. BMC Gastroenterol 6, 34. 32 \n14. Guha IN, Parkes J, Roderick P et al. (2008) Noninvasive markers of fibrosis in nonalcoholic 33 \nfatty liver disease: Validating the European Liver Fibrosis Panel and exploring simple 34 \nmarkers. Hepatology 47, 455-460. 35 \n15. Cadranel JF, Rufat P & Degos F (2000) Practices of liver biopsy in France: results of a 36 \nprospective nationwide survey. For the Group of Epidemiology of the French Association 37 \nfor the Study of the Liver (AFEF). Hepatology 32, 477-481. 38 \n16. Gilmore IT, Burroughs A, Murray-Lyon IM et al. (1995) Indications, methods, and 39 \noutcomes of percutaneous liver biopsy in England and Wales: an audit by the British 40 \nSociety of Gastroenterology and the Royal College of Physicians of London. Gut 36, 437-41 \n441. 42 \n17. Ratziu V, Charlotte F, Heurtier A et al. (2005) Sampling variability of liver biopsy in 43 \nnonalcoholic fatty liver disease. Gastroenterology 128, 1898-1906. 44 \n18. Wieckowska A, McCullough AJ & Feldstein AE (2007) Noninvasive diagnosis and 45 \nmonitoring of nonalcoholic steatohepatitis: present and future. Hepatology 46, 582-589. 46 \n19. Hilden M, Christoffersen P, Juhl E et al. (1977) Liver histology in a 'normal' population--47 \nexaminations of 503 consecutive fatal traffic casualties. Scand J Gastroenterol 12, 593-597. 48 \n20. Wanless IR & Lentz JS (1990) Fatty liver hepatitis (steatohepatitis) and obesity: an autopsy 49 \nstudy with analysis of risk factors. Hepatology 12, 1106-1110. 50 \n 14\n21. Bellentani S, Saccoccio G, Masutti F et al. (2000) Prevalence of and risk factors for hepatic 1 \nsteatosis in Northern Italy. Ann Intern Med 132, 112-117. 2 \n22. Dassanayake AS, Kasturiratne A, Rajindrajith S et al. (2009) Prevalence and risk factors for 3 \nnon-alcoholic fatty liver disease among adults in an urban Sri Lankan population. J 4 \nGastroenterol Hepatol 24, 1284-1288. 5 \n23. Garcia-Monzon C, Martin-Perez E, Iacono OL et al. (2000) Characterization of pathogenic 6 \nand prognostic factors of nonalcoholic steatohepatitis associated with obesity. J Hepatol 33, 7 \n716-724. 8 \n24. Ratziu V, Giral P, Charlotte F et al. (2000) Liver fibrosis in overweight patients. 9 \nGastroenterology 118, 1117-1123. 10 \n25. Dixon JB, Bhathal PS & O'Brien PE (2001) Nonalcoholic fatty liver disease: predictors of 11 \nnonalcoholic steatohepatitis and liver fibrosis in the severely obese. Gastroenterology 121, 12 \n91-100. 13 \n26. Del Gaudio A, Boschi L, Del Gaudio GA et al. (2002) Liver damage in obese patients. Obes 14 \nSurg 12, 802-804. 15 \n27. Gholam PM, Flancbaum L, Machan JT et al. (2007) Nonalcoholic fatty liver disease in 16 \nseverely obese subjects. Am J Gastroenterol 102, 399-408. 17 \n28. Gupte P, Amarapurkar D, Agal S et al. (2004) Non-alcoholic steatohepatitis in type 2 18 \ndiabetes mellitus. J Gastroenterol Hepatol 19, 854-858. 19 \n29. Targher G, Bertolini L, Padovani R et al. (2007) Prevalence of nonalcoholic fatty liver 20 \ndisease and its association with cardiovascular disease among type 2 diabetic patients. 21 \nDiabetes Care 30, 1212-1218. 22 \n30. Leite NC, Salles GF, Araujo AL et al. (2009) Prevalence and associated factors of non-23 \nalcoholic fatty liver disease in patients with type-2 diabetes mellitus. Liver Int 29, 113-119. 24 \n31. Weston SR, Leyden W, Murphy R et al. (2005) Racial and ethnic distribution of 25 \nnonalcoholic fatty liver in persons with newly diagnosed chronic liver disease. Hepatology 26 \n41, 372-379. 27 \n32. Schwimmer JB, Deutsch R, Kahen T et al. (2006) Prevalence of fatty liver in children and 28 \nadolescents. Pediatrics 118, 1388-1393. 29 \n33. Chan DF, Li AM, Chu WC et al. (2004) Hepatic steatosis in obese Chinese children. Int J 30 \nObes Relat Metab Disord 28, 1257-1263. 31 \n34. Sagi R, Reif S, Neuman G et al. (2007) Nonalcoholic fatty liver disease in overweight 32 \nchildren and adolescents. Acta Paediatr 96, 1209-1213. 33 \n35. Sartorio A, Del Col A, Agosti F et al. (2007) Predictors of non-alcoholic fatty liver disease 34 \nin obese children. Eur J Clin Nutr 61, 877-883. 35 \n36. Damaso AR, do Prado WL, de Piano A et al. (2008) Relationship between nonalcoholic 36 \nfatty liver disease prevalence and visceral fat in obese adolescents. Dig Liver Dis 40, 132-37 \n139. 38 \n37. Lobstein T & Jackson-Leach R (2006) Estimated burden of paediatric obesity and co-39 \nmorbidities in Europe. Part 2. Numbers of children with indicators of obesity-related 40 \ndisease. Int J Pediatr Obes 1, 33-41. 41 \n38. Schwimmer JB, Pardee PE, Lavine JE et al. (2008) Cardiovascular risk factors and the 42 \nmetabolic syndrome in pediatric nonalcoholic fatty liver disease. Circulation 118, 277-283. 43 \n39. Pacifico L, Cantisani V, Ricci P et al. (2008) Nonalcoholic fatty liver disease and carotid 44 \natherosclerosis in children. Pediatr Res 63, 423-427. 45 \n40. Jackson-Leach R & Lobstein T (2006) Estimated burden of paediatric obesity and co-46 \nmorbidities in Europe. Part 1. The increase in the prevalence of child obesity in Europe is 47 \nitself increasing. Int J Pediatr Obes 1, 26-32. 48 \n41. Charlton M (2007) Noninvasive indices of fibrosis in NAFLD: starting to think about a 49 \nthree-hit (at least) phenomenon. Am J Gastroenterol 102, 409-411. 50 \n 15\n42. Musso G, Gambino R & Cassader M (2009) Recent insights into hepatic lipid metabolism 1 \nin non-alcoholic fatty liver disease (NAFLD). Prog Lipid Res 48, 1-26. 2 \n43. Parekh S & Anania FA (2007) Abnormal lipid and glucose metabolism in obesity: 3 \nimplications for nonalcoholic fatty liver disease. Gastroenterology 132, 2191-2207. 4 \n44. Donnelly KL, Smith CI, Schwarzenberg SJ et al. (2005) Sources of fatty acids stored in 5 \nliver and secreted via lipoproteins in patients with nonalcoholic fatty liver disease. J Clin 6 \nInvest 115, 1343-1351. 7 \n45. Fabbrini E, Mohammed BS, Magkos F et al. (2008) Alterations in adipose tissue and 8 \nhepatic lipid kinetics in obese men and women with nonalcoholic fatty liver disease. 9 \nGastroenterology 134, 424-431. 10 \n46. Guerrero R, Vega GL, Grundy SM et al. (2009) Ethnic differences in hepatic steatosis: an 11 \ninsulin resistance paradox? Hepatology 49, 791-801. 12 \n47. Bacon BR, Farahvash MJ, Janney CG et al. (1994) Nonalcoholic steatohepatitis: an 13 \nexpanded clinical entity. Gastroenterology 107, 1103-1109. 14 \n48. Browning JD & Horton JD (2004) Molecular mediators of hepatic steatosis and liver injury. 15 \nJ Clin Invest 114, 147-152. 16 \n49. Anderson N & Borlak J (2008) Molecular mechanisms and therapeutic targets in steatosis 17 \nand steatohepatitis. Pharmacol Rev 60, 311-357. 18 \n50. Tsochatzis EA, Papatheodoridis GV & Archimandritis AJ (2009) Adipokines in 19 \nnonalcoholic steatohepatitis: from pathogenesis to implications in diagnosis and therapy. 20 \nMediators Inflamm 2009, 831670. 21 \n51. Dam-Larsen S, Franzmann M, Andersen IB et al. (2004) Long term prognosis of fatty liver: 22 \nrisk of chronic liver disease and death. Gut 53, 750-755. 23 \n52. Matteoni CA, Younossi ZM, Gramlich T et al. (1999) Nonalcoholic fatty liver disease: a 24 \nspectrum of clinical and pathological severity. Gastroenterology 116, 1413-1419. 25 \n53. Fassio E, Alvarez E, Dominguez N et al. (2004) Natural history of nonalcoholic 26 \nsteatohepatitis: a longitudinal study of repeat liver biopsies. Hepatology 40, 820-826. 27 \n54. Ekstedt M, Franzen LE, Mathiesen UL et al. (2006) Long-term follow-up of patients with 28 \nNAFLD and elevated liver enzymes. Hepatology 44, 865-873. 29 \n55. Ratziu V, Bugianesi E, Dixon J et al. (2007) Histological progression of non-alcoholic fatty 30 \nliver disease: a critical reassessment based on liver sampling variability. Aliment Pharmacol 31 \nTher 26, 821-830. 32 \n56. Sanyal AJ, Banas C, Sargeant C et al. (2006) Similarities and differences in outcomes of 33 \ncirrhosis due to nonalcoholic steatohepatitis and hepatitis C. Hepatology 43, 682-689. 34 \n57. Feldstein AE, Charatcharoenwitthaya P, Treeprasertsuk S et al. (2009) The natural history 35 \nof non-alcoholic fatty liver disease in children: a follow-up study for up to 20 years. Gut 58, 36 \n1538-1544. 37 \n58. Angulo P, Keach JC, Batts KP et al. (1999) Independent predictors of liver fibrosis in 38 \npatients with nonalcoholic steatohepatitis. Hepatology 30, 1356-1362. 39 \n59. Adams LA, Sanderson S, Lindor KD et al. (2005) The histological course of nonalcoholic 40 \nfatty liver disease: a longitudinal study of 103 patients with sequential liver biopsies. J 41 \nHepatol 42, 132-138. 42 \n60. Rafiq N, Bai C, Fang Y et al. (2009) Long-term follow-up of patients with nonalcoholic 43 \nfatty liver. Clin Gastroenterol Hepatol 7, 234-238. 44 \n61. Marchesini G, Bugianesi E, Forlani G et al. (2003) Nonalcoholic fatty liver, steatohepatitis, 45 \nand the metabolic syndrome. Hepatology 37, 917-923. 46 \n62. Gramlich T, Kleiner DE, McCullough AJ et al. (2004) Pathologic features associated with 47 \nfibrosis in nonalcoholic fatty liver disease. Hum Pathol 35, 196-199. 48 \n63. Argo CK, Northup PG, Al-Osaimi AM et al. (2009) Systematic review of risk factors for 49 \nfibrosis progression in non-alcoholic steatohepatitis. J Hepatol 51, 371-379. 50 \n 16\n64. Crowther MA & Cook DJ (2007) Trials and tribulations of systematic reviews and meta-1 \nanalyses. Hematology Am Soc Hematol Educ Program, 493-497. 2 \n65. Adams LA, Lymp JF, St Sauver J et al. (2005) The natural history of nonalcoholic fatty 3 \nliver disease: a population-based cohort study. Gastroenterology 129, 113-121. 4 \n66. Ong JP, Pitts A & Younossi ZM (2008) Increased overall mortality and liver-related 5 \nmortality in non-alcoholic fatty liver disease. J Hepatol 49, 608-612. 6 \n67. Dunn W, Xu R, Wingard DL et al. (2008) Suspected nonalcoholic fatty liver disease and 7 \nmortality risk in a population-based cohort study. Am J Gastroenterol 103, 2263-2271. 8 \n68. Ruhl CE & Everhart JE (2009) Elevated serum alanine aminotransferase and gamma-9 \nglutamyltransferase and mortality in the United States population. Gastroenterology 136, 10 \n477-485 e411. 11 \n69. Struben VM, Hespenheide EE & Caldwell SH (2000) Nonalcoholic steatohepatitis and 12 \ncryptogenic cirrhosis within kindreds. Am J Med 108, 9-13. 13 \n70. Willner IR, Waters B, Patil SR et al. (2001) Ninety patients with nonalcoholic 14 \nsteatohepatitis: insulin resistance, familial tendency, and severity of disease. Am J 15 \nGastroenterol 96, 2957-2961. 16 \n71. Musso G, Gambino R, De Michieli F et al. (2008) Adiponectin gene polymorphisms 17 \nmodulate acute adiponectin response to dietary fat: Possible pathogenetic role in NASH. 18 \nHepatology 47, 1167-1177. 19 \n72. Tokushige K, Hashimoto E, Noto H et al. (2009) Influence of adiponectin gene 20 \npolymorphisms in Japanese patients with non-alcoholic fatty liver disease. J Gastroenterol 21 \n44, 976-982. 22 \n73. Carulli L, Canedi I, Rondinella S et al. (2009) Genetic polymorphisms in non-alcoholic 23 \nfatty liver disease: interleukin-6-174G\/C polymorphism is associated with non-alcoholic 24 \nsteatohepatitis. Dig Liver Dis 41, 823-828. 25 \n74. Tokushige K, Takakura M, Tsuchiya-Matsushita N et al. (2007) Influence of TNF gene 26 \npolymorphisms in Japanese patients with NASH and simple steatosis. J Hepatol 46, 1104-27 \n1110. 28 \n75. Sazci A, Akpinar G, Aygun C et al. (2008) Association of apolipoprotein E polymorphisms 29 \nin patients with non-alcoholic steatohepatitis. Dig Dis Sci 53, 3218-3224. 30 \n76. Romeo S, Kozlitina J, Xing C et al. (2008) Genetic variation in PNPLA3 confers 31 \nsusceptibility to nonalcoholic fatty liver disease. Nat Genet 40, 1461-1465. 32 \n77. Yuan X, Waterworth D, Perry JR et al. (2008) Population-based genome-wide association 33 \nstudies reveal six loci influencing plasma levels of liver enzymes. Am J Hum Genet 83, 520-34 \n528. 35 \n78. Musso G, Gambino R, De Michieli F et al. (2003) Dietary habits and their relations to 36 \ninsulin resistance and postprandial lipemia in nonalcoholic steatohepatitis. Hepatology 37, 37 \n909-916. 38 \n79. Toshimitsu K, Matsuura B, Ohkubo I et al. (2007) Dietary habits and nutrient intake in non-39 \nalcoholic steatohepatitis. Nutrition 23, 46-52. 40 \n80. Zelber-Sagi S, Nitzan-Kaluski D, Goldsmith R et al. (2007) Long term nutritional intake 41 \nand the risk for non-alcoholic fatty liver disease (NAFLD): a population based study. J 42 \nHepatol 47, 711-717. 43 \n81. Kim CH, Kallman JB, Bai C et al. (2008) Nutritional Assessments of Patients with Non-44 \nalcoholic Fatty Liver Disease. Obes Surg. 45 \n82. Spadaro L, Magliocco O, Spampinato D et al. (2008) Effects of n-3 polyunsaturated fatty 46 \nacids in subjects with nonalcoholic fatty liver disease. Dig Liver Dis 40, 194-199. 47 \n83. Zhu FS, Liu S, Chen XM et al. (2008) Effects of n-3 polyunsaturated fatty acids from seal 48 \noils on nonalcoholic fatty liver disease associated with hyperlipidemia. World J 49 \nGastroenterol 14, 6395-6400. 50 \n 17\n84. Solga S, Alkhuraishe AR, Clark JM et al. (2004) Dietary composition and nonalcoholic 1 \nfatty liver disease. Dig Dis Sci 49, 1578-1583. 2 \n85. Kang H, Greenson JK, Omo JT et al. (2006) Metabolic syndrome is associated with greater 3 \nhistologic severity, higher carbohydrate, and lower fat diet in patients with NAFLD. Am J 4 \nGastroenterol 101, 2247-2253. 5 \n86. Bruce KD, Cagampang FR, Argenton M et al. (2009) Maternal high-fat feeding primes 6 \nsteatohepatitis in adult mice offspring, involving mitochondrial dysfunction and altered 7 \nlipogenesis gene expression. Hepatology 50, 1796-1808. 8 \n87. McCurdy CE, Bishop JM, Williams SM et al. (2009) Maternal high-fat diet triggers 9 \nlipotoxicity in the fetal livers of nonhuman primates. J Clin Invest 119, 323-335. 10 \n88. Lirussi F, Azzalini L, Orando S et al. (2007) Antioxidant supplements for non-alcoholic 11 \nfatty liver disease and\/or steatohepatitis. Cochrane Database Syst Rev, CD004996. 12 \n89. Lavine JE (2000) Vitamin E treatment of nonalcoholic steatohepatitis in children: a pilot 13 \nstudy. J Pediatr 136, 734-738. 14 \n90. Kugelmas M, Hill DB, Vivian B et al. (2003) Cytokines and NASH: a pilot study of the 15 \neffects of lifestyle modification and vitamin E. Hepatology 38, 413-419. 16 \n91. Harrison SA, Torgerson S, Hayashi P et al. (2003) Vitamin E and vitamin C treatment 17 \nimproves fibrosis in patients with nonalcoholic steatohepatitis. Am J Gastroenterol 98, 18 \n2485-2490. 19 \n92. Chalasani NP, Sanyal AJ, Kowdley KV et al. (2009) Pioglitazone versus vitamin E versus 20 \nplacebo for the treatment of non-diabetic patients with non-alcoholic steatohepatitis: 21 \nPIVENS trial design. Contemp Clin Trials 30, 88-96. 22 \n93. Lavine JE, Schwimmer JB, Molleston JP et al. (2009) Treatment of nonalcoholic fatty liver 23 \ndisease in children: TONIC trial design. Contemp Clin Trials. 24 \n94. Brun P, Castagliuolo I, Di Leo V et al. (2007) Increased intestinal permeability in obese 25 \nmice: new evidence in the pathogenesis of nonalcoholic steatohepatitis. Am J Physiol 26 \nGastrointest Liver Physiol 292, G518-525. 27 \n95. Wigg AJ, Roberts-Thomson IC, Dymock RB et al. (2001) The role of small intestinal 28 \nbacterial overgrowth, intestinal permeability, endotoxaemia, and tumour necrosis factor 29 \nalpha in the pathogenesis of non-alcoholic steatohepatitis. Gut 48, 206-211. 30 \n96. Sabate JM, Jouet P, Harnois F et al. (2008) High prevalence of small intestinal bacterial 31 \novergrowth in patients with morbid obesity: a contributor to severe hepatic steatosis. Obes 32 \nSurg 18, 371-377. 33 \n97. Sajjad A, Mottershead M, Syn WK et al. (2005) Ciprofloxacin suppresses bacterial 34 \novergrowth, increases fasting insulin but does not correct low acylated ghrelin concentration 35 \nin non-alcoholic steatohepatitis. Aliment Pharmacol Ther 22, 291-299. 36 \n98. Loguercio C, Federico A, Tuccillo C et al. (2005) Beneficial effects of a probiotic VSL#3 37 \non parameters of liver dysfunction in chronic liver diseases. J Clin Gastroenterol 39, 540-38 \n543. 39 \n99. Li Z, Yang S, Lin H et al. (2003) Probiotics and antibodies to TNF inhibit inflammatory 40 \nactivity and improve nonalcoholic fatty liver disease. Hepatology 37, 343-350. 41 \n100. Velayudham A, Dolganiuc A, Ellis M et al. (2009) VSL#3 probiotic treatment attenuates 42 \nfibrosis without changes in steatohepatitis in a diet-induced nonalcoholic steatohepatitis 43 \nmodel in mice. Hepatology 49, 989-997. 44 \n101. Reaven GM (1988) Banting lecture 1988. Role of insulin resistance in human disease. 45 \nDiabetes 37, 1595-1607. 46 \n102. (2001) Executive Summary of The Third Report of The National Cholesterol Education 47 \nProgram (NCEP) Expert Panel on Detection, Evaluation, And Treatment of High Blood 48 \nCholesterol In Adults (Adult Treatment Panel III). Jama 285, 2486-2497. 49 \n 18\n103. Clark JM, Brancati FL & Diehl AM (2003) The prevalence and etiology of elevated 1 \naminotransferase levels in the United States. Am J Gastroenterol 98, 960-967. 2 \n104. Fan JG, Zhu J, Li XJ et al. (2005) Fatty liver and the metabolic syndrome among Shanghai 3 \nadults. J Gastroenterol Hepatol 20, 1825-1832. 4 \n105. Kim HC, Choi SH, Shin HW et al. (2005) Severity of ultrasonographic liver steatosis and 5 \nmetabolic syndrome in Korean men and women. World J Gastroenterol 11, 5314-5321. 6 \n106. Hamaguchi M, Kojima T, Takeda N et al. (2005) The metabolic syndrome as a predictor of 7 \nnonalcoholic fatty liver disease. Ann Intern Med 143, 722-728. 8 \n107. Brea A, Mosquera D, Martin E et al. (2005) Nonalcoholic fatty liver disease is associated 9 \nwith carotid atherosclerosis: a case-control study. Arterioscler Thromb Vasc Biol 25, 1045-10 \n1050. 11 \n108. Targher G, Bertolini L, Padovani R et al. (2006) Non-alcoholic fatty liver disease is 12 \nassociated with carotid artery wall thickness in diet-controlled type 2 diabetic patients. J 13 \nEndocrinol Invest 29, 55-60. 14 \n109. Aygun C, Kocaman O, Sahin T et al. (2008) Evaluation of metabolic syndrome frequency 15 \nand carotid artery intima-media thickness as risk factors for atherosclerosis in patients with 16 \nnonalcoholic fatty liver disease. Dig Dis Sci 53, 1352-1357. 17 \n110. Fracanzani AL, Valenti L, Bugianesi E et al. (2008) Risk of severe liver disease in 18 \nnonalcoholic fatty liver disease with normal aminotransferase levels: a role for insulin 19 \nresistance and diabetes. Hepatology 48, 792-798. 20 \n111. Kim HC, Kim DJ & Huh KB (2009) Association between nonalcoholic fatty liver disease 21 \nand carotid intima-media thickness according to the presence of metabolic syndrome. 22 \nAtherosclerosis 204, 521-525. 23 \n112. McKimmie RL, Daniel KR, Carr JJ et al. (2008) Hepatic steatosis and subclinical 24 \ncardiovascular disease in a cohort enriched for type 2 diabetes: the Diabetes Heart Study. 25 \nAm J Gastroenterol 103, 3029-3035. 26 \n113. Sookoian S & Pirola CJ (2008) Non-alcoholic fatty liver disease is strongly associated with 27 \ncarotid atherosclerosis: a systematic review. J Hepatol 49, 600-607. 28 \n114. Targher G, Bertolini L, Rodella S et al. (2007) Nonalcoholic fatty liver disease is 29 \nindependently associated with an increased incidence of cardiovascular events in type 2 30 \ndiabetic patients. Diabetes Care 30, 2119-2121. 31 \n115. Hamaguchi M, Kojima T, Takeda N et al. (2007) Nonalcoholic fatty liver disease is a novel 32 \npredictor of cardiovascular disease. World J Gastroenterol 13, 1579-1584. 33 \n116. Choi SY, Kim D, Kim HJ et al. (2009) The relation between non-alcoholic fatty liver 34 \ndisease and the risk of coronary heart disease in Koreans. Am J Gastroenterol 104, 1953-35 \n1960. 36 \n117. Schindhelm RK, Dekker JM, Nijpels G et al. (2007) Alanine aminotransferase predicts 37 \ncoronary heart disease events: a 10-year follow-up of the Hoorn Study. Atherosclerosis 191, 38 \n391-396. 39 \n118. Wilson PW, D'Agostino RB, Levy D et al. (1998) Prediction of coronary heart disease 40 \nusing risk factor categories. Circulation 97, 1837-1847. 41 \n119. Hood L, Heath JR, Phelps ME et al. (2004) Systems biology and new technologies enable 42 \npredictive and preventative medicine. Science 306, 640-643. 43 \n120. Weston AD & Hood L (2004) Systems biology, proteomics, and the future of health care: 44 \ntoward predictive, preventative, and personalized medicine. J Proteome Res 3, 179-196. 45 \n121. Calvert VS, Collantes R, Elariny H et al. (2007) A systems biology approach to the 46 \npathogenesis of obesity-related nonalcoholic fatty liver disease using reverse phase protein 47 \nmicroarrays for multiplexed cell signaling analysis. Hepatology 46, 166-172. 48 \n 19\n122. Charlton M, Viker K, Krishnan A et al. (2009) Differential expression of lumican and fatty 1 \nacid binding protein-1: new insights into the histologic spectrum of nonalcoholic fatty liver 2 \ndisease. Hepatology 49, 1375-1384. 3 \n123. Bell LN, Theodorakis JL, Vuppalanchi R et al. (2009) Serum proteomics and biomarker 4 \ndiscovery across the spectrum of nonalcoholic fatty liver disease. Hepatology. 5 \n124. British Liver Trust. Facts about Liver Disease.   [cited June 10th 2009]; Available from: 6 \nhttp:\/\/www.britishlivertrust.org.uk\/home\/media-centre\/facts-about-liver-disease.aspx 7 \n 8 \n 9 \n 20\n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n 10 \n 11 \n 12 \n 13 \n 14 \n 15 \n 16 \n 17 \n 18 \n 19 \n 20 \nFig. 1. Progression of non-alcoholic fatty liver disease (NAFLD). 47% of patients presenting with 21 \nsteatosis progress to steatohepatitis and 25-50% of patients presenting with steatohepatitis develop 22 \nfibrosis or cirrhosis within 8-13 years.(54) The 10 year prognosis for patients with NAFLD-related 23 \ncirrhosis is very poor with 50% requiring a liver transplant, 20% dying of a liver-related cause and 24 \n7% developing hepatocellular carcinoma.(56) Dashed lines indicate the potential for reversal. 25 \n 21\n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n 10 \n 11 \n 12 \n 13 \n 14 \n 15 \n 16 \nFig 2. Genetic and environmental factors associated with non-alcoholic fatty liver disease 17 \n(NAFLD) development and progression.  Solid lines indicate that comorbidities (ovals) in addition 18 \nto genetic and environmental factors influence the development and progression of NAFLD.  19 \nDashed lines show that genetic and environmental factors also influence the development of 20 \ncomorbid conditions. 21 \n 22 \n"}