{"doi":"10.1111\/j.1464-0597.2007.00301.x","coreId":"15303","oai":"oai:dro.dur.ac.uk.OAI2:7815","identifiers":["oai:dro.dur.ac.uk.OAI2:7815","10.1111\/j.1464-0597.2007.00301.x"],"title":"On the romance of leadership : in memory of James R. Meindl.","authors":["Schyns,  B.","Bligh,  M.C."],"enrichments":{"references":[],"documentType":{"type":0.5555555556}},"contributors":[],"datePublished":"2007-11-01","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/15303.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/7815\/1\/7815.pdf","pdfHashValue":"181b50734433eb4e09c1490df83133e0d188a308","publisher":"Blackwell","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:7815<\/identifier><datestamp>\n      2011-01-21T16:19:11Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        On the romance of leadership : in memory of James R. Meindl.<\/dc:title><dc:creator>\n        Schyns,  B.<\/dc:creator><dc:creator>\n        Bligh,  M.C. <\/dc:creator><dc:publisher>\n        Blackwell<\/dc:publisher><dc:source>\n        Applied psychology : an international review, 2007, Vol.56(4), pp.501-504 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2007-11-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:7815<\/dc:identifier><dc:identifier>\n        issn:0269-994X<\/dc:identifier><dc:identifier>\n        issn: 1464-0597<\/dc:identifier><dc:identifier>\n        doi:10.1111\/j.1464-0597.2007.00301.x<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7815\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1111\/j.1464-0597.2007.00301.x<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7815\/1\/7815.pdf<\/dc:identifier><dc:rights>\n        The definitive version is available at www.blackwell-synergy.com<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0269-994X","0269-994x","issn: 1464-0597"," 1464-0597"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n21 January 2011\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nSchyns, B. and Bligh, M.C. (2007) ’On the romance of leadership : in memory of James R. Meindl.’, Applied\npsychology : an international review., 56 (4). pp. 501-504.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1111\/j.1464-0597.2007.00301.x\nPublisher’s copyright statement:\nThe definitive version is available at www.blackwell-synergy.com\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \n \nOn the Romance of Leadership – In Memory of James R. Meindl \n \n \nBirgit Schyns \nUniversity of Portsmouth, Business School, UK \n&  \nMichelle C. Bligh  \nClaremont Graduate University, Claremont, California, USA \n \n \n \n \n \n \nAuthor note: Please address correspondence to Dr. Birgit Schyns, University of Portsmouth, \nPortsmouth Business School, Richmond Building, Portland Street, Portsmouth, PO1 3DE, \nUK. E-mail: birgit.schyns@port.ac.uk.  \nImplicit leadership theories and promotion \n2 \n 2 \nOn the Romance of Leadership – In Memory of James R. Meindl \nIt was a tremendous shock to the leadership community when James R. Meindl suddenly \npassed away three years ago. Leadership research has lost one of its best scholars, and many \nof us have personally lost a wonderful colleague, mentor, teacher, and friend. This special \nissue is dedicated to one of Meindl’s best known  contributions to the field of leadership, the \nRomance of Leadership approach. First introduced in 1985 by Meindl, Ehrlich, and Dukerich, \nthe Romance of Leadership refers to the tendency people have attribute responsibility to \nleaders for company performance and other organizational phenomena, thereby disregarding \nother factors that might be of influence. Subsequent research by Meindl and his colleagues \nhas demonstrated that people value performance results more highly when those results are \nattributed to leadership, and that a halo effect exists for leadership attributes. In other words, \nif an individual is perceived to be an effective leader, his or her personal shortcomings and\/or \npoor organizational performance may be overlooked (Meindl & Ehrlich, 1987).  \nThe Romance of Leadership is a social constructivist approach (Meindl, 1993) that refers \nto how people explain the complex process of how organisational performance transpires. Just \nas when explaining other complex phenomena, people use cognitively less complex \nexplanations rather than reflect on the phenomenon’s real complexity. As a result, leaders and \nleadership issues often become the favoured explanations for various events in and around \norganizations. To put it even more simply: Attributing company performance to the influence \nof the leader is easier than to take into consideration the vast ensemble of possible predictors. \nIn that sense, Romance of Leadership is a follower-centred approach as well (1998): It is not \ninterested in explaining actual leader behaviour but rather in explaining sense-making in \norganisations.  \nMost research in Romance of Leadership so far has focused on the phenomenon itself \n(Meindl et al., 1985; Haslam et al., 2001). In addition, effects and\/or outcomes of the  \nImplicit leadership theories and promotion \n3 \n 3 \nRomance of Leadership have been research in several countries so far. Examples are \nAwamleh’s (2003) research in Jordan or Shamir’s (1992) research in Israel. One of the aims \nof this special issue, therefore, was to bring together research on Romance of Leadership from \ndifferent countries. We were very fortunate that so many scholars responded to our call so that \nthis special issue comprises contributions from xx different countries. In addition, the recent \nstate of the art of the research on Romance of Leadership is reflected in this special issue with \nthree overview articles, two articles on leaders’ Romance of Leadership and one article \nfocusing on a so far neglected part of Romance of Leadership, namely the attribution of \ncreativity to leaders.  \n \nOverview of the contributions in this special issue \nThree of the contributions in this special issue focus on providing overviews. Awamleh \nexamines the relationship between Romance of Leadership and transformational leadership in \ndifferent countries using Hofstede’s culture dimensions as an explanation. Similarly, Schyns, \nFelfe, and Blank conducted a meta-analysis on the relationship between Romance of \nLeadership and the perception of transformational \/ charismatic leadership, thereby including \ndata from different countries. Wolf, Jackson, and Chong while reporting results from one \ncountry use comparison data from other countries to assess the level of romancing leadership \nin Aotearoa.  \n \nA second group of papers extends the focus of Romance of Leadership to leaders. \nSchilling reports a qualitative study on leaders’ conceptions of the consequences of good \nleadership, thereby shedding light on their romantic view of leadership. Gray, Densten, and \nSarros refer to leaders’ own view leadership and how they influence other to believe in \nRomance of Leadership. \nImplicit leadership theories and promotion \n4 \n 4 \n \nJaussi, de Luque, and Rosas extend our understanding of Romance of Leadership by \napplying it to followers’ creativity perceptions. Creativity is thereby one part of the romantic \nview of leaders. \n \nImplicit leadership theories and promotion \n5 \n 5 \nReferences \nAwamleh, R. A. (2003). A test of the transformational leadership model: The case of \nJordanian banks. Paper presented at the Academy of International Business (UK \nChapter), Leicester, UK, 11th to 12the of April. \nHaslam, S. A., Platow, M. J., Turner, J. C., Reynolds, K. J., McGarty, C., Oakes, P. J., \nJohnson, S., Ryan, M. K. & Veenstra, K. (2001). Social identity and the romance of \nleadership: The importance of being seen to be \"doing it for us\". Group Processes and \nIntergroup Relations, 4, 191-205. \nMeindl, J. R. (1993). Reinventing leadership: A radical, social psychological approach. In J. \nK. Murnighan (Ed.), Social Psychology in Organizations (pp. 89-118). Englewood \nCliffs, NJ: Prentice Hall. \nMeindl, J. R. (1998). The romance of leadership as a follower-centric theory: A social \nconstruction approach. In F. Dansereau & F. J. Yammarino (Eds.), Leadership: The \nmultiple-level approaches - Part B: Contemporary and Alternative (pp. 285-298). \nStamford, Connecticut: Jai Press. \nMeindl, J. R. & Ehrlich, S. B. (1987). The Romance of Leadership and the evaluation of \norganizational performance. Academy of Management Journal, 30, 91-109. \nMeindl, J. R., Ehrlich, S. B. & Dukerich, J. M. (1985). The romance of leadership. \nAdministrative Science Quarterly, 30, 78-102. \nShamir, B. (1992). Attribution of influence and charisma to the leader: The Romance of \nLeadership revisited. Journal of Applied Social Psychology, 22, 386-407. \n \n"}