{"doi":"10.1029\/2008GL033794","coreId":"69979","oai":"oai:eprints.lancs.ac.uk:19225","identifiers":["oai:eprints.lancs.ac.uk:19225","10.1029\/2008GL033794"],"title":"Simultaneous THEMIS in situ and auroral observations of a small substorm","authors":["Donovan, E.","Liu, W.","Liang, J.","Spanswick, E.","Voronkov, I.","Conners, M.","Syrjasuo, M.","Baker, G.","Jackel, B.","Trondsen, T.","Greffen, M.","Angelopoulos, V.","Russell, C.T.","Mende, S.B.","Frey, H.U.","Keiling, A.","Carlson, C.W.","McFadden, J.P.","Glassmeier, K.-H.","Auster, U.","Hayashi, K.","Sakaguchi, K.","Shiokawa, K.","Wild, J.A.","Rae, I.J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-08-12","abstract":"We present ground-based and in situ observations from March 13, 2007. The THEMIS satellites were in the evening sector conjugate to THEMIS ground-based imagers. At ∼0507 UT there was an optical onset on inner CPS field lines. This involved near-simultaneous brightening of 1 MLT hour longitudinal segment of the onset arc. The part of the arc that brightened was that closest to the equatorward boundary of the diffuse (proton) aurora. Within one minute, a dipolarization front moved across four THEMIS satellites. Based on their locations, the order in which they detected the dipolarization front, and the auroral evolution, we assert that the expansion phase began earthward of the four satellites and evolved radially outwards. We conclude that this onset occurred in an azimuthally localized region of highly stretched field lines","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69979.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/19225\/1\/art_924.pdf","pdfHashValue":"7592ead6423c2b55d56a3a317b3b27a6dc6363bf","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:19225<\/identifier><datestamp>\n      2018-01-24T02:31:04Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Simultaneous THEMIS in situ and auroral observations of a small substorm<\/dc:title><dc:creator>\n        Donovan, E.<\/dc:creator><dc:creator>\n        Liu, W.<\/dc:creator><dc:creator>\n        Liang, J.<\/dc:creator><dc:creator>\n        Spanswick, E.<\/dc:creator><dc:creator>\n        Voronkov, I.<\/dc:creator><dc:creator>\n        Conners, M.<\/dc:creator><dc:creator>\n        Syrjasuo, M.<\/dc:creator><dc:creator>\n        Baker, G.<\/dc:creator><dc:creator>\n        Jackel, B.<\/dc:creator><dc:creator>\n        Trondsen, T.<\/dc:creator><dc:creator>\n        Greffen, M.<\/dc:creator><dc:creator>\n        Angelopoulos, V.<\/dc:creator><dc:creator>\n        Russell, C.T.<\/dc:creator><dc:creator>\n        Mende, S.B.<\/dc:creator><dc:creator>\n        Frey, H.U.<\/dc:creator><dc:creator>\n        Keiling, A.<\/dc:creator><dc:creator>\n        Carlson, C.W.<\/dc:creator><dc:creator>\n        McFadden, J.P.<\/dc:creator><dc:creator>\n        Glassmeier, K.-H.<\/dc:creator><dc:creator>\n        Auster, U.<\/dc:creator><dc:creator>\n        Hayashi, K.<\/dc:creator><dc:creator>\n        Sakaguchi, K.<\/dc:creator><dc:creator>\n        Shiokawa, K.<\/dc:creator><dc:creator>\n        Wild, J.A.<\/dc:creator><dc:creator>\n        Rae, I.J.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        We present ground-based and in situ observations from March 13, 2007. The THEMIS satellites were in the evening sector conjugate to THEMIS ground-based imagers. At ∼0507 UT there was an optical onset on inner CPS field lines. This involved near-simultaneous brightening of 1 MLT hour longitudinal segment of the onset arc. The part of the arc that brightened was that closest to the equatorward boundary of the diffuse (proton) aurora. Within one minute, a dipolarization front moved across four THEMIS satellites. Based on their locations, the order in which they detected the dipolarization front, and the auroral evolution, we assert that the expansion phase began earthward of the four satellites and evolved radially outwards. We conclude that this onset occurred in an azimuthally localized region of highly stretched field lines.<\/dc:description><dc:date>\n        2008-08-12<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:relation>\n        http:\/\/dx.doi.org\/10.1029\/2008GL033794<\/dc:relation><dc:identifier>\n        Donovan, E. and Liu, W. and Liang, J. and Spanswick, E. and Voronkov, I. and Conners, M. and Syrjasuo, M. and Baker, G. and Jackel, B. and Trondsen, T. and Greffen, M. and Angelopoulos, V. and Russell, C.T. and Mende, S.B. and Frey, H.U. and Keiling, A. and Carlson, C.W. and McFadden, J.P. and Glassmeier, K.-H. and Auster, U. and Hayashi, K. and Sakaguchi, K. and Shiokawa, K. and Wild, J.A. and Rae, I.J. (2008) Simultaneous THEMIS in situ and auroral observations of a small substorm. Geophysical Research Letters, 35 (17). ISSN 0094-8276<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/19225\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1029\/2008GL033794","http:\/\/eprints.lancs.ac.uk\/19225\/"],"year":2008,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"Simultaneous THEMIS in situ and auroral observations of a small\nsubstorm\nE. Donovan,1 W. Liu,2 J. Liang,2 E. Spanswick,1 I. Voronkov,3 M. Connors,3\nM. Syrja¨suo,4 G. Baker,1 B. Jackel,1 T. Trondsen,1 M. Greffen,1 V. Angelopoulos,5\nC. T. Russell,5 S. B. Mende,6 H. U. Frey,6 A. Keiling,6 C. W. Carlson,6 J. P. McFadden,6\nK.-H. Glassmeier,7 U. Auster,7 K. Hayashi,8 K. Sakaguchi,9 K. Shiokawa,9 J. A. Wild,10\nand I. J. Rae11\nReceived 27 February 2008; revised 15 April 2008; accepted 2 May 2008; published 12 August 2008.\n[1] We present ground-based and in situ observations from\nMarch 13, 2007. The THEMIS satellites were in the\nevening sector conjugate to THEMIS ground-based\nimagers. At \u00010507 UT there was an optical onset on\ninner CPS field lines. This involved near-simultaneous\nbrightening of 1 MLT hour longitudinal segment of the\nonset arc. The part of the arc that brightened was that closest\nto the equatorward boundary of the diffuse (proton) aurora.\nWithin one minute, a dipolarization front moved across four\nTHEMIS satellites. Based on their locations, the order in\nwhich they detected the dipolarization front, and the auroral\nevolution, we assert that the expansion phase began\nearthward of the four satellites and evolved radially\noutwards. We conclude that this onset occurred in an\nazimuthally localized region of highly stretched field lines.\nCitation: Donovan, E., et al. (2008), Simultaneous THEMIS in\nsitu and auroral observations of a small substorm, Geophys. Res.\nLett., 35, L17S18, doi:10.1029\/2008GL033794.\n1. Introduction\n[2] In the ionosphere, onset begins with the brightening\nof a preexisting or recently formed (most equatorward)\nauroral arc [Akasofu, 1964; Lyons et al., 2002]. Topside\nionospheric particle observations show that this arc is on\nclosed field lines, within or poleward of the Central Plasma\nSheet (CPS) proton precipitation which marks in the\nionosphere the transition between dipole- and tail-like\ntopologies [Lui and Burrows, 1978]. The arc brightening\nsignals expansion phase in the inner (around the dipolar\/\ntail-like transition) CPS, and is related to dispersionless\ninjection, dipolarization, and the current wedge. The current\nwedge and dipolarization indicate a decrease in transverse\ncurrent in the inner CPS due to a kinetic- or macroscale\ninstability such as ballooning, or braking of fast CPS flows\n[Roux et al., 1991; Lui, 1996; Shiokawa et al., 1998;\nAngelopoulos et al., 1999]. In many cases, inner CPS\nonset and auroral onset either precede or follow Near-\nEarth Reconnection (NER) [Baker et al., 1996]. Proposed\nmodes of CD\/NER interaction are a tailward propagating\nrarefaction wave (CD leads to NER), or a fast flow (NER\nleads to CD). These two scenarios are the CD and Near\nEarth Neutral Line (NENL) models, respectively [Lui, 1996;\nBaker et al., 1996], two paradigms within which substorm\ndata is often interpreted.\n[3] We are at an impasse as to which scenario best\nrepresents specific events. THEMIS [Angelopoulos et al.,\n2008] blends ground-based and magnetically conjugate in\nsitu observations designed to resolve the CD versus NENL\ncontroversy. Liang et al. [2008] present THEMIS All-Sky\nImager (ASI) array [Donovan et al., 2006; Mende et al.,\n2008] observations of the onset auroral brightening for eight\nevents. In each, the initial brightening is along a longitudi-\nnally extended region (10–20\u0001), exhibits linear exponential\ngrowth (t = 10–30 s), and periodic structuring along the arc\n(m > 100). One of those events occurred after the launch of\nthe THEMIS satellites, at a time when the constellation was\nconjugate to the ASI array. The ASI data and the satellite-\nground magnetic conjugacy were excellent, and the Flux-\ngate Magnetometers (FGM) [Auster et al., 2008] were\noperating on each satellite. Here we present a more thor-\nough investigation of this event to explore the relationship\nbetween the optical onset and the underlying magnetotail\ndynamics.\n2. Observations\n[4] The event occurred onMarch 13, 2007. Cluster observed\nhigh (\u0001650 km\/sec) solar wind speed and variable IMF\ndirection upstream of the bow shock. There was clear weather\nover six ASIs spanning six hours of MLT around the satellite\nfootprints. The activity included several auroral onsets, one at\n\u00010507 UT that had optical onset clearly within the ASI\nfields of view. THEMIS E (TH-E in Figure 1) was located at\n\u000110.5 Re radial distance and above (north of) the neutral\nGEOPHYSICAL RESEARCH LETTERS, VOL. 35, L17S18, doi:10.1029\/2008GL033794, 2008\nClick\nHere\nfor\nFull\nArticle\n1Department of Physics and Astronomy, University of Calgary, Calgary,\nAlberta, Canada.\n2Space Sciences Division, Canadian Space Agency, Saint-Hubert,\nQuebec, Canada.\n3Athabasca University Geophysical Observatory, Athabasca University,\nAthabasca, Alberta, Canada.\n4Finnish Meteorological Institute, Helsinki, Finland.\n5IGPP, UCLA, Los Angeles, California, USA.\n6Space Sciences Laboratory, University of California, Berkeley,\nBerkeley, California, USA.\n7Instiute of Geophysics and Extraterrestrial Physics, Technical\nUniversity of Braunschweig, Braunschweig, Germany.\n8Department of Earth and Planetary Physics, University of Tokyo,\nTokyo, Japan.\n9Solar-Terrestrial Environment Laboratory, Nagoya University, Nagoya,\nJapan.\n10Department of Communication Systems, Lancaster University,\nLancaster, UK.\n11Department of Physics, University of Alberta, Edmonton, Alberta,\nCanada.\nCopyright 2008 by the American Geophysical Union.\n0094-8276\/08\/2008GL033794$05.00\nL17S18 1 of 5\nsheet. TH-A,B,D were clustered around 8.5 Re, and also\nabove the neutral sheet. TH-C was too close to Earth to be\nrelevant. There were three GOES satellites spanning the\nTHEMIS MLT region.\n[5] Figure 2 includes three ASI mosaics (Mosaics A–C)\nfrom the 0507 UT auroral onset. Mosaic A shows the aurora\n\u00011 minute after the onset. The arc that brightened is clearly\nvisible across five hours of MLT (the magnetic longitude\nlines are one hour apart). Mosaics B and C show the aurora\none and two minutes later, illustrating brightening along\nan azimuthally extended region with periodic structuring\n(m \u0001 120) as discussed by Liang et al. [2008]. In the\npreceding minutes, we see no evidence of structured aurora\nimmediately poleward of the onset arc that would indicate\nfast flows connecting the inner CPS with the mid-tail\nregion (e.g., north-south structures as discussed by Zesta\net al. [2000]) although the poleward arcs that are on the\nnorthern edge of the mosaic are active during the minutes\nbefore and after onset.\n[6] Figure 2, top right panel, is the same mosaic as in\nMosaic A, with context. We show the T89 Kp = 5 satellite\nfoot points (the short curve through each symbol indicates\nthe Kp = 3 to >5 foot points gives an idea of latitudinal\nmapping uncertainty). Longitudinal displacement of the foot\npoints of an hour or more towards midnight can be expected\ndue to field-aligned current effects [Donovan, 1993]. We\nindicate the arc that brightened with the poleward red\/black\ncurve. The NORSTAR Meridian Scanning Photometer\n(MSP) at Pinawa obtained scans of 486 nm ‘‘H-beta’’\nproton and 630 nm Oxygen ‘‘redline’’ aurora. We have\nsuperposed meridian scans of the emissions (H-beta in blue;\nredline in red) assuming emission heights of 150 and 230 km,\nrespectively. From the redline data, it is clear that closed field\nlines extend at least 5\u0001 latitude poleward of the onset arc\n[see Blanchard et al., 1995]. The H-beta equatorward\nboundary is the ionospheric projection of the earthward\nlimit of strong pitch angle scattering of the CPS protons\nresponsible for the proton aurora, and hence is a proxy for\nthe transition between tail-like and dipole-like field line\ntopologies [see Samson et al., 1992]. In the Pinawa\nmeridian, the bright proton aurora is coincident with the\nband of diffuse aurora visible in the white light data.\nFigure 1. THEMIS and GOES locations at the first onset.\nTHEMIS A, B, D, and E are above the neutral sheet. The\nfield lines are from the Tsyganenko [1989] ‘‘T89’’ model.\nThe thick black lines at each THEMIS satellite indicate the\nmagnetic field from FGM.\nFigure 2. Three mosaics (A, B, and C) showing THEMIS ASI data from the three minutes after the optical onset.\nThe context information overplotted on the top right panel (same as Mosaic A) is described in the text. The thick\ngrey lines (top right panel) show the meridian slices from which the keogram in Figure 4 was obtained.\nL17S18 DONOVAN ET AL.: THEMIS OBSERVATION OF A SMALL SUBSTORM L17S18\n2 of 5\nAssuming this relation holds at other longitudes, we use\nthe mosaic to provide an ‘‘iso-contour’’ of the H-beta\nequatorward boundary, indicated here by the lower latitude\nred\/black curve. Finally, we also show La Ronge, which\nwe estimate to be the closest ground magnetometer to the\nonset location. The five grey strips indicate where data\nwas extracted for keograms and line plots in Figure 4.\nThey span one hour of MLT, and cover from 62\u0001 to 67\u0001\nmagnetic latitude. The onset began on or near a preexist-\ning arc structure just poleward of the bright proton aurora,\nand expanded poleward. The subsequent evolution of the\naurora did not result in north-south structures, and stalled\nbefore it reached the poleward limit of closed field lines\n(as inferred from the MSP redline data).\n[7] Figure 3 is a stack plot of data from selected satellite\nand ground-based instruments. The two keograms show\nASI data on the Pinawa and La Ronge meridians. The 0507\nonset is indicated by the two red circles. THEMIS FGM Bx\nand the magnetic inclination at GOES 11 show dipolariza-\ntion and TH-A ElectroStatic Analyzer (plasma distribution\nfor <30 keV ions and electrons) (J. P. McFadden et al.,\nTHEMIS ESA first science results and performance issues,\nsubmitted to Space Science Review, 2008) data (not shown)\nshows CPS thickening associated with the onset (the ESA\ndata shows TH-A to be in the CPS or PSBL at the time of\nonset). The La Ronge magnetometer shows a clear Pi2 burst\nand negative H-bay with the onset. The Pinawa H-beta\nkeogram shows fading as discussed by Liu et al. [2007] in\nthe 15 minutes prior to the first event. The red curve\nsuperposed on the bottom two plots of Figure 3 shows\nthe ‘‘optical b2I’’, a proxy for the equatorward boundary\nof the proton aurora (see Donovan et al. [2003]). As well,\nin the minutes after the onset there is intrusion of electron\naurora equatorward of the proton aurora indicating electron\ninjection (indicated by the green circle).\n[8] Figure 4 focuses on the minutes around the onset.\nFigure 4 (top) shows Bx from TH-A,B,D, and E. The\ndecrease in Bx corresponds to a local decrease in cross-tail\ncurrent. This dipolarization front passes TH-D at \u0001050750\nUT, and then B, A, and finally E at \u0001050755, \u0001050815,\nand \u0001050900 UT, respectively. The satellites are aligned\nroughly radially (Figure 1), but in the evening sector so this\nindicates outward radial and\/or duskward azimuthal expan-\nsion. The keogram is from the middle meridian (grey) slice\nin Figure 1. The preexisting arc turns off around the time of\nonset. Examination of the auroral data for the ten minutes\nFigure 3. Overview of active period, described in detail in the text.\nL17S18 DONOVAN ET AL.: THEMIS OBSERVATION OF A SMALL SUBSTORM L17S18\n3 of 5\nprevious to the onset indicates this turning off is not part of\na cycle of a ULF wave. Further, the structure that does\nbrighten appears as a new feature immediately equatorward\nof the preexisting arc as reported by Lyons et al. [2002].\nThis new feature emerges smoothly from the background,\nmaking it difficult to identify an exact optical onset time.\nThe ewogram (east-west ‘‘gram’’) shows peak intensity\nbetween 62\u0001 and 67\u0001 magnetic latitude as a function of\nmagnetic longitude and UT. It is difficult to identify an\nonset meridian: based on the ewogram, the brightening\noccurs within 20 seconds along a \u00011 hour MLT region of\nthe arc, as discussed for this and seven other events by\nLiang et al. [2008]. Nevertheless, our best estimate is that\nthe brightening began first in the vicinity of 310 degrees\nmagnetic longitude (La Ronge meridian).\n[9] The line plots (fourth panel of Figure 4) show peak\nbrightness along the grey meridional strips in Figure 1. The\nbrightness along each fades to a minimum, corresponding to\nthe turning off of the preexisting arc, and then grows\nlinearly for \u00011.5 minutes. The thick dashed curve corre-\nsponds to linear growth time (t) of 30 seconds. The\nbrightness on all three meridians saturates after 3t. The\nbrightness increases more or less uniformly across the hour\nof MLT west of the Pinawa meridian (within \u000120 seconds).\n[10] The data presented here show the following: 1) The\n\u00010507 UT optical onset occurred immediately equatorward\nof a preexisting arc that spanned >5 MLT hours; 2) That\npreexisting arc was closest in latitude to the equatorward\nboundary of the proton aurora over \u00011 MLT hour and the\noptical onset was in that 1 hour of MLT; 3) There was\nproton auroral fading in the 15 minutes prior to the onset;\n4) The onset arc, which appeared as a new feature\ndisplaced slightly equatorward of the preexisting arc,\nbrightened nearly simultaneously across that one hour of\nMLT and grew exponentially for 3t (t = 30 seconds), after\nwhich the disturbance saturated while still within closed\nfield lines; 5) There was no signature in the aurora\nindicating a fast flow preceding and causing the 0507 UT\nonset; 6) The foot points of THEMIS E, D, B, and A were\nall in or shifted towards midnight (due to the effects of\nfield-aligned currents) from the initial brightening region; 7)\nThe dipolarization front moved across THEMIS D, B, A,\nand then E in order, indicating outward radial and\/or\nduskward azimuthal evolution.\n3. Discussion\n[11] As stated in the data section, prior to the optical\nonset at \u00010507, there was no auroral activity poleward of\nthe onset arc to indicate a mid-tail process that caused the\ninner CPS disturbance and optical onset. The brightening of\nthe arc occurred along \u00011 MLT hour. The foot points of\nTHEMIS A, B, D, and E were either in or east (towards\nmidnight) of that region. The dipolarization front passed the\nsatellites starting with THEMIS D, then B, A, and finally E\n(one minute later). Given the footprint locations, the order-\ning that would be expected as a consequence of azimuthal\npropagation away from the initial brightening would be E,\nthen A, B, and D (e.g., eastward across the satellites). The\nlack of activity prior to the onset poleward of the arc that\nbrightened, longitudinal extent of the initial brightening, and\nordering of the dipolarization as seen by the satellites, lead us\nto conclude that the substorm began with the brightening\non field lines earthward of, and then propagated radially\noutwards across, the four THEMIS satellites. Given that the\nfirst sign of the substorm at a satellite was at 050750 UT,\nthe optical brightening occurred at \u00010507 UT, assuming at\nleast 30 seconds for the onset information to propagate to\nthe ionosphere, and considering it took \u00011 minute for\nthe disturbance to propagate from THEMIS D\/B\/A to\nTHEMIS E, we infer the onset occurred on field lines\nthreading the neutral sheet roughly 7–8 Re from the Earth\n(consistent with the average radial location of the start of\ndispersionless injection based on multipoint in situ\nobservations (E. Spanswick et al., Injection region propa-\nFigure 4. (first panel) GSM X-component magnetic field\nfrom FGM on THEMIS A, B, D, and E. (second panel) The\nkeogram shows data from the middle of the meridian slices\nindicated by the thick grey lines in Figure 1. The diffuse\naurora which we assert marks the bright proton aurora (note\nwe are not attributing this brightness to the proton aurora) is\nvisible in the bottom half of the keogram. (third panel) The\newogram shows the peak brightness between 62\u0001 and 67\u0001\nmagnetic latitude (again corresponding to the grey strips in\nFigure 1) as function of magnetic longitude and UT. The\newogram data is from the ASI at The Pas. (fourth panel) Peak\nbrightness on the 5 meridian slices indicated in Figure 1. The\nthick dashed curve corresponds to linear growth with an\ne-folding time of 30 seconds.\nL17S18 DONOVAN ET AL.: THEMIS OBSERVATION OF A SMALL SUBSTORM L17S18\n4 of 5\ngation beyond geosynchronous orbit, manuscript in prepara-\ntion, 2008)). Finally, the onset occurred relatively far from\nthe open-closed field-line boundary, near the transition from\ntail-like to dipolar field lines, based on consideration of the\nNORSTAR MSP and THEMIS ASI observations. We con-\nclude that this onset is consistent with the CD scenario\ndescribed in the introduction.\n[12] Asserting the onset was ‘‘CD-type’’ describes where\nthe field lines on which the optical onset mapped to in the\nCPS (namely near the dipolar\/tail-like transition), and lack\nof evidence suggesting a fast flow (or other mode of\ninteraction) that might have communicated the effects of\nNER to cause CD. This does not tell us the nature of the\nCD. The auroral and magnetotail evolution will be useful in\nthat regard. The proton auroral fading on a time scale of\n\u000110 minutes, and electron auroral fading (e.g., the shutting\noff of the electron arc) on a timescale of \u00012 minutes are\nsuggestive of a two step process, with the electron auroral\nfading corresponding to ‘‘runaway’’ growth at the end of the\ngrowth phase [see Ohtani et al., 1991]. The initial bright-\nening across \u00011 MLT hour occurred on the part of the\ngrowth phase arc closest to the bright proton aurora which\nin turn corresponds to the transition between dipolar and\ntail-like topologies [Samson et al., 1992]. The localized\nregion wherein the preexisting arc is close to the proton\naurora is consistent with an azimuthally localized region of\nstretching in the magnetotail which in turn brought an\nunstable gradient or boundary in the CPS close to the inner\nedge of the plasma sheet, giving a preferential region for\nonset to occur. Azimuthally localized stretching has been\nsuggested in previous studies [Jayachandran et al., 2005],\nbut has not been so clearly demonstrated in any event. The\nm\u0001120 azimuthal structure that arose on the arc in the\nexpansion phase is possibly a manifestation of a magnetotail\nwave mode that grew in that stretched slot [see Liang et al.,\n2008]. The linear growth with t \u0001 30 seconds and satura-\ntion are suggestive of shear flow ballooning.\n[13] It is universally accepted that optical onset begins on\nfield lines threading a preexisting or newly formed auroral\narc [Akasofu, 1964; Lyons et al., 2002]. For a CD-type\nsubstorm, this arc is the ionospheric counterpart of whatever\nmagnetospheric feature on which the instability develops. It\nis of critical importance for understanding of the substorm\nonset to establish the connection between auroral arcs and\ntheir magnetospheric counterparts. Coordinated THEMIS\nASI and in situ observations will provide us the opportunity\nto make this connection.\n[14] Acknowledgments. THEMIS is funded by NASA contract\nNAS5-02099. The development and deployment of the THEMIS ASIs\nwas also supported by CSA contract 9F007-046101. Operational support\nfor the Pinawa MSP is provided by the CSA Canadian GeoSpace\nMonitoring program. The La Ronge magnetometer and Athabasca THEMIS\nASI are operated in collaboration with Athabasca University Geophysical\nObservatory. Howard Singer provided us with the GOES 11 data.\nReferences\nAkasofu, S.-I. (1964), The development of the auroral substorm, Planet.\nSpace Sci., 19, 10.\nAngelopoulos, V., et al. (2008), The THEMIS mission, Space Sci. Rev.,\ndoi:10.1007\/s11214-008-9336-1.\nAngelopoulos, V., F. Mozer, T. Mukai, K. Tsuruda, S. Kokubun, and\nT. Hughes (1999), On the relationship between bursty bulk flows, current\ndisruption, and substorms, Geophys. Res. Lett., 26, 2841.\nAuster, U., et al. (2008), The THEMIS fluxgate magnetometer, Space Sci.\nRev., doi:10.1007\/s11214-008-9365-9.\nBaker, D. N., T. Pulkkinen, V. Angelopoulos, W. Baumjohann, and\nR. McPherron (1996), Neutral line model of substorms: Past results\nand present view, J. Geophys. Res., 101, 12,975.\nBlanchard, G. T., L. R. Lyons, J. C. Samson, and F. J. Rich (1995), Locating\nthe polar cap boundary from observations of 6300 A˚ auroral emission,\nJ. Geophys. Res., 100, 7855.\nDonovan, E. (1993), Modeling the magnetic effects of field-aligned\ncurrents, J. Geophys. Res., 98, 13,529.\nDonovan, E., et al. (2006), The THEMIS all-sky imaging array-system\ndesign and initial results from the prototype imager, J. Atmos. Sol. Terr.\nPhys., 68, 1472.\nJayachandran, P. T., E. F. Donovan, J. W. MacDougall, D. R. Moorcroft,\nK. Liou, P. T. Newell, and J.-P. St-Maurice (2005), Global and local\nequatorward expansion of the ion auroral oval before substorm onsets,\nJ. Geophys. Res., 110, A05204, doi:10.1029\/2004JA010837.\nLiang, J., et al. (2008), Intensification of preexisting auroral arc at substorm\nexpansion onset: Wave-like disruption during the first tens of seconds,\nGeophys. Res. Lett., 35, L17S19, doi:10.1029\/2008GL033666.\nLiu, W. W., E. F. Donovan, J. Liang, I. Voronkov, E. Spanswick,\nP. T. Jayachandran, B. Jackel, and M. Meurant (2007), On the equator-\nward motion and fading of proton aurora during substorm growth\nphase, J. Geophys. Res., 112, A10217, doi:10.1029\/2007JA012495.\nLui, A. T. Y. (1996), Current disruption in the inner magnetosphere:\nObservations and models, J. Geophys. Res., 101, 13,067.\nLui, A. T. Y., and J. R. Burrows (1978), On the location of auroral arcs near\nsubstorm onset, J. Geophys. Res., 83, 3342.\nLyons, L. R., I. O. Voronkov, E. F. Donovan, and E. Zesta (2002), Relation\nof substorm breakup arc to other growth-phase auroral arcs, J. Geophys.\nRes., 107(A11), 1390, doi:10.1029\/2002JA009317.\nMende, S. B., et al. (2008), The THEMIS array of ground based observa-\ntories for the study of auroral substorms, Space Sci. Rev., doi:10.1007\/\ns11214-008-9380.\nOhtani, S., K. Takahashi, L. J. Zanetti, T. A. Potemra, R. W. McEntire, and\nT. Iijima (1991), Tail current disruption in the geosynchronous region, in\nMagnetospheric Substorms, AGU Geophys. Monogr. Ser., vol. 64, edited\nby J. R. Kan et al., pp. 131–137, AGU, Washington, D. C.\nRoux, A., S. Perraut, P. Robert, A. Morane, A. Pedersen, A. Korth,\nG. Kremser, B. Aparicio, D. Rodgers, and R. Pellinen (1991), Plasma\nsheet instability related to the westward traveling surge, J. Geophys.\nRes., 96, 17,697.\nSamson, J. C., et al. (1992), Proton aurora and substorm intensification,\nJ. Geophys. Res. Lett., 19, 2167.\nShiokawa, K., et al. (1998), High-speed ion flow, substorm current wedge,\nand multiple Pi 2 pulsations, J. Geophys. Res., 103, 4491.\nTsyganenko, N. A. (1989), A magnetospheric magnetic field model with a\nwarped tail current sheet, Planet. Space Sci., 37, 5.\nZesta, E., L. R. Lyons, and E. Donovan (2000), The auroral signature of\nearthward flow bursts observed in the magnetotail, Geophys. Res. Lett.,\n27, 3241.\n\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\nV. Angelopoulos and C. T. Russell, IGPP, UCLA, Box 951567, Los\nAngeles, CA 90095, USA.\nU. Auster and K.-H. Glassmeier, Instiute of Geophysics and Extra-\nterrestrial Physics, Technical University of Braunschweig, Braunschweig,\nD-38106 Germany.\nG. Baker, E. Donovan, M. Greffen, B. Jackel, E. Spanswick, and\nT. Trondsen, Department of Physics and Astronomy, University of\nCalgary, Calgary, AB T2N 1N4, Canada. (edonovan@ucalgary.ca)\nC. W. Carlson, H. U. Frey, A. Keiling, J. P. McFadden, and S. B. Mende,\nSpace Sciences Laboratory, University of California, Berkeley, 7 Gauss\nWay, Berkeley, CA 94720-7450, USA.\nM. Connors and I. Voronkov, Athabasca University Geophysical\nObservatory, Athabasca University, Athabasca, AB T9S 3A3, Canada.\nK. Hayashi, Department of Earth and Planetary Physics, University of\nTokyo, Bunkyo-ku, Tokyo, Japan.\nJ. Liang and W. Liu, Space Sciences Division, Canadian Space Agency,\n6767 Route de l’Ae´roport, Saint-Hubert, QC J3Y 8Y9, Canada.\nI. J. Rae, Department of Physics, University of Alberta, Edmonton,\nAB T6G 2R3, Canada.\nK. Sakaguchi and K. Shiokawa, Solar-Terrestrial Environment Laboratory,\nNagoya University, Nagoya, Japan.\nM. Syrja¨suo, Finnish Meteorological Institute, Helsinki FI-00101,\nFinland.\nJ. A. Wild, Department of Communication Systems, Lancaster\nUniversity, Lancaster, LA1 4WA, UK.\nL17S18 DONOVAN ET AL.: THEMIS OBSERVATION OF A SMALL SUBSTORM L17S18\n5 of 5\n"}