{"doi":"10.1207\/S15327868MS1804_4","coreId":"19351","oai":"oai:eprints.bham.ac.uk:49","identifiers":["oai:eprints.bham.ac.uk:49","10.1207\/S15327868MS1804_4"],"title":"The effect of cultural background on metaphor interpretation","authors":["Littlemore, Jeannette"],"enrichments":{"references":[],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2003","abstract":"This article describes a study that investigated the ways in which Bangladeshi students interpreted metaphors used by their lecturers during a short course at a British university. The students were asked to interpret a number of metaphors presented in context. They were also asked to identify the value judgements that were being expressed through these metaphors in these particular contexts. Culture-specific assumptions about the target domains appeared to affect the students’ recognition of the lecturers’ attitudes to the issues they were discussing. In order to identify areas of disparity between the (working) cultures of the Bangladeshi students and their British lecturers, Hofstede’s (1980) cultural values questionnaire was administered. The students were found to be more likely than their lecturers to favour uncertainty avoidance, and to favour high power distance at work. The kinds of (mis)interpretations that the students made of (the evaluative content of) the metaphors appeared in accordance with these cultural differences. Implications of these findings are discussed","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"Lawrence Erlbaum Associates","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.bham.ac.uk:49<\/identifier><datestamp>\n      2011-10-12T11:00:48Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D50:5045<\/setSpec><setSpec>\n      7375626A656374733D50:5031<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        The effect of cultural background on metaphor interpretation<\/dc:title><dc:creator>\n        Littlemore, Jeannette<\/dc:creator><dc:subject>\n        PE English<\/dc:subject><dc:subject>\n        P Philology. Linguistics<\/dc:subject><dc:description>\n        This article describes a study that investigated the ways in which Bangladeshi students interpreted metaphors used by their lecturers during a short course at a British university. The students were asked to interpret a number of metaphors presented in context. They were also asked to identify the value judgements that were being expressed through these metaphors in these particular contexts. Culture-specific assumptions about the target domains appeared to affect the students’ recognition of the lecturers’ attitudes to the issues they were discussing. In order to identify areas of disparity between the (working) cultures of the Bangladeshi students and their British lecturers, Hofstede’s (1980) cultural values questionnaire was administered. The students were found to be more likely than their lecturers to favour uncertainty avoidance, and to favour high power distance at work. The kinds of (mis)interpretations that the students made of (the evaluative content of) the metaphors appeared in accordance with these cultural differences. Implications of these findings are discussed.<\/dc:description><dc:publisher>\n        Lawrence Erlbaum Associates<\/dc:publisher><dc:date>\n        2003<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.bham.ac.uk\/49\/1\/Littlemore_%2D_Effect_of_cultural_%2D_L.pdf<\/dc:identifier><dc:relation>\n        public<\/dc:relation><dc:relation>\n        http:\/\/eprints.bham.ac.uk\/49\/1.hassmallThumbnailVersion\/Littlemore_%2D_Effect_of_cultural_%2D_L.pdf<\/dc:relation><dc:relation>\n        http:\/\/www.leaonline.com\/doi\/pdf\/10.1207\/S15327868MS1804_4<\/dc:relation><dc:identifier>\n        Littlemore, Jeannette (2003) The effect of cultural background on metaphor interpretation. Metaphor and symbol, 18 (4). pp. 273-288. ISSN 1092-6488<\/dc:identifier><dc:relation>\n        http:\/\/eprints.bham.ac.uk\/49\/<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["public","http:\/\/eprints.bham.ac.uk\/49\/1.hassmallThumbnailVersion\/Littlemore_%2D_Effect_of_cultural_%2D_L.pdf","http:\/\/www.leaonline.com\/doi\/pdf\/10.1207\/S15327868MS1804_4","http:\/\/eprints.bham.ac.uk\/49\/"],"year":2003,"topics":["PE English","P Philology. Linguistics"],"subject":["Article","PeerReviewed"],"fullText":"The effect of cultural background 1\n \n Name of Dept\/ School  \n \nEnglish \nCELS \n \nAuthor (Year) Title. Journal, Volume, Pages \n or \nAuthor (Year) Title, City, Publisher. \nLittlemore, J. (2003) The effect of \ncultural background on metaphor \ninterpretation. Metaphor and symbol, \n18(4), p.273-288. \nVersion : pre print\/post print\/other \nPost-print \nDate :  \n2003 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nThe effect of cultural background 2\n \nCULTURAL BACKGROUND \n \n \n \n \n \n \n \n \n \nThe Effect of Cultural Background on Metaphor Interpretation  \n \nJeannette Littlemore \nUniversity of Birmingham, U.K. \n \n \nThe effect of cultural background 3\nAbstract \nThis article describes a study that investigated the ways in which Bangladeshi students \ninterpreted metaphors used by their lecturers during a short course at a British university. \nThe students were asked to interpret a number of metaphors presented in context. They \nwere also asked to identify the value judgements that were being expressed through these \nmetaphors in these particular contexts. Culture-specific assumptions about the target \ndomains appeared to affect the students’ recognition of the lecturers’ attitudes to the \nissues they were discussing. In order to identify areas of disparity between the (working) \ncultures of the Bangladeshi students and their British lecturers, Hofstede’s (1980) cultural \nvalues questionnaire was administered. The students were found to be more likely than \ntheir lecturers to favour uncertainty avoidance, and to favour high power distance at \nwork. The kinds of (mis)interpretations that the students made of (the evaluative content \nof) the metaphors appeared in accordance with these cultural differences. Implications of \nthese findings are discussed.\n \nThe effect of cultural background 4\n \nThe Effect of Cultural Background on Metaphor Interpretation \nMetaphors have been shown to be a stumbling block for overseas students when trying to \nfollow lectures at university. An inability to understand the metaphors used by lecturers \ncan lead students to misinterpret not only the information conveyed in the lecture, but \nalso the attitude of the lecturer towards the information that he or she is presenting \n(Littlemore, 2001).  \nOne reason why students tend to misinterpret metaphors may be that they use \ndifferent cultural references when attempting to interpret them. It has been argued \nelsewhere in this issue (Deignan, Charteris-Black) that metaphors are typically culturally-\nloaded expressions, whose meaning has to be inferred through reference to shared \ncultural knowledge. Naturally, there is variability in the extent to which people from \ndifferent cultural backgrounds share cultural knowledge (D’Andrade, 1987), and people’s \nability to understand metaphors is likely to reflect this variability. Confusion is \nparticularly likely to arise when, for cultural reasons, the speaker and listener attach \ndifferent connotations to the source domains (e.g., Trompenaars, 1993). A student’s \ncultural background is also likely to affect the ways in which he or she is able to use clues \nin the surrounding context to help interpret metaphors. Students are perhaps more likely \nto notice clues that correspond to their cultural expectations than ones that do not. \nIn this article, I describe a small, exploratory study that investigated the ability of \nnon-native speaker students to use the surrounding context to interpret a number of \nmetaphors that were used by their lecturers, and to work out the lecturers’ attitude \ntowards the subjects being discussed. It attempted to relate students’ interpretations of \n \nThe effect of cultural background 5\nlecturers’ metaphors to an established framework of variation in cross-cultural values \n(Hofstede, 1980). As this framework deals with values within in the workplace, it was \nfelt to be particularly appropriate for this study, as all of the students, and many of the \nlecturers were employed as civil servants in their respective countries. Furthermore, the \ncontent of the lectures was largely related to the field of work and management. \nMethod \nParticipants \nThe participants in the study (henceforth referred to as “the students”) were eighteen \nBangladeshi Civil Servants attending a six-week course in public service administration \nat the University of Birmingham, and seven of the lecturers who taught on the course. \nThe students’ level of English was high (IELTS 6 or above), however, their scores on the \nlistening component of IELTS were significantly lower than their scores on the other \nparts of the test. The students were all seconded from the Bangladeshi Civil Service.  \nThe aims of the course were to discuss the strengths and weaknesses of the British \nCivil Service, with a view to promoting change and modernization within the \nBangladeshi Civil Service. The lectures were given by both staff from the International \nDevelopment Department and by practising civil servants. It was predicted that the \nlecturers would have certain sets of values which might, at times, conflict with those held \nby the students. It was hypothesised that these conflicting values may lead the students to \nmiss clues in the context, and to misinterpret the lecturers’ metaphors, and the opinions \nthat they were being used to convey.  \nIn order to identify potential differences in the students’ and lecturers’ value \nsystems, Hofstede’s (1980) four-dimensional values framework was applied. The four \n \nThe effect of cultural background 6\ndimensions of variability in this framework are uncertainty avoidance, power distance, \nindividualism versus collectivism, and ego versus social orientation. Although other \ndimensions have since been added to this list, these remain four of the most important \nways in which cultures are thought to differ from one another. Hofstede included Great \nBritain in his analysis, but not Bangladesh. However, by using relevant information \nconcerning the structure of Bengali society and the Bangladesh Civil Service, it was \npossible to draw hypotheses about possible areas of conflict between the two cultures. \nUncertainty avoidance refers to the extent to which organisations and cultures \n(and the people within them) seek to protect themselves from the risks and uncertainties \nof life. As with all of Hofstede’s value dimensions, it is thought to operate as a \ncontinuum. The descriptions that follow are of cultures that sit at either end of the \ncontinuum, and may thus appear somewhat extreme. People from weak uncertainty \navoidance organisations and cultures tend to take uncertainty to be a normal feature of \nlife, accepting each day as it comes; try to minimise general rules; do not like \nstandardisation; tolerate differences in behaviours and styles; and do not like precise \nspecifications. People from strong uncertainty avoidance organisations and cultures tend \nto see uncertainty as a threat which should be fought; consider standardisation desirable; \ndo not have much tolerance for very great differences in behaviours and styles; and are \nhappy with precise specifications. According to Hofstede (1980: 122), Britain ranks quite \nlow down on the uncertainty avoidance index, implying that British people, in general, \nare relatively comfortable with uncertainty. The fact that the Bengali Civil Service has a \nrigid structure combined with the fact that members of Bengali society traditionally have \n \nThe effect of cultural background 7\nclear cut social roles (White, 1992) suggested that the Bangladeshi students would be \nmore likely to avoid uncertainty than their British lecturers. \nPower distance refers to how equal people are, or would like to be. In \norganisations and cultures where the power distance is low, inequalities are minimised; \neverybody is involved in decision making; subordinates are consulted rather than just \nordered; the boss is seen as a resourceful democrat; and the same rules apply to everyone. \nIn organisations and cultures where the power distance is high, inequalities among people \nare expected and accepted; some people make decisions, and others obey; subordinates \nexpect to be told what to do; the boss is seen as a father figure; and certain rules apply \nonly to bosses, whereas others only to subordinates. According to Hofstede (1980: 79), \nBritain is a comparatively low power-distance society. The rigid hierarchical nature of \nBengali society, and of its Civil Service (Kramsjo & Wood, 1992; McGregor, 1991) \nsuggested that the Bangladeshi students would be more inclined towards a high power \ndistance than their British lecturers. \nThe individualist\/collectivist dimension refers to the extent to which people see \nthemselves primarily as individuals, or as members of bigger groups. In individualist \norganisations and cultures, people look after themselves; they want to be appreciated as \nindividuals, and for the work that they themselves have done; they are motivated by a \nfeeling of personal accomplishment; the employer-employee relationship is a contract \nbased on mutual advantage; and people are expected to speak their minds. In collectivist \norganisations and cultures, people need to be associated with a group and the work that \nthe group does; the employer-employee relationship is perceived in moral terms; \nharmony is valued; and direct confrontation avoided. According to Hofstede (1980: 167), \n \nThe effect of cultural background 8\nBritish society is fairly individualistic. Bengali society (including the Civil Service) has \ntraditionally relied on a system of networks and personal contacts (Lewis, Wood & \nGregory, 1996), implying a more collectivist system. On the other hand, more recent \nresearch has shown that there is an increasing trend towards individualism amongst the \nmiddle classes of Bangladeshi society (see Wood, 1999). As the students were all \nmembers of the middle classes or above, it was difficult to draw hypotheses for this \ndimension. \n The ego\/social dimension refers to the extent to which an organisation promotes \nhard “ego-oriented” values or soft “society-oriented” values. Members of society-\noriented organisations and cultures tend to value modesty and caring for others; they \nstress quality of life; they have a tendency to “undersell” themselves by maintaining a \nlow profile; they consider people and warm relationships to be of primary importance; \nand they try to resolve conflicts through compromise and negotiation. Members of ego-\noriented organisations and cultures value assertiveness and competition; they stress \nachievement and decisiveness; they have a tendency to “oversell” themselves by \nmaintaining a high profile; they consider money and things to be very important; and they \nresolve conflicts by fighting them out. According to Hofstede (1980: 189), Britain tends \nto be a relatively ego-oriented culture. In Bengali society, family concerns traditionally \ntake priority over professional and public concerns (Bertocci, 1972; Wood, 1988). This \nsuggested that the Bangladeshi students might have a more society-oriented outlook than \ntheir British lecturers. \n \nThe effect of cultural background 9\nEach of the participants was asked to complete a version of Hofstede’s (1980) \n“values survey” questionnaire, which can be found in Appendix 1. This questionnaire is \nrecommended by Hofstede for purposes of cross-cultural comparison.  \nA Mann-Whitney Test U was used to compare the students’ responses to those of \nthe lecturers. Two significant differences were found. Firstly, the students were found to \nbe significantly more likely to favour uncertainty avoidance than the lecturers (students’ \nmean rank: 20.1; lecturers’ mean rank: 9.75, p < 0.01). Secondly, the students were \nsignificantly more likely than the lecturers to favour high power distance (students’ mean \nrank: 13.6; lecturers’ mean rank: 6.4, p < 0.05). As for the remaining two dimensions, the \nlecturers seemed to have a slightly more collectivist outlook than the students (students’ \nmean rank: 11.4; lecturers’ mean rank: 14), and the students exhibited a slightly more \n“society-oriented” outlook than the lecturers (students’ mean rank: 12.7; lecturers’ mean \nrank: 9.5). However, neither of these differences was statistically significant. \nMetaphor interpretation task \nIn the metaphor interpretation task (which can be found in Appendix 2), the participants \nwere shown seven metaphors in context. They were then asked to explain the meaning of \neach metaphor, to state what opinion the lecturer held on the subject, and to give their \nown opinion on the subject.  \nThe metaphors selected for this task had all been used in spontaneous speech by \nthe lecturers at some point on the course. In order to collect them, I attended and made \naudio recordings of fifteen hours of lectures. At this point, the lecturers were unaware of \nthe nature of the experiment. I noted instances of metaphor use, particularly when they \nappeared to be culturally loaded, and conveyed an opinion. Seven metaphors were then \n \nThe effect of cultural background 10\nchosen for the metaphor analysis task; all of which were thought to express one of \nHofstede’s value dimensions. The metaphors used in the task, and the value dimensions \nthat they were thought to represent, are presented in Table 1. The relationships between \nthe metaphors and the value dimensions are discussed below. \nINSERT TABLE 1 HERE \nThe metaphorical expressions “freeing up external trade” (extract 2) and “it doesn’t \nmatter if the cat is black or white, as long as it catches mice” (extract 7) were chosen for \nstudy as they were thought to reflect an underlying belief that uncertainty is a good thing. \nAs the students had been shown by the Hofstede questionnaire to be significantly more \nlikely to favour uncertainty avoidance than their lecturers, it was hypothesised that they \nmight miss the full evaluative content of the messages being conveyed through these \nmetaphors. \nThe metaphorical expressions “top-down, bottom-up forms of assessment” and \n“trickle down economics” were chosen as they were thought to imply a system of \nhierarchy. The fact that both of these notions were being criticized by the lecturers (see \nextracts 4 and 6 in Appendix 2) was thought to have been, in part, a reflection of the fact \nthat steep hierarchies tend to be viewed negatively in Britain. As the students had been \nshown by the Hofstede questionnaire to be significantly more likely to tolerate hierarchy \nthan their lecturers, it was again hypothesised that they might miss the full evaluative \ncontent of the messages being conveyed.  \nThe metaphorical expression “to slowly shift the creaking apparatus of public \nadministration” (see extract 5) was thought, in this context, to reflect a collectivist \n \nThe effect of cultural background 11\noutlook on the part of the lecturer. The lecturer appears to view the Civil Service as a \nsingle entity.  \nThe metaphorical expressions “cut back the machinery of Government” (extract 1) \nand “we’ll let the British economy live or die by the forces of international competition” \n(extract 3) were both chosen as they were thought to reflect a somewhat hard, ego-\noriented view of society and of the Civil Service.  \nThe students were given the metaphor analysis task in class at the beginning of \nthe third week of the course. This meant that they had heard all seven metaphors, used in \ncontext by their lecturers, at some point during the previous two weeks. They each \nworked individually, and the task took between forty-five minutes and one hour. \nDiscussions were held with the lecturers participating in the experiment in order \nto verify the opinions expressed in the extracts. The students’ interpretations were then \nchecked by myself and by a lecturer from the International Development Department. \nInterpretations were only considered to be “wrong” if both judges felt this to be the case.   \nResults and Discussion \nThe students’ metaphor interpretations appeared to reflect value differences to varying \nextents. Metaphors that tended to be misinterpreted by the students were the ones that \nwere thought to reflect uncertainty avoidance and power-distance. The metaphors that \nwere thought to reflect the individualist\/collectivist and the ego-oriented\/society-oriented \ndimensions did not appear to cause comprehension problems. The extent to which each of \nthe metaphors was misinterpreted is shown in Table 2. \nINSERT TABLE 2 HERE \n \nThe effect of cultural background 12\nAs we saw above, the metaphors thought to be associated with uncertainty avoidance \nwere “freeing up external trade” and “it doesn’t matter if the cat is black or white, as \nlong as it catches mice”. Interestingly, both of these metaphors appeared to be \nmisinterpreted by at least some of the students. Seven of the eighteen students failed to \nmention the positive evaluation contained within the expression “freeing up external \ntrade”. When asked what the lecturer thought of the idea, typical responses were “not \nvery clear” or “the lecturer seems to be neutral”. This is interesting given that one would \nexpect the “GOOD IS UP” metaphor to be universal. Their responses suggest that they \nfound no clues in the surrounding context to indicate that the freeing up of trade may be a \ngood thing. One reason for this may have been that they were less likely than native \nspeakers to have been exposed to recent political rhetoric, in which liberalisation is hailed \nas a panacea for ailing economies. They may therefore have been less likely to expect to \nhear such an idea being espoused. There is a small possibility that their failure to identify \nthe lecturer’s positive viewpoint was due to even more deep-seated cultural reasons. In \norder to view the freeing up of trade as a good thing, one needs to tolerate a certain \namount of uncertainty in the economy. The fact that the students were from a culture that \ndoes not tend to tolerate uncertainty may have affected the way in which they interpreted \nthe expression. \n The expression “it doesn’t matter if the cat is black or white, as long as it catches \nmice” appeared to be misinterpreted by the majority of the students (15). Typical \nresponses were: “good Government is necessary”, “working Government is good” \n“policy should be workable”, and “Government should work properly”. Almost none of \nthe students mentioned the fact that a pragmatic approach might be desirable. Again, this \n \nThe effect of cultural background 13\ncould reflect the fact that they came from a value-system in which uncertainty tends to be \navoided. In order to fully understand the metaphor, one needs to accept that politicians \nmay not have total control over their policy-making, and may, at times, have to \ncompromise. This view of policy-making may be unfamiliar to students coming from a \nsociety in which policy-makers have high levels of control, and do not tolerate \nuncertainty.  \nThe metaphors that were thought to be related to the power-distance dimension \nwere “we have these top-down, bottom-up forms of assessment” and “trickle down \neconomics”. All of the students understood the term “top-down, bottom-up forms of \nassessment” to mean that assessment took place in two directions. However, despite clues \nin the context (“we’re stuck between many difficult dilemmas”, “a lot of ethical \nproblems”), only two of the students mentioned the fact that the lecturer perceived this \ntype of assessment to be potentially problematic. This may have been due to cultural \ndifferences as the students may have looked more favourably on high power-distance \norganisations (as was indicated by their responses to the Hofstede questionnaire). \nAlthough the students appeared to have no problems accessing the relevant underlying \nmetaphor (for example, that “hierarchy is a steep ladder or mountain”), their evaluation \nof the situation was more positive than that of the lecturer and of the native speaker \njudges. Post-test discussion with the students revealed that there is no “bottom-up” \nassessment within their organisation, and that they had not fully grasped the concept \nduring the lecture. This again, could be related to value differences between the two \ncultures. Although they had understood the expression, they had missed its evaluative \nmessage. \n \nThe effect of cultural background 14\nThe metaphor “trickle-down economics” (extract 4) caused fewer problems. This \nmight be attributable to the fact that the metaphor fits well into a high-power distance \nvalue system in which wealth is accrued at the top and takes a long time to get to the \nbottom. Nevertheless, three of the students claimed that the lecturer had a “very positive” \nattitude towards this situation. This is in contrast with the views of the native speaker \njudges and the lecturer herself, who all rated the evaluative content as neutral to negative. \nAgain, this discrepancy between the students and the native speakers may be attributable \nto the fact that the students came from a society which looks more favourably on high \npower-distance, and in which wealth is expected to trickle slowly from top to the bottom.  \nThe expression that was thought to reflect the individualist\/collectivist dimension, \n“to slowly shift the creaking apparatus of public administration” (extract 5) did not \nappear to cause problems. All of the students picked up on the underlying metaphor of \npublic administration as a large machine that has to work as one. This finding is in \nkeeping with the fact that the differences found between the students and their lecturers \non this dimension were statistically insignificant.  \nThe metaphors that were thought to reflect the ego-oriented\/society-oriented \ndimension were “cut back the machinery of Government” (extract 1) and “we’ll let the \nBritish economy live or die by the forces of international competition” (extract 3). Neither \nof the metaphors caused the students any problems. In extract 1, they were all able to \ngrasp the idea that the public sector needed to be reduced or “downsized” as many of \nthem put it, and many of them felt that withdrawing subsidies would make British \nbusinesses stronger. Equally, in extract 3, there was agreement between the native \nspeaker judges, the lecturer, and the students, that the lecturer’s opinion was neutral to \n \nThe effect of cultural background 15\nnegative. One reason for their success in interpreting these metaphors might be the fact \nthat the difference between the lecturers and the students for this value dimension was \nstatistically insignificant. On the other hand, their success in understanding these \nexpressions may have been due to the fact that there were some very clear clues in the \nsurrounding contexts. In extract 1, the lecturer spells out his view very clearly: “it’s not \ngood enough to … it’s also important to…”. Equally, in extract 3, the message is quite \nclearly negative (“and actually quite a lot of it died”). \nWhile we have to acknowledge the complex interplay with other variables (such \nthe availability and the quality of contextual clues), the overall results of the experiment \ndo suggest that the metaphors reflecting the dimensions for which Hofstede’s \nquestionnaire revealed cultural differences were most likely to cause comprehension \nproblems. \nConclusions \nThe findings of this study suggest that students were most likely to interpret the \nmetaphors in ways that supported, rather than contradicted their own value systems. \nFurthermore, even when they understood the objective content of the metaphors, the \nstudents appeared to interpret their evaluative function in terms of their own value \nsystem, rather than that of the lecturer. They were less likely to mention the evaluative \nfunctions of metaphors when these evaluations reflected value systems very different \nfrom their own. On the other hand, where the clues in the context were very clear, this \nseemed to help counteract potential problems caused by cross-cultural differences. \nProblems only seemed to arise when the clues in the context were less than clear and \nwhen they reflected conflicting value systems.  \n \nThe effect of cultural background 16\nThis implies that, in order to truly appreciate what their lecturers are trying to say, \nand to respond critically, students must be able to analyse their own value system, and the \nmetaphors that these value systems generate. This should enable them to develop a level \nof cultural competence necessary for them to understand both the subject matter of the \nlectures, and the lecturers’ attitudes towards this subject matter. However, this is a lot to \nask of them. As well as all the other difficulties that they face when following lectures \n(e.g., Flowerdew 1994), students must also be expected to reflect on their own value \nsystems, as well as those of their lecturers, and to make sure that that they have fully \nunderstood the views of their lecturers. This is a difficult task, and students are likely to \nneed support from their lecturers. It is important that lecturers realise that students \ncoming from different cultures are likely to hold different sets of values, and that they \nmay interpret the content of the lecture according to their own value systems. Lecturing \nstyles should therefore be adapted accordingly. As we have seen above, the presence of \nclues in the surrounding context can be a useful aid to students who are trying to interpret \ndifficult metaphors. This suggests that lecturers who wish to convey their own opinions \nthrough metaphor should also attempt to provide such clues. On the other hand, the \nlanguage used by lecturers tends to be spontaneous, and it is not always easy to maintain \nsuch a level of awareness of one’s own language. An alternative approach to the problem \nmight be for lecturers to adopt a style in which discussion and debate replace the more \nconventional “chalk and talk” style lecturing, where cultural misunderstandings are likely \nto go unnoticed. In this type of teaching, students might be more likely to ask for \nclarification where necessary. Lecturers might also find it useful to discuss with their \noverseas students the metaphors that are commonly used within their discipline (for \n \nThe effect of cultural background 17\nexample, a fairly comprehensive list of metaphors that are commonly used in \nManagement Science can be found in Morgan, 1997). Together with their students, they \ncould explore the cultural values and assumptions that lie behind these different \nmetaphors, and identify areas where their own values differ from those of their students. \nThis approach might put both lecturers and students in a better position to critically \nevaluate the ideas that they are discussing. \n  Having said this, it is necessary to make a number of caveats. The study \ndescribed in this article is relatively small in scope, as it only looks at seven metaphors, \nfour value dimensions, and a limited number of students. Furthermore, some of the \nmetaphors, and their surrounding contexts may have been “intrinsically” less transparent \nthan others, and variation in students’ scores may to some extent have been due to this, \nrather than to cross-cultural differences. A larger study is necessary in order to investigate \nwhether its findings can be confirmed. More work in the area will help to further \nunderstand the ways in which metaphors are understood, or indeed misunderstood, by \npeople from different cultures. \n \nThe effect of cultural background 18\n \nReferences \nBertocci, P. (1972). Community structure and social rank in two villages in Bangladesh. \n  Contributions to Indian Society, New Series VI, 28-52. \nD’Andrade, R. (1987). A folk model of the mind. In D. Holland & N. Quinn (Eds.) \nCultural Models in Language and Thought (pp. 112-148). Cambridge: Cambridge \nUniversity Press. \nFlowerdew, J. (1994). (Ed.) Academic Listening: Research Perspectives. Cambridge: \n  Cambridge University Press. \nHofstede, G. (1980). Culture’s Consequences. International Differences in Work-Related \n  Values. London: Sage Publications. \nKramsjo, B & Wood, G. (1992). Breaking the Chains. London: IT Publications. \nLewis, D., Wood, G. & Gregory, R. (1996). Trading the Silver Seed: Local Knowledge \nand Moralities in Aquacultural Society. London: IT Publications & Dhaka: \nUniversity Press Ltd. \nLittlemore, J. (2001). The use of metaphor in university lectures and the problems that it \n  causes for overseas students. Teaching in Higher Education, 6 (3), 333-351. \nMcClaren, M. (1998). Interpreting Cultural Differences. The Challenge of International \n  Communication. Dereham: Peter Francis Publishers. \nMcGregor, J.A. (1991). Poverty and patronage: A study of credit, development and \n  change in rural Bangladesh. Unpublished PhD Thesis, University of Bath. \nMorgan, G. (1997). Images of Organization. London: Sage Publications. \nTrompenaars, F. (1993). Riding the Waves of Culture. Understanding Cultural Diversity \n \nThe effect of cultural background 19\nin Business. London: Nicholas Brealey Publishing. \nWhite, S. (1992). Arguing with the Crocodile. London: Zed Press. \nWood, G. (1988). Plunder without danger: Avoiding responsibility in rural works \n  administration in Bangladesh. IDS Bulletin, 19 (4), 57-63. \nWood, G. (1999). Prisoners and escapees: Towards political and administrative \nimprovement. Paper presented at the UK-DSA Conference, University of Bath. \n \n \nThe effect of cultural background 20\nAppendix 1: Hofstede’s (1980) “Values Survey” \nPlease think of an ideal job. In choosing an ideal job, how important would it be to you to (please circle one \nanswer number in each line across): \n \n Of utmost \nimportance \nVery \nimportant \nOf moderate \nimportance \nOf little \nimportance \nOf very little \nimportance \n1. Have sufficient time left \nfor your personal or family \nlife? \n1 2 3 4 5 \n2. Have challenging tasks to \ndo, from which you can get \na personal sense of \naccomplishment? \n1 2 3 4 5 \n3. Have little tension and \nstress on the job? \n1 2 3 4 5 \n4. Have good physical \nworking conditions (good \nventilation and lighting, \nadequate work space etc.)? \n1 2 3 4 5 \n5. Have a good working \nrelationship with your direct \nsuperior? \n1 2 3 4 5 \n6. Have security of \nemployment? \n1 2 3 4 5 \n7. Have considerable \nfreedom to adopt your own \napproach to the job? \n1 2 3 4 5 \n8. Work with people who \ncooperate well with one \nanother? \n1 2 3 4 5 \n9. Be consulted by your \ndirect superior in his\/her \ndecisions? \n1 2 3 4 5 \n10. Make a real contribution \nto the success of your \norganisation? \n1 2 3 4 5 \n11. Have an opportunity for \nhigh earnings? \n1 2 3 4 5 \n12. Serve your country? 1 2 3 4 5 \n13. Live in an area desirable \nto you and your family? \n1 2 3 4 5 \n14. Have an opportunity for \nadvancement to higher level \njobs? \n1 2 3 4 5 \n15. Have an element of \nvariety and adventure in the \njob? \n1 2 3 4 5 \n16. Work in a prestigious, \nsuccessful organisation? \n1 2 3 4 5 \n17. Have an opportunity for \nhelping other people? \n1 2 3 4 5 \n18. Work in a well-defined \njob situation where the \nrequirements are clear? \n1 2 3 4 5 \n \n \n \n \n \n \nThe effect of cultural background 21\nThe descriptions below apply to four different types of managers. First, please read through these \ndescriptions: \n \nManager 1 Usually makes his\/her decisions promptly and communicates them to his\/her subordinates \nclearly and firmly. Expects them to carry out the decisions loyally and without raising \ndifficulties. \nManager 2 Usually makes his\/her decisions promptly, but, before going ahead, tries to explain them fully \nto his\/her subordinates. Gives them reasons for the decisions and answers whatever questions \nthey may have. \nManager 3 Usually consults with his\/her subordinates before he\/she reaches his\/her decision. He\/she \nthen expects all to work loyally to implement it whether or not it is in accordance with the \nadvice they gave. \nManager 4 Usually calls a meeting of his\/her subordinates when there is an important decision to be \nmade. Puts the problem before the group and invites discussion. Accepts the majority \nviewpoint as the decision. \n \n19. Now, for the above types of manager, please mark the one which you would prefer to work under \n(circle one number only): \n1. Manager 1 \n2. Manager 2 \n3. Manager 3 \n4. Manager 4 \n \n20. And, to which one of the above four types of managers would you say your own superior most closely \ncorresponds? \n1. Manager 1 \n2. Manager 2 \n3. Manager 3 \n4. Manager 4 \n \n21. How often do you feel nervous or tense at work? \n1. I always feel this way \n2. Usually \n3. Sometimes \n4. Seldom \n5. I never feel this way \n \nPlease indicate your degree of agreement or disagreement with the following statements: \n \n Strongly \nagree \nAgree Undecided Disagree Disagree \nstrongly \n22. A company or organisation’s rules \nshould not be broken – even when the \nemployee thinks it is in the \norganisation’s best interests \n1 2 3 4 5 \n23. Most people can be trusted 1 2 3 4 5 \n24. I hope to continue working for this \norganisation for the rest of my working \nlife \n1 2 3 4 5 \n \nThe four value dimensions and their corresponding items: \nUncertainty avoidance was assessed by items 3*, 6*, 15, 18*, 22* and 24*. \nPower-distance was assessed by items 7, 8, 9, 19*, 20* and 21*. \nThe individualist\/collectivist dimension was assessed by items 2, 10*, 11, 12*, 14 and 17*. \nThe ego-oriented\/society-oriented dimension was assessed by items 1*, 4*, 5*, 13*, 16 and 23*.  \n* indicates a reversed item. \n \nThe effect of cultural background 22\nAppendix 2 \n“Managing At The Top”: Lecture Extracts \n \nName: ______________________________ \n \nExtract 1  \nReducing the size of the public sector is crucial. It may be by privatising, it may be by cutting jobs. It’s not \ngood enough just to do that. It’s not good enough just to cut the machinery of Government back. It’s also \nimportant to make it more efficient, and that’s what I’m coming to.  \n \nMeaning of underlined part: \n \nWhat does the lecturer think about it? \n \nWhat do you think about it? \n \n \nExtract 2 \nThe main element of structural adjustment is the liberalisation of external trade. You know what I mean by \nthat? Dropping tariff barriers. Freeing up external trade, stopping any prohibitions on imports. The second, \nrelated to that, is the elimination of exchange rate controls. This is an important part of the IMF’s policy, \nstopping Governments interfering with the value of currencies. In the old days Governments used to fix the \nexchange rate didn’t they? Now it’s been freed up hasn’t it? It’s all part of liberalisation.  \n \nMeaning of underlined part: \n \nWhat does the lecturer think about it? \n \nWhat do you think about it? \n \n \nExtract 3 \nMrs. Thatcher’s view was: “It may hurt for a while, this medicine, but what we’ll do is take off the \ncontrols. We’ll take the controls from the flow of capital, we’ll let the British economy live or die by the \nforces of international competition”, and actually quite a lot of it died.  \n \nMeaning of underlined part: \n \nWhat does the lecturer think about it? \n \nWhat do you think about it? \n \n \nExtract 4 \nI don’t know if you’ve come across the phrase “trickle down economics”. The idea being of course that you \nmake the poor richer by making the rich richer. And the wealth of the rich will trickle down to the poor and \njobs will be created. And it takes a long time for that to happen. And we concluded as a nation that we \ncouldn’t wait for that to happen.  \n \nMeaning of underlined part: \n \nWhat does the lecturer think about it? \n \nWhat do you think about it? \n \n \nThe effect of cultural background 23\n \nExtract 5 \nBlair’s Government has attempted to slowly shift the creaking apparatus of public administration, and to \nchange it round from what it had become, to enable it to become capable of solving problems and achieving \nbroad social outcomes like reduced crime and better standards of education.  \n \nMeaning of underlined part: \n \nWhat does the lecturer think about it? \n \nWhat do you think about it? \n \n \nExtract 6 \nNow let’s consider something that occurs now and again. On things like reports being sent in. What \nhappens if a colleague fails to deliver well? How to bring that sort of an issue to light in an organisation \nlike this? You see, if we were in a business we’d probably take rough action. But we are a team. We’re \nprofessionals together. We’re stuck between many different dilemmas you see. We have these top-down, \nbottom-up forms of assessment. Being in a business and a university creates a lot of ethical problems.  \n \nMeaning of underlined part: \n \nWhat does the lecturer think about it? \n \nWhat do you think about it? \n \n \n \nExtract 7 \nSince then he has come along with another lot of catchphrases, for example “policy liberalisation”. It \ndoesn’t matter if the cat is black or white, as long as it catches mice.  \n \nMeaning of underlined part: \n \nWhat does the lecturer think about it? \n \nWhat do you think about it? \n \n \n \nThe effect of cultural background 24\nTable 1: Selected metaphors and the value dimensions they were used to express \nValue dimension Metaphorical expressions \nUncertainty avoidance “Freeing up external trade” \n“It doesn’t matter if the cat is black or \nwhite, as long as it catches mice” \nPower distance “Top-down, bottom-up forms of \nassessment” \n“Trickle down economics” \nIndividualism versus collectivism “To slowly shift the creaking apparatus of \npublic administration” \nEgo\/social orientation \n \n“Cut back the machinery of Government” \n“We’ll let the British economy live or die \nby the forces of international competition”. \n \n \nThe effect of cultural background 25\nTable 2: Extent of metaphor (mis)interpretations \nMetaphor Associated value \ndimension \nDifference between \ncultures in terms of \nthis value dimension \nExtent of \nmisinterpretation \n“Freeing up external \ntrade” \nUncertainty \navoidance \nBangladeshis more \nlikely to avoid \nuncertainty (p<0.01) \nSeven students \nappeared to \nmisinterpret \nevaluative \ncomponent \n“It doesn’t matter if \nthe cat is black or \nwhite, as long as it \ncatches mice” \nUncertainty \navoidance \nBangladeshis more \nlikely to avoid \nuncertainty (p<0.01) \nFifteen students \nappeared to \nmisinterpret both \nmeaning and \nevaluative \ncomponent \n“We have these top-\ndown, bottom-up \nforms of assessment” \nPower distance Bangladeshis more \nlikely to prefer high \npower distance \n(p<0.05) \nSixteen students \nappeared to \nmisinterpret \nevaluative \ncomponent \n“Trickle down \neconomics” \nPower distance Bangladeshis more \nlikely to prefer high \npower distance \n(p<0.05) \nThree students \nappeared to \nmisinterpret \nevaluative \ncomponent \n“To slowly shift the \ncreaking apparatus \nof public \nadministration” \nIndividualism versus \ncollectivism \nDifference not \nstatistically \nsignificant \nAll students \nunderstood both \nmeaning and \nevaluative \ncomponent \n“Cut back the \nmachinery of \nGovernment” \nEgo\/social \n \nDifference not \nstatistically \nsignificant \nAll students \nunderstood both \nmeaning and \nevaluative \ncomponent \n“We’ll let the British \neconomy live or die \nby the forces of \ninternational \ncompetition” \nEgo\/social \n \nDifference not \nstatistically \nsignificant \nAll students \nunderstood both \nmeaning and \nevaluative \ncomponent \n \n \n \n"}