{"doi":"10.1179\/174327509X434957","coreId":"59613","oai":"oai:nora.nerc.ac.uk:8107","identifiers":["oai:nora.nerc.ac.uk:8107","10.1179\/174327509X434957"],"title":"Chromite and PGE in the Logar Ophiolite Complex, Afghanistan","authors":["Benham, A.J.","Kovac, P","Petterson, M.G.","Rojkovic, I","Styles, M.T.","Gunn, A.G.","McKervey, J.A.","Wasy, A."],"enrichments":{"references":[],"documentType":{"type":0.7777777778}},"contributors":[],"datePublished":"2009-06-01","abstract":"The Logar Ophiolite Complex (LOC) is located 30 km south of Kabul, Afghanistan, and extends over approximately 2000 km2. It comprises a lower lherzolitic-dunitic-harzburgitic-gabbro ultramafic-mafic unit that passes upwards into a dolerite dyke complex, basaltic pillow lavas and an uppermost sequence of volcaniclastic- and terrigenous-dominated sedimentary units. The ophiolite represents an obducted remnant of intra-Tethyan basin oceanic crust, thrust onto a platform-style cover component of the Kabul Terrane during the Himalayan orogeny. Platinum group\\ud\nminerals have been detected for the first time in chromitites and ultramafic units from the LOC. Two distinct types of chromitites and ultramafic lithologies with different origins have also been identified in this study. The first type is a low Cr, PGE-poor chromitite interpreted to have been produced in a mid ocean ridge (MOR) environment. The second type is a high Cr, relatively\\ud\nPGE-rich dunite and peridotite from a boninitic magma produced in a supra-subduction zone (SSZ) setting. Platinum group element (PGE) abundances in these chromitites average 12 ppb and 26 ppb for PtzPdzRh for the dunite and peridotite. Chondrite-normalised PGE patterns have two distinct trends: (a) the MOR rocks have a positive Ru anomaly with a negative Pt anomaly and a generally negative slope; and (b) the SSZ rocks show weak positive Ru and Pt\\ud\nanomalies and a positive slope. It is concluded that the negative sloping pattern is typical of PGE in most ophiolites elsewhere. In contrast, the positively sloping pattern is more unusual and may indicate PGE remobilisation and enrichment","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/59613.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/8107\/1\/Chromite_%26_PGE_in_Logar_submitted_mergedv2.pdf","pdfHashValue":"c762f56e7d775196875972d9a4ace14b833b10e9","publisher":"Maney","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:8107<\/identifier><datestamp>\n      2012-11-22T12:04:19Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533130<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/8107\/<\/dc:relation><dc:title>\n        Chromite and PGE in the Logar Ophiolite Complex, Afghanistan<\/dc:title><dc:creator>\n        Benham, A.J.<\/dc:creator><dc:creator>\n        Kovac, P<\/dc:creator><dc:creator>\n        Petterson, M.G.<\/dc:creator><dc:creator>\n        Rojkovic, I<\/dc:creator><dc:creator>\n        Styles, M.T.<\/dc:creator><dc:creator>\n        Gunn, A.G.<\/dc:creator><dc:creator>\n        McKervey, J.A.<\/dc:creator><dc:creator>\n        Wasy, A.<\/dc:creator><dc:subject>\n        Earth Sciences<\/dc:subject><dc:description>\n        The Logar Ophiolite Complex (LOC) is located 30 km south of Kabul, Afghanistan, and extends over approximately 2000 km2. It comprises a lower lherzolitic-dunitic-harzburgitic-gabbro ultramafic-mafic unit that passes upwards into a dolerite dyke complex, basaltic pillow lavas and an uppermost sequence of volcaniclastic- and terrigenous-dominated sedimentary units. The ophiolite represents an obducted remnant of intra-Tethyan basin oceanic crust, thrust onto a platform-style cover component of the Kabul Terrane during the Himalayan orogeny. Platinum group\\ud\nminerals have been detected for the first time in chromitites and ultramafic units from the LOC. Two distinct types of chromitites and ultramafic lithologies with different origins have also been identified in this study. The first type is a low Cr, PGE-poor chromitite interpreted to have been produced in a mid ocean ridge (MOR) environment. The second type is a high Cr, relatively\\ud\nPGE-rich dunite and peridotite from a boninitic magma produced in a supra-subduction zone (SSZ) setting. Platinum group element (PGE) abundances in these chromitites average 12 ppb and 26 ppb for PtzPdzRh for the dunite and peridotite. Chondrite-normalised PGE patterns have two distinct trends: (a) the MOR rocks have a positive Ru anomaly with a negative Pt anomaly and a generally negative slope; and (b) the SSZ rocks show weak positive Ru and Pt\\ud\nanomalies and a positive slope. It is concluded that the negative sloping pattern is typical of PGE in most ophiolites elsewhere. In contrast, the positively sloping pattern is more unusual and may indicate PGE remobilisation and enrichment.<\/dc:description><dc:publisher>\n        Maney<\/dc:publisher><dc:date>\n        2009-06-01<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/8107\/1\/Chromite_%26_PGE_in_Logar_submitted_mergedv2.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Benham, A.J.; Kovac, P; Petterson, M.G.; Rojkovic, I; Styles, M.T.; Gunn, A.G.; McKervey, J.A.; Wasy, A..  2009  Chromite and PGE in the Logar Ophiolite Complex, Afghanistan.   Transactions of the Institution of Mining and Metallurgy Section B Applied Earth Science, 118 (2). 45-58.  https:\/\/doi.org\/10.1179\/174327509X434957 <https:\/\/doi.org\/10.1179\/174327509X434957>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.ingentaconnect.com\/content\/maney\/aes\/2009\/00000118\/00000002<\/dc:relation><dc:relation>\n        10.1179\/174327509X434957<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/8107\/","http:\/\/www.ingentaconnect.com\/content\/maney\/aes\/2009\/00000118\/00000002","10.1179\/174327509X434957"],"year":2009,"topics":["Earth Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":" 1 \nChromite and PGE in the Logar Ophiolite Complex, Afghanistan \n \nA. J. Benham\n1, P. Kováč2, M. G. Petterson1, I. Rojkovic3, M. T. Styles1, A. G. Gunn1, \nJ. A. McKervey\n1\n,\n \nA. Wasy\n4\n \n \n1\nBritish Geological Survey, Keyworth, Nottingham NG 12 5GG, UK, e-mail: \nabenham@bgs.ac.uk  \n2 \nGET Limited, Partizanska cesta 3, 974 01 Banska Bystrica, Slovakia \n3\n Geological Institute Slovak Academy of Sciences, Dúbravska cesta 9, 840 06 \nBratislava, Slovakia \n4\n Afghanistan Geological Survey, Kabul, Afghanistan \n \n \n \n \n the number of words of text – 5 264 \n the number of references – 52 \n the number of tables and figures –  figures 21  tables 3        \n \n \n \n \n \n \n \n an abbreviated title (< 40 characters)  \nChromite and PGE from Logar, Afghanistan \n 2 \nAbstract \nThe Logar Ophiolite Complex (LOC) is located 30 km south of Kabul, Afghanistan, \nand extends over approximately 2000 km\n2\n. It comprises a lower lherzolitic-dunitic-\nharzburgitic-gabbro ultramafic-mafic unit that passes upwards into a dolerite dyke \ncomplex, basaltic pillow lavas and an uppermost sequence of volcaniclastic- and \nterrigenous-dominated sedimentary units. The ophiolite represents an obducted \nremnant of intra-Tethyan basin oceanic crust, thrust onto a platform-style cover \ncomponent of the Kabul Terrane during the Himalayan orogeny. \n \nPlatinum-group minerals have been detected for the first time in chromitites and \nultramafic units from the LOC. Two distinct types of chromitites and ultramafic \nlithologies with different origins have also been identified in this study. The first type \nis a low Cr, PGE-poor chromitite interpreted to have been produced in a mid ocean \nridge (MOR) environment. The second type is a high Cr, relatively PGE-rich dunite \nand peridotite from a boninitic magma produced in a supra-subduction zone (SSZ) \nsetting. Platinum group element (PGE) abundances in these chromitites average 12 \nppb and 26 ppb for Pt+Pd+Rh for the dunite and peridotite. \n \nChondrite-normalised PGE patterns have two distinct trends: (1) The MOR rocks \nhave a positive Ru anomaly with a negative Pt anomaly and a generally negative \nslope; and (2) the SSZ rocks show weak positive Ru and Pt anomalies and a positive \nslope. It is concluded that the negative sloping pattern is typical of PGE in most \nophiolites elsewhere. In contrast, the positively sloping pattern is more unusual and \nmay indicate PGE remobilisation and enrichment. \n \n \n \n \n \n \n \n 3 \nIntroduction \nThe Logar Ophiolite Complex (LOC) is located about 30 km south of Kabul, \nAfghanistan (Figure 1). The ophiolite has an approximately ellipsoidal outcrop, \nelongated in a north-north-westerly direction. It covers an area of approximately 2000 \nkm\n2 \nand is about 65 km long by 45 km wide\n43\n. Chromite mineralisation has been \nknown from Logar Province for many years\n48, 41, 42\n but previous scientific \ninvestigations have mostly focussed on the formation and structure of the LOC\n29, 43\n. \nThis paper presents the first modern research into chromite and platinum-group \nelements (PGE) in Afghanistan since the withdrawal of Soviet troops in 1989. \nReview of geological research \nGeological setting of the Logar area \nAfghanistan has a long and complicated tectonic history, partly related to its position \nat the western end of the Himalaya mountain range. The country is composed of a \nseries of discrete tectonic crustal blocks separated by fault zones. The blocks accreted \nduring a series of tectonic events related to the closure of the Tethys Ocean and the \ncollision of Laurasia with Gondwanaland in Jurassic to early Cretaceous times. A \nsimplified tectonic map of Afghanistan illustrating the different terranes is shown in \nFigure 2.  \n \nThere are several major tectonic units in the Logar area: the basement of the Central \nAfghanistan Terrane, the platform-type cover sequence of the Kabul Terrane and the \nLogar Ophiolite Complex. The basement of the Central Afghanistan Terrane (the \nCentral Afghanistan Median Block according to previous studies\n18, 13, 30\n) is composed \nof the Early to Mid Proterozoic Sherdarwaza Formation, consisting of gneisses and \nschists regionally metamorphosed to amphibolite facies, and the Late Proterozoic \nWelayati Formation. The lower part of the Welayati Formation consists mainly of \namphibolites whilst the upper part comprises schists and amphibolites with layers of \nplagio-granites, quartzites and marbles. The total thickness of these units is believed \nto be 4 800 to 5 500 m\n18, 13\n. \n \n 4 \nThe platform-type cover sequence of the Kabul Terrane unconformably overlies the \nCentral Afghanistan Terrane and is represented by the Late Permian to Mid Jurassic \nChingil Formation. The Late Permian Chingil Formation comprises a basal sequence \nof quartz-mica schists, quartz sandstones and conglomerate overlain by approximately \n350 m of calcite marbles, coralline-crinoidal-, brachiopod- and fusulinid-bearing \ndolomite marbles. The Late Permian rocks pass gradationally into 40 - 50 m of Early \nTriassic lithologies comprising yellow-pinkish dolomite and calcite marbles, and \ndark-brown variegated shaley limestones. These are conformably overlain by 400 – \n500 m thick package of Mid Triassic dark-grey thickly bedded dolomite marbles. The \nMid Triassic units pass upwards into a 70 m thick sequence of Late Triassic dark-\ngrey, thickly-bedded calcite marbles, with thin intercalations of schists with \ngastropod- and pelecypod-rich, sandy limestones. Early Jurassic rocks of the Chingil \nFormation (200 – 250 m thick) comprise dolomite and limestone marbles, calcareous \nschists with rare intercalations of sandy, oolitic limestones. Mid Jurassic rocks consist \nof pale and dark coloured limestone marbles, with rare intercalations of carbonate \nschists, about 100 – 150 m thick.  \n \nThe Neogene Latabang Formation (400 - 500 m) overlies rocks of the Chingil \nFormation. It is composed of clay, marl, sandstone and conglomerate. It contains \nremnants of gastropods, plants and fish skeletons, which prove its Neogene age. \n \nThe LOC represents an obducted remnant of oceanic crust that was thrust over the \nKabul Terrane during the Himalayan orogeny. The ophiolite is bounded to the west by \nthe steeply dipping (60-70°), roughly north-south-trending, Pagman Fault, while the \nAltimur Fault occurs to the east and south-east. The Abparan Thrust separates the \nallochthonous ultramafic rocks from the autochthonous rocks of the Kabul Block to \nthe north (Figure 3). \n \nThe Logar Ophiolite Complex \nThe German geologist Wirtz first described the LOC in 1964\n49\n. Between 1964-1966 \n1:100 000 and 1:50 000 geological mapping of the Kabul Block, including the LOC, \nwas undertaken by the Department of Geology and Mines Survey of Afghanistan\n5\n. \nSince 1969 all geological mapping has been carried out by the Survey with technical \n 5 \nassistance from the USSR. Soviet and Afghan geologists undertook a series of surveys \nthroughout Afghanistan in the 1970s, including mineral exploration in the Kabul \ndistrict, which includes the Logar area\n15\n.  \n \nThe Federal Institute for Soil Research, the precursor to the German Geological \nSurvey, undertook further surface mapping of the ultramafic rocks in the Logar area, \ntogether with detailed chemical and mineralogical scientific studies\n42\n. Hafisi\n21\n also \ncarried out PhD research on the LOC providing additional geological, mineralogical \nand petrographic information on the ultramafic rock units of the ophiolite, but he \nappears not to have studied the chromite mineralisation. \n \nThe LOC is composed of several discrete litho-stratigraphical structural units and \nassociated volcano-sedimentary units. The lowest stratigraphic part of the LOC \nconsists of the Ultramafic Complex, which is overlain by a thin gabbro unit and then a \ndyke complex and a pillow lava complex (Figure 4). This is overlain by the volcano-\nsedimentary sequence of the Petau Formation, which is in turn overlain by the Mana \nFormation, representing a sequence of accretionary wedge sediments. \n \nThe Ultramafic Complex\n48, 5, 45, 13, 29, 30, 1\n is believed to be Early Cretaceous in age \nsince the lower, shallow water, volcano-sedimentary part of the underlying Petau \nFormation is dated Early Cretaceous and the upper part of the Petau Formation is Late \nCretaceous\n30\n. \n \nThe main part of the Ultramafic Complex comprises largely dunite and harzburgite, \nwith minor lherzolite, wehrlite, serpentinite and serpentinite breccia (Figure 4). The \nupper part of the complex comprises layered ultramafic to mafic rocks of which the \nuppermost part consists of melanocratic layered gabbro. The Ultramafic Complex is \nup to 2 800 m thick and hosts sporadic podiform chromite mineralization. A typical \nview of the Ultramafic Complex is seen in Figure 5. \n \nThe central part of the Ultramafic Complex sequence contains a dolerite dyke \ncomplex. Most of the dykes strike north-east and are steeply dipping (approximately \n70 - 80°), or sub vertical. The thickness of the dykes varies from 1 - 15 m and they \ncan be traced along strike up to 5 km. The dykes comprise dolerite, with minor \n 6 \nandesite-basalt, dolerite and gabbro-diorite or microgabbro. The age of the dyke \ncomplex is considered to be Early Cretaceous\n30\n. \n \nThe pillow lava complex, (Figure 4), comprises dark grey–green aphyric or \nporphyritic spilite to basaltic or andesitic pillow lavas with rare layers of volcanic \nbreccia, tuff, agglomerate tuff and breccia tuff. It is up to 1 700-1 800 m thick. There \nare also occasional layers and lenses of radiolarite, hyaloclastite and dark muddy \nlimestone. The age obtained by U-Pb dating from the andesitic basalt is 86 Ma\n30\n, \nwhich corresponds to the Late Cretaceous. The pillow lava complex was formed in a \ndeep ocean-floor environment and overlays layered gabbro-norite rocks of the upper \npart of the Ultramafic Complex. \nChromite mineralisation in the LOC \nPrevious work \nThe United States Bureau of Mines (USBM) first recognised chromite mineralisation \nin the Logar area in 1949-50\n48\n. This work identified ten outcropping chromite \ndeposits, numbered 1 to 10, occurring as massive lenses, pods and irregular-shaped \nbodies of dominantly massive chromitite. Subsequent work by the Federal Institute \nfor Soil Research\n41, 42\n, recognised 18 lenticular chromite bodies including some \npreviously identified by USBM.  \n \nThe chromite bodies occur in two principal groups approximately 9 km apart, with \nmost occurring on the west side of the Logar valley. All deposits are easily accessible \nfrom the tarred Kabul-Gardez road running alongside the Logar River (Figure 6). A \nnorthern cluster of deposits is located approximately 7 km north-west of the village of \nMuhammad Agha, while a southern cluster occurs to the south-west of Dewalak, \nabout 5 km south of Muhammad Agha. The chromite bodies occur predominantly \nwithin small dunite pods in harzburgite according to Siebdrat\n42\n. Kilometre-sized \nbodies of lherzolite and later cross-cutting orthopyroxenite dykes are also commonly \nassociated with outcrops of chromite. Although Hafisi\n21\n mapped much of the country \nrock of the northern chromite belt as dunite, new work from this study has identified \nharzburgite as well as dunite associated with chromite occurrences, which agrees with \nSiebdrat‟s original interpretation42. The observed association of rock types suggest \n 7 \nthis is the upper part of the mantle sequence close to the mantle transition zone \n(MTZ)\n23\n. \n \nLittle is reported to remain at surface for most of these deposits as most of the \nchromite has been quarried\n42\n. In general, the deposits are reported to have been \nrelatively small with dips between 32-45º towards the south-west. However, the \nlargest deposit, termed number 5 by the USBM\n48\n, comprised two lenses, one 97.5 m \nlong and up to 10 m wide, and the other 65 m long and up to 5 m wide. The margins \nof all the chromite bodies are sharp and highly irregular in form, whilst the immediate \nwallrocks are generally serpentinised and showed the development of a close-spaced \nplanar fabric \/ fracturing parallel to the contact with the chromitite. \n \nThe USBM also undertook trenching, sampling by shallow percussion drilling, and a \ndiamond-drilling programme in which 27 holes were drilled with an aggregate length \nof 975 m\n48\n. The diamond drilling tested three of the largest deposits at surface and \nalso a small high-grade deposit, all situated in the northern cluster of deposits. Volin\n48\n \nestimated a total „reserve‟ of 181 000 t, concentrated in three deposits (1, 2 and 5). Of \nthis about 15% (27 000 t) is high-grade metallurgical chromite with 55.9% Cr2O3 and \na Cr:Fe ratio of 3.5:1. The remainder of the „reserve‟ contains less than 45% Cr2O3 \nand high levels of Al2O3. The majority (92%) of the total „reserve‟ occurs in the three \nlargest deposits (numbers 2, 5 and 7), and of these, only deposit 2 contains high-grade \nore. Subsequent work by Siebdrat\n41,42\n increased the USBM‟s chromite resource \nestimates to approximately 3 000 000 t “visible or probable”, and a further 200 000 t \n“possible”. It is unclear whether these figures conform to any mineral resource \nreporting system of the time, or whether this was based on additional drilling or new \ngeophysical data. \n \nSoviet and Afghan geologists undertook a 1:500 000 scale geological mapping \nprogramme in the Kabul district during the 1970s. An initial survey identified copper, \nchromite, beryl, mica, graphite and asbestos occurrences in this area\n15\n. A later survey \nidentified additional chromite bodies in the Logar ophiolite, though these were \ncommonly isolated lenses a few metres in size and were not considered to be \neconomic\n30\n. No modern geological mapping or mineral resource assessment has been \nundertaken in the area since the withdrawal of Soviet troops in 1989. \n 8 \n \nNew work \nTwo disused chromite quarries were visited in November 2006. Security \nconsiderations precluded the study of other localities within the LOC. The first \nlocality, hereafter referred to as C1, (34º 13” 16.4‟ N, 69º 2” 29.1” E), is a disused \nquarry approximately 20 m long by 10 m wide and with a maximum depth of 20 m \nfrom surface (Figure 7). Nine samples, mostly of chromite or pyroxenite, were \ncollected in or around C1. The mineralisation remaining in place consists of massive \nchromite in the footwall of the northern end of the quarry (Figure 8), areas of \ndisseminated mineralisation with occasional blebs of chromite associated with 1-2 cm \nthick carbonate veins (Figure 9), and occasional sub-massive chromite mineralisation \n(Figure 10). Although the visible chromite pods are small, generally a few metres in \nlength by up to a metre in width, there were indications that larger chromite bodies \nhad been previously worked. Mineralisation in the side of the quarry indicated that \none of these bodies, most of which was now worked out, was approximately 50 m \nlong and 8 m wide and dipped at 49ºW. A narrow, discordant, possibly lenticular, \nbody of pyroxenite\/wehrlite up to 200-300 m long and about 1m thick is exposed on \nthe western edge of the quarry oriented at 146° (Figure 11). \n \nThe second locality visited, hereafter referred to as C2, (34º 13” 43.6‟ N, 69º 1” 34.3” \nE), was another disused chromite quarry approximately 60 m long by 30 m wide and \nup to 20 m deep (Figure 12). The quarry exploited podiform chromite cropping out in \nthe side of a hill but little mineralisation remains in situ. Several small massive \nchromite lenses are seen in the quarry walls associated with extensive carbonate \nveining and serpentinisation. A narrow, dyke-like body of pyroxenite\/wehrlite, up to 1 \nm thick, was traced uphill from the quarry for approximately 200 m. Additional minor \nchromite lenses (1-2 m in length and 30 cm in width) were also observed further up \nslope from the quarry. Most chromitite outcrops have been previously excavated, at \nleast in part, in order to determine their shape and size. Five samples of chromitite and \npyroxenite were taken in and around C2. \nPetrological and mineralogical studies \n 9 \nMethodology \nPolished thin sections from 12 rock samples collected at C1 and C2 were examined \nusing petrological microscopes at the British Geological Survey (BGS), UK. These \nsamples comprised five chromitites, three dunites, two pyroxenites, one peridotite and \none sample of microgabbro. Additionally, in order to locate any platinum-group \nminerals (PGM), six of the polished thin sections were automatically searched by \nelectron microprobe (Cameca SX50) on a 1- or 2-μm grid, using the back-scattered \nelectron signal to locate minerals with high atomic number. The PGM found were \ncharacterised using energy-dispersive spectra (EDS) and, if possible, wavelength-\ndispersive analysis (WDS) operating at 15 kV and 20 nA. \n \nPetrography \nPetrographic study of the chromitite samples recorded between 5-10% interstitial \nsilicate minerals in the ultramafic lithologies. In chromitite sample LGR 013 this \nconsists largely of olivine with minor alteration to serpentine, whilst the other samples \nare more altered with mainly serpentine, chlorite and a few remnants of olivine. A \nphotomicrograph of chromitite LGR 010 showing olivine with minor serpentine \nalteration is shown in Figure 13. The chromite itself is generally fresh showing red to \nred-brown colours with some minor darkening along fractures, but LGR 001 \n(chromitite) is much more intensely darkened indicating alteration to „ferrit-chromite‟ \nand magnetite. Several of the chromitite samples have been thinly veined by \ncarbonate. \n \nThe dunites are very fresh with only minor serpentinisation along cracks. They \ncontain around 1% chromite and interstitial pyroxene which in one sample (LGR 002) \nis clinopyroxene, and the other (LGR 012) orthopyroxene. One dunite sample (LGR \n012) contains around 5% orthopyroxene trending towards harzburgite in composition, \nand is cut by narrow zones of cataclasite, which are notable for the lack of retrograde \nalteration (Figure 14). \n \nSample LGR 009 (peridotite) contains abundant olivine with around 25% \northopyroxene and 5% clinopyroxene (Figure 15). Although this is classified as a \nperidotite, it could be similar to those previously described by Siebdrat\n42\n as lherzolite. \n 10 \nThis sample also contains minor chromite and slight alteration to serpentine and \nchlorite. \n \nThree samples of pyroxenite were examined, LGR 005, LGR 006, and LGR 014. \nSamples LGR 006 and LGR 014 are almost entirely orthopyroxene with a little \ninterstitial clinopyroxene and traces of olivine, whilst LGR 005 contains \napproximately 15% clinopyroxene and is classified as websterite (Figure 16). The \npyroxenites are generally very fresh but LGR 005 has slight amphibolitisation and \nLGR 014 is cut by zones of talc alteration. \n \nIn general, the samples examined are all very fresh, and none show the typical \nporphyroclastic mantle tectonite fabric that characterises ophiolitic mantle rocks. This \nsuggests that they are part of the magmatic suite of the Mantle Transition Zone \n(MTZ). \n \nOccurrence of PGM \nPGM were found in two of the samples studied. In the dunite sample LGR 012, an 8 \nμm grain of native Pt (with minor Fe) was identified in association with fine-grained \nserpentinisation of the olivine (Figure 17 A). The second observed occurrence, in \nchromitite LGR 013, is a 10 μm grain of Ru-Ir alloy along a Cr-spinel-chlorite grain \nboundary (Figure 17 B). \n \nThe presence of PGM associated with alteration minerals serpentinite and chlorite \nsuggests possible remobilisation of the PGM during alteration of the host lithology. \nLithogeochemical studies \nMethodology - Major and trace elements \nEight samples representing the different lithologies present at localities C1 and C2 \nwere analysed for major and trace elements by Wavelength Dispersive X-Ray \nFluorescence Spectrometry (WD-XRFS) using fused glass beads. The samples were \ndried overnight at 105°C and preignited at 1050°C before analysis. Loss on ignition \n(LOI) was determined after 1 hour at 1050°C. The results of these analyses are shown \nin Table 1. \n 11 \n \nThirteen samples from C1 and C2, comprising five chromitites, four dunites, two \npyroxenites, one peridotite and one sample of microgabbro, were crushed and milled \nin the BGS labs in the UK. Representative sub-samples were analysed by ACME \nAnalytical Laboratories in Canada for gold and the PPGE (Pt, Pd and Rh). Thirty \ngram samples underwent lead-collection fire-assay fusion for total sample \ndecomposition, followed by acid digestion of the silver doré bead and ICP-MS \nanalysis. \n \nRepresentative sub-samples of five samples from C1 and C2, three dunites, two \nchromitites and one peridotite, were analysed for five PGE (Pt, Pd, Rh, Ru and Ir) by \nnickel sulphide fire assay at Cardiff University based on the method used by \nMcDonald and Viljoen\n28\n. \n \nResults - Major elements \nThe major element analyses of the ultramafic rocks are shown in Table 1. This shows \ncompositions typical of ultramafic rocks with all samples having high MgO, low \nSiO2, and high MgO\/(FeO + MgO) ratios. The pyroxenites have much higher SiO2 \nand lower MgO, while the samples containing more clinopyroxene contain higher \nCaO. In general, the samples have a low level of serpentinisation, indicated by the low \nLOI. However, two of the samples, LGR008 and LGR009, a dunite and peridotite, \nhave relatively high LOI which suggests a higher level of serpentinisation.  \n \nResults - PGE and PGM \nPlatinum-group element concentrations in the Logar samples are shown in Table 3. \nThe concentrations of PGE in the chromitites are very low with maxima of 6.5 ppb Pt \nand 5.5 ppb Pd. Rh values are relatively high, with two samples exceeding 10 ppb. In \ndunites, Pt and Pd values are generally <10 ppb, although sample LGR 012 (from C2) \ncontains the maximum reported values of 11.3 ppb Pt and 9.4 ppb Pd. The pyroxenite \nsamples have relatively high Pt values with an average of 13 ppb whilst they have \nvery low Pd and Rh values. In dunites, sample LGR 012 from quarry C2 records \nhigher values for most PGE than the other dunite samples. The Pt and Pd values are \nmore variable, ranging from 5-11 ppb Pt and 2-10 ppb Pd. In general Rh, Ir and Ru \n 12 \nvalues are also low with a maximum of 8 ppb Ru. However, these observations are \nbased on limited data and further sampling would be needed to identify any \nsignificant patterns in the data. \n \nThe chondrite-normalised data for the five PGE determined at Cardiff University are \nshown in Figure 18. The plot of the Logar data shows two clear trends: (i) the two \nchromitites (LGR 003 and LGR 013) have marked positive Ru anomalies, Pt negative \nanomalies and a generally negative slope: (ii) one of the dunites (LGR 012) and the \nperidotite (LGR 009) have no negative Pt anomaly, relatively enriched in the low \ntemperature PGEs, Pd and Au, and show only a very slight Ru anomaly with positive \nslopes. This suggests that the two rock groups may have different origins for their \nPGE. Data from the UAE ophiolite\n14\n and the Zambales ophiolite\n9 \nare included in \nFigure 18 for comparison. \nMineral chemistry \nMethodology \nAnalyses of chromites and silicate minerals were undertaken at the Department of \nElectron Microanalysis at the State Geological Institute of Dionýz Štúr in Bratislava, \nSlovakia. This work was carried out on a Cameca SX-100 electron microprobe with \nan accelerating voltage of 15 kV (20 kV for sulphides) and sample current of 20 nA. \nThe elements were calibrated using synthetic or natural standards: Si-SiO2, Ti-TiO2, \nAl-Al2O3, Cr-Cr2O3, Fe-fayalite, Mn-rhodonite, Ni-Ni, Mg-MgO, Ca-wollastonite, \nNa-albite, K-orthoclase, Zr-zircon, S-chalcopyrite and Zn-willemite. A small number \nof other WDS analyses were also performed at the BGS (on chlorite and Cr-spinel) to \naugment and validate the work carried out in Slovakia. There is good agreement \nbetween both sets of results. \n \nResults – Major elements \nThe analyses of typical chromites are shown in Table 2. These show that the \nchromitites from C1 and chromites in dunites from both C1 and C2 have high Cr# \n(Cr\/Cr+Al) values around 0.8 up to over 0.9 in LGR 001. The chromitites from C2 \nhave much lower values 0.55- 0.7. The orthopyroxenite (LGR 006) has intermediate \nvalues around 0.7, similar to the top of the range of C2 chromitites. The data also \n 13 \nshows a considerable variation in Al2O3 between C1 and C2, with samples from C1 \nrecording up to 14% Al2O3 and samples from C2 recording up to 25% Al2O3. In \naddition, there are also variations in the content of Cr2O3, FeO and MgO within the \nsamples. This suggests that samples from C1 were formed in a different environment \nto C2 (discussed later). \n \nThe dunites and chromitites have very magnesian olivines in the range Fo92-96, while \nthe orthopyroxenite has Fo88.5 and the pyroxene is En90 less magnesian than the \ndunites and chromitites. The microgabbro has clinopyroxene with Mg# 67-74 and \nplagioclase mostly around An68 but some An50. \n \nDiscussion \nPGE are frequently associated with podiform chromitites in the mantle and the Mantle \nTransition Zone (MTZ). The concentration of PGE in most chromitites in ophiolites is \ngenerally low and the majority do not contain above 500 ppb\n27\n. The concentration of \nPGE in the chromitites studied from Logar are comparable with those in most \nophiolites around the world. However, several ophiolites are known with high PGE \ncontents. For example, the Tropoja and Bulqiza ophiolite complexes in Albania have \nrecorded up to 800 ppb Pt+Pd in chromitites from the upper part of the mantle\n31\n.  \nChromitites from the Semail ophiolite, Oman, are also known to contain up to 1 500 \nppb PGE\n2\n, whilst chromitites from the Hochgrössen and Kraubath massifs, Austria, \nhave recorded up to 2 269 ppb combined PGE, including 940 ppb Pt\n45\n. \n \nChromitites from ophiolites are usually characterised by negatively sloping chondrite-\nnormalised PGE patterns relatively enriched in the IPGE (Ir, Ru and Ru) e.g. the \nSemail ophiolite, Oman\n32\n, the Troodos ophiolite, Cyprus\n36\n, the Bou Azzer ophiolite, \nMorocco\n19\n, and the Veria ophiolite complex, Greece\n46\n. However, ophiolites that are \nrelatively enriched in Pt and Pd and characterised by positively sloping chondrite-\nnormalised PGE patterns are also known e.g. at Unst\n35\n, Portugal\n12\n and in the Urals\n50\n. \nHowever, these are rare and, at Unst, the enrichment is probably caused by localised \nhydrothermal remobilisation of the PGE\n20\n, although other researchers have stressed \nthe major importance of magmatic processes at this location\n35\n. \n \n 14 \nThe Semail ophiolite, Oman contains relatively high PGE values, up to 1 500 ppb, in \nchromitites in the mantle and other ultramafic rocks in veins cutting the mantle and \nthe Mixed Unit\n3\n. The rocks containing these high PGE values are all associated with \nthe second stage Supra Subduction Zone (SSZ) hydrous magmatic phase. More recent \nstudies\n38\n, have reported high values of both IPGE (50-275 ppb) and PPGE (50-515 \nppb) in pyroxenites, wehrlites and chromites from the UAE ophiolite. These are \nformed during a late magmatic phase and could be broadly similar to the late \npyroxenites at Logar. \n \nPGM are widely recorded in ophiolites worldwide e.g. the Zambales ophiolite, \nPhilippines\n9\n, Troodos ophiolite, Cyprus\n36\n, the Kop mountains, Turkey\n47\n, Vourinos\n24\n, \nand Pindos\n44\n, many others not cited here. The occurrence of PGM from the LOC, a \ngrain of native platinum in a dunite and a Ru-Ir alloy in a chromitite, is therefore not \nsurprising given previous discoveries in other ophiolites e.g the Unst ophiolite, \nShetland\n35\n, Bou Azzer ophiolite, Morocco\n19\n, and the Kempirsai ophiolite complex, \nUrals\n17\n. However, this study represents the first time that PGM have been identified \nwithin ultramafic rocks from the LOC in Afghanistan.  \n \nThe association of these PGM with serpentinised and altered olivine and spinel crystal \nboundaries suggests some remobilisation of PGM during the serpentinisation of the \nhost rock. No evidence of any primary sulphides was observed. However, since only \nlimited sampling of the LOC was carried out during this study, further investigations \nwould be necessary to fully understand the distribution of PGM in the LOC. \n \nPetrogenesis of the Logar ophiolite \nThe compositions of chromite and chrome-spinel grains are useful indicators of \npetrogenetic conditions in the mantle. Chrome-spinel is highly sensitive to the degree \nof partial melting in mantle peridotites and has been widely used for the tectonic \ndiscrimination of mafic and ultramafic rocks\n6, 11, 16\n. The geochemistry of chrome-\nspinel in mantle peridotites provides information on both the residual mantle, such as \nits degree of melting and condition of melting, and on the nature and extent of \nmelt\/rock interaction\n51, 25\n. This information can be used to determine whether the \nmantle sequence has a Mid-Ocean Ridge (MOR) setting or a Supra-Subduction Zone \n(SSZ) origin, or those that have formed from more than one tectonic setting\n33, 34\n. \n 15 \n \nIn addition, the Ti content of chrome-spinel is a reliable indicator of magma chemistry \nbecause the diffusivity of Ti\n4+\n in olivine is low\n40\n. TiO2 is also sensitive to melt-rock \nreaction and can fingerprint melt composition\n34\n.  Data for the LOC in Table 3 show \nvery low Ti levels with high Cr# from 0.5 to nearly 1.0. The plot of Cr# against TiO2 \nin spinel (Figure 19) shows different compositional ranges for chromites from the two \nquarries. The chromites from C2 have lower Cr# 0.5-0.6 with a wide range of TiO2 \nvalues. This is typical of chromitites from MOR-type magmas\n26\n. Chromitites from C1 \nhave a much higher Cr# and a narrower range of TiO2 values. This suggests formation \nfrom, or reaction with, boninitic magmas in a supra-subduction zone environment\n26\n.  \n \nThe plot of Cr# against Fo (olivine) (Figure 20) also highlights the differences \nbetween C1 and C2. The Cr#-Fo diagram is effective for distinguishing between \nresidual mantle peridotites and peridotites formed by fractional crystallization\n6, 7\n. Both \nCr# of spinel and Fo content of olivine increase during partial melting and form the \nOlivine-Spinel Mantle Array (OSMA) (see Figure 20) within which residual \nperidotites predominantly plot\n6\n. In contrast, spinels from lavas have lower Fo and so \nplot to the right of the OSMA trend because the Fo content of olivine decreases during \nfractional crystallisation\n7\n. The Cr#-Fo fractionation trend is dependent on the phases \nco-crystallising with spinel: Cr# decreases upon crystallisation of chrome-spinel with \nolivine and pyroxene but Cr# increases upon crystallisation of chrome-spinel with \nplagioclase\n7\n.  Extrapolation of the Cr#-Fo fractionation line back to the OSMA trend \nenables the compositions of the mantle residue in equilibrium with the primary \nmagma to be estimated\n7\n. \n \nThe Cr# values are higher in C1 than C2 but have similar Fo values. The dunites have \nhigh Cr# but slightly lower Fo, and the pyroxenite has both lower Cr# and lower Fo. \nWhen these compositions are compared with those from the mantle array it shows that \nthe pyroxenite falls on the low Fo side indicating some fractional crystallisation, while \nthe chromitites fall to the high Fo side suggesting a residual nature. The dunites fall \nwithin the mantle array with compositions suggesting high degrees of partial melting \nconsistent with boninitic magmas from a SSZ setting. The two trends of chondrite-\nnormalised PGE data for the Logar data also support the hypothesis that the different \nrock types in the LOC have different origins for their PGE. Since both trends are \n 16 \npresent in the same place, this could mean that more than one phase of mineralisation \noperated here. \n \nLogar data are broadly comparable in terms of Cr# and TiO2 to those described from \nthe UAE\n14\n and northern Oman\n39\n. \n \nIt is interesting that these chromites of contrasting composition are found relatively \nclose together; quarries C1 and C2 are within a few hundred metres of each other. \nThis may suggest that the two types of chromitites are formed as the product of two \ndiscrete mantle melting events. Some residual chromitites may have formed from an \nearly MOR phase of magmatism with later boninitic melts having reacted with the \nmantle to form the SSZ type chromitites in other areas. This is similar to the theory \nproposed for the origin of two chromitite pods 200 m apart in northern Oman\n2\n. \n \nMagmas producing chromitites similar to those seen at C1 tend to be S-\nundersaturated, Ti-poor, PGE-enriched, have a high Cr# and are boninitic in \ncomposition\n14, 22, 10, 37\n. Magma of this type is formed from widespread fluid-induced \nmelting of previously melted lithospheric mantle beneath an arc\n22\n. These boninitic \nmagmas would rise and react with uppermost mantle harzburgite to form high Cr# \n(>50% Cr2O3) chromitites in dunite pods\n52\n. The formation of chromite in supra-\nsubduction zones is illustrated in Figure 21. \n \nMagmas producing chromitites similar to those seen at C2 tend to be S-saturated, \nPGE-poor, with a low Cr # and a wide range of TiO2 value\n14, 22, 10, 37\n. Magma of this \ntype is produced in a fast-spreading mid-ocean ridge environment. \n \nIt is important to stress that our observations are based on limited sampling and \nanalysis. Further sampling would be necessary to determine whether these samples \nare representative of the LOC, and to better understand the petrogenetic and \nmetallogenic processes operating at the ophiolite complex. \n \n 17 \nConclusions \nThis study has identified PGM for the first time from the Logar Ophiolite Complex in \nAfghanistan. No modern work has been undertaken on the tectonic setting of the LOC \nand it was not the purpose of this study to investigate this further. However, field \nobservations presented in this study, together with the analysis of a limited number of \nsamples, suggest that the chromitites in the LOC appear to originate from two \ndifferent sources. One end-member is a melt derived from a low Cr #, PGE-poor \nMOR environment whilst the other is from a high Cr#, relatively PGE-rich boninitic \nmagma produced in a SSZ setting. \n \nThe mineralogical relationship of the PGM identified in this study indicates that the \nPGM may have been remobilised. \n \nAcknowledgements \nThe work undertaken in this study has been completed as a part of a DfID-funded \nBritish Geological Survey project, “Institutional Strengthening of the Afghan \nGeological Survey”, and is published with permission of the Executive Director, \nBritish Geological Survey. The authors gratefully acknowledge the assistance of many \nstaff at the Afghan Geological Survey and Ministry of Mines and Industry, including \nMinister Ibrahim Adel and Deputy President of AGS Eng. Omar. The comments and \ndiscussions with Tim Colman and Stan Coats, both formerly of BGS, are also greatly \nappreciated. In addition, Stan Coats generously provided several of the figures for this \nwork. \n \nReferences \n1. Sh. Abdullah, and V. M. Chmyrev (Editors-in-chief): Geology and Mineral \nResources of Afghanistan, Report 602, Afghanistan Geological Survey \nArchive, Kabul, 1980.  \n2. A. H. Ahmed and S. Arai: Unexpectedly high-PGE chromitite from the deeper \nmantle section of the northern Oman ophiolite and its tectonic implications. \nContrib. Mineral. Pertrol., 2002, 143, 263-278. \n3. A. H. Ahmed  and S. Arai: Platinum-group minerals in podiform chromitites \nof the Oman ophiolite. Canadian Mineralogist, 2003, 41, 597-616. \n 18 \n4. E. Anders and N. Grevesse. Abundances of the elements: Meteoric and solar. \nGeochimica et Cosomochimica Acta, 1989, 53, 197-214. \n5. G. Andritzky: Das Kristallinim Gebiet Panjao – Kabul – Jalalabad (Zentral- \nund Ost-Afghanistan). Kabul. Beih. Geol. Jb, 1970, 96, 5-82 (in German). \n6. S. Arai: Characterization of spinel peridotites by olivine-spinel compositional \nrelationships: Review and interpretation. Chemical Geology, 1994a, 113, 191-\n204. \n7. S. Arai: Compositional variation of olivine-chromian spinel in Mg-rich \nmagmas as a guide to their residual spinel peridotites. Journal of Volcanology \nand Geothermal Research, 1994b, 59 (4), 279-293. \n8. T. Augé. Platinum-group mineral inclusions in ophiolitic chromitite from the \nVourinos complex, Greece. Canadian Mineralogist, 23, 1985, 163–171. \n9. G. C. Bacuta, R. W. Kay, A. K. Gibbs, and B. R. Lippin: Platinum-group \nelement abundance and distribution in chromite deposits of the Acoje Block, \nZambales Ophiolite Complex, Philippines. J. Geochem. Expl., 1990, 37, 113-\n145. \n10. S. J. Barnes. Are Bushveld U-type parent magmas boninites or contaminated \nkomatiites? Contributions to Mineralogy and Petrology, 1989, 101, 447-457. \n11. S.J. Barnes and P.L. Roeder: The range of spinel compositions in terrestrial \nmafic and ultramafic rocks, J. Petrol. 2001, 42, 2279–2302.  \n12. J. C. Bridges, H. M. Prichard, C. R Neary, and C. A. Meireles: Platinum-group \nelement mineralization in chromite-rich rocks of Braganca massif, northern \nPortugal. Trans Inst Min Metall  B, 1994, 102, 103–113. \n13. V. M. Chmyrev, V. I. Dronov, K. F. Stazhilo-Alekseyev, A. Kh. Kafarskiy, E. \nP. Malyarov, and I. M. Sborshchikov: Geological structure and mineral \nresources of Afghanistan. 1977. Afghanistan Geological Survey, Kabul (in \nRussian). \n14. S. A. S. Dare: Chrome-spinel geochemistry of the northern Oman-United Arab \nEmirates ophiolite, PhD thesis (unpublished), Cardiff University, Wales, UK, \n2008. \n15. Sh. Sh. Denikaev, I. V. Pyzhyanov, V. P. Feoktistov, A. Adzhrauddin, Sh. N. \nNurbayev and J. M. Konev: The Geology and Minerals of the Southern Part of \nEastern Afghanistan (Preliminary report of the Kabul group for 1970). 1971. \nUnpublished report, Afghanistan Geological Survey Archive, Kabul, \n 19 \nAfghanistan. \n16. H. J. Dick and T. Bullen: Chromian spinel as a petrogenetic indicator in \nabyssal and alpine-type peridotites and spatially associated lavas. \nContributions to Mineralogy and Petrology, 1984, 86, 54-76. \n17. V. V. Distler, V. V. Kryachko and M. A.Yudovskaya: Ore petrology of \nchromite-PGE mineralisation in the Kempirsai ophiolite complex. Mineralogy \nand Petrology, 2008, 92, 31-58. \n18. V. I. Dronov, K. F. Stazhilo-Alekseev, A. Ya Kotchetkov, S. S. Karapetov, S. \nM. Kalimulin and I. I. Sonin: The Geology and Minerals of Central and South-\nWestern Afghanistan. Afghanistan Geological Survey Archive, Kabul, \nAfghanistan (in Russian). \n19. M. El Ghorfi, F. Melcher, T. Oberthür, A. E. Boukhari, L. Maacha, A. Maddi, \nand M.  Mhaili: Platinum group minerals in podiform chromitites of the Bou \nAzzer ophiolite, Anti Atlas, Central Morocco. Mineralogy and Petrology, \n2008, 92, 59-80. \n20. A. G. Gunn:  Drainage and overburden geochemistry in exploration for \nplatinum-group element mineralisation in the Unst ophiolite, Shetland, U.K. \nJournal of Geochemical Exploration, 1989, 31, 209-236. \n21. A. S. Hafisi: Geologisch petrografische Untersuchung des chromitfuhrenden \nultrabasitmassivs vom Logar Tal (sudostlich von Kabul). 1974. Afghanistan \nGeological Survey Archive, Kabul, Afghanistan (in German). \n22. P. Hamlyn and R. Keays: Sulfur saturation and second-stage melts: application \nto the Bushveld platinum metal deposits. Economic Geology, 1986, 81, 1431-\n1449. \n23. D. Jousselin and A. Nicolas: The Moho transition zone in the Oman ophiolite - \nrelation with wehrlites in the crust and dunites in the mantle. Marine \nGeophysical Researches, 2000, 21, 229-241. \n24. A. Kapsiotis, T.A. Grammatikopoulos, F. Zaccarini, B. Tsikouras, G. Garuti, \nK. Hatzipanagiotou. Platinum-group mineral characterisation in concentrates from low-\ngrade PGE chromitites from the Vourinos ophiolite complex, northern Greece. Trans. Inst. \nMin. Metall. B, 2006, 115 (2), 49-57(9). \n25. P. B. Kelemen, N. Shimizu and V. J. M. Slaters: Extraction of mid-ocean-\nridge basalt from the upwelling mantle by focused flow of melt in dunite \nchannels. Nature, 1995, 375, 747 – 753. \n 20 \n26. V. S. Kamenetsky, A. J. Crawford and S. Meffre: Factors controlling \nchemistry of magmatic spinel: an empirical study of associated olivine, Cr-\nspinel and melt inclusions from primitive rocks. J. Petrol, 2001, 42, 655–671. \n27. M. LeBlanc: Platinum-group elements and gold in ophiolitic complexes: \ndistribution and fractionation from mantle to oceanic floor. In Ophiolite \nGenesis and Evolution of the Oceanic Lithosphere, Oman (T. Peters et al., \neds.), 1991, Kluwer, Dordrecht, The Netherlands, 231-260. \n28. I. McDonald and K. S. Viljoen: Platinum-group element geochemistry of \nmantle ecolgites. Applied Earth Science (Trans. Inst. Min. Metall. B), 2006, \n115, No. 3, 81-93. \n29. E. B. Nevretdinov, L. V. Kubatkin, and Sh. Abdullah: Relation of Logar \nultramafic rocks and rocks of the Kabul Massif. Workshop Proceedings, 1978, \nKabul, 12-18 (in Russian). \n30. E. B. Nevretdinov and M. Mirzamon: Report on prospecting - survey and \nevaluation works on asbestos, chromite and other raw material in the northern \npart of the Logar Ultramafic Massif in 1978. 1979, Afghanistan Geological \nSurvey Archive, Kabul, Afghanistan (in Russian). \n31. M. Ohnenstetter, N. Karaj, A. Neziraj, Z. Johan and A. Cina: Le potentiel \nplatinifère des ophiolites:minéralisations en éléments du groupe du platine \n(PGE) dans les massifs de Tropoja et Bulquiza, Albanie. C.R. Acad. Sci. Paris, \n1991, 13, Sér. II, 201-208 (in French). \n32. N. J. Page, J. S. Pallister, M. A. Brown, J. D. Smewing and J. Haffy: \nPalladium, platinum, rhodium, iridium and ruthenium in chromite-rich rocks \nfrom the Semail Ophiolite, Oman. Canadian Mineralogist, 1982, 20, 537-548. \n33. J. Parkinson and J. Pearce: Peridotites from the Izu-Bonin-Mariana Forearc \n(ODP Leg 125): Evidence for Mantle Melting and Melt-Mantle Interaction in \na Supra-Subduction Zone Setting. Journal of Petrology, 1998, 39, 1577-1618. \n34. J. Pearce, P. F. Barker, S. J. Edwards, I. J. Parkinson and P. T. Leat: \nGeochemistry and tectonic significance of peridotites from the South \nSandwich arc-basin system, South Atlantic. Contributions to Mineralogy and \nPetrology, 2000, 139, 36-53. \n35. H. M. Prichard, P. J. Potts and C. R. Neary: Platinum group element minerals \nin the Unst chromite, Shetland Isles. Trans. Inst. Min. Metall. B, 1981, 90, \nB186-188. \n 21 \n36. H. M. Prichard and R. A. Lord: Platinum and Palladium in the Troodos \nOphiolite Complex, Cyprus. Canadian Mineralogist, 1990, 28, 607-617. \n37. H. M. Prichard, R. A. Lord, and C. R. Neary. A model to explain the \noccurrence of platinum- and palladium-rich ophiolite complexes. Journal of \nthe Geological Society, 1996, 153, 323-328. \n38. N. S. Robins, A. J. Benham and C. J. Mitchell: The Geology and Geophysics \nof the United Arab Emirates. Volume 3: Economic Geology and \nHydrogeology, Keyworth, Nottingham: British Geological Survey, 2006. \n39. H. Rollinson: The geochemistry of mantle chromitites from the northern part \nof the Oman ophiolite: inferred parental melt compositions. Contrib. Mineral. \nPetrol., 2008, 156, 273-288. \n40. P. A. H. Scowen, P. L. Roeder, and R. T. Heltz: Reequilibration of chromite \nwithin Kilauea Iki lava lake, Hawaii. Contrib. Mineral. Petrol., 1991, 107, 8-\n20.  \n41. H. G. Siebdrat: Parallelisierung von optisch ermittelter und analytisch \nberechneter Mineralzusammensetung bei Chromiterzen Afghanistans. \nBergbauwissenschaften Jb., 1965, 12, H. ½, 28-34 (in German). \n42. H. G. Siebdrat:  Chromite in ultrabasischen Magmatiten des unteren Logar-\nTales (Sudost-Afghanistan). Beih. Geol. Jb., 1971, 96, 209-226 (in German). \n43. A. Shareq, V. N. Voinov, E. B. Nevretdinov, L. V. Kubatkin and I. A. Gusav: \nThe Logar ultrabasite massif and its reflection in the magnetic field (East \nAfghanistan). Tectonophysics, 1980, 62, 1-5. \n44. M. Tarkian, M. Economou-Eliopoulos, and G. Sambanis. Platinum group \nminerals in chromitites from the Pindos ophiolite complex, Greece: Neues \nJahrbuecher fur Mineralogic Monatshefte, 1996, 10, 145–160. \n45. O. A. R. Thalhammer, W. Prochaska and H. W. Mühlans: Solid inclusion in \nchrome-spinels and platinum-group element concentration from the \nHochgrössen and Kraubath ultramafic massifs (Austria). Contrib. Mineral. \nPetrol., 1990, 105, 66–80. \n46. G. Tsoupas and M. Economou-Eliopoulos: High PGE contents and extremely \nabundant PGE-minerals hosted in chromitites from the Veria ophiolite \ncomplex, northern Greece. Ore Geology Reviews, 2008, 33, 3-19. \n 22 \n47. M. Uysal, M. Tarkian, B. Sadiklar and C. Şen: Platinum-group-element \ngeochemistry and mineralogy of ophiolitic chromitites from the Kop \nMountains, northeastern Turkey. Canadian Mineralogist, 2007, 45, 355-377. \n48. M. E. Volin: Chromite deposits in Logar Valley, Kabul Province. United \nStates Bureau of Mines, 48, Afghanistan Geological Survey, Kabul, 1950. \n49. D. Wirtz: Zur regional-geologischen Stellung der Afghanischen Gebirge. \nB.geol. Jb., Hannover, 1964, 70, 5-18 (in German). \n50. F. Zaccarini, E. Pushkarev and G.Garuti: Platinum-group element mineralogy \nand geochemistry of chromitite of the Kluchevskoy ophiolite complex, central \nUrals (Russia). Ore Geology Reviews, 2008, 33, 20-30. \n51. M. F. Zhou, P. T. Robinson and W. J Bai: Formation of podiform chromites \nby melt\/rock interaction in the upper mantle. Mineralium Deposita, 1994, 29, \n98-101. \n52. M. F. Zhou, M. Sun, R. R. Keays and R. W. Kerrich: Controls on platinum-\ngroup elemental distributions of podiform chromitites: a case study of high-Cr \nand high-Al chromitites from Chinese orogenic belts. Geochim. Cosmochim. \nActa, 1998, 62, 677-688. \n \nDiagrams: \nFigure 1. The location of the Logar Ophiolite Complex in Afghanistan. \n \nFigure 2. Simplified tectonic map of Afghanistan showing the different terranes in the \ncountry. \n \nFigure 3. Satellite interpretation of the tectonic setting of the Logar Ophiolite \nComplex based on LandSat imagery. \n \nFigure 4. Lithological section through the Ultramafic Complex and Pillow Lava \nComplex of the Logar Ophiolite Complex. (Modified after Nevretdinov and \nMirzamon\n30\n). \n \nFigure 5. View looking north across the ultramafic part of the LOC. A dyke of \nmicrogabbro composition can be seen trending north-west in the mid-background. \n \n 23 \nFigure 6. Location of chromite quarries visited, other reported chromite localities and \nsimplified geology of the Logar Ophiolite Complex. Modified from Siebdrat\n42\n. \n \nFigure 7. First chromite quarry (C1) visited in the Logar Ophiolite Complex (34º 13” \n6.4‟ N, 69º 2” 29.1” E) looking west. \n \nFigure 8. Massive chromitite in the side of the C1 chromite quarry (34º 13” 16.3‟ N, \n69º 2” 28.6” E) \n \nFigure 9. Disseminated chromite and blebs of chromite associated with carbonate \nveins in dunite from the C1 chromite quarry (34º 13” 16.3‟ N, 69º 2” 28.6” E) \n \nFigure 10. Sub-massive chromite mineralisation taken from the C1 quarry (34º 13” \n17.7‟ N, 69º 2” 28.2” E) \n \nFigure 11. Discordant pyroxenite body (grey) within dunite host (brown) occurring at \nthe western end of the C1 chromite quarry (34º 13” 17.7‟ N, 69º 2” 28.2” E) \n \nFigure 12. Second quarry (C2) visited in the Logar Ophiolite Complex (34º 13” 43.6‟ \nN, 69º 1” 34.3” E). Lithologies exposed in the quarry wall include pyroxenite (grey), \ndunite (brown), and carbonitised ultramafic rocks (white) \n \nFigure 13. SEM photomicrograph of LGR 010 (chromitite) from C1 showing \ninterlocking chromite crystals (white) and interstitial olivine (light grey) being \nreplaced by serpentine (lizardite) (dark-grey). \n \nFigure 14. Photomicrograph of dunite (LGR 012) in plane polarised light. Note \ncataclasite zone of crushed olivine through the sample. Scale bar 2 mm. \n \nFigure 15. Photomicrograph of peridotite (LGR 009) in cross polarised light. The \nolivine (highly coloured) is very fresh and comparatively unaltered. Note the opaque \nchromite inclusions (black). Scale bar 2 mm. \n \n 24 \nFigure 16. Photomicrograph of LGR 005 (pyroxenite - websterite) in cross polarised \nlight showing typically fresh, unaltered diopside crystals. Scale bar 2 mm. \n \nFigure 17 A) Sample LGR 012 (dunite), a grain of native Pt (+Fe) found associated \nwith serpentinised olivine, and, B) Sample LGR 013 (chromitite), a grain of Ru-Ir \nalloy found along an altered olivine\/Cr-spinel boundary. \n \nFigure 18. Chondrite-normalised plots of samples from C1 and C2. Chondrite PGE \nlevels from Anders and Grevesse\n4\n. UAE data taken from Dare (pers. comm.), \nZambales data from Bacuta et al\n9\n. \n \nFigure 19. Cr# (Cr\/(Cr + Al)) and TiO2 of chromite samples from the LOC. \n \nFigure 20. Cr# spinel against olivine Fo content for rock samples taken from C1 and \nC2. The diagram shows the olivine-spinel mantle array (OSMA) and melting trend \n(annotated by % melting) of Arai\n6\n and the fractional crystallization trend to lower Fo\n7\n. \n \nFigure 21. Model for the formation of podiform chromite deposits in a supra-\nsubduction zone. \n \n 26 \nSample name Lithology SiO2 TiO2 Al2O3 Fe2O3t Mn3O4 MgO CaO Na2O K2O P2O5 SO3 Cr2O3 SrO ZrO2 BaO NiO CuO ZnO PbO LOI Total \n  % % % % % % % % % % % % % % % % % % % % % \nLGR002 Dunite 40.95 <0.01 0.16 8.50 0.13 47.89 0.33 n.d. n.d. n.d. n.d. 0.78 n.d. n.d. n.d. 0.40 n.d. n.d. n.d. 1.83 100.97 \nLGR004 Dunite 43.52 <0.01 0.29 8.54 0.14 45.04 0.61 n.d. n.d. n.d. n.d. 0.53 n.d. n.d. n.d. 0.32 n.d. n.d. n.d. 1.97 100.96 \nLGR005 Pyroxenite 56.55 0.02 0.84 7.25 0.16 33.61 1.42 n.d. n.d. n.d. n.d. 0.54 n.d. n.d. n.d. 0.10 n.d. n.d. n.d. 0.49 100.98 \nLGR006 Pyroxenite 52.85 0.02 0.74 7.67 0.16 36.10 1.23 n.d. n.d. n.d. n.d. 0.53 n.d. n.d. n.d. 0.16 n.d. n.d. n.d. 1.39 100.85 \nLGR008 Dunite 39.20 <0.01 0.17 9.02 0.13 45.41 0.27 n.d. n.d. n.d. n.d. 0.48 n.d. n.d. n.d. 0.34 n.d. n.d. n.d. 5.83 100.85 \nLGR009 Peridotite 41.73 <0.01 0.26 8.44 0.14 43.16 0.65 n.d. n.d. n.d. n.d. 0.43 n.d. n.d. n.d. 0.30 n.d. n.d. n.d. 5.87 100.98 \nLGR012 Dunite 43.10 <0.01 0.37 8.63 0.14 46.18 0.46 n.d. n.d. n.d. n.d. 0.42 n.d. n.d. n.d. 0.32 n.d. n.d. n.d. 1.34 100.96 \nLGR014 Pyroxenite 55.73 0.03 1.04 7.70 0.17 32.71 1.55 n.d. n.d. n.d. n.d. 0.55 n.d. n.d. n.d. 0.10 n.d. n.d. n.d. 0.96 100.54 \nTable 1. Major and trace element analyses of dunites, peridotites and pyroxenites from the Logar Ophiolite Complex. Analysis by Wavelength \nDispersive X-Ray Fluorescence Spectrometry (WD-XRFS) using fused glass beads at the British Geological Survey, UK. Fe2O3t represents total \niron expressed as Fe2O3. SO3 represents sulphur retained in the fused bead after fusion at 1200°C. n.d. = not detected (below detection limit) \n \n \n \n \n \n \n \n \n \n \n 27 \nSample no. Lithology Location SiO2 TiO2 Al2O3 Cr2O3 Fe2O3 FeO\na\n MnO MgO CaO NiO ZnO \nCr# \n(Cr\/Cr+Al) Total \nLGR01.1 Chromitite C1 0.11 0.14 8.66 60.23 3.55 12.4 0.42 13.36 0 0.04 0 0.823 98.91 \nLGR01.2 Chromitite C1 0.01 0.13 8.98 60.64 3.62 12 0.37 13.69 0 0.11 0 0.819 99.53 \nLGR01.3 Chromitite C1 0.02 0.13 8.81 60.72 3.62 12.23 0.38 13.52 0 0.1 0 0.822 99.51 \nLGR01.5 Chromitite C1 0.03 0.16 2.72 63.53 5.22 14.71 0.46 10.9 0 0.03 0.04 0.940 97.78 \nLGR01.6 Chromitite C1 0.01 0.15 2.52 63.34 5.36 15.6 0.49 10.23 0.01 0.09 0 0.944 97.79 \nLGR01.7 Chromitite C1 0.01 0.17 2.68 63.46 4.7 17.21 0.34 9.36 0 0.02 0.08 0.941 98.02 \nLGR01.14 Chromitite C1 0.03 0.14 8.82 60.14 3.58 11.87 0.31 13.66 0.01 0.05 0 0.821 98.59 \nLGR02.1 Dunite C1 0 0.15 9.37 57.81 4.85 16.81 0.41 10.65 0 0.02 0.16 0.805 100.25 \nLGR02.2 Dunite C1 0.02 0.14 9.35 57.83 4.49 16.87 0.46 10.52 0.03 0.06 0.07 0.806 99.83 \nLGR02.3 Dunite C1 0.03 0.14 9.34 57.21 4.82 16.92 0.45 10.45 0 0.08 0.04 0.804 99.45 \nLGR02.4 Dunite C1 0.03 0.14 9.68 54.79 5.6 19.25 0.51 8.82 0.01 0 0.06 0.792 98.89 \nLGR02.5 Dunite C1 0 0.13 9.15 57.97 4.81 16.57 0.48 10.66 0.01 0.03 0.17 0.810 99.97 \nLGR02.7 Dunite C1 0.03 0.09 8.63 58.6 4.4 17.22 0.48 10.18 0 0.05 0.12 0.820 99.79 \nLGR10.2 Chromitite C2 0.01 0.12 24.45 47.26 0 13.66 0.28 14.02 0.02 0.16 0.01 0.565 99.97 \nLGR10.3 Chromitite C2 0.01 0.11 24.84 45.03 3.22 10.87 0.28 16.3 0 0.18 0.1 0.644 100.94 \nLGR10.7 Chromitite C2 0 0.1 24.75 45.06 2.76 11.03 0.28 16.07 0 0.19 0.04 0.549 100.28 \nLGR10.8 Chromitite C2 0.01 0.11 20.25 50.11 2.58 12.59 0.33 14.77 0 0.09 0 0.550 100.83 \nLGR10.9s Chromitite C2 0.01 0.11 24.39 44.37 3.11 11.94 0.32 15.28 0.01 0.2 0.06 0.624 99.81 \nLGR13.4c Chromitite C2 0.03 0.1 24.57 44.03 3.05 11.96 0.28 15.29 0.01 0.13 0.13 0.550 99.58 \nLGR06.2 Pyroxenite C1 0.01 0.16 13.13 52.89 3.07 18.29 0.4 9.55 0 0.11 0.13 0.730 97.72 \nLGR6.3 Pyroxenite C1 0.04 0.17 13.41 53.77 2.62 18.82 0.43 9.47 0 0.05 0.3 0.729 99.06 \nLGR06.21 Pyroxenite C1 0.06 0.07 14.6 48.99 3.56 24.19 0.58 5.67 0 0.05 0.44 0.692 98.21 \nLGR06.22 Pyroxenite C1 0.05 0.06 14.61 48.54 3.66 23.9 0.52 5.74 0.02 0.03 0.45 0.690 97.58 \nTable 2. Selected analyses (wt. %) of chromite from different rocks of the Logar Ophiolite Complex analysed at the State Geological Institute of \nDionýz Štúr in Bratislava, Slovakia. a Total FeO \n \n 28 \n   Analytical Ir Ru Pt Pd Rh Au Total PGE \nSample Location Lithology Method ppb ppb ppb ppb ppb ppb ppb \nLGR001 C1 Chromitite M1 - - 2.6 0.5 12.0 4.0 15.1 \nLGR002 C1 Dunite M1 - - 2.8 3.8 7.0 5.0 13.6 \nLGR002 C1 Dunite M2 5.2 17.8 4.4 5.3 0.9 2.1 33.5 \nLGR003 C1 Chromitite M1 - - 2.5 0.8 8.9 4.0 12.2 \nLGR003 C1 Chromitite M2 45.1 121.5 7.5 13.8 12.4 3.1 200.2 \nLGR004 C1 Dunite M1 - - 7.4 4.4 3.3 4.0 15.1 \nLGR006 C1 Pyroxenite M1 - - 10.5 2.7 0.3 4.0 13.5 \nLGR007 C1 Microgabbro M1 - - 1.9 <.5 1.6 7.0 3.5 \nLGR008 C1 Dunite M1 - - 5.4 2.4 3.0 7.0 10.8 \nLGR009 C1 Peridotite M1 - - 11.3 16.2 2.8 8.0 30.3 \nLGR009 C1 Peridotite M2 4.2 8.3 11.2 18.0 1.6 2.5 43.3 \nLGR010 C2 Chromitite M1 - - 2.1 5.5 16.2 2.0 23.8 \nLGR011 C2 Chromitite M1 - - 5.1 <.5 3.0 2.0 8.1 \nLGR012 C2 Dunite M1 - - 11.3 9.4 1.2 25.0 21.9 \nLGR012A C2 Dunite M2 2.9 6.8 8.1 8.0 1.5 1.7 27.2 \nLGR012B C2 Dunite M2 3.2 7.6 9.7 9.5 1.7 1.5 31.7 \nLGR013 C2 Chromitite M1 - - 6.5 2.1 3.0 12.0 11.6 \nLGR013 C2 Chromitite M2 8.7 38.0 9.0 16.6 2.0 4.7 74.2 \nLGR014 C2 Pyroxenite M1 - - 16.1 <.5 1.7 5.0 17.8 \n \nTable 3. PGE data for selected samples from localities C1 and C2 in the LOC. M1 = \nAnalysis by lead fire-assay\/ICP-MS at ACME labs, Canada. M2 = Analysis by nickel \nsulphide fire-assay at Cardiff University. \n 29 \n \nFigure 1. The location of the Logar Ophiolite Complex in Afghanistan. \n \n 30 \n \nFigure 2. Simplified tectonic map of Afghanistan showing the different terranes in the country.\n 31 \n \nFigure 3. Satellite interpretation of the tectonic setting of the Logar Ophiolite \nComplex based on LandSat imagery. \n 32 \n \n \nFigure 4. Lithological section through the Ultramafic Complex and Pillow Lava \nComplex of the Logar Ophiolite Complex. (Modified after Nevretdinov and \nMirzamon\n30\n). \n \n 33 \n \nFigure 5. View looking north across the ultramafic part of the LOC. A dyke of \nmicrogabbro composition can be seen trending north-west in the mid-background. \n \n \n 34 \n \n \nFigure 6. Location of chromite quarries visited, other reported chromite localities and \nsimplified geology of the Logar Ophiolite Complex. Modified from Siebdrat\n42\n.\n 35 \n \nFigure 7. First chromite quarry (C1) visited in the Logar Ophiolite Complex (34º 13” \n6.4‟ N, 69º 2” 29.1” E) looking west. \n \n \nFigure 8. Massive chromitite in the side of the C1 chromite quarry (34º 13” 16.3‟ N, \n69º 2” 28.6” E) \n \n 36 \n \nFigure 9. Disseminated chromite and blebs of chromite associated with carbonate \nveins in dunite from the C1 chromite quarry (34º 13” 16.3‟ N, 69º 2” 28.6” E) \n \nFigure 10. Sub-massive chromite mineralisation taken from the C1 quarry (34º 13” \n17.7‟ N, 69º 2” 28.2” E) \n \n 37 \n \nFigure 11. Discordant pyroxenite body (grey) within dunite host (brown) occurring at \nthe western end of the C1 chromite quarry (34º 13” 17.7‟ N, 69º 2” 28.2” E) \n \n \nFigure 12. Second quarry (C2) visited in the Logar Ophiolite Complex (34º 13” 43.6‟ \nN, 69º 1” 34.3” E). Lithologies exposed in the quarry wall include pyroxenite (grey), \ndunite (brown), and carbonitised ultramafic rocks (white) \n \n 38 \n \nFigure 13. SEM photomicrograph of LGR 010 (chromitite) from C1 showing \ninterlocking chromite crystals (white) and interstitial olivine (light grey) being \nreplaced by serpentine (lizardite) (dark-grey) \n \n \nFigure 14. Photomicrograph of dunite (LGR 012) in plane polarised light. Note \ncataclasite zone of crushed olivine through the sample. Scale bar 2 mm. \n \n 39 \n \nFigure 15. Photomicrograph of peridotite (LGR 009) in cross polarised light. The \nolivine (highly coloured) is very fresh and comparatively unaltered. Note the opaque \nchromite inclusions (black). Scale bar 2 mm. \n \n \n \nFigure 16. Photomicrograph of LGR 005 (pyroxenite - websterite) in cross polarised \nlight showing typically fresh, unaltered diopside crystals. Scale bar 2 mm. \n \n \n \n 40 \n \n \nA \n \nB \nFigure 17 A) Sample LGR 012 (dunite), a grain of native Pt (+Fe) found associated \nwith serpentinised olivine, and, B) Sample LGR 013 (chromitite), a grain of Ru-Ir \nalloy found along an altered olivine\/Cr-spinel boundary. \n \n \nFigure 18. Chondrite-normalised plots of samples from C1 and C2. Chondrite PGE \nlevels from Anders and Grevesse\n4\n. UAE data taken from Dare (pers. comm.), \nZambales data from Bacuta et al\n9\n Troodos data from Prichard and Lord\n36\n.\n 41 \n0.300\n0.400\n0.500\n0.600\n0.700\n0.800\n0.900\n1.000\n0.00 0.05 0.10 0.15 0.20 0.25 0.30\nTiO2 wt%\nC\nr#\nChromitites from C1\nDunite\nOrthopyroxenite\nChromitites from C2\n Figure 19. Cr# (Cr\/(Cr + Al)) v TiO2 for the chromite samples from the LOC. \n \n \nFigure 20. Cr# spinel against olivine Fo content for rock samples taken from C1 and \nC2. The diagram shows the olivine-spinel mantle array (OSMA) and melting trend \n(annotated by % melting) of Arai\n6\n and the fractional crystallization trend to lower Fo\n7\n. \n 42 \n \nFigure 21. Model for the formation of podiform chromite deposits in a supra-\nsubduction zone. \n"}