{"doi":"10.1103\/PhysRevE.80.056210","coreId":"68874","oai":"oai:eprints.lancs.ac.uk:30800","identifiers":["oai:eprints.lancs.ac.uk:30800","10.1103\/PhysRevE.80.056210"],"title":"Semiclassical transport in nearly symmetric quantum dots. II. Symmetry breaking due to asymmetric leads","authors":["Whitney, Robert S.","Schomerus, Henning","Kopp, Marten"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-11","abstract":"In this work—the second of a pair of articles—we consider transport through spatially symmetric quantum dots with leads whose widths or positions do not obey the spatial symmetry. We use the semiclassical theory of transport to find the symmetry-induced contributions to weak localization corrections and universal conductance fluctuations for dots with left-right, up-down, inversion, and fourfold symmetries. We show that all these contributions are suppressed by asymmetric leads; however, they remain finite whenever leads intersect with their images under the symmetry operation. For an up-down symmetric dot, this means that the contributions can be finite even if one of the leads is completely asymmetric. We find that the suppression of the contributions to universal conductance fluctuations is the square of the suppression of contributions to weak localization. Finally, we develop a random-matrix theory model which enables us to numerically confirm these results","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/68874.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/30800\/1\/0906.0892v3.pdf","pdfHashValue":"6590b50405445a5d1cdf6ca8871c31c384c30fe4","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:30800<\/identifier><datestamp>\n      2018-01-24T02:53:43Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Semiclassical transport in nearly symmetric quantum dots. II. Symmetry breaking due to asymmetric leads<\/dc:title><dc:creator>\n        Whitney, Robert S.<\/dc:creator><dc:creator>\n        Schomerus, Henning<\/dc:creator><dc:creator>\n        Kopp, Marten<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        In this work—the second of a pair of articles—we consider transport through spatially symmetric quantum dots with leads whose widths or positions do not obey the spatial symmetry. We use the semiclassical theory of transport to find the symmetry-induced contributions to weak localization corrections and universal conductance fluctuations for dots with left-right, up-down, inversion, and fourfold symmetries. We show that all these contributions are suppressed by asymmetric leads; however, they remain finite whenever leads intersect with their images under the symmetry operation. For an up-down symmetric dot, this means that the contributions can be finite even if one of the leads is completely asymmetric. We find that the suppression of the contributions to universal conductance fluctuations is the square of the suppression of contributions to weak localization. Finally, we develop a random-matrix theory model which enables us to numerically confirm these results.<\/dc:description><dc:date>\n        2009-11<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/30800\/1\/0906.0892v3.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1103\/PhysRevE.80.056210<\/dc:relation><dc:identifier>\n        Whitney, Robert S. and Schomerus, Henning and Kopp, Marten (2009) Semiclassical transport in nearly symmetric quantum dots. II. Symmetry breaking due to asymmetric leads. Physical Review E, 80 (5). 056210. ISSN 1539-3755<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/30800\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1103\/PhysRevE.80.056210","http:\/\/eprints.lancs.ac.uk\/30800\/"],"year":2009,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"ar\nX\niv\n:0\n90\n6.\n08\n92\nv3\n  [\nco\nnd\n-m\nat.\nme\ns-h\nall\n]  \n15\n Se\np 2\n00\n9\nSemiclassical transport in nearly symmetric quantum dots II:\nsymmetry-breaking due to asymmetric leads\nRobert S. Whitney,1 Henning Schomerus,2 and Marten Kopp2\n1Institut Laue-Langevin, 6 rue Jules Horowitz, B.P. 156, 38042 Grenoble, France\n2Department of Physics, Lancaster University, Lancaster, LA1 4YB, United Kingdom\n(Dated: June 4, 2009)\nIn this work — the second of a pair of articles — we consider transport through spatially symmetric\nquantum dots with leads whose widths or positions do not obey the spatial symmetry. We use the\nsemiclassical theory of transport to find the symmetry-induced contributions to weak localization\ncorrections and universal conductance fluctuations for dots with left-right, up-down, inversion and\nfour-fold symmetries. We show that all these contributions are suppressed by asymmetric leads,\nhowever they remain finite whenever leads intersect with their images under the symmetry operation.\nFor an up-down symmetric dot, this means that the contributions can be finite even if one of the\nleads is completely asymmetric. We find that the suppression of the contributions to universal\nconductance fluctuations is the square of the suppression of contributions to weak localization.\nFinally, we develop a random-matrix theory model which enables us to numerically confirm these\nresults.\nPACS numbers: 05.45.Mt,74.40.+k,73.23.-b,03.65.Yz\nI. INTRODUCTION\nThis is work — the second of a pair of articles — on\nmesoscopic transport through chaotic quantum dots with\nspatial symmetries (see Ref. [1] for part I). In both works\nwe use recent advances in semiclassical techniques to ad-\ndress the effect of spatial symmetries on weak localiza-\ntion (WL) corrections and universal conductance fluctu-\nations (UCFs). The aim of the first article was to iden-\ntify the microscopic origin of properties that were earlier\nonly known from phenomenological random-matrix the-\nory (RMT) [2, 3, 4, 5], and furthermore to extend the\nconsiderations to situations in which RMT is not easily\napplicable. In particular, this includes scenarios where\nsymmetries are only partially preserved. To this end, the\nfirst article [1] also considered the combined effects of\nmagnetic fields, a finite Ehrenfest time, and dephasing\non symmetric systems and also discussed the reduction\nof symmetry-related interference effects by deformations\nof the dots.\nIn the present paper, we contrast this ‘internal’ symme-\ntry breaking with symmetry breaking which is due to the\nposition or shape of the leads (for examples of such situ-\nations see Fig. 1). We ask what happens to the transport\nif we take a symmetric dot coupled to leads which respect\nthe symmetry, and then start moving one of the leads. In\nthe fully symmetric situation, the magnitude of UCFs is\ndoubled for each independent symmetry, while the weak\nlocalization correction can be either increased or reduced\n(sometimes remain unaffected) depending on the spatial\nsymmetry in question [1, 2, 3]. Are these symmetry-\ninduced effects modified when the leads are deformed or\ndisplaced? If so, are they sensitive to displacement on\na quantum scale (of order of a Fermi wavelength) or a\nclassical scale (of order of a lead width)?\nThe present literature does not offer much guidance to\nanswer these questions—indeed, the knowledge on trans-\nport in spatially symmetric systems with displaced leads\nis rather limited. Reference [6] reports that the distribu-\ntion of transmission eigenvalues of a left-right symmetric\ndot with completely asymmetrically-placed leads differs\nslightly from the distribution of a completely asymmetric\ndot. Because the difference is small, symmetric systems\n(such as stadium billiards) with displaced leads are in-\ndeed often used as representatives of completely asym-\nmetric systems (see, e.g., Refs. [4, 5]). Recent works of\none of the authors, on the other hand, identify a huge\nconductance peak in weakly coupled mirror-symmetric\ndouble-dots which still remains large even when the leads\nare not placed symmetrically [7, 8].\nA simple consideration of weak localization quickly\nconvinces us that it could never be as robust as the above-\nmentioned huge conductance peak in double dots. In sys-\ntems without spatial symmetries, weak localization is the\ncounter-part of coherent backscattering—particle conser-\nvation guarantees that one cannot have one without the\nother. Systems with spatial symmetries have addition\ncoherent back- and forward-scattering contributions (as\ndiscussed in the first of this pair of articles [1]). These\ncontributions rely on interference between paths that are\nrelated by spatial symmetry. If those paths do not both\ncouple to the leads, they cannot generate an interference\ncontribution to conductance. Thus, if we displace one\nlead so much that there is no intersection with its spa-\ntially symmetric partner (W∩ = 0 in Fig. 1) then the\ncontributions to coherent forward scattering due to the\nspatial symmetries must vanish.\nThe precise distance by which one has to move the lead\nto substantially suppress the symmetry-related contribu-\ntions depends on the detailed position dependence of the\ncoherent forward- and backscattering peaks. In princi-\nple, these coherent interference patterns could oscillate\non a scale of a wavelength, and thus one might imag-\nine that a small displacement of that order would suffice.\n2The calculations and numerical computations presented\nby us here show that this is not the case. Instead, the\ncoherent forward- and backscattering peaks have a width\nof order the lead width, and do not oscillate on the scale\nof a wavelength.\nThese considerations entail that the displacement of\nleads in internally symmetric systems offers a unique\nmeans to study coherent forward- and backscattering\nprocesses. From photonic systems it is known that the\nshape of the coherent backscattering cone provides valu-\nable information on the multiple scattering in a sam-\nple [9, 10]. Based on the results of the present work,\ntransport measurements with gradually displaced leads\npromise to give similar insight into the dynamics of elec-\ntronic systems.\nThis work is organized as follows. Section II intro-\nduces notation and provides a condensed review of the\nbasic semiclassical concepts elaborated in more detail in\nthe first of this pair of articles [1]. The following sections\ndescribe the consequences of displaced leads for the weak\nlocalization correction in systems with left-right symme-\ntry (Sec. III), inversion symmetry (Sec. IV), up-down\nsymmetry (Sec. V) and four-fold symmetry (Sec. VI). In\nSec. VII we study the magnitude of universal conduc-\ntance fluctuations for all types of symmetry. Finally, in\nSection VIII we generalize the phenomenological RMT\nmodel of symmetry breaking (presented in [1]) to the case\nof displaced leads, and compare the results of numerical\ncomputations to the semiclassical predictions. Our con-\nclusions are collected in Section IX. The appendix con-\ntains some further details on the semiclassical calculation\nof universal conductance fluctuations.\nII. BACKGROUND\nTo make this article self-contained we here first fix no-\ntation and then briefly summarize the main concepts of\nthe theory of semiclassical transport in systems with spa-\ntial symmetries, developed in the first of this pair of ar-\nticles [1].\nA. Characteristic scales\nWe consider chaotic quantum dots of size L [area A =\nO(L2) and circumference C = O(L)] which may possess\nany of the following three types of spatial symmetry; a\nleft-right mirror-symmetry, an inversion symmetry, and\nan up-down mirror-symmetry. We also consider four-fold\nsymmetric systems which simultaneously possess all the\nabove symmetries. The quantum dot is perfectly coupled\nto two leads, labelled left (L) and right (R) and carrying\nNL and NR modes, where Nκ = pFWκ\/(π~) ≫ 1 for\nκ ∈ L,R (here pF is the Fermi momentum; we also denote\nthe Fermi velocity by vF ). The quantum dynamics in the\ndot is characterized by a number of time scales, given\nby the time of flight τ0 = πA\/CvF between successive\n\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\n\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0001\u0001\u0001\n\u0001\u0001\u0001\n\u0001\u0001\u0001\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0001\u0001\u0001\n\u0001\u0001\u0001\nWL\nL\n(c) Up−down symmetric dot with asym. left lead\n(b) Inversion symmetry dot with asym. leads\nWR\n(a) Left−right symmetric dot with asym. leads \n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0001\u0001\u0001\n\u0001\u0001\u0001\n\u0000\u0000\u0000\u0000\u0001\u0001\u0001\u0001\n\u0000\u0000\u0000\u0001\u0001\u0001\n\u0000\u0000\n\u0000\u0000\n\u0000\u0000\n\u0001\u0001\n\u0001\u0001\n\u0001\u0001\n\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\n\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001W U W U\nW U\nW U\nW U\nFigure 1: (colour online). (a) A quantum dot with a left-right\nmirror symmetry, coupled to leads which do not respect that\nsymmetry. The left lead (L) has width WL, the right lead\n(R) has width WR. The intersection between lead L and the\nmirror image of lead R has width W∩. If the L and R leads\nhave no intersection under the mirror-symmetry then W∩ =\n0. (b) Same for a quantum dot with inversion symmetry.\n(c) A quantum dot with up-down symmetry, for which each\nsymmetry-respecting lead is mapped onto itself. In the figure,\nthe left lead is displaced, which reduces the intersection W∩L\nof this lead with its mirror image.\nreflections off the boundaries, the dwell time τD = τ0 ×\nC\/(WL+WR), the dephasing time τφ = 1\/γφ (where γφ is\nthe dephasing rate), and a time scale τB = (B0\/B)\n2τ0 on\nwhich a magnetic field destroys time-reversal symmetry.\nHere, B0 ∼ h\/(eA) is a characteristic field strength at\nwhich about one flux quantum penetrates the quantum\ndot. In transport, the effect of a magnetic field is felt at\na smaller magnetic field\nBc = aB0\n√\nτ0\/2τD, (1)\nwhere a is a system-specific parameter of order one\n[11]. Furthermore, the quantum-to-classical crossover is\ncharacterized by the open-system Ehrenfest time τoE =\n3Λ−1 ln[W 2\/(LλF)] and the closed-system Ehrenfest time\nτcE = Λ\n−1 ln[L\/λF], where Λ is the classical Lyapunov\nexponent and λF is the Fermi wavelength [12].\nIn contrast to Ref. [1], we here consider the possibility\nthat the leads do not respect the symmetry of the dot.\nAs shown in Fig. 1, the displacement from the symmetry-\nrespecting position is characterized by the overlap of\nleads under the relevant symmetry operation. For left-\nright mirror symmetry and inversion symmetry, this is\nthe width W∩ of the intersection of a lead with the im-\nage of the other lead. An up-down symmetry maps each\nsymmetry-respecting lead onto itself. The displacement\nof lead L (R) is then characterized by the width W∩L\n(W∩R) of the intersection of this lead with its own mir-\nror image. In a four-fold symmetric system, the displace-\nment is characterized by the various widths of intersec-\ntions with respect to the individual symmetries (W∩LR\nfor left-right mirror symmetry, W∩inv for inversion sym-\nmetry, W∩UD:L for up-down mirror symmetry of lead L\nand W∩UD:R for up-down mirror symmetry of lead R).\nB. Semiclassical theory of transport\nThe semiclassical theory of transport [13, 14] expresses\nthe transport through a quantum dot in terms of classi-\ncal paths γ, γ′ which connect point y0 lead L to point\ny on lead R. Summing over lead modes as in Ref. [15],\nthe dimensionless conductance (conductance in units of\n2e2\/h) is given by\ng =\n1\n2π~\n∫\nL\ndy0\n∫\nR\ndy\n∑\nγ,γ′\nAγAγ′ e\ni(Sγ−Sγ′ )\/~, (2)\nwhere Sγ =\n∫\nγ pdr denotes the classical action of a path,\nand the amplitude Aγ is related to the square-root of the\npath’s stability.\nFor most pairs of γ and γ′ the exponential in Eq. (2)\noscillates wildly as one changes the energy or the dot-\nshape. Thus they make no contribution to the aver-\nage conductance (where one averages over energy, dot-\nshape, or both). The contributions that survive averag-\ning are those where the pairs of paths have similar actions\nSγ ≃ Sγ′ for a broad range of energies and dot-shapes.\nIn particular, this is the case for the “diagonal contribu-\ntions” to the above double sum (with γ′ = γ), which can\nbe analyzed using the sum rule (in the spirit of Eq. (B6)\nof Ref. [13])\n∑\nγ\nA2γ [· · · ]γ =\n∫ pi\n2\n−pi\n2\ndθ0\n∫ pi\n2\n−pi\n2\ndθ pF cos θ0\n×P˜ (Y,Y0; t) [· · · ]Y0 . (3)\nHere we define P˜ (Y,Y0; t)δyδθδt as the classical prob-\nability for a particle to go from an initial position and\nmomentum angle of Y0 ≡ (y0, θ0) on lead L to within\n(δy, δθ) of Y = (y, θ) on lead R in a time within δt of\nt. The average of P˜ over an ensemble of dots or over\nenergy results in a smooth function. If the dynamics\nare mixing on a timescale ≪ τD, one can approximate〈\nP˜ (Y;Y0; t)\n〉\n= e−t\/τD cos θ\/[2 (WL +WR) τD], which\nresults in the classical Drude conductance\n〈g〉D =\nNLNR\n(NL +NR)\n. (4)\nQuantum corrections to this result originate from correla-\ntions of paths γ and γ′ which are not identical, but closely\nrelated by additional discrete symmetries in the system.\nFor asymmetric quantum dots the only possible addi-\ntional symmetry is time-reversal symmetry, which results\nin the ordinary weak localization correction [16, 17, 18]\nand associated coherent-backscattering peak [15, 17, 19]\nfor systems whose classical dynamics exhibit hyperbolic\nchaos. The identification of possible pairings is also at\nthe heart of the calculation of the magnitude var(g) of\nuniversal conductance fluctuations, which in the semi-\nclassical theory naturally takes the form of a quadruple\nsum over classical paths [20, 21].\nSpatial symmetries in such chaotic systems induce fur-\nther possible pairings both for the average conductance\nas well as for its variance, which are discussed in de-\ntail in the first article in this series [1]. In the following\nsections we revisit these results and extend them to the\ncase of displaced leads, which is far richer than the case\nof symmetry-respecting leads.\nIII. LEFT-RIGHT SYMMETRIC QUANTUM\nDOT WITH DISPLACED LEADS\nWe first consider a left-right mirror-symmetric system\nwith leads that are (partially or fully) displaced from\nthe symmetry-respecting configuration. As shown in\nFig. 1(a), the leads are of different widths and centred\nat different places. The amount of symmetry-breaking\nis characterized by the (possibly vanishing) width W∩ of\nintersection between lead L and the mirror image of lead\nR. In Fig. 2 we show the path-pairings for all symmetry-\ninduced interference corrections to the average conduc-\ntance. (There is a strong resemblance between these con-\ntributions and the weak localization correction for sys-\ntems with leads that contain tunnel barriers; in particu-\nlar compare the failed coherent forward scattering contri-\nbutions in Fig. 2 of this article with the failed coherent\nbackscattering contributions in Fig. 4 of Ref. [22].) None\nof the contributions listed in Fig. 2 are particularly diffi-\ncult to calculate using the method presented in the first\nof this pair of article [1]. This method involves folding\npaths under the spatial symmetry to find ways in which\none can construct pairings between paths or their im-\nages, with pairings switching at “effective” encounters;\nsee Fig. 3. The difficulty is to find all contributions. One\ncrucial check is to verify that the sum of all interference\ncontributions to transmission and reflection gives zero,\nthereby ensuring particle conservation.\n4RW\nRW\nL\nLW\nW\nW\nW\n(3i)\n(3) Uniform reduction of transmission and reflection\n(2iii)\nW\nLW\n(2ii)(2i)\n(1)\n(3ii)\nWL\nWR\nR\n(2) Failed coherent forward scattering contributions\nRW\nWL\nWR\nR\nLW\n(1) Sucessful coherent forward scattering contribution\nL\n(2iv)\n\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\n\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\n\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\n\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0001\u0001\u0001\n\u0001\u0001\u0001\n\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\n\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0001\u0001\u0001\n\u0001\u0001\u0001\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0001\u0001\u0001\n\u0001\u0001\u0001\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0001\u0001\u0001\n\u0001\u0001\u0001\n\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\n\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0001\u0001\u0001\n\u0001\u0001\u0001\n\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\n\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\n\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\n\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\n\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\n\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\n\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\n\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\n\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0001\u0001\u0001\n\u0001\u0001\u0001\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0001\u0001\u0001\n\u0001\u0001\u0001\n\u0001\u0001\u0001\n\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\n\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\n\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\n\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0001\u0001\u0001\n\u0001\u0001\u0001\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0001\u0001\u0001\n\u0001\u0001\u0001\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0001\u0001\u0001\n\u0001\u0001\u0001\n\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\n\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\n\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\n\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\n\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\n\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0001\u0001\u0001\n\u0001\u0001\u0001\n\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\n\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0001\u0001\u0001\n\u0001\u0001\u0001\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0001\u0001\u0001\n\u0001\u0001\u0001\n\u0001\u0001\u0001\nU\nUW\nW U\nUW\nW U\nUWUW\nW UW U\nUW UW\nUWUW\nUW\nW\nFigure 2: (colour online). List of interference contributions to the conductance for a dot with left-right mirror-symmetry when\nthe leads are asymmetric. Here the leads have widths WL and WR and are centred at different places. The intersection of the\nL lead and the R lead’s mirror image has a width W∩ and is indicated by the unshaded part of the L lead. The sketches on the\nleft are all contributions to transmission from the L lead to the R lead (hence the contributions to conductance). The sketches\non the right are all contributions to reflection from the L lead back to the L lead.\nThe main difference from the equivalent calculation for\na system with symmetric leads (cf. Ref. [1]) is that here\na pair of symmetry-related paths has a shorter joint sur-\nvival time than the pairs of identical paths in the diagonal\ncontribution. When the leads are symmetrically placed,\nthe probability of a path staying in the dot (not hitting\na lead) is strictly identical to the probability of its mir-\nror image staying in the dot. This ceases to be the case\nwhen the leads are not symmetric. We deal with this by\nexplicitly considering all situations where a path hits a\nlead (in which case it escapes from the system) or the\nmirror image of a lead (in which its mirror image will\nescapes from the system). The probability that either of\nthe processes occurs is (WL +WR −W∩)\/C per bounce\nat the boundary of the dot, where C is the circumference\nof the dot. We therefore define a modified dwell time\nτ ′D = τD ×\nWL +WR\n2(WL +WR −W∩)\n= τD ×\nNL +NR\n2(NL +NR −N∩)\n(5)\nwhich characterizes the probability exp[−t\/τ ′D] that a\npath and its mirror image are both still in the dot at\ntime t. We use this probability in place of exp[−t\/τD]\nin evaluating all parts of contributions 1 and 2 in Fig. 2\nwhere the paths are the mirror image of each other.\n5\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\n\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0001\u0001\u0001\n\u0001\u0001\u0001\n\u0001\u0001\u0001\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0001\u0001\u0001\n\u0001\u0001\u0001\n\u0001\u0001\u0001\nWL\nWR\nL\n(a) Folding procedure in dot with left−right symmetry\n(b) Folding procedure in dot with inversion symmetry\n(c) Folding procedure in dot with up−down symmetry\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0001\u0001\u0001\n\u0001\u0001\u0001\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0001\u0001\u0001\n\u0001\u0001\u0001\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0001\u0001\u0001\n\u0001\u0001\u0001\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0001\u0001\u0001\n\u0001\u0001\u0001\n\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\n\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\n\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\n\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0001\u0001\u0001\n\u0001\u0001\u0001\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0001\u0001\u0001\n\u0001\u0001\u0001\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0001\u0001\u0001\n\u0001\u0001\u0001\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0000\u0000\u0000\n\u0001\u0001\u0001\n\u0001\u0001\u0001\n\u0001\u0001\u0001\n’γ\nγ\n’γ\nγ\nW UW U\nW U\nW U\nFigure 3: (colour online). To find the non-trivial path pair-\nings, and to evaluate the phase difference between the paths,\nwe use the folding procedure introduced in Ref. [1] (for sym-\nmetric leads). Here we consider the extra contributions gener-\nated by the fact the leads are asymmetric (i.e., contributions\n2i-iv in Fig. 2). For each spatial symmetry, we give one ex-\nample of the folding procedure for an unsuccessful coherent\nforward-scattering (or backscattering). The ellipses mark the\neffective encounters, where paths interchange their pairing.\nThe other contributions are easily analyzed in the same way.\nA. Successful and failed forward-scattering\ncontributions\nThe contribution of paths of the type labelled 1 and\n2i-2iv in Fig. 2 have an effective encounter close to a lead.\nThese contributions are similar to certain contributions\nin an asymmetric system with tunnel barriers [22], and\nhence we use a similar method to analyze them here. The\nbehavior of path γ′ is completely determined by that of\npath γ, so the two paths have the same amplitudes, Aγ′ =\nAγ . The action difference between them is (Sγ − Sγ′) =\n(p0⊥+mΛr0⊥)r0⊥, where (r0⊥, p0⊥) is the component of\n(Y−Y0) which is perpendicular to the direction of path\nγ at Y [23]. Using the sum rule in Eq. (3), we see that\nthe contribution 1 in Fig. 2 is given by (cf. contribution\nLR:a in Ref. [1])\n〈δg〉LR:1 = (2π~)\n−2\n∫\n∩\ndY0\n∫\n∩\ndY\n∫ ∞\n0\ndt (6)\n×pF cos θ0 〈P\n′(Y,Y0; t)〉 Re\n[\nei(Sγ−Sγ′)\/~\n]\n.\nThe limits on the integral indicate that we only integrate\nover the region of the leads which have an overlap with\neach other under the left-right mirror symmetry (the re-\ngions of width W∩ marked in Fig. 2).\nThe survival probability 〈P ′(Y,Y0; t)〉 =\nexp[−t\/τ ′D]δrδθ\/[π(WL + WR − W∩)τ\n′\nD] is that of a\npath and its mirror image. The probability per unit\ntime for path γ to hit within (δr, δθ) of a given point\nin the region of phase space defined by the union of\nleads and their mirror images is 〈P ′(Y,Y0; t)〉δY where\nδY ≡ δrδθ. Note that it is τ ′D rather than τD which gives\nthe decay rate of 〈P ′(Y,Y0; t)〉. We express the Y0\nintegral in terms of the relative coordinates (r0⊥, p0⊥)\nand define T ′W (r0⊥, p0⊥) and T\n′\nL(r0⊥, p0⊥) as the time\nbetween touching the lead and the perpendicular dis-\ntance between γ and γ′ becoming of order W and L,\nrespectively. For times less than T ′W (r0⊥, p0⊥), the path\nsegments are almost mirror images of each other, and\ntheir joint survival probability is the survival probability\nof a path and its mirror image. For times longer than\nthis the path-pairs escape independently, but since the\npairs are made of a path and its mirror image, the\nescape rate is τ ′D not τD. The t-integral in Eq. (6) must\nhave a lower cut-off at 2T ′L(r0⊥, p0⊥), because that is\nthe minimum time for reconvergence. (For shorter times\nthere is no contribution, because path γ and γ′ must\nseparate to a distance of order the dot size, if they are\ngoing to reconverge at the other lead). Thus we have∫\n∩\ndY\n∫ ∞\n0\ndt〈P ′(Y,Y0; t)〉\n=\nN∩ exp[−T\n′\nW\/τ\n′\nD − 2(T\n′\nL − T\n′\nW )\/τ\n′\nD]\nNL +NR −N∩\n, (7)\nwhere T ′L,W are shorthand for T\n′\nL,W (r0⊥, p0⊥). Note that\nthe τ ′D in the denominator of 〈P\n′(Y,Y0; t)〉 was cancelled\nwhen we integrated over all times longer than 2T ′L. For\nsmall (p0⊥ +mΛr0⊥) we find\nT ′L(r0⊥, p0⊥) ≃ Λ\n−1 ln\n[\nmΛL\n|p0⊥ +mΛr0⊥|\n]\n, (8)\nand T ′W (r0⊥, p0⊥) is given by the same formula with L\nreplaced byW . Evaluating the integrals over the relative\ncoordinates (r0⊥, p0⊥) as in Ref. [1], we finally obtain\n〈δg〉LR:1 = N∩[2(NL +NR −N∩)]\n−1 exp[−τcE\/τ\n′\nD]. (9)\nThe failed coherent forward-scattering contributions\nlabelled 2i and 2ii in Fig. 2 come from the window of\nwidth WL −W∩ in the L lead. This causes an enhanced\nprobability of hitting the mirror image of that part of\n6lead L. However, the lead R is not there, so this con-\nstructive interference peak gets reflected back into the\ndot, and has a probability of NR\/(NL +NR) of going to\nlead R and a probability of NL\/(NL+NR) of going back\nto lead L [23]. The former is a contribution to transmis-\nsion (and hence to the conductance) while the latter is a\ncontribution to reflection. Thus we have\n〈δg〉LR:2i =\n(NL −N∩)NR exp[−τ\nc\nE\/τ\n′\nD]\n2(NL +NR −N∩)(NL +NR)\n, (10)\n〈δR〉LR:2ii =\n(NL −N∩)NL exp[−τ\nc\nE\/τ\n′\nD]\n2(NL +NR −N∩)(NL +NR)\n. (11)\nBy inspection of Fig. 2 it follows that 〈δg〉LR:2iii is\ngiven by Eq. (10) with NR and NL interchanged, while\n〈δR〉LR:2iv = 〈δR〉LR:2ii.\nB. Uniform contributions to transmission and\nreflection\nTo evaluate the uniform contributions to transmission\nand reflection, labelled 3i and 3ii in Fig. 2, we divide\nthe pairs of paths in this contribution into three regions.\nThe first part is when γ and γ′ are the same, and are\nfar from the encounter (a time TW \/2 or more away\nfrom the encounter). Here the probability for the paths\nto escape is 1\/τD per unit time. The second region is\nwhere γ′ and γ are the mirror image of each other and\nfar from the encounter (a time TW \/2 or more from the\nencounter). Here the probability of one or both paths to\nescape is 1\/τ ′D per unit time. Finally, the third region\nis close to the encounter (less than a time TW \/2 away\nfrom the encounter). Here the probability for the paths\nto escape the first time they pass through this region\nsurrounding the encounter is exp[−TW \/τD]. However,\nthe conditional probability to escape the second time\nthe paths pass through this region (given that they both\nsurvived the first time) is exp\n[\n− TW\n(\n1\/τ ′D − 1\/τD\n)]\n. It\nfollows that the contribution 3i is given by 〈δg〉LR:3i =\n(π~)−1\n∫\nL\ndY0\n∫\ndǫRe\n[\nei(Sγ−Sγ′)\/~\n]〈\nF (Y0, ǫ)\n〉\n, where\nthe action difference (Sγ − Sγ′) is the same as for weak\nlocalization in Refs. [17, 24] and\nF (Y0, ǫ) = 2v\n2\nF sin ǫ\n∫ ∞\nTL+TW\ndt\n∫ t−TW\n2\nTL+\nTW\n2\ndt2\n∫ t2−TL\nTW\n2\ndt1\n× pF cos θ0\n∫\nR\ndY\n∫\nC\ndR1P˜ (Y,R2; t− t2)\n× P˜ ′(R2,R1; t2 − t1)P˜ (R1,Y0; t1). (12)\nSince the paths are paired with their mirror image be-\ntween time t1 and time t2, the survival rate is τ\n′\nD during\nthis time, but it is τD at all other times. Evaluating this\nintegral with these survival times gives\n〈F (Y0, ǫ)〉 =\n2v2FτDτ\n′\nD\n2πA\nNR\nNL +NR\npF cos θ0\n× sin ǫ exp\n[\n− TL(ǫ)\/τ\n′\nD\n]\n. (13)\nThis has two differences from the result for symmetric\nleads in Ref. [1]. The exponent contains τ ′D not τD, and\nthe prefactor contains τDτ\n′\nD not τ\n2\nD. When integrating\nover ǫ, we obtain a factor of [Λτ ′D]\n−1 exp[−τcE\/τ\n′\nD] in place\nof [ΛτD]\n−1 exp[−τcE\/τD]. Thus the τ\n′\nD in the prefactor is\ncancelled [25]. Evaluating the integrals, we get\n〈δg〉LR:3i = −NLNR[NL +NR]\n−2 exp[−τcE\/τ\n′\nD], (14)\n〈δR〉LR:3ii = −N\n2\nL[NL +NR]\n−2 exp[−τcE\/τ\n′\nD]. (15)\nThese results are of the same form as the weak local-\nization correction except that the exponent contains τ ′D\nin place of τD. In particular, we recover the familiar fac-\ntor of −NLNR\/(NL+NR)\n2 even though the joint survival\ntime is reduced when the paths are mirror images of each\nother.\nOne can next include other suppression effects such as\nasymmetry in the dot and dephasing, which we discussed\nfor dots with symmetric leads in Ref. [1]. The only dif-\nference caused by asymmetric leads is that now the parts\nof contributions affected by asymmetries and dephasing\n(parts where paths are paired with their mirror image)\ndecay with a rate τ ′D instead of τD. Thus we find that all\nthe contributions listed in Fig. 2 are then multiplied by\na factor\nZ ′LR(γasym, γφ) =\nexp[−γφτ˜ − γasymτ˜asym]\n1 + (γasym + γφ)τ ′D\n, (16)\nwhere the expression for the decay rates γasym, γφ and\ntimescales τ˜ , τ˜asym are the same as for a dot with sym-\nmetric leads [1].\nC. Conductance of a left-right symmetric quantum\ndot with asymmetric leads\nAs required by particle number conservation, the seven\ncontributions in Fig. 2 sum to zero. In order to obtain the\nconductance, we sum the four contributions to transmis-\nsion from the left lead to the right lead (contributions 1,\n2i, 2iii and 3i), and add them to the Drude conductance\nand the weak localization correction. This gives the con-\nductance of a chaotic left-right symmetric quantum dot\nwith many-modes on each lead (NL, NR, N∩ ≫ 1),\n〈g〉LR =\nNLNR\nNL +NR\n(17)\n+\nNLNR\n(NL +NR)2\n[\nN∩e\n−τc\nE\n\/τ ′\nD\nNL +NR −N∩\nZ ′LR(γasym, γφ)\n−e−τ\nc\nE\n\/τDZ(B, γφ)\n]\n+ O[N−1L,R],\nwhere Z ′LR(γasym, γφ) is given by Eq. (16). The second\nterm in the square brackets is the usual weak localiza-\ntion correction, which is suppressed by magnetic fields\nand dephasing according to the function Z(B, γφ) =\n7exp[−γφτ˜ ]\n[\n1 + (B\/Bc)\n2 + γφτD\n]−1\n. For symmetric leads\nwe have N∩ = NL = NR (and hence τ\n′\nD = τD), and this\nresult immediately reduces to the one in Ref. [1].\nIt is worth considering two special cases. The first case\nis when the leads are of equal width but not centred at the\nmirror image of each other, such that N∩ < NL = NR ≡\nN . Taking ∆w = 1−w∩\/W = 1−N∩\/N as the relative\ndistance (in units of the lead width W = WL = WR) by\nwhich lead L is displaced with respect to the mirror image\nof lead R, and assuming there is no dephasing, magnetic\nfield, or internal asymmetry, we find\n〈g〉LR =\nN\n2\n+\n1\n4\n[\n1−∆w\n1 + ∆w\ne−τ\nc\nE\n\/τ ′\nD − e−τ\nc\nE\n\/τD\n]\n+O[N−1]. (18)\nThe second special case is when the lead R is narrower\nbut situated entirely within the mirror image of lead L;\nwe then haveN∩ = NR < NL. Assuming again that there\nis no dephasing, magnetic field, or internal asymmetry,\n〈g〉LR =\nNLNR\nNL +NR\n+\nNLNR\n(NL +NR)2\n[\nNR\nNL\ne−τ\nc\nE\n\/τ ′\nD − e−τ\nc\nE\n\/τD\n]\n+ O[N−1L,R]. (19)\nAs one could scan the narrow lead R across the mirror\nimage of the wide lead L, this scenario can be thought of\nas a probe of the shape of the coherent forward-scattering\npeak. The fact that our result Eq. (19) is independent of\nthe position of lead R tells us that the forward-scattering\npeak is uniformly distributed over the region defined by\nthe mirror image of lead L.\nIV. INVERSION-SYMMETRIC QUANTUM\nDOT WITH ASYMMETRIC LEADS\nFor systems with inversion symmetry the calculation\nfollows much as for a left-right symmetry. The one sig-\nnificant difference is the magnetic-field dependence of the\ncontributions, which was treated in Ref. [1]. The dis-\nplacement of the leads simply requires us to replace τD\nwith τ ′D in the suppression of contributions by magnetic\nfields, asymmetries in the dot, and dephasing. The sup-\npression factor therefore takes the form\nZ ′inv(B, γasym, γφ) =\nexp[−γasymτ˜asym − γφτ˜ ]\n1 + (B\/B′c)\n2 + (γasym + γφ)τ ′D\n.\n(20)\nwhere B′c = aB0\n√\nτ0\/2τ ′D is given by Eq. (1) with τD re-\nplaced by τ ′D. As a result, an inversion-symmetric quan-\ntum dot with many modes on each lead (NL, NR, N∩ ≫\n1) has a total average conductance of\n〈g〉inv =\nNLNR\nNL +NR\n+\nNLNR\n(NL +NR)2\n[\nN∩e\n−τc\nE\n\/τ ′\nD\nNL +NR −N∩\nZ ′inv(B, γasym, γφ)\n−e−τ\nc\nE\n\/τDZwl(B, γφ)\n]\n+ O[N−1L,R]. (21)\nWith the exception of the magnetic-field dependence of\nthe second term, this formula is the same as Eq. (17) for\na left-right symmetric dot. Thus the two special cases\ndiscussed below Eq. (17) are directly applicable here.\nV. UP-DOWN SYMMETRIC QUANTUM DOT\nWITH ASYMMETRIC LEADS\nFor up-down symmetric systems, there are a number of\nimportant differences with the case of left-right symmetry\ndiscussed in Section III. Firstly, a pair of paths related\nby the mirror symmetry decays jointly at a rate\nτ\n(UD)\nD = τD ×\nNL +NR\n2NL + 2NR −N∩L −N∩R\n, (22)\nwhere N∩L is the number of modes in the intersection\nof lead L with its own mirror image, and N∩R is the\nnumber of modes in the intersection of lead R with its\nown mirror image. Secondly, the successful and failed\nforward-scattering contributions for left-right symmetry\nare converted into successful and failed backscattering\ncontributions for up-down symmetry. In particular, suc-\ncessful backscattering makes no contribute to the conduc-\ntance. The other contributions to transmission are not\nvery different from those for left-right symmetry, except\nthat one must distinguish N∩L from N∩R, and one must\nreplace τ ′D by τ\n(UD)\nD . Summing up the contributions to\nconductance induced by the spatial symmetry, we find\n〈δg〉UD = −\n(N∩LN\n2\nR +N∩RN\n2\nL) exp[−τ\nc\nE\/τ\n(UD)\nD ]\n(2NL + 2NR −N∩L −N∩R)(NL +NR)2\n×Z ′UD(γasym, γφ), (23)\nwhere Z ′UD(γasym, γφ) has the same form as\nZ ′LR(γasym, γφ) given in Eq. (16), but with τ\n′\nD re-\nplaced by τ\n(UD)\nD . Like for left-right mirror-symmetry\n(but unlike for inversion symmetry) this contribution is\nunaffected by a magnetic field.\n8The average conductance of an up-down mirror-symmetric dot with many modes on each lead is therefore\n〈g〉UD =\nNLNR\nNL +NR\n−\nNLNR\n(NL +NR)2\n[(\nN∩LNR\nNL\n+\nN∩RNL\nNR\n)\nexp[−τcE\/τ\n(UD)\nD ] Z\n′\nUD(γasym, γφ)\n2NL + 2NR −N∩L −N∩R\n+exp[−τcE\/τD] Zwl(B, γφ)\n]\n+ O[N−1L,R]. (24)\nIt is worth noting that the spatial symmetry induces\na reduction of conductance whenever one lead is close to\nsymmetric, even if the other lead is completely asym-\nmetric (i. e. when N∩L = 0 but N∩R 6= 0, or vice\nversa). For example, when both leads have the same\nwidth (NL = NR = N) and the right lead is perfectly\non the symmetry axis (N∩R = NR), but the left lead is\na long way from the symmetry axis (N∩L = 0), Eq. (24)\nreduces to\n〈g〉UD =\nN\n2\n−\n1\n4\n[\n1\n3\nexp[−τcE\/τ\n(UD)\nD ] + exp[−τ\nc\nE\/τD]\n]\n+ O[N−1] (25)\nassuming no dephasing, magnetic field and no asymmetry\nin the dot. If the Ehrenfest time is much shorter than\nτD and τ\nUD\nD , the average conductance of the system with\none displaced lead is therefore simply 〈g〉UD = N\/2−1\/3.\nRemarkably, the conductance from the L lead to the\nR lead is therefore affected by the symmetry of the dot\neven when the L lead is completely asymmetric. this\nresult is perhaps less counterintuitive when one considers\nreflection (rather than transmission). If one lead is on\nthe symmetry axis, then reflection back to that lead will\nbe enhanced even if the other lead is a long way from\nthe symmetry axis. Since we have particle conservation,\nthere must be an associated reduction in transmission\nfrom one lead to the other (compared to transmission in\na completely asymmetric situation).\nVI. FOUR-FOLD SYMMETRIC QUANTUM\nDOT WITH ASYMMETRIC LEADS\nA quantum dot with four-fold symmetry simultane-\nously possesses all three of the spatial symmetries that\nwe discuss in this article. The interference corrections\nto the conductance of such a system are simply the sum\nof the corrections due to each of these three symmetries\n(i.e., the presence of the extra symmetries has no effect\non the contributions which do not respect those symme-\ntries),\n〈δg〉4F = 〈δg〉LR + 〈δg〉inv + 〈δg〉UD, (26)\nwhere 〈δg〉κ is the contribution to the average conduc-\ntance induced by spatial symmetry κ ∈ LR, inv,UD. The\nexplicit form of this result is easily extracted from the ex-\npressions in the previous sections. Instead of writing it\nout in full, we consider the special case where the two\nleads have the same width, NL = NR = N , the Ehren-\nfest time is negligible and there is no dephasing, magnetic\nfield or asymmetry in the dot. The average conductance\nthen takes the form\n〈g〉4F =\nN\n2\n+\n1\n4\n[ N∩LR\n2N −N∩LR\n+\nN∩inv\n2N −N∩inv\n−\nN∩UD:L +N∩UD:R\n4N −N∩UD:L −N∩UD:R\n− 1\n]\n, (27)\nwhere N∩LR is the intersection between leads L and R\nunder the left-right symmetry, N∩inv is the intersection\nbetween leads L and R under the inversion symmetry,\nand N∩UD:L (N∩UD:R) is the intersection of lead L (R)\nwith itself under the up-down symmetry. The final term\nin the square-bracket is the usual weak localization con-\ntribution.\nSince the presence of two of the above mentioned sym-\nmetries always implies the presence of the third, it is not\npossible to move the leads such that only one of the N∩\nparameters changes. Without affecting the integrity of\nthe leads there are only two possible modifications for\nwhich only two of the parameters change; starting with\nperfectly symmetric leads one can (a) move both leads\nupwards by the same amount so that N∩LR is unchanged,\nor (b) move both leads by the same amount in opposite\ndirections (one up and one down) so that N∩inv is un-\nchanged. In principle, it is also possible to break up a\nsingle lead (say L) in the middle and move the two parts\ninto opposite directions (both parts would still be con-\ntacted by the same source or drain electrode); this pre-\nserves N∩L and N∩R but affects the other parameters.\nHowever, the latter deformation is difficult to realize in\npractice.\nVII. UNIVERSAL CONDUCTANCE\nFLUCTUATIONS WITH DISPLACED LEADS\nNow we turn to the magnitude of universal conduc-\ntance fluctuations (UCFs) in symmetric dots with asym-\nmetric leads. Their calculation is generally far more com-\nplicated than the calculation of the average conductance.\nThis is illustrated by the fact that there is as yet no semi-\nclassical theory of UCFs for leads with tunnel barriers,\na problem which has many similarities to the problem\nwe need to solve here. Thus we restrict ourselves to the\nsimplest case of quantum dots with negligible Ehrenfest\n9U\nR− R U\nR− R\nL L\nU\nR− R\nU\nL− L\nR\nL\nU\nR− R U\nL− L\nL\nR\nL\nR\nL\nR\nU\nR− R\nL\nR\nL\nU\nL− L\nR\nL\nR\nU\nL− L\nR\nL\nR\nU\nR− R\nL\nR\nL\npath 2\nimage of\npath 1\nU\nL− L\nU\nL− L\nR\nR\npath 2\nimage of\npath 1\npath 2\nimage of\npath 1\npath 2\nimage of\npath 1\n(i)\n(ii)\n(iii)\n(iv)\nFigure 4: (colour online). A sketch of semiclassical contributions to UCFs (more specifically, contributions to covar[R,R′])\nfor an up-down symmetric dot with asymmetric leads. There are analogous contributions to UCFs for left-right or inversion-\nsymmetric dots (see explanation in the text). In each contribution, paths 1 and 1’ go from L lead to L lead, while paths 2\nand 2’ go from R lead to R lead. In the sketches, solid lines indicate paths 2 and the image (mirror image or image under\nthe inversion symmetry) of paths 1. Path 2’ and the image of path 1’ are indicated by the dashed lines (only shown at the\nencounters). Thus when paths 2 and 2’ are not paired with each other they are paired with the image of 1’ and 1 respectively\n(indicated by solid arrowheads). If the system has a time-reversal symmetry then path 2 and 2’ can also be paired with the\ntime-reverses of the image of 1’ and 1, respectively (indicated by the open arrowheads).\ntime and negligible dephasing, and only consider mag-\nnetic fields which are either negligibly small (B ≪ Bc),\nor sufficiently strong to break time-reversal symmetry in\nthe asymmetric system (B ≫ Bc).\nThe magnitude of the UCFs (with conductances mea-\nsured in units of e2\/h) is given by var[g] = var[T ], where\nT = tr[t†t] and t is the block of the scattering ma-\ntrix S =\n(\nr t′\nt r′\n)\nassociated with transmission from\nlead L to lead R. For practical calculations it is ben-\neficial to exploit the unitarity of the scattering matrix\n(i.e., current conservation), which results in the rela-\ntions T = NL − R = NR − R\n′ with R = tr[r†r] and\nR′ = tr[r′†r′], where r is the block of the scattering ma-\ntrix associated with reflection back to lead L, and r′ de-\nscribes reflection back to lead R. As a result we can write\nthe magnitude of the UCFs in any of the following ways,\nvar[g] = var[R] = var[R′] = covar[R,R′]. (28)\nAs for conventional UCFs without spatial symmetries\n[20, 21], the semiclassical calculation of covar[R,R′] is\nmost straight-forward, thus we base our calculations on\nthis quantity. For the expert reader, Appendix A con-\ntains an outline of the calculation of var[R] and var[R′],\nshowing that they equal covar[R,R′].\nAll symmetry-induced contributions to covar[R,R′] for\nan up-down symmetric dot are listed in Fig. 4. For a\nleft-right or inversion-symmetric dot there are additional\ncontributions, which are listed in Fig. 5. In all cases,\nwhen paths 2 and 2’ are not paired with each other, they\nare paired with the images of paths 1’ and 1 under the\nappropriate symmetry operation. To keep the sketches\nin Figs. 4 and 5 as clear as possible, we only show these\nimages of paths 1 and 1’ (rather than paths 1 and 1’\nthemselves). Then the resulting contributions look very\nmuch like the usual contributions to UCFs in a system\nwithout a spatial symmetry [20, 21].\nIn analogy to the situation in asymmetric systems,\none would also expect contributions in which paths wind\naround periodic orbits (see Figs. 1b,c in Ref. [21]). For\nexample, a symmetric quantum dot will have contribu-\ntions in which path 1’ is the same as path 1 except that\nit winds around a periodic orbit p when path 1 does not\n(thus path 1 must come very close to the periodic or-\n10\nU\nR−\nL\nU\nU\nL−\nR\nU\nR\nL\nU\nU\nL− L\nR\nU\npath 2\nimage of\npath 1\npath 2\nimage of\npath 1\nU\nR−\nL\nU\npath 2\nimage of\npath 1\nU\nU\npath 2\nimage of\npath 1\nR\nL\nU\n(v)\n(vi)\n(vii)\n(viii)\nFigure 5: (colour online). A sketch of additional semiclassical contributions to UCFs (more specifically, contributions to\ncovar[R,R′]) for left-right or inversion-symmetric dots with asymmetric leads. The contributions listed here must be added to\nthose listed in Fig. 4 (once one sets ∩L = ∩R = ∩) to get the full set of contributions for left-right or inversion-symmetric dots.\nThe manner in which the contributions are sketched is explained in the caption of Fig. 4.\nbit in phase space), while path 2 is the same as path\n2’ except that it winds around the image of the orbit p.\nThese contributions are proportional to those analyzed\nfor UCFs in asymmetric dots, the only modification be-\ning that the joint survival probability of a periodic orbit\nand its image is again changed to exp[−t\/τ ′D]. Drawing\non the results of Refs. [20, 21], it follows that the contri-\nbutions involving windings around periodic orbits will be\nnegligibly small when the Ehrenfest time is small. (This\nobservation makes the calculation of the UCFs in the\npresent problem significantly simpler than for the case\nwith tunnel barriers, where one cannot rule out contri-\nbutions from periodic orbits which touch the barriers on\nthe leads.)\nA. Effect of time-reversal symmetry\nInspecting the sketches in Figs. 4 and 5 we see that\nall contributions are doubled when the magnetic field is\nnegligible, because path 2 can either follow the image\nof path 1’ or the time-reverse of path 1’. Thus we can\nmultiple all terms by 2\/β, where β = 1 for a system with\nnegligible magnetic field, B ≪ Bc and β = 2 for a system\nwith a finite magnetic field, B ≫ Bc. In the latter case\nthe presence of mirror-reflection symmetries allows one\nto define a generalized time-reversal symmetry; however,\nthis is already accounted for in the construction of all\ndiagrams (see Appendix A of Ref. [1]).\nB. UCFs in an up-down symmetric dot\nThe general rules for constructing all contributions to\nthe UCFs are the following. Each segment where path\n2 or 2’ is paired with the image of path 1’ or 1 gives a\nfactor of (2NL+2NR−N∩L−N∩R)\n−1, which arises from\nthe survival time τUDD given in Eq. (22). Each segment\nwhere paths 2 and 2’ are paired (or paths 1 and 1’ are\npaired) gives a factor of (NL+NR)\n−1, which comes from\nthe conventional survival time τD. Each segment that\ntouches a lead gives a factor equal to the number of lead\nmodes that the path could couple to; i.e., a lead labelled\n“R − ∩R” gives a factor of (NR − N∩R), while a lead\nlabelled “R” simply gives a factor of NR. An encounter\nwhich touches a lead gives the same factor as a simple\npath-segment that touches a lead, so again if it is labelled\n“R − ∩R” then it gives a factor of (NR − N∩R) (this\nrule is proven by applying the same analysis as was used\nfor the successful and failed forward-scattering processes\nin Section IIIA.) Finally, encounters deep in the dot\n(i.e., those which do not touch the leads) give a factor of\n11\n−(2NL +2NR−N∩L−N∩R) (this rule can be proven by\napplying the same analysis as was used for the uniform\ncontributions to transmission in Section III B). With this\nset of rules we can easily see that contribution (i) in Fig.\n4 gives\nCi =\n2\nβ\nN2L(NR −N∩R)\n2 + 2NL(NL −N∩L)NR(NR −N∩R) + (NL −N∩L)\n2N2R\n(2NL + 2NR −N∩L −N∩R)2(NL +NR)2\n. (29)\nNext we see that Ciii = Cii, and that they are negative because only one of the encounters is deep in the dot (the\nother is near a lead), resulting in\nCii + Ciii = −2\n2\nβ\nN2LNR(NR −N∩R) +NL(NL −N∩L)N\n2\nR\n(2NL + 2NR −N∩L −N∩R)(NL +NR)3\n. (30)\nFinally Civ gives a positive contribution because it has\ntwo encounters deep in the dot, and is given by\nCiv =\n2\nβ\nN2LN\n2\nR\n(NL +NR)4\n. (31)\nThe total magnitude of the UCFs is given by the UCFs\nof an asymmetric dot, var[g]asym, plus the sum of the\nterms above, i.e., var[g] = var[g]asym+Ci+Cii+Ciii+Civ.\nIn the limit of perfectly symmetric leads (N∩L = NL and\nN∩R = NR), only Civ survives and the UCFs have double\nthe magnitude as those for an asymmetric dot. In the\nlimit of completely asymmetric leads (N∩L = N∩R = 0),\none has Ci +Cii +Ciii +Civ = 0, and the UCFs have the\nsame magnitude as those for an asymmetric dot.\nTo express var[g] for arbitraryNL, NR, N∩L, and N∩R,\nwe find it beneficial to introduce the quantities nκ =\nNκ\/(NL +NR) and wκ = 1 −N∩κ\/Nκ, where κ = L,R.\nMaking use of the fact that nL + nR = 1, we find\nvar[g] = var[g]asym (32)\n+\n2\nβ\nn2Ln\n2\nR\n(\n1− (1− nL)wL − (1− nR)wR\n1 + nLwL + nRwR\n)2\nwhere in this notation var[g]asym = (2\/β)n\n2\nLn\n2\nR. In the\nspecial case where NL = NR, displacing the leads sup-\npresses the symmetry-induced contribution to UCFs by\na factor\n[\n(2− wL − wR)\/(2 + wL + wR)\n]2\n.\nIn terms of the original quantities NL, NR, N∩L, and\nN∩R, Eq. (32) takes the form\nvar[g] = var[g]asym (33)\n+\n2\nβ\nN2LN\n2\nR\n(NL +NR)4\n(\nNRN∩L\/NL +NLN∩R\/NR\n2NL + 2NR −N∩L −N∩R\n)2\nwhere var[g]asym = (2\/β)N\n2\nLN\n2\nR(NL + NR)\n−4. Compar-\nison with Eq. (24) shows that lead displacement sup-\npresses the symmetry-induced contributions to UCFs by\na factor that is the square of the suppression of the\nsymmetry-induced contributions to the average conduc-\ntance.\nC. UCFs in a left-right or inversion-symmetric\nquantum dot\nFor a systems with a left-right or an inversion symme-\ntry, we once again find the magnitude of the UCFs by\nevaluating covar[R,R′]. For these symmetries, we must\nconsider the contributions in Fig. 5 in addition to those\nin Fig. 4. The origin of the extra contributions in Fig. 5\nis most clearly understood by considering the case of per-\nfectly symmetric leads. Then the left-right and inversion\nsymmetries map lead L onto lead R, which means that if\npath 2 is paired with path 1’ then path 2 will hit lead R\nwhen path 1’ hits lead L (meaning the image of path 1’\nhits lead R). One can thereby immediately see that the\ncontribution Cv in Fig. 5 contributes to covar[RL, RR]\n(this was not the case for up-down symmetry, since there\npath 1’ hits the same lead as the image of path 1’). For\nasymmetric leads a similar situation occurs. If path 1’\nhits the intersection region of width W∩ on lead L then\nits image hits lead R; thus path 2 will also hit lead R if\nit is paired with 1’ over this segment.\nThe rules to evaluate each contribution are the same\nas for up-down symmetry, with now necessarily N∩L =\nN∩R = N∩. Using these rules, we find that\nCv + Cvi =\n2\nβ\n4N∩NLNR −N\n2\n∩(NL +NR)\n(2NL +NR − 2N∩)2(NL +NR)\n, (34)\nCvii + Cviii = −\n2\nβ\n2N∩NLNR\n(2NL +NR − 2N∩)(NL +NR)2\n. (35)\nSumming these contributions and writing the result with\nthe same denominator as Eq. (33) gives\nCv + Cvi + Cvii + Cviii\n= −\n2\nβ\nN2∩(N\n2\nL −N\n2\nR)\n2\n(2NL +NR − 2N∩)2(NL +NR)4\n. (36)\nAdding this set of contribution to those already calcu-\nlated in the previous section, we find that the UCFs of\na left-right or inversion-symmetric dot with asymmetric\n12\nleads is given by\nvar[g] = var[g]asym\n+\n2\nβ\nN2LN\n2\nR\n(NL +NR)4\n(\nN∩\nNL +NR −N∩\n)2\n. (37)\nBy comparing this with Eq. (17), we find that the sup-\npression of symmetry-induced contributions to UCFs is\nthe square of suppression of the symmetry-induced con-\ntributions to the average conductance (just as we already\nfound for an up-down symmetric system).\nD. UCFs in a 4-fold symmetric\nFor completeness, we now briefly discuss UCFs in a 4-\nfold symmetric dot with asymmetric leads. A 4-fold dot\nhas all three of the symmetries discussed above. Thus\nthe UCFs in a four-fold symmetric system are given by\nthe sum of all possible symmetry-induced contributions\n(just as with symmetric leads [1]). Given the results in\nthe preceding sections, the general formula is easily de-\ntermined. Here we give the result for the special case\nNL = NR = N ,\nvar[g] =\n1\n8β\n[(\nN∩LR\n2N −N∩LR\n)2\n+\n(\nN∩inv\n2N −N∩inv\n)2\n+\n(\nN∩UD:L +N∩UD:R\n4N −N∩UD:L −N∩UD:R\n)2\n+ 1\n]\n(38)\nwhere N∩LR is the intersection between leads L and R\nunder the left-right symmetry, N∩inv is the intersection\nbetween leads L and R under the inversion symmetry,\nand N∩UD:L (N∩UD:R) is the intersection of lead L (R)\nwith itself under the up-down symmetry. The final term\nin the square-bracket represents the usual UCFs for an\nasymmetric dot.\nNote that the suppression of each symmetry-induced\nterm goes like the square of the equivalent term in the\naverage conductance, Eq. (27).\nVIII. COMPARISON TO RANDOM-MATRIX\nTHEORY\nIn this section we compare the semiclassical predictions\nderived in the previous sections to numerical results ob-\ntained from a phenomenological random-matrix model.\nThis model generalizes the construction discussed in Sec-\ntion 9 of part I (Ref. [1]).\nThe general framework is the same as in part I: The\nconductance is obtained from the Landauer formula g =\ntr[t†t], where t is the transmission block of a scattering\nmatrix S =\n(\nr t′\nt r′\n)\ngiven by\nS = PT (1− FQ)−1FP. (39)\nF\n1\n2\n3\n4\nFigure 6: Left panel: Model of a scatterer (central circle)\nwith internal evolution operator F , coupled to ports to which\nmodes of the leads can be attached. The labels identify four\nsegments, in which the ports are numerated in the direction of\nthe arrow (port 1 to M\/4 in segment 1, port M\/4+1 to M\/2\nin segment 2, port M\/2 + 1 to 3M\/4 in segment 3, and port\n3M\/4 + 1 to M in segment 4). The dashed lines indicate the\npossible lines of reflection symmetry. Middle and right panels:\nFilled circles indicate ports coupled to the left lead, shaded\ncircles indicate ports coupled to the right lead. Shown are a\nfully symmetry-respecting arrangement and an arrangement\nin which both leads are displaced, respectively.\nHere, F is an internal unitary evolution operator of di-\nmension M while P is an M × 2N dimensional matrix\nspecified below, and Q = 1− PPT .\nIn part I we assumed that the leads respect the geo-\nmetrical symmetries, which allows to fully desymmetrize\nthe system. One can then introduce a fixed form of the\nmatrix P and attribute the effects of symmetries solely to\nthe internal dynamics (the resulting RMT ensembles for\nF are given in Table 2 of Ref. [1]). It is clear that this full\ndesymmetrization fails when leads are to be displaced.\nFor up-down symmetry, for instances, desymmetrization\nidentifies two effectively separate systems (consisting of\nmodes of even and odd parity) which do not couple to\neach other. Shifting lead modes in this representation has\nno effect since RMT is invariant under the permutation\nof matrix indices. A real displacement of leads, however,\nmixes the states of even and odd parity. The reason for\nthis discrepancy is that leads are defined locally in real\nspace, while parity is a global symmetry which connects\nremote parts of the system.\nIt is therefore necessary to define both the internal evo-\nlution operator F as well as the coupling to the leads P\nin a way which resembles modes in a real-space basis. In\nprinciple, this can be done, e.g., based on the sinusoidal\ntransverse mode profiles of a strip resonator. We adopt\na similar, but more efficient procedure, whose principle\nidea is shown in Fig. 6. The illustration shows an abstract\nscatterer withM ports which serve as possible contacts to\nthe system. For each lead we select N ports (with index\nin for lead L and jn for lead R); the remaining ports are\nclosed off. The internal evolution operator F describes\nthe transport from port to port. The scattering matrix\nis then given by Eq. (39) where Pmn = δm,in + δm,jn−N .\nA crucial point of the illustration in Fig. 6 is the nu-\nmeration of ports, which are grouped into 4 segments\nthat map in specific ways onto each other when symme-\ntry operations are applied. (i) Left-right symmetry maps\n13\nB = 0 B ≫ Bc\nno spatial sym. COE(M) CUE(M)\nleft-right sym. A† COE2(M\/2) A A† COE(M) A\ninversion sym. DA† COE2(M\/2) AD DA† CUE2(M\/2) AD\nup-down sym. CA† COE2(M\/2) AC CA† COE(M) AC\nfour-fold sym. DA†[A† COE2(M\/4) A]2AD DA† [A† COE(M\/2) A]2AD\nwith A = 2−1\/2\n \n1 1\ni −i\n!\n, C =\n0\nBBB@\n1 0 0 0\n0 0 1 0\n0 1 0 0\n0 0 0 1\n1\nCCCA and D =\n0\nBBB@\n1 0 0 0\n0 1 0 0\n0 0 0 1\n0 0 1 0\n1\nCCCA\nTable I: Random-matrix ensembles for the internal evolution operator F in a basis which is suitable for displacing the leads\n(see Fig. 6). The different entries refer to various geometric symmetries in absence or presence of a magnetic field. We only\nconsider the case M mod 4 = 0. Block composition of two identical matrix ensembles of dimension M is abbreviated as\nX2(M) = X(M) ⊗X(M).\nsegment 1 onto segment 3 and segment 2 onto segment\n4. (ii) Up-down symmetry maps segment 1 onto segment\n2 and segment 3 onto segment 4. (iii) Inversion symme-\ntry maps segment 1 onto segment 4 and segment 2 onto\nsegment 3. (iv) Four-fold symmetry maps all segments\nonto each other.\nIn the basis of these ports, the explicit symmetries of\nthe internal evolution operator F are specified in Table\nI. Since up-down and left-right symmetry are both man-\nifestations of a reflection symmetry, they are now simply\nrelated by a interchanging segments 2 and 3 (as described\nby the matrix C defined in Table I); this is a consequence\nof the fact that we do not fully desymmetrize the up-\ndown symmetry (the left-right symmetric case can never\nbe fully desymmetrized because one has to keep track of\nthe identity of the leads). A finite magnetic field breaks\nthese symmetries, but still allows one to define a gen-\neralized time-reversal symmetry. Similarly, for vanish-\ning magnetic field, inversion symmetry is obtained from\nreflection symmetry by interchanging segments 3 and 4\n(as described by the matrix D defined in the table cap-\ntion). The slightly different systematics in the presence\nof a magnetic field arises because the orientation of the\nsegments matters; consequently, for inversion symmetry,\ntime-reversal symmetry is effectively broken but the ge-\nometric symmetry itself is still present in the dynamics\n(trajectories still occur in symmetry-related pairs).\nA convenient choice of a fully symmetry-respecting ar-\nrangement of leads which applies to all internal symme-\ntries is given by\nP =\n\n\n1N×N 0N×N 0N×N 0N×N\n0M×N 0M×N 0M×N 0M×N\n0N×N 1N×N 0N×N 0N×N\n0M×N 0M×N 0M×N 0M×N\n0N×N 0N×N 1N×N 0N×N\n0M×N 0M×N 0M×N 0M×N\n0N×N 0N×N 0N×N 1N×N\n0M×N 0M×N 0M×N 0M×N\n\n\n, (40)\nwhere N = N\/2 and M = M\/4 − N\/2. The case of\na four-fold symmetry in principle allows two symmetry-\nrespecting arrangements (aligned along each of the two\nsymmetry lines of reflection); these two arrangements are\nequivalent in RMT and again related by a reshuffling of\nthe 4 segments. The form of P for generally placed leads\nis easily read off Fig. 6.\nFigures 7 (for B ≪ Bc) and 8 (for B ≫ Bc) show\nhow the weak localization correction and universal con-\nductance fluctuations are affected when the leads are\nmoved away from the symmetry-respecting positions.\nThe degree of displacement is quantified by a variable\nλ = 1 −W∩\/W (λ = 0 in the symmetric arrangement,\nλ = 1 in the asymmetric arrangement). The data points\nare based on an ensemble average over 5000 RMT ma-\ntrices with M = 1000 and N = 50, while the curves are\nthe predictions of our semiclassical theory, which can be\nwritten as\nδg(λ) = δg(1) + [δg(0)− δg(1)]\n1− λ\n1 + λ\n, (41)\nvarg(λ) = varg(1)+ [varg(0)−varg(1)]\n(\n1− λ\n1 + λ\n)2\n. (42)\nStarting from a four-fold symmetry, leads can be dis-\nplaced in a manner which still preserves left-right, inver-\nsion, or up-down symmetry. To preserve up-down sym-\nmetry alone, one can imagine splitting one lead in two\n14\n-0.5\n-0.25\n 0\n 0.25\n 0.5\n 0  0.2  0.4  0.6  0.8  1\n \n〈 δ\n \ng \n〉 \nλ\nWL for displaced leads, B=0\nfourfold → up\/down4\nfourfold → left\/right4 or inversion4\n 0\n 0.1\n 0.2\n 0.3\n 0.4\n 0.5\n 0  0.2  0.4  0.6  0.8  1\nv\nar\n [g\n]\nλ\nUCF for displaced leads, B=0\nfourfold → up\/down4\nfourfold → left\/right4 or inversion4\n-0.5\n-0.25\n 0\n 0.25\n 0.5\n 0  0.2  0.4  0.6  0.8  1\n \n〈 δ\n \ng \n〉 \nλ\nWL for displaced leads, B=0\nup\/down4 → asymmetric4\nleft\/right4 or inversion4 → asymmetric4\n 0\n 0.1\n 0.2\n 0.3\n 0  0.2  0.4  0.6  0.8  1\nv\nar\n [g\n]\nλ\nUCF for displaced leads, B=0\nup\/down4  → asymmetric4\nleft\/right4  or inversion4  → asymmetric4\n-0.5\n-0.25\n 0\n 0.25\n 0.5\n 0  0.2  0.4  0.6  0.8  1\n \n〈 δ\n \ng \n〉 \nλ\nWL for displaced leads, B=0\n up\/down → asymmetric\n left\/right  or inversion → asymmetric\n 0\n 0.1\n 0.2\n 0.3\n 0  0.2  0.4  0.6  0.8  1\nv\nar\n [g\n]\nλ\nUCF for displaced leads, B=0\n up\/down → asymmetric\n left\/right or inversion → asymmetric\nFigure 7: (colour online). Weak localization correction (WL, left panels) and universal conductance fluctuations (UCF, right\npanels) as a function of the displacement of both leads from their symmetry-respecting positions for systems with fixed internal\nsymmetry. The displacement is measured in terms of λ = 1−W∩\/W . The data points (circles with a variety of filling styles)\nare obtained from an average over 5000 realizations of the RMT model described in the text (M = 1000, N = 50). The curves\nshow the semiclassical prediction (41) for WL and (42) for UCF. Labels ‘A→ B’ specify the symmetry of the lead arrangement\nat λ = 0 (symmetric arrangement) and λ = 1 (where at least one of the symmetries is fully removed). In these labels, the\nsubscript 4 on A or B indicates that the internal symmetry is four-fold; if this subscript is not present the internal symmetry\nis identical to the one specified by A. In this figure, the magnetic field is set to B = 0.\nand moving the two parts in opposite directions (both\nparts would remain contacted to the same source or drain\nelectrode). The remaining symmetry of the lead arrange-\nment can then be broken by further displacement of the\nleads. In the figures, the subscript 4 is used to distinguish\nthese situations (in which the underlying internal sym-\nmetry is four-fold) from the symmetry breaking in sys-\ntems with only a single internal symmetry. E.g., the label\n‘left\/right4 → asymmetric4’ refers to the displacement of\nleads out of a left-right symmetric position where the in-\nternal symmetry is four-fold, while the label ‘left\/right\n→ asymmetric’ refers to the displacement of leads out of\na left-right symmetric position where the internal sym-\nmetry is itself only left-right symmetric. According to\nour theory, the weak localization correction should be-\nhave identically in both situations; this also applies to\nthe UCFs. This statement is validated by the numerical\ndata. Indeed, excellent agreement of the numerical data\nwith the semiclassical predictions is observed in all cases.\nAs discussed earlier in this paper, in the up-down sym-\nmetric case it is interesting to displace only one lead\nwhile the other lead remains on the symmetry line (the\n15\n-0.5\n-0.25\n 0\n 0.25\n 0.5\n 0  0.2  0.4  0.6  0.8  1\n \n〈 δ\n \ng \n〉 \nλ\nWL for displaced leads, finite B\nfourfold → up\/down4\nfourfold → left\/right4\nfourfold → inversion4\n 0\n 0.1\n 0.2\n 0.3\n 0  0.2  0.4  0.6  0.8  1\nv\nar\n [g\n]\nλ\nUCF for displaced leads, finite B\nfourfold → up\/down4\nfourfold → left\/right4\nfourfold → inversion4\n-0.5\n-0.25\n 0\n 0.25\n 0.5\n 0  0.2  0.4  0.6  0.8  1\n \n〈 δ\n \ng \n〉 \nλ\nWL for displaced leads, finite B\nup\/down4 → asymmetric4\nleft\/right4 → asymmetric4\ninversion4 → asymmetric4\n 0\n 0.1\n 0  0.2  0.4  0.6  0.8  1\nv\nar\n [g\n]\nλ\nUCF for displaced leads, finite B\nup\/down4 → asymmetric4\nleft\/right4 → asymmetric4\ninversion4 → asymmetric4\n-0.5\n-0.25\n 0\n 0.25\n 0.5\n 0  0.2  0.4  0.6  0.8  1\n \n〈 δ\n \ng \n〉 \nλ\nWL for displaced leads, finite B\nup\/down → asymmetric\nleft\/right → asymmetric\ninversion → asymmetric\n 0\n 0.1\n 0  0.2  0.4  0.6  0.8  1\nv\nar\n [g\n]\nλ\nUCF for displaced leads, finite B\nup\/down → asymmetric\nleft\/right → asymmetric\ninversion → asymmetric\nFigure 8: (colour online). Same as Fig. 7, but for a finite magnetic field.\nsymmetry-preserving positions in the up-down symmet-\nric case are absolute, in contrast to the left-right sym-\nmetric case where these positions are relative to each\nother). The effect on the transport is shown in Fig. 9,\nalong with the effect of the consecutive displacement of\nthe second lead, and the simultaneous displacement of\nboth leads. According to our theory, the effects of con-\nsecutive displacement of the leads are cumulative: The\ndisplacement of the first lead is described by Eqs. (41),\n(42) with λ→ λ\/2 (covering the range [0,1\/2]), while the\ndisplacement of the second lead completes the transition\naccording to the substitution λ → (1 + λ)\/2 (covering\nthe range [1\/2,1]). The numerical results are in perfect\nagreement with this prediction.\nWe conclude with some additional remarks on the\nRMT model. For leads which respect the symmetries, the\nconstruction presented here is equivalent to the model\npresented in part I (which then is more efficient); this\nequivalence also extends to the symmetry breaking in the\ninternal dynamics, which then requires to interpolate be-\ntween ensembles of Table I. Following earlier works, the\nRMT model can be further utilized to include the effects\nof dephasing and a finite Ehrenfest time. For dephas-\ning, this is achieved by opening additional ports which\ncouple to a voltage probe [26] or a dephasing stub [27].\nA finite Ehrenfest time is obtained when F represents a\ndynamical system, such as the kicked rotator [12] (which\nalso possesses discrete symmetries). This strategy can\nalso be used to probe the case of dynamics which are not\nfully chaotic (which in the kicked rotator is achieved for\nmoderate values of the kicking strength).\n16\n-0.4\n-0.2\n 0\n 0.2\n 0  0.2  0.4  0.6  0.8  1\n \n〈 δ\n \ng \n〉 \nλ\nWL for breaking of up-down symmetry, B=0\n ud → asym\n ud → ud in one lead\n ud in one lead → asym\n 0\n 0.1\n 0.2\n 0.3\n 0.4\n 0  0.2  0.4  0.6  0.8  1\nv\nar\n [g\n]\nλ\nUCF for breaking of up-down symmetry, B=0\n ud → asym\n ud → ud in one lead\n ud in one lead → asym\n-0.2\n-0.1\n 0\n 0.1\n 0  0.2  0.4  0.6  0.8  1\n \n〈 δ\n \ng \n〉 \nλ\nWL for breaking of up-down symmetry, finite B\n ud → asym\n ud → ud in one lead\n ud in one lead → asym\n 0\n 0.1\n 0.2\n 0  0.2  0.4  0.6  0.8  1\nv\nar\n [g\n]\nλ\nUCF for breaking of up-down symmetry, finite B\n ud → asym\n ud → ud in one lead\n ud in one lead → asym\nFigure 9: (colour online). Same as Figs. 7 and 8, but comparing the displacement of both leads for internal up-down symmetry\n(solid circles) to the displacement of the first lead (circles filled on the right), followed by the displacement of the second lead\n(circles filled on the left).\nIX. CONCLUDING REMARKS\nThe transport calculations performed here assume that\nthe classical dynamics is uniformly chaotic, and in par-\nticular do not apply to system with islands of stability in\nphase space (such as the annular billiard studied in Refs.\n[28, 29]), or networks of chaotic dots inter-connected by\nnarrow leads (such as the double dot in Ref. [7]). It\nwould be intriguing to study the shape of the back- and\nforward-scattering peaks for such systems.\nX. ACKNOWLEDGEMENTS\nRW thanks P. Brouwer, P. Marconcini and M. Macucci\nfor interesting and useful discussions. RW and HS are\ngrateful for the hospitality of the Banff International Re-\nsearch Station, where this work was initiated.\nAppendix A: OBTAINING UCFS FROM THE\nVARIANCE OF REFLECTION\nIn Section VII we pointed out that unitarity implies\ncovar[RL, RR] = var[RL] = var[RR]. Here we outline a\nsemiclassical calculation of var[RL], which acts as a check\nof the semiclassical calculation of covar[RL, RR] in Sec-\ntion VII. The rules to calculate each contribution remain\nthe same as for covar[RL, RR]. However, the contribu-\ntions that we consider differ by the requirement that all\npaths start and end on the same lead L.\nWe know that the result must be invariant under the\ninterchange of labels “L” and “R”, and this invariance is\nmanifestly obvious in the contributions to covar[RL, RR].\nIn contrast, this invariance is hidden in the contributions\nto var[RL] that we discuss here. Thus the simplest check\nthat one has not missed any contributions is that this\ninvariance is present when one sums the contributions.\n1. Up-down symmetric dot\nIn the case of an up-down symmetric dot, all contribu-\ntions in both Fig. 4 and Fig. 5 contribute to var[RL] once\nwe change all lead labels so that “R” → “L” and “∩R”\n→ “∩L” (but not vice versa). Writing contributions to\nvar[RL] with a ”prime”(to distinguish them from contri-\nbutions to covar[RL, RR\n17\nC′v + C\n′\nvi + C\n′\ni =\n2\nβ\nN2∩L(NL +NR)\n2 + 4N∩L(NL −N∩L)NL(NL +NR) + 4(NL −N∩L)\n2N2L\n(2NL + 2NR −N∩L −N∩R)2(NL +NR)2\n, (A1)\nC′vii + C\n′\nviii + C\n′\nii + C\n′\niii = −\n2\nβ\n2N2L\n[\nN∩L(NL +NR) + 2(NL −N∩L)NL\n]\n(2NL + 2NR −N∩L −N∩R)(NL +NR)3\n, (A2)\nC′iv =\n2\nβ\nN4L\n(NL +NR)4\n. (A3)\nAs in section VII, we find that this sum is most eas-\nily evaluated by re-writing the contributions in terms\nnκ = Nκ\/(NL+NR) and wκ = 1−N∩κ\/Nκ for κ = L,R.\nPerforming a little algebra using nL + nR = 1, we then\nrecover Eq. (32), and therefore var[RL] = covar[RL, RR].\nFurthermore, expression Eq. (32) is invariant under\nthe interchange of labels “L” and “R”, which entails\nvar[RR] = var[RL]. Thus the semiclassical method obeys\nthe relations var[RL] = var[RR] = covar[RL, RR], as re-\nquired by the unitarity of the scattering matrix. This\nstrongly suggests that we have not missed any contribu-\ntions and gives us confidence in the result; particularly, it\nis noteworthy that the individual contributions in var[RL]\nand covar[RL, RR] combine in very different ways to give\nthe invariance under the interchange of “L” and “R”.\n2. Left-right or inversion-symmetric dot\nThe evaluation of var[RL] for a left-right or inversion-\nsymmetric dot is very similar to that for an up-down\nsymmetric dot. However, here, when a path hits the L\nlead then its image hits the R lead. This means that\nthere are no contributions to var[RL] of the form shown\nin Fig. 5, since all paths must go from the L lead to the\nL lead. Thus to get var[RL] for a left-right or inversion-\nsymmetric dot, we need to subtract those contributions\nfrom the result for var[RL] in an up-down symmetric dot.\nThe sum of these contributions to var[RL], written with\nthe same denominator as in Eq. (33), is\nC′v + C\n′\nvi + C\n′\nvii + C\n′\nviii\n=\n2\nβ\nN2∩(N\n2\nL −N\n2\nR)\n2\n(2NL +NR − 2N∩)2(NL +NR)4\n. (A4)\nThis only differs by an overall sign from the sum of con-\ntributions in Eq. (36). Subtracting this from the result\nEq. (33), we get var[RL] for a left-right or inversion-\nsymmetric dot. The result equals covar[RL, RR] given\nby Eq. (37), thus we have covar[RL, RR] = var[RL] =\nvar[RR], as required by the unitarity of the scattering\nmatrix.\n[1] R. S. Whitney, H. Schomerus, and M. Kopp, preprint\narXiv:0906.0891.\n[2] H. U. Baranger and P. A. Mello, Phys. Rev. B 54, R14297\n(1996).\n[3] V. A. Gopar, M. Mart´ınez, P. A. Mello, and H. U.\nBaranger, J. Phys. A: Math. Gen. 29 881 (1996).\n[4] V. A. Gopar, S. Rotter, and H. Schomerus, Phys. Rev. B\n73, 165308 (2006).\n[5] M. Kopp, H. Schomerus, and S. Rotter Phys. Rev. B 78,\n075312 (2008).\n[6] M. Mart´ınez and P.A. Mello, Phys. Rev. E 63, 016205\n(2000).\n[7] R. S. Whitney, P. Marconcini, and M. Macucci, Phys.\nRev. Lett. 102, 186802 (2009).\n[8] R. S. Whitney, P. Marconcini, and M. Macucci, in prepa-\nration.\n[9] R. Berkovits and S. Feng, Phys. Rep. 238, 135 (1994).\n[10] M. P. Van Albada and A. Lagendijk, Phys. Rev. Lett.\n55, 2692 (1985); P.-E. Wolf and G. Maret, Phys. Rev.\nLett. 55, 2696 (1985).\n[11] C. W. J. Beenakker, Rev. Mod. Phys. 69, 731 (1997).\n[12] H. Schomerus and Ph. Jacquod, J. Phys. A 38, 10663\n(2005).\n[13] H. U. Baranger, D. P. DiVincenzo, R. A. Jalabert, and\nA. D. Stone, Phys. Rev. B 44,10637 (1991).\n[14] H. U. Baranger, R. A. Jalabert, and A. D. Stone, Chaos\n3, 665 (1993).\n[15] Ph. Jacquod and R. S. Whitney, Phys. Rev. B 73, 195115\n(2006).\n[16] I. L. Aleiner and A. I. Larkin, Phys. Rev. B 54, 14423\n(1996).\n[17] K. Richter and M. Sieber, Phys. Rev. Lett. 89, 206801\n(2002).\n[18] S. Heusler, S. Mu¨ller, P. Braun, and F. Haake, Phys. Rev.\nLett. 96, 066804 (2006).\n[19] S. Rahav and P.W. Brouwer, Phys. Rev. Lett. 96, 196804\n(2006).\n[20] P. W. Brouwer and S. Rahav, Phys. Rev. B 74, 075322\n(2006).\n[21] P. W. Brouwer and S. Rahav, Phys. Rev. B 75,\n201303(R) (2007).\n[22] R. S. Whitney, Phys. Rev. B 75, 235404 (2007).\n[23] The fact that the paths in contributions 2i-iv reflect back\ninto the dot slightly changes the action difference be-\n18\ntween them. It was shown in the context of failed coherent\nbackscattering that this change of the action difference\nis irrelevant [22].\n[24] M. Sieber and K. Richter, Phys. Scr. T90, 128 (2001);\nM. Sieber, J. Phys. A: Math. Gen. 35, L613 (2002).\n[25] This is rather different from the weak localization correc-\ntion with tunnel barriers [22]. There the survival proba-\nbility is only different near the encounter, which leads to\nan extra prefactor of the ratio of dwell times (of the form\nτD1\/τD2). There is no such extra prefactor here.\n[26] M. Bu¨ttiker, Phys. Rev. B 33, 3020 (1986).\n[27] P. W. Brouwer, K. M. Frahm, and C. W. J. Beenakker,\nWaves Random Media 9, 91 (1999).\n[28] H. Schomerus and C. W. J. Beenakker, Phys. Rev. Lett.\n82, 2951 (1999).\n[29] H.-S. Sim and H. Schomerus, Phys. Rev. Lett. 89, 066801\n(2002).\n"}