{"doi":"10.1016\/j.funeco.2008.07.001","coreId":"138607","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/3164","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/3164","10.1016\/j.funeco.2008.07.001"],"title":"Effect of solute and matric potential on in vitro growth and sporulation of strains from a new population of Aspergillus flavus isolated in Italy.","authors":["Giorni, Paola","Battilani, Paola","Magan, Naresh"],"enrichments":{"references":[{"id":38066098,"title":"Aflatoxin in maize.","authors":[],"date":"1992","doi":"10.1080\/07352689209382320","raw":"Payne GA, 1992. Aflatoxin in maize. Critical Reviews in Plant Science, 423.","cites":null},{"id":38066090,"title":"Ecological determinants for germination and growth of some Aspergillus and Penicillium spp. from maize grain.","authors":[],"date":"1998","doi":"10.1046\/j.1365-2672.1997.00297.x","raw":"Marin S, Sanchis V, Sàenz R, Ramos AJ, Vinas I, Magan N, 1998. Ecological determinants for germination and growth of some Aspergillus and Penicillium spp. from maize grain. Journal of Applied Microbiology 84: 25-36.","cites":null},{"id":38066085,"title":"Ecology of the aspergilli of soil and litter.","authors":[],"date":"1994","doi":null,"raw":"Klich MA, Tiffany LH, and Knaphus G, 1994. Ecology of the aspergilli of soil and litter. Aspergillus. In: MA Butterworth-Heineman (Ed.), Biology and Industrial Applications, Boston.","cites":null},{"id":38066084,"title":"Effect of incubation time, temperature and substrate on growth and aflatoxin production.","authors":[],"date":"1992","doi":"10.1016\/0964-8305(92)90021-f","raw":"Kheiralla ZH, Hassanin NI, Amra H, 1992. Effect of incubation time, temperature and substrate on growth and aflatoxin production. International Biodeterioration Biodegradation 30: 17-27.","cites":null},{"id":38066104,"title":"Effect of temperature, water activity and other toxigenic mold species on growth of Aspergillus flavus and aflatoxin production on corn, pinto beans and soybeans.","authors":[],"date":"1988","doi":null,"raw":"Trucksess M, Stoloff L, Mislivec P, 1988. Effect of temperature, water activity and other toxigenic mold species on growth of Aspergillus flavus and aflatoxin production on corn, pinto beans and soybeans. Journal of Food Protection 51: 361-363.","cites":null},{"id":38066087,"title":"Effect of water potential and temperature on spore germination and germ-tube growth in vitro and on straw leaf sheaths.","authors":[],"date":"1988","doi":"10.1016\/s0007-1536(88)80185-2","raw":"Magan N, 1988. Effect of water potential and temperature on spore germination and germ-tube growth in vitro and on straw leaf sheaths. Transactions of the British Mycology Society 90: 97-107.","cites":null},{"id":38066105,"title":"Effects of nutrient status and water potential of media on fungal growth and antagonist-pathogen interactions.","authors":[],"date":"1987","doi":"10.1111\/j.1365-2338.1987.tb00078.x","raw":"Whipps JM, Magan N, 1987. Effects of nutrient status and water potential of media on fungal growth and antagonist-pathogen interactions. EPPO Bulletin 17: 581-591.15","cites":null},{"id":38066101,"title":"Emerging issues in Southern Europe: aflatoxins in Italy. In: Barug","authors":[],"date":"2006","doi":null,"raw":"Piva G, Battilani P, Pietri A, 2006. Emerging issues in Southern Europe: aflatoxins in Italy. In: Barug D, Bhatnagar D, van Egmong HP, van der Kamp JW, van Osenbruggen WA, Visconti A (eds), The mycotoxin factbook. Wageningen Academic Publisher, The Netherlands, 139-153.","cites":null},{"id":38066103,"title":"Environmental conditions affecting mycotoxins.","authors":[],"date":"2004","doi":"10.1533\/9781855739086.2.174","raw":"Sanchis V, Magan N, 2004. Environmental conditions affecting mycotoxins. In: Magan N, Olsen M (eds), Mycotoxins in food. pp. 174-189.","cites":null},{"id":38066077,"title":"Fungal growth responses to osmotic as compared to matric water potential.","authors":[],"date":"1971","doi":"10.2136\/sssaj1971.03615995003500030038x","raw":"Adebayo AA, Harris RF, 1971. Fungal growth responses to osmotic as compared to matric water potential. Soil Science Society American Journal 35: 465-469.","cites":null},{"id":38066078,"title":"Modelling Fusarium verticillioides infection and fumonisin synthesis in maize ears.","authors":[],"date":"2003","doi":null,"raw":"Battilani P, Rossi V, Pietri A, 2003. Modelling Fusarium verticillioides infection and fumonisin synthesis in maize ears. Aspects of Applied Biology 68: 91-100.","cites":null},{"id":38066102,"title":"Osmotic and matric potential effects on growth, sclerotia and partitioning of polyols and sugars in colonies and spores of Aspergillus ochraceus.","authors":[],"date":"1999","doi":"10.1017\/s0953756298006819","raw":"Ramos AJ, Magan N, Sanchis V, 1999. Osmotic and matric potential effects on growth, sclerotia and partitioning of polyols and sugars in colonies and spores of Aspergillus ochraceus. Mycological Research 103: 141-147.14 Rossi V, Scandolara A, Battilani P, 2008. Effect of environmental conditions on spore production by Fusarium verticillioides, the causal agent of maize ear rot. European Journal of Plant Pathololgy, available online.","cites":null},{"id":38066086,"title":"Osmotic coefficients and water potentials of sodium chloride solutions from 0-40°C.","authors":[],"date":"1967","doi":"10.1071\/ch9672017","raw":"Lang ARG, 1967. Osmotic coefficients and water potentials of sodium chloride solutions from 0-40°C. Australian Journal of Chemistry 20: 2017-2023.12 Lee HB, Magan N, 1999. Environment factors influence in vitro interspecific interactions between A. ochraceus and other maize spoilage fungi, growth and ochratoxin production. Mycopathologia 146: 43-47.","cites":null},{"id":38066088,"title":"Osmotic, matric and temperature effects on in vitro growth of isolates of Agaricus bisporus and A.bitorquis.","authors":[],"date":"1995","doi":null,"raw":"Magan N, Challen MP, Elliot TJ, 1995. Osmotic, matric and temperature effects on in vitro growth of isolates of Agaricus bisporus and A.bitorquis. In: Elliot, T.J. (ed.), Science and technology of edible mushrooms. Rotterdam, Balkemaar, pp. 773-780.","cites":null},{"id":38066100,"title":"Process of contamination by aflatoxin-producing fungi and their impact on crops. In: Sinha KK, Bhatnagar D (eds), Mycotoxins in agriculture and food safety.","authors":[],"date":"1998","doi":null,"raw":"Payne GA, 1998. Process of contamination by aflatoxin-producing fungi and their impact on crops. In: Sinha KK, Bhatnagar D (eds), Mycotoxins in agriculture and food safety. New York: Marcel Dekker, Inc. pp. 279-306.","cites":null},{"id":38066094,"title":"Relationship between aflatoxin synthesis and Aspergillus flavus development.","authors":[],"date":"2005","doi":null,"raw":"Mostafa ME, Barakat A, El Shanawany AA, 2005. Relationship between aflatoxin synthesis and Aspergillus flavus development. African Journal of Mycology and Biotechnology 13: 35-51.13 Nesci A, Etcheverry M, Magan N, 2004. Osmotic and matric potential effects on growth, sugar alcohol and sugar accumulation by Aspergillus section Flavi strains from Argentina. Journal of Applied Microbiology 96: 965-972.","cites":null},{"id":38066081,"title":"Relationship between secondary metabolism and fungal development.","authors":[],"date":"2002","doi":"10.1128\/mmbr.66.3.447-459.2002","raw":"Calvo AM, Wilson RA, Bok JW, Keller NP, 2002. Relationship between secondary metabolism and fungal development. Microbiological Molecular Biological Reviews 66: 447-459.11 Dallyn H, Fox A, 1980. Spoilage of material of reduced water activity by xerophilic fungi. In: Gould GH, Corry JEL (eds), Society of Applied Bacteriology Techincal Series no. 15, pp. 129-139.","cites":null},{"id":38066082,"title":"Role of water in solid substrate fermentation.","authors":[],"date":"2003","doi":"10.1016\/s1369-703x(02)00122-5","raw":"Gervais P, Molin P, 2003. Role of water in solid substrate fermentation. Biochemical Engineering Journal 13: 85-101.","cites":null},{"id":38066080,"title":"Signalling pathways connecting mycotoxin production and sporulation.","authors":[],"date":"2006","doi":"10.1111\/j.1364-3703.2006.00338.x","raw":"Brodhagen M, Keller NP, 2006. Signalling pathways connecting mycotoxin production and sporulation. Molecular Plant Pathology 7: 285-301.","cites":null},{"id":38066083,"title":"Studies on Aspergillus Section Flavi isolated in northern Italy from maize.","authors":[],"date":"2006","doi":"10.1016\/j.ijfoodmicro.2006.09.007","raw":"Giorni P, Magan N, Pietri A, Bertuzzi T, Battilani P, 2006. Studies on Aspergillus Section Flavi isolated in northern Italy from maize. International Journal of Food Microbiology 113: 330-338.","cites":null},{"id":38066079,"title":"The effect of temperature and water potential on growth rates of wood rotting basidiomycetes.","authors":[],"date":"1983","doi":"10.1016\/s0007-1536(83)80175-2","raw":"Boddy, L, 1983. The effect of temperature and water potential on growth rates of wood rotting basidiomycetes. Transactions of the British Mycological Society 80: 141-149.","cites":null},{"id":38066092,"title":"The osmotic potential of polyethylene glycol 6000.","authors":[],"date":"1973","doi":"10.1104\/pp.51.5.914","raw":"Michel BE, Kaufmann MR, 1973. The osmotic potential of polyethylene glycol 6000. Plant Physiology 51: 914-916.","cites":null},{"id":38066096,"title":"Water activity, solute and temperature modify growth and spore production of wild type and genetically engineered Aspergillus niger strains.","authors":[],"date":"2004","doi":"10.1016\/j.enzmictec.2004.04.012","raw":"Parra R, Aldred DA, Archer DA, Magan N, 2004. Water activity, solute and temperature modify growth and spore production of wild type and genetically engineered Aspergillus niger strains. Enzyme and Microbial Technology 35: 232-237.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-05","abstract":"The effect of temperature and different solute (Ψs) and matric potentials (Ψm) on growth and sporulation of three aflatoxigenic strains of Aspergillus flavus isolated from contaminated maize in northern Italy was determined. The Ψs of maize-based media were modified ionically (NaCl) and non-ionically (glycerol) and the Ψm with PEG 8000 in the range −1.4 to −21.0 MPa at 25 and 30 °C. Both temperature and Ψs\/Ψm stress had statistically significant effects on growth rates of the three strains. Faster growth occurred at 30 °C and −1.4 and −2.8 MPa. A. flavus strains were more sensitive to Ψm than Ψs stress with limits of −9.8 MPa and −14 to−18 MPa, respectively. Sporulation was significantly influenced by Ψs potential, solute type and temperature. This suggests that these aflatoxigenic strains of A. flavus isolated from aflatoxin-contaminated maize are probably able to colonise crop debris rapidly at prevailing temperatures and water stress conditions. This type of information on the ecology of aflatoxin producing A. flavus strains isolated in Italy will contribute to the development of a systems model to predict their activity in crop residue and colonisation of maize grain","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/138607.pdf","fullTextIdentifier":"https:\/\/dspace.lib.cranfield.ac.uk\/bitstream\/1826\/3164\/1\/Effect%20of%20solute%2c%20matric%20potential%20and%20temperature%20on%20in%20vitro%20growth-Aspergillus%20flavus-2008.pdf","pdfHashValue":"49ca806a588ac148f8b8247a56953ec6c7151634","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/3164<\/identifier><datestamp>2009-02-11T16:34:48Z<\/datestamp><setSpec>hdl_1826_2005<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Effect of solute and matric potential on in vitro growth and sporulation of strains from a new population of Aspergillus flavus isolated in Italy.<\/dc:title><dc:creator>Giorni, Paola<\/dc:creator><dc:creator>Battilani, Paola<\/dc:creator><dc:creator>Magan, Naresh<\/dc:creator><dc:subject>Aspergillus flavus<\/dc:subject><dc:subject>Fungal growth<\/dc:subject><dc:subject>Sporulation<\/dc:subject><dc:subject>Temperature<\/dc:subject><dc:subject>Water potential<\/dc:subject><dc:description>The effect of temperature and different solute (Ψs) and matric potentials (Ψm) on growth and sporulation of three aflatoxigenic strains of Aspergillus flavus isolated from contaminated maize in northern Italy was determined. The Ψs of maize-based media were modified ionically (NaCl) and non-ionically (glycerol) and the Ψm with PEG 8000 in the range −1.4 to −21.0 MPa at 25 and 30 °C. Both temperature and Ψs\/Ψm stress had statistically significant effects on growth rates of the three strains. Faster growth occurred at 30 °C and −1.4 and −2.8 MPa. A. flavus strains were more sensitive to Ψm than Ψs stress with limits of −9.8 MPa and −14 to−18 MPa, respectively. Sporulation was significantly influenced by Ψs potential, solute type and temperature. This suggests that these aflatoxigenic strains of A. flavus isolated from aflatoxin-contaminated maize are probably able to colonise crop debris rapidly at prevailing temperatures and water stress conditions. This type of information on the ecology of aflatoxin producing A. flavus strains isolated in Italy will contribute to the development of a systems model to predict their activity in crop residue and colonisation of maize grain.<\/dc:description><dc:publisher>Elsevier<\/dc:publisher><dc:date>2009-02-11T16:34:48Z<\/dc:date><dc:date>2009-02-11T16:34:48Z<\/dc:date><dc:date>2008-05<\/dc:date><dc:type>Postprint<\/dc:type><dc:identifier>Paola Giorni, Paola Battilani, Naresh Magan, Effect of solute and matric potential on in vitro growth and sporulation of strains from a new population of Aspergillus flavus isolated in Italy, Fungal Ecology, Volume 1, Issues 2-3, May-August 2008, Pages 102-106<\/dc:identifier><dc:identifier>1754-5048<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.funeco.2008.07.001<\/dc:identifier><dc:identifier>http:\/\/hdl.handle.net\/1826\/3164<\/dc:identifier><dc:language>en<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["1754-5048","issn:1754-5048"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2008,"topics":["Aspergillus flavus","Fungal growth","Sporulation","Temperature","Water potential"],"subject":["Postprint"],"fullText":"1Fungal Ecology, Volume 1, Issues 2-3, May-August 2008, Pages 102-106\nEffect of solute, matric potential and temperature on in vitro growth and\nsporulation of strains from a new population of Aspergillus flavus\nisolated in Italy\nPaola Giorni1, Paola Battilani1, Naresh Magan2\n1Istituto di Entomologia e Patologia Vegetale, Università Cattolica del Sacro Cuore di\nPiacenza, Italy; 2Applied Mycology Group, Cranfield Health, Cranfield University,\nBedford MK43 0AL, United Kingdom\nCorresponding author: N. Magan, Applied Mycology Group, Cranfield Health,\nCranfield University, Bedford MK43 0AL, United Kingdom.\nTel: +44 01525 863786; Fax: +44 01525 863540.\nE-mail: N.Magan@Cranfield.ac.uk\n2ABSTRACT\nThe effect of temperature and different solute (Ψs) and matric potentials (Ψm) \non growth and sporulation of three aflatoxigenic strains of Aspergillus flavus isolated\nfrom contaminated maize in northern Italy was determined. The Ψs of maize-based\nmedia were modified ionically (NaCl) and non-ionically (glycerol) and the Ψm with \nPEG 8000 in the range -1.4 to -21.0 MPa at 25 and 30°C. Both temperature and\nΨs\/Ψm stress had statistically significant effects on growth rates of the three strains. \nThe higher fungal growth was registered at 30°C and -1.4 and -2.8 MPa. A. flavus\nstrains were more sensitive to Ψm than Ψs stress with limits of -9.8 MPa and -14 to -\n18 MPa respectively. Sporulation was significantly influenced by Ψs potential, solute \ntype and temperature. This suggests that these aflatoxigenic strains of A. flavus\nisolated from aflatoxin-contaminated maize are probably able to colonise rapidly crop\ndebris at prevailing temperatures and water stress conditions. This type of\ninformation on the ecology of aflatoxin producing A. flavus strains isolated in Italy will\ncontribute to the development of a systems model to predict their activity in crop\nresidue and colonisation of maize grain.\nKeywords: Aspergillus flavus; water potential; fungal growth; sporulation; temperature\n1. INTRODUCTION\nAspergillus section Flavi is the major group of fungi associated with aflatoxin\ncontamination in several agricultural commodities. Three species of this section are\nknown to produce aflatoxins (AFs): A. flavus, A. parasiticus and A. nomius, with the\nfirst two important in the colonisation of crops such as maize, peanuts and nuts\n3(Payne, 1998). They are spread in hot and dry geographic areas where they are\noften able to colonise and contaminate crops rapidly.\nIn 2003, for the first time, high aflatoxin contamination, above the European\nlegal limits both in maize kernels (20 g kg-1 and 5 g kg-1 for feed and food,\nrespectively) and in milk (0.05 g kg-1), were found Italy and it was signalled as an\nemerging problem in Europe (Piva et al., ). This was due to the extremely hot and dry\nweather conditions registered in Italy during summer, very conducive for AFs\ncontamination (Payne, 1998; Klich et al., 1994).\nA. flavus overwinters in soil on crop debris and this represents the main\nsource of primary inoculum for maize plant. Conidia are dispersed aerially and\ndeposited on corn ears enabling germination and infection to be initiated.. The maize\ngrowth stage most susceptible to infection is early browing (Payne, 1992), that\nhappens in late June-early July in Italy, with high temperatures, frequently higher\nthan 30°C. The two major factors that influence soil populations of this fungus are soil\ntemperature and moisture (Payne, 1998). Tolerance of both Ψs and Ψm stress are \nimportant for survival and for growth to occur in crop debris and in soil (Magan,\n1988). Solute stress is imposed by ionic changes due to salt, and non-ionically due to\nwater binding by components on crop residue or plant parts. Matric stress is due to\nwater adsorption and surface tension phenomena in soil; it causes restricted solute\ntransport and it limits growth responses. Growth variations in solute or matric stress\nconditions can also be due to nutritional imbalances, specific ion effects or to the\ndecreased water content that restrict solute transport (Adebayo & Harris, 1971).\nA. flavus can grow between 12 and 48°C and at water potentials (Ψt) as low \nas – 35 MPa (Klich et al., 1994). Available water in maize debris was reported as\nvariable between 0.40 and 0.83 during summer in Italy (Rossi et al., 2008).\n4Interactions between Ψt stress and temperature are fundamental because they\nrepresent the two-dimensional niche in which fungi may be able to effectively\ngerminate, grow and actively compete for the allocation of the available resources\n(Marin et al., 1998).\nSome studies have been conducted on the biology of A. flavus to determine\nfavourable ecological parameters able to promote growth, especially in the USA\n(Kheiralla et al., 1992; Truckless et al., 1988). They showed that 25-30°C were\noptimal for growth of A. Section flavi strains (Giorni et al., 2007; Kheiralla et al., 1992;\nNesci et al., 2004; Sanchis & Magan, 2004). However, only one paper has compared\nthe effect of Ψs and Ψm stress on growth of A. flavus strains (Nesci et al., 2004) and\nnone on sporulation.\nInterestingly, it has been suggested by Calvo et al. (2002) that sporulation capacity\nand secondary metabolite production by A. flavus and A. nidulans are linked by the\nsame induction pathways and influenced by environmental factors. They have\nprovided information on this with regard to pH, temperature and carbon\/nitrogen\nsources, but no studies have been conducted considering solute or matric stress.\nThe objective of this study was to obtain information on the capacity of three\naflatoxigenic A. flavus strains collected in northern Italy, to grow and sporulate under\ndifferent interacting Ψs\/Ψm stress and temperature combinations.\n2. MATERIALS AND METHODS\n2.1 Fungal strains and media preparation\nThree A. flavus strains (MPVP A 2052, A 2073 and A 2092) stored in the\nfungal collection of the Università Cattolica del Sacro Cuore, Institute of Entomology\nand Plant Pathology, isolated from maize grown in Italy, previously characterised as\n5able to produce AFB1 and AFB2,, were used. They were selected to represent the\nwhole population collected; they belong to the three clusters drawn with all strains\ncharacteristics (Giorni et al., 2007).\nThe medium was a maize-based agar with 3% maize flour and 2% agar with\nΨt of approx. -1.4 MPa (aw=0.99) measured with a Hygroskop-BT (Rotronic\nInstrument Corp.).The Ψs was modified ionically with NaCl (Lang, 1967) and non-\nionically with glycerol (Dallyn & Fox, 1980) to values reported in Table 1.\nThe Ψm was modified using Polyethylene glycol 8000 (PEG 8000).  Known \namounts of PEG 8000 were added according to the equation of Michel and\nKaufmann (1973) as detailed by Magan (1988), to obtain target Ψm (Table 1).\nSterile circular discs (ø 8.5 cm) of capillary matting were placed in sterile 9 cm Petri\ndishes containing approx. 15 mL of cooled medium. The matting was overlayed with\nsterile discs of polyester fibre and cellophane (P400, Cannings Ltd., Bristol, U.K.).\n2.2 Fungal growth and sporulation\nSpores of the 3 strains of A. flavus, obtained from a 7 day old Czapek dox\nagar culture, were suspended in 1% peptone-water, shaken vigorously and spread\nonto plates of the basic medium. Plates were incubated over night at 25°C to allow\nspore germination. The different Ψs and Ψm plates were inoculated centrally with an\nagar plug obtained using a 4 mm surface-sterilised cork borer. Four replicates were\nprepared of each treatment. Plates of the same Ψs\/Ψm were sealed in polyethylene\nbags and incubated at 25 and 30°C (12 hours day light). These temperatures were\nselected because optimal for fungal growth and common during the crucial period for\nsporulation in field.\n6The diameter of all colonies was measured daily in two orthogonal directions\nuntil one strain covered the whole plate for a maximum of 14 days. The extension\nrate (mm day-1) was computed for each treatment.\nData on sporulation were obtained in relation to Ψs stress only. Petri dishes \nwere inoculated as previously described and incubated for 7 d; colonies were\nwashed with 5 ml of sterile water added with 0.05% Tween 80 and the spore\nproduction determined with a haemocytometer as detailed by Parra et al. (2004). The\nexperiment was carried out with three replicates per treatment.\n2.3 Data analysis\nTwo dimensional profiles were drawn using Excel (Microsoft Office 2000) to\nshow the effect of time and Ψs\/Ψm on fungal extension. Radial extension in different\ntreatments and for all the strains were rescaled in the range 0 - 1 considering 85 mm\n(diameter of Petri dishes used) as the maximum possible extension for the tested\nstrains.\nThe analysis of variance (ANOVA) of all the collected data was carried out\nusing the statistical package MSTAT-C (Michigan State University, ver. 1, 1991, East\nLansing, MI, USA) and means were compared using the Tuckey test to determine\ntheir statistical significance. An experimental design with three factors (strain,\ntemperature and water stress) in a randomised complete block was used to analyse\nextension data and logarithmically transformed sporulation data [ln (value+1)].\n73. RESULTS AND DISCUSSION\n3.1 Solute and matric stress effects on growth\nThe colony covered the whole plate in 7 and 13 days, respectively with Ψs and \nΨm stress. ANOVA showed a significant effect (P<0.01) of all the main factors\n(strain, temperature and water stress type) on the colony extension (Table 2).\nNo growth was observed at -21.0 MPa and the extension rate at 25 and 30°C\nwas similar under Ψs stress (< 7.0 MPa water stress) regardless of the solute used \n(Fig. 1).\nIn Ψm stress conditions, the extension rate was generally about 50% of that\nmeasured with Ψs stress (Fig. 1). The best temperature among those tested was\n30°C, with no difference found between -1.4 and -2.8 MPa, while limits for growth\nwere about -14.0 and 21.0 MPa, respectively for Ψm and Ψs stress.\nComparing the effect of Ψs and Ψm stress on mycelial extension, - 2.8 MPa\nwas optimal under both imposed types of water stress and not significantly different\nfrom the unmodified media (-1.4 MPa). The Italian strains showed the ability to grow\ndown to -14.0 MPa in ionically modified Ψs medium, while under Ψm stress this was \nlimited to -9.8 MPa. The strains seemed to be more tolerant to both types of imposed\nwater stress than those from Argentina previously examined. In fact, Nesci et al.\n(2004) reported no growth at Ψs and Ψm < -14.0 MPa stress.\nSignificant differences in tolerance of Ψs and Ψm stress indicate a higher \nsensitivity to this factor. This was also supported by the time required to reach the\nmaximum extension. The lower tolerance to Ψm stress confirms the greater difficulty \ninvolved in extracting water from soil pores and the consequent limited solute\ntransport (Adebayo & Harris, 1971); as a consequence, soil colonisation would\n8probably occur over a narrower range of water availability when compared to that\nwhich occurs in maturing maize ears where Ψs stress is more important. This \ndifference in sensitivity was previously observed for Argentinean strains of A. flavus\n(Payne, 1992) and also with other species such as Alternaria alternata and some\nbasidiomycetes (Adebayo & Harris, 1971; Boddy, 1983; Whipps & Magan, 1987;\nMagan et al., 1995). In contrast, limited differences were observed in tolerance to Ψs \nand Ψm stress for ochratoxigenic strains of A. ochraceus (Lee & Magan, 1999;\nRamos et al., 1999).\nTwo dimensional profiles were drawn based on Ψs or Ψm x time interactions\n(Fig. 2) and differences between optimum and marginal conditions were observed as\nwell as lag phase necessary for fungal development.\nAt marginal incubation time (2 days) and Ψs (-21 MPa), no growth was observed in\nboth modified media; with more water stress, growth was influenced by solute type,\nwith an optimum at 5 days and -2.8 MPa with ionically modified media and 6 days\nand -1.4 to -2.8 MPa when glycerol was added (Fig. 2a).\nItalian aflatoxigenic strains have an optimal extension rate profile similar to\nthat found in the USA for isolates from groundnuts and maize. However in that study\ngermination\/growth has been reported till to -32.2 MPa, but only after more than 40\ndays incubation (Sanchis & Magan, 2004). Our interest was in how rapidly growth\ncould occur and the Italian strains were unable to do so at -21 MPa after 7 days\nincubation.\n3.2 Solute stress effects on sporulation\nStrain, temperature and water stress all significally (P<0.01) affected A. flavus\nconidia production. Two strains were similar (1.3·105 conidia cm-2 colony) while the\n9other (A 2092) produced significantly more conidia (3.7·105 conidia cm-2 colony).\nFurthermore, sporulation was significantly higher at 25°C than at 30°C (3.4·105\nversus 1.4·105).\nThe maximum number of spores was produced in unmodified medium (4.8·107\nconidia cm-2 colony).), followed by 1.8·107 at -2.8 MPa in Ψs and it decreased\nsignificantly at each Ψs variation with a complete inhibition with ionic solute at ≥ -14.0\nMPa and to 4.7·105 conidia cm-2 colony at -21 MPa in glycerol modified medium..\nVery few studies have tried to quantify the efficacy of changing Ψs stress on \nconidial production.\nGervais & Molin (2003) and Parra et al (2004) found differences between\noptimal water potential conditions for growth and sporulation for Penicillium roqueforti\nand A. niger respectively. The strains used for testing sporulation in this study were\npreviously tested both for growth and AFB1 production in different temperature and\nwater availability conditions (Giorni et al., 2007). The results suggested that\ndifferences of 5°C and -0.7 MPa from the optimal conditions (25°C; -1.4 MPa) can\nproduce a 10-15% reduction in fungal extension and a significant reduction in AFB1\nproduction and sporulation (65-80% and 55% respectively) (data not shown). This\ncould be explained by results reported by Brodhagen & Keller (2006) regarding the\nregulation of both sporulation and mycotoxin production in A. flavus by G protein\nsignalling pathways. The relationship between mycotoxin production and sporulation\nwere also found by Mostafa et al. (2005) who demonstrated that most of the toxins\nwere produced after the fungus has completed its initial growth phase and began the\ndevelopment stage, represented by sporulation and sclerotia formation.\nData obtained in this study is critical in building up a picture of the key factors\nwhich influence growth and sporulation of strains of this important mycotoxigenic\n10\nspecies from northern Italy and similarly to the approach followed for Fusarium\nverticillioides (Battilani et al., 2003), they will contribute in the development of a\npredictive model.\nACKNOWLEDMENTS\nWork supported by the Italian Ministry of Agricultural and Forestry Policy (AFLARID\nproject).\nREFERENCES\nAdebayo AA, Harris RF, 1971. Fungal growth responses to osmotic as compared to\nmatric water potential. Soil Science Society American Journal 35: 465-469.\nBattilani P, Rossi V, Pietri A, 2003. Modelling Fusarium verticillioides infection and\nfumonisin synthesis in maize ears. Aspects of Applied Biology 68: 91-100.\nBoddy, L, 1983. The effect of temperature and water potential on growth rates of\nwood rotting basidiomycetes. Transactions of the British Mycological Society 80: 141-\n149.\nBrodhagen M, Keller NP, 2006. Signalling pathways connecting mycotoxin\nproduction and sporulation. Molecular Plant Pathology 7: 285-301.\nCalvo AM, Wilson RA, Bok JW, Keller NP, 2002. Relationship between secondary\nmetabolism and fungal development. Microbiological Molecular Biological Reviews\n66: 447-459.\n11\nDallyn H, Fox A, 1980. Spoilage of material of reduced water activity by xerophilic\nfungi. In: Gould GH, Corry JEL (eds), Society of Applied Bacteriology Techincal\nSeries no. 15, pp. 129-139.\nGervais P, Molin P, 2003. Role of water in solid substrate fermentation. Biochemical\nEngineering Journal 13: 85-101.\nGiorni P, Magan N, Pietri A, Bertuzzi T, Battilani P, 2006. Studies on Aspergillus\nSection Flavi isolated in northern Italy from maize. International Journal of Food\nMicrobiology 113: 330-338.\nKheiralla ZH, Hassanin NI, Amra H, 1992. Effect of incubation time, temperature and\nsubstrate on growth and aflatoxin production. International Biodeterioration\nBiodegradation 30: 17-27.\nKlich MA, Tiffany LH, and Knaphus G, 1994. Ecology of the aspergilli of soil and litter.\nAspergillus. In: MA Butterworth-Heineman (Ed.), Biology and Industrial Applications,\nBoston.\nLang ARG, 1967. Osmotic coefficients and water potentials of sodium chloride\nsolutions from 0-40°C. Australian Journal of Chemistry 20: 2017-2023.\n12\nLee HB, Magan N, 1999. Environment factors influence in vitro interspecific\ninteractions between A. ochraceus and other maize spoilage fungi, growth and\nochratoxin production. Mycopathologia 146: 43-47.\nMagan N, 1988. Effect of water potential and temperature on spore germination and\ngerm-tube growth in vitro and on straw leaf sheaths. Transactions of the British\nMycology Society 90: 97-107.\nMagan N, Challen MP, Elliot TJ, 1995. Osmotic, matric and temperature effects on in\nvitro growth of isolates of Agaricus bisporus and A.bitorquis. In: Elliot, T.J. (ed.),\nScience and technology of edible mushrooms. Rotterdam, Balkemaar, pp. 773-780.\nMarin S, Sanchis V, Sàenz R, Ramos AJ, Vinas I, Magan N, 1998. Ecological\ndeterminants for germination and growth of some Aspergillus and Penicillium spp.\nfrom maize grain. Journal of Applied Microbiology 84: 25-36.\nMichel BE, Kaufmann MR, 1973. The osmotic potential of polyethylene glycol 6000.\nPlant Physiology 51: 914-916.\nMostafa ME, Barakat A, El Shanawany AA, 2005. Relationship between aflatoxin\nsynthesis and Aspergillus flavus development. African Journal of Mycology and\nBiotechnology 13: 35-51.\n13\nNesci A, Etcheverry M, Magan N, 2004. Osmotic and matric potential effects on\ngrowth, sugar alcohol and sugar accumulation by Aspergillus section Flavi strains\nfrom Argentina. Journal of Applied Microbiology 96: 965-972.\nParra R, Aldred DA, Archer DA, Magan N, 2004. Water activity, solute and\ntemperature modify growth and spore production of wild type and genetically\nengineered Aspergillus niger strains. Enzyme and Microbial Technology 35: 232-237.\nPayne GA, 1992. Aflatoxin in maize. Critical Reviews in Plant Science, 423.\nPayne GA, 1998. Process of contamination by aflatoxin-producing fungi and their\nimpact on crops. In: Sinha KK, Bhatnagar D (eds), Mycotoxins in agriculture and\nfood safety. New York: Marcel Dekker, Inc. pp. 279-306.\nPiva G, Battilani P, Pietri A, 2006. Emerging issues in Southern Europe: aflatoxins in\nItaly. In: Barug D, Bhatnagar D, van Egmong HP, van der Kamp JW, van\nOsenbruggen WA, Visconti A (eds), The mycotoxin factbook. Wageningen Academic\nPublisher, The Netherlands, 139-153.\nRamos AJ, Magan N, Sanchis V, 1999. Osmotic and matric potential effects on\ngrowth, sclerotia and partitioning of polyols and sugars in colonies and spores of\nAspergillus ochraceus. Mycological Research 103: 141-147.\n14\nRossi V, Scandolara A, Battilani P, 2008. Effect of environmental conditions on spore\nproduction by Fusarium verticillioides, the causal agent of maize ear rot. European\nJournal of Plant Pathololgy, available online.\nSanchis V, Magan N, 2004. Environmental conditions affecting mycotoxins. In:\nMagan N, Olsen M (eds), Mycotoxins in food. pp. 174-189.\nTrucksess M, Stoloff L, Mislivec P, 1988. Effect of temperature, water activity and\nother toxigenic mold species on growth of Aspergillus flavus and aflatoxin production\non corn, pinto beans and soybeans. Journal of Food Protection 51: 361-363.\nWhipps JM, Magan N, 1987. Effects of nutrient status and water potential of media\non fungal growth and antagonist-pathogen interactions. EPPO Bulletin 17: 581-591.\n15\nTable 1 Correspondence between water potential and aw of main treatments used in\nthis study for water stress caused by addition of solute (Ψs) or by use of matric (Ψm).\nΨs Ψm aw\n-1.4 -1.4 0.99\n-2.8 -2.8 0.98\n-7.0 -7.0 0.95\n-9.8 0.93\n-14.0 0.90\n-21.0 0.85\n16\nTable 2 Results of ANOVA on mean radial growth rate (mm day-1) of the 3 strains\ngrown on maize flour agar at 25 and 30°C with different solute (salt or glycerol) and\nmatric potential (polyethylene glycol 8000) modifications.\nRadial growth (mm day-1)\nFactors Solute stress (1) Matric stress (2)\nStrain A 2092 3.30 c 1.97 a\nA 2052 3.33 b 1.45 b\nA 2073 3.37 a 1.93 a\nTemperature (°C) 25 3.43 a 1.59 b\n30 3.24 b 1.97 a\nWater potential (-MPa) -1.4\nControl\n5.74 ab 2.99\na\nNon-ionic solute\n(glycerol)\nMatric\n2.8 5.76 ab\n7.0 5.24 bc 0.00 c\n14.0* 1.02 d 1.04 b\n21.0 0.00 e 3.09 a\nIonic solute (NaCl)\n2.8 6.07 a\n7.0 5.05 c\n14.0 1.14 d\n21.0 0.00 e\n(1) measured at 7 days of incubation\n(2) measured at 13 days of incubation\n*: -9.8 MPa instead of –14.0 MPa for matric potential treatment\nData with different letters indicates statistically significant difference (P<0.01).\n17\nLegends to figures\nFig. 1 Comparison of the effect of solute potential modified with NaCl and the non-\nionic solute glycerol, and metrically with PEG 8000 on growth at 25 and 30°C after 7\ndays of incubation. Values refer to the mean extension rate of the 3 strains used for\nthe experiment.\nFig. 2 Comparison of two dimensional profiles of mean extension of three A. flavus\nstrains on media (a) modified with ionic and non-ionic solutes (NaCl, glycerol) in\nrelation to time and solute potential and (b) in relation to matric potential stress\n(modified with PEG 8000) at both 25 and 30°C. Different shading represents different\ngrowth rates.\n18\nFigure 1. Giorni et al.\n25°C\n0\n2\n4\n6\n8\n-1.4 -2.8 -7 -14 -21\nWater potential (MPa)\nex\nte\nn\nsi\no\nn\nra\nte\n(m\nm\n\/d\nay\n)\n30°C\n0\n2\n4\n6\n8\n-1.4 -2.8 -7 -14 -21\nGly NaCl PEG\nex\nte\nn\nsi\no\nn\nra\nte\n(m\nm\n\/d\nay\n)\nex\nte\nn\nsi\no\nn\nra\nte\n(m\nm\n\/d\nay\n)\n19\nFigure 2. Giorni et al.\na)\n1 2 3 4 5 6 7\n21\n14\n7\n2.8\n1.4\n1 2 3 4 5 6 7\n21\n14\n7\n2.8\n1.4\n1 3 5 7 9 11 13\n9.8\n7\n2.8\n1.4\nNaCl Glycerol\n1 3 5 7 9 11 13\n9.8\n7\n2.8\n1.4\n25°C 30°C\nPEG 8000PEG 8000\nTime (days)\nS\no\nlu\nte\npo\nte\nn\nti\nal\n(-\nM\nP\na)\nM\nat\nri\nc\npo\nte\nn\nti\nal\n(-\nM\nP\na)\n0-0.2 0.2-0.4 0.4-0.6 0.6-0.8 0.8-1\nS\no\nlu\nte\npo\nte\nn\nti\nal\n(-\nM\nP\na)\nM\nat\nri\nc\npo\nte\nn\nti\nal\n(-\nM\nP\na)\nb)\n"}