{"doi":"10.1093\/poq","coreId":"102203","oai":"oai:epubs.surrey.ac.uk:1654","identifiers":["oai:epubs.surrey.ac.uk:1654","10.1093\/poq"],"title":"A different take on the deliberative poll: information, deliberation and attitude constraint","authors":["Sturgis, Patrick","Roberts, Caroline","Allum, Nick"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-03-01","abstract":"<p>Opinion pollsters, political scientists, and democratic theorists have long been concerned with the normative and methodological implications of nonattitudes (Converse 1964). Of the proposed remedies to the weak and labile attitudinal responses proffered by an uninformed and disinterested public, perhaps the most ambitious to date has been Fishkin’s concept of the deliberative poll (Fishkin 1991, 1995, 1997). Combining probability sampling with information intervention and increased deliberation affords a unique insight into what might be considered the true \"voice of the people.\" Yet, while deliberative polling draws heavily on the general notion of political sophistication (Luskin 1987), empirical analyses have tended to focus almost entirely on how the process of deliberation impacts on marginal totals of attitude items at both the individual and aggregate level (Fishkin 1997; Luskin, Fishkin, and Jowell 2002; Sturgis 2003). Little attention, in contrast, has been paid to outcomes that relate to other dimensions of opinion quality, such as attitude constraint. Constraint refers to the level of consistency between attitudes within an individual belief system that arises from a combination of logical, social, and psychological factors (Converse 1964). In this article we analyze data from five deliberative polls conducted in the United Kingdom in the 1990s in order to investigate the impact of political information and deliberation on attitude constraint. Across a broad range of issue areas we evaluate the extent to which the deliberative process impacts on statistical associations among attitude items between the first and subsequent waves of the polls. We conclude by discussing the implications of our results for the validity and reliability of survey measures of the attitude and the broader utility of the deliberative polling method as a tool of social scientific inquiry<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1654<\/identifier><datestamp>\n      2017-10-31T14:02:39Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6172747368756D616E736369656E636573:736F63696F6C6F6779<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1654\/<\/dc:relation><dc:title>\n        A different take on the deliberative poll: information, deliberation and attitude constraint<\/dc:title><dc:creator>\n        Sturgis, Patrick<\/dc:creator><dc:creator>\n        Roberts, Caroline<\/dc:creator><dc:creator>\n        Allum, Nick<\/dc:creator><dc:description>\n        <p>Opinion pollsters, political scientists, and democratic theorists have long been concerned with the normative and methodological implications of nonattitudes (Converse 1964). Of the proposed remedies to the weak and labile attitudinal responses proffered by an uninformed and disinterested public, perhaps the most ambitious to date has been Fishkin’s concept of the deliberative poll (Fishkin 1991, 1995, 1997). Combining probability sampling with information intervention and increased deliberation affords a unique insight into what might be considered the true \"voice of the people.\" Yet, while deliberative polling draws heavily on the general notion of political sophistication (Luskin 1987), empirical analyses have tended to focus almost entirely on how the process of deliberation impacts on marginal totals of attitude items at both the individual and aggregate level (Fishkin 1997; Luskin, Fishkin, and Jowell 2002; Sturgis 2003). Little attention, in contrast, has been paid to outcomes that relate to other dimensions of opinion quality, such as attitude constraint. Constraint refers to the level of consistency between attitudes within an individual belief system that arises from a combination of logical, social, and psychological factors (Converse 1964). In this article we analyze data from five deliberative polls conducted in the United Kingdom in the 1990s in order to investigate the impact of political information and deliberation on attitude constraint. Across a broad range of issue areas we evaluate the extent to which the deliberative process impacts on statistical associations among attitude items between the first and subsequent waves of the polls. We conclude by discussing the implications of our results for the validity and reliability of survey measures of the attitude and the broader utility of the deliberative polling method as a tool of social scientific inquiry<\/p><\/dc:description><dc:date>\n        2005-03-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1654\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Sturgis, Patrick, Roberts, Caroline and Allum, Nick  (2005) A different take on the deliberative poll: information, deliberation and attitude constraint   Public Opinion Quarterly, 69 (1).  pp. 30-65.      <\/dc:identifier><dc:relation>\n        10.1093\/poq\/nfi005<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1654\/","10.1093\/poq\/nfi005"],"year":2005,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 1\nA Different Take on the Deliberative Poll: Information, Deliberation and Attitude Constraint \n \nPatrick Sturgis, University of Surrey, UK \nCaroline Roberts, London School of Economics and Political Science \nNick Allum, London School of Economics and Political Science \n \nPaper Presented at the 58th International Conference of the American Association of Public Opinion \nResearch (AAPOR), Nashville, USA, August 15-18, 2003. \n \nABSTRACT \nOpinion pollsters, political scientists and democratic theorists have long been concerned with the \nnormative and methodological implications of nonattitudes (Converse, 1964). Of the proposed \nremedies to the weak and labile attitudinal responses proffered by an uninformed and disinterested \npublic, perhaps the most ambitious to date has been Fishkin’s concept of the deliberative poll (Fishkin, \n1991; 1995; 1997). Combining probability sampling with information intervention and increased \ndeliberation affords a unique insight into what might be considered the true ‘voice of the people’. Yet \nwhile deliberative polling draws heavily on the general notion of political sophistication (Luskin, \n1987), empirical analyses have tended to focus almost entirely on how the process of deliberation \nimpacts on marginal totals of attitude items at both the individual and aggregate level (Fishkin, 1997; \nLuskin, Fishkin and Jowell, 2002; Sturgis 2003). Little attention, in contrast, has been paid to outcomes \nthat relate to other dimensions of opinion quality, such as attitude constraint. Constraint refers to the \nlevel of consistency between attitudes within an individual belief system which arises from a \ncombination of logical, social and psychological factors (Converse 1964). In this paper we analyse data \nfrom five deliberative polls conducted in the UK in the 1990s to investigate the impact of political \ninformation and deliberation on attitude constraint. Across a broad range of issue areas we evaluate \nthe extent to which the deliberative process impacts on statistical associations amongst attitude items \nbetween the first and subsequent waves of the polls. We conclude by discussing the implications of \nour results for the validity and reliability of survey measures of the attitude and the broader utility of \nthe deliberative polling method as a tool of social scientific enquiry. \n \nKey words: political sophistication; opinion quality; attitude constraint; deliberative poll. \n \nPOLITICAL SOPHISTICATION AND ‘INFORMED’ OPINION \nIf political science as a discipline can claim to have uncovered any scientific ‘facts’ during its relatively \nbrief existence, then the politically unsophisticated electorate is undoubtedly a primary contender. In \nsurvey after survey the inability of the public to accurately identify the institutional structures of \ngovernment, office holders and important areas of elite controversy has been repeatedly demonstrated \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 2\nthrough decades of empirical research (Hyman and Sheatsley 1947; Campbell et al 1960; Bennett 1988, \nDelli Carpini and Keeter 1996). Comparative time series of survey data confirm the initial conclusions \nof the Michigan School, that respondents willingly offer opinions on nonexistent issues (Bennett 1975; \nBishop et al 1980); misunderstand and misrepresent abstract, ideological terminology (Campbell et al \n1960; Converse 1964; Butler and Stokes 1969; Erikson and Luttbeg 1973); switch from one side to the \nother of prominent issues in a quasi-random manner over time (Converse ibid; Iyengar 1973; Asher \n1974; Sturgis 2002); and demonstrate only weak consistency between issues which elites routinely \nparcel together (Converse ibid; Butler and Stokes 1974; Converse and Pierce 1985). This body of \nempirical work has given rise to concerns over the ability of the public to meet the exigencies of \nnormative theories of democracy and the validity and reliability of survey attitude data more \ngenerally.  \n \nIf the responses proffered in the standard survey interview are not, then, to be trusted how can we \ncome to know public opinion? The list of proposed methodological remedies to this question is long \nand growing. Some of the more straightforward approaches involve only slight modifications to the \nstandard questionnaire format. It is now common practise, for instance, to provide ‘preambles’ for \nquestions on low salience topics in order to provide respondents with at least some limited frame of \nreference within which to formulate a response; “you may have heard of issue X, this is…”. Similarly, \nalthough not always recognised as such, the inclusion of ‘don’t know’ and’ can’t say’ response \nalternatives, is an implicit recognition that not all respondents will have a stance on every issue. \nOpinion filtering, a la Schuman and Presser (1981), is a yet more robust attempt at weeding out the \nnonattitude holders to provide a ‘purified’ measure of the public will.  \n \nWhere such ‘filtering’ approaches fall down, of course, is in assuming – if only implicitly – that the \ndistribution of ‘true’ issue preferences is itself uncorrelated with opinion holding (Delli Carpini and \nKeeter 1996). For the same reason, the notion of ‘rationality through aggregation’ (Page and Shapiro \n1992) has been critiqued for assuming that “the actual signal of net change can come equiprobably \nfrom any stratum of the electorate” (Converse 2000 p.349). On the contrary, however, the evidence \nthat the aggregate distribution of opinion on many issues would be different, were people better \ninformed, is compelling (Bartels 1996; Althaus 1998; Sturgis 2001; Sturgis 2003). The key problematic is \nnot, then, how to identify and remove the nonattitude holders but to estimate what the public as a \nwhole would think were they better informed about the issues in question.  \n \nClearly, this is a far from straightforward task – the gulf that separates the least sophisticated \nmembers of the public from their ‘elite’ counterparts is so vast that it would, in all reality, take years of \ndedicated study to even come close to broaching it (see Converse 2000 p.333-335 for a vivid discussion \nof this point). Many attempts at solving the problem of estimating ‘informed opinion’ founder on the \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 3\nproblem of response burden that this throws up. In delivering levels of information deemed sufficient \nfor eliciting enlightened preferences, most have had to give up on random selection of samples and, \nthereby, representativeness. Under this general umbrella would fall techniques such as focus group \ndiscussions (Kreuger 1988),  Citizens’ Juries (Coote and Lenaghan 1997; Wakeford 2003), Planning \nCells (Renn et al 1984) and other methods based on ‘opt-in’ sample designs. Other approaches have \nretained a probability based  sample design but implemented only relatively modest ‘interventions’ \n(Neijens 1987; van Knippenberg and Daamen 1996); or relied on statistical modeling of cross-sectional \ndata in preference over quasi-experimental designs (Bartels 1996; Delli Carpini and Keeter 1996; \nAlthaus 1998; Gilens 2002; Sturgis 2001; 2003). We do not discuss such approaches further here but \nrestrict our attention to a consideration of the most ambitious approach to date of estimating informed \nopinion, while retaining the possibility of inference to the population through random selection of \nsamples – Fishkin’s Deliberative Poll (Fishkin 1991; 1995; 1997; Luskin, Fishkin and Jowell 2002). \n \nThe basic design of a deliberative poll involves interviewing a randomly selected sample of the \npopulation on their views on a particular issue or range of issues before they participate in a weekend \nof (balanced) briefings by experts, discussion amongst participants and questioning of experts, \npoliticians and stakeholders. The sample is then re-interviewed at the end of the period of deliberation \n(see Fishkin 1997 or Luskin, Fishkin and Jowell 2002 for a detailed account of the methodology). \nFishkin has argued that combining probability-based sampling with the increased information, \nattention and deliberation that respondents bring to the ‘post’ survey reveals “the views the entire \ncountry would come to if it had the same experience of behaving more like ideal citizens immersed in \nthe issues for an extended period” (Fishkin 1997, p. 162). And, following the successful conduct of \nnearly twenty deliberative polls in at least seven different countries, there can be little doubt that the \nmethod consistently engenders sizeable net and gross opinion change across a range of issues and \npolitical contexts (Merkle 1996; Fishkin 1997; Luskin, Fishkin and Jowell 2002; Hansen and Andersen \n2001).  \n \nYet, while we may be impressed by the shifts in marginal totals which undoubtedly accompany the \nwelter of information and increased attention respondents pay to the topic, can we really be sure that \nwe are uncovering ‘enlightened preferences’  -  the attitudes  people would have held had they always \nbeen as involved in and informed about the issues? Would the same results have been obtained on a \ndifferent sample? Or, perhaps more to the point, would the same sample have responded differently \nto a different set of speakers or a slightly modified set of briefing materials? The predominant focus on \nsimple input-output effects means that the complex and interacting causal mechanisms underlying \nopinion change in the deliberative poll - public and private deliberation, informational influence, \ngroup dynamics and persuasion – remain unclear, leaving the deliberative poll as something of an \nexplanatory ‘black box’ (Price and Neijens 1998).   \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 4\n \nPrice and Neijens (1997) have set out a framework for evaluating the ‘quality’ of measures of opinion, \nwhich links ‘opinion quality’ to notions of democracy and social choice. Such a formulation fits well \nwith Fishkin’s own conceptualisation of the deliberative poll as being intended as “more than a social \nscience experiment; it is also meant to contribute to the public dialogue” (Fishkin 1997, p189). One of \nthe key ‘outcome-oriented’ hallmarks of ‘considered’ opinions, from this perspective, is the extent to \nwhich attitudes are consistent with beliefs about the implications and consequences of different \ncourses of action (Yankelovich 1992) and with other idea elements within the belief system as a whole. \nThe idea of consistency as an indicator of opinion quality draws us, in turn, into the longstanding \ntradition of Political Belief Systems (PBS) research and Converse’s notion of attitude ‘constraint’.  \n \nATTITUDE CONSTRAINT \nThe concept of attitude constraint derives from the idea that attitudes toward specific areas of \ngovernment policy are structured by more abstract value dimension(s) further back in a hierarchical \nsystem of belief (Converse 1964; Peffley and Hurwitz 1985). Thus, though not necessarily logically \nrelated, we should expect a degree of correspondence between the position an individual takes on \nissue A and the position they take on issue B, to the extent that both articulate with higher order \nvalues and beliefs. Converse invokes the analogy of ‘glue’ to convey his idea of attitudinal constraint, \na cognitive binding agent which, both vertically and horizontally, integrates idea elements into a \ncoherent and, in some senses, unitary cognitive entity. The idea that a particular belief ‘goes with’ \nanother should not, however, be seen as syllogistically proscriptive but as reflective of the historical \nand cultural influences brought to bear on the social and political fabric of a given society at a \nparticular point in time – together with the ‘idiosyncratic twist’ engendered by the individual’s own \nexperiential history. \n \nMore information and greater internal integration of idea elements are indicative of greater political \nsophistication (Luskin 1987). More sophisticated individuals, it is proposed, experience greater \npolitical efficacy; ideological organisation affords straightforward assimilation and retention of novel \ninformation and provides a meaningful framework through which it is possible to assess the optimal \ncourse(s) of action to achieve one’s instrumental objectives. Ultimately, organisational structure and \nparsimony aids individual efficacy by facilitating the development of attitudes and partisan \ntendencies which are more in line with individual and group interests (Mansbridge 1983; Bartels, \n1996; Althaus 1998).  \n \nThe empirical observation that first led to the development of the constraint construct was the steep \ngradients in correlations between attitude items that emerged across virtually any measure of \ncognitive elaboration or information capacity (Converse 1964; 1990). The over-arching aim of the \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 5\ntradition of research into attitude constraint has, consequently, been to delineate the social and \npsychological mechanisms underlying such gradients. Revisionist critiques of Converse’s pessimistic \nmodel of the public’s political acumen have variously focused attention on measurement error (Achen \n1975; Erikson 1979); historical changes in political climate (Nie and Anderson 1974; Nie and Verba \n1975; Nie et al 1979); and the application of an inappropriate methodological paradigm (Lane 1962; \nRosenberg 1988) to counter the main thrust of Converse’s 1964 position. In our view, such responses \nhave failed to decisively overturn Converse’s original conclusions on the causes of gradients in \nconstraint but space precludes their closer examination here (though see Kinder and Sears 1985; \nKinder 1998; and Converse 2000 for comprehensive reviews). Instead we focus our attention on \nConverse’s original model of ideological constraint, which ties correlational gradients to differences in \nthe level of information and ideological sophistication that individuals bring to attitude questions in \nsurveys. \n \nTHE ANTECEDANTS OF CONSTRAINT \nFor Converse, lower inter-item correlations amongst the less politically informed are essentially a \nresult of the combined influence of two main characteristics of the belief systems of this group; the \nweak, uncognized ‘nonattitudes’ that underpin responses to individual survey items and the lack of \ncoherence with relation to higher order organising principles in the belief system as a whole. The two \nare undoubtedly strongly and inextricably related, opposite sides of the same coin, if you like. \nNonetheless, it is important to distinguish between the distinct mechanisms through which political \nknowledge impacts on belief system structure, for the effects of these two mechanisms may in some \ninstances be confounded. \n \nWe turn first to the relation between knowledge and deliberation on the one hand and the reliability \nof individual items on the other, and how this concomitantly impacts on observed levels of association \nbetween the items in question. To the extent that ‘nonattitudes’ are ‘top-of-the-head’ responses to \nuncognized stimulus objects, we might reasonably expect that increases in information would lead to \nmore considered, stable attitudes that have been arrived at through rational, preference-based \njudgements. In the language of signal detection theory, we would expect the ratio of signal to noise for \nindividual items to increase with greater political knowledge. In the aggregate, this would reduce the \nrandom component in the respective survey items for more knowledgeable groups of respondents, \ndisattenuating the magnitude of correlation between them (Bollen 1989), holding constant the actual \nlevel of association between items.  \n \nAs a second consequence of increasing knowledge and deliberation, we might also expect that \nindividuals obtain a better understanding of ‘what goes with what’ (and why) and that this too would \nfeed through into stronger inter-item associations at the aggregate level. This is perhaps the more \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 6\ncommon understanding of how knowledge and deliberation impact upon statistical associations \nbetween attitudes and has also been the source of some objection to the idea that more sophisticated \nindividuals should always have more ‘consistent’ belief systems (Lane 1962; Rosenberg 1988). It is \nimportant to note, however, that the general idea being outlined here is not equivalent to stating that \nincreasing sophistication will always result in stronger linkage between issue domains; increased \ndifferentiation may equally well be the hallmark of sophistication in a specific context. As Luskin \n(1987) points out, it is a common mistake amongst public opinion researchers to conflate correlation \nand consistency when investigating the concept of constraint.  \n \nWhether sophistication leads to association or differentiation across a set of political issues is, \ntherefore, an empirical question. While conceding, however, that increased consistency will not \nalways result from greater knowledge and deliberation, we must pit this observation against the \nextreme regularity with which measures of statistical association appear to adopt an upward gradient \nwhen stratified by virtually any indicator of political sophistication (Aberbach et al 1981; Butler and \nStokes 1974; Converse and Pierce 1985; Bartle 2000; Sturgis 2001). So, while it would certainly be \npossible for a differentiation effect to over-ride disattenuation of inter-item correlations through \nreduced measurement error, it would seem likely that this would be restricted to a minority of cases in \nthe real world. \n \nAN INTEGRATIVE MODEL \nZaller and Feldman (1992) provide an explicit theoretical formalisation of these ideas which integrates \nmeasurement error and consistency perspectives on attitude constraint and explains how greater \nfamiliarity with political issues impacts on a range of survey response characteristics which have \ntraditionally been taken as indicators of sophistication: context effects (Schuman and Presser 1981); \nresponse stability; and inter-item association. Zaller and Feldman propose a ‘Simple theory of the \nSurvey Response’ which conceives attitudes, not as pre-formed cognitive entities waiting to be \nrecovered from some mental filing cabinet, but as temporary constructions which are both time and \ncontext dependent. For Zaller and Feldman the fundamental building blocks in the construction of \n‘revealed preferences’ (as they term survey attitude responses) are ‘considerations’ and \n‘predispositions’. While the latter are in many respects akin to the notion of core beliefs and values \n(Rokeach 1973; Feldman 1988), determining the favourability an individual will accord to a particular \nproposition or idea, the former are bits of information which, depending on their predispositions, will \nincline a respondent to “decide a political issue one way or another” (Zaller 1992, p. 21). Zaller and \nFeldman delineate their theoretical framework with a set of axioms concerning the acquisition, \nretention and weighting of considerations to enable the derivation of testable hypotheses about survey \nresponses: \n \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 7\nThe reception axiom : the more involved and engaged an individual is with politics, the more likely \nthey are to acquire new considerations. \n \nThe resistance axiom : people resist incoming information that is inconsistent with their \npredispositions but only to the extent that they possess sufficient considerations to perceive such \ninconsistencies. \n \nThe accessibility axiom: the more accessible a consideration is in memory, the more easily it and \nrelated considerations will be retrieved. Accessibility itself depends on contextual factors and the \nrecency with which considerations were in conscious memory. \n \nThe response axiom: survey responses are derived by averaging over accessible considerations. \n \nThese axioms allow certain clear deductions about how different people will respond to survey \nquestions: people who are more interested and involved in politics will have a deeper pool of \nconsiderations from which to infer their attitudes. They will also, according to the resistance axiom, \nhave less contradictory considerations because they will be better able to recognise information that \nconflicts with their predispositions and resist its persuasive influence. Finally, when they are called \nupon to provide an attitude response in a survey, they will be averaging over a larger pool of more \nconsistent considerations than the less politically aware, which results in the same response \nalternative being selected more consistently over time. Their attitudes are also more consistent with \none another at any one point in time due to the combined influence of the reception and resistance \naxioms; they are more likely to seek out and obtain new information and, as their stock of relevant \nconsiderations grows, to resist information that conflicts with their predispositions. The net effect is a \nlarger pool of consistent considerations, or in other words, more constrained attitude systems. Low \nlevels of knowledge produce labile, situationally dependent responses which, in turn, produce lower \ncorrelations with other attitude items. \n \nWhile the literature is now replete with confirmations of the deduction from this model that less \nknowledgeable citizens should exhibit lower statistical associations between attitude items (see  \nSinnott 2000; Bartle 2000 for recent examples), we are unaware of any extant experimental or quasi-\nexperimental investigations of the hypothesis. Yet, so long as we rely entirely on cross-sectional data, \nthe real possibility remains that it is something other than information, involvement and deliberation \nthat is causing gradients in correlational measures of constraint. By examining whether changes in \nthese variables at time 1 are followed by changes in constraint at time 2 we are able to gain much \ngreater leverage on the relation between sophistication and constraint. Indeed, Fishkin has himself \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 8\nargued that increased belief system consistency should be apparent after participating in a deliberative \npoll: \n \n“Many … nonattitudes and pseudo-opinions would be replaced by views that are better rationalized and \nsupported and perhaps more consistent with other elements in the respondent’s belief system” \n \nFishkin (1991 p.83) \n \nIn the remainder of the paper we, therefore, turn our attention to an evaluation of the evidence from \nfive UK deliberative polls that increases in knowledge, involvement and deliberation lead to a \nsubsequent growth in statistical measures of constraint. \n \nDATA \nIn collaboration with James Fishkin, the Independent Newspaper and Channel 4 Television, the \nNational Centre for Social Research1 conducted five deliberative polls in the UK during the late 1990s \nwhich form the bases of our analyses in this paper. The polls covered attitudes toward crime and \ncriminal justice (1994); European integration (1995); the Monarchy (1996); issues around the 1997 \nGeneral Election (1997); and the National Health Service (1998). All five polls had the same basic \ndesign – a stratified, multi-stage probability sample of individuals in Great Britain was drawn from \nthe Electoral Register, with the aim of obtaining approximately one thousand face-to-face interviews. \nRespondents to this baseline survey completed a self-completion questionnaire containing items of \nrelevance to the topic area and a range of standard demographic questions. Respondents to this stage \nof the study were invited to attend the weekend of ‘deliberation’ at a central location, with all \nexpenses covered and a small monetary incentive. Between the interview and the event itself \nparticipants were sent briefing documents about the issue in question, outlining as impartially as \npossible the main points of contention. At the weekend event, participants were ‘immersed’ in the \nissues both in small, moderated groups and in plenary sessions, where specialists representing \ndifferent perspectives presented their views and answered questions. Further plenary sessions were \npresented by prominent politicians, usually Secretaries of State and their shadow counterparts. At the \nend, participants completed the self-completion questionnaire once again. The whole event was \ntelevised, in edited form, on Channel 4 on the Sunday evening of the deliberative weekend.   \n \nAs set out in table 1, response rates to the initial survey were around 60-70%, with about a fifth to a \nthird of those responding at this stage eventually participating in the deliberative component of the \nstudy. This means that, generally, only around 20% of eligible respondents drawn for the initial \nsample actually provided ‘before’ and ‘after’ data. Fishkin (1997) and Luskin, Fishkin and Jowell \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 9\n(2002), however, report that, despite these low rates of response, the deliberative samples matched the \nbaseline samples across a range of important demographic marginals. \n \nMETHOD \nThe self-completion questionnaire from each of the five polls was examined to identify every attitude \nscale with three or more ordinal indicators. This resulted in a total of sixteen attitude scales to form the \nbasis of the analysis. These were distributed across polls as follows: crime (4); Europe (4); Monarchy \n(4); Election issues (1); and NHS (3). Exploratory Factor Analysis was used to check that a single \ncommon factor model was a reasonable representation of the observed data for each scale2. Full \nwordings for all 16 attitude scales are provided in the Appendix. Having identified these 16 attitude \nscales, the aim of the analysis was then to determine whether there was any evidence for change in the \nlevel of constraint between items across the two waves of the polls. \n \nThe matter of how constraint should be empirically operationalised has received a good deal of \nconsideration in the PBS research literature. Much criticism has been levelled at the use of \ninappropriate correlational statistics such as Goodman and Kruskal’s Gamma (Weisberg 1974; Balch \n1979; Luskin 1987). Even correlational measures deemed more appropriate to the task are problematic \nbecause they conflate slope and the distribution of points about the regression line. This means that \nthe distributional properties of the variables being correlated can be as much the cause of between-\ngroup differences as the actual level of association between the variables in question (Achen 1982, \nKing 1986, Weissberg 1976).  \n \nFurthermore, simply comparing averaged, sign-adjusted correlation coefficients across a matrix of \nvariables suffers from at least two significant problems. First, as this technique usually involves either \npair-wise or listwise deletion of missing cases, with levels of missing data on these types of attitudinal \nvariables often rising as high as 10-30% of eligible cases, the effects of non-random item missing data \ncan lead to substantial over-estimates of constraint3 (Bennett, et al. 1979). Second, the historical lack of \nparametric statistical tests for differences in these averaged coefficients means that comparing levels of \nconstraint between groups, while of some descriptive value gives us no idea of what constitutes a \nlarge or a small, let alone statistically non-zero difference between groups. \n \nMultivariate correlational methods such as Exploratory Factor Analysis (EFA) have also been used to \nexamine the relatedness of individual issues and dimensionality of belief systems within the general \n                                                                                                                                                                                                          \n1 Formerly Social and Community Planning Research (SCPR). \n2 This was done by examining the elbow of scree plots of eigenvalues rather than selecting an arbitrary cut-off point for \neigenvalues. That a single factorial structure underlay each attitude scale was desirable because this is an assumption \nunderlying Cronbach’s Alpha which we use in later analyses. \n3 The direction of the bias is toward overestimates as it is the least politically involved and therefore the least ideologically \nconstrained sample members who are most likely to provide item missing data (Smith 1984). \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 10 \npublic (Himmelweit, et al. 1985, Jackson and Marcus 1975, Stimson 1975). In terms of political \nsophistication, the rationale underlying these factor analytic approaches is that, to the extent that \nbelief systems are more constrained, the factorial structure should be simpler and the percentage of \nvariance explained greater, the more sophisticated the individual’s political thinking. While this \ngeneral hypothesis has, to some extent, accrued empirical support (Stimson 1975; Delli Carpini and \nKeeter 1996), there is a lack of consensus as to whether more constrained belief systems should always \nresult in simpler factor structures (see Luskin 1987). Furthermore, solutions for exploratory factor \nanalyses are heavily determined by issue content and the number of variables included in the analysis, \nwhich makes it difficult to argue that such inductive approaches reflect the true ideological \nstructuring of belief systems in the mass public (Rosenberg 1988). \n \nMore recent treatments of constraint have moved away from bivariate correlational measures and \nEFA and adopted Confirmatory Factor Analysis (CFA) or its extension - Structural Equation Modeling \n(Joreskog 1973, Joreskog 1993, Joreskog and Sorbom 1989). Judd and Milburn (1980, see also Judd, et \nal. 1981) have argued that, in conjunction with measures of overall model fit, the pattern of \nunstandardised factor loadings between each indicator variable and the latent construct it measures \nmay be taken as indicative of the level of belief system constraint in a population. Using the \nunstandardised coefficients, they argue, avoids the potential problem of unequal variances in the \nobserved variables across groups causing spurious differences in constraint in standardised measures. \nHowever, as both Martin (1981) and Converse himself (1980) have argued, unstandardised factor \nloadings are not particularly useful measures of constraint because they do not represent absolute \nmagnitudes but are meaningful only relative to the factor loading that is fixed to unity in order to set \nthe scale of the latent variable. They argue that differences across groups in standardised parameters \nand measurement errors of the observed variables are more informative indicators of the internal \ncoherence of political belief systems.  \n \nIn this study we combine a simple correlational measure of attitude constraint – Cronbach’s Alpha  - \nwith recent innovations in the estimation of sampling variance through the bootstrap (Efron 1979; \n1982). Alpha essentially gives the average, sign-adjusted correlation between items, with an upward \ncorrection for each additional item included in the scale (Cronbach 1951). We chose Cronbach’s Alpha \nas our operationalisation of constraint, despite its relative lack of technical sophistication, because it is \nsuch correlational measures that have traditionally been and continue to form the basis of empirical \nresearch into constraint as a measure of political sophistication. By applying the bootstrap to estimates \nof differences in Alpha within and between groups, it is possible to perform statistical tests of \ndifferences in coefficients, where previous examinations of gradients in such correlational measures \nhave tended to rely on ‘eyeballing’ and intuition. Our simple test of significant difference in all the \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 11 \nanalyses that follow is whether the bootstrapped 95% confidence interval of the difference in Alpha \ncrosses zero. \n \nIn addition to testing for differences in constraint before and after deliberation for the whole sample, \nwe wished to examine whether the effect of information and deliberation on constraint was \nmoderated by extant knowledge levels. All five polls contained short knowledge quiz items in a \ntrue\/false format about the issue on which the poll focussed. Raw scores on the knowledge measures \nwere recoded into three bands to form high, medium and low knowledge groups. Tests were \nperformed for differences in Alpha within and between knowledge groups. Full wordings coding \ndetails and reliabilities for the knowledge measures are given in the appendix.  \n \nItem missing data on the items that form the basis of our analysis here are potentially problematic due \nto the probable positive correlation between nonresponse propensity and opinion constraint. Listwise \nor pairwise deletion of missing observations, assuming such a correlation, would militate against \ndetecting increases in constraint, as the initially least constrained respondents (and, therefore, those \nmost prone to increases) would be disproportionately dropped from the analysis. To check for this we \nimputed all missing data using the EM algorithm (Dempster, Rubin and Laird, 1977) and repeated the \nanalysis with the imputed data. However, this resulted in only minor changes to the unimputed \nestimates and had no material impact on the substantive conclusions we draw here. For the sake of \nexplanatory simplicity, we therefore present estimates from the unimputed data in the tables that \nfollow4. \n \nRESULTS \nTable 2 shows Cronbach’s Alpha across knowledge groups for the baseline sample at wave one and \nthe weekend sample at waves one and two for the Election Issues Poll. The baseline sample estimates \nhave a base of all respondents to the baseline survey, while the weekend sample estimates are based \non just those respondents who participated in the weekend of deliberation. Tests for differences in \nAlpha between the baseline and weekend samples are calculated on the group who didn’t attend the \nweekend compared to those that did. \n \nTABLE 2 ABOUT HERE \n \nTable 2 shows the familiar upward gradient in statistical consistency by level of political knowledge \nfor the baseline sample, though only the difference between the low knowledge group and the other \ntwo groups reaches statistical significance at the 95% level of confidence. While still just about visually \n                                                                 \n4 Contact corresponding author for details of the imputed estimates. \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 12 \napparent amongst the weekend sample, the difference between groups is much reduced and does not \nreach statistical significance5. The alpha coefficient for the weekend sample is some seven points \nhigher than for the baseline sample, though again, this difference is not statistically significant. For the \nwhole weekend sample, alpha increased over the course of the weekend but only marginally and non-\nsignificantly. Neither was there any evidence that an effect was moderated by existing knowledge \nlevel with all groups showing no detectable change over the weekend. From the election issues poll \nthen, there is little evidence of an increase in constraint, albeit that only one attitude scale was \namenable to analysis in this data set. \n \nTurning next to the crime poll data, Table 3 sets out the same breakdown for the four scales identified \nin this dataset. Two of the scales show a significant upward gradient in coefficients by knowledge \ngroup amongst the baseline respondents while two show no discernible pattern. The gradient in scales \n1 and 2 remains visible amongst the weekend sample at wave one, although not so consistently and \nwithout reaching statistical significance. On attitude 1, the weekend sample had a significantly higher \ncoefficient than respondents who did not participate in the weekend poll, perhaps reducing the \npotential for increase over the course of the weekend. On attitudes 3 and 4 there was no upward \ngradient in coefficients, attitude 4 exhibiting a significant downward gradient across knowledge \ngroups in the weekend sample. \n \nTABLE 3 ABOUT HERE \n \nIn terms of change before and after the weekend, Table 3 shows a significant increase in Alpha for \nattitude 2, an effect that was also found within the low and high knowledge groups on these items. \nAttitudes 1 and 3 showed no overall or within group change, while attitude 4 showed a significant \nincrease in Alpha amongst the high knowledge group only. At wave two there were no significant \ndifferences in Alpha between knowledge groups, perhaps indicating some sort of equalising effect of \ninformation and deliberation upon  constraint. \n \nTable 4 shows the results of the analysis on the Monarchy poll data. Of the four attitudes studied, only \none showed any sign of a gradient in coefficient Alpha at wave one, in both the baseline and the \nweekend samples; the medium knowledge group on attitude 4 was significantly lower than both the \nlow and high knowledge groups. Only one of the attitude scales, attitude 1, showed any change in \nAlpha over the weekend, the coefficient for the whole sample increasing from .55 to .71. This pattern \n                                                                 \n5 It is worth noting at this juncture, the limited power to detect between and within group differences in samples sizes typically \nachieved in deliberative polls (see Sturgis 2001). While effects of any substantive magnitude should be detectable for inferences \nto the total population, as soon as attention focuses on sub-groups of interest, sample sizes soon drop to levels where it is quite \nlikely that meaningful differences and change over time will not be significant at conventional confidence levels. \n \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 13 \nwas mirrored within all three knowledge groups for this set of items, although only the change in the \nlow knowledge group was statistically significant. \n \nTABLE 4 ABOUT HERE \n \nResults of the analysis on the European integration poll data are shown in Table 5. All four attitude \nscales show a significant upward gradient in Alpha coefficients across knowledge groups for the \nbaseline sample. The general pattern is still apparent for the weekend sample, but with some \nanomalies and without consistently reaching statistical significance, probably because of the reduced \npower for detecting effects in these smaller size groups. Although none of the coefficients are \nsignificantly different within knowledge groups between those who did and those who did not attend \nthe weekend at wave one, there are some marked differences in the pattern and magnitude of \ncoefficients between these samples. The low knowledge group on attitudes 2, 3 and 4, for instance, is \nmarkedly higher in the weekend sample than amongst those who did not participate in the \ndeliberations. \n \nTABLE 5 ABOUT HERE \n \nIn terms of change, the pattern in the European issues poll is more consistent, with three of the four \nsets of items showing an increase in Alpha over the weekend for the sample as a whole. For attitude 1 \nthis increase was predominantly concentrated within the low knowledge group, while for attitude 3 \nthe change was mainly confined to those in the medium knowledge group. For attitude 4, the increase \nwas consistent across groups, though none reached statistical significance at the 95% level of \nconfidence. Three significant between group differences remained at the end of the weekend, with the \nhigh knowledge group having significantly the largest Alpha on attitudes 1, 2 and 3. \n \nTable 6, shows the results for the fifth and final poll on attitudes toward the National Health Service. \nIn attitudes 1 and 2, there is a gradient in Alpha coefficients but this is a downward gradient, with the \nlow knowledge group having the highest coefficient, though this is only statistically significant on the \nweekend sample for attitude 2. On attitude 3 there is a partial upward gradient with the high \nknowledge group showing a significantly higher coefficient than the low knowledge group in the \nbaseline sample but not in the weekend sample.  \n \nTABLE 6 ABOUT HERE \n \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 14 \nThere were no significant changes in Alpha for the overall sample over the course of the weekend but, \nfor attitudes 1 and 2, the low and medium knowledge groups showed a significant decline in scale \nreliability. By the second wave of measurement, no significant differences remained between groups. \n \nPerhaps the one clear thing that is immediately apparent from this set of results is that there is no clear \nor consistent pattern discernible across studies. While the majority of studies exhibited an upward \ngradient in coefficients by knowledge group amongst the full wave one sample, a significant minority \ndid not and several showed a gradient in the opposite direction. The predominant trend, in relation to \nour main research hypothesis, was no change in consistency over the course of the weekend. On the \nother hand, six out of sixteen attitude scales did show a significant shift – considerably more than \nchance alone would predict. However, two of these changes were in a downward direction, the \nopposite of what our theoretical model would lead us to expect. And, although there was some \nevidence to support the idea that existing knowledge level mediates the magnitude of change in \nattitude consistency, no clear pattern emerged across the studies examined to show what the \nfunctional form of this relationship might be. \n \nA META-ANALYSIS \nIn order to provide a more satisfactory summary of these somewhat disparate findings, we conducted \na meta-analysis of the sixteen attitude scales across all five studies. Meta-analytic techniques see effect \nsizes estimated from single studies as units drawn from a hypothetical population of possible studies. \nAs such, relying on single studies for effect size estimates relies on the unlikely event that the single \nstudy is representative of all possible studies that could have been sampled from this population \n(Rosenthal 1991). The basic objective of meta-analysis is, therefore, to provide pooled estimates of \neffect sizes through a weighted average of the effect sizes of the individual studies (Hall et al 1994). A \nkey aspect of any meta-analysis is, therefore, to conduct a thorough search of all extant studies which \nshould then be included in the pooled estimate (Wolf 1986). In the current instance, this requirement \ncan only be satisfied by extending the scope of the study or by limiting the population of inference to \nthose polls conducted in the UK, admittedly a somewhat expedient and artificial restriction. \nNonetheless, we have no theoretical or empirical reason to expect that the effect sizes in deliberative \npolls should vary widely across countries and restricting our leverage in this way allows a convenient \nsummary of what is certainly a rather disparate set of individual study results. \n \nEffect sizes can be pooled across studies assuming either fixed or random effects. A fixed effects \nmodel assumes that the variability in effect sizes across studies is exclusively due to random variation \nand that, with sufficiently large sample sizes, all studies would provide identical estimates. A random \neffects model assumes heterogeneity of effects across studies and incorporates this additional source \nof variation in the pooled effect size estimate. This usually results in wider confidence intervals than a \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 15 \nfixed effects model fitted to the same data. In the tables that follow, all estimates are derived from \nrandom effects models, making our estimate of variability across studies quite liberal6. \n \nTable 7 shows the pooled effect size for the difference in Alpha between those who did and those who \ndid not attend the deliberative weekend. One of the main lines of criticism of the validity of the \ndeliberative  poll methodology has been that those who participate in the weekend of deliberation will \nlikely differ in important ways from the general population, despite matching on broader \ndemographic criteria (Mitofsky 1996a; 1996b; Tringali 1996). The non-significant difference in Alpha \nbetween samples, if we can accept this operationalisation of the constraint construct, indicates that \nattitude constraint is not such a variable. It also suggests that the general lack of over-time change is \nunlikely to be as a result of biases in the composition of the samples examined here. \n \nTABLE 7 ABOUT HERE \n \nTable 8 shows the pooled effect sizes for differences in Alpha between knowledge groups, for the \nwhole baseline sample and the weekend sample at waves one and two. The familiar gradient in \ncoefficients with increasing knowledge is discernible for the baseline sample, although the difference \nbetween medium and low knowledge groups does not reach statistical significance. The numbers, in \nabsolute terms, are certainly not large but the upward pattern is clear. For the weekend sample at \nwave 1, the general pattern remains, although not significantly and the suggestive difference between \nmedium and low knowledge groups in the baseline sample has disappeared completely. This may \nwell be as much the result of our imposition of too fine a gradation in  knowledge groups for a sample \nof this size, as to actual differences between ‘groups’; it may be the case that a better characterisation \nof the knowledge gradient for the scales in question would be between those high and low in \nknowledge, omitting a ‘medium’ category entirely. \n \nTABLE 8 ABOUT HERE \n \nInterestingly, at wave two, the weekend sample return to the pattern observed amongst the baseline \nsample, with the high knowledge group exhibiting significantly greater coefficients than both low and \nmedium knowledge groups, albeit at somewhat diminished magnitudes. This perhaps goes some way \nto dispelling the notion that the deliberative weekend acts as some kind of ‘equalising’ force and lends \nsupport to the idea that more politically sophisticated individuals process and integrate information \nmore efficiently than their less sophisticated counterparts (Krosnick and Milburn 1990; Delli Carpini \n                                                                 \n6 Random effects models are generally preferred when statistical tests indicate that there is significant effect size heterogeneity \nacross studies, which was generally, though not always, the case in the analyses conducted here. \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 16 \nand Keeter 1996; Althaus 1998). By providing information in this ‘avalanche-like’ manner, the \npossibility exists that we may actually be widening the gap we are intending to broach.  \n \nMoving now to a consideration of our main research hypothesis, Table 9 shows the pooled estimate of \nthe change in Alpha between waves one and two, for the weekend sample as a whole and within each \nof the extant knowledge groups. The 95% confidence intervals show that only the pooled estimates for \nthe sample as a whole and the high knowledge group are statistically significant. The average \nmagnitude of the increase across all studies was only 0.024, a difference that would be unlikely to \nstrike the average reader as of particular substantive interest. However, the significant value of Q for \nthe test of heterogeneity of effects across studies indicates that, as we saw in the results of the \nindividual polls, this average figure masks a good deal of variation across issues and studies. Clearly \nthen, the deliberative process can have exactly the effect that Converse and Zaller and Feldman’s \nmodels would lead us to expect. \n \nTABLE 9 ABOUT HERE \n \nFinally, there is no evidence in Table 9, to suggest that the impact of the deliberative process on \ncorrelational measures of attitude constraint is somehow moderated by existing level of knowledge \nabout the issue in question. The pooled effect sizes show moderate increases in coefficients, on the \nfringes of statistical significance which are almost identical across the three knowledge groups. \n \n5 DISCUSSION \nThe aim of this paper has been to exploit the unusual features of the deliberative polling methodology \nto explicitly test the hypothesis that the low inter-item correlations commonly observed amongst the \npolitically less informed members of the public are caused by a lack of information about the objects of \ntheir attitudes. This has been the implicit rationale underlying the many studies that have \ndemonstrated a steep upward gradient in the magnitude of inter-item correlations with increasing \npolitical interest, involvement and knowledge. If this rationale is correct, we should expect to see \nincreases in the magnitude of statistical associations between attitude items following a weekend in \nwhich political issues and preferences have formed the focus of deliberation and debate. Such \nmeasures of ‘opinion quality’, in addition to the observation of net and gross attitude change, are also \nnecessary for a proper evaluation of the claims made for deliberative polls as a means of uncovering \n‘enlightened preferences’ (Price and Neijens 1997; 1998). Was the significant change in attitude and \nknowledge after deliberation in these studies (Fishkin 1997; Luskin, Fishkin and Jowell 2002; Sturgis \n2003), then, accompanied by concomitant increases in the internal consistency of respondents’ attitude \nsystems? \n \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 17 \nAcross five different deliberative polls, sixteen attitude scales, comprising ninety seven individual \nitems the evidence for such an effect was both patchy and inconsistent. While some polls appeared to \nshow a rather strong and consistent pattern confirming the expectation that statistical associations \nbetween items would increase after deliberation (the Europe poll), others showed no change at all (the \nelection issues poll), and others still showed a downward movement (the NHS poll), the opposite of \nwhat our theoretical model would lead us to expect. Clearly then, if it is knowledge, deliberation and \nengagement that cause gradients in correlational measures of constraint in cross-sectional surveys – a \nfinding broadly replicated in the data studied here, the deliberative poll would not appear capable of \nconsistently reproducing the direction and magnitude of the effect over the relatively short period \ninvolved.  \nA potential barrier to the acceptance of this conclusion is the issue of whether the before and after \nsamples are truly representative of the general population. Perhaps the main feature of deliberative \npolling which sets it apart from other ‘deliberative’ methodologies such as citizens’ juries and \nplanning cells, is its probabilistic design and consequent generalisability of the achieved sample. \nInvestigations of the representativeness of deliberative poll samples have, thus far, been based \nprimarily on demographic characteristics such as age, sex, education and social class, variables which \nappear to match population totals with impressive closeness (Fishkin 1997; Luskin, Fishkin and Jowell \n2002). As with quota sampling, however, such equivalence does not guarantee representativeness \nacross all survey variables. A genuine and plausible concern is that it is the more politically \nsophisticated individuals from within these demographic groups that tend disproportionately to \nparticipate in deliberative polls (Tringali 1996; Sturgis 2001). In the current instance, this might \nmilitate against finding evidence of increasing constraint, if the participants are already amongst the \nmore politically sophisticated and, therefore, constrained members of the public. The evidence from \nthe analyses presented here do not support this hypothesis; on only one of sixteen attitude scales was \nthere a significant difference between the baseline and weekend samples in the level of constraint, as \nwe have operationalised it here. On a broader and more general measure of sophistication, then, there \nwould appear to be little evidence of bias in these deliberative poll samples. \n \nGiven the disparate nature of the effects across the five studies, a meta-analysis was conducted to \ndetermine whether any general pattern could be discerned statistically, as opposed to visually and \nimpressionistically, across studies. This revealed that, taken together, the polls exhibited a modest but \nstatistically significant increase in constraint over the course of the weekend, confirming - if somewhat \nweakly - the main research hypothesis we set out to evaluate. There was no evidence to suggest, \nhowever, that this effect was differentially related to respondents’ knowledge level prior to the \nweekend of deliberation as effects were uniform across the knowledge groups examined. In drawing \nsuch conclusions, it is as well to remember that the sample sizes we are dealing with do not afford a \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 18 \ngreat deal of power to detect systematic effects, a fact which is likely to be partially responsible for \nsome of the apparently contradictory findings we have reported. The pooled effect size estimate of \nchange in Alpha over the weekend masked statistically significant heterogeneity across the individual \nstudy elements. This would seem to offer a fruitful avenue for future research – by incorporating \nvariables that differentiate between polls and attitudes in this type of meta-analysis, it should be \npossible to begin to explain what it is about particular issues and political contexts that leads to \ndifferential effects. \n \nWhile the results for the whole sample analysis, then, indicate a slight increase in the degree of \ninternal consistency of attitudes over the course of the weekend, this must be placed in the context of \nfindings from similar models fitted to panel surveys with no specific ‘information intervention’ \nbetween waves, for what we lack in the analyses conducted here is any form of control group. We are, \nas a result, unable to disentangle the effect of increased information and deliberation from that \nengendered by simply participating in two waves of a panel study. Jagodzinski et al (1987), for \nexample, find an average increase in item reliabilities of 19%7 between waves one and two on a four \nitem scale measuring attitude toward guest workers in West Germany, an effect they attribute to the \nsimple fact that “related or logically interdependent issues appear to stimulate respondents to reflect \non the relations between their attitudes, opinions and behaviour” (Jagodsinski, et al. 1987, p.260). On a \nsix item scale measuring ‘left-right’ political orientation, a 10% increase on the same parameter was \nobserved between waves one and two of the British Household Panel Study (Sturgis, 2001). If this is \nthe effect of simply being administered a questionnaire, then we would surely expect the effects of \nattending a deliberative poll to be substantially greater. \n \nSuch comparisons lead us to conclude that the evidence we have presented here cannot be taken as \nshowing that participation in deliberative polls leads to increases in constraint, as this construct has \ntraditionally been operationalised. This general conclusion must be qualified, however, by noting that \nsuch an effect is certainly a possible, even a probable outcome of the deliberative polling process for \nany given issue. The way forward for research in this area would seem, then, to be a careful \ndelineation of the characteristics of issues, sample designs and political contexts which predict \nwhether increased knowledge and deliberation result in a corresponding growth in attitude \nconstraint. \n \n                                                                 \n7 Our own calculation from Table 3, page 292 (Jagodzinski et al. 1987). \n \n \n \n \n \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 19 \nREFERENCES \nAberbach, J., Puttnam, R. and Rockman, B. (1981) Bureaucrats and Politicians in Western Democracies. \nCambridge, Massachusetts: Harvard University Press. \nAchen C  (1975) Mass Political Attitudes and the Survey Response. American Political Science Review  \n69(1218-23). \nAchen, C. (1982) Interpreting and using regression, Beverly Hills, Sage. \nAlthaus S (1998) Information Effects in Collective Preferences. American Political Science Review  92(3), \n545-558. \nAsher, H. (1974) Some Consequences of Measurement Error in Survey Data. American Journal of \nPolitical Science 18: 469-485. \nBalch G  (1979) Statistical Manipulations in the Study of Issue Consistency: The Gamma Coefficient. \nPolitical Behaviour  1,217-41. \nBartels L  (1996) Uninformed Votes: Information Effects in Presidential Elections. American Journal of \nPolitical Science  40(1), 194-230. \nBartle J  (2000) Political Awareness, Opinion Constraint and the Stability of Ideological Positions. \nPolitical Studies  48, 3, pp. 467-484 \nBarton A and Parsons R  (1977) Measuring Belief System Structure. Public Opinion Quarterly  41,159--\n80. \nBennett S (1988) \"Know-Nothings\" Revisited: The Meaning of Political Ignornance Today. Social \nScience Quarterly  17,422-35. \nBennett S, Oldendick R, Tuchfarber A and Bishop G  (1979) Education and Mass Belief Systems: An \nExtension and some new Questions. Political Behaviour  1, 53-71. \nBollen, K.A. (1989). Structural Equations with Latent Variables. NY: Wiley. \nButler D and Stokes D E (1969) Political change in Britain : forces shaping electoral choice. Macmillan, \nLondon. \nButler D and Stokes D E (1974) Political change in Britain : the evolution of electoral choice.(2nd edition) \nMacmillan, London. \nCampbell A, Converse P, Miller W and Stokes D (1960) The American Voter. John Wiley, New York. \nConverse P (1964) The Nature of Belief Systems in Mass Publics.  In Ideology and Discontent  (D. A ed.)  \nFree Press, New York.  \nConverse P  (1975) Some Mass Elite-Contrasts in the Perception of Political Spaces. Social Science \nInformation  14,49-83. \nConverse P  (1980) Comment: Rejoinder to Judd and Milburn. American Sociological Review  45,644-46. \nConverse, P. and Pierce, R. (1985) Political Representation in France. Cambridge, Mass.: Harvard \nUniversity Press. \nConverse P (1990) Popular Representation and the Distribution of Information.  In Information and \nDemocratic Processes  (Ferejohn A and Kuklinski J eds.)  University of Ilinois Press, Urbana.  \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 20 \nConverse, P. (2000) Assessing the Capacity of Mass Electorates. Annual Review of Political Science (3), \n331-353. \nCoote, A. & Lenhaglan, J. 1997 Citizens’ Juries: From Theory to Practice. IPPR, London. \nCronbach L.J. (1951). Coefficient Alpha and the Internal Structure of Tests. Psychometrika, 16, \n297-334. \nDelli Carpini M X (1985) Stability and change in American politics : the coming of age of the generation of the \n1960s. New York University Press, New York. \nDelli Carpini M X and Keeter S (1996) What Americans know about politics and why it matters. Yale \nUniversity Press, New Haven [Conn.]. \nDempster, Arthur Laird, Nan and Rubin, Donald (1977) Maximum Likelihood Estimation from \nIncomplete Data via the EM Algorithm. Journal of the Royal Statistical Society, Methodological Series B, 39: \n1-38. \nEagly A and Chaiken S (1993) The Psychology of Attitudes. Harcourt Brace Jovanovich, San Diego, CA \nand Fort Worth, TX. \nEfron, B. (1979). Bootstrap methods: another look at the jackknife, Annals of Statistics 7 1-26. \nErikson R  (1979) The SRC Panel Data and Mass Political Attitudes. British Journal of Political Science  \n9,89-114. \nErikson R and Luttberg N (1973) American Public Opinion: Its Origins, Content and Impact. Wiley, New \nYork. \nFeldman S  (1988) Structure and Consistency in Public Opinion: The Role of Core Beliefs and Values. \nAmerican Journal of Political Science  32,416-440. \nFishkin (1991) Democracy and Deliberation: New Directions for Democratic Reform. Yale University Press, \nNew Haven, CT. \nFishkin J (1995) The Voice of the People: Public Opinion and Democracy.(1st) Yale University Press, New \nHaven, CT. \nFishkin J (1997) The Voice of the People: Public Opinion and Democracy.(2nd) Yale University Press, New \nHaven, CT. \nGilens, Martin (2001) Political Ignorance and Collective Policy Preferences. American Political Science \nReview 95 (2): 379-396. \nHeath A, Evans G and Martin J  (1993) The Measurement of Core Beliefs and Values: The \nDevelopment of Balanced Socialist\/Laissez Faire and Libertarian\/Authoritarian Scales. British Journal \nof Political Science  24,115-133. \nHall, J.A., Tickle-Degnen, L., Rosenthal, R., & Mosteller, F. (1994). Hypotheses and problems in \nresearch synthesis. In H. Cooper and L.V. Hedges (Eds.), The handbook of research synthesis. New York: \nRussell Sage Foundation. \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 21 \nHimmelweit H T, Humphreys P and Jaeger M (1985) How voters decide : a model of vote choice based on a \nspecial longitudinal study extending over fifteen years and the British election surveys of 1970-1983 Open \nUniversity Press, Milton Keynes. \nHyman H and Sheatsley P  (1947) Some Reasons Why Information Campaigns Fail. Public Opinion \nQuarterly  11,412-23. \nIyengar S  (1973) The Problem of Response Stability: Some Correlates and Consequences. American \nJournal of Political Science  17(4), 797-808. \nJackson T and Marcus G  (1975) Political Competence and Ideological Constraint. Social Science \nResearch  4,93-111. \nJagodsinski W, Kuhnel S M and Schmidt P  (1987) Is There a \"Socratic Effect\" in Nonexperimental \nPanel Studes? Consistency of an Attitude Toward Guestworkers. Sociological Methods and Research   \n15(3), 259-302. \nJennings M  (1992) Ideology Among Mass Publics and Political Elites. Public Opinion Quarterly  56,419-\n441. \nJoreskog K (1973) A General Method for a General Structural Equation System.  In Structural Equation  \nModels in the Social Sciences  (Goldberg A and Duncan O eds. )  Seminar, New York.  \nJoreskog K (1993) Testing Structural Equation Models.  In Testing Structural Equation Models  (Bollen K \nand Long J S eds. )  Sage, London.  \nJoreskog K and Sorbom D (1989) LISREL 7: A Guide to the Program and Applications. SPSS Inc., Chicago. \nJowell R, Hedges B, Lynn P, Farrant G and Heath A  (1993) Review: The 1992 British Election: The \nFailure of the Polls. Public Opinion Quarterly  57(2), 238-263. \nJudd C and Milburn M  (1980) The Structure of Attitude Systems in the General Public: Comparisons \nof a Structural Equation Model. American Sociological Review  45,627-43. \nJudd C M, Krosnick J and Milburn A  (1981) Political Involvement and Attitude Structure in the \nGeneral Public. American Sociological Review  46,660-669. \nKinder D and Sears D (1985) Public Opinion and Political Action.  In The Handbook of Social Psychology  \n(Lindzey G and Aronson E eds. )  (3rd) 659-741, Random House, New York.  \nKinder R (1998) Opinion and Action in the Realm of Politics.  In The Handbook of Social Psychology  (, T. \nD, Gilbert S, Fiske T, Gardner L and G T eds.)  McGraw Hill, Boston.  \nKing, Gary. “How Not to Lie With Statistics: Avoiding Common Mistakes in Quantitative \nPolitical Science,” American Journal of Political Science, Vol. 30, No. 3 (August, 1986): \nPp. 666–687. \nKreuger R.A. (1988) Focus groups: a practical guide for applied research. London: Sage. \nLane R E (1962) Political ideology : why American common man believes what he does. Free Press, New \nYork. \nKrosnick, J. and Milburn, M. (1990) Psychological Determinants of Political Opinionation. Social \nCognition 8(1): 49-72. \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 22 \nLupia A and McCubbins M D (1998) The democratic dilemma : can citizens learn what they need to know?  \nCambridge University Press, Cambridge, U.K. ; New York. \nMansbridge J (1983) Beyond Adversary Democracy. University of Chicago Press, Chicago. \nLuskin R  (1987) Measuring Political Sophistication. American Political Science Review  31,856-99. \nMartin S  (1981) New Methods Lead to Familiar Results: Comment on Judd and Milburn. American \nSociological Review  46,670-75. \nLuskin, R Fishkin, J and Jowell, R (2002) Considered Opinions: Deliberative Polling In Britain British \nJournal of Political Science, 32(3) \nMcArdle J J and Nesselroade J R (1994) Using Multivariate Data to Structure Developmental Change.  \nIn Life-Span Developmental Psychology: Methodological Contributions  (Cohen S H and Reese H W eds. )  \nLawrence Erlbaum, Hillsdale, NJ.  \nMcGuire W  (1960) Cognitive Consistency and Attitude Change. Journal of Abnormal and Social \nPsychology  3,345-353. \nMerkle D  (1996) The National Issues Convention Deliberative Poll. Public Opinion Quarterly  60,588-\n619. \nMitofsky W  (1996a) The Emperor Has No Clothes. Public perspective  7(1), 17-19. \nMitofsky W  (1996b) It's Not Deliberative and it's not a Poll. Public Perspective  7(3), 4-6. \nNeijens, P. (1987) The Choice Questionnaire. Design and Evaluation of an Instrument for Collecting Informed \nOpinions of a Population. Amsterdam, Free University Press. \nNie N and Anderson K  (1974) Mass Belief Systems Revisited: Political Change and Attitude Structure. \nAmerican Journal of Sociology  86(1236-68),  \nNie N and Verba S (1975) Political Participation.  In Handbook of Political Science  (Greenstein F and \nPolsby N eds. )  Addison-Wesley,  Reading: Mass.  \nNie N, Verba S and Petrocik J (1979) The Changing American Voter. Harvard University Press, \nCambridge. \nNorthpot H and Lodge M  (1985) The Difference between Attitudes and Nonattitudes in the Mass \nPublic: Just Measurements. American Political Science Review  29(2), 291-307. \nPage B and Shapiro R (1992) The Rational Public: Fifty Years of Trends in American's Policy Preferences. \nUniversity of Chicago Press, Chicago. \nPeffley M and Hurwitz J  (1985) A Hierarchical Model of Attitude Constraint. American Journal of \nPolitical Science  29,871-90. \nPrice, Vincent and Neijens, Peter (1997) Opinion Quality in Public Opinion Research International \nJournal of Public Opinion Research  9: 336-360. \nPrice, Vincent and Neijens, Peter (1998) Deliberative Polls: Toward improved measures of ‘informed’ \npublic opinion? International Journal of Public Opinion Research  10: 145-176. \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 23 \nRenn, O, Stegelmann, H., Albrecht, G, Kotte, U. and Peters H. (1984) An Empirical Investigation of \ncitizens' preferences among four energy alternatives.Technological Forecasting and Social Change, 26 11-\n46. \nRokeach M (1973) The Nature of Human Values. Free Press, New York. \nRosenberg S (1988) Atttitude, Belief and Ideology: The Need for New Directions.  In Political Reasoning \nand Cognition: A Piagetian View  (Rosenberg S, Ward D and Chilton S eds.)  Duke University Press, \nDurham.  \nSchuman H and Presser S (1981) Questions and Answers in Attitude Surveys: Experiments on Question \nForm, Wording and Context. Academic Press, New York. \nSinnott, R. (2000) Knowledge and the position of attitudes to a European foreign policy on the real-to-\nrandom continuum. International Journal of Public Opinion Research , 12, 113-137. \nSmith, Tom W. (1984) Nonattitudes: A Review and Evaluation.  In Surveying Subjective Phenomena  \n(Turner C and Martin E eds.)  Academic Press, New York Pp 215-255.  \nSniderman P and Tetlock P (1986) Interrelationship of Political Ideology and Public Opinion.  In \nPolitical Psychology: Contemporary Problems and Issues  (Hermann M ed. )  62-96, Jossey-Bass, San \nFrancisco.  \nStevens J  (1995) Confirmatory Factor Analysis of the Iowa Test of Basic Skills. Structural Equation \nModeling   2(3). \nStimson J  (1975) Belief Systems: Constraint, Complexity, and the 1972 Election. American Journal of \nPolitical Science  19(3), 393-417. \nSturgis P (2001) Political Attitudes: The Role of Information as a Determinant of Direction, Structure and \nStability.  PhD Thesis, London School of Economics and Political Science, London. \nSturgis P (2003) Knowledge and Collective Preferences: A Comparison of two Approaches to Estimating the \nOpinions of a Better Informed Public  Sociological Methods and Research 31(4). \nTringali, Brian  (1996) Experimenting with Artificial Democracy. Public Perspective  7(1), 19-20. \nvan Knippenberg, D. and Daamen, D (1996) Providing information in public opinion surveys: \nmotivation and ability effects in the information-and-choice questionnaire International Journal of Public \nOpinion Research  8: 70-82. \nWakeford, T. (2003) Citizens Juries: a radical alternative for social research. Social Research Update (37). \nWeissberg R  (1974) Models of Statistical Relationship. American Political Science Review  68,1638-55. \nWeissberg R  (1976) Consensual Attitudes and Attitude Structure. Public Opinion Quarterly  40,349-359. \nWolf, F.M. (1986). Meta-analysis: Quantitative methods for research synthesis. Newbury Park, CA: Sage. \nYankelovich, D. (1991) Coming to Public Judgement: Making Democracy Work in a Complex World, \nSyracuse, NY, Syracuse University Press. \nZaller J (1992) The Nature and Origins of Mass Opinion. Cambridge University Press, New York. \nZaller J and Feldman S  (1992) A Simple Theory of the Survey Response: Answering Questions versus \nRevealing Preferences. American Journal of Political Science  l36,579-616. \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 24 \nAPPENDIX 1 TABLES \n \nTable 1 Response Rates for Five UK Deliberative Polls \nPoll Date Initial Sample Deliberative Sample \nCrime 1994 869 (74%) 300 (26%) \nEurope 1995 900 (71%) 224 (18%) \nMonarchy 1996 857 (62%) 258 (19% \nElection Issues 1997 1210 (64%) 276 (15%) \nNHS 1998 955 (66%) 228 (16%) \n \n \n \n \n \nTable 2 Cronbach’s Alpha Across Waves and Knowledge Groups Election Poll  \nAttitude Knowledge \nLevel \nFull sample \nwave 1 \n \nn \nWeekend \nsample wave 1 \nWeekend \nsample  wave 2 \n \nn \nLow (0-2) .53MH 545 .66 .62 106 \nMedium (3-5) .64 L 539 .69 .74 136 \nHigh (6-8) .71 L 126 .70 .70 33 \nAttitude 1 \nAll .61 1210 .68 .70 275 \nM= significantly different from Medium Knowledge group; H=significantly different from High Knowledge group; \nL=significantly different from Low knowledge group; * = significantly different from wave 1; + = significantly different from full \nsample.  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 25 \nTable 3 Cronbach’s Alpha Across Waves and Knowledge Groups Crime Poll  \nAttitude Knowledge \nLevel \nFull sample \nwave 1 \n \nn \nWeekend \nsample wave 1 \nWeekend \nsample  wave 2 \n \nn \nLow (0-2) .50MH 244 .63 .62 69 \nMedium (3-5) .62LH 470 .67 .69 174 \nHigh (6-8) .74ML 155 .77 .70 57 \nAttitude 1  \nAll .63 869 .69+ .68 300 \nLow (0-2) .57 H 244 .58 .75* 69 \nMedium (3-5) .66H 470 .70 .76 174 \nHigh (6-8) .77 ML 155 .63 .78* 57 \nAttitude 2 \nAll .67 869 .68 .77* 300 \nLow (0-2) .57 H 244 .58 .75 69 \nMedium (3-5) .66 H 470 .70 .76 174 \nHigh (6-8) .77 ML 155 .63 .78 57 \nAttitude 3 \nAll .67 869 .68 .77 300 \nLow (0-2) .72 244 .80 .71 69 \nMedium (3-5) .72 470 .72 .65 174 \nHigh (6-8) .80 155 .79 .76 57 \nAttitude 4 \nAll .74 869 .76 .70 300 \nLow (0-2) .77 244 .68 .65 69 \nMedium (3-5) .71 470 .77 .75 174 \nHigh (6-7) .68 155 .57M .69* 57 \nAttitude 5 \nAll .72 869 .73 .71 300 \nM= significantly different from Medium Knowledge group; H=significantly different from High Knowledge group; \nL=significantly different from Low knowledge group; * = significantly different from wave 1; + = significantly different from full \nsample.  \n \n \n \n \n \n \n \n \n \n \n \n \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 26 \nTable 4 Cronbach’s Alpha Across Waves and Knowledge Groups Monarchy Poll  \nAttitude Knowledge \nLevel \nFull sample \nwave 1 \n \nn \nWeekend \nsample wave 1 \nWeekend \nsample  wave 2 \n \nn \nLow (0-2) .55 299 .52 .75* 80 \nMedium (3-5) .68 195 .64 .75 52 \nHigh (6-7) ..56 363 .55 .63 126 \nAttitude 1  \nAll .58 857 .55 .71* 258 \nLow (0-2) .88 299 .87 .91 80 \nMedium (3-5) .84 195 .86 .85 52 \nHigh (6-7) .88 363 .88 .90 126 \nAttitude 2 \nAll .87 857 .88 .90 258 \nLow (0-2) .89 299 .90 .91 80 \nMedium (3-5) .90 195 .87 .90 52 \nHigh (6-7) .91 363 .92 .93 126 \nAttitude 3 \nAll .90 857 .90 .92 258 \nLow (0-2) .59 M 299 .63 M .63 80 \nMedium (3-5) .42LH 195 .45LH .57 52 \nHigh (6-7) .61 M 363 .66 M .64 126 \nAttitude 4 \nAll .57 857 .59 .60 258 \nM= significantly different from Medium Knowledge group; H=significantly different from High Knowledge group; \nL=significantly different from Low knowledge group; * = significantly different from wave 1; + = significantly different from \nnon-weekend sample. \n \nTable 5 Cronbach’s Alpha Across Waves and Knowledge Groups Euro Poll  \nAttitude Knowledge \nLevel \nFull sample \nwave 1 \n \nn \nWeekend \nsample wave 1 \nWeekend \nsample  wave 2 \n \nn \nLow (0-2) .39 MH 266 .38 MH .70* 53 \nMedium (3-5) .54 LH 396 .59 L .61H 103 \nHigh (6-7) .71 ML 238 .72 L .80 M 68 \nAttitude 1  \nAll .59 900 .60 .71* 224 \nLow (0-2) .53 266 .67 .68 53 \nMedium (3-5) .51 396 .54 .55 H 103 \nHigh (6-7) .68 ML 238 .60 .72 M 68 \nAttitude 2 \nAll .56 900 .59 .63 224 \nLow (0-2) .59 MH 266 .73 .74 H 53 \nMedium (3-5) .71 LH 396 .63 H .81* 103 \nHigh (6-7) .85 ML 238 .85 M .87 L 68 \nAttitude 3 \nAll .75 900 .75 .83* 224 \nLow (0-2) .54 MH 266 .73 .84 53 \nMedium (3-5) .68 LH 396 .65 H .73 103 \nHigh (6-7) .78 ML 238 .75 M .83 68 \nAttitude 4 \nAll .69 900 .70 .79* 224 \nM= significantly different from Medium Knowledge group; H=significantly different from High Knowledge group; \nL=significantly different from Low knowledge group; * = significantly different from wave 1; + = significantly different from \nnon-weekend sample. \n \n \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 27 \nTable 6 Cronbach’s Alpha Across Waves and Knowledge Groups NHS Poll  \nAttitude Knowledge \nLevel \nFull sample \nwave 1 \n \nn \nWeekend \nsample wave 1 \nWeekend \nsample  wave 2 \n \nn \nLow (0-2) .66 H 316 .72 H .55* 73 \nMedium (3-5) .54 288 .53 .50 68 \nHigh (6-7) .50L 351 .49 L .60 90 \nAttitude 1  \nAll .58 955 .59 .55 231 \nLow (0-2) .82 316 .84 H .80  73 \nMedium (3-5) .76 288 .83 .73* 68 \nHigh (6-7) .79 351 .76 L .79 90 \nAttitude 2 \nAll .79 955 .81 .77 231 \nLow (0-2) .61 H 316 .52 .65 73 \nMedium (3-5) .69 288 .74 .77 68 \nHigh (6-7) .77 L 351 .68 .70 90 \nAttitude 3 \nAll .70 955 .66 .72 231 \nM= significantly different from Medium Knowledge group; H=significantly different from High Knowledge group; \nL=significantly different from Low knowledge group; * = significantly different from wave 1; + = significantly different from \nnon-weekend sample. \n \n \n \n \n \nTable 7 Meta-Analysis  of Difference Between Baseline and Weekend Samples  \nWeekend-Baseline Pooled Effect 95% confidence interval Q df P \n0.014 -0.002 0.029 23 15 0.098 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 28 \nTable 8 Meta-Analysis of Differences Between Knowledge Groups  \nKnowledge \nLevel \nFull sample \nwave 1 \nWeekend \nsample wave 1 \nWeekend \nsample  wave 2 \nHigh-Low 0.099* 0.024 0.038* \nMedium - Low 0.031 -0.009 0.009 \nHigh - Medium 0.067* 0.037 0.044* \nNotes: First row shows pooled estimate of high knowledge group minus low knowledge group; second row the medium \nknowledge group minus low knowledge group and third row high knowledge group – medium knowledge group; * = \nsignificantly different from zero. \n \n \n \n \nTable 9 Meta-Analysis of Change Between waves one and two Weekend Sample \nKnowledge \nLevel \nChange  \nPooled Effect \n \n95% Confidence Interval \n \nQ \n \ndf \n \nP \nLow (0-2) 0.020 -0.021 0.062 23 15 0.098 \nMedium (3-5) 0.022 -0.012 0.055 21 15 0.129 \nHigh (6-8) 0.017 0.001 0.034 14 15 0.532 \nAll 0.024 0.003 0.046 29 15 0.018 \n \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 29 \nAPPENDIX 2 QUESTION WORDING FOR ATTITUDE SCALES \n \nElection Issues Poll \nAttitude 1 \n1. “How much do you agree or disagree that people earning around £50,000 a year or more should \npay higher income tax than now?” response scale = 5 point Likert. \n2. “Where do you stand on making people’s incomes more equal? Are you in the top  box, \nagreeing completely with the statement alongside it (Government should try much harder to \nmake incomes in Britain more equal)? Or in the bottom box, agreeing completely with that \nstatement (Government should do nothing to make incomes in Britain more equal)? Or in one \nof the other boxes somewhere in between ? response scale = 7 point Likert. \n3. “Where do you stand on taxes and spending? Are you in the top box, agreeing completely with \nthe statement alongside it (Government should spend a lot more on services like education, \nhealth, even if it means putting up taxes a lot)? Or in the bottom box, agreeing completely \nwith that statement (Government should spend much less on services like education and \nhealth in order to cut taxes)? Or in one of the other boxes somewhere in between? response \nscale = 7 point Likert. \n4. “Where do you stand on the minimum wage? Are you in the top box, agreeing completely with \nthe statement alongside it (Government should definitely introduce a minimum wage so that \nno employer can pay their workers too little)? Or in the bottom box, agreeing completely with \nthat statement (Government should definitely not introduce a minimum wage because too \nmany low paid workers would then lose their jobs)? Or in one of the other boxes somewhere \nin between? response scale = 7 point Likert. \n \nMonarchy Poll \n \nAttitude 1  (all answered on 5-point Strongly Agree to Strongly disagree response scales) \n1. People like me have no say in what the government does \n2. I have opinions about politics that are worth listening to  \n3. In Britain today, it is too difficult for ordinary people to make their voices heard \n4. I think I am better informed than most people about politics and government \n \nAttitude 2  (all answered on 4-point Very important to Not at all important response scales) \nHere are some good things that the British monarchy is said to do.  Please show how important \nyou think the monarchy’s role is in each of these areas. \n1. Attracting tourists to Britain  \n2. Gaining international respect for Britain \n3. Preventing any government abusing its power \n4. Attracting trade to Britain  \n5. Linking Britain’s present with its past  \n6. Uniting people throughout Britain \n7. Keeping Britain a stable democracy  \n8. Publicising and helping ‘good causes’  \n \nAttitude 3 (all answered on 5-point Strongly Agree to Strongly disagree response scales) \n1. The monarchy is an expensive luxury that Britain cannot any longer afford  \n2. The monarchy comes across as too  English, rather than representing Britain \n3. The royal family benefits the rich and powerful at the expense of the rest of society \n4. The monarchy props up a snobbish system of giving titles to people in high places \n5. Having a monarchy stops Britain from  adapting to the modern world \n6. The monarchy keeps alive divisions  between different classes in Britain  \n7. The monarchy makes Britain seem a stuck-up and stuffy country  \n \n \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 30 \nAttitude 4   (all answered on 5-point Strongly Agree to Strongly disagree response scales) \n1. The British monarchy would be more acceptable if it did not depend on the taxpayer for so \nmuch support \n2. If a Head of State is only a figurehead it doesn’t matter whether they are elected or born into the \njob \n3. A good thing about monarchs is that  they are more likely to stand above  politics than are \nelected Heads of State \n4. It would be a good thing if the Queen had more powers  \n5. An elected Head of State would behave too much like any ordinary politician \n6. Combining a monarch and a prime minister into a single Head of State would give a single \nperson too much political power  \n7. A good thing about monarchs over elected Heads of State is that they usually stay in office \nlonger \n \nEurope Poll \n \nAttitude 1 (all answered on 5-point Strongly Agree to Strongly disagree response scales) \n1. Unless Britain keeps its own currency, it will lose control of its own economic policy \n2. The EU countries should be more than just a trading bloc – their governments should make \njoint decisions on other things too \n3. Britain does not get enough out of the EU, in comparison to what it puts in \n4. All things considered, Britain is a lot better off in the EU than out of it \n5. Lots of good British traditions will have to be given up if we strengthen ties with the EU \n6. The cost of living in Britain would rise significantly if we left the EU \n7. Peace is much more secure because Britain is a member of the EU \n8. Only the Germans have anything to gain from a single European currency \n \nAttitude 2 (all answered on 5-point Strongly Agree to Strongly disagree response scales) \n1. If we left the EU, Britain would lose its best chance of real progress  \n2. In a united Europe the various nations will lose their culture and their individuality \n3. Competition from other countries in the EU is making Britain more modern and efficient \n4. If we stay in the EU, Britain will lose too much control over decisions that affect Britain \n5. There would be serious unemployment in Britain if we left the EU \n \nAttitude 3 (all answered on 5-point Strongly Agree to Strongly disagree response scales) \n1. British seas should only be open to British fishing boats \n2. Britain should sign up to the EU rules for protecting people’s rights at work (the Social \nChapter) \n3. The EU should expand its membership to include some of the ex-Communist countries of \nEastern Europe \n4. The EU has too many petty rules and regulations which affect they way we live \n5. If we signed up to the EU rules for protecting people’s rights at work (the Social Chapter) \nwould cost Britain jobs \n \nAttitude 4  (all answered on 5-point Strongly Agree to Strongly disagree response scales) \nTaxpayers all over Europe are paying too much towards the costs of running the European Union \n1. Only businessmen are benefiting from Britain being a member of the EU \n2. If we had a single European currency, British mortgage rates would be more likely to rise \n3. EU rules are fairer to British farmers in most other European countries \n4. Passport controls within the EU should be removed altogether \n \nNHS Poll \n \nAttitude 1 (all answered on 4-point Very likely to Not at all likely response scales) \nSuppose you had to go into your local NHS hospital for observation and maybe an operation.  From \nwhat you know or have heard, please say how likely you think it would be that  \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 31 \n1. the hospital doctors would take seriously any complaints you make?  \n2. you would not be allowed home before you were really well enough to leave? \n3. the hospital doctors would take seriously any views you had on the sorts of treatment \navailable? \n4. the operation would take place on the day it was booked to take place? \n \nAttitude 2 (all answered on 5-point Strongly in favour to Strongly against response scales) \nOne way of getting more money into the NHS is to charge people for certain things.  How much \nwould you be in favour of or against introducing charges for … \n1. visiting your GP?  \n2. your GP visiting you at home? \n3. the cost of your hospital meals when you are an inpatient? \n4. the cost of accommodation while you are in hospital?  \n5. using a non-emergency ambulance? \n \nAttitude 3 (all answered on 5-point Strongly Agree to Strongly disagree response scales) \n1. Most people who are very poor have only themselves to blame \n2. We are too concerned nowadays about  those who will never succeed in life \n3. Life is never fair, and there is no point in government trying to make it fairer  \n \nCrime Poll \n \nAttitude 1 (all answered on 5-point Strongly Agree to Strongly disagree response scales) \nHere are some ideas for changing the legal system, and sentencing for criminals. Please tick one box \nfor each idea to show how much you agree or disagree with it. \n1. Fewer suspects should have the right to a jury trial. \n2. A confession made during police questioning should not on its own be enough to convict \nsomeone. \n3. The rules in court should be less on the side of the accused. \n4. The courts should no longer treat suspects as innocent until proved guilty. \n5. Suspects should have the right to remain silent under police questioning. \n6. If a suspect remains silent under police questioning, this should count against them in court. \n7. On-duty police officers should normally carry guns. \n8. Complaints against the police should be investigated by an independent body, not the police \nthemselves. \n9. The police should sometimes be able to “bend the rules” to get a conviction. \n \n \nAttitude 2 (all answered on 5-point Strongly Agree to Strongly disagree response scales) \n1. And now, here are some ideas about sending people to prison. How much do you agree or \ndisagree with each one? \n2. The courts should send fewer people to prison. \n3. Prison life should be made tougher and more unpleasant. \n4. Only hardened criminals, or those who are a danger to society, should be sent to prison. \n5. All murderers should be given a life sentence. \n6. Courts should give tougher sentences to criminals. \n7. Life sentences should mean life. \n8. Prisons should try harder to reform prisoners, rather than just punishing them. \n \n \nAttitude 3  \n \n1. From what you know, or have heard, do you think that prison life in Britain is… (5-point scale \nmuch too tough to much too soft). \nAnd how much do you agree or disagree that: \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 32 \n2. Sending people to prison makes them more, not less, likely to become hardened criminals? \nAnd how much do you agree or disagree that more offenders should be… \n3. Kept out of prison, but made to report regularly to probation officers. \n4. Kept out of prison, but made to spend a certain amount of days helping people in the \ncommunity.  \n5. Kept out of prison, but made to do military service for a period of time. \n6. Kept out of prison but made to get training and counselling. \n \nAttitude 4 (all answered on 5-point Very Effective to Not at all Effective response scales) \nHere are some ideas for helping to prevent crime in Britain. Please tick one box for each idea to show \nhow effective you think it is as a way of cutting crime. \n1. Reduce unemployment. \n2. Less violence and crime on television. \n3. People making their property more secure. \n4. Parents spending more time with their children. \n5. More schemes like Neighbourhood Watch. \n6. Teach children the differences between right and wrong. \n7. Send more offenders to prison. \n8. Firmer discipline in schools. \n9. Stiffer sentences generally. \n10. More police on the beat.\n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 33 \nAppendix 3 Question Wordings and Codings for Knowledge Scales \n \nElection Issues Poll \nThis knowledge measure combined three true\/false items with four issue space items in the following \nmanner: \n \nThree Item Knowledge Quiz (All true\/false) \n1. Prices have been rising by less than 5% a year over the past few years (true). \n2. Interest rates are decided by the Bank of England (false). \n3. Unemployment in Britain is higher than in Germany (false). \n \nFour Issue Space items \nAll questions are answered on a 7 point scale and each item is repeated for each of the three main \nparties. For the knowledge measure, each item is scored one if respondent places the Conservative \nparty to the right of the Labour party and the Liberal Democrats, zero otherwise. \n1. Where do the Conservative party stand on making people’s incomes more equal? Are they in the \ntop box agreeing completely with the statement below? Or in the bottom box disagreeing \ncompletely with the statement? Or one of the boxes somewhere in between? \n \nGovernment should try much harder to  make incomes in \nBritain more equal. \n2. Where do the Conservative party stand on taxes and spending? Are they in the top box agreeing \ncompletely with the statement below? Or in the bottom box disagreeing completely with the \nstatement? Or one of the boxes somewhere in between? \nGovernment should spend a lot more on services like \neducation and health, even if it means putting up taxes a lot. \n3. Where do the Conservative party stand on the minimum wage? Are they in the top box agreeing \ncompletely with the statement below? Or in the bottom box disagreeing completely with the \nstatement? Or one of the boxes somewhere in between? \nGovernment should definitely introduce a minimum wage so \nthat no employer can pay their workers too little. \n4. Where do the Conservative party stand on the European Union? Are they in the top box agreeing \ncompletely with the statement below? Or in the bottom box disagreeing completely with the \nstatement? Or one of the boxes somewhere in between? \nGovernment should do much more to unite fully with \nEurope. \n \nKnowledge variable produced by summing all correct answers, giving a range 0-7. Knowledge groups \nwere created on the following breaks: Low knowledge 0-? Correct; medium knowledge ?-? correct; \nhigh knowledge ?-? correct. Cronbach’s Alpha for the scale was 0.68. \n \nNHS Poll (all true\/false)  \n1. The standard charge for an NHS prescription is £10.    \n2. The proportion of old people in Britain is getting larger and larger.     \n3. Even with inflation taken into account, government spending on the NHS has doubled over the \nlast twenty years or so.    \n4. Most people nowadays get private medical treatment instead of using the NHS.   \n5. All British women can get free breast cancer screening on the NHS.    \n6. Cosmetic surgery is never available on the NHS.                                    \n \nKnowledge variable produced by summing all correct answers, giving a range 0-6. Knowledge groups \nwere created on the following breaks: Low knowledge 0-3 Correct; medium knowledge 4 correct; high \nknowledge 5-6 correct. Cronbach’s Alpha for the scale was 0.47. \n \n \n‘A Different Take on the Deliberative Poll’ Sturgis, Roberts and Allum AAPOR 2003 DRAFT \n 34 \n \nCrime Poll (all true\/false) \n1. British courts are allowed to sentence a murder to death. \n2. Britain has a larger prison population than any other country in Western Europe. \n3. Britain has more people serving life sentences than the rest of the European Community put \ntogether. \n4. It is possible to be tried by a jury in a local magistrate’s court. \n5. The number of members of parliament is about 100. \n6. The longest time allowed between general elections is four years. \n7. Britain’s electoral system is based on proportional representation. \n8. No-one is allowed to be on the electoral register in two different places. \n \nKnowledge variable produced by summing all correct answers, giving a range 0-8. Knowledge groups \nwere created on the following breaks: Low knowledge 0-2 Correct; medium knowledge 3-5 correct; \nhigh knowledge 6-8 correct. Cronbach’s Alpha for the scale was 0.56. \n \nMonarchy Poll  (all true\/false) \n1. After Prince Charles, Princess Anne is the next in line to the throne.    \n2. The Prime Minister, and not the Queen, is Britain’s Head of State.     \n3. The Queen is still the head of the Commonwealth.     \n4. It is the Queen’s duty to decide the date of all General Elections.     \n5. No prime minister takes office without being asked to by the Queen.     \n6. The Queen is the head of the Church of England.     \n7. The Queen is the head of the Church of Scotland.     \n8. Britain has an unwritten constitution. \n \nKnowledge variable produced by summing all correct answers, giving a range 0-8. Knowledge groups \nwere created on the following breaks: Low knowledge 0-5 Correct; medium knowledge 6 correct; high \nknowledge 7-8 correct. Cronbach’s Alpha for the scale was 0.52. \n \nEurope Poll  (all true\/false) \n1. The European Union has recently expanded to 15 members.  \n2. Switzerland is to join the European Union.  \n3. Britain's income tax rates are decided in Brussels.  \n4. Elections to the European Parliament are held every 5 years. \n5. Of the three major British parties, the Liberal Democrats are the least in favour of the \nEuropean Union. \n \nKnowledge variable produced by summing all correct answers, giving a range 0-5. Knowledge groups \nwere created on the following breaks: Low knowledge 0-1 Correct; medium knowledge 2-3 correct; \nhigh knowledge 4-5 correct. Cronbach’s Alpha for the scale was 0.62. \n \n \n"}