{"doi":"10.1080\/0968776960040203","coreId":"14336","oai":"oai:generic.eprints.org:210\/core5","identifiers":["oai:generic.eprints.org:210\/core5","10.1080\/0968776960040203"],"title":"Technology for social work education","authors":["Hopkins, Tom","Colombi, David"],"enrichments":{"references":[{"id":1043364,"title":"Computers in education: added value leading towards better quality' in","authors":[],"date":"1996","doi":"10.1300\/j407v12n01_10","raw":"Visser, A. (1996), 'Computers in education: added value leading towards better quality' in Rafferty, J., Steyaert, J. and Colombi, D.P., The Human Services in the Information Age, New York, Haworth.","cites":null},{"id":1043362,"title":"Credit Accumulation and Transfer for the Diploma in Social Work,","authors":[],"date":"1992","doi":null,"raw":"Storan, J. (1992), Credit Accumulation and Transfer for the Diploma in Social Work, CCETSW.","cites":null},{"id":1043366,"title":"Details of all computer programs referred to in the text are found in the Centre for Human Service Technology","authors":[],"date":"1996","doi":null,"raw":"Details of all computer programs referred to in the text are found in the Centre for Human Service Technology (1996), Resources Guide, referred to above.","cites":null},{"id":1043360,"title":"Human Service Computing,","authors":[],"date":"1990","doi":null,"raw":"Schoech, D. (1990), Human Service Computing, New York, Haworth.","cites":null},{"id":1043363,"title":"Human services and information technology: an international perspective',","authors":[],"date":"1996","doi":"10.1177\/002087289704000211","raw":"Steyaert, J., Colombi, D.P. and Rafferty, J. (1996), 'Human services and information technology: an international perspective', Arena (June).","cites":null},{"id":1043359,"title":"Interactive video programs: crisis counselling and organisational assessment' in","authors":[],"date":"1993","doi":"10.1300\/j407v09n03_09","raw":"Seabury, B. (1993), 'Interactive video programs: crisis counselling and organisational assessment' in Liederman, M., Guzzetta, C., Struminger, L. and Monnickendam, M., Technology in People Services, New York, Haworth.","cites":null},{"id":1043361,"title":"Multimedia training for child protective social workers: results of initial development and testing'","authors":[],"date":"1996","doi":"10.1300\/j407v12n01_09","raw":"Schoech, D. (1996), 'Multimedia training for child protective social workers: results of initial development and testing' in Rafferty, J., Steyaert, J. and Colombi, D.P., The Human Services in the Information Age, New York, Haworth.","cites":null},{"id":1043356,"title":"Old wine in new bottles? Issues in CAL curriculum design',","authors":[],"date":"1995","doi":null,"raw":"Hopkins, T. (1995), 'Old wine in new bottles? Issues in CAL curriculum design', New Technology in the Human Services, 8 (2).","cites":null},{"id":1043354,"title":"Resources Guide: special issue of New Technology in the Human Services,","authors":[],"date":"1996","doi":null,"raw":"Centre for Human Service Technology (1996), Resources Guide: special issue of New Technology in the Human Services, 8 (4), CHST, University of Southampton. Colombi, D.P., Rafferty, J. and Steyaert, J. (1993J, Human Services and Information Technology; A European Perspective, ENITH (ISBN: 0-854-32476-3).","cites":null},{"id":1043365,"title":"Sewing the Seams of a Seamless Service,","authors":[],"date":"1994","doi":null,"raw":"Weinstein, J. (1994), Sewing the Seams of a Seamless Service, CCETSW.","cites":null},{"id":1043358,"title":"The Dutch &quot;National&quot; Curriculum computer applications for schools of social work'","authors":[],"date":"1993","doi":"10.1300\/j407v09n03_12","raw":"Roosenboom, P. (1993), 'The Dutch &quot;National&quot; Curriculum computer applications for schools of social work' in Liederman, M., Guzzetta, C., Struminger, L. and Monnickendam, M., Technology in People Services, New York, Haworth.","cites":null},{"id":1043355,"title":"The Integrity of Intelligence - A Bill of Rights for the Information Age,","authors":[],"date":"1992","doi":null,"raw":"Glastonbury, B. and LaMendola, W. (1992), The Integrity of Intelligence - A Bill of Rights for the Information Age, Basingstoke, Macmillan.","cites":null},{"id":200915,"title":"Towards a systemic approach to the development of open and flexible learning environments: studies of implementation in the United Kingdom'","authors":[],"date":"1996","doi":null,"raw":"Adams, R. and Hopkins, T. (1996), 'Towards a systemic approach to the development of open and flexible learning environments: studies of implementation in the United Kingdom' in Fandel, G., Bartz, R. and Nickolmann, F. (eds), University Level Distance Education in Europe, Berlin, Deutscher Studien Verlag.","cites":null},{"id":1043357,"title":"Using Open Learning in Social Work: A Guide to Implementation, Open Learning Foundation","authors":[],"date":"1966","doi":null,"raw":"Hopkins, T. (1966), Using Open Learning in Social Work: A Guide to Implementation, Open Learning Foundation (in press).","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1996","abstract":"The intention of this paper is to examine aspects of the role of information technology in social work education in relation to existing developments within an international context, conceptual issues concerning the application of CAL to the teaching of social work, and the implication of these issues for the development of integrated teaching modules in Interpersonal Skills and Research Methods, together with some of the practical issues encountered and solutions being adopted The context for the paper is joint work by the authors as members of the ProCare Project, a partnership between Southampton and Bournemouth Universities, and part of the UK Government‐funded Teaching and Learning Technology Programme (TLTP) in Higher Education. ProCare is developing courseware on Interpersonal Skills and on Research Methods for use in qualifying‐level Social Work and Nursing education. While the emphasis is on the social work version of the Interpersonal Skills module, limited reference is made to the nursing component and the differential approaches that proved necessary within the subject areas under development","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14336.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/210\/1\/ALT_J_Vol4_No2_1996_Technology%20for%20social%20work%20edu.pdf","pdfHashValue":"4eeddd68291c01c59f9bb8ff37f851e805b91301","publisher":"Universit of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:210<\/identifier><datestamp>\n      2011-04-04T09:23:39Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/210\/<\/dc:relation><dc:title>\n        Technology for social work education<\/dc:title><dc:creator>\n        Hopkins, Tom<\/dc:creator><dc:creator>\n        Colombi, David<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        The intention of this paper is to examine aspects of the role of information technology in social work education in relation to existing developments within an international context, conceptual issues concerning the application of CAL to the teaching of social work, and the implication of these issues for the development of integrated teaching modules in Interpersonal Skills and Research Methods, together with some of the practical issues encountered and solutions being adopted The context for the paper is joint work by the authors as members of the ProCare Project, a partnership between Southampton and Bournemouth Universities, and part of the UK Government‐funded Teaching and Learning Technology Programme (TLTP) in Higher Education. ProCare is developing courseware on Interpersonal Skills and on Research Methods for use in qualifying‐level Social Work and Nursing education. While the emphasis is on the social work version of the Interpersonal Skills module, limited reference is made to the nursing component and the differential approaches that proved necessary within the subject areas under development.<\/dc:description><dc:publisher>\n        Universit of Wales Press<\/dc:publisher><dc:date>\n        1996<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/210\/1\/ALT_J_Vol4_No2_1996_Technology%20for%20social%20work%20edu.pdf<\/dc:identifier><dc:identifier>\n          Hopkins, Tom and Colombi, David  (1996) Technology for social work education.  Association for Learning Technology Journal, 4 (2).  pp. 17-27.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776960040203<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/210\/","10.1080\/0968776960040203"],"year":1996,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Technology for social work education\nTom Hopkins* and David Colombi**\n*Institute of Health and Community Services, Bournemouth University\n**Centre for Human Service Technology, University of Southampton\nThe intention of this paper is to examine aspects of the role of information technology in social work\neducation in relation to existing developments within an international context, conceptual issues\nconcerning the application of CAL to the teaching of social work, and the implication of these issues\nfor the development of integrated teaching modules in Interpersonal Skills and Research Methods,\ntogether with some of the practical issues encountered and solutions being adopted The context for the\npaper is joint work by the authors as members of the ProCare Project, a partnership between\nSouthampton and Bournemouth Universities, and part of the UK Government-funded Teaching and\nLearning Technology Programme (TLTP) in Higher Education. ProCare is developing courseware on\nInterpersonal Skills and on Research Methods for use in qualifying-level Social Work and Nursing\neducation. While the emphasis is on the social work version of the Interpersonal Skills module, limited\nreference is made to the nursing component and the differential approaches that proved necessary\nwithin the subject areas under development.\nSocial work and IT developments\nThe development of technology in social-work education is set not only in the broader\ncontext of the use of technology in higher education generally, but also in the parallel\ncontext of the use of technology in social work practice. The latter is important for a\nsubject area with two primary characteristics:\nthe need to acquire not just academic knowledge but also professional expertise and\nunderstanding of the aims, methods and values of social work;\na strong emphasis on practical preparation for work in social work agencies, which is\nexpressed through the universal use of practice placements within agencies as a major\ncomponent of social-work professional education and training.\nWithin contemporary social work practice, it is possible to identify several broad themes\nconcerning the use of new technology:\n17\nTom Hopkins and David Colombi Technology for social work education\na low level of overall penetration into the work of social work agencies;\na primary focus on developing basic client information systems;\na preoccupation with the needs of managers and local and central government for\nfinancial and statistical data used for accountability and policy purposes.\nAs a consequence, there has until recently been little expectation by employers that those\ncompleting professional social-work training will be computer literate, although that situation\nis now changing. Those who do acquire such skills may experience frustration at the limited\nopportunities within agencies to develop and apply them in their work with clients.\nFor social work courses the issues are, then, primarily about how technology is used for\neducational purposes. However, for some educators there is a secondary objective of\ncontributing to initiatives which may indirectly help to reshape social-work practice\nthrough diffusion, example and opportunity. The barriers for social-work education\ninclude many shared with other disciplines, but also some that are unique, or at least less\ncommon. Those that are familiar, applying across most or all disciplines, may be\ncharacterized as:\nStructural: organizational resistance and\/or antipathy towards new technology, arising\nfrom an unwillingness to contemplate organizational changes which the use of new\ntechnology requires.\nDevelopmental: failure or unwillingness of course planners, managers and instructors to\nconsider the potential of new technology in relation to curriculum needs and\nrequirements; identifying the place of Computer-Assisted Learning (CAL) in the\ncurriculum and developing the competence and confidence of teachers to use CAL and\nadapt teaching styles to a CAL environment.\nConceptual: confusion about the nature of the activity - whether CAL, Computer-Based\nLearning (CBL) or Computer-Assisted Instruction (CAI). The term CAL is used here\nwith an emphasis on learning rather than instruction; and on computer assistance rather\nthan the more fully entrenched role implicit in CBL.\nPractical: availability of and access to required technology, quality software and\nappropriate computer teaching environments (including educational, technical and\nadministrative supports); the second aspect depends on the extent to which software is\ndesigned to be used entirely by students working alone, or as part of a teaching and\/or\nother shared learning experience.\nPhilosophical\/ideological: individual resistance by staff, through apathy, anxiety or\nhostility, including the 'not invented here' syndrome; also, collective resistance by\nacademic (and some professional) groupings to new technology having other than a\nminor, adjunctival role to play in education for human-service professions.\nPersonal: individual resistance by academics and practitioners to new technology in\nprofessional education and training, largely out of fear of job change, relocation or loss;\nthese views are shared by some students who see the introduction of new technology as\nless attractive than conventional instruction, and which may require more effort on their\npart (see Hopkins, 1996).\n18\nALT-] Volume 4 Number 2\nLess familiar barriers include:\nProfessional: the imprecise nature of the knowledge base of social work that makes it less\namenable to computerization than more structured and precise knowledge-based systems,\nsuch as science, law or medicine.\nEthical: issues of client confidentiality, together with concerns about the extent to which\ncomputers may be perceived as dehumanizing or undermining the quintessentially\npersonal interactions which characterize much social work.\nOn the positive side, there is an international co-operative endeavour to contribute,\nprimarily at an academic level, but also at a practitioner level, to change. This work finds\nits strongest collective expression though a series of international conferences known as\nHUSITA (Human Services Information Technology Applications), and through the work\nof the European Network for Information Technology in the Human Services (ENITH).\nThese endeavours provide a means of meeting, sharing and networking, and the focus for\npublication of conference papers and other texts, such as international comparative\nstudies (Colombi, 1993; Steyaert 1996).\nThe educational dimension to this work is an important one amongst other aspects that\ninclude concerns about the needs of social-work practitioners, service users and other\ncitizens, combined with emphasis on ethical themes of empowerment, disability,\ndiscrimination and confidentiality (Glastonbury and LaMendola, 1993). The educational\ndimension includes development of simulation software in the areas of child protection\n(Schoech, 1996) and discrimination (Seabury, 1993), and information software in the\nareas of child protection (Child Care Information System from SSRADU), care\nmanagement (Unlocking Care Management from CCETSW), social work literature\n(CareData from NISW) and social work and technology (Social Work and Information\nTechnology from CHST).\nWithin the social work education dimension to this co-operative work there are,\ninevitably, both similarities and differences. The differences are exemplified by develop-\nment within the Netherlands, Belgium and some other continental European countries of\nthe concept of'social informatics' (Visser, 1996). In these European contexts, the concept\nis dealt with as a taught course on the curriculum (Roosenboom 1993), rather than the\nmore experiential introduction to using technology as an educational medium across all\naspects of the curriculum, found in British and North American higher education.\nCAL for social work: some conceptual issues and concerns\nIn comparison with other forms of non-traditional instruction - print-based, video, audio\netc. - CAL has yet to make much impact on social-work education delivery for reasons\noutlined earlier. Together with other issues beyond the scope of this paper, these\nconstitute a formidable set of barriers and obstacles which advocates of CAL for social-\nwork education must address. However, at the very centre of the debate about the use of\nCAL for social-work education and training lies a much more fundamental set of issues.\nPut simply, these are concerned with the ability of CAL to offer and deliver a teaching\nand learning experience which is as effective as more established modes.\n19\nTom Hopkins and David Cobmbi Technology for social work education\nIn order to challenge some of the criticisms which are made of CAL for social-work\neducation, it is necessary first to understand something of the conventional practices of\nmainstream social-work education, and the values, attitudes and beliefs that underpin\nthem. Based on a view that the nature of social work is contested and contestable, and\nthat these complexities and ambiguities must be reflected in the curriculum, the main\ncharacteristics of contemporary educational practice in this field are that:\nmost learners already possess some relevant knowledge and skills;\nteaching and learning must be, at least in part, experiential (real or simulated);\neducation and training methods should be learner-centred;\nlearners should be involved in identifying and managing their own learning needs;\ninstruction should include, wherever possible, elements of group-based learning;\nstaff should act primarily as facilitators and enablers of learning.\nWhile not each and every class or study-session of a social work course will incorporate\nevery aspect of the above, learners and staff will, overall, share a view of the education\nand training process to which this description closely corresponds. It is not difficult to see\nthat a central tenet of contemporary social-work education is interaction, between teacher\nand learner, and amongst learners themselves.\nThus, any new instructional medium has not only to contend with the set of macro- and\nmezzo-level issues outlined at the beginning of this section, but must then prove itself in\nrelation to a set of micro-issues specifically concerned with the nature and experience of\nteaching and learning. Put at its simplest - and most challenging - new modes of\neducation and training must be able not only to match the content of conventional\nofferings but also their process and outcomes.\nThis would be challenge enough to CAL if its use was to be simply adjunctival,\ncomplementing or supplementing mainstream methods of instruction. The literature of\nCAL's recent history in higher education generally, and specifically in social work, shows\nthis is its primary function; staff recommend rather than require student use. However,\nincreasingly British higher-education funding support for \"CAL development is linked\nwith notions of 'greater efficiency', which translates into cost-savings, particularly of\nteacher-learner contact time.\nThus, CAL for social-work education and training must, if it wishes to be taken seriously\nas a mainstream method of instruction, be designed primarily as a replacement for, rather\nthan a supplement to existing delivery. Put another way, to be acceptable to both\neducators and learners, CAL must offer and deliver learning experiences at least as\neffective as those currently in use.\nIn trying to respond to this challenge, the temptation is to look first for technological\nsolutions, for example by designing CAL materials that are sophisticated, incorporating\nsound and graphics, possibly video, perhaps in CD-ROM format, in the belief that these\nwill in some unspecified way compensate learners for the absence of more conventional\nfeatures of teaching and learning, particularly that of engaging with the content of the\nmaterial. Yet, most social work departments currently lack access to the computer\n20\nALT-J Volume 4 Number 2\nhardware required to run such programs, or on such a small scale that use of CAL\nmaterial could never be more than adjunctival.\nWhile multimedia features play an increasingly important role in CAL, greater\ntechnological sophistication alone will not redeem a program which lacks a clear and\ncoherent teaching and learning strategy. Effective software requires interactivity both at\nthe level of design of how imaginatively users can access and be presented with material,\nand at the level of how they are helped to respond to the content. Thus the most\nappropriate and fruitful response to the challenge of developing CAL materials for social\nwork lies initially in a deeper understanding of what constitutes effective teaching and\nlearning, and how the content, structure and process of CAL materials can be designed to\ndeliver it.\nDeveloping the interpersonal skills module\nWe turn now to the specific work within the ProCare project team of creating social work\nand nursing modules in the field of Interpersonal Skills (IPS) under the headings of\nDesign and Structure, Content, Functioning and Implementation.\nDesign and structure\nCurriculum design within UK higher education has, in recent years, become an extremely\ncomplex task. Where once curriculum content and structure were the sole province of\nacademics, a range of influences, some competing, now play a significant part in shaping\nthe planning of courses and programmes (for a detailed consideration of this area, see\nHopkins, 1995). Of most significance here are:\nthe near-universal modular restructuring of higher-education courses;\nthe shift from an input-driven to an outcomes-led curriculum model;\nattempts to create interdisciplinary and interprofessional education.\nThe first of these led to an early decision that CAL materials would be designed to fit the\nmodular course structures now commonly found in higher education throughout the UK\n(for a discussion in relation to social work, see Storan, 1992). The decision called for\nmaterials to be designed within a context of prescribed module sizes, expressed in credit\npoints, with indications of likely overall 'student effort hours' required for successful\ncompletion. This would assist social-work tutors who wished to consider the use of\nProCare materials as part or whole replacement for existing teaching arrangements. The\nsecond factor was significant for program design in that it required CAL materials to\nstate clearly and consistently the objectives of each module (and in turn, each unit and\nsession), and how the learner would achieve them.\nThe third factor is of greatest significance for this paper, in that it speaks to the\nprofessional contexts of social work and nursing, and thus, by implication education and\ntraining in preparation for it. It has two major strands, which briefly may be\ncharacterized as follows:\nthat it is both possible and desirable to blur or erase existing boundaries between\nprofessional groupings, with the objective of creating interprofessionally-skilled\n21\nTom Hopkins and David Colombi Technology for social work education\npractitioners (see Weinstein, 1994); that a) may be achieved while simultaneously\nembracing the increasing shift towards 'specialism' within professional practice.\nIn designing the Interpersonal Skills and Research Methods modules, these two factors\nmanifested themselves in the following ways.\nInterprofessionalism. Our early belief that it would be relatively easy to design materials\nfor interprofessional use was challenged by educators and students alike. This led us to\nconsider a choice between separate versions for Social Work and Nursing, or a combined\nprogram offering choices about specific Social Work or Nursing case examples. In\npractice, it proved necessary to develop separate versions for Interpersonal Skills, given\nthe more fundamental differences involved between the two professions, allied to\npractical issues about developing and evaluating the source materials. For Research\nMethods, the differences between the professions were less critical and a single module\napproach was developed which allowed the user to choose at any stage between being\noffered social work or nursing case examples,\nSpecialism. Here, the central question for development concerned whether to meet needs\nof specific groups in and related to the two professions, such as staff working in\nresidential settings; in special educational needs; in the fields of disability and psychiatry;\nor in voluntary and private-sector settings. A decision was made to provide materials of a\ngeneric nature, while earmarking them for future development once basic versions of the\nprograms are stabilized.\nContent\nWith the primary focus on content in mind, in seeking to create a framework for\ndevelopment, the following elements of curriculum philosophy and design were conceived\nof as central:\nwhat are the overall aims of the module?\nwhat are the objectives of the module, expressed as competencies to be achieved?\nwhat knowledge and skills must learners acquire in order to become competent?\nwhat knowledge and skills might learners already possess, and how can they be accessed?\nwhat might constitute an effective teaching and learning process?\nwhat might constitute an effective module structure?\nDiscussions of these issues amongst project staff resulted in a design for the IPS module\nconsisting of eight units, which together cover the key phases of contact between social\nworkers and their clients, viz:\nCommunication and IPS\nMaking Contact\nAssessment\nPlanning\nImplementation\n_\nALT-J Volume 4 Number 2\nMaintaining Contact\nEndings\nEvaluation\nThis structure is complemented by two key tools, described later, of a Notepad facility\nand a Skills Bank. Most of the eight units above consist of two CAL sessions; each\nsession, following a short introduction and objective setting stage, includes the following\nelements, in a similar sequential format.\nContext activity. These require learners to begin each session by identifying, through\nrecall and review, past and\/or current relevant knowledge and practice skills. This activity\nalso helps orientate the learner towards the new information and other activities\nencountered within the session (see Figure 1).\nInterpersonal Skills Module - Social Work JzEEile Edit Search Navigate Annotations Bookmarks VjVindow Help\nki-rnEXIT £ Q\n4.1 Context Activity\n1 hink about somewhere you have recently worked and then answer\nthe following questions:\n• If planning for service was carried out, what form did it take?\n• What was planning trying to achieve?\n• Who did planning involve?\n• If users were involved, how?\n• What skills did you and\/or other workers use in planning?\n• If planning wasnt undertaken, but in your view should\nhave been, what skills do you think it would have required?\nContents |\nA. Planning\nSession 1\nSession Objectives\nThe Nature & Purpose of Planning\nContext Activity\nBrief Recap from Assessment\nKey Steps & Skills for Planning\nReview and Integration Activities\nReed and Search\nSession 2\nNotebook ]\nSk i l l s B a n k j\nFigure I\nTeaching Content. Information is presented in the form of major theoretical perspectives,\nkey concepts, critical issues, contrasting viewpoints, etc. Much as in conventional\nteaching, it seeks to engender a sense of enquiry; critical thinking, and a willingness to live\nwith the ambiguities of professional practice (see Figure 2).\n23\nTom Hopkins and David Colombi Technology for social work education\nInterpersonal Skills Module - Social Work\nDie Edit Search Navigate Annotations Bookmarks Window Help\nki-rnEXIT\n4.1 Key Steps < Skills for Planning\nAmongst the general skills of planning are several you have\nalready encountered in the previous sessions. These include:\nlistening, attending, observing and interpreting non-verbal\nbehaviour, clarifying, timing and pacing, and identifying user\nresources. If you wish to refresh your understanding of any of\nthem revisit them in the Communications and Interpersonal Skills\nUnit under Types of Communication and in the Making Contact\nUnit under The Skills for Making Initial Contact.\nIn addition to the above skills are some which though not\nexclusive to planning have a particular part to play in it. They are\ndescribed in detail below in relation to three key steps to effective\nplanning.\nStep 1: Developing a more desirable scenario\nStep 2: Clarifying the consequences of new scenarios\nStep 3: Making choices and commitments\nContents\n4. Planning\nSession 1\nSession Objectives\nThe Nature & Purpose of Planning\nContext Activity\nBrief Recap from Assessment\nKey Steps & Skills for Planning\nReview and Integration Activities\nRead and Search\nSession 2\nNotebook \\\nS k i l l s B a n k |\nFigure 2\nReview and Integration Activity. As its name suggests, this activity requires students to\nwork at integrating existing and new learning through a practice-focused exercise such as\nthe one in Figure 3.\nIntegration and Preparation Activity. Students are required to use the learning they have\nacquired during the session (and preceding ones) in preparation for real or simulated\npractice. Learners may be asked to undertake a range of tasks, including:\nsearching for evidence of specific interpersonal skills embedded in case dialogue;\nplanning for handling hypothetical interactions between workers and clients;\nproposing alternative ways of dealing with complex interpersonal communications\nbetween clients and workers;\nundertaking self-assessment of their own interpersonal skills, and identifying ways and\nmeans of improving them.\nAs the above illustrates, within the IPS module, structure and process are inextricably\nlinked. Laying out the various elements of the curriculum strategy helps learners to\ndevelop a familiarity with the way in which the module works in educational terms, while\nalso recognizing that all effective learning involves a process and outcome. Students are\nalso prepared for their use of the module by a User's Guide which explains, in a non-\n24\nALT-] Volume 4 Number 2\nInterpersonal Skills Module - Social Work\nHie Edit Search Navigate Annotations Bookmarks Window Help Jz\nm EXIT Crffc)\n4.1 Review and Integration\nActivity 1\nThis task focuses on the dialogue between the worker and Ms.\nSmith which you have been following throughout the session. The\ncomplete dialogue is shown again but this time go through looking\nfor evidence of the following interpersonal skills being used by the\nworker. When you think you have identified one, click on the\nsentence to select from the list shown and see if you are right.\n(NB: Each skill may be found more than once.)\nRecall and review\nGoal setting\nFocusing\nElaborating\nEmpowering\nClarifying\nMobilising\nProgressing\nSummarising\nIdentifying user resources\nWorker: \"Well Mrs. Smith, when we met last week it was\nclear that Tom's behaviour was proving too much\nfor you and his brothers and sisters to cope with.\nContents |\nA. Planning\nSession 1\nSession Objectives\nThe Nature & Purpose of Planning\nContext Activity\nBrief Recap from Assessment\nKey Steps &. Skills for Planning\nReview and Integration Activities\nRead and Search\nSession 2\nNotebook |\nSk i l l s B a n k j\nFigure 3\njargonistic way, how the modules were conceived, how they are intended to work, and\nhow to obtain help if problems, either technical or educational, are encountered.\nFunctioning\nThe way that software functions is shaped by a variety of factors including the\nspecification of computers available to users, the programming and design time and skills\navailable, the program size planned, and the authoring system(s) and environment used.\nThe first of these factors was discussed earlier as a significant limiting factor for\nimplementation in most social-work educational settings. Other key aspects considered\nhere are navigation, hypertext, special tools and authoring system(s).\nNavigation. The requirements were that users have a clear overall view of the program,\nand their current position and progress, combined with freedom to move around the\nprogram at will rather than along pre-set paths. This presents dilemmas in that the\nknowledge incorporated in each program is incremental and cumulative so that 'naive'\nusers need to understand earlier sections to gain from later ones. That the material has a\nlogical progressive structure is, hoWever, no reason to provide a straitjacket; just as books\nallow users to browse, flip, dip and peruse as well as to read through from start to finish,\nso should CAL.\nHypertext. Use of hypertext facilities provides definitions, explanations, answers to\nquestions and reference information in the form of pop-up notes. It is also used for\n25\nTom Hopkins and David Cobmbi Technology for social work education\nmaking links between different sections of the program so that users can move from one\ntopic of interest to another in a non-linear fashion. Hypertext is one aspect of interactivity\nin which the user makes decisions and choices rather than just being a passive respondent.\nSpecial tools. The Notepad facility referred to earlier allows students to undertake written\ntasks, to make notes, and to copy key materials for use in assignments and seminars. It is\ncontext-sensitive with relevant text already included, and notes can be stored, printed or\ntransferred.to a word processor of choice. The Skills Bank is an index of interpersonal\nskills referred to in the program with a brief description of each. Students are helped to\nunderstand that most skills are of a generic nature, with applicability in a variety of\npractice situations. Other interactive features include demonstrations of specific human-\nservice tools and techniques, such as Ecomaps and Genograms.\nAuthoring systems. Given that both modules are largely text-based and offer less scope\nthat many other subjects for visual representation, easy handling of text and use of\nhypertext facilities were important criteria. This led to the choice of the Windows-based\nGuide program for the CAL authoring of Interpersonal Skills, with some Visual Basic\nadd-ons for features requiring particular forms of representation or interactivity. For\nResearch Methods, this was switched to use of a Visual Basic environment which accessed\nGuide text windows with the aim of achieving a more professionally designed product, a\nmove from scrolling to paging, more integrated and systematic accessing of special\nfeatures such as the Notebook, glossary and other add-ons, and a more promising\ndevelopment route for multimedia and extended graphics.\nImplementation\nImplementation has involved establishing test and trial sites within selected social-work\ncourses for evaluating staff and student reactions to IPS. Other less formal feedback has\nbeen through demonstration at workshops and conferences. The programme for formal\nevaluation was initiated by a Training the Tutors event, at which social work educators\nproposing to introduce the module in their work with students were offered an intensive\n24-hour orientation workshop. This proved invaluable in a number of respects in that it:\ncreated a 'safe haven' for educators and ProCare staff to discuss the potential and\nlimitations of IPS materials;\noffered an opportunity for shared creative thinking on how to implement module-use in\ndifferent settings and circumstances;\ngenerated the basis of a tutor-use network for ongoing support and development.\nInitial reactions to the IPS module have been encouraging, with important lessons learnt\nabout content, structure, presentation, and how the program is used. Of particular\ninterest have been the evaluation comments endorsing the project team's decision to\nprovide a program requiring a low level of technology, and which appears to have been\neasy to install and maintain, both stand-alone and networked.\nCurrently, within test and trial sites, the primary focus has been on use of IPS as an\nadditional learning resource rather than as a complete replacement for existing teaching.\nAs TLTP materials are made available at no cost to UK higher-education institutions,\nthis does not constitute a 'product acceptability' problem at this stage. However, it may\n26\nALT-J Volume 4 Number 2\nbecome a critical issue if a move is made to offer ProCare materials on a more\ncommercial basis; there, economic viability may well be determined, in large part, by its\npotential to replace rather than supplement teaching.\nReferences\nAdams, R. and Hopkins, T. (1996), 'Towards a systemic approach to the development of\nopen and flexible learning environments: studies of implementation in the United\nKingdom' in Fandel, G., Bartz, R. and Nickolmann, F. (eds), University Level Distance\nEducation in Europe, Berlin, Deutscher Studien Verlag.\nCentre for Human Service Technology (1996), Resources Guide: special issue of New\nTechnology in the Human Services, 8 (4), CHST, University of Southampton.\nColombi, D.P., Rafferty, J. and Steyaert, J. (1993J, Human Services and Information\nTechnology; A European Perspective, ENITH (ISBN: 0-854-32476-3).\nGlastonbury, B. and LaMendola, W. (1992), The Integrity of Intelligence - A Bill of\nRights for the Information Age, Basingstoke, Macmillan.\nHopkins, T. (1995), 'Old wine in new bottles? Issues in CAL curriculum design', New\nTechnology in the Human Services, 8 (2).\nHopkins, T. (1966), Using Open Learning in Social Work: A Guide to Implementation,\nOpen Learning Foundation (in press).\nRoosenboom, P. (1993), 'The Dutch \"National\" Curriculum computer applications for\nschools of social work' in Liederman, M., Guzzetta, C., Struminger, L. and\nMonnickendam, M., Technology in People Services, New York, Haworth.\nSeabury, B. (1993), 'Interactive video programs: crisis counselling and organisational\nassessment' in Liederman, M., Guzzetta, C., Struminger, L. and Monnickendam, M.,\nTechnology in People Services, New York, Haworth.\nSchoech, D. (1990), Human Service Computing, New York, Haworth.\nSchoech, D. (1996), 'Multimedia training for child protective social workers: results of\ninitial development and testing' in Rafferty, J., Steyaert, J. and Colombi, D.P., The\nHuman Services in the Information Age, New York, Haworth.\nStoran, J. (1992), Credit Accumulation and Transfer for the Diploma in Social Work, CCETSW.\nSteyaert, J., Colombi, D.P. and Rafferty, J. (1996), 'Human services and information\ntechnology: an international perspective', Arena (June).\nVisser, A. (1996), 'Computers in education: added value leading towards better quality' in\nRafferty, J., Steyaert, J. and Colombi, D.P., The Human Services in the Information Age,\nNew York, Haworth.\nWeinstein, J. (1994), Sewing the Seams of a Seamless Service, CCETSW.\nDetails of all computer programs referred to in the text are found in the Centre for\nHuman Service Technology (1996), Resources Guide, referred to above.\n27\n"}