{"doi":"10.1016\/S0097-8493(01)00083-8","coreId":"70483","oai":"oai:eprints.lancs.ac.uk:11963","identifiers":["oai:eprints.lancs.ac.uk:11963","10.1016\/S0097-8493(01)00083-8"],"title":"The role of shared context in supporting cooperation between city visitors","authors":["Cheverst, Keith","Smith, Gareth","Mitchell, Keith","Friday, Adrian","Davies, Nigel"],"enrichments":{"references":[{"id":16303615,"title":"A Group-based Authorization Model for Cooperative Systems,","authors":[],"date":"1997","doi":"10.1007\/978-94-015-7372-6_23","raw":"K. Sikkel, A Group-based Authorization Model for Cooperative Systems, In Proc. of ECSCW’97 (Kluwer Academic Publishers, 1997)  345-360.","cites":null},{"id":16303616,"title":"Access Control in Virtual Environments,","authors":[],"date":"1997","doi":"10.1145\/261135.261142","raw":"A. Bullock and S. Benford, Access Control in Virtual Environments, In Proc. of Symposium on Virtual Reality Software and Technology 1997 (VRST'97) (Swiss Federal Institute of Technology (EPFL), Lausanne, Switzerland, 1997) 29-35.","cites":null},{"id":16303626,"title":"Aqtive Homepage: http:\/\/www.aqtive.co.uk","authors":[],"date":"2001","doi":null,"raw":"Aqtive Homepage: http:\/\/www.aqtive.co.uk (2001).","cites":null},{"id":16303606,"title":"Design of an Object Model for a ContextSensitive Tourist Guide,","authors":[],"date":"1999","doi":"10.1016\/s0097-8493(99)00119-3","raw":"K. Cheverst, N. Davies, K. Mitchell and A. Friday. Design of an Object Model for a ContextSensitive Tourist Guide, in Computers and Graphics, Vol. 23, No. 6 (December, 1999) 883-891. 2.  N. Davies, K. Mitchell, K. Cheverst and A. Friday, Caches in the Air: Disseminating Tourist Information in the Guide System, in Proceedings of 2nd IEEE Workshop on Mobile Computing Systems and Applications (New Orleans, 1999) 11-19.","cites":null},{"id":16303607,"title":"Developing a Context-aware Electronic Tourist Guide: Some Issues and Experiences,","authors":[],"date":"2000","doi":"10.1145\/332040.332047","raw":"K. Cheverst, N. Davies, K. Mitchell and A. Friday, Developing a Context-aware Electronic Tourist Guide: Some Issues and Experiences, in Proceedings of CHI’2000 (ACM Press, Hague, Netherlands, 2000) 17-24.","cites":null},{"id":16303608,"title":"Experiences of Developing and Deploying a Context-Aware Tourist Guide: The GUIDE Project.","authors":[],"date":"2000","doi":"10.1145\/345910.345916","raw":"K. Cheverst, N. Davies, K. Mitchell and A. Friday, Experiences of Developing and Deploying a Context-Aware Tourist Guide: The GUIDE Project. In Proc. of MOBICOM’2000 (ACM Press, Boston, USA, August, 2000) 20-31.","cites":null},{"id":16303614,"title":"More information is available at: http:\/\/stonestreetone.com\/bluetooth\/products\/bdk\/","authors":[],"date":"2000","doi":null,"raw":"More information is available at: http:\/\/stonestreetone.com\/bluetooth\/products\/bdk\/ (2000).","cites":null},{"id":16303610,"title":"Portholes: supporting awareness in a distributed work group,","authors":[],"date":"1992","doi":"10.1145\/142750.142982","raw":"P. Dourish and S. Bly, Portholes: supporting awareness in a distributed work group, in Proceedings of  Human factors in computing systems, (Monterey, CA, USA, 1992)  541-547.","cites":null},{"id":16303612,"title":"Providing Location Information in a Ubiquitous Computing Environment,","authors":[],"date":"1993","doi":"10.1145\/173668.168641","raw":"M. Spreitzer and M. Theimer, Providing Location Information in a Ubiquitous Computing Environment, in Proceedings of 14th Symposium on Operating System Principles. ACM Press. (1993) 270-283.","cites":null},{"id":16303618,"title":"RADAR: An In-Building RF Based User Location and Tracking System, In","authors":[],"date":"2000","doi":"10.1109\/infcom.2000.832252","raw":"P. Bahl and V. N. Padmanabhan, RADAR: An In-Building RF Based User Location and Tracking System, In Proc. of IEEE INFOCOM 200, (Tel-Aviv, Israel, March, 2000) 775-784. 15.  G. Sidler, A. Scott, H. Wolf, Collaborative Browsing in the World Wide Web, in Proceedings of 8th Joint European Networking Conference (Edinburgh, May 1997) 12-15.","cites":null},{"id":16303617,"title":"Supporting Location-Awareness in Open Distributed Systems.","authors":[],"date":"1998","doi":null,"raw":"U. Leonhardt, Supporting Location-Awareness in Open Distributed Systems. Phd Thesis, Department of Computing, Imperial College of Science, University of London (1998).","cites":null},{"id":16303613,"title":"Techniques for addressing fundamental privacy and disruption tradeoffs in awareness support systems,","authors":[],"date":"1996","doi":"10.1145\/240080.240295","raw":"S. Hudson and I. Smith, Techniques for addressing fundamental privacy and disruption tradeoffs in awareness support systems, in Proceedings of ACM 1996 conference on Computer Supported Cooperative Work (ACM Press, Boston, USA, 1996) 248-257.","cites":null},{"id":16303611,"title":"The Active Badge Location System. In","authors":[],"date":"1992","doi":"10.1145\/128756.128759","raw":"R. Want, A. Hopper, V. Falcao and J. Gibbons, The Active Badge Location System. In ACM Transactions on Information Systems, Vol. 40, No. 1 (January, 1992) 91-102.","cites":null},{"id":16303624,"title":"Understanding and Constructing Shared Spaces with Mixed Reality Boundaries,","authors":[],"date":"1998","doi":"10.1145\/292834.292836","raw":"S. Benford, C. Greenhalgh, G. Reynard, C. Brown and B. Koleva, Understanding and Constructing Shared Spaces with Mixed Reality Boundaries, in ACM Transactions on Computer-Human Interaction, 5 (3) (ACM Press, 1998) 185-223.","cites":null},{"id":16303609,"title":"Where the footprints lead: tracking down other roles for social navigation,","authors":[],"date":"1999","doi":"10.1007\/978-1-4471-0837-5_2","raw":"P. Dourish,  Where the footprints lead: tracking down other roles for social navigation, in Alan J. Munro, Kristina Hook, & David Benyon (eds.) Social Navigation of Information Space (SpringerVerlag London Limited, London, 1999) 15-34.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2001-07-25","abstract":"The sharing of contextual information between individuals is a notion that often sparks emotional debate. It is interesting to note that the majority of existing work on sharing contextual information, especially location, has focused on the privacy issues raised in the work domain. This paper describes our initial investigation into sharing context in the leisure domain. More specifically we investigate how location context may be usefully shared between city visitors. For example, visitors may benefit by (i) knowing the whereabouts of family members, or (ii) determining the popularity of attractions based on the number of visits. Additionally the sharing of location might also encourage communication between visitors that are not exploring the city as part of a group. For example, noticing that a fellow GUIDE user is located at the city castle would be helpful if I could then contact the visitor to request his or her opinion of the castle","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/70483.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/11963\/1\/CG01%2Dguide.pdf","pdfHashValue":"125444801574e76660915cda93a2361079f42daa","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:11963<\/identifier><datestamp>\n      2018-01-24T00:04:25Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5141:51413735<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        The role of shared context in supporting cooperation between city visitors<\/dc:title><dc:creator>\n        Cheverst, Keith<\/dc:creator><dc:creator>\n        Smith, Gareth<\/dc:creator><dc:creator>\n        Mitchell, Keith<\/dc:creator><dc:creator>\n        Friday, Adrian<\/dc:creator><dc:creator>\n        Davies, Nigel<\/dc:creator><dc:subject>\n        QA75 Electronic computers. Computer science<\/dc:subject><dc:description>\n        The sharing of contextual information between individuals is a notion that often sparks emotional debate. It is interesting to note that the majority of existing work on sharing contextual information, especially location, has focused on the privacy issues raised in the work domain. This paper describes our initial investigation into sharing context in the leisure domain. More specifically we investigate how location context may be usefully shared between city visitors. For example, visitors may benefit by (i) knowing the whereabouts of family members, or (ii) determining the popularity of attractions based on the number of visits. Additionally the sharing of location might also encourage communication between visitors that are not exploring the city as part of a group. For example, noticing that a fellow GUIDE user is located at the city castle would be helpful if I could then contact the visitor to request his or her opinion of the castle.<\/dc:description><dc:date>\n        2001-07-25<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/S0097-8493(01)00083-8<\/dc:relation><dc:identifier>\n        Cheverst, Keith and Smith, Gareth and Mitchell, Keith and Friday, Adrian and Davies, Nigel (2001) The role of shared context in supporting cooperation between city visitors. Computers and Graphics, 25 (4). pp. 555-562. ISSN 0097-8493<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/11963\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1016\/S0097-8493(01)00083-8","http:\/\/eprints.lancs.ac.uk\/11963\/"],"year":2001,"topics":["QA75 Electronic computers. Computer science"],"subject":["Journal Article","PeerReviewed"],"fullText":"The Role of Shared Context in Supporting Cooperation \nbetween City Visitors \nKeith Cheverst, Gareth Smith, Keith Mitchell, Adrian Friday and Nigel Davies \nDistributed Multimedia Research Group, \nDepartment of Computing, \nLancaster University, \nLancaster, LA1 4YR. \ne-mail: kc,gbs,km,adrian,nigel@comp.lancs.ac.uk \ntelephone: +44 (0)1524 594337 \n \n1. Introduction \nThe development and evaluation of the GUIDE system [1][2][3][4] demonstrated the potential \nvalue and acceptability of a mobile context-aware interactive assistant to city visitors. \nHowever, one of the concerns that has arisen through the development and evaluation of \nGUIDE is that it may lead to less social interaction by city visitors, e.g. less communication \nwith actual tour guides, members of the Tourist Information Center, etc. Although this was \ncertainly not the intention of the GUIDE system, the criticism is reasonable based on the fact \nthat visitors are likely to ask GUIDE for information (e.g. guidance instructions) or services \n(e.g. ticket booking) that would have traditionally involved personal communication. \nIn a hope to redress the balance, we are currently extending the GUIDE system in order to \nsupport cooperation and encourage a sense of community between users. For one example of \nhow this might be achieved, consider the following scenario:- \n“John, a visitor to Lancaster, is looking for a café to visit and has asked his GUIDE \nto assist him in finding a suitable café. John is shown the relevant web-pages of a number \nof potentially suitable cafés based on their proximity and John’s preference for vegetarian \nfood. However, John is still unsure as to which café to choose and so reads a list of \ncomments left by other visitors for the various cafés under consideration. In addition, \nJohn is shown that another GUIDE user, Mary, is currently located in one of the cafés \nlisted. John would like to have an unbiased opinion on whether the café is currently quiet \nand accommodating and so decides to send a quick message to Mary enquiring about the \ncafé.” \nSupporting this kind of cooperation between distributed users is clearly relevant to the \nresearch fields of Groupware and CSCW. Indeed, the sub-field referred to as Social navigation \n[5] is concerned with enabling users to cooperatively navigate through complex information \nspaces, such as a virtual city model. Moreover, one common form of social navigation is \nbased on the sharing of recommendations between users. Another related area, that tackles \nways of facilitating cooperation between geographically distributed users, is that of social \nawareness. The motivation behind such awareness is to overcome the problems of remoteness \nby trying to provide some of the many (often subtle) audio-visual cues that are lost during \nremote communication [6]. \nHowever, to date, little research has investigated the ways in which mobile location-aware \nsystems can be used to support cooperation and interaction between geographically distributed \nusers. Moreover, there has been little research into the development of location-aware systems \nthat enable mobile users to receive an awareness of other users whose location in the real \nworld corresponds to those places being explored in the virtual world. \nThis paper describes the issues that have arisen while extending the GUIDE system to support \nthis rich form of cooperation between geographically distributed visitors. The issues addressed \ninclude: supporting the sharing (and privacy) of location context, achieving the appropriate \npresentation of location context, managing the capture and storage of positioning information \nand an analysis of the new demands on the GUIDE communications infrastructure. \n2.  Background  \nThe GUIDE system has been developed to provide city visitors with a hand-portable context-\naware tourist guide. The system has been successfully deployed in the city of Lancaster and is \npublicly available to visitors who wish to explore the city.  \nThe system is built around a cell-based wireless communications infrastructure based on \nLucent Technologies’ 802.11 compliant ORiNOCO system. This infrastructure has a dual \nrole, firstly, it is responsible for broadcasting location beacons in order to provide positioning \ninformation, and, secondly, the infrastructure is used to disseminate both static and dynamic \ninformation to mobile GUIDE units. Each cell has associated cell-servers with local storage \nand processing that effectively act as a proxy cache to the central GUIDE web server.  \nCurrently, six communication cells have been deployed within the city covering the major \ntourist attractions. Although the range of ORiNOCO is approximately 200m in free space, \nORiNOCO signals have poor propagation characteristics through buildings and therefore by \nthe strategic positioning of cell-servers, we have been able to create some relatively small \ncells. However, the resolution of positioning information provided by the cells is course \ngrained and one communications cell can contain a number of attractions. For this reason, \ninteraction with GUIDE is to a large extent governed by the design of the infrastructure [3], \ni.e. the strategic placement of cells in order to provide appropriate areas of location resolution \nand network connectivity.  \nIn order to provide acceptable scalability, a broadcast based approach has been adopted to \ninformation dissemination, one implication of this is that servers do not maintain any state \nrelating to GUIDE clients, including their current position.  \nA visitor interacts with his or her GUIDE unit through a local web browser embedded within \nthe GUIDE application. In effect, all HTTP requests are processed by a local web proxy, \nwhich may, in turn, interact with other objects in order to service the request. This aspect of \nthe GUIDE system is described in detail in [2]. In order to support the generation of tailored \nweb-pages, we enable page authors to reference or query the state of GUIDE objects, e.g. \nlocation objects or the visitor’s profile, by augmenting pages with special GUIDE tags. \nThe system utilizes a purpose-built information model [1] in order to represent places, such as \nattractions and key buildings, within the city. The design of the information model and the \nGUIDE application enables city visitors to virtually explore parts of the city, e.g. to read about \nthe City Castle while still in the Tourist Information Center. In addition, it allows visitors to \nuse the system as a form of augmented reality, e.g. by viewing background information about \nthe City Castle while standing outside the main gate.  \n3. Sharing the Location of GUIDE Users \nThe sharing of location information raises a number of issues. In particular, the notion of \nsupporting privacy of location information needs to be considered. Other issues for \nconsideration include achieving the appropriate capture of location information and managing \nthe storage of this information. The following subsections describe these issues in turn. \n3.1. Privacy Issues \nA number of location tracking systems have encountered difficulties because of the \nunwillingness of users at work to allow their location to be known to the system, as \nexperienced with the active badge system [7][8]. A comprehensive investigation into many of \nthe human factors based issues relating to the sharing of such information (in the work \ndomain) is presented in [9]. However, it is important to note that, to the best of the authors’ \nknowledge, there has been very little research that focuses on the issues raised by the \ndevelopment of systems that support the sharing of location information between users that \nare acting at their leisure. \nIn the current GUIDE system, the server side maintains no state information regarding the \nlocation of clients. Furthermore, no GUIDE users are given reason to feel that their location is \nbeing explicitly tracked and that this information could be available to a third party, such as \nanother GUIDE user. Indeed, during the system’s evaluation no concerns appertaining to \nprivacy of location were raised. \nSome visitors are likely to feel concerned if they feel that personal context, such as their \nlocation, is available to others. For this reason, we have enabled users to specify if they wish \nto remain anonymous or if they do not wish to have their location recorded. This information \nis stored in the user profile object.   \n3.2. Capturing the Location of GUIDE users \n3.2.1 Acknowledging the Location of Clients with the Server \nAs described in section 2, the server side of the system does not track the location of GUIDE \nunits. Instead, each GUIDE unit maintains its current location and this information is sensed \nvia the reception of location beacons. These beacons are broadcast every 3 seconds in order to \nprovide the visitor with reasonably timely feedback when walking into a new communications \ncell.  \nIn order to enable the server to capture the location of GUIDE units, the immediately obvious \napproach would be to have clients send an acknowledgement upon receiving a location \nbeacon. However, this approach would generate a significant amount of network traffic and \ntherefore compromise the desire for client scalability as described in [2].  \nOne alternative to this approach would be to reduce client induced network traffic by requiring \nclients to only acknowledge cell handovers. However, this approach is currently unsuitable \nbecause the cell coverage in Lancaster is not complete. As a result, a client could leave a \ncommunications cell but the server would still assume that the client had not changed location. \nThe chosen solution is based on a compromise that requires clients to acknowledge every \ntenth location beacon that is received. In the worst-case scenario, this can lead to the server \nhaving location information relating to a given GUIDE user that is thirty seconds out of date. \nHowever, given the way in which location information is being used, i.e. for providing visitors \nwith basic location awareness, this potential for inconsistency is not considered to be a \nsignificant problem. \n3.2.2 The Requirement for Tight-coupling between Communication Cells \nand Places \nIn order to provide place awareness appertaining to a given visitor, the server clearly needs to \nplace the visitor at a specific location, e.g. the City Castle or the Folly Café. However, the \nlocation information provided by the communications infrastructure was not initially designed \nto provide this granularity of positioning information. Instead, it was designed to provide \ncourse ‘cell-based’ grained positioning information in which the cell could contain multiple \nplaces or attractions.  \nIn order to identify the place where each GUIDE user is located there needs to be a tight-\ncoupling between the resolution of positioning information currently provided by the \ncommunications infrastructure and the area occupied by attractions presented in the GUIDE \ninformation model. To achieve this tight-coupling we are currently extending the existing \n802.11 based communications infrastructure with Bluetooth micro-cells using the Bluetooth \ndevelopment kit [10] produced by Stonestreetone Ltd. If this approach proves unsuitable then \nwe will reinvestigate the use of alternative positioning solutions, e.g. GPS or Ericsson’s \nMobile Positioning System (MPS). \n3.2.3 Storing the Location of GUIDE users \nTwo main strategies have been considered for storing the location of GUIDE users within the \nsystem infrastructure, namely: on the GUIDE server, and, replicated across the client end-\nsystems. With the latter approach, an update would need to be sent to all clients each and \nevery time a GUIDE user changed location  (note: since the information can be broadcast to \nall clients within an ORiNOCO cell, this approach is not as inefficient as it first appears). \nThe key benefit of storing the group’s location context on the client is that this information \ncan be accessed quickly and will be available even when the client is disconnected from the \nnetwork. However, the longer this period of disconnection the greater the likelihood of the \ninformation becoming out of date. Alternatively, the advantages of storing the group’s \nlocation information on the server are: network traffic will only be generated when a client \nmakes a specific request, location information will be consistent and managing privacy \nthrough access control techniques is relatively straightforward. One possible drawback with \nthis approach is that disconnected visitors cannot access location information. \n4. Facilitating Cooperation \nOur goal has been to create a system in which GUIDE users are encouraged to cooperate and \nfeel a sense of community with other users of the system. Our approach towards achieving this \ngoal is to enable a visitor that is using the GUIDE system to read about a particular attraction \nto: \n• Create a comment and rating for association with a particular attraction, e.g. “The \nespresso served at this café is superb”. Alternatively, the visitor can associate a \ncomment regarding usage of the GUIDE system in general, e.g. “I found it useful to \nuse the map facility while following a tour”. Such comments can be read via the \nsystem’s Help page.  \n• Realize when another GUIDE user is (or has recently been) physically located at a  \nparticular attraction. On noticing that another visitor is located at the attraction being \nconsidered, the visitor may then choose to contact the other visitor in order to \nexplicitly ask for his or her subjective opinion of the attraction. \n4.1 User Interface Design \nWe have added links to those pages that relate to attractions within Lancaster in order to \nfacilitate the reading or creating of comments associated with the given attraction and to \nsimplify the process of sending a message to someone who is actually located there. \nFigure 1, illustrates how these links might appear on the page describing Lancaster’s Folly \nCafé. In the example shown in figure 1, if the GUIDE user clicks on the name ‘Keith’ the send \nmessage dialogue box will appear with the recipient’s name automatically filled in. This \nshould make the process of contacting a fellow GUIDE user that is located at a given \nattraction reasonably straightforward. Given that a user may simply wish to contact another \nGUIDE user in order to receive some form of recommendation, we are currently investigating \nthe potential for enabling a GUIDE user to be able to make a single ‘click’ in order to request \nanother GUIDE user to fill in a short recommendation type checkbox. The advantage of this \nfacility is that it would remove the necessity for typing by both the visitor wishing to receive \nthe recommendation and the visitor being asked to supply the recommendation. \n \nFigure 1: Presenting location awareness. \nA ‘collaborate’ button is also available for enabling a GUIDE user to discover the location of \nother users around the city (given the appropriate permissions) and to read or publish \ncomments relating to his\/her actual location. \nWe anticipate that some GUIDE users will be prepared to share their location information \nwith members of their group, e.g. family, but not with other GUIDE users. Similarly some \nusers will want to be contactable by other members of their group but may not find acceptable \nthe possibility of being contacted by other GUIDE users on an ad-hoc basis. \nThe task of designing an easy-to-use interface that enables a GUIDE user to constrain the way \nin which their personal context is shared with others is not trivial. In particular, if the choices \nmade available to the user for constraining the sharing of information are insufficiently \nflexible then users may well simply reject the sharing\/cooperation features altogether.  For \nexample, given the simple choice of ‘do you wish to share your location with everyone and be \ncontactable by everyone’ a user may consider this level of sharing unacceptable and therefore \nanswer negative even though they would be prepared to allow their current location to be seen \nby their friends. Alternatively if too many choices are made available to the user then the \nchoice may become overwhelming and the interface too complicated, again causing the user to \nreject the feature altogether. \nFollowing a number of early designs attempts, we have arrived at a prototype interface for \nenabling the user to specify how their location should be shared and who should be able to \ncontact them. The interface is based on a wizard paradigm whereby the user is led through a \nseries of steps in order to specify any preferences that they might have.  The ‘preferences \nwizard’ is first run when a user is initially presented with a GUIDE unit. However, the wizard \ncan also be run at any point thereafter should the user wish to change their preferences. \nThe first two steps of the wizard are concerned with the specification of the users interests that \nwas present in the initial single-user version of GUIDE. \n The third step (as illustrated in figure 2) is concerned with enabling the visitor to specify their \npreferences for sharing information with members of his\/her group. \nThe next (i.e. fourth) step (as illustrated in figure 3) is concerned with enabling the visitor to \nspecify whether or not they are prepared to let their location be viewed by other GUIDE users \nthat are not in their group and whether such users should also be able to make contact. \nGiven the nature of the problem we anticipate that this interface will undergo a number of \nrevisions following feedback from real users. In particular, we would like to experiment with \nthe notion of enabling visitors to specify specific contexts in which they would not wish to be \ninterrupted by other GUIDE users, e.g. while visiting certain attractions, such as the city \nmuseum.  \n Figure 2: Enabling the user to control how personal information is shared with other members \nof his\/her group. \n Figure 3: Enabling the user to control how personal information is shared with other GUIDE \nusers. \n4.2 Enabling the Markup of Location Awareness \nIn order to provide pages with the ability to query the location awareness information a new \n‘Collaboration’ tag was created as shown below.  \n<GUIDETAG COLLABORATE LOCATION> \nAs with other GUIDE tags, this tag can be embedded in an HTML page for preprocessing by \nthe GUIDE filter object prior to display (see [4] for a detailed example). \nOn reaching the collaborate tag, the GUIDE filter object expands the tag by checking that the \nvisitor has network connectivity and (given that this connectivity is available) makes a remote \nrequest for a list of GUIDE users currently in the cell. The server responds to the query by \nreturning the identity of those visitors currently recorded as being present at the specified \nlocation. For privacy purposes, the actual name of a visitor is only passed back to the client if \nthe visitor has agreed to be contactable (and the permissions for this are stipulated in the user's \nprofile object). If a visitor has requested anonymity then a unique id is assigned and returned \nfor that visitor, e.g. anonymous1, in order to mask the visitor’s identity. \n5. Future Work \n5.1 Tagging Context \nOur avenue that we a keen to explore is the notion of explicitly capturing the context affecting \na user’s rating. In more detail, we want to enable the person providing the rating to explicitly \nstate the context, which most affected their decision.  \nOur chosen technique is to initially identify a likely set of context identifying tags that may \naffect a user’s rating.  The set of tags to be presented to the user is not constant but is context-\naware. In more detail, the set is dependent on a number of factors including the nature of the \nattraction and the user’s profile, e.g. whether or not they are supervising children. The next \nstep is to enable the user to specify which, if any, of these context tags are appropriate for their \nparticular rating. Returning to the café example, because the system knows the following: \nMathew has children and he has rated the café highly and the café has special child facilities \nthen the system could present Mathew with a dialog box similar to that shown in figure 4. \nNotice that as Matthew has given an excellent rating (5) the potential responses (context tags) \nare all positive. \n \n Figure 4: Tagging ratings with context. \nHaving explicitly captured the context associated with a given rating, the underlying system \ncan now process these context tags as it would with any other form of contextual data. This \nprovides the system with a great deal of flexibility for supporting additional context-aware \nfunctionality. In practice, this functionality is likely to include the automatic filtering and \nprioritisation of comments based on their associated context tags. \nThis technique also enables other novel means of providing the user with tailored (context-\naware) information. Consider, for example, a scenario in which Jane, a GUIDE user, visits the \nCity Castle at sunset and then rates the castle with a 5. Because the visit took place at sunset \n(and the system knows this context) one of the context identification tags offered to the user is \nthat of SUNSET. Having been impressed by the sunset Jane decides to associate this tag with \nher rating. \nLater that month, Lucy is in Lancaster just before sunset and is considering a trip to the City \nCastle. Consequently, she decides to read comments left by other people with an interest in \nhistoric architecture. Jane also had an interest for architecture; therefore her comment on the \nCastle is presented to Lucy. Furthermore, because of the imminent sunset Jane’s comment is \nhighlighted in Lucy’s display. \nClearly, the relevant context in this case involves not only the location and user profiles, but \nalso temporal information. However, in this example the temporal aspect is related to the time \nof the sunset and not the time of day. \nInformation such as impending sunsets can be presented to the end users in a number of ways; \none interesting technique is to seamlessly blend this new information into their user interface. \nThis technique, similar to that used by the onCue system [17], would add a ‘Sunset’ button \nonto the user’s interface. \n5.2 Other Future Work \nOne of the key areas for future work is to evaluate the support for cooperation and location \nsharing by a real set of end users. Such an evaluation is required in order to ascertain whether \ncooperation will indeed occur and whether or not visitors will generally accept the sharing of \ntheir location with other visitors. Furthermore, it will be interesting to see whether users are \nprepared to trust the comments of other visitors and whether or not visitors are prepared to \ninvest the time to compose comments or respond to the queries of other GUIDE users.  \nAnother area for future work is to further examine the issue of access control. The traditional \nnotion of access control is based around the notion of relationships, e.g. [11] and this is clearly \nappropriate for GUIDE, e.g. only allowing the sharing location information to members of a \nfamily group. However, we also plan to investigate the issues raised by supporting privacy in \nrelation to place. For example, a visitor might only be prepared to let their location be revealed \nto others who are in the same place; this might be because the person can implicitly trust the \nother people in that place. One example of such a place might be a ‘members only’ club. This \nnotion of utilizing spatial boundaries for access control is reflected in the work on SPACE by \nBullock [12].  \nConsider also the situation in which a visitor might be prepared to be open to interruption \nwhen sitting in a café, but not when rushing around an art gallery that is about to close. There \nis clearly a great deal of potential for using context, such as location, to enable some form of \nagent to determine when cooperation is appropriate. \nAn area that is of much current interest is the creation and standardisation of sophisticated \nlocation models, such as that proposed by Leonhardt [13]. Future work on GUIDE will need \nto investigate the adoption of such a model in order to cope with the complex relationships \nthat arise from having places within places. \n6.  Related Work \nA significant amount of related work exists that has investigated the tracking of users by \nutilizing some form of indoor communications infrastructure. This work was primarily \nintroduced through work on the Olivetti active badge system [7,8] and has evolved to highly \naccurate systems such as the RADAR system [14]. \nHowever, the area currently being investigated is very much inspired by the research into \nsupporting cooperation between users in a virtual space, such as providing users with \nawareness of other users currently viewing the same web page, as demonstrated in the \nCoBrow system [15]. In addition, the work of Benford et al on mixed reality boundaries [16] \nhas also inspired much of our current work and is concerned with the merging of physical and \ndigital worlds. One example of this work has been to investigate the staging of a poetry \nperformance within real and virtual theatres. \n7. Concluding Remarks \nThis paper has described our experiences of extending the existing the GUIDE system to \nfacilitate a richer means of social interaction and cooperation between visitors using the \nGUIDE system. To this end, we have adopted the novel approach of bridging the gulf between \nvirtual and real worlds by providing GUIDE users who are exploring an attraction virtually \nwith an awareness of those visitors that are physically located at the corresponding attraction. \nImplementing this support has required changes to GUIDE at numerous levels, including: \n• Modification to the GUIDE application’s user interface in order to enable users to \nspecify the extent to which their location-based context should be shared and to \nenable users to observe the location of other GUIDE users around the city’s \nattractions. \n• A Redesign of the server in order to enable the effective storage of the location of \nGUIDE users and to support the querying of location information. \n• Extending the user profile to include access control rights for the sharing of location \ninformation between other GUIDE users. \n• A Re-evaluation of the GUIDE communications infrastructure.  \nThis latter point has been caused by the need to have a tight-coupling between the resolution \nor granularity of positioning information currently provided by the communications \ninfrastructure and the area occupied by attractions presented in the GUIDE information model. \nIn particular, if awareness information is to be provided for a given attraction then the \npositioning information available should only relate to that attraction and not include other \nattractions within the area covered.  In order to obtain appropriate location resolution we are \ncurrently extending the GUIDE communications infrastructure with micro-cellular Bluetooth-\nbased wireless technology. \nACKNOWLEDGEMENTS \nThis work was carried out as part of the EPSRC funded GUIDE project (GR\/L05280) in \ncooperation with Lancaster City Council and has received support from HP Labs, Bristol and \nLucent Technologies. \nREFERENCES \n1. K. Cheverst, N. Davies, K. Mitchell and A. Friday. Design of an Object Model for a Context-\nSensitive Tourist Guide, in Computers and Graphics, Vol. 23, No. 6 (December, 1999) 883-891. \n2. N. Davies, K. Mitchell, K. Cheverst and A. Friday, Caches in the Air: Disseminating Tourist \nInformation in the Guide System, in Proceedings of 2nd IEEE Workshop on Mobile Computing \nSystems and Applications (New Orleans, 1999) 11-19. \n3. K. Cheverst, N. Davies, K. Mitchell and A. Friday, Developing a Context-aware Electronic Tourist \nGuide: Some Issues and Experiences, in Proceedings of CHI’2000 (ACM Press, Hague, \nNetherlands, 2000) 17-24. \n4. K. Cheverst, N. Davies, K. Mitchell and A. Friday, Experiences of Developing and Deploying a \nContext-Aware Tourist Guide: The GUIDE Project. In Proc. of MOBICOM’2000 (ACM Press, \nBoston, USA, August, 2000) 20-31. \n5. P. Dourish,  Where the footprints lead: tracking down other roles for social navigation, in Alan J. \nMunro, Kristina Hook, & David Benyon (eds.) Social Navigation of Information Space (Springer-\nVerlag London Limited, London, 1999) 15-34. \n6. P. Dourish and S. Bly, Portholes: supporting awareness in a distributed work group, in Proceedings \nof  Human factors in computing systems, (Monterey, CA, USA, 1992)  541-547. \n7. R. Want, A. Hopper, V. Falcao and J. Gibbons, The Active Badge Location System. In ACM \nTransactions on Information Systems, Vol. 40, No. 1 (January, 1992) 91-102. \n8. M. Spreitzer and M. Theimer, Providing Location Information in a Ubiquitous Computing \nEnvironment, in Proceedings of 14th Symposium on Operating System Principles. ACM Press. \n(1993) 270-283. \n9. S. Hudson and I. Smith, Techniques for addressing fundamental privacy and disruption tradeoffs in \nawareness support systems, in Proceedings of ACM 1996 conference on Computer Supported \nCooperative Work (ACM Press, Boston, USA, 1996) 248-257. \n10. More information is available at: http:\/\/stonestreetone.com\/bluetooth\/products\/bdk\/ (2000). \n11. K. Sikkel, A Group-based Authorization Model for Cooperative Systems, In Proc. of ECSCW’97 \n(Kluwer Academic Publishers, 1997)  345-360. \n12. A. Bullock and S. Benford, Access Control in Virtual Environments, In Proc. of Symposium on \nVirtual Reality Software and Technology 1997 (VRST'97) (Swiss Federal Institute of Technology \n(EPFL), Lausanne, Switzerland, 1997) 29-35. \n13. U. Leonhardt, Supporting Location-Awareness in Open Distributed Systems. Phd Thesis, \nDepartment of Computing, Imperial College of Science, University of London (1998). \n14. P. Bahl and V. N. Padmanabhan, RADAR: An In-Building RF Based User Location and Tracking \nSystem, In Proc. of IEEE INFOCOM 200, (Tel-Aviv, Israel, March, 2000) 775-784. \n15. G. Sidler, A. Scott, H. Wolf, Collaborative Browsing in the World Wide Web, in Proceedings of \n8th Joint European Networking Conference (Edinburgh, May 1997) 12-15. \n16. S. Benford, C. Greenhalgh, G. Reynard, C. Brown and B. Koleva, Understanding and Constructing \nShared Spaces with Mixed Reality Boundaries, in ACM Transactions on Computer-Human \nInteraction, 5 (3) (ACM Press, 1998) 185-223. \n17. Aqtive Homepage: http:\/\/www.aqtive.co.uk (2001). \n"}