{"doi":"10.1179\/174328905X71977","coreId":"135824","oai":"oai:bradscholars.brad.ac.uk:10454\/3824","identifiers":["oai:bradscholars.brad.ac.uk:10454\/3824","10.1179\/174328905X71977"],"title":"Real-time ultrasonic diagnosis of polymer degradation and filling incompleteness in micromoulding.","authors":["Whiteside, Ben R.","Brown, Elaine C.","Ono, Y.","Jen, C. K.","Coates, Philip D."],"enrichments":{"references":[],"documentType":{"type":null}},"contributors":[],"datePublished":"2005","abstract":"NoInjection moulding techniques have been miniaturised and refined to achieve micromoulding which aims to satisfy the need for mass production of low-cost micro- and nanoscale components. However, the microscale mould cavity features and extreme processing conditions which are inherent in the process can result in larger process variations than conventional injection moulding, with a corresponding increase in the probability of producing an unsatisfactory product. Accurate process diagnosis is required to ensure process reliability but integration of sensors onto the small and highly detailed mould units can be problematic and alternatives may need to be sought. Piezoelectric film ultrasonic transducers were integrated onto the extrusion barrel and mould insert of a micromoulding machine for real-time, non-destructive and non-intrusive process diagnosis with an ultrasonic pulse-echo technique. Polymer degradation owing to excessive heating at the extrusion barrel was successfully probed by measuring the ultrasonic velocities in the polymer at the mould insert. Filling incompleteness of the mould cavity was also sensitively detected by monitoring the ultrasonic energy variation transmitted into the part at different points along the melt flow length. The developed ultrasonic sensors and technique enable optimisation and in-process quality assurance of the moulded parts which ensures that maximum process efficiency can be achieved","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:bradscholars.brad.ac.uk:10454\/3824<\/identifier><datestamp>\n                2016-07-25T16:43:17Z<\/datestamp><setSpec>\n                com_10454_413<\/setSpec><setSpec>\n                col_10454_6345<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nReal-time ultrasonic diagnosis of polymer degradation and filling incompleteness in micromoulding.<\/dc:title><dc:creator>\nWhiteside, Ben R.<\/dc:creator><dc:creator>\nBrown, Elaine C.<\/dc:creator><dc:creator>\nOno, Y.<\/dc:creator><dc:creator>\nJen, C. K.<\/dc:creator><dc:creator>\nCoates, Philip D.<\/dc:creator><dc:subject>\nExperimental study<\/dc:subject><dc:subject>\nThermooxidative degradation<\/dc:subject><dc:subject>\nFlow velocity<\/dc:subject><dc:subject>\nUltrasonic method<\/dc:subject><dc:subject>\nProcess control<\/dc:subject><dc:subject>\nMold filling<\/dc:subject><dc:subject>\nQuality assurance<\/dc:subject><dc:subject>\nOptimization<\/dc:subject><dc:subject>\nPiezoelectric sensor<\/dc:subject><dc:subject>\nInjection molding<\/dc:subject><dc:subject>\nPolyoxymethylene<\/dc:subject><dc:subject>\nMonitoring<\/dc:subject><dc:description>\nNo<\/dc:description><dc:description>\nInjection moulding techniques have been miniaturised and refined to achieve micromoulding which aims to satisfy the need for mass production of low-cost micro- and nanoscale components. However, the microscale mould cavity features and extreme processing conditions which are inherent in the process can result in larger process variations than conventional injection moulding, with a corresponding increase in the probability of producing an unsatisfactory product. Accurate process diagnosis is required to ensure process reliability but integration of sensors onto the small and highly detailed mould units can be problematic and alternatives may need to be sought. Piezoelectric film ultrasonic transducers were integrated onto the extrusion barrel and mould insert of a micromoulding machine for real-time, non-destructive and non-intrusive process diagnosis with an ultrasonic pulse-echo technique. Polymer degradation owing to excessive heating at the extrusion barrel was successfully probed by measuring the ultrasonic velocities in the polymer at the mould insert. Filling incompleteness of the mould cavity was also sensitively detected by monitoring the ultrasonic energy variation transmitted into the part at different points along the melt flow length. The developed ultrasonic sensors and technique enable optimisation and in-process quality assurance of the moulded parts which ensures that maximum process efficiency can be achieved.<\/dc:description><dc:date>\n2009-11-03T09:00:36Z<\/dc:date><dc:date>\n2009-11-03T09:00:36Z<\/dc:date><dc:date>\n2005<\/dc:date><dc:type>\nArticle<\/dc:type><dc:type>\nNo full-text available in the repository<\/dc:type><dc:identifier>\nWhiteside, B.R., Brown, E.C., Ono, Y., Jen, C.K. and Coates, P.D. (2005).  Real-time ultrasonic diagnosis of polymer degradation and filling incompleteness in micromoulding.  Plastics Rubber and Composites. Vol. 34, No. 9, pp. 387-392.<\/dc:identifier><dc:identifier>\n90005682<\/dc:identifier><dc:identifier>\n90001892<\/dc:identifier><dc:identifier>\n90008993<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/10454\/3824<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nhttp:\/\/dx.doi.org\/10.1179\/174328905X71977<\/dc:relation>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1179\/174328905X71977"],"year":2005,"topics":["Experimental study","Thermooxidative degradation","Flow velocity","Ultrasonic method","Process control","Mold filling","Quality assurance","Optimization","Piezoelectric sensor","Injection molding","Polyoxymethylene","Monitoring"],"subject":["Article","No full-text available in the repository"],"fullText":null}