{"doi":"10.1017\/S000711450774922X","coreId":"102493","oai":"oai:epubs.surrey.ac.uk:1955","identifiers":["oai:epubs.surrey.ac.uk:1955","10.1017\/S000711450774922X"],"title":"Short-term appetite control in response to a 6-week exercise programme in sedentary volunteers.","authors":["Martins, C","Truby, H","Morgan, LM"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-10","abstract":"Previous cross-sectional studies have shown that sedentary males, unlike their active counterparts, are unable to compensate for previous energy intake (EI). The present study therefore investigated the effects of a 6-week moderate exercise programme (4 times per week, 65-75 % maximal heart rate) on appetite regulation in healthy sedentary volunteers using a longitudinal design. EI at a buffet meal 60 min after high-energy (HEP; 607 kcal) and low-energy (LEP; 246 kcal) preloads, together with 24 h cumulative EI, were measured in twenty-five healthy volunteers (eleven men; mean age 30 (SD 12) years, mean BMI 22.7 (SD 2.3) kg\/m2), at baseline and after the exercise intervention. Subjective hunger and fullness were assessed throughout using visual analogue scales. ANOVA showed a significant preload x exercise interaction on 24 h cumulative EI, supporting an improvement in appetite control over this time period with the exercise programme. There was a trend towards improvement in energy compensation over the same period (8.9 (SD 118.5) % v. 79.5 (SD 146..4) %; P = 0.056). No preload x exercise interaction was observed for buffet EI. Secondary analysis, however, showed that although buffet EI after the two preloads was not significantly different at baseline, buffet EI after the HEP was significantly lower than after the LEP following the exercise intervention. The improvement in short-term appetite control with exercise was not explained by changes in subjective hunger or satiety. This longitudinal study supports the original cross-sectional findings and suggests that exercise may have a significant impact on short-term appetite control by leading to a more sensitive eating behaviour in response to previous EI. Further studies are needed to clarify the mechanisms involved","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1955<\/identifier><datestamp>\n      2017-10-31T14:03:46Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6865616C7468616E646D65646963616C:62696F736369656E6365735F6D65646963696E65:62696F5F6D6F6C6563<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1955\/<\/dc:relation><dc:title>\n        Short-term appetite control in response to a 6-week exercise programme in sedentary volunteers.<\/dc:title><dc:creator>\n        Martins, C<\/dc:creator><dc:creator>\n        Truby, H<\/dc:creator><dc:creator>\n        Morgan, LM<\/dc:creator><dc:description>\n        Previous cross-sectional studies have shown that sedentary males, unlike their active counterparts, are unable to compensate for previous energy intake (EI). The present study therefore investigated the effects of a 6-week moderate exercise programme (4 times per week, 65-75 % maximal heart rate) on appetite regulation in healthy sedentary volunteers using a longitudinal design. EI at a buffet meal 60 min after high-energy (HEP; 607 kcal) and low-energy (LEP; 246 kcal) preloads, together with 24 h cumulative EI, were measured in twenty-five healthy volunteers (eleven men; mean age 30 (SD 12) years, mean BMI 22.7 (SD 2.3) kg\/m2), at baseline and after the exercise intervention. Subjective hunger and fullness were assessed throughout using visual analogue scales. ANOVA showed a significant preload x exercise interaction on 24 h cumulative EI, supporting an improvement in appetite control over this time period with the exercise programme. There was a trend towards improvement in energy compensation over the same period (8.9 (SD 118.5) % v. 79.5 (SD 146..4) %; P = 0.056). No preload x exercise interaction was observed for buffet EI. Secondary analysis, however, showed that although buffet EI after the two preloads was not significantly different at baseline, buffet EI after the HEP was significantly lower than after the LEP following the exercise intervention. The improvement in short-term appetite control with exercise was not explained by changes in subjective hunger or satiety. This longitudinal study supports the original cross-sectional findings and suggests that exercise may have a significant impact on short-term appetite control by leading to a more sensitive eating behaviour in response to previous EI. Further studies are needed to clarify the mechanisms involved.<\/dc:description><dc:date>\n        2007-10<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1955\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Martins, C, Truby, H and Morgan, LM  (2007) Short-term appetite control in response to a 6-week exercise programme in sedentary volunteers.   Br J Nutr, 98 (4).  pp. 834-842.      <\/dc:identifier><dc:relation>\n        10.1017\/S000711450774922X<\/dc:relation><dc:language>\n        eng<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1955\/","10.1017\/S000711450774922X"],"year":2007,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Short-term appetite control in response to a 6-week exercise programme\nin sedentary volunteers\nCatia Martins, Helen Truby and Linda M. Morgan*\nDivision of Nutrition, Dietetics and Food Science, School of Biomedical and Molecular Sciences, University of Surrey Guildford,\nSurrey GU2 7XH UK\n(Received 3 August 2006 – Revised 7 March 2007 – Accepted 22 March 2007)\nPrevious cross-sectional studies have shown that sedentary males, unlike their active counterparts, are unable to compensate for previous energy\nintake (EI). The present study therefore investigated the effects of a 6-week moderate exercise programme (4 times per week, 65–75 % maximal\nheart rate) on appetite regulation in healthy sedentary volunteers using a longitudinal design. EI at a buffet meal 60 min after high-energy (HEP;\n607 kcal) and low-energy (LEP; 246 kcal) preloads, together with 24 h cumulative EI, were measured in twenty-five healthy volunteers (eleven\nmen; mean age 30 (SD 12) years, mean BMI 22·7 (SD 2·3) kg\/m2), at baseline and after the exercise intervention. Subjective hunger and fullness\nwere assessed throughout using visual analogue scales. ANOVA showed a significant preload £ exercise interaction on 24 h cumulative EI, sup-\nporting an improvement in appetite control over this time period with the exercise programme. There was a trend towards improvement in energy\ncompensation over the same period (8·9 (SD 118·5) % v. 79·5 (SD 146.·4) %; P¼0·056). No preload £ exercise interaction was observed for buffet\nEI. Secondary analysis, however, showed that although buffet EI after the two preloads was not significantly different at baseline, buffet EI after\nthe HEP was significantly lower than after the LEP following the exercise intervention. The improvement in short-term appetite control with exer-\ncise was not explained by changes in subjective hunger or satiety. This longitudinal study supports the original cross-sectional findings and\nsuggests that exercise may have a significant impact on short-term appetite control by leading to a more sensitive eating behaviour in response\nto previous EI. Further studies are needed to clarify the mechanisms involved.\nExercise: Appetite: Food intake\nObesity has reached epidemic proportions in many countries\nworldwide1. The steady increase in its prevalence has been\naccompanied, on one hand, by an increase in the consumption\nof energy-dense food and, on the other, by a reduction in\nphysical activity levels1,2. The role of exercise in the preven-\ntion of positive energy balance and obesity is well recog-\nnised3,4. There is evidence that a sedentary lifestyle\npredisposes to a failure in appetite regulation, whereby\nenergy intake (EI) is uncoupled from energy expenditure,\ndue to the inability to downregulate dietary intake to match\nwidespread actual levels of inactivity5. This suggests a link\nbetween inactivity and disrupted homeostatic mechanisms\ninvolved in appetite.\nShort-term feeding studies using the manipulation of pre-\nload energy content to alter energy balance have been used\nin the area of appetite research to study homeostatic feedback\ncontrol of hunger\/satiety6, a process that, if not tightly regu-\nlated, can lead to energy imbalance. These studies have\ndemonstrated differences in hunger and subsequent food\nintake following a high-energy preload (HEP) and low-\nenergy preload (LEP)7 – 9. Appetite responses are thus to\nsome extent dependent on previous EI and sensitive to\nenergy deficits induced through differences in dietary intake.\nIn contrast, energy deficits created by exercise induce different\neffects from those induced by diet10. Although strong compen-\nsatory physiological mechanisms seem to be activated when\ndietary energy deficits disrupt energy balance7,8, the majority\nof the studies show little or no effect of an acute bout of exer-\ncise on subjective feelings of appetite, satiety10 – 13 or EI10 – 18.\nHowever, in contrast to the weak coupling between energy\nexpenditure during acute exercise and subsequent EI in the\nshort term, physically active individuals, such as long-distance\nrunners, usually have a greater EI than those with a sedentary\nlifestyle but paradoxically have a lower BMI, suggesting that a\ntight coupling between EI and expenditure exists at high levels\nof physical activity19. This raises the hypothesis that exercise\nmay sensitise the physiological mechanisms involved in appe-\ntite control, thereby improving the coupling between EI and\nexpenditure. Support for the role of exercise on appetite con-\ntrol was provided by King et al., who demonstrated a good\ncompensation for differences in EI following periods of exer-\ncise in male volunteers who undertook regular exercise20.\nPrevious studies in our laboratories, using a cross-sectional\ndesign, have shown that active men have a better short-term\nappetite response to covert preload energy manipulation com-\npared with sedentary men21. The sedentary group was unable\n*Corresponding author: Dr L. M. Morgan, fax þ44 1483 686401, email l.morgan@surrey.ac.uk\nAbbreviations: EI, energy intake; HEP, high-energy preload; LEP, low-energy preload; VAS, visual analogue scale.\nBritish Journal of Nutrition (2007), 98, 834–842 doi: 10.1017\/S000711450774922X\nq The Authors 2007\nB\nri\nti\nsh\nJo\nu\nrn\nal\no\nf\nN\nu\ntr\nit\nio\nn\nto adjust subsequent EI in response to preload energy manipu-\nlation, with buffet EI 60 min after either an HEP or LEP remain-\ning essentially the same. In contrast, the active group decreased\ntheir subsequent EI following an HEP, demonstrating an almost\nperfect (90 %) compensation. Although these findings provide\nstrong but indirect evidence for the beneficial role of exercise\nin appetite regulation, they do not prove causality, as the\nobserved effects could have been due to lifestyle or other factors\nin the two groups unrelated to their activity levels.\nThe primary aim of the present study was therefore to examine\nwhether increasing habitual physical activity levels in sedentary\nnormal-weight volunteers could improve the sensitivity of short-\nterm appetite regulation in response to two covertly manipulated\npreloads, using a longitudinal design. Secondary aims were to\ndetermine whether any improvement in appetite regulation\nobserved with exercise resulted from changes in macronutrient\nselection and to examine whether the response to exercise dif-\nfered between genders. Short-term appetite regulation was\nassessed at baseline and after a 6-week moderate-intensity exer-\ncise intervention, using subjective ratings of motivation to eat\nand objective measures of food intake at a buffet meal and\nover a 24 h period, following two preloads of different energy\ncontent. The present study tested the hypothesis that an increase\nin habitual physical activity levels in sedentary individuals\nwould result in an improvement in their appetite control,\nenabling them to detect differences in preload energy manipu-\nlation and subsequently to adjust for these.\nMaterials and methods\nParticipants\nTwenty-nine healthy sedentary volunteers (fifteen men, four-\nteen women), with a mean age of 29·8 (SD 11·6) years and a\nmean BMI of 22·7 (SD 2·3) kg\/m2, who were not dieting to\nlose weight, were recruited. A sedentary lifestyle was defined\nas not being engaged in strenuous work or in regular brisk\nleisure physical activity more than once a week or engaged\nin light exercise for more than 20 min\/d, more than three\ntimes a week. Physical activity and exercise were defined\naccording to the American College of Sports Medicine22.\nThis was assessed through an exercise history of the 3\nmonths prior to the study. Participants’ baseline anthropo-\nmetric, fitness and metabolic data are shown in Table 2 later.\nThe Dutch Eating Behaviour Questionnaire23 was used to\nassess restrained, emotional and external eating behaviour. Only\nthose scoring less than 4 on any one of the Dutch Eating Behaviour\nQuestionnaire subscales were accepted for the study. Average\nscores were of 2·2 (SD 0·7), 2·5 (SD 0·7) and 3·0 (SD 0·5),\nrespectively.\nParticipants were unaware of the differences in energy\nbetween the preloads and of the real purpose of the study;\nthey were told that it aimed to investigate the effects of exer-\ncise on mood and food choices. All participants gave written\nconsent before enrolling in the study and were debriefed at\nthe conclusion of the study. The study was approved by the\nUniversity of Surrey Ethics Committee.\nStudy protocol\nParticipants underwent a 6-week moderate-intensity exercise\nprogramme. A preload\/test-meal paradigm, using an HEP\nand LEP, was used at baseline and after the exercise interven-\ntion to assess macronutrient selection and the ability of partici-\npants to regulate their food intake in response to previous\ndietary intake. The effect of the exercise programme on habit-\nual food intake, anthropometry, cardiovascular fitness and\nfasting hormones and metabolites was also assessed.\nExercise programme. The exercise programme started at\nweek 1 and ran until week 6. Participants were given two\nchoices: free temporary gym passes, for the duration of the\nstudy, or a stationary exercise bicycle delivered to their home.\nThey were asked to perform 30–45 min of moderate aerobic\nexercise (65–75 % of maximal heart rate) at least four times\nper week, continuously or in bouts of at least 10 min each, in\naccordance with the most recent recommendations designed to\nimprove aerobic fitness and body composition24 – 26.\nTo ensure proper monitoring of the exercise intensity and dur-\nation, and to verify the participants’ compliance with the exer-\ncise prescription, participants were asked to use a heart rate\nmonitor (Polar F1; Polar Oy, Kempele, Finland) every time\nthey exercised and to record in a daily diary the exercise they\nperformed, including the type, duration and intensity (average\nheart rate during each bout of exercise as displayed on the\nheart-rate monitor and self-recorded by each participant). In\naddition, for those who choose the gym, frequency of attendance\nwas independently obtained from a member of the staff. More-\nover, to check that the prescribed exercise did not result in a\ncompensatory reduction in non-exercise physical activity,\nparticipants wore pedometers for a week, before the start of\nthe study (pre-study habitual physical activity) and at weeks 3\nand 6 of the exercise programme. In order to maintain compli-\nance, all participants were contacted by telephone once a week.\nAnthropometric measurements (weight, height and body\ncomposition using bioimpedance) were taken at the baseline\nand end of the exercise programme, together with a fasting\nvenous blood sample for hormone and metabolite analysis.\nAs an independent measure of compliance with the prescribed\nexercise programme, maximal oxygen uptake was estimated\nusing a submaximal exercise test on a cycle ergometer (YMCA\nprotocol)22, at the beginning and end of the exercise intervention.\nPreloads and measurement of appetite. Two different pre-\nloads, HEP and LEP, with similar sensory properties were\nused in this study. They were presented as 450 ml flavoured\nmilkshakes differing in their energy content by 361 kcal\nthrough the addition of maltodextrin (Table 1).\nFood intake after preload consumption was assessed using a\nstandardised buffet ad libitum, in excess of expected con-\nsumption (4100 kcal, 85 g protein, 250 g fat, 373 g carbo-\nhydrates), with a variety of lunch-type foods (sandwiches,\nsalad, fruit, cake, biscuits, crisps, yogurt, mayonnaise, mus-\ntard). Participants were asked to rank different food items in\neach one of the above categories by order of preference.\nThey were then offered their second food option within each\ncategory and second and third option of sandwich fillings27.\nFoods were purchased from a local supermarket and were\nnot modified in any way. Small bite portions of fixed size\n(one quarter of a sandwich, sliced banana, etc.) were used to\ndeprive participants of familiar cognitive and visual clues\nused to self-monitor food consumption28.\nFood was weighed and\/or counted before participants sat down\nto the meal and reweighed\/re-counted after each subject had fin-\nished eating, to allow calculations of EI and macronutrient\nExercise and short-term appetite regulation 835\nB\nri\nti\nsh\nJo\nu\nrn\nal\no\nf\nN\nu\ntr\nit\nio\nn\nintake. All dietary analysis was performed using Windows Diets\nResearch Version programme (Robert Gordon University, Aber-\ndeen, UK). Participants were presented with exactly the same type\nand amount of food on all of the four appetite-challenge days.\nSubjective feelings of hunger (‘How hungry do you feel?’)\nand fullness (‘How full do you feel?’), as well as the palatabil-\nity of the preloads, were assessed using 10 cm self-rated visual\nanalogue scales (VAS) as previously described8.\nAppetite-challenge days. Using a randomised single-blind\ncross-over design, participants were given an HEP or LEP at base-\nline on different days of the week (appetite-challenge days), at\nleast 2 d apart in order to avoid participants from becoming\nbored with the foods presented at the buffet and to prevent any\ncross-over effects. This was again repeated after the 6-week exer-\ncise intervention, with participants acting as their own controls.\nOn the morning of each appetite-challenge day, participants\nwere asked to consume their usual breakfast before 09.30\nhours. This was the same on all four occasions in order to stan-\ndardise pre-study appetite. After that, participants were\ninstructed not to eat or drink anything except water, which was\npermitted up to 10.30 hours, and were asked to arrive at the\nClinical Investigation Unit at 11.45 hours. Participants were\nalso asked to avoid alcohol consumption and exercise during\nthe 24 h prior to, and during, each appetite-challenge day.\nParticipants sat quietly after arrival, and instructions regard-\ning the completion of the VAS were provided. The first VAS\nwas completed to assess baseline hunger\/fullness feelings. Pre-\nloads were then presented, and participants were asked to con-\nsume them within 5 min. Further VAS were completed\nimmediately after the preload (including the question ‘How\nwould you rate the palatability of the milkshake?’) and then\nat 20, 40 and 60 min. During this period of time, participants\nstayed in the Clinical Investigation Unit, but they were free to\nwrite, read or watch television. Participants were free to talk to\neach other, but were asked not to discuss the study or their\nVAS scores. Each VAS was collected before the next was\ngiven to avoid participants modifying their previous scores.\nA buffet meal was served 60 min after the preload, and par-\nticipants, each confined to an individual booth, were instructed\nto eat until comfortably full. To avoid opportunistic overcon-\nsumption, participants were informed that they could take\nhome any food left over after the buffet lunch. Participants\nwere also asked to record in a food diary all they consumed\nafter the buffet lunch until (and including) breakfast on the\nfollowing day (post-buffet food diary) in order to estimate\n24 h energy compensation following the preloads.\nFood intake. Participants were asked to maintain their\nnormal diet throughout the study. This was verified by a 3 d\nestimated food diary (including at least one weekend day),\nusing household measures, at baseline and week 6 of the exer-\ncise intervention. A 24 h food recall was performed prior to\neach appetite-challenge day in order to verify participants’\ncompliance with the study instructions.\nBiochemical analysis. Fasting blood samples were ana-\nlysed for total and HDL-cholesterol, triacylglycerol, NEFA,\nglucose and insulin. Glucose was analysed using an immobi-\nlised enzyme biosensor (YSI 2300 Stat Plus Glucose and Lac-\ntate Analyzer; Yellowsprings, OH, USA), insulin using an\nELISA (MTL Research Limited, Cardiff, UK), and all other\nbiomarkers were quantified using a Randox Space automated\nsystem (AlfaWasserMann; Randox, Co. Antrim, UK). The\ninterassay CV were less than 5 % for metabolites and less\nthan 10 % for insulin. Insulin sensitivity was calculated\nusing the homeostatic model assessment (HOMA model)29.\nStatistical analysis. Statistical analysis was carried out\nusing SPSS (SPSS Inc., Chicago, IL, USA). All variables\nwere checked regarding their normal distribution using the\nShapiro–Wilk test. Statistical significance was assumed at\nP,0·05, unless otherwise stated.\nDifferences in energy and macronutrient intake in the 24 h\nbefore each appetite-challenge day (from data derived from\nthe food histories) were assessed by repeated-measures\nANOVA.\nChanges in habitual energy and macronutrient intake with\nthe exercise programme (based on food diaries), as well as\nin anthropometric variables, fitness and circulating metab-\nolites, were assessed by paired sample t tests.\nThe effect of preload (HEP v. LEP), exercise (pre v. post)\nand gender on energy and macronutrient (in percentage)\nintake, at the buffet lunch and over a 24 h period (cumulative\nEI), was assessed by a mixed between-within participants\nANOVA with preload and exercise as the within-subject vari-\nables and gender as the between-subjects factor. Additionally,\npaired sample t tests were performed to investigate differences\nin buffet EI after each preload before and after the 6-week\nexercise intervention. In order to correct for multiple compari-\nsons, the level of significance (a level) was reduced to\nP,0·01. Energy compensation, also known as the compen-\nsation index, was calculated as the difference in EI between\nthe two study days (HEP v. LEP) divided by the difference\nin preload energy content and expressed as a percentage30.\nThis was calculated for both EI at the buffet lunch and cumu-\nlative EI over a 24 h period following preload consumption.\nThe effect of time, preload (HEP v. LEP) and gender on\nsubjective feelings of hunger\/fullness was assessed separately\nat baseline and the end of the study by a mixed between-\nwithin subjects ANOVA, with preload and time as the within-\nsubject variables and gender as the between-subjects factor.\nResults\nAnthropometry, fitness and metabolic profile\nOf the twenty-nine participants initially recruited, four men\ndid not complete the study due to individual work pressures.\nThe results are, therefore, presented for twenty-five partici-\npants (eleven men, fourteen women). BMI, percentage of\nTable 1. Ingredients and nutritional composition of the preloads\nLow-energy preload High-energy preload\nIngredients (g):\nDouble cream 46 46\nMaltodextrin (Maxijul) 0 95\nNesquik‡ 10 10\nNutritional composition:\nEnergy (kcal) 246 607\nProtein (g) 0·9 0·9\nCarbohydrate (g) 10·5 100·7\nFat (g) 22·2 22·2\nAmounts and nutritional composition per 450 ml serving, made up to this volume\nwith water.\n‡ Chocolate, strawberry or banana flavoured.\nC. Martins et al.836\nB\nri\nti\nsh\nJo\nu\nrn\nal\no\nf\nN\nu\ntr\nit\nio\nn\nbody fat and fitness levels were not significantly different\nbetween the four men who withdrew and the eleven who com-\npleted the exercise intervention. Changes in anthropometry,\nfitness and metabolic profile are shown in Table 2. No signifi-\ncant changes were observed in any of the anthropometric\nmeasures or blood metabolites analysed with the exercise\nintervention. The majority of the participants had a fitness\nlevel, based on their estimated maximal oxygen uptake,\nbelow the thirtieth percentile at baseline according to the\nAmerican College of Sports Medicine22, and significant\nimprovements in fitness were observed with the exercise inter-\nvention in all participants (P,0·001), men (P,0·01) and\nwomen (P,0·05).\nAs expected, men were significantly heavier and had a lower\npercentage of body fat than women at both the baseline and end\nof the study; they had a significantly higher maximal oxygen\nuptake (ml\/Kg per min) at the end and a bigger improvement\nin fitness levels (5·2 (SD 4·7) v 1·6 (SD 2·3); P,0·05).\nExercise compliance\nCompliance with the prescribed exercise programme was very\ngood. The whole group exercised on average 4·0 ^ 0·8 times\nper week, with a total of 187·3 (SD 74·9) min\/week and at an\nintensity of 69·9 (SD 3·1) % of their maximal heart rate. The\nonly significant differences observed between genders was a\nhigher frequency of exercise in women compared with men\n(4·4 (SD 0·8) v. 3·6 (SD 0·6) times a week; P,0·05).\nThe number of steps per week, for the whole group, was\n8474 (SD 2819) before the start of the study, 7996 (SD 2929)\nat week 3 and 7806 (SD 2956) at week 6, with no significant\ndifferences over time or between genders.\nFood histories and food diaries\nThe exercise intervention did not cause any significant change in\ndaily energy or macronutrient intake (as assessed by the 3 d food\ndiaries), when comparing preintervention with week 6 of the\nexercise programme in either the whole group, men or women.\nIn addition, energy and macronutrient intake for the 24 h pre-\nceeding each of the four appetite-challenge days was not signifi-\ncantly different, in either the whole group, men or women.\nEnergy and macronutrient intake over 24 h\nCumulative EI for the 24 h following preload consumption,\nbefore and after the 6-week exercise intervention, is shown\nin Fig. 1. ANOVA showed a significant activity £ preload\ninteraction (P¼0·023) on 24 h cumulative EI, but no signifi-\ncant effect of exercise, preload or exercise £ preload £\ngender interaction.\nPaired t tests comparing cumulative EI following preload\nconsumption (assuming a a level of less than 0·01 to correct\nfor multiple comparisons) found no significant differences in\ncumulative EI (kcal) after the HEP and LEP at baseline\n(2172 (SD 785) v. 2163 (SD 627); P¼0·925). After the 6-\nweek exercise intervention, however, buffet EI after the\nHEP was significantly lower than after the LEP (18 301\n(SD 638) v. 2162 (SD 594); P¼0·007) for the whole sample.\nA similar baseline pattern was observed when men and\nwomen were analysed separately, with no significant differences\nin cumulative EI after each preload (HEP v. LEP) at baseline\n(2770 (SD 666) v. 2665 (SD 431) kcal, P¼0·584; 1745 (SD 123)\nv. 1805 (SD 485) kcal, P¼0·475; for men and women, respect-\nively). After the 6-week exercise intervention, there was a\ntrend towards a lower cumulative EI after the HEP than after\nthe LEP (2013 (SD 733) v. 2444 (SD 657) kcal, P¼0·061; 1677\n(SD 526) v. 1924 (SD 428), P ¼ 0·051; for men and women,\nrespectively).\nWhen energy compensation was calculated as described in\nthe Methods section earlier (compensation index, expressed\nas a percentage), over a 24 h period, a trend to improved com-\npensation was observed with the exercise intervention\n(8·9 ^ 118·5 % at baseline v. 79·5 (SD 146·4) 4 % following\nthe exercise intervention; P¼0·056). When each gender was\nanalysed separately, however, no significant effects were\nfound (for men, 8·4 (SD 157·7) % v. 95·6 (SD 190·7) %,\nP ¼ 0·150; for women, 20·9 (SD 87·3) % v. 68·4 (SD\n113·8) %, P¼0·250; at baseline and end, respectively).\nNo significant effects of exercise, preload, gender or inter-\nactions were observed in the percentage of 24 h cumulative\nenergy provided by each macronutrient.\nEnergy and macronutrient intake at the buffet lunch\nBuffet lunch EI following each preload, before and after the\nexercise intervention, is shown in Fig. 2. ANOVA showed\na significant effect of preload on buffet EI (kcal), with\nbuffet EI after the LEP being significantly higher than that\nafter the HEP (858·4 (SD 284·2) v. 695·1 (SD 294·3) kcal;\nP,0·0001). No significant effect of exercise, preload £ exer-\ncise interaction or preload £ exercise £ gender interaction\nwas observed on buffet EI.\nPaired t tests comparing buffet EI following preload con-\nsumption (assuming an a level of less than 0·01 to correct for\nmultiple comparisons) found no significant differences in\nbuffet EI (kcal) after the LEP and HEP at baseline in all partici-\npants (864 (SD 294) v. 735 (SD 302); P¼0·015), men (1031\n(SD 269) v. 920 (SD 307); P¼0·28) and women (733 (SD 248)\nv. 589 (SD 208); P¼0·012). After the 6-week exercise interven-\ntion however, EI after the HEP was significantly lower than that\nafter the LEP in all participants (656 (SD 288) v. 853 (SD 280);\nP,0·0001) and men (1016 (SD 275) v. 759 (SD 275);\nP¼0·001), but not in women (724·2 (SD 216) v. 573 (SD 293);\nP¼0·038).\nNo significant improvement in energy compensation (com-\npensation index), at the buffet meal, was observed with\nthe exercise intervention in either all participants (35·8\n(SD 68·7) % v. 54·6 (SD 60·7) %; P¼0·264), men (31 (SD 89) %\nv. 71 (SD 49) %; P¼0·225) or women (40 (SD 51) % v. 42\n(SD 68) %; P¼0·908).\nNo significant effects of exercise, preload, gender or inter-\nactions were observed in the percentage of energy provided\nby each macronutrient at the buffet lunch, with the exception\nof protein, which had a significantly bigger contribution (as a\npercentage) to buffet EI after the exercise intervention com-\npared with baseline (13·1 (SD 2·6) % v. post 13·9 (SD 3·2) %;\nP¼0·025 for all participants).\nWhen participants who improved in short-term energy com-\npensation with the 6-week exercise intervention (seven men\nand eight women) were compared with those who did not\nimprove (four men and six women) in relation to anthropometry,\nExercise and short-term appetite regulation 837\nB\nri\nti\nsh\nJo\nu\nrn\nal\no\nf\nN\nu\ntr\nit\nio\nn\nTable 2. Anthropometry, fitness levels and metabolic profile at baseline and at the end of the study in all participants (n 25), men (n 11) and women (n 14). Results expressed as mean ^ SD\nBaseline End\nAll Men Women All Men Women\nMean SD Mean SD Mean SD Mean SD Mean SD Mean SD\nWeight (kg) 66·1 8·7 72·5 7·4 61·1 5·9 66·4 8·3 72·8 6·1 61·4 6·2\nBMI (kg\/m2) 22·7 2·3 23·4 2·4 22·1 2·2 22·8 2·2 23·5 2·1 22·3 2·2\nBody fat (%) 23·6 7·8 16·3 4·9 29·2 4·0 23·0 7·5 16·2 4·7 28·3 4·0\nFitness level: maximal oxygen uptake (ml\/kg per min) 31·1 4·8† 32·7 5·1** 29·9 4·3* 34·3 7·4† 37·9 8·4** 31·5 5·1*\nPercentile of maximal oxygen uptake‡\n, 10 3 (21·4 %) 5 (45·5 %) 8 (32 %) 7 (28 %) 4 (36·4 %) 3 (21·4 %)\n10–20 6 (42·9 %) 5 (45·5 %) 11 (44 %) 4 (16 %) 2 (18·2 %) 2 (14·3 %)\n30–69 4 (28·4 %) 1 (9·1 %) 5 (20 %) 11 (44 %) 4 (36·4 %) 7 (49·7 %)\n70–89 1 (7·1 %) – 1 (4 %) 2 (8 %) – 2 (14·3 %)\n$ 90 – – – 1 (4 %) 1 (9·1 %) –\nNEFA (mmol\/l) 0·6 0·3 0·5 0·2 0·7 0·4 0·5 0·3 0·5 0·3 0·6 0·2\nTotal cholesterol (mmol\/l) 4·8 1·0 4·6 1·2 4·9 0·8 4·6 0·8 4·4 0·9 4·8 0·8\nHDL-cholesterol (mmol\/l) 1·2 0·3 1·0 0·2 1·3 0·3 1·2 0·3 1·0 0·2 1·3 0·3\nTriacylglycerol (mmol\/l) 1·1 0·5 1·2 0·5 1·0 0·4 1·0 0·4 1·0 0·4 1·0 0·4\nGlucose (mmol\/l) 5·1 0·4 5·2 0·5 5·0 0·3 4·9 0·5 5·0 0·4 4·9 0·5\nInsulin (pmol\/l) 62·2 48·7 82·4 66·4 46·4 19·1 59·9 39·4 77·1 51·1 46·4 20·1\nInsulin sensitivity (HOMA) 2·0 1·6 2·8 2·2 1·5 0·6 1·9 1·3 2·5 1·6 1·4 0·6\nHOMA, homeostatic model assessment, calculated as: (fasting insulin levels (mU\/l) £ fasting glucose levels (mmol\/l)) \/ 22·529.\n‡ Percentile of maximal oxygen uptake (ml\/kg\/min) adjusted for age and gender: classification according to the American College of Sports and Medicine, 2000.\nMean values were significantly differenct between baseline and the end of the study: *P,0·05, **P,0·01, †P,0·0001.\nC\n.\nM\nartin\ns\net\na\nl.\n8\n3\n8\nBritish Journal of Nutrition\nfitness levels, number of steps per day, eating behaviour, exer-\ncise compliance and metabolic profile, only the number of\nsteps per day before the start of the study and the duration\nof exercise (min\/week) in men were significantly different.\nMen who improved in their ability to compensate reported a\nsignificantly higher number of steps per day before the start\nof the study (9917 (SD 3594) v. 5681 (SD 1356); P,0·05)\nand a higher duration of exercise (min\/week; 173 (SD 18) v.\n130 (SD 25) min\/week; P,0·05), during the 6-week exercise\nprogramme, compared with those who did not improve.\nChanges in subjective ratings of hunger\/fullness and\npalatability of the preload\nSubjective hunger and fullness immediately before and for\n55 min after preload consumption can be seen in Tables 3 and\n4. A significant effect of time (P , 0·0001), but no significant\neffect of preload, gender or interactions, was found in hunger\nscores, which decreased immediately following preload intake\nand thereafter increased progressively over time both at baseline\nand at the end of the study.\nFullness ratings presented an inverse temporal pattern,\nincreasing immediately following preload intake and there-\nafter decreasing progressively over time (P,0·0001), both at\nbaseline and at the end of the study. A significant effect of\npreload was also found at beseline alone, with high higher\nscores after the HEP compared with the LEP.\nNo significant differences were observed in palatability rat-\nings between the two preloads, either at baseline or end of the\nstudy in either men or women.\nDiscussion\nThe main purpose of this study was to examine, using a longi-\ntudinal design, the effect of a 6-week exercise programme on\nshort-term appetite control in sedentary individuals. The pre-\nsent study supports the results of our previous cross-sectional\nstudy21, showing for the first time that exercise improves\nshort-term appetite regulation by leading to a more sensitive\neating behaviour in response to previous EI.\nA significant improvement in compensation over a 24 h\nperiod was observed with the exercise intervention, as evi-\ndenced by the significant exercise £ preload interaction.\nAlthough at baseline participants did not distinguish between\nthe two preloads and had a similar cumulative EI over the\nnext 24 h, after the 6-week exercise intervention they signifi-\ncantly downregulated cumulative EI after the HEP compared\nwith the LEP (see Fig. 1 earlier). All macronutrients seem\nto have contributed to this improvement in compensation\nover a 24 h period. Moreover, a near-significant (P¼0·056)\nimprovement in energy compensation (expressed as a percen-\ntage compensation over the 24 h period), from an average of\n8·7 % to 79·5 %, was observed with exercise intervention.\nThis improvement in compensation on the first 24 h follow-\ning preload intake was not reflected acutely at the buffet meal.\nANOVA did not reveal an exercise £ preload interaction on\nbuffet EI. Secondary analysis, however, showed that although\nbuffet EI after each preload was very similar at baseline,\nwhether the analysis was performed in all participants, men\nor women separately, after the exercise intervention buffet\nEI after the HEP was significantly lower than that after the\nLEP in all participants and men, but not in women. A\ngender difference in the appetite response to exercise has\nbeen reported by others11,18,31. Although our EI findings are\nconsistent with a gender difference, with men showing a\nbetter acute compensatory response to preload manipulation,\nan exercise £ preload £ gender interaction was not found,\nexcluding a significant effect of gender on energy compen-\nsation at the buffet lunch.\nThe trend towards an improvement in acute appetite regu-\nlation in response to preloading was not, however, paralleled\nby any significant improvement in the compensation index\n(energy compensation expressed as a percentage). Our study\nwas not, however, powered to look at changes in the compen-\nsation index. The very large interindividual variation in energy\ncompensation (observed in our study, both at baseline and in\nresponse to exercise) has been highlighted by others30,32.\nCecil et al.32 demonstrated that, in children, intraindividual\nvariation in the compensation index was lower relative to\ntheir interindividual variation. It is not known whether the\nFig. 1. Cumulative EI after the high-energy (HEP; A) and low-energy\n(LEP; ) preload, at baseline and at the end of the study. Mean values with\ntheir standard errors for twenty-five participants (eleven men and fourteen\nwomen). ANOVA showed significance for exercise £ preload interaction\n(P¼0·023), but no significant main effects of exercise or preload or an\nexercise £ preload £ gender interaction. Mean values were significantly\ndifferent between conditions: **P,0·01.\nFig. 2. Energy intake (kcal) at the buffet lunch after the high-energy (HEP; A)\nand low-energy (LEP; ) preload, at baseline and end of the study. Mean\nvalues with their standard errors for twenty-five participants (eleven men and\nfourteen women). ANOVA showed a significant effect of preload (P,0·0001)\nbut no significant effect of exercise, preload £ exercise or preload £ exer-\ncise £ gender interaction. Mean values were significantly different between\nconditions: **P,0·01, †P,0·0001 (assuming a , 0·01 to correct for multiple\ncomparisons).\nExercise and short-term appetite regulation 839\nB\nri\nti\nsh\nJo\nu\nrn\nal\no\nf\nN\nu\ntr\nit\nio\nn\nsame holds true for adults, and what impact exercise might\nhave on intraindividual variation in the compensation index.\nOur findings support those of previous workers and clearly\ndemonstrate the complexity of the compensation mechanism\nand the involvement of factors other than exercise in appetite\nregulation.\nWe found an average baseline acute energy compensation,\nat the buffet lunch, of 31 % in our male group. This value is\nmuch higher than the 7 % reported in the inactive group in\nour previous study21. Several factors may help to explain\nthese differences, namely eating behaviour and body weight,\npreviously shown to be key determinants in the compensation\nfor previous EI9,33 – 35. Although restrained eating, as assessed\nby the Dutch Eating Behaviour Questionnaire, and BMI\nwere very similar in our own and Long’s male inactive\ngroup (2·0 (SD 0·8) v. 1·9 (SD 0·5) and 23·4 (SD 2·4) v. 24·3\n(SD 3·0) kg\/m2, respectively), the slightly lower BMI in our\nmales may help to explain their higher baseline compensation.\nAfter the 6-week exercise programme, our male group\nshowed a 71 % acute energy compensation, a figure that is\nlower than the 90 % compensation reported in Long’s active\ngroups. It is important to emphasise that, in Long’s study, par-\nticipants were classified as active or inactive based on an exer-\ncise history of the previous 3 months. We used a similar\napproach to recruit our sedentary participants. Our exercise\nprogramme was, however, of only 6 weeks, which means\nthat, at the end of the study, our participants would still be\nclassified as inactive according to Long’s criteria21. Therefore,\na longer intervention would probably be needed in order to\nattain that level of energy compensation at the buffet meal.\nThis is supported by the finding that those men who improved\nin energy compensation acutely at the buffet meal were the\nTable 4. Subjective ratings of fullness (cm) at intervals before and after high- (HEP) and low-energy (LEP) preload\nconsumption, at baseline and at the end of the study, in all participants (n 25), men (n 11) and women (n 14)\n210 min 5 min 20 min 40 min 55 min\nMean SD Mean SD Mean SD Mean SD Mean SD\nAll\nHEP – Baseline 3·3 1·9 7·0 1·6 5·0 2·1 5·0 1·9 4·9 2·0\nLEP – Baseline 3·0 2·1 5·6 1·9 4·5 2·0 3·8 1·9 3·4 2·0\nHEP – End 3·0 2·0 5·7 2·6 5·0 2·6 4·5 2·3 4·8 2·4\nLEP – End 3·2 2·1 5·4 2·2 5·0 2·0 4·2 2·0 4·0 2·1\nMen\nHEP – Baseline 3·8 2·1 7·3 1·3 4·8 2·0 4·7 1·8 4·4 1·8\nLEP – Baseline 2·7 2·2 5·9 1·6 4·6 1·9 3·1 1·6 2·5 1·6\nHEP – End 2·7 1·7 5·2 2·2 4·4 2·3 3·9 2·2 4·3 2·2\nLEP – End 3·5 2·0 4·3 1·7 4·9 1·8 3·7 1·9 3·7 1·6\nWomen\nHEP – Baseline 3·0 1·8 6·7 1·8 5·2 2·3 5·2 2·1 5·3 2·2\nLEP – Baseline 3·3 2·1 5·3 2·0 4·4 2·1 4·3 2·1 4·1 2·0\nHEP – End 3·2 2·3 6·1 2·9 5·5 2·8 5·0 2·3 5·2 2·5\nLEP – End 2·9 2·2 6·3 2·2 5·1 2·1 4·6 2·1 4·2 2·4\nANOVA showed a significant effect of time (P,0·0001), both at baseline and the end of the study, and a significant effect of preload at\nbaseline alone.\nTable 3. Subjective ratings of hunger (cm) at intervals before and after high- (HEP) and low-energy (LEP) preload con-\nsumption, at baseline and at the end of the study, in all participants (n 25), men (n 11) and women (n 14)\n210 min 5 min 20 min 40 min 55 min\nMean SD Mean SD Mean SD Mean SD Mean SD\nAll\nHEP – Baseline 6·3 1·9 3·5 2·4 4·3 2·4 5·3 2·1 5·4 2·2\nLEP – Baseline 5·9 2·1 4·0 1·9 4·8 2·1 5·7 2·1 6·3 2·1\nHEP – End 6·8 1·6 4·8 2·6 5·0 2·6 5·7 2·1 6·1 2·0\nLEP – End 6·2 2·2 4·4 2·6 5·3 2·6 5·6 2·3 6·2 2·0\nMen\nHEP – Baseline 6·2 1·6 3·6 2·4 4·9 2·1 5·9 1·9 5·9 1·9\nLEP – Baseline 6·7 1·5 4·7 1·5 5·6 1·5 6·8 1·6 7·4 1·3\nHEP – End 6·9 1·1 5·7 2·1 5·3 2·3 6·9 1·9 6·7 1·7\nLEP – End 6·2 2·0 5·5 2·3 6·0 2·0 5·7 2·1 6·2 2·1\nWomen\nHEP – Baseline 6·4 2·1 3·4 2·5 3·9 2·6 4·9 2·2 5·0 2·4\nLEP – Baseline 5·3 2·3 3·5 2·0 4·2 2·3 5·0 2·2 5·6 2·2\nHEP – End 6·8 2·0 4·2 2·7 4·8 2·8 4·9 1·9 5·7 2·2\nLEP – End 6·2 2·3 3·5 2·6 4·8 2·9 5·5 2·5 6·1 2·1\nANOVA showed a significant effect of time (P,0·0001) both at baseline and end of the study, but no effect of preload, gender or\ninteractions.\nC. Martins et al.840\nB\nri\nti\nsh\nJo\nu\nrn\nal\no\nf\nN\nu\ntr\nit\nio\nn\nmore active ones before the start of the intervention (based on\npedometer readings) and those who exercised for longer\nperiods during the 6-week exercise programme. These findings\nstrengthen our hypothesis for a role of physical activity on\nshort-term appetite control.\nThe effects of exercise on appetite control could possibly be\nexplained by its impact on macronutrient preferences and food\nchoices, in the hedonic (pleasure) response to food or, alterna-\ntively, in the sensitivity of the satiety cascade system13,36. We\ndid not, however, find any change in macronutrient selection\nwith exercise (either at the buffet meal or from the 3 d food\ndiaries), which is consistent with the majority of the litera-\nture37 – 39, and the hedonic response to food was beyond the\nscope of this study. The mechanisms targeted by exercise\nthat may help to explain its role in appetite regulation are\nlikely to fall into three categories: long-term, including\nleptin and insulin; intermediate, including post-absorptive\nsignals associated with macronutrient oxidation such as\nglucose and free fatty acids levels; and, finally, short-term\nmechanisms involving post-ingestive, but preabsorptive,\nsignals arising from the gastrointestinal tract in response to\nfood intake40.\nGastrointestinal hormones involved in short-term appetite\nregulation, such as cholecystokinin, glucose like-peptide-1 and\npeptide YY, are potential candidates41. We did not find any sig-\nnificant changes in fasting insulin, glucose or NEFA levels, or\ninsulin sensitivity (homeostatic model assessment model) with\nthe exercise intervention, and leptin, although not measured, is\nnot expected to have changed as no significant changes in\nbody weight or body composition were observed in our partici-\npants. This leaves us with the short-term preabsorptive satiety\nsigns released by the gastrointestinal tract.\nTo our knowledge, the effect of long-term exercise on the\nplasma levels of gastrointestinal hormones involved in appe-\ntite control, as well as on neuropeptide Y and a-melanocyte-\nstimulating hormone, the two main neurotransmitters within\nthe hypothalamus involved in the regulation of feeding beha-\nviour42,43, remain unknown, with the exception of a single\nreport showing no effect of chronic exercise in fasting chole-\ncystokinin levels in active men44. Although some of these pep-\ntides may remain elevated for 3–5 h after a meal, such as\ncholecystokinin, most start to fall after the first 2–3 h41.\nChanges in the plasma levels of these gut peptides could there-\nfore explain the trend towards the improvement in acute com-\npensation at the buffet meal, presented 60 min after preload\nconsumption but are unlikely to account for the significant\nimprovement in energy compensation over 24 h.\nThe improvement in short-term appetite regulation with the\nexercise intervention does not seem to have been driven by an\nimprovement in the sensitivity to hunger or satiety signals;\nalthough fullness scores were significantly different between\npreloads before the exercise intervention, that difference dis-\nappeared or became smaller afterwards.\nAlthough compliance with the exercise intervention was very\ngood, measurement of compliance is probably the major limi-\ntation of this study, since it is based on self-reporting. However,\nthe magnitude of the improvement in estimated maximal oxygen\nuptake observed with our 6-week exercise programme (10 %) is\nin line with previous studies in which similar exercise interven-\ntions were used45 – 47. We are aware that the increase in total\nenergy expenditure (EE) induced by exercise presupposes that\nnormal activity throughout the rest of the day remains\nunchanged or increases48, a question that remains controver-\nsial49,50. We were able to show that normal activity throughout\nthe day, as assessed by pedometers, remained unchanged over\ntime, strongly suggesting an increase in total EE with the exer-\ncise programme.\nThe 6-week exercise programme was not followed by changes\nin either body weight or body composition. Our failure to find\nany compensatory increase in habitual EI was, therefore, unex-\npected, given the increase in total EE. This highlights the limi-\ntations of estimating food intake from questionnaires and\nsuggests a degree of underreporting in this sample.\nTo the best of our knowledge, this is the first study showing\nthat increasing habitual physical activity levels in previously\nsedentary individuals has an impact on short-term appetite\nregulation, and that physical activity may not only increase\nEE, but also lead to a more sensitive eating behaviour in\nresponse to previous EI. These findings provide the foundation\nto future work in this area; they also have important impli-\ncations in terms of the steadily increasing prevalence of obes-\nity in the UK and the current failure to meet the Department of\nHealth physical activity recommendations26, which were very\nsimilar to those used in this research. Further studies are\nneeded to elucidate the optimal intensity and duration of\nexercise necessary and the mechanisms whereby exercise\nimproves short-term appetite control.\nAcknowledgements\nCatia Martins was supported by a PhD grant (SFRD\/BD\/\n16 294\/2004) from Fundac¸a˜o para a Cieˆncia e Tecnologia\n(Portugal) under the 3rd European Union community support\nprogramme\nReferences\n1. World Health Organization (2003) Global Strategy on Diet,\nPhysical Activity and Health – Obesity and Overweight.\nInternet Communication (http:\/\/www.who.int\/hpr\/NPH\/docs\/\ngs_obesity.pdf). Accessed April 2007.\n2. Varo JJ, Martinez-Gonzalez MA, De Irala-Estevez J, Kearney J,\nGibney M & Martinez JA (2003) Distribution and determinants\nof sedentary lifestyles in the European Union. Int J Epidemiol\n32, 138–146.\n3. King NA (1999) What processes are involved in the appetite\nresponse to moderate increases in exercise-induced energy\nexpenditure? Proc Nutr Soc 58, 107–113.\n4. Moore MS (2000) Interactions between physical activity and\ndiet in the regulation of body weight. Proc Nutr Soc 59,\n193–198.\n5. Murgatroyd PR, Goldberg GR, Leahy FE, Gilsenan MB &\nPrentice AM (1999) Effects of inactivity and diet composition\non human energy balance. Int J Obes 23, 1269–1275.\n6. Kissileff HR (1985) Effects of physical state (liquid–solid) of\nfoods on food intake: procedural and substantive contributions.\nAm J Clin Nutr 42, 956–965.\n7. Goldberg GR, Murgatroyd PR, McKenns APM, Heavey PM &\nPrentice AM (1998) Dietary compensation in response to covert\nimposition of negative energy balance by removal of fat or\ncarbohydrate. Br J Nutr 80, 141–147.\n8. Hill AJ, Leathwood PD & Blundell JE (1987) Some evidence for\nshort-term caloric compensation in normal weight human\nExercise and short-term appetite regulation 841\nB\nri\nti\nsh\nJo\nu\nrn\nal\no\nf\nN\nu\ntr\nit\nio\nn\nsubjects: the effects of high- and low-energy meals on hunger,\nfood preference and food intake. Hum Nutr Appl Nutr 41A,\n244–257.\n9. Rolls BJ, Kim-Harris S, Fischman MW, Foltin RW, Moran TH\n& Stoner SA (1994) Satiety after preloads with different\namounts of fat and carbohydrate: implications for obesity. Am\nJ Clin Nutr 60, 476–487.\n10. Hubert P, King NA & Blundell JE (1998) Uncoupling the\neffects of energy expenditure and energy intake: appetite\nresponse to short-term energy deficit induced by meal omission\nand physical activity. Appetite 31, 9–19.\n11. Imbeault P, Saint-Pierre S, Almeras N & Tremblay A (1997)\nAcute effects of exercise on energy intake and feeding beha-\nviour. Br J Nutr 77, 511–521.\n12. King NA, Snell L, Smith RD & Blundell JE (1996) Effects of\nshort-term exercise on appetite responses in unrestrained\nfemales. Eur J Clin Nutr 50, 663–667.\n13. Lluch A, King NA & Blundell JE (1998) Exercise in dietary\nrestrained women: no effect on energy intake but change in\nhedonic ratings. Eur J Clin Nutr 52, 300–307.\n14. King NA & Blundell JE (1995) High-fat foods overcome the\nenergy expenditure induced by high-intensity cycling or run-\nning. Eur J Clin Nutr 49, 114–123.\n15. King NA, Lluch A, Stubbs RJ & Blundell JE (1997) High dose\nexercise does not increase hunger or energy intake in free living\nmales. Eur J Clin Nutr 51, 478–483.\n16. Westerterp-Plantenga MS, Verwegen CR, Ijedema MJ,\nWijckmans NE & Saris WH (1997) Acute effects of exercise\nor sauna on appetite in obese and nonobese men. Physiol\nBehav 62, 1345–1354.\n17. Blundell JE & King NA (1999) Physical activity and regulation\nof food intake: current evidence. Med Sci Sports Exerc 31, 11\nSuppl., 573–583.\n18. Thompson DA, Wolfe LA & Eikelboom R (1988) Acute effects\nof exercise intensity on appetite in young men. Med Sci Sports\nExerc 20, 222–227.\n19. King NA, Tremblay A & Blundell JE (1997) Effects of exercise\non appetite control: implications for energy balance. Med Sci\nSports Exerc 29, 1076–1089.\n20. King NA, Appleton K, Rogers PJ & Blundell JE (1999) Effects\nof sweetness and energy in drinks on food intake following\nexercise. Physiol Behav 66, 375–379.\n21. Long SJ, Hart K & Morgan LM (2002) The ability of habitual\nexercise to influence appetite and food intake in response to\nhigh- and low-energy preloads in man. Br J Nutr 87, 517–523.\n22. American College of Sports Medicine (2000) ACSM’s Guide-\nlines for Exercise Testing and Prescription, 6th ed. Baltimore:\nLippincott Williams & Wilkins.\n23. van Strien T, Frijters JER, Bergers GPA & Defares PB (1986)\nThe Dutch Eating Behavior Questionnaire (DEBQ) for assess-\nment of restrained, emotional, and external eating behavior.\nInt J Eat Disord 5, 259–315.\n24. American College of Sports and Medicine (1998) The rec-\nommended quantity and quality of exercise for developing\nand maintaining cardiorespiratory and muscular fitness, and\nflexibility in healthy adults. Position Stand. Med Sci Sports\nExerc 30, 975–991.\n25. World Health Organization (2002) Physical Activity: How\nMuch Is Needed? Internet Communication repeat addition to\nref.1 here.\n26. Department of Health (2004) At Least Five a Week – Evidence\nof the Impact of Physical Activity and its Relationship to Health.\nLondon: Department of Health.\n27. Rogers PJ (1993) The investigation of human eating behaviour.\nIn Human Psychopharmacology, Measures and Methods,\npp. 123–142 [I Hindmarch and PD Stonier, editors]. Chichester:\nJohn Wiley & Sons.\n28. Stubbs RJ, Johnstone AM, O’Reilly LM & Poppitt SD (1998)\nMethodological issues relating to the measurement of food,\nenergy and nutrient intake in human laboratory-based studies.\nProc Nutr Soc 57, 357–372.\n29. Matthews DR, Hosker JP, Rudenski AS, Naylor BA, Treacher\nDF & Turner RC (1985) Homeostasis model assessment: insulin\nresistance and beta-cell function from fasting plasma glucose\nand insulin concentrations in man. Diabetologia 28, 412–419.\n30. Johnson SL & Birch LL (1994) Parents’ and children’s adi-\nposity and eating style. Peptides 84, 653–661.\n31. Pomerleau M, Imbeault P, Parker T & Doucet E (2004) Effects of\nexercise intensity on food intake and appetite in women. Am J Clin\nNutr 80, 1230–1236.\n32. Cecil JE, Palmer CNA, Wrieden W, et al. (2005) Energy intakes\nof children after preloads: adjustment, not compensation. Am J\nClin Nutr 82, 302–308.\n33. Almeras N, Lavallee N, Despres JP, Bouchard C & Tremblay A\n(1995) Exercise and energy intake: effect of substrate oxidation.\nPhysiol Behav 57, 995–1000.\n34. Spiegel TA, Shrager EE & Stellar E (1989) Responses of lean\nand obese subjects to preloads, deprivation, and palatability.\nAppetite 13, 45–69.\n35. Ruderman AJ (1986) Dietary restraint: a theoretical and empiri-\ncal review. Psychol Bull 99, 247–262.\n36. Blundell JE, Stubbs RJ, Hughes DA, Whybrow S & KingNA (2003)\nCross talk between physical activity and appetite control: does\nphysical activity stimulate appetite? Proc Nutr Soc62, 651–661.\n37. Tremblay A & Drapeau V (1999) Physical activity and prefer-\nence for selected macronutrients. Med Sci Sports Exerc 31, 11\nSuppl., 584–589.\n38. Westerterp KR, Meijer GAL, Janssen EME, Saris WHM &\nHoor FT (1992) Long-term effect of physical activity on\nenergy balance and body composition. Br J Nutr 68, 21–30.\n39. Donnelly JE, Kirk EP, Jacobsen DJ, Hill JO, Sullivan DK & John-\nson SL (2003) Effects of 16 mo of verified, supervised aerobic\nexercise on macronutrient intake in overweight men and\nwomen: the Midwest Exercise Trial. Am J Clin Nutr 78, 950–956.\n40. Blundell JE (1991) The biology of appetite. Clin Appl Nutr1, 21–31.\n41. de Graaf C, Blom WA, Smeets PA, Stafleu A & Hendriks HF (2004)\nBiomarkers of satiation and satiety. Am J Clin Nutr 79, 946–961.\n42. Murphy KG & Bloom SR (2004) Gut hormones in the control of\nappetite. Exp Physiol 89, 507–516.\n43. Batterham RL & Bloom SR (2003) The gut hormone peptide\nYY regulates appetite. Ann N Y Acad Sci 994, 162–168.\n44. Bailey DM, Davies B, Castell LM, Newsholme EA & Calam J\n(2001) Physical activity and normobaric hypoxia: independent\nmodulators of peripheral cholecystokinin metabolism in man.\nJ Appl Physiol 90, 105–113.\n45. Nishida Y, Higaki Y, Tokuyama K, et al. (2001) Effect of mild\nexercise training on glucose effectiveness in healthy men. Dia-\nbetes Care 24, 1008–1013.\n46. Mayer-Davis EJ, D’Agostino R, Karter AJ, et al. (1998) Inten-\nsity and amount of physical activity in relation to insulin sensi-\ntivity. JAMA 279, 669–674.\n47. Asikainen TM, Miilunpalo S, Oja P, et al. (2002) Randomised,\ncontrolled walking trials in postmenopausal women: the minimum\ndose to improve aerobic fitness? Br J Sports Med 36, 189–294.\n48. Wilmore JH (1996) Increasing physical activity: alterations in body\nmass and composition. Am J Clin Nutr 63, Suppl., 456S–460S.\n49. Meijer GAL, Jansen GME, Westerterp KR, Verhoeven F, Saris\nWHM & ten Hoor F (1991) The effect of a 5-month endurance-\ntraining programme on physical activity: evidence for a sex-\ndifference in the metabolic response to exercise. Eur J Appl\nPhysiol Occup Physiol 62, 11–17.\n50. Goran ML & Poehlman ET (1992) Endurance training does not\nenhance total energy expenditure in healthy elderly persons.\nAm J Physiol 263, E950–E957.\nC. Martins et al.842\nB\nri\nti\nsh\nJo\nu\nrn\nal\no\nf\nN\nu\ntr\nit\nio\nn\n"}