{"doi":"10.1007\/s10040-010-0644-7","coreId":"53491","oai":"oai:nora.nerc.ac.uk:13096","identifiers":["oai:nora.nerc.ac.uk:13096","10.1007\/s10040-010-0644-7"],"title":"Determining groundwater degradation from irrigation in desert-marginal Northern China","authors":["O Dochartaigh, Brighid E.","MacDonald, Alan M.","Darling, William G.","Hughes, Andrew G.","Li, Jin X.","Shi, Li A."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"Groundwater degradation from irrigated agriculture is of concern in semi-arid northern China. Data-scarcity often means the causes and extent of problems are not fully understood. An irrigated area in Inner Mongolia was studied, where abstraction from an unconfined Quaternary aquifer has increased threefold over 20 years to 20 million m3\/year; groundwater levels are falling at up to 0.5 m\/year; and groundwater is increasingly mineralised (TDS increase from 400 to 700–1,900 mg\/L), with nitrate concentrations up to 137 mg\/L N. Residence-time (chlorofluorocarbons), stable-isotope and hydrogeochemical indicators helped develop a conceptual model of groundwater system evolution, demonstrating a direct relationship between modern water proportion and the degree of groundwater mineralisation, indicating that irrigation-water recycling is reducing groundwater quality. The investigations suggest that before irrigation development, active recharge to the aquifer from wadis significantly exceeded groundwater inflow from nearby mountains, previously held to be the main groundwater input. Away from active wadis, groundwater is older with a probable pre-Holocene component. Proof-of-concept groundwater modelling supports geochemical evidence, indicating the importance of wadi recharge and irrigation return flows. Engineering works protecting the irrigated area from flooding have reduced good quality recharge; active recharge is now dominated by irrigation returns, which are degrading the aquifer. \\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/53491.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/13096\/1\/Groundwater_NorthernChina_ODochartaighetal_NORA.pdf","pdfHashValue":"2cbf32e3048c186db1436cdd2add8a093cac80d4","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:13096<\/identifier><datestamp>\n      2012-11-22T12:20:23Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/13096\/<\/dc:relation><dc:title>\n        Determining groundwater degradation from irrigation in desert-marginal Northern China<\/dc:title><dc:creator>\n        O Dochartaigh, Brighid E.<\/dc:creator><dc:creator>\n        MacDonald, Alan M.<\/dc:creator><dc:creator>\n        Darling, William G.<\/dc:creator><dc:creator>\n        Hughes, Andrew G.<\/dc:creator><dc:creator>\n        Li, Jin X.<\/dc:creator><dc:creator>\n        Shi, Li A.<\/dc:creator><dc:description>\n        Groundwater degradation from irrigated agriculture is of concern in semi-arid northern China. Data-scarcity often means the causes and extent of problems are not fully understood. An irrigated area in Inner Mongolia was studied, where abstraction from an unconfined Quaternary aquifer has increased threefold over 20 years to 20 million m3\/year; groundwater levels are falling at up to 0.5 m\/year; and groundwater is increasingly mineralised (TDS increase from 400 to 700–1,900 mg\/L), with nitrate concentrations up to 137 mg\/L N. Residence-time (chlorofluorocarbons), stable-isotope and hydrogeochemical indicators helped develop a conceptual model of groundwater system evolution, demonstrating a direct relationship between modern water proportion and the degree of groundwater mineralisation, indicating that irrigation-water recycling is reducing groundwater quality. The investigations suggest that before irrigation development, active recharge to the aquifer from wadis significantly exceeded groundwater inflow from nearby mountains, previously held to be the main groundwater input. Away from active wadis, groundwater is older with a probable pre-Holocene component. Proof-of-concept groundwater modelling supports geochemical evidence, indicating the importance of wadi recharge and irrigation return flows. Engineering works protecting the irrigated area from flooding have reduced good quality recharge; active recharge is now dominated by irrigation returns, which are degrading the aquifer. \\ud\n<\/dc:description><dc:publisher>\n        Springer<\/dc:publisher><dc:date>\n        2010<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/13096\/1\/Groundwater_NorthernChina_ODochartaighetal_NORA.pdf<\/dc:identifier><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/13096\/2\/Groundwater-NorthernChina-%C3%93Dochartaighetal-ESM_NORA.pdf<\/dc:identifier><dc:identifier>\n         \n\n  O Dochartaigh, Brighid E.; MacDonald, Alan M.; Darling, William G.; Hughes, Andrew G.; Li, Jin X.; Shi, Li A..  2010  Determining groundwater degradation from irrigation in desert-marginal Northern China.   Hydrogeology Journal, 18 (8). 1939-1952.  https:\/\/doi.org\/10.1007\/s10040-010-0644-7 <https:\/\/doi.org\/10.1007\/s10040-010-0644-7>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.springerlink.com\/content\/1431-2174\/18\/8\/<\/dc:relation><dc:relation>\n        10.1007\/s10040-010-0644-7<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/13096\/","http:\/\/www.springerlink.com\/content\/1431-2174\/18\/8\/","10.1007\/s10040-010-0644-7"],"year":2010,"topics":[],"subject":["Publication - Article","PeerReviewed"],"fullText":" 1\nDetermining groundwater degradation from irrigation in desert-marginal 1 \nnorthern China 2 \nBrighid E. Ó Dochartaigh1a, Alan M. MacDonald1, William G. Darling2, Andrew G. Hughes3, Jin X. 3 \nLi4 and Li A. Shi5 4 \n1 British Geological Survey, Murchison House, West Mains Road, Edinburgh EH9 3LA, United Kingdom 5 \n2 British Geological Survey, Maclean Building, Crowmarsh Gifford, Wallingford, Oxon OX10 8BB, United 6 \nKingdom 7 \n3 British Geological Survey, Kingsley Dunham Centre, Keyworth, Nottingham NG12 5GG, United Kingdom 8 \n4 Division of Hydrology and Water-Land Resources, Cold and Arid Regions Environmental and Engineering 9 \nResearch Institute, CAS, 260 Donggang West Rd., Lanzhou, 730000, Gansu, China 10 \n5 Alxa League AusAID Project Management Office, Bayanhot, 750306, Inner Mongolia, China 11 \na Corresponding author: beod@bgs.ac.uk ; Telephone +44 (0)131 650 0424; Fax +44 (0)131 650 0252 12 \n 13 \nAbstract 14 \nGroundwater degradation from irrigated agriculture is of concern in semi-arid northern China. Data-scarcity 15 \noften means the causes and extent of problems aren't fully understood. This study investigated an irrigated area 16 \nin Inner Mongolia where abstraction from an unconfined Quaternary aquifer has increased threefold over 20 17 \nyears to 20 Mcm\/yr; groundwater levels are falling at up to 0.5 m\/yr; and groundwater is increasingly 18 \nmineralised (TDS increase from 400 mg\/L to 700–1900 mg\/L), with nitrate concentrations up to 137 mg\/L-N.  19 \nResidence-time (chlorofluorocarbon\/CFC), stable-isotope and hydrogeochemical indicators helped develop a 20 \nconceptual model of groundwater system evolution, demonstrating a direct relationship between modern water 21 \nproportion and the degree of groundwater mineralisation, indicating that irrigation water recycling is reducing 22 \ngroundwater quality. The investigations suggest that before irrigation development, active recharge to the 23 \naquifer from wadis significantly exceeded groundwater inflow from nearby mountains, previously held to be the 24 \nmain groundwater input.  Away from active wadis, groundwater is older with a probable pre-Holocene 25 \ncomponent. Proof-of-concept groundwater modelling supports geochemical evidence, indicating the importance 26 \nof wadi recharge and irrigation return flows.  Engineering works protecting the irrigated area from flooding have 27 \nreduced good quality recharge; active recharge is now dominated by irrigation returns, which are degrading the 28 \naquifer.  29 \n 2\nIntroduction 30 \nGroundwater is the primary source of water in most of arid northern China, with the largest use being 31 \nfor irrigation (Kendy et al. 2003).  Low rainfall and high evapotranspiration mean surface water 32 \nresources are scarce. Groundwater is subject to increasing abstraction pressure as a result of rapid 33 \npopulation and economic growth (e.g. Foster et al. 2004, Ji et al. 2006).   34 \n 35 \nThe detrimental impacts of irrigated agriculture on groundwater resources in northern China are 36 \nwidely recognised (Foster et al 2004, Ma et al 2005, Ji et al 2006). Intensive abstraction has caused 37 \nwidespread water table decline, such as in parts of the North China Basin, where Kendy et al. (2003) 38 \nreport that groundwater levels are falling by more than 1.0 m\/yr. Severe groundwater quality 39 \ndegradation has also occurred beneath many irrigated areas, linked to the recycling of salts from 40 \nirrigation water, and particularly to nitrate from intensive fertiliser use (e.g. Chen et al. 2005, Ji et al. 41 \n2006). As water tables fall, groundwater abstraction becomes more difficult and expensive, and 42 \neventually wells may dry up. As its quality deteriorates, groundwater may become unsuitable for 43 \nhigher quality uses.   44 \n 45 \nThis paper investigates the causes and impacts of groundwater degradation in a Quaternary aquifer in 46 \nan irrigated area, Chahaertan, in Inner Mongolia in northern China. Few groundwater data are 47 \navailable for this region, and to address this, a range of hydrogeological techniques was applied to 48 \ninvestigate and interpret the local groundwater system and how it has developed historically in 49 \nresponse to the expansion of abstraction for irrigation. This approach, particularly related to 50 \ngroundwater residence times and the historical development of groundwater systems, complements 51 \nthe recently growing body of hydrogeological work in China by advancing the focus on managing 52 \ngroundwater resources and irrigated agriculture. 53 \n 54 \nThe Chahaertan irrigated area lies between longitude 105° 37’ to 105° 45’ E and latitude 39° 14’ to 55 \n39° 29’ N, at an elevation of between 1100 and 1200 m above sea level (asl) (Figure 1). This region, 56 \n 3\nnear the eastern edge of the Tengere desert, is semi-arid and characterised by low, irregular rainfall 57 \nand high temperatures and evapotranspiration (Ma et al. 2005). Land use is dominated by scrub 58 \ngrassland, much of it degraded, and sandy desert, with some limited forest cover. Areas under 59 \nirrigation, such as Chahaertan, account for a small proportion of the total land area, but are significant 60 \nin terms of human and economic activity. At Chahaertan, more than 150 wells support intensive 61 \nseasonal groundwater abstraction to irrigate commercial crops: dominantly maize, sunflowers and 62 \nwatermelon, with increasing amounts of cotton. Almost all groundwater abstraction is for irrigation 63 \nand occurs between April and August. Away from the irrigated area there are only a handful of wells 64 \nacross the rest of the Quaternary aquifer, which abstract at low rates for domestic and small-scale 65 \nlivestock use.  66 \n 67 \nBy the mid 2000s it was suspected that intensive abstraction at Chahaertan was having a detrimental 68 \neffect on the groundwater resource. However, because no monitoring or investigations had been 69 \ncarried out since the mid 1990s (Yuan and Wu 1996), a lack of hydrogeological data and 70 \nunderstanding precluded the establishment of an effective management strategy. The common theory 71 \nat this time held that the major groundwater input to the local Chahaertan system was slow lateral 72 \nflow through the aquifer from its southern boundary, where focussed recharge occurred from surface 73 \nwater flowing from the Helan Mountains (Figures 1 and 2) (Yuan and Wu 1996). However, this did 74 \nnot explain many of the observed system features.  75 \n 76 \nNew groundwater investigations 77 \n 78 \nIn 2006 an investigation was carried out at Chahaertan to collate existing and collect new essential 79 \ninformation and improve understanding of the groundwater system and the state of the groundwater 80 \nresource, and to provide the basis for effective resource management. To deal with the lack of 81 \nhistorical hydrogeological and hydrological data, a set of complementary hydrogeological and 82 \n 4\nhydrogeochemical techniques, including detailed groundwater residence time analysis using CFCs, 83 \nwas used to establish a comprehensive picture of the groundwater system. 84 \n 85 \nMore than 150 abstraction wells in Chahaertan were accurately located using GPS, and a 86 \nquestionnaire used to collect information from well owners to help document historical groundwater 87 \ndevelopment and estimate current groundwater abstraction.  88 \n 89 \nHistorical groundwater level measurements were located for six monitoring wells in the main irrigated 90 \narea for the period 1984–94, and new measurements made in these wells in September 2006. All are 91 \nclose to abstraction wells and affected by pumping. Additional water level measurements were made 92 \nin abstraction wells across the irrigated area. Outside this area there are limited historical data for the 93 \nQuaternary aquifer, but what were available were collated from hydrogeological maps and reports, 94 \nand where possible new measurements were also made in available (usually pumping) wells.  95 \n 96 \nMeteorological data were obtained from government meteorological records and research stations, 97 \npublished reports, and previous studies (e.g. Yuan and Wu 1996, People’s Liberation Army 1976 and 98 \n1980). Additional information on aquifer geology, geometry and hydraulic properties, and well yields 99 \nwas collated from records, reports and maps from a variety of sources (e.g. People’s Liberation Army 100 \n1976, 1980; Left Banner Water Management and Water Resource Office 1992; Yuan and Wu 1996).  101 \n 102 \nTwenty two groundwater samples were collected from the Quaternary aquifer: 19 from the irrigated 103 \narea (including two from a separate zone to the north of the main irrigated area, called Little 104 \nChahaertan), and three from the surrounding un-irrigated aquifer (Figure 3). All except one of the 105 \nsamples were collected from pumped abstraction wells, the remaining one being collected from a 106 \nflowing artesian well. Technical details of sample collection are given in Ó Dochartaigh and 107 \nMacDonald (2006).   Proof of concept numerical modelling was used to test the results of the 108 \nhydrodynamic and hydrogeochemical (including residence time) analysis and the conceptual 109 \nunderstanding of the groundwater system. 110 \n 5\n 111 \nThe hydrogeology of Chahaertan and the development of irrigation and the 112 \ngroundwater system 113 \n 114 \nIrrigation wells at Chahaertan abstract from an unconfined Quaternary alluvial aquifer infilling a 115 \nfaulted basin in Cretaceous and Tertiary rocks. The southern edge of the aquifer basin is faulted 116 \nagainst the Helan Mountains, ~30 km southeast of Chahaertan; the northern boundary of the 117 \ngroundwater catchment is at Jilantai lake, ~35 km north of Chahaertan, which is the main discharge 118 \npoint for surface water and groundwater in the catchment (Figure 1). The total groundwater catchment 119 \narea is ~1500 km2. Aquifer thickness varies from less than 30 m at its southern edge to more than 200 120 \nm around Chahaertan (Figure 2), and possibly deeper at Jilantai. Surface elevation ranges from over 121 \n3000 m asl at the top of the Helan Mountains to 1000 m asl at Jilantai. Near to Jilantai the aquifer 122 \nbecomes confined in some areas. The exact extent of artesian conditions is unknown, but the 123 \napproximate extent has been estimated (Figure 1) by the presence of vegetation and salt encrustation 124 \nin unirrigated areas visible on satellite imagery.  125 \n 126 \nBasin infill is dominated by fluvial sediment eroded from the Helan Mountains and transported 127 \nnorthwestwards by high-energy ephemeral rivers (wadis) (Figure 2). Previous studies showed that 128 \naquifer hydraulic properties are strongly influenced by sediment grain size variation, with generally 129 \ncoarser-grained deposits proximal to the Helan Mountains showing a transmissivity range of 600 to 130 \n1200 m2\/d, and finer-grained distal deposits around Chahaertan a range of 200 to 510 m2\/d 131 \n(Groundwater Development and Utilisation Teaching and Research Office 1984, Yuan and Wu, 132 \n1996). There are no available data on aquifer mineralogy.  133 \n 134 \nOutside the irrigated area there is little soil development, and the region is dominated by sand with 135 \nthin scrub vegetation. Prior to irrigation development, however, seasonal overbank flooding at 136 \nChahaertan at the confluence of wadis draining the Helan Mountains led to significant soil 137 \n 6\ndevelopment (Groundwater Development and Utilisation Teaching and Research Office 1984, Jerie 138 \n2006).  139 \n 140 \nLong-term average (LTA) rainfall at Chahaertan is some 200 mm\/yr; over the Helan Mountains to the 141 \nsouth it is 400 mm\/yr, falling to 100 mm\/yr at Jilantai to the north. Most precipitation falls between 142 \nJune and September as short-lived intensive events.  Mean annual potential evaporation ranges from 143 \n1400 mm in the mountains to 3000 mm at Jilantai, and is highest between May and August. The 144 \ntemperature at Chahaertan exceeds 30°C in summer but is typically below 0°C in winter, with an 145 \nannual mean of ~15°C (e.g. Yuan and Wu 1996, People’s Liberation Army 1976 and 1980).  146 \n 147 \nThere is no permanent surface water drainage. Wadis drain runoff from the Helan Mountains 148 \nnorthwest towards Jilantai, four of which converge to the south of Chahaertan, from where a single 149 \nchannel flows north to Jilantai. No river flow monitoring is carried out in the region, but there is 150 \nanecdotal evidence for channel flows at Chahaertan and Jilantai. Based on this and on the size of the 151 \nriver channel, gradient and depth (Table I), the river flow rate during these events is estimated at 152 \nbetween 20 and 30 m3\/sec. 153 \n 154 \nOverall groundwater flow direction in the Quaternary is from the south and southeast to the north. 155 \nNatural groundwater discharge is to the lake at Jilantai and to springs and seepages in this area, seen 156 \nin the distribution of artesian conditions (Figure 1). At Chahaertan, groundwater flows are likely to be 157 \ninfluenced by local indirect recharge and by intensive groundwater abstraction. 158 \n 159 \nSince initial development in the late 1960s, the number of abstraction wells, volume of groundwater 160 \nabstraction, and irrigated area at Chahaertan have increased markedly (Figure 4) (data from 161 \nGroundwater Development and Utilisation Teaching and Research Office 1984, Left Banner Water 162 \nManagement and Water Resource Office 1992). Since 1990, most new wells have been drilled in 163 \nLittle Chahaertan, just north of the main irrigated area (Figure 4).  164 \n 165 \n 7\nIn 2006 groundwater levels ranged from 45 m below ground level (mbgl) at the northern edge of the 166 \nmain irrigated area to more than 75 mbgl some 8.5 km away in the south, this slope being largely 167 \ncontrolled by topography. The only available historical monitoring data show that groundwater levels 168 \nin this area fell by an average of 0.5 m\/yr between 1984 and 1995, a decline that apparently continued 169 \nuntil 2006, albeit at a slightly slower rate (Figure 4). This is likely to be linked to the slow-down in 170 \nthe rate of increase of abstraction in this area after the shift in focus for groundwater development to 171 \nLittle Chahaertan (where there has been no groundwater level monitoring) after 1990.  172 \n 173 \nRegular groundwater quality monitoring has never been undertaken at Chahaertan, but the limited 174 \navailable data indicate that pre-development groundwater chemistry is likely to have been similar to 175 \ngroundwater today in the surrounding non-irrigated area: moderately mineralised, Ca-Mg dominated 176 \nwaters with slightly alkaline pH, and less than 5 mg\/L NO3-N. By 2006, TDS concentrations in the 177 \nirrigated area were between 700 and 1900 mg\/L, and nitrate concentrations reached up to 137 mg\/L as 178 \nN. Nitrogen isotope analysis has shown that the bulk of this nitrate derives from fertiliser (Jerie 2006). 179 \n 180 \nIrrigation development at Chahaertan was heavily dependent on its position at the confluence of four 181 \nwadis and consequent local seasonal overbank flooding and soil development (Groundwater 182 \nDevelopment and Utilisation Teaching and Research Office 1984). Since development, however, the 183 \nwadi channels have been engineered, including major re-routing of the original confluent channel 184 \nfrom the centre to the western edge of the irrigated area, which has largely prevented flooding, and 185 \nconsequent crop and livelihood damage, in the now intensively farmed area.  186 \n 187 \nGroundwater chemistry  188 \n 189 \nAn understanding of groundwater chemistry has been critical in revealing changing recharge 190 \nprocesses at Chahaertan. Groundwater chemistry has been interpreted from the 22 samples collected 191 \nfrom abstraction wells in the irrigated area and surrounding region. The average length of the 192 \n 8\nscreened section of the production wells from which samples were collected is 45 m (Left Banner 193 \nWater Management and Water Resource Office 1992). The locations and field measurements of 194 \nchemistry samples are given in Table ESM1, and locations are shown in Figure 3.  Major and minor 195 \ninorganic species are reported in Table ESM2.  Stable isotope and CFC analyses are provided in Table 196 \nESM3.  197 \n 198 \nPre-development groundwater chemistry 199 \nThe nature of an intensively irrigated area means that little groundwater is likely to be fully 200 \nrepresentative of pre-development water quality, and therefore of natural processes operating along 201 \nthe groundwater flowline. No pre-development chemistry data for the aquifer are available, but seven 202 \nof the new groundwater samples are likely to represent quasi-natural conditions. Three of`these (Sites 203 \n20, 21 and 22) are away from any irrigation and outside the local Chahaertan groundwater system; 204 \nfour (Sites 4 and 16 in Chahaertan, and 18 and 19 in Little Chahaertan) are within the irrigated area 205 \n(Figure 3). Site 22, away from any irrigation and unlikely to be influenced by agricultural or other 206 \ncontamination, has a NO3-N concentration of 5.6 mg\/L and a TDS of ~450 mg\/L. This is likely to be 207 \nindicative of pre-development chemistry: arid area groundwaters frequently have detectable NO3-N 208 \noriginating from sources such as atmospheric deposition, bacteria in soil crusts, and termite mounds 209 \n(Gates et al. 2008). All four probable quasi-natural groundwater samples within the irrigated area 210 \nshow similar NO3-N concentrations of <5 mg\/L.  211 \nThese pre-development groundwaters are Ca-Mg dominated and moderately mineralised, with an 212 \naverage TDS of 395 mg\/L, well oxygenated, with a slightly alkaline pH, and noticeably lower 213 \nconcentrations of all major ions (except HCO3), than the other Chahaertan waters (Tables ESM1, 214 \nESM2). They are comparable to a similar Quaternary alluvial aquifer in the semi-arid Datong Basin in 215 \nnorthwest China, where groundwaters unaffected by agriculture or industry had an average TDS of < 216 \n300 mg\/l and NO3-N concentration of 7.3 mg\/l (Guo and Wang 2004).  217 \n 218 \n 9\nThe sampled wells consistently show evolution in key species in the downstream flow direction from 219 \nChahaertan to Jilantai (Figure 5). The increase in Na as Ca decreases is typical of ion exchange, but 220 \nthe greater magnitude of Na enrichment compared to the Ca decline (Figure 6a) suggests an additional 221 \nsource of Na. Evidence from Br\/Cl ratios (Figure 6b) indicates this could be halite dissolution, but in 222 \nthe absence of any mineralogical data for the aquifer this cannot be confirmed. From Site 19 223 \nnorthwards, Cl and SO4 concentrations increase at the expense of HCO3.  The increase in Cl is 224 \nconsistent with halite dissolution.  The SIgypsum values are two orders of magnitude below saturation 225 \n(Table ESM2), indicating gypsum dissolution as the cause of the increase in SO4. The excess Ca 226 \ninitially produced may have been taken up by ion exchange and\/or precipitation of calcite due to 227 \nsolubility considerations.   228 \n 229 \nIrrigation-related changes to groundwater chemistry  230 \nSites 1–17 are all within the main irrigated area and all show evidence of irrigation-related changes in 231 \ngroundwater chemistry (excluding Sites 4 and 16 discussed above). The groundwaters are well-232 \noxygenated, with pH values in the range 7.4–8.0, and are significantly more mineralised than the pre-233 \ndevelopment group, with an average TDS of 1156 mg\/L, and generally at least double the 234 \nconcentrations of major ions (Table ESM2). The average NO3-N concentration is 27.9 mg\/L, more 235 \nthan seven times that of the average in the pre-development group. This compares with evidence from 236 \nsimilar irrigated aquifers in northwest China, where TDS is >800 mg\/L and NO3-N >23 mg\/L (Guo 237 \nand Wang 2004). 238 \n 239 \nMulti-plots versus Cl of the main ions (Figure 7) show generally good correlations, positive for Ca, 240 \nNa and SO4, and negative for HCO3, with Site 4 (quasi-natural water) having the least-modified 241 \ncomposition.  The linear increases can be attributed to the effects of groundwater mixing with 242 \nevaporated irrigation return water.  The decrease in HCO3 is consistent with the loss of CO2 during 243 \nrecycling, and therefore a tendency towards calcite precipitation, supported by the positive correlation 244 \n(r2 = 0.44) between SIcalcite and pH (Table ESM2).  Nitrate has the poorest correlation with Cl, which 245 \nis probably a consequence of biotic effects.   246 \n 10\n 247 \nGroundwater residence time 248 \n 249 \nPre-development groundwater residence times 250 \nCFC analyses are only available for two pre-development samples: Sites 4 and 19 (Table ESM3). 251 \nCFC-11 and CFC-12 are both below detection at Site 19 in Little Chahaertan, indicating no evidence 252 \nof modern water.  This is likely to reflect the smaller influence of focussed recharge from pre-253 \ndevelopment overbank flooding north of the main Chahaertan area (Figure 1). Site 4 shows evidence 254 \nof modern water, indicating active modern recharge, which is likely to derive largely from pre-255 \ndevelopment flooding and leakage through wadi beds. Recharge modelling to confirm this hypothesis 256 \nis discussed in a subsequent section. 257 \n 258 \nStable isotopes in groundwaters from Chahaertan are too depleted to represent local groundwater 259 \nrecharge from modern rainfall at this altitude.  The presence of CFCs and the fact that stable isotopes 260 \nat Site 4 are less depleted than in the likely pre-Holocene waters further north along the flow line 261 \n(Sites 18 and 20; Figure 8), imply that pre-development groundwater at Chahaertan is not particularly 262 \nold, and unlikely to be pre-Holocene. The isotopic composition of end-Pleistocene groundwater is 263 \nbased on a 2‰ depletion in δ18O, as found by Kreuzer et al. (2009) in the North China Plain (Figure 264 \n8). The most likely source of recharge is rainfall runoff from the Helan Mountains, where the higher 265 \naltitude creates cooler recharge conditions. The likely presence of pre-development modern water at 266 \nChahaertan implies the recharge route is local river infiltration, as the travel time for groundwater 267 \nflow to Chahaertan from recharge at the edge of the mountains is estimated at ~5kyr, based on 268 \nreported or estimated aquifer hydraulic properties and Darcy’s law (assuming a hydraulic gradient of 269 \n0.003 (Yuan and Wu 1996) and a hydraulic conductivity of 5 m\/d).  270 \n 271 \nWhen interpreting the patterns in CFC-12 and δ18O in downgradient samples (Figure 9) in terms of an 272 \nevolutionary sequence, key evidence is the below detection CFC-12 at Site 20, some 30 km north of 273 \n 11\nChahaertan, and the presence of well oxygenated water, which argues against any microbial 274 \ndegradation (e.g. Busenberg and Plummer 1992). It is therefore assumed that groundwater at Site 20 275 \nis more than 50 years old, which suggests that the main recharge area is at Chahaertan, with no 276 \nmodern recharge downgradient of Chahaertan. This is supported by δ18O values, which show a steady 277 \ndeclinebetween Sites 4 and 20, of the order of 2 ‰, indicating that the flowline is long enough to 278 \nretain some Pleistocene (>10 kyr) water in the system. By comparison, in the North China Plain 279 \nsimilar depletions in δ18O were observed for late Pleistocene palaeowaters (Chen et al. 2003).  280 \n 281 \nHowever, the data for Site 21 at Jilantai indicate a proportion of modern water is present (Figure 9). 282 \nThis borehole is drilled beneath Jilantai lake, and groundwater abstracted from the borehole is 283 \ndischarged into the lake, which is likely to locally reverse the hydraulic gradient and cause some re-284 \ninfiltration of lake water into the aquifer.   285 \n 286 \nIrrigation-related changes to groundwater residence  287 \nCFC data indicate that most of the sampled groundwaters have a modern water component of 5–10%.  288 \nA plot of CFC-11 versus CFC-12 concentrations is superimposed with the expected ‘piston flow’ 289 \nconcentration curve relating to the year of recharge and the expected mixing line between modern and 290 \nolder CFC-free water (Figure 10). In practice, where the two lines are close together it is impossible to 291 \ndiscriminate between piston flow and mixing. Additionally, there is evidence for a small amount of 292 \nCFC-12 contamination in some samples, most notably Sites 1 and 4. The alternative explanation of 293 \nCFC-11 reduction is unlikely based on the observed positive dissolved oxygen concentrations. 294 \nModern recharge could be from two sources: wadi flow or irrigation return water (which would 295 \nacquire a modern CFC load while exposed to the atmosphere). The positive correlation between CFC-296 \n11 (presumed to be uncontaminated) and TDS (total dissolved solids) (Figure 11) suggests that 297 \nirrigation return water is the more likely source. Site 4 lies outwith this trend, indicating that it is not 298 \nimpacted by irrigation returns, and further supporting its quasi-natural status. 299 \n 300 \n 12\nStable isotopes from Chahaertan groundwaters are tightly grouped (the standard deviation on δ18O is 301 \n0.22 ‰), but the average is slightly beneath the Yinchuan meteoric line (Figure 8). This suggests there 302 \nhas been minor evaporative fractionation, consistent with the evidence of recycling demonstrated by 303 \nthe groundwater chemistry and CFCs.  The average composition, at around –11 ‰ δ18O and –80 ‰ 304 \nδ2H, is significantly depleted compared to the Yinchuan average (Figure 8).  Since Yinchuan is at an 305 \nelevation of 1100 m asl, similar to Chahaertan, this implies the source of recharge at Chahaertan lies 306 \nat a significantly higher altitude. The hydrodynamic factors of the system mean this source can only 307 \nbe the Helan Mountains, as for the pre-development water. This has subsequently been recycled as 308 \nirrigation water.   309 \n 310 \nTesting results using groundwater modelling  311 \n 312 \nProof of concept numerical modelling was used to test the results of the hydrodynamic and 313 \nhydrogeochemical (including residence time) analysis and the conceptual understanding of the 314 \ngroundwater system. The scarcity of hydrogeological data and, therefore, limited conceptual 315 \nunderstanding, means that numerical modelling can only support the development of the 316 \nunderstanding of the groundwater system. It cannot provide a detailed simulation of the system (for 317 \nexample, for use as a management tool for assessing the impact of individual production wells) 318 \nwithout significantly more information than is currently available.  319 \n 320 \nModel set up 321 \nModelling was undertaken using the ZOOM (Zoomable Object Oriented Model) suite of object-322 \noriented numerical groundwater models (Spink et al. 2003; Spink et al. 2006). This includes a 323 \ndistributed recharge model, ZOODRM (Zoomable Object Oriented Distributed Recharge Model) (e.g. 324 \nHughes et al. 2006, Hughes et al. 2008), which calculates spatial and temporal variations in 325 \ngroundwater recharge, incorporating a standard Penman-Grindley type soil moisture balance method, 326 \nthe modified FAO Penman-Monteith method (Allen et al. 1998), and procedures for recharge 327 \n 13\nestimation in arid countries (a “Wetting Threshold” method based on the work of Lange et al., 2003; 328 \nHughes et al., 2008) and irrigated regions, as well as surface runoff routing. The ZOOM suite also 329 \nincludes a groundwater flow model, ZOOMQ3D (Zoomable Object Oriented Model for Quasi-Three 330 \nDimensional Flow) (e.g. Jackson et al. 2005), which incorporates mesh refinement to aid the solution 331 \nof scale-related problems, and is based on object-oriented techniques.  332 \n 333 \nA detailed description of model development and input parameters is given in Ó Dochartaigh and 334 \nMacDonald (2006). A distributed recharge model was developed encompassing the Quaternary 335 \naquifer catchment and the surface water catchment on the northern side of the Helan Mountains that 336 \ndrains towards Jilantai, taking into account the discharge zone in the area around Jilantai (Figure 12). 337 \nThe model area is 43 km by 83 km (Figure 12) with a cell size of 1000 m.  Using data on daily 338 \nrainfall, potential evaporation, land-use and topography, the model simulates LTA recharge based on 339 \naverage climatic data for the periods 1955-1980 and 2003-2005. It uses a wetting threshold method 340 \nthat is appropriate to arid and semi-arid conditions (Lange et al. 2003, Hughes et al. 2008). Two zones 341 \nfor wetting threshold were chosen: the outcrop of Quaternary and Tertiary age rocks.  Indirect 342 \nrecharge was provided by including run-off processes to the wadis deriving the aspect direction from 343 \nthe DEM.  Further information on the recharge model boundary conditions, model parameters, input 344 \nand output and validation data is presented in Table ESM4.  345 \n 346 \nA steady state groundwater flow model was developed to encompass the Quaternary basin aquifer 347 \nwithin the Jilantai catchment area (Figure 12), simulating the groundwater system for a single year 348 \nunder 2006 conditions (Figure 13), and using calculated LTA recharge from the distributed recharge 349 \nmodel. The groundwater flow model is a single layer model with an identical size and mesh to the 350 \nrecharge model.  Inflows are rainfall recharge, indirect recharge from wadis and irrigation returns, 351 \nwhich are provided directly from the recharge model.  Outflows are from abstractions and 352 \ngroundwater discharge to the Jilantai Lake.  Transmissivity and storage coefficients are distributed 353 \nbased on information from the available literature (e.g. Groundwater Development and Utilisation 354 \nTeaching and Research Office, 1984).  Further information on the groundwater flow model boundary 355 \n 14\nconditions, model parameters, input and validation data is presented in Table ESM5. Subsequently, a 356 \ndynamic balance groundwater flow model was developed to investigate the time variant nature of the 357 \nsystem, representing a 30 year period from 1980 to 2010, and using monthly varying recharge from 358 \nthe recharge model (Table ESM5). A dynamic balance is achieved by inputting a repeated annual 359 \nseries of average monthly recharge. The repeated annual series is run through the model until the 360 \ngroundwater heads in each month are identical to those in the same month in the previous year 361 \n(Rushton and Wedderburn 1971).  362 \n 363 \nModel results 364 \nThe recharge model was refined so the simulated river flows fit closely the available estimates of 365 \nactual wadi flows across the aquifer. Little river water is lost as wadis flow over non-aquifer rocks, 366 \nbut losses through wadi floors occur across the Quaternary aquifer.  The rate of modelled wadi 367 \nrecharge depends on the volume and duration of wadi flows, and is highest along the southwest and 368 \nwestern edges of the main irrigated area (Figure 12). There is little wadi recharge north of Chahaertan, 369 \nwhere the river channel usually flows only once or twice a year, and at a lower rate.  Modelled 370 \nrecharge volumes are shown in Table II and indicate that wadi losses and irrigation returns provide 371 \nthe majority of recharge to the entire Quaternary aquifer, and dominate recharge in the vicinity of 372 \nChahaertan.  373 \n 374 \nThe steady state groundwater flow model, with input from the recharge model and available aquifer 375 \nparameters, represents the groundwater head distribution across the aquifer relatively closely (Figure 376 \n13). This improves confidence in our understanding of the Chahaertan groundwater system, 377 \nsupporting the limited available hydrogeological data and implying that the recharge and flow 378 \nprocesses inferred from hydrodynamic and hydrogeochemical (including residence time) analysis are 379 \nplausible. Although the lack of data, and in particular daily rainfall, means that fully a refined 380 \nhistorical simulation is not yet possible, a dynamic balance model reproduces the general pattern of 381 \nobserved annual groundwater level variations and the observed groundwater level fall over the period 382 \nof irrigation development, further improving confidence in our understanding of the groundwater 383 \n 15\nsystem (Ó Dochartaigh and MacDonald 2006). If the decline continues at the same rate, production 384 \nwells may start to show falling yields within 20 to 30 years, and the shallowest wells (100 m deep) 385 \nmay need to be abandoned within 40 years.  386 \n 387 \nDiscussion 388 \n 389 \nThe combined study of hydrodynamics, hydrochemistry (including residence times) and subsequent 390 \ntesting with a groundwater recharge and flow model has helped unravel the processes of groundwater 391 \ndegradation in the Chahaertan irrigated area.  Of particular importance is the change in recharge 392 \nprocesses during the development of the area.  393 \n 394 \nPredevelopment 395 \nBefore irrigation development at Chahaertan, surface and groundwater flowed largely uninterrupted 396 \nfrom the Helan Mountains to the Jilantai lake. The presence of CFC, isotopic signature, and lack of 397 \nincreased salinity in pre-development groundwater at Chahaertan indicate that active local wadi 398 \nrecharge occurred within the last 50 years, and before the onset of irrigation returns in the late 1970s. 399 \nModel results confirm that infiltration occurred along the wadi channels between the Helan Mountains 400 \nand Chahaertan, but was significantly enhanced at Chahaertan. This was caused by annual overbank 401 \nflooding, which helped develop the soils that support agriculture Chahaertan.  This study is the first to 402 \nemphasise the importance of local recharge at Chahaertan.  Previous theories held that most recharge 403 \nto the aquifer basin occurred at the edge of the Helen Mountains, with subsequent slow subsurface 404 \nflow to Chahaertan over thousands of years.  The new modelling and geochemical studies show that, 405 \nalthough this mechanism may be occurring, it is not the dominant influence on the groundwater 406 \nsystem.  407 \n 408 \nGroundwater modelling indicates that from Chahaertan northwards, subsurface flow dominates water 409 \nmovement to Jilantai. This is corroborated by residence time data, as groundwater further down the 410 \n 16\nflow line does not show detectable CFCs, and there is no evidence of active recharge for at least the 411 \npast 50 years. The depletion in δ2H and δ18O in groundwaters is likely to be the product of mixing 412 \nbetween a late-Pleistocene end-member, with a depleted isotopic composition indicating cooler 413 \nrecharge conditions, and younger Holocene water (up to 10 kyr) old that has an essentially modern 414 \nisotopic composition. This is similar to results from other parts of northern China (e.g. Chen et al 415 \n2003, Ma and Edmunds 2006), and is consistent with modelled groundwater travel times thousands of 416 \nyears through the aquifer to Jilantai. The one exception is at Jilantai lake itself, where mixing with re-417 \ninfiltrating lake water appears to have led to the presence of CFCs in groundwater.  418 \n 419 \nPre-development groundwater chemistry at Chahaertan is likely to have been similar to that of 420 \ngroundwater today in the surrounding non-irrigated area: moderately mineralised (TDS ~400 mg\/L), 421 \nCa-Mg dominated waters with slightly alkaline pH, and less than 5 mg\/L NO3-N. This is comparable 422 \nto studies elsewhere in semi-arid northwest China, where groundwaters unaffected by agriculture or 423 \nindustry have an average TDS of <300 mg\/l and NO3-N concentration of 7.3 mg\/l (Guo and Wang 424 \n2004). Further down the groundwater flow line towards Jilantai, groundwater has evolved to become 425 \nmore alkaline and reducing, with cation exchange and halite dissolution being the prominent 426 \nprocesses.  427 \n 428 \nPresent day 429 \nThe present day groundwater system in Chahaertan has evolved significantly since irrigation started, 430 \nand annual abstraction is now in the range 19–21 Mcm (Figure 14). There have been two major 431 \neffects on the groundwater system: declining water levels and a marked decrease in water quality.  432 \nThis degradation has been exacerbated by engineering works to prevent virtually all seasonal over-433 \nbank flooding, which has greatly reduced wadi recharge. Groundwater levels have fallen by up to 434 \n0.5 m\/yr for at least 20 years.  Examining this decline in greater spatial detail with a dynamic balance 435 \ngroundwater flow model, using a factored sequence of the available groundwater abstraction, 436 \nconfirms that water level decline in the main Chahaertan irrigated area has decreased slightly since the 437 \n1990s.  This has corresponded with the change of focus for groundwater development to Little 438 \n 17\nChahaertan.  However, if the decline continues at the same rate, production wells may start to show 439 \ndeclining yields within 20 to 30 years, and the shallowest wells (100 m deep) are likely to have to be 440 \nabandoned within 40 years.  441 \n 442 \nThe direct relationship between CFC concentrations and the degree of groundwater mineralisation 443 \n(represented by TDS, Figure 11) clearly demonstrates that recycling of irrigation water is causing 444 \ngroundwater degradation, with a marked increase in salinity (a TDS increase from 400 mg\/L up to 445 \n700-1900 mg\/L) and an increase in nitrate concentrations (as N) from <5 mg\/L up to 137 mg\/L.  The 446 \nfact that re-infiltration of irrigation water has almost overtaken river infiltration as the main source of 447 \nrecharge in some areas has radically changed the chemistry of the local groundwater system.   The 448 \nmajority of the wells within the irrigated area show elevated nitrate and salinity, as well as enrichment 449 \nin Ca, Cl, SO4 and Mg (Table ESM2, Figure 5).  The generally slow movement of groundwater 450 \nthrough the aquifer, which is supported by the modelling results, means there is a long lag time 451 \nbetween cause and effect. It is likely that poor quality water from irrigation returns, which is moving 452 \ndownwards through the thick unsaturated zone (between 45 and 75 m thick in 2006), will continue to 453 \ndegrade groundwater quality in the aquifer for tens of years as it reaches the water table.   454 \n 455 \nConclusions 456 \n 457 \nA combination of hydrodynamic and hydrogeochemical (including residence time) analysis and 458 \nnumerical groundwater modelling has provided a detailed insight into groundwater degradation in an 459 \nirrigated area in semi-arid northern China, and by inference in other similar irrigated areas. An 460 \nimproved conceptual model of the groundwater system has revealed its complex nature and the 461 \nmultifold impacts of human activity.  462 \n 463 \nPrevious theories held that the main groundwater input at Chahaertan was subsurface flow from the 464 \nsoutheastern boundary of the aquifer basin, recharged from runoff from the Helan Mountains. New 465 \n 18\nevidence from this study shows that the main groundwater input in pre-development times was 466 \nfocussed river recharge in and around the now-irrigated area. Flood-prevention engineering works 467 \nsince development began have significantly reduced this recharge. Returns from inefficient flood 468 \nirrigation have partially compensated (by volume) for the reduction in natural recharge, but 469 \nabstraction nonetheless exceeds recharge, and groundwater levels continue to fall by up to 0.5 m\/yr. 470 \nIrrigation returns now comprise the largest proportion of local recharge.  471 \n 472 \nThe close relationship between the degree of groundwater mineralisation and the proportion of 473 \nmodern water, shown by CFC concentrations, clearly demonstrates that recycling of irrigation water is 474 \ncausing groundwater degradation.  475 \n 476 \n 477 \nAcknowledgements   478 \nThis study was funded by the Australian Agency for International Development (AusAID), A$10 479 \nmillion, 2001-06, Alxa League Environmental Rehabilitation and Management Project (ALERMP). 480 \nThis paper is published with the permission of the Director, ALERMP and the Executive Director of 481 \nthe British Geological Survey (NERC). 482 \n483 \n 19\nReferences 484 \nAllen RG, Pereira LS, Raes D and Smith M., 1998. Crop evapotranspiration: guidelines for computing crop 485 \nwater requirements. FAO Irrigation and Drainage Paper no. 56, Rome, Italy. 486 \nBusenberg E and Plummer L. 1992. Use of Chlorofluorocarbons (CCl3F and CCl2F2) as Hydrologic Tracers and 487 \nAge-Dating Tools: The Alluvium and Terrace System of Central Oklahoma, Water Resources Research 488 \n28(9), 2257-2283.  489 \nChen Z, Qi J, Xu J, Xu J, Ye H and Nan Y. 2003. Paleoclimatic interpretation of the past 30 ka from isotopic 490 \nstudies of the deep confined aquifer of the North China plain. Applied Geochemistry 18, 997-1009 491 \nChen J, Tang C, Sakura Y, Yu J and Fukushima Y. 2005. Nitrate pollution from agriculture in different 492 \nhydrogeological zones of the regional groundwater flow system in the North China Plain. 493 \nHydrogeology Journal 13: 481-492  494 \nEdmunds W M, Ma J, Aeschbach-Hertig W & Darbyshire D P F. 2006. Groundwater recharge history and 495 \nhydrogeochemical evolution in the Minqin Basin, North West China. Applied Geochemistry 21, 2148-496 \n2170. 497 \nFoster S, Garduno H, Evans R, Olson D, Tian Y, Zhang W and Han Z. 2004. Quaternary Aquifer of the North 498 \nChina Plain – assessing and achieving groundwater resource sustainability. Hydrogeology Journal 12: 499 \n81-93. 500 \nGates J B, Böhlke J K and Edmunds W M. 2008.  Ecohydrological factors affecting nitrate concentrations in a 501 \nphreatic desert aquifer in northwestern China.  Environmental Science & Technology 42: 3531–3537. 502 \nGroundwater Development and Utilisation Teaching and Research Office. 1984. Hydrogeology Survey Report 503 \non Chahaertan Irrigation Area, Left Banner: Water Resource Assessment and Systematic Analysis. 504 \nProduced within the Agricultural and Animal Husbandry, Water Conservancy and Engineering School 505 \nof the Inner Mongolia Agricultural and Animal Husbandry College. December 1984. 506 \nGuo H and Wang Y. 2004. Hydrogeochemical processes in shallow quaternary aquifers from the northern part 507 \nof the Datong Basin, China. Applied Geochemistry 19: 19-27. 508 \n 20\nHughes A G, Mansour M M, Robins N S and Peach D W. 2006. Numerical modeling of runoff recharge in a 509 \ncatchment in the West Bank. In: MODFLOW and More: Managing Ground-Water Systems – 510 \nConference Proceedings. Colorado School of Mines, May 2006, Volume 1: 385-389. 511 \nHughes A G, Mansour M M and Robins N S. 2008. Evaluation of distributed recharge in an upland semi-arid 512 \nkarst system: the West Bank Mountain Aquifer. Hydrogeology Journal, 16: 845-854. 513 \nJerie P. 2006. Improving the Management of Water and Nitrogen Fertilizer for Agricultural Profitability and 514 \nGroundwater Quality in Alxa. Preliminary ALERMP Report, June 2006.  515 \nJackson C R, Hughes A G, Ó Dochartaigh B É, Robins N S and Peach D W. 2005.  Numerical testing of 516 \nconceptual models of groundwater flow:  A case study using the Dumfries Basin Aquifer. Scottish 517 \nJournal of Geology, vol. 41 (1), 51-60. 518 \nJi X B, Kang E S, Chen R S, Zhao W Z, Zhang Z H and Jin B W. 2006. The impact of the development of water 519 \nresources on environment in arid inland river basins of Hexi region, Northwestern China. 520 \nEnvironmental Geology 50 (6): 793-801. 521 \nKendy E, Gerard-Marchant P, Walter M T, Zhang Y, Liu C and Steenhuis T S. 2003. A soil-water-balance 522 \napproach to quantify groundwater recharge from irrigated cropland in the North China Plain. 523 \nHydrological Processes 17, 2011-2031.  524 \nKreuzer A M, Von Rohden C, Friedrich R, Chen Z, Shi J, Hajdas I, Kipfer R, and Aeschbach-Hertig W. 2009. A 525 \nrecord of temperature and monsoon intensity over the past 40 kyr from groundwater in the North China 526 \nPlain. Chemical Geology 259, 168–180. 527 \nLange J, Greenbaum N, Husary S, Ghanem M, Leibundgut C and Schick A P. 2003. Runoff generation from 528 \nsuccessive simulated rainfalls on a rocky, semi-arid, Mediterranean hillslope. Hydrological Processes 529 \n17, 279-296 530 \nLeft Banner Water Management and Water Resource Office. 1992. Water Supply Project (Supply Amount) 531 \nYield Statistics Summary Table. Alxa, Left Banner, Inner Mongolia,. December 1992.  532 \n 21\nMa J Z, Wang X Z and Edmunds W M. 2005. The characteristics of ground-water resources and their changes 533 \nunder the impacts of human activity in the arid Northwest China - a case study of the Shiyang River 534 \nBasin. JOURNAL OF ARID ENVIRONMENTS 61 (2): 277-295 535 \nMa J Z and Edmunds W M. 2006. Groundwater and lake evolution in the Badain Jaran Desert ecosystem, Inner 536 \nMongolia. Hydrogeology Journal 14, 1231-1243. 537 \nÓ Dochartaigh B É and MacDonald A M. 2006. Groundwater degradation in the Chahaertan Oasis, Alxa 538 \nLeague, Inner Mongolia. British Geological Survey Commissioned Report CR\/06\/220N. 539 \nPeople’s Liberation Army. 1976. Regional Hydrogeological Survey Report for Sheet J-48-[4]: Jilantai. 540 \nPeople’s Liberation Army. 1980. Regional Hydrogeological Survey Report for Sheet J-48-[10]: Alxa, Left 541 \nBanner. 542 \nRushton K R and Wedderburn L A. 1971. Starting Conditions for Aquifer Simulations. Ground Water 11 (1), 543 \n37-42. 544 \nSpink A E F, Jackson C R, Hughes A G and Hulme P J. 2003.  The Benefits of Object-Oriented Modeling 545 \nDemonstrated through the Development of a Regional Groundwater Model. MODFLOW and More 546 \n2003: Understanding through Modeling – Conference Proceedings, Poeter, Zheng, Hill and Doherty. 547 \npp 336-340. 548 \nSpink, A E F, Hughes A G, Jackson C R and Mansour M M. 2006. Object-oriented Design in Groundwater 549 \nModelling.  MODFLOW and More 2006: Managing Ground-Water Systems – Conference 550 \nProceedings, Poeter, Hill and Zheng. Colorado School of Mines, USA. 551 \nWilliams A. 2006a. Recommendations for improvements to livestock enterprises based on stall feeding in an 552 \noasis environment, with particular reference to Chahaertan. AusAID: ALERMP Project Report. 553 \nYuan L J and Wu S Z. 1996. Groundwater Hydrological Systems in Arid Areas: Western Helanshan 554 \nGroundwater Systems Research. Geological Press, Beijing. 555 \n556 \n 22\n 557 \nFigure 1 Location and generalised hydrology and hydrogeology of Chahaertan and the Quaternary aquifer. 558 \n 559 \n 560 \nFigure 2 Schematic cross section of the Chahaertan Quaternary aquifer system along the line shown in 561 \nFigure 1, and showing the approximate position of the groundwater table 562 \n 23\n 563 \nFigure 3  Location of groundwater chemistry sample sites at Chahaertan and the surrounding aquifer. 564 \nSample numbers are as in Tables ESM1 – ESM3 565 \n 24\n 566 \nFigure 4 Schematic illustrating the increase in irrigated area, number of production wells and 567 \ngroundwater abstraction, and the simultaneous decline in groundwater levels at Chahaertan 568 \nfrom 1984 to 2006. 569 \n570 \n 25\n 571 \nFigure 5 Major ion concentrations of pre-development Chahaertan groundwaters and groundwaters 572 \noutside the irrigated area, plotted versus distance downgradient from the recharge area in the 573 \nHelan Mountains. Site 22 lies off the assumed flowpath and is shown as an open circle.  574 \nSample location numbers are shown on the top (Na) plot. 575 \n 26\n 576 \nFigure 6 Plots of (a) Ca\/Na molar ratios, and (b) Br\/Cl ratios of baseline Chahaertan groundwaters and 577 \ngroundwaters outside the irrigated area, versus distance downgradient from the recharge area.  578 \nSite 22 lies off the assumed flowpath and is shown as an open circle.    579 \n580 \n 27\n 581 \nFigure 7 Plots versus Cl for the Ca, Na, SO4, HCO3 and NO3-N contents of groundwaters from the 582 \nirrigated area at Chahaertan. Selected site numbers shown. 583 \n 28\n 584 \nFigure 8 Plot of δ2H versus δ18O for all Chahaertan groundwaters within and outwith the irrigated area, 585 \nwith site numbers.  The meteoric line (solid line) is for the nearest GNIP station at Yinchuan 586 \n(longitude 106.13°E, latitude 38.29°N) (http:\/\/nds121.iaea.org\/wiser\/index.php) Yinchuan 587 \naverage isotope values are approximately –6.5 ‰ δ18O and –45 ‰ δ2H. The isotopic 588 \ncomposition of end-Pleistocene groundwater is based on a 2‰ depletion in δ18O, as found by 589 \nKreuzer et al. (2009) in the North China Plain. 590 \n 591 \n 592 \nFigure 9  Plots of the Si, CFC-12 and δ18O values for pre-development Chahaertan groundwaters and 593 \ngroundwaters outside the irrigated area, plotted versus distance downgradient from the 594 \nrecharge area.  Site 22 lies off the assumed flowpath and is shown by an open circle.    595 \n 29\n 596 \nFigure 10 Plot of CFC-11 versus CFC-12 concentrations for Chahaertan groundwaters, with selected site 597 \nnumbers. The piston flow (solid) curve is based on secular changes in the Northern Hemisphere atmospheric 598 \nmixing ratios over the past 50 years (data from http:\/\/water.usgs.gov\/lab\/software\/air_curve\/) and an average 599 \nunsaturated zone recharge temperature of 15°C at an elevation of 1100 m ASL.  The dashed mixing line is 600 \nbetween modern and older CFC-free water. 601 \n 602 \nFigure 11 Plot of CFC-11 versus TDS (total dissolved solids) for Chahaertan groundwaters.  Selected 603 \nsite numbers are shown.  604 \n605 \n 30\n 606 \nFigure 12  Simulated river flows for a large rainfall event (41 mm\/day in the Helan Mountains) (left); and 607 \nspatial distribution of modelled recharge across the Chahaertan aquifer (right) 608 \n609 \n 31\n 610 \nFigure 13 Modelled steady state groundwater head contours and available observed rest water levels in 611 \nthe aquifer around Chahaertan. All water levels in metres above sea level. 612 \n 32\n 613 \nFigure 14 Conceptual model of post-development groundwater system at Chahaertan.   614 \n 615 \n 616 \nTable I Wadi channel characteristics  617 \nWadi location Channel \nwidth \nChannel bed \nmaterial  \nAnnual flow events Flow depth \nin channel \nRoughness \ncoefficient1 \nHelan Mountains 5 m \nCoarse, high-energy \ngravel to boulder size \ndeposits. \nUnrecorded but likely \nto be 5-10 times, for \n>10 hours per event. \nAverage \n0.5 m 0.05 \nQuaternary aquifer \nat Chahaertan 20–30 m \nFine sands and \ngravels. \n3–4 times, for 3–10 \nhours per event. In \nsmaller events, flow \ndies out c. 20 km north \nof Chahaertan. \nMaximum \n1 m, average \n0.5 m \n0.03 \nQuaternary aquifer \nat the lake at Jilantai 20–30 m Fine sands. \n2 times (maximum), for \n<5 hours per event. \nAverage \n0.5 m 0.02 \n1Based on literature values for roughness coefficients for natural channels 618 \n 619 \nTable II. Modelled recharge volumes at Chahaertan and across the Quaternary aquifer  620 \nRecharge source Volume in Chahaertan local area \n(Mcm\/a) \nVolume across Quaternary \naquifer (Mcm\/a) \nRainfall  2 20 \nWadi leakage  6 14 \nIrrigation returns 10 10 \nTotal 18 44 \n 621 \n"}