{"doi":"10.1017\/S0022112008003558","coreId":"103144","oai":"oai:epubs.surrey.ac.uk:2891","identifiers":["oai:epubs.surrey.ac.uk:2891","10.1017\/S0022112008003558"],"title":"Thresholds for the formation of satellites\\ud\nin two-dimensional vortices","authors":["Turner, M R","Gilbert, A D"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008","abstract":"This paper examines the evolution of a two-dimensional vortex which initially consists\\ud\nof an axisymmetric monopole vortex with a perturbation of azimuthal wavenumber\\ud\nm=2 added to it. If the perturbation is weak, then the vortex returns to an\\ud\naxisymmetric state and the non-zero Fourier harmonics generated by the perturbation\\ud\ndecay to zero. However, if a finite perturbation threshold is exceeded, then a persistent\\ud\nnonlinear vortex structure is formed. This structure consists of a coherent vortex core\\ud\nwith two satellites rotating around it.\\ud\n\\ud\n\\ud\nThe paper considers the formation of these satellites by taking an asymptotic limit\\ud\nin which a compact vortex is surrounded by a weak skirt of vorticity. The resulting\\ud\nequations match the behaviour of a normal mode riding on the vortex with the\\ud\nevolution of fine-scale vorticity in a critical layer inside the skirt. Three estimates of\\ud\ninviscid thresholds for the formation of satellites are computed and compared: two\\ud\nestimates use qualitative diagnostics, the appearance of an inflection point or neutral\\ud\nmode in the mean profile. The other is determined quantitatively by solving the\\ud\nnormal mode\/critical-layer equations numerically. These calculations are supported\\ud\nby simulations of the full Navier–Stokes equations using a family of profiles based\\ud\non the tanh function","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"Cambridge University Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2891<\/identifier><datestamp>\n      2017-10-31T14:06:55Z<\/datestamp><setSpec>\n      7374617475733D6163636570746564<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:6D617468737075626C<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2891\/<\/dc:relation><dc:title>\n        Thresholds for the formation of satellites\\ud\nin two-dimensional vortices<\/dc:title><dc:creator>\n        Turner, M R<\/dc:creator><dc:creator>\n        Gilbert, A D<\/dc:creator><dc:description>\n        This paper examines the evolution of a two-dimensional vortex which initially consists\\ud\nof an axisymmetric monopole vortex with a perturbation of azimuthal wavenumber\\ud\nm=2 added to it. If the perturbation is weak, then the vortex returns to an\\ud\naxisymmetric state and the non-zero Fourier harmonics generated by the perturbation\\ud\ndecay to zero. However, if a finite perturbation threshold is exceeded, then a persistent\\ud\nnonlinear vortex structure is formed. This structure consists of a coherent vortex core\\ud\nwith two satellites rotating around it.\\ud\n\\ud\n\\ud\nThe paper considers the formation of these satellites by taking an asymptotic limit\\ud\nin which a compact vortex is surrounded by a weak skirt of vorticity. The resulting\\ud\nequations match the behaviour of a normal mode riding on the vortex with the\\ud\nevolution of fine-scale vorticity in a critical layer inside the skirt. Three estimates of\\ud\ninviscid thresholds for the formation of satellites are computed and compared: two\\ud\nestimates use qualitative diagnostics, the appearance of an inflection point or neutral\\ud\nmode in the mean profile. The other is determined quantitatively by solving the\\ud\nnormal mode\/critical-layer equations numerically. These calculations are supported\\ud\nby simulations of the full Navier–Stokes equations using a family of profiles based\\ud\non the tanh function.<\/dc:description><dc:publisher>\n        Cambridge University Press<\/dc:publisher><dc:date>\n        2008<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2891\/1\/quasimodes2.1.pdf<\/dc:identifier><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2891\/2\/turner02.pdf<\/dc:identifier><dc:identifier>\n          Turner, M R and Gilbert, A D  (2008) Thresholds for the formation of satellites in two-dimensional vortices   Journal of Fluid Mechanics, 614.  pp. 381-405.      <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1017\/S0022112008003558<\/dc:relation><dc:relation>\n        10.1017\/S0022112008003558<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2891\/","http:\/\/dx.doi.org\/10.1017\/S0022112008003558","10.1017\/S0022112008003558"],"year":2008,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"J. Fluid Mech. (2008), vol. 614, pp. 381–405. c© 2008 Cambridge University Press\ndoi:10.1017\/S0022112008003558 Printed in the United Kingdom\n381\nThresholds for the formation of satellites\nin two-dimensional vortices\nM. R. TURNER AND A. D. GILBERT\nMathematics Research Institute, School of Engineering, Computing and Mathematics,\nUniversity of Exeter, Exeter EX4 4QF, UK\n(Received 2 February 2008 and in revised form 7 July 2008)\nThis paper examines the evolution of a two-dimensional vortex which initially consists\nof an axisymmetric monopole vortex with a perturbation of azimuthal wavenumber\nm=2 added to it. If the perturbation is weak, then the vortex returns to an\naxisymmetric state and the non-zero Fourier harmonics generated by the perturbation\ndecay to zero. However, if a ﬁnite perturbation threshold is exceeded, then a persistent\nnonlinear vortex structure is formed. This structure consists of a coherent vortex core\nwith two satellites rotating around it.\nThe paper considers the formation of these satellites by taking an asymptotic limit\nin which a compact vortex is surrounded by a weak skirt of vorticity. The resulting\nequations match the behaviour of a normal mode riding on the vortex with the\nevolution of ﬁne-scale vorticity in a critical layer inside the skirt. Three estimates of\ninviscid thresholds for the formation of satellites are computed and compared: two\nestimates use qualitative diagnostics, the appearance of an inﬂection point or neutral\nmode in the mean proﬁle. The other is determined quantitatively by solving the\nnormal mode\/critical-layer equations numerically. These calculations are supported\nby simulations of the full Navier–Stokes equations using a family of proﬁles based\non the tanh function.\n1. Introduction\nIt has been observed in two-dimensional high-Reynolds-number ﬂows that\naxisymmetric coherent vortical structures arise spontaneously from random initial\nconditions (Fornberg 1977; McWilliams 1984). Many studies of these coherent\nstructures focus on the behaviour of an axisymmetric vortex under a non-axisymmetric\nperturbation, which could be weak or strong. These studies typically consider\nperturbations with an azimuthal wavenumber m=2 or higher. (For discussion of\nthe m=1 case and its peculiarities see Llewellyn Smith 1995.) Early studies of\nsuch vortices showed that they often return to an axisymmetric state. A vortex can\nrelax inviscidly to an axisymmetric state when the non-axisymmetric perturbation\nbecomes ﬁnely scaled owing to the spiral wind-up in the underlying ﬂow (Melander,\nMcWilliams & Zabusky 1987). As the values of the perturbation vorticity do not\ntend to zero pointwise, a more convenient notion of axisymmetrization is when\nthe non-axisymmetric components of the streamfunction ψ tend to zero for large\ntimes. For large but ﬁnite Reynolds number R, the non-axisymmetric components of\nthe vorticity are destroyed, and hence the vortex axisymmetrizes, on the time scale\nO(R1\/3), which is fast compared to the slow viscous timescale of O(R) (Bernoﬀ &\nLingevitch 1994; Bajer, Bassom & Gilbert 2001).\n382 M. R. Turner and A. D. Gilbert\n6\nt = 0 t = 300 t = 700\n(a)\ny\n–6\n6(b)\ny\n–6\n–6 6\nx\n–6 6\nx\n–6 6\nx\nFigure 1. Plot of the Gaussian vortex (a) and the tanh proﬁle vortex (b), with σ = σ2 = 0.2,\nrelaxing to a tripole structure with R = 104 and δ = 0.5. Positive vorticity is shown as white,\nnegative vorticity is black and zero vorticity is grey; the peak vorticity values are saturated at\n|Z| = 0.005.\nAs more numerical and experimental studies were carried out, it became apparent\nthat axisymmetrization occurs only for suﬃciently weak perturbation amplitudes, and\nthat for larger amplitudes, the vortex can evolve into a persistent non-axisymmetric\nstate (Dritschel 1989, 1998; Koumoutsakos 1997; Rossi, Lingevitch & Bernoﬀ 1997).\nAn example of a persistent nonlinear state is a multipole, which can be formed by\nallowing an initial vorticity distribution of the form\nZ(r, θ) = Z0(r) + δZm(r)e\nimθ + complex conjugate, (1.1)\nto evolve freely in time. The variables (r, θ) are the usual polar coordinates and\nZm(r)e\nimθ is an m-fold perturbation to the axisymmetric monopole vortex Z0(r). The\nreal parameter δ > 0 is an amplitude and axisymmetrization occurs if δ is below a\nthreshold value. In the most studied case, the vorticity distributions take the form\nZ0(r) =\n1\n4π\ne−r\n2\/4, Z2(r) =\nr2\n4π\ne−r\n2\/4, (1.2)\nwith m=2. The vortex evolves into a tripole which consists of a vortex core with two\nopposite-signed satellites of vorticity rotating around it, if δ is above some threshold\nvalue (Rossi et al. 1997; Barba 2006; Barba & Leonard 2007). This tripole structure\ncan be seen in ﬁgure 1(a), which shows the evolution of (1.1) and (1.2) with R =104\nand δ=0.5 at t =0, t = 300 and t =700. Negative vorticity is black in the panels,\nand at t =700 we can see the two negative satellites rotating around a positive vortex\ncore.\nSuch tripoles can also emerge from instabilities within axisymmetric shielded\nmonopoles, that is, comprising a vortex core with a ring of opposite-signed vorticity\nencasing it and zero total circulation. This has led to many investigations of the\nevolution of a tripole from these shielded monopoles by experiments (van Heijst,\nThresholds for the formation of satellites in two-dimensional vortices 383\nKloosterziel & Williams 1991) and numerical studies (Carton & Legras 1994; Morel &\nCarton 1994). The physical observation of these structures is not restricted to the labo-\nratory, however, as these tripoles have been observed in the ocean, ﬁrst by Pingree &\nLe Cann (1992).\nThere remain a number of unresolved issues involving such multipolar vortices.\nFor what choices of Z0(r) and Zm(r) do such structures form? How, if at all, are\nthese multipoles (which have both signs of vorticity present) related to persistent cat’s\neye structures in which the vorticity in the satellites is the same sign as the core?\nThe threshold parameter δ shows a dependence on the Reynolds number: does δ(R)\nhave a limiting value in the inviscid limit as R → ∞? Barba & Leonard (2007) have\nrun simulations showing that the threshold value δ(R) decreases as R is increased,\nbut the large-Reynolds-number limit has not been extensively researched.\nThe aim of this paper is to address some of these issues using a combination of\nnumerical simulations and an asymptotic limit in which we consider vortices with\nsharp edges. To set the scene, we note that the phenomenon of tripole formation is\nnot restricted to Gaussian vortices: consider, for example the ‘tanh’ proﬁles\nZ0(r) =\n1\n4π\n1 − tanh((r2 − σ 2)\/(4(1 − σ )))\n1 + tanh(σ 2\/(4(1 − σ ))) , (1.3)\nZ2(r) =\nr2\n4π\n1 − tanh ((r2 − σ 22 ) \/(4(1 − σ2)))\n1 + tanh\n(\nσ 22 \/(4(1 − σ2))\n) , (1.4)\n(Hall, Bassom & Gilbert 2003a). As σ and σ2 are varied from 0 to 1, the axisymmetric\nvortex and the perturbation change from a broad Gaussian-like form to a sharp\nRankine (top-hat) vortex. Figure 1(b) shows the evolution of these tanh proﬁles into\na tripole for the parameter values σ = σ2 = 0.2, R =10\n4 and δ=0.5. In this case, the\nnegative satellites are clearly visible as the black regions outside the vortex core. Note\nthat while such sharp-edged vortices are convenient mathematically, they also arise\nnaturally in geophysical systems and two-dimensional turbulence via processes such\nas vortex stripping (Legras & Dritschel 1993).\nUsing these tanh proﬁles in the limit as σ → 1 we are able to calculate an\ninviscid threshold for the formation of satellite vortices using the theory of Balmforth,\nLlewellyn Smith & Young (2001, hereinafter referred to as BLSY). As mentioned\nabove, another type of non-axisymmetric structure that can form is a ring of cat’s\neyes around a vortex core, which has vorticity everywhere of one sign: here the ﬂuid\ncirculates about each cat’s eye (in a frame co-rotating with the ring) and the vorticity\nis locally ﬂattened. To be clear about our terminology, we will use the term cat’s eyes\nto refer to cases where the vorticity is everywhere of one sign, multipoles for both\nsigns, and satellites to refer to either. These cat’s eyes may be generated for m = 2\nby exposing an axisymmetric vortex to an irrotational external strain ﬁeld that is\nswitched oﬀ after some given time. For a suﬃciently weak strain, the vortex returns\nto an axisymmetric state, and the non-axisymmetric perturbations are wound up into\nspiral ﬁlaments (Briggs, Daugherty & Levy 1970; Bassom & Gilbert 1998; Le Dize`s\n2000). If the amplitude, of the strain is above some threshold amplitude, however,\nthe vorticity can locally homogenize to form a pair of cat’s eyes rotating around the\ncoherent vortex core (Schecter et al. 2000; Balmforth et al. 2001; Macaskill, Bassom &\nGilbert 2002; Turner & Gilbert 2007). Thus for m=2, cat’s eyes appear similar to the\nsatellites in a tripole vortex, except they are of the same sign as the core.\n384 M. R. Turner and A. D. Gilbert\nThresholds for cat’s eye formation in a Gaussian vortex have been obtained\nnumerically by Turner & Gilbert (2007) and by BLSY in their asymptotic model,\nwith qualitative agreement. In this paper, our aim is to study the threshold for the\nformation of satellite structures for sharp-edged vortices using the asymptotic model\nof BLSY in the absence of an external forcing, but with an initial condition equivalent\nto that in (1.1) used for the formation of multipolar vortices. This model begins with\na smooth monopole vortex with the proﬁle\nZ0(r) = ZC(r) + \u0006ZS(r), (1.5)\nwhich consists of a compact vortex ZC(r), that is where the vorticity is identically zero\nbeyond some radius, plus an asymptotically small ‘skirt’ \u0006ZS(r). The small parameter\nthat is exploited is \u0006. The simplest example of a compact vortex is a Rankine vortex,\nwhere\nZC(r) =\n{\n1 (r < 1),\n0 (r > 1).\n(1.6)\nThis vortex supports an m = 2 Kelvin mode with a critical layer at r2 =\n√\n2 where\nthe angular velocity of the mode is equal to that of the ﬂuid. When a weak skirt is\nintroduced, this wave interacts with vorticity in the critical layer of width \u0006 and the\nnormal mode is replaced by a quasi-mode (Briggs et al. 1970; Schecter et al. 2000;\nTurner & Gilbert 2007). A quasi-mode is essentially a special transient solution of\nthe linear initial-value problem where the streamfunction decays exponentially and\nthe vorticity wraps up into spiral ﬁlaments without decay.\nThe BLSY model yields a coupled system comprising an ODE for the normal mode\namplitude and a PDE for the vorticity in the critical layer, and these authors study this\nsystem when the vortex is subjected to an external strain ﬁeld. For weak strain there\nis the linear quasi-mode and exponential decay, but for stronger perturbations, above\na threshold, persistent cat’s eyes form, as vorticity is homogenized in recirculating\nregions in the critical layer. We also note in passing that rather than the BLSY\napproach of solving the initial-value problem, Le Dize`s (2000) seeks steady states\nwith asymptotically thin cat’s eyes, using a jump condition across the critical layer.\nWe adapt the asymptotic theory of BLSY to incorporate a non-zero initial mode\nm condition, such as the examples (1.1) to (1.4). This involves only two complex\nparameters, the initial amplitude of the normal mode and the initial strength of the\nmode m vorticity in the critical layer, and these reduce to three real parameters\nafter rotation. Thus, the question of the formation of satellite vortices, within the\nlimit of sharp-edged vortices (or similar ones ﬁtting the BLSY framework) amounts\nto obtaining a threshold in a three-dimensional parameter space, when the initial\ncondition is allowed to evolve freely in time. Although we will be able to calculate\na threshold for the formation of satellites, we will not be able to determine the sign\nof the vorticity in the satellites because the governing equations for the vorticity are\nidentical to those where the vorticity has an arbitrary constant added to it. Focusing\non the m=2 case, we study three methods of computing a threshold contour. The ﬁrst\ntwo are only qualitative: an inﬂection point diagnostic calculates when the azimuthally\naveraged proﬁle ﬁrst develops an inﬂection point at the critical radius, and a neutral\nmode diagnostic calculates when this azimuthal averaged proﬁle supports a neutral\nmode. We then simulate the BLSY system to obtain the true asymptotic threshold\nusing a ‘ﬁrst bounce’ criterion for when the vorticity perturbations feed back onto\nthe basic proﬁle strongly enough to produce satellites. We discuss the usefulness of\nThresholds for the formation of satellites in two-dimensional vortices 385\nthe qualitative diagnostics and conﬁrm the results by full Navier–Stokes simulations\nof proﬁles of the form (1.3) and (1.4).\nThe structure of the paper is as follows. In § 2, we give the BLSY governing equations\nand discuss initial conditions. In § 3, we take a weakly nonlinear version of the BLSY\nequations and use this to calculate both the inﬂection point and the neutral mode\nthresholds. Simulations of the BLSY system give the correct asymptotic threshold\nand are detailed in § 4, whereas comparison with full Navier–Stokes simulations is\ngiven in § 5. Some concluding remarks are set out in § 6.\n2. Formulation\nIn this section, we give the equations from the asymptotic theory of BLSY. We use\ntheir notation; see their paper for derivations, in particular rescalings, and discussion\n(though a few results we need are to be found in Appendix B). The theory begins with\na proﬁle of the form (1.5) which supports a normal mode with complex amplitude\nϕˆ(t). This interacts with the total vorticity ζT =βy + ζ (y, θ, t) in a thin critical layer,\nwhere y is a rescaled inward-pointing radial coordinate with the critical layer at y =0.\nThe parameter β =± 1 speciﬁes the background gradient; our interest is only in the\ncase β =1 so that the background proﬁle is increasing with y, so decreasing with\nradius r , and the vortex is stable. The equations are, with m=2 from now on:\n∂tζ + y∂θζ + (β + ∂yζ )∂θϕ = 0, (2.1)\ni∂tϕˆ = χ(t) + 〈e−2iθ ζ 〉, (2.2)\nϕ(θ, t) = ϕˆ(t)e2iθ + c.c., (2.3)\n〈f 〉 = PV\n∫ ∞\n−∞\ndy\n∮\nf (y, θ, t)\n2π\ndθ. (2.4)\nThe normal mode of amplitude ϕˆ(t), riding on the compact vortex, drives a ﬂow with\nstreamfunction ϕ(θ, t) deﬁned by (2.3) in the critical layer, and (2.1) gives advection\nof vorticity in this and the background shear from the compact vortex. Equation (2.2)\nthen gives the feedback on the normal mode with a principal-value integral deﬁned\nby (2.4).\nWe set the external forcing, that is strain, χ(t) to zero, but instead are interested\nin adding an initial mode 2 disturbance, as in (1.1)–(1.4). In limits for which the\nBLSY theory applies, any initial disturbance of this form amounts to specifying the\ninitial complex amplitude \f of the normal mode, and the initial complex value of the\nmode 2 vorticity in the critical layer, given by another complex constant Γ . We thus\nuse the initial condition\nζ (y, θ, t = 0) = Γ0 + Γ e\n2iθ + c.c., ϕˆ(t = 0) = \f. (2.5)\nHere, the additive constant Γ0, the mean vorticity in the critical layer, does not aﬀect\nthe BLSY analysis as it does not enter into any of (2.1)–(2.4); hence, we set Γ0 = 0\nthroughout the analysis. However, the value of this parameter in the full Navier–\nStokes simulations ultimately determines whether the satellites formed are positive\n(cat’s eyes) or negative (a tripole). Since after rotation, we can take one of Γ or\n\f to be purely real, we are left with a three-dimensional parameter space, and the\nquestion: for which points in this space do persistent structures form in the critical\nlayer? By solving (2.1)–(2.5) in both weakly nonlinear and fully nonlinear settings,\nwe will calculate the inﬂection point, neutral mode and ﬁrst bounce thresholds, above\n386 M. R. Turner and A. D. Gilbert\nwhich the nonlinear satellites induced on the vortex persist, and below which the\nvortex returns to an axisymmetric state. These thresholds will be of the form\nF (Γ,\f) = 0, (2.6)\nwhich gives a surface in parameter space. The results we will obtain are universal in\nthat they apply to any vortex for which the BLSY model is valid.\nHowever, to compare with full Navier–Stokes simulations, we shall focus on the\nfamily of proﬁles in (1.3), which tend to the Rankine vortex (1.6) as σ → 1. In this\ncase, the m=2 critical layer occurs at r2 =\n√\n2 and so the small parameter \u0006 for the\nasymptotic expansions is proportional to Z′0(r2), tending to zero as σ → 1. In this case,\nthe constants Γ and \f are related to the parameters δ and σ2 from (1.4) via\nΓ =\nδZ2(r2)\nπZ′0(r2)2\n, \f =\n8δP2\nπZ′0(r2)2\n, (2.7)\nwhere P2 is a projection on the normal mode, given by\nP2 = − 18\n(∫ 1\n0\ns3Z2(s) ds + PV\n∫ ∞\n1\nsZ2(s)\n2 − s2 ds\n)\n. (2.8)\nThese rescalings and this projection formula are explained, in a general setting, in\nAppendix B.\nBecause of the principal-value integral in (2.4), the early evolution of this system\nwith the given initial condition has a singular forcing of the normal mode (cf. BLSY\n§ 5.1). To handle this behaviour cleanly, we integrate over the short time interval from\nt =0 to a time t∗ satisfying 1\n t∗ \n 1\/L, where L is some large cutoﬀ value of the\nprincipal-value integral. We refer to this latter time t∗ as t =0+ for brevity. For very\nshort times, the (β + ∂yζ )∂θϕ term in (2.1) is much smaller than the other two terms,\nand so we have\nζ (y, θ, t) \u000b Γ e−2iyt+2iθ + c.c., (2.9)\nand then\ni∂t ϕˆ = 〈ζe−2iθ〉 \u000b Γ sin(2Lt)\nt\n. (2.10)\nTherefore on the short time scale of t = O(L−1), a large forcing of the quantity ϕˆ\ntakes place. Using ∫ ∞\n0\nsin(u)\nu\ndu =\nπ\n2\n, (2.11)\nwe ﬁnd that at time t =0+, ϕˆ(0+)=\f − iπΓ\/2.\nWe rewrite the initial-value problem (for numerical and analytical reasons), now\nstarting at time t =0+ by writing\nζ ′ = ζ − (Γ e−2iyt+2iθ + c.c.), (2.12)\nto obtain the system of equations\n∂tζ + y∂θζ\n′ + (β + ∂yζ ′ − 2itΓ e−2iyt+2iθ + 2itΓ ∗e2iyt−2iθ )∂θϕ = 0, (2.13)\ni∂t ϕˆ = 〈e−2iθ ζ ′〉, ϕ = ϕˆ(t)e2iθ + c.c., (2.14)\n(where the star denotes the complex conjugate) with the new initial conditions\nζ ′(y, θ, 0+) = 0, ϕˆ(0+) = \f − iπΓ\/2. (2.15)\nThresholds for the formation of satellites in two-dimensional vortices 387\nIn the next section, we derive the weakly nonlinear diagnostics we use for calculating\nour threshold criteria.\n3. Weakly nonlinear results\nIn this section, we consider a weakly nonlinear solution to (2.13)–(2.15) and derive\nthe inﬂection point and the neutral mode diagnostics for determining when satellites\npersist in a vortex or when the vortex returns to an axisymmetric state.\n3.1. Weakly nonlinear critical-layer equations\nWe seek an approximate solution to (2.13)–(2.15) by introducing\nζ ′(y, θ, t) = ζˆ ′(y, t)e2iθ + c.c. + ζ¯ (y, t) + · · · . (3.1)\nThis expansion neglects all the higher-order eﬀects; however, it does allow us to\ncalculate the two qualitative criteria described above which have been used in the\nstudy of BLSY. Substituting (3.1) into (2.13), we obtain the set of equations\n∂t ζˆ\n′ + 2iy ζˆ ′ + 2iβϕˆ = 0, (3.2)\n∂t ζ¯ − 2i(∂y ζˆ ′ − 2itΓ e−2iyt )ϕˆ∗ + c.c. = 0, (3.3)\ni∂t ϕˆ = 〈ζˆ ′〉. (3.4)\nThe initial conditions for this problem are\nζˆ ′(y, 0+) = 0, ζ¯ (y, 0+) = 0, ϕˆ(0+) = \f − iπΓ\/2. (3.5)\nThe quantity ζ¯ is the correction to the azimuthal mean of the vorticity in the critical\nlayer and we seek the large-time form of this function to see how the initial condition\neventually alters the vorticity proﬁle in the skirt. From this modiﬁcation, we can form\ndiagnostics to test whether satellites persist or not. These are only qualitative as the\nweakly nonlinear development does not apply quantitatively at ﬁnite values, that is,\nnot at the threshold.\nWe solve (3.2) by the same method as in § 5.1 of BLSY, and using the initial\nconditions (3.5) gives\nϕˆ =\n(\n\f − iπΓ\n2\n)\ne−πβt , (3.6)\nζˆ ′ = 2iβ\n(βπ+ 2iy)\nβ2π2 + 4y2\n(e−πβt − e−2iyt )\n(\n\f − iπΓ\n2\n)\n. (3.7)\nThus, the large-time form of the solution for ζ¯ in (3.3) can be expressed as\nζ¯∞ ≡ ζ¯ (y, t → ∞) = −32βy |A|\n2 + π(AiΓr − ArΓi)\n(β2π2 + 4y2)2\n+ 8(β2π2 − 4y2) ArΓr + AiΓi\n(β2π2 + 4y2)2\n,\n(3.8)\nwhere A=\f − iπΓ\/2 and the subscripts r and i denote real and imaginary parts\nrespectively. As mentioned earlier, we can rotate our axes to make one of the quantities\nΓ or \f real; thus, without loss of generality we set Γr =Γ and Γi =0.\n3.2. Inﬂection-point diagnostic\nHere, we consider an inﬂection-point diagnostic used by BLSY: we consider the\ncontour in parameter space where the azimuthally averaged total vorticity in the\n388 M. R. Turner and A. D. Gilbert\n–4\n–3\n–2\n–1\n0\n1\n2\n3\n4\n–2 –1 0 1 2\nΓ\nΔ\n1\n3 2\nFigure 2. Threshold contours, for the case when Γ and \f are real, inside which satellites do\nnot persist and outside which they do. Contour 1 is given by the inﬂection point diagnostic\n(3.10), contour 2 by the neutral mode diagnostic (3.16) and contour 3 by the numerical solution\nof (2.13)–(2.15). Contour 3 deﬁnes the set of parameters for which the ﬁrst bounce time t =45.\nThe stars represent parameter values used in the numerical simulations in § 4.\ncritical layer ζT =βy + ζ¯\n∞ ﬁrst develops an extremal point at the critical radius\n(y =0). Using this diagnostic with ζ¯∞ given by (3.8) and with Γ real, gives the\nexpression\nF (Γ,\f) = \f2r + \f\n2\ni − π\n2\n4\nΓ 2 − π\n4\n32\n= 0. (3.9)\nEquation (3.9) gives a three-dimensional surface in the parameter space (Γ,\fr,\fi)\noutside which satellites persist and within which the vortex returns to axisymmetry\n(i.e. the streamfunction ϕˆ(t) decays to zero).\nFor the case when \f is also real, which corresponds to an initial condition of\nthe form used by the Navier–Stokes simulations of Rossi et al. (1997) and Barba &\nLeonard (2007), we have a contour in the (Γ,\f)-plane given by\nF (Γ,\f) = \f2 − 1\n4\nπ2Γ 2 − 1\n32\nπ4 = 0, (3.10)\nwhich describes two hyperbolae, centred on the point \f=Γ =0. For any parameter\nvalues lying between these hyperbolae, the vortex would be assumed to return to an\naxisymmetric state and not contain persistent satellites. This contour can be seen as\ncontour 1 in ﬁgure 2.\nThis inﬂection point threshold is over-simpliﬁed so we do not expect it to agree\nwell with nonlinear simulations. This is because the existence of an extremal point\ndoes not guarantee satellite persistence, as was observed by BLSY for the generation\nof cat’s eyes. Mo¨ller & Montgomery (1999) have also used this method in the context\nof the full equations of motion and reached similar conclusions to the limitations of\nthis diagnostic. A more informative diagnostic is to calculate when the vortex has\nan axisymmetric basic proﬁle that will maintain a neutral mode, i.e. one where\nϕˆ(t)= constant. Neutral modes of an axisymmetric vortex have been seen to\ncorrespond to persistent cat’s eye structures (Turner, Gilbert & Bassom 2008).\nThresholds for the formation of satellites in two-dimensional vortices 389\n3.3. Neutral mode diagnostic\nTo calculate neutral modes of the axisymmetric total vorticity proﬁle in the critical\nlayer ζT =βy + ζ¯\n∞, we perform a normal mode analysis. This analysis is the same as\nthat in Hall et al. (2003a) and similar to that in BLSY. From (2.1) and (2.2), we solve\nthe linearized system\n∂t ζˆ + imy ζˆ + im(β + ∂y ζ¯\n∞)ϕˆ = 0, i∂t ϕˆ = PV\n∫ ∞\n−∞\nζˆ (y, t) dy, (3.11)\nwhere we have taken a perturbation to the long-time mean proﬁle\nζ = ζ¯∞(y) + ζˆ (y, t)eimθ + · · · (3.12)\nFor this study m = 2, although m is left arbitrary in the following equations for\nmathematical clarity. Solving for ζˆ (y, t) as in § 3.2, with the initial condition ζˆ (y, 0+) =\n0, and substituting this into the equation for ϕˆ gives\n∂t ϕˆ = −mβπ\n2\nϕˆ −\n∫ t\n0\nK(t − s)ϕˆ(s) ds, (3.13)\nwhere the kernel\nK(t) = m\n∫ ∞\n−∞\n∂yζ¯\n∞e−imyt dy . (3.14)\nSeeking a solution to (3.13) of the form ϕˆ ∝ eγ t leads to an implicit equation for the\ngrowth rate γ :\nγ = −mβπ\n2\n−\n∫ ∞\n0\ne−γ uK(u) du. (3.15)\nSubstituting (3.8) into (3.14), integrating the kernel K(t) in (3.15) by parts and then\nusing residue calculations, we can express the equation for γ in the implicit form\nγ = −mπ\n2\n− 32m\n3ρ\n(πm + 2γ )3\n, (3.16)\nwhere β has been set equal to unity, and\nρ = iπΓ\fr −\n(\n\f2r + \f\n2\ni − π\n2\n4\nΓ 2\n)\n(3.17)\nis a constant which depends on the initial conditions.\nFor an arbitrary set of initial conditions, (3.16) can be solved to give a complex\ngrowth rate γ = γr +iγi . We are interested in neutrally stable solutions of this equation\n(γr =0) which will correspond to the initial condition producing persistent nonlinear\nsatellites. This is achieved by solving the quartic equation (3.16) for γ with some initial\nset of parameters (Γ,\fr,\fi) and singling out the growth rate with the smallest real\npart. With two of these parameters ﬁxed, the third is varied until γr =0 whereupon a\nsecond parameter is then changed and the ﬁrst is again updated until γr =0. With the\nthird parameter held ﬁxed, this maps out a curve in the two-dimensional plane which\nsatisﬁes this constraint of neutral stability. For illustration, we consider again the case\nwhen \fi =0 and compare the neutral stability contour for this diagnostic (contour 2),\nwith the contour given by (3.10) for the inﬂection point diagnostic (contour 1); these\ncontours are plotted in ﬁgure 2.\nFigure 2 shows that the neutral mode diagnostic (contour 2) produces a closed\ncontour in the (Γ,\f)-plane, which has a much smaller region of decaying solutions\n390 M. R. Turner and A. D. Gilbert\nthan the inﬂection point diagnostic (contour 1). Both diagnostics agree at the points\nΓ =0, \f=±π2\/4√2\u000b ± 1.744, which are given in BLSY. We expect the actual\nthreshold contour of the fully nonlinear problem to diﬀer from the neutral mode\ncontour, because the nonlinear eﬀects not present in the neutral mode analysis are\nimportant for the formation of satellites.\n4. Numerical simulation and the ﬁrst bounce diagnostic\nThe two weakly nonlinear diagnostics formulated in § 3 depend only on the form\nof the large-time vorticity perturbation ζ¯∞(y). The inﬂection point diagnostic is quite\ncrude, and although the neutral mode diagnostic ensures a persistent perturbation,\nit is based on only a weakly nonlinear development, and so discards the higher-\norder Fourier modes and their interactions. In this section, we formulate a nonlinear\nquantitative diagnostic which comes from the numerical solution of (2.13)–(2.15).\nEquation (2.13) is solved by expanding ζ ′ as a series of even Fourier harmonics:\nζ ′(y, θ, t) =\nN∑\nn=−N\nζ ′2n(y, t)e\n2inθ . (4.1)\nTo aid the numerical stability of our code, we introduce the diﬀusive term R−1eﬀ ∂2y ζ ′\nto the right-hand side of (2.13) (Hall et al. 2003b). The inclusion of this viscous\nterm destroys any ﬁne-scale structure in the vorticity ﬁeld, but this does not aﬀect\nthe threshold values we calculate. Moreover, we have checked that for Reﬀ \u0002 105\nthe results are insensitive to the value of Reﬀ: we set Reﬀ =10\n5 and our results are,\nfor practical purposes, inviscid. This system of equations is then marched forward\nin time using a Crank–Nicolson scheme for the advective and diﬀusive terms, and\nan Adams–Bashforth method for the nonlinear terms. The coordinate y across the\ncritical layer is treated via a ﬁnite-diﬀerence scheme.\nFor simplicity, the PDE (2.13) is discretized in the ﬁnite domain y ∈ [−L,L];\nthus boundary conditions are imposed on ζ ′2n at y = ± L for n=0, 1, . . . , N . This is\nachieved by considering the large-y asymptotic form of the solutions for each ζ ′2n. It\nis possible to calculate numerous terms in these asymptotic expansions; however, for\nnumerical accuracy, it is suﬃcient to use only the leading-order terms. The large-y\nconditions imposed are\nζ ′0 ∼ 2ity−1(Γ ϕˆ∗e−2iyt − Γ ∗ϕˆe2iyt ), (4.2)\nζ ′2 ∼ −βϕˆy−1 + β(\f − iπΓ\/2)y−1e−2iyt , (4.3)\nζ ′4 ∼ 2itΓ ϕˆy−1e−2iyt , (4.4)\nζ ′2n ∼ 0, ∀ n > 2. (4.5)\nThe numerical solution of ϕˆ contains oscillations which are due to the integral\nof 〈ζ ′2〉 in (2.14) being approximated over a ﬁnite range of y. These oscillations are\nremoved at leading order by using (4.3) to approximate the integral in (2.14) outside\nthe y ∈ [−L,L] domain; this calculation is given in Appendix A. This method,\nhowever, does not remove all the oscillations, which persist at the next order, and\nso we time-average our solution to produce a smooth result, as is also described in\nAppendix A.\nIn the present study, we found it suﬃcient to set the parameter L=20. For all\nthe threshold calculations in this paper, we found using M =5001 grid points in the\ny-direction and N =32 equations to be the minimum values needed to give consistent\nThresholds for the formation of satellites in two-dimensional vortices 391\n0.10\n(a) (b)\n0.08\n0.06\n0.04\n0.02\n0\n–0.02\n0.05\n0\n–0.05\n–0.10\n–10 –5 0\ny\n5 10 –10 –5 0\ny\n5 10\nζ∞\nFigure 3. Figures of ζ¯ (y, t =40) (solid lines) and ζ¯∞(y) (dotted lines) given by (3.8) for\n(a) (Γ,\f)= (0, 0.3) and (b) (Γ,\f)= (0.3, 0.3).\nresults. For nonlinear calculations (i.e. larger Γ and \f) just above the threshold for\nsatellite formation these should be increased to M =8001 and N =128.\nFigure 3 shows two results of the numerical solution of (2.13)–(2.15) when the initial\ncondition parameters Γ and \f are both real. The correction to the mean azimuthal\nproﬁle ζ¯ (y) is plotted at t =40 and compared with the ζ¯∞(y) result in (3.8) for\n(a) (Γ,\f)= (0, 0.3) and (b) (Γ,\f)= (0.3, 0.3). For both cases, the numerical solution\n(solid line) and the asymptotic model (dotted line) are in very good agreement with one\nanother showing that the numerical code works correctly. The small diﬀerence between\nthe two methods is due to higher-order terms of the small-amplitude expansion, and\nthis diﬀerence increases as the parameters Γ and \f are increased towards the threshold\nvalues and beyond.\nFigures 4 and 5 show typical results from the numerical solution of (2.13)–(2.15).\nFigure 4 shows |ϕˆ| on a log scale as a function of t for three runs with (Γ,\f)= (0.2, 0.7)\nfor curve 1, (Γ,\f)= (0.4, 0.9) for curve 2 and (Γ,\f)= (0.4, 1.1) for curve 3. The\nparameter values for curve 1 correspond to a case where |ϕˆ| decays to very small\nvalues very quickly, and never increases again at large times. This is a weak initial\ncondition run, where the vortex would return to an axisymmetric state and the\nperturbation would wind up. Curve 3 in ﬁgure 4 is a run with a strong initial\ncondition for which |ϕˆ| rises in value after an initial period of decay and then\noscillates about |ϕˆ|=0.01. This corresponds to a case where satellites form in the\ncritical layer, as can be seen in the total vorticity plot in ﬁgure 5(b). In this plot we\ncan see the total vorticity ζT = y + ζ winding around inside the satellites, and that\nowing to the introduction of a non-zero Γ , these satellites are no longer situated at\ny =0 as they would be if Γ =0 (see ﬁgure 16 of BLSY). Curve 2 in ﬁgure 4 represents\na case between the other two, where |ϕˆ| does rise after an initial period of decay, but\nit does not oscillate around quite as rapidly as curve 3. The total vorticity for curve 2\nat t =60 can be seen in ﬁgure 5(a). This plot again shows the vorticity winding around\nin the critical layer, but in this case the winding is not so clear, and also there is some\nbreaking up of the ﬂow in the centre of the satellite. We shall see later that this case\nlies on the threshold between persistent satellites and decaying solutions. These three\nparameter values are plotted as the stars in ﬁgure 2 of § 3.\nThe study of BLSY determines whether or not generated cat’s eyes persist or decay\naway by considering the ‘ﬁrst bounce’ in the streamfunction, |ϕˆ(t)|. The ﬁrst bounce\n392 M. R. Turner and A. D. Gilbert\n102\n100\n|\u0004ˆ|\n10–2\n10–4\n10–6\n10–8\n10–10\n10–120 10 20 30 40 50 60 70\nt\n1\n2\n3\nFigure 4. Plot of |ϕˆ(t)| for three typical numerical solutions of (2.13)–(2.15) with\n(Γ,\f)= (0.2, 0.7) for curve 1, (Γ,\f) = (0.4, 0.9) for curve 2 and (Γ,\f)= (0.4, 1.1) for curve 3.\n1(a)\n0\n0\n–π\/2 π\/2\n1.5(b)\n–1.5\n0\n–π\/2 π\/2\ny\nFigure 5. Grey-scale pictures of the total vorticity ζT = y+ζ for (a) (Γ,\f) = (0.4, 0.9) and (b)\n(Γ,\f)= (0.4, 1.1). These snapshots are taken at t =60 in (a) and t =40 in (b) where positive\nvorticity is white and negative vorticity is black. Note that the vertical scales are diﬀerent, and\nthat the whole y domain is not displayed.\nis the position of the ﬁrst maximum in the streamfunction that occurs after the\ninitial exponential decay. The position of the ﬁrst bounce is depicted by the arrows\nin ﬁgure 6. When \f \u0003 0.1, |ϕˆ(t)| is a smooth function (see the solid line in ﬁgure 6),\nand so measuring the position of the ﬁrst bounce is simple. However, when \f is\nsmall and Γ is moderately large (see dashed line in ﬁgure 6), then there is a feedback\nfrom the vorticity in the critical layer to the streamfunction and vice versa. Thus,\n|ϕˆ(t)| contains oscillations and so calculating the position of the ﬁrst bounce is more\ncomplicated. For this case, a ﬁrst bounce ﬁt is done by eye rather than by calculating\nthe position of this turning point in the time-averaged streamfunction.\nIn their study, BLSY use as a criterion that if the ﬁrst bounce occurs after t =45\nthen cat’s eyes do not persist. This time value places an upper bound on the threshold\ncontour and avoids numerical error which can accumulate in long-time integrations\nwith small values of ϕˆ. As we ﬁnd that our results are insensitive to the precise\nThresholds for the formation of satellites in two-dimensional vortices 393\n0 10 20 30 40 50\nt\n101\n100\n|\u0004ˆ|\n10–1\n10–2\n10–3\n10–4\n10–5\nFigure 6. Plot of |ϕˆ(t)| on a log scale for (Γ,\f) = (0, 1) (solid line) and (Γ,\f) = (1.25, 0.05)\n(dashed line). The arrows denote the ﬁrst bounce as deﬁned in BLSY.\nchoice of this cutoﬀ time, we adopt this same criterion for our study. To calculate the\nthreshold curve for this diagnostic with Γ and \f real, we reduce \f for a ﬁxed Γ until\nthe ﬁrst bounce occurs after t =45. This will generate a contour in the (Γ,\f)-plane\nwithin which satellites decay and outside which they persist.\nThe ﬁrst bounce threshold described above is plotted as contour 3 in ﬁgure 2\nalong with the inﬂection point threshold (contour 1) and the neutral mode threshold\n(contour 2). We see that the ﬁrst bounce threshold gives a much smaller region of\nthe parameter space where satellites decay, although the shape of this contour is very\nsimilar to that of the neutral mode threshold and the diﬀerence between the two\nis only roughly a factor of 2. The point on the contour where Γ =0 (\f \u000b 0.97)\nagrees exactly with the value for an instantaneous kick (T =0) in ﬁgure 13 of BLSY.\nAlthough increasing the cutoﬀ time t =45 used in our criterion will bring the contour\nin slightly, the numerical evidence from simulations of (2.13)–(2.15) is that the eﬀect\nis very minor, the position of the contour is insensitive to this choice and that for\ndisturbances inside this contour the streamfunction ultimately decays. In the next\nsection, we examine this statement further by running full nonlinear simulations of\nthe Navier–Stokes equations and comparing the results to the threshold given by the\nasymptotic model.\n5. Comparison with Navier–Stokes simulations\nIn § 4, we calculated the ﬁrst bounce threshold in parameter space using the\nasymptotic theory of BLSY, within which satellites decay and the vortex returns to an\naxisymmetric state and outside which they persist and the vortex remains elliptical.\nIn this section, we form a link from the parameter values in this asymptotic method\nto the parameter values related to full Navier–Stokes simulations in (1.1), (1.3) and\n(1.4). Our simulations will show that there is a region of parameter space where the\nasymptotic model agrees well with the full numerical simulations, and outside this\n394 M. R. Turner and A. D. Gilbert\n0.02\n0.04\n0.06\n0.08\n0 0.5 1.0 1.5 2.0\nΩ0\nr\nFigure 7. Plot of the vorticity proﬁle (1.3) for σ =0.7, 0.8, 0.9 and 1 represented by the\nsolid, dashed, dotted and dot-dashed lines, respectively.\nregion, where the agreement is not so good, we oﬀer explanations as to why this is\nthe case. We ﬁx m=2 in what follows, with the critical layer at r2 =\n√\n2.\nIn the full simulations we solve the Navier–Stokes equations using a numerical\nscheme which incorporates 128 even Fourier modes in the azimuthal θ direction\nand a ﬁnite diﬀerence method consisting of 1500 points in the radial r direction.\nThe code integrates the time derivative and the diﬀusive term together using a\nCrank–Nicolson scheme, while the nonlinear terms are incorporated explicitly via\nthe Adams–Bashforth method. For more information on this numerical scheme see\nTurner & Gilbert (2007). The initial condition used in the simulations is given by\n(1.1) where Z0(r) is as in (1.3), but here we write\nZ2(r) =\nra\n4π\n1 − tanh ((r2 − σ 22 ) \/(4(1 − σ2)))\n1 + tanh\n(\nσ 22 \/(4(1 − σ2))\n) , (5.1)\nwhere\na =\n1\n2(1 − σ2)\n(\n1 + tanh\n(\n1 + σ2\n4\n))\n. (5.2)\nThis is because now the maximum value of Z2(r) occurs at r =1 for all σ2, which\nimproves the comparison with the asymptotic theory as the position of the maximum\nof Z2(r) now agrees with that of g(r) in (B 2). However, this form of Z2(r) is only\nappropriate for σ2 > 0.65 because then a > 2 and the function Z2(r) is relatively\nsmooth at the origin.\nThe parameter σ in (1.3) is chosen close to 1 so that the vortex resembles a Rankine\nvortex plus a small asymptotic skirt \u0006ZS(r) as in (1.5). Thus when calculating \u0006ZS at\nthe critical layer r = r2, outside the core of the vortex, we identify this with Z0(r2).\nFigure 7 plots the vorticity proﬁle (1.3) with σ =0.7, 0.8, 0.9 and 1 showing that as\nσ approaches 1, the proﬁle tends to a Rankine vortex. The two parameters δ and σ2\nin (1.3) and (5.1) are linked to the asymptotic parameters Γ and \f via (2.7). For a\nThresholds for the formation of satellites in two-dimensional vortices 395\n–30\n–25\n–20\n–15\n–10\n–5\n0 5000 10 000 15 000 20 000 25 000 30 000\nln|Q2|\nt\nFigure 8. Plot of |Q2(t)| for σ = σ2 = 0.78 and δ=0.037 (solid line) and δ=0.111 (dotted\nline). The solid line is a case where the satellites decay and the vortex becomes axisymmetric,\nand the dotted line is a case where the satellites persist.\nﬁxed value of σ2, varying δ moves us along a straight line in the (Γ,\f)-plane, whereas\nchanging σ2 varies the angle between this straight line and the line Γ =0.\nFor the numerical simulations presented here, we set σ2 = σ and vary σ . For each\nσ , we ran our numerical simulation for various values of δ, and by considering the\nmagnitude of the second multipole moment Q2(t) where, in general,\nQm(t) =\n∫ ∞\n0\nrm+1ζm dr, (5.3)\nwe were able to determine whether satellites persist, signalled by |Q2(t)| not decaying.\nBy way of illustration, ﬁgure 8 plots ln |Q2(t)| for σ = σ2 = 0.78 and δ=0.037 (solid\nline) and δ=0.111 (dotted line). The solid line is a case where |Q2| decays and\nthe perturbation decays, while the dotted line is a case where |Q2| oscillates and\nthe satellites persist. All of the numerical simulations were run with a Reynolds\nnumber R =107, which at ﬁrst sight appears large enough to ensure that the results\nare inviscid for practical purposes. However, as we will see shortly, this Reynolds\nnumber maps to the eﬀective Reynolds number, Reﬀ, for the asymptotic theory which\nin certain parameter ranges may no longer be large enough to guarantee that the\nevolution is practically inviscid on the (short) spatial and (long) temporal scales of\nthe critical layer.\nFigure 9 plots Z′0(r2) against δ, where our full Navier–Stokes simulations are\nrepresented by points in this plane. The solid line indicates the asymptotic result\ngiven by contour 3 in ﬁgure 2, and Z′0(r2) ≡ \u0006Z′S(r2) is the small parameter from\nthe BLSY theory. The squares in ﬁgure 9 represent runs where the amplitude of the\nmultipole moment Q2(t) decays suﬃciently that the vortex enters a regime that is\ngoverned by the core of the vortex (Bassom & Gilbert 1998) (see solid line in ﬁgure 8)\nand hence would not then grow at a later time. The circles represent runs where the\namplitude of the multipole moment has not started to decay after a suﬃciently long\n396 M. R. Turner and A. D. Gilbert\n0\n0.05\n0.10\n0.15\n0.20\n0.05\n0.01 0.02 0.03 0.04\nZ ′0(r2)\nδ\nFigure 9. Plot of δ as a function of Z′0(r2). The circles depict simulations where |Q2(t)| persists,\nand the squares where it decays. The solid line represents contour 3 in ﬁgure 2, inside which\nthe nonlinear perturbation decays.\nrun (up to t =5× 104). We see that the agreement between the numerical simulations\nand the asymptotic theory improves as the small parameter Z′0(r2) decreases, which is\nas expected because this value is equivalent to the small parameter \u0006 in the asymptotic\ntheory. Note that the range of good agreement occurs for Z′0(r2)\u0004 0.021 (σ \u0002 0.8);\nby examining the vorticity proﬁles in ﬁgure 7, we can see that the σ =0.8 proﬁle is\nactually quite broad and thus this asymptotic theory agrees well with the numerical\nsimulations for reasonably broad vortices as well as ones with sharper edges. However,\nfor Z′0(r2)\u0004 0.0132 (or σ \u0002 0.84), we ﬁnd that the good agreement begins to evaporate:\nat parameter values where satellites should persist according to the asymptotic model,\nthe full simulation shows decay. This can be explained by considering the Reynolds\nnumber R from the full numerical simulations and the eﬀective Reynolds number\nof the asymptotic theory Reﬀ based on the spatial and temporal scales in the critical\nlayer; these both conspire to make Reﬀ much less than R for small \u0006. More speciﬁcally,\nthese two quantities are related via the expression\nR−1eﬀ = R\n−1 \u0006−3L−2T, (5.4)\nwhere L and T are the length and time scales given in (B 7) of Appendix B (Hall\net al. 2003b). When the limiting compact vortex is the Rankine vortex, as for our\nsimulations, we obtain\nR−1eﬀ =\n8\n√\n2R−1\nπ2|Z′0(r2)|3 . (5.5)\nThe eﬀective Reynolds number for the case when R =107 is plotted in ﬁgure 10. For\nthe values of 0.016<Z′0(r2)< 0.021, we obtain good agreement between the numerical\nsimulations and the asymptotic theory (see ﬁgure 9) and we see from ﬁgure 10 that the\neﬀective diﬀusivity R−1eﬀ is reasonably small in this region. Thus, any diﬀusive eﬀects\nThresholds for the formation of satellites in two-dimensional vortices 397\n0\n0.2\n0.4\n0.6\n0.8\n0.01 0.02 0.03 0.04\nR–1\neff\nZ ′0(r2)\nFigure 10. Plot of the eﬀective diﬀusivity, R−1eﬀ as a function of Z′0(r2) for R =107.\ndue to the critical layer being very thin are small, and the results are the same as the\nasymptotic theory in § 4, where we ﬁxed Reﬀ =105. For Z′0(r2) > 0.021, R−1eﬀ decreases\nfurther and so the reason for the disagreement between the results in ﬁgure 9 in this\nregion is not due to diﬀusive eﬀects, but is simply that our vorticity proﬁle Z0(r)\nis no longer close enough to the asymptotic limit of Rankine vortex plus a skirt of\nvanishing strength.\nHowever, as we decrease Z′0(r2) from 0.016, our vorticity proﬁle becomes much\nmore like a Rankine vortex plus a skirt, so we expect our full simulations to agree\nbetter with the asymptotic theory. Unfortunately because the critical layer becomes\nthinner, the eﬀective Reynolds number decreases and diﬀusive eﬀects become more\nsigniﬁcant. This problem can be overcome by increasing the Reynolds number R of\nthe full simulation. When a simulation plotted in ﬁgure 9 shows persisting satellites,\nwe observe that increasing R does not make them decay, but it can make a decaying\nsimulation grow or persist by making the problem more inviscid. Results of the full\nsimulation with R =108, 109 and 1010 show that the decay observed above the solid\nline in ﬁgure 9 for Z′0(r2) < 0.016 appears to turn into persistence and growth, while\nthe parameter values below the line still give decay. However, at these large Reynolds\nnumbers, the full numerical simulation could not be run for the same length of time\nas the R =107 case; although we could not verify that these results would persist to\nthe same accuracy as in ﬁgure 9, the evidence we have does suggest this is the case.\nOverall, we believe that our numerical results indicate that the asymptotic theory is\ncorrect, and discrepancies for very sharp vortices are down to the limits of running\nsimulations at suﬃciently high Reynolds numbers.\nIn the asymptotic theory, the sign of vorticity in the critical layer is of secondary\nconsideration as the constant Γ0 in (2.5) has no inﬂuence on the dynamics. Thus when\nsatellites are formed they could equally well be positive, cat’s eyes or negative satellites\ngiving a tripole, depending on the value of Γ0. We note that a similar issue arises\nin the Navier–Stokes simulations, as a constant can be added to the initial vorticity\n398 M. R. Turner and A. D. Gilbert\n3\nt = 0 t = 2000\n(a)\ny\n–3\n3\nt = 4000 t = 6000\n(c)\n(b)\n(d)\ny\n–3\n–3 3\nx\n–3 3\nx\nFigure 11. Plot of the vorticity Z showing persistent negative satellites for σ = σ2 = 0.8 and\nδ=0.2212. The vorticity is capped at |Z|=0.0001 (white), zero vorticity appears as grey and\nnegative vorticity is black.\nproﬁle, corresponding to working in a rotating frame. This has led us to conclude that\nboth a tripole and a vortex with cat’s eyes amount to the same nonlinear structure,\nbut the sign of the vorticity in the satellites is entirely dependent on the average level\nof vorticity around the critical layer initially.\nWe highlight this below with a typical Navier–Stokes simulation. The form of the\ninitial vorticity proﬁle (1.1) is that of a positive elliptical core with two negative regions\nof vorticity above and below the core (with m=2), this can be seen in ﬁgure 11(a).\nFigure 11 shows the evolution of an initial vorticity distribution with σ2 = σ =0.8\nand δ=0.2212. This case is one which has persistent satellites. The vorticity plotted\nis capped at |Z|=10−4. The positive vorticity is white in the ﬁgure, grey signiﬁes zero\nvorticity and the black regions are regions of negative vorticity. We see in ﬁgure 11\nthat the satellites do persist for long times, and the vorticity in the critical layer\nincludes negative inclusions (depicted as black). This means that this is a tripole with\na positive core and two negative satellites rotating around it as in ﬁgure 1. However,\nadding on the constant Zmin to the initial proﬁle (1.1), where Zmin is the minimum\nvorticity in the run depicted in ﬁgure 11, would produce a vortex with the same\nstructure as in ﬁgure 11 except the black regions would now correspond to regions\nof positive vorticity. Note that we could add on a constant globally, or just locally\nwithin the critical layer by modifying the initial proﬁle.\nThe simulation with δ=0.2212 in ﬁgure 11 is well above the threshold for persistent\nsatellites, as can be seen in ﬁgure 9. For simulations just above the threshold for\npersistence, the satellites are very thin and viscous eﬀects come into play: in a plot\nThresholds for the formation of satellites in two-dimensional vortices 399\nsimilar to ﬁgure 11, it would be diﬃcult to see the sign of the vorticity in the critical\nlayer, and so whether there are positive or negative satellites present.\n6. Conclusions\nIn this paper we have studied the evolution of a sharp-edged vortex with an additive\nperturbation via both asymptotic and numerical methods. We adapt the asymptotic\ntheory of BLSY so that we can stipulate an initial amplitude of mode m vorticity\nin the critical layer and an initial streamfunction amplitude of the perturbation. In\nthe case when these two parameters are real we were able to construct a contour in\nthis parameter space, within which the streamfunction decays in time and the vortex\nreturns to an axisymmetric state and outside which the vortex remains elliptical\nand a satellite structure persists in the vortex. The results from this paper were all\nconstructed with Z2(r) real, and hence Γ and \f real, to agree with the studies of\nRossi et al. (1997) and Barba & Leonard (2007), but could be extended to cover the\nfull three-dimensional parameter space. Also, it should be noted that these results\nare universal in that they apply to any family of vortices for which the BLSY theory\nbecomes valid, in other words which asymptotically have the structure of a compact\nvortex supporting a normal mode, plus a weak skirt of vorticity. Thus by considering\nthe family of compact vortices in BLSY, we could calculate Γ and \f, via (B 10) and\n(B 13), for the Gaussian proﬁles used by Rossi et al. (1997) and Barba & Leonard\n(2007), and hence qualitatively verify their results.\nWe compared our ﬁrst bounce threshold from the nonlinear study to two thresholds\nbased on weakly nonlinear theory, an inﬂection point threshold and a neutral mode\nthreshold. The inﬂection point threshold was very crude and did not agree well with\nthe ﬁrst bounce threshold; however, the neutral mode threshold agreed in shape with\nthe ﬁrst bounce threshold and was only out by a factor of two in magnitude.\nThe ﬁrst bounce threshold was compared to full numerical simulations of\nthe Navier–Stokes equations. These simulations showed that as our core vortex\napproached a Rankine vortex plus an asymptotic skirt the numerical results agree\nwell with the asymptotic results while the eﬀective Reynolds number was large. The\nNavier–Stokes simulations, like the BLSY model, are unaﬀected by the addition\nof a constant of vorticity initially. This has led us to conclude that these satellite\nstructures successfully describe both multipole and cat’s eye vortices, i.e these two\ntypes of vortices are essentially the same, except their azimuthal averaged proﬁles\nwill be diﬀerent (Barba & Leonard 2007; Turner & Gilbert 2007). In the context of\ngeophysical applications and two-dimensional turbulence, sharp-edged vortices are\ncommonplace and our study indicates that the thresholds for the formulation of\ntripole structures will tend to be low in cases when the critical layer lies beyond\nthe sharp edge. Of course, continual external forcing of such vortices is likely to\nlead generally to a more complex vorticity structure in the layer, and a ‘surf zone’\ncan occur (Thuburn & Lagneau 1999). The enhanced mixing that occurs in such\nzones can, in turn, sharpen up the edge of the vortex, and this interaction of mixing\nand proﬁle evolution is currently under investigation in random and deterministic\ncontexts.\nThis work was undertaken on the EPSRC grant EP\/D032202\/1. We would also\nlike to thank Lorena Barba, Andrew Bassom and John Thuburn for useful comments\nin the preparation of this paper. A. D. G. was the recipient of a Leverhulme Trust\nResearch Fellowship during this study.\n400 M. R. Turner and A. D. Gilbert\n0.0002\n0.0004\n0.0006\n0.0008\n0.0010\n0.0012\n0.0014\n0.0016\n0.0018\n5 10 15 20 25\nt\n|\u0004ˆ|\nFigure 12. Plot of |ϕˆ(t)| for (Γ,\f) = (0, 1). The dotted line shows the results before time\naveraging and the solid line after time averaging.\nAppendix A. Asymptotic form of the integral in (2.14) outside\nof y ∈ [−L,L]\nIn this Appendix we show how the large-y asymptotic solutions to (2.13)–(2.15) are\nused to approximate the contribution to the integral 〈ζ ′2〉 in (2.14) from outside the\ndomain y ∈ [−L,L]. To calculate the correction terms to this integral outside this\ndomain up to O(L−1), we require the O(y−2) terms in (4.3). These can be calculated\neasily and give\nζ ′2 ∼ −βϕˆy +\nβ(\f − iπΓ\/2)e−2iyt\ny\n− iβϕˆt\n2y2\n−2t\n2ϕˆ2Γ ∗e2iyt\ny2\n− iβ\n2π\n2y2\n(\n\f − iπΓ\n2\n)\ne−2iyt . (A 1)\nWhen substituted into (2.14) this leads to\n〈ζ ′2〉 = 〈ζ ′2〉L − iLϕˆt − 2i(1 − β\n2πt)\n(\n\f − iπΓ\n2\n)∫ ∞\nL\nsin(2yt)\ny\ndy\n− β2π\n(\n\f − iπΓ\n2\n)\ncos(2Lt)\nL\n+ O(L−2), (A 2)\nwhere 〈〉L is the principal value integral evaluated between y = − L and L. This\napproach is equivalent to that in Appendix A of BLSY; however, in this case, the\nnon-zero initial conditions produce a more complicated expression.\nThe inclusion of these correction terms in (2.14) eliminates the oscillations that\noccur in the numerical solution of ϕˆ at leading order. However, oscillations remain\nat the order of L−2, and we have not tried to eliminate these completely because it\nwould require many correction terms. Thus, to produce a smooth function of ϕˆ(t),\nfor plotting and calculation purposes, we time average the solution over the period\nπ\/L of the oscillations. As an example, plots of |ϕˆ(t)| with (Γ,\f)= (0, 1) with and\nwithout time-averaging are shown in ﬁgure 12. As L is increased, the period of the\nThresholds for the formation of satellites in two-dimensional vortices 401\noscillations reduces as O(L−2), as does the amplitude at the same rate; however, it is\nnot practical to remove the oscillations this way as this requires an increase in the\nnumber of mesh points in the y-direction which increases the running time of the\ncode making it numerically impractical. We found that varying L produces consistent\ntime-averaged results.\nAppendix B. Asymptotic theory\nIn this Appendix, we give a brief overview of quantities from the derivation of the\nasymptotic theory used in the paper, in particular (B 10), (B 13) and (B 24). See BLSY\nfor more detailed information. We seek an asymptotic solution for the total vorticity\nZ of the Navier–Stokes equation in the form\nZ(r) = ZC(r) + \u0006ZS(r) + \u0006\n2ζ 0 + \u00063ζ 1 + · · · . (B 1)\nThe quantity ZC(r) is the vorticity proﬁle of a compact vortex, which we take to be\na Rankine vortex in the main paper, ZS(r) is an asymptotic skirt and \u0006 \u0011 1. In the\nmain body of the paper, the quantity ZC(r) + \u0006ZS(r) is combined into the full proﬁle\nZ0(r), which is the tanh proﬁle for our full simulations.\nWe consider perturbations to the compact vortex: such a vortex may support a\nfamily of (undamped) Kelvin waves, at most one for each mode m. Each Kelvin wave\nhas a critical radius rm, where the vortex and the ﬂuid co-rotate with angular frequency\nωm. We let the functions f (r) and g(r) be the corresponding linear perturbations to\nthe streamfunction and vorticity. For the Rankine vortex these are\nfm(r) =\n{\n(rmr)\nm (r < 1),\n(rm\/r)\nm (r > 1),\ngm(r) = −2mrmmδ(r − 1). (B 2)\nOutside the critical layer at r = rm, the solution is the Kelvin wave with a complex\namplitude that evolves, slowly, according to the behaviour in the critical layer,\n[ψ0, ζ 0] = a(ϑ, τ )[f (r), g(r)]. (B 3)\nHere ϑ = θ − ωmt , τ = \u0006t is a slow time scale and a(ϑ, τ )= aˆ(τ )eimϑ + c.c. is the\namplitude function, where rm =(m\/(m − 1))1\/2. In deriving (2.1)–(2.4) the following\nquantities appear\nI1 = −\n∫ RC\n0\nrfg\nmrmΩ˜C\ndr, Ω˜C ≡ ΩC(r) − ΩC(rm), (B 4)\nwhere RC is the radius of the compact vortex, beyond which ZC =0.\nThe gradient of the vorticity inside the critical layer scales as\nβ ≡ sgn (μm) = −sgn(Z′S(rm)), (B 5)\nwhere\nμm ≡ Z\n′\nS(rm)\nrmΩ˜\n′\nC(rm)\n. (B 6)\nWhen β = − 1, the vortex has a positive skirt and hence gives unstable solutions. As\nwe are interested only in stable solutions, we set β =1 in this study. The system has\na second rescaling by introducing the space and time scales\nL ≡ − |μm|I1Ω˜ ′C(rm)\n, T ≡ I1|μm| . (B 7)\n402 M. R. Turner and A. D. Gilbert\nTo determine the constants Γ and \f in terms of δ and Zm(r), consider the initial\nvorticity distribution of the fully nonlinear Navier–Stokes simulations\nZ = ZC(r) + \u0006ZS(r) + δZm(r)e\nimθ + c.c., (B 8)\nwhere δ and the form of the mode Zm(r) determine the values of Γ and \f. In this\nAppendix, we show how these parameters are related to the parameter δ of the fully\nnonlinear problem. In the critical layer, at t =0, we compare the expansion (B 8)\nwith\nZ = ZC(r) + \u0006ZS(r) + \u0006\n2ζ 0(r, θ) + \u00063ζ 1(r, θ) + · · · . (B 9)\nOmitting some details on the scalings (to be found in BLSY), when this is rescaled,\nwe ﬁnd the amplitude of the mode m in the critical layer to be\nΓ =\nT\nrm|μm| \u0006\n−2δZm(rm) =\nrmI1Ω˜ ′2C (rm)\n\u00062Z′2S (rm)\nδZm(rm). (B 10)\nOutside the critical layer, we compare (B 8) at t =0 with the expansion\nZ = ZC(r) + \u0006ZS(r) + \u0006\n2aˆ(0)g(r)eimθ + c.c. + · · · , (B 11)\nwhere the function g(r) for a Rankine vortex is deﬁned in (B 2). At leading order,\nwe can neglect the eﬀect of the skirt and just consider perturbations to the compact\nvortex Z=ZC . The initial perturbation δZm(r)e\nimθ will excite the normal mode by\nan amount we call δPm and it will also excite the continuous spectrum. The latter\nperturbations will wind up and become ﬁnely scaled on the fast t-time scale, and\nhence are irrelevant. However, the perturbation to the normal mode will evolve on\nthe slow τ -time scale and so will be signiﬁcant.\nIt is suﬃcient to write the initial condition as\naˆ(0) = \u0006−2δPm, (B 12)\nwhere Pm is the projection onto the normal mode, to be determined shortly. Rescaling\nthis initial condition we ﬁnd\n\f = ϕˆ(0) =\nT\nrmL aˆ(0) = −\nrmI21Ω˜ ′3C (rm)\n\u00062Z′2S (rm)\nδPm. (B 13)\nTo ﬁnd the value of the projection Pm, we consider the linearized form of the\nNavier–Stokes equation by writing\nζ = ζ0(r) + ζm(r, t)e\nimθ , ψ = ψ0(r) + ψm(r, t)e\nimθ . (B 14)\nWe then take the Laplace transform of the resulting equation with respect to t , with\nf¯ m(p) =\n∫ ∞\n0\neiptfm(t) dt, fm(t) = − 1\n2π\n∫ −∞+iγ\n∞+iγ\ne−ipt f¯ m(p) dp. (B 15)\nIt can be shown that the Laplace transform of the multipole moment Qm(t) in (5.3)\ncan be written as\nQ¯m(p) = lim\nr0→∞\n− ir\nm\n0\nΨL(r0, p)\n∫ r0\n0\nsΨL(s, p)ζm(s, 0)\nmΩC(s) − p ds, (B 16)\nThresholds for the formation of satellites in two-dimensional vortices 403\n(Schecter et al. 2000; Turner & Gilbert 2007), where ΨL(r, p) satisﬁes the homogeneous\nequation [\n∂2\n∂r2\n+\n1\nr\n∂\n∂r\n− m\n2\nr2\n+\nmZ′C(r)\nr(p − mΩC(r))\n]\nΨL(r, p) = 0, (B 17)\nwith ΨL(0, p)= 0. Here, r = r0 is a large radius, that is taken to be ﬁnite and then\nallowed to tend to inﬁnity. When (B 16) is inverted to ﬁnd Qm(t), the inversion\ncontour is closed around any singularities in the p-plane. These singularities can\noccur because of the normal mode, when ΨL(r0 → ∞, p) vanishes for some p, or\nbecause mΩC(s) − p vanishes for some s in the range 0 to ∞. The second of these\nis the continuous spectrum of the vortex, which may be bent below the real p-axis\nby moving the s-contour above the real s-axis in (B 16) (Briggs et al. 1970; Schecter\net al. 2000).\nExamining (B 17) shows that this is exactly the equation satisﬁed by the functions\nf (r) and g(r), and thus the solution for the normal mode is p=mωm and\nΨL(r, p)= f (r, p). Now inverting (B 16) by deforming the contour around the\nsingularity at p=mωm only, we ﬁnd that\nQm(t) = −iR\n∫ ∞\n0\nsf (s,mωm)ζm(s, 0)\nm(ΩC(r) − ωm) ds e\n−imωmt , (B 18)\nwhere R is the residue at p=mωm,\nR = Res\np=mωm\n[\nlim\nr0→∞\n(\n− ir\nm\n0\nf (r0, p)\n)]\n. (B 19)\nTo calculate Pm from this expression, we calculate Qm(0) for our initial condition\nZm(r) and we divide by Q\nNM\nm (0) for the normal mode, where ζm(r, 0) is replaced by\ng(r) and the corresponding projection Pm =1 by deﬁnition. We ﬁnd that\nQNMm (0) = iRrmI1, (B 20)\nand thus\nPm = −I−11\n∫ ∞\n0\nsf (s)Zm(s)\nmrmΩ˜C(s)\nds, (B 21)\nwhere the contour of integration is bent above the singularity at rm given by\nΩ˜C(rm)= 0. As we have bent the contour above the pole at rm, we can write the\nexpression for Pm as a principal value integral plus a contribution from the pole,\nPm = −I−11\n(\nPV\n∫ ∞\n0\nsf (s)Zm(s)\nmrmΩ˜C(s)\nds − iπ\nm\nZm(rm)\nΩ˜ ′C(rm)\n)\n. (B 22)\nHowever, we realize that the imaginary part here looks familiar: on its own, when\ninserted into \f in (B 13), it gives a term\n− iπ\nm\nrmI1Ω˜ ′2C (rm)\n\u00062Z′2S (rm)\nδZm(rm). (B 23)\nFor m=2, this is precisely −iπ\/2 times the quantity Γ and what we are recovering\nis the initial delta-function forcing of the quasi-mode amplitude \f by the vorticity in\nthe critical layer, a quantity we disentangled in (2.15). This is a useful check, but to\navoid accounting for this twice, we delete the imaginary part of Pm to leave as our\n404 M. R. Turner and A. D. Gilbert\ndeﬁnition\nPm = −I−11 PV\n∫ ∞\n0\nsf (s)Zm(s)\nmrmΩ˜C(s)\ndr. (B 24)\nwhich in the case of the Rankine vortex amounts to (2.8).\nREFERENCES\nBajer, K., Bassom, A. P. & Gilbert, A. D. 2001 Accelerated diﬀusion in the centre of a vortex.\nJ. Fluid Mech. 437, 395–411.\nBalmforth, N. J., Llewellyn Smith, S. G. & Young, W. R. 2001 Disturbing vortices. J. Fluid\nMech. 426, 95–133 (referred to herein as BLSY).\nBarba, L. A. 2006 Self-organization of vortex multipoles at high Reynolds number. Phys. Rev. E\n73, 065303(R).\nBarba, L. A. & Leonard, A. 2007 Emergence and evolution of tripole vortices from net-circulation\ninitial conditions. Phys. Fluids 19 (1), 017101.\nBassom, A. P. & Gilbert, A. D. 1998 The spiral wind-up of vorticity in an inviscid planar vortex.\nJ. Fluid Mech. 371, 109–140.\nBernoff, A. J. & Lingevitch, J. F. 1994 Rapid relaxation of an axisymmetric vortex. Phys. Fluids\n6, 3717–3723.\nBriggs, R. J., Daugherty, J. D. & Levy, R. H. 1970 Role of Landau damping in crossed-ﬁeld\nelectron beams and inviscid shear ﬂow. Phys. Fluids 13, 421–432.\nCarton, X. & Legras, B. 1994 The life-cycle of tripoles in two-dimensional incompressible ﬂows.\nJ. Fluid Mech. 267, 53–82.\nDritschel, D. G. 1989 On the stabilization of a two-dimensional vortex strip by adverse shear.\nJ. Fluid Mech. 206, 193–221.\nDritschel, D. G. 1998 On the persistence of non-axisymmetric vortices in inviscid two-dimensional\nﬂows. J. Fluid Mech. 371, 141–155.\nFornberg, B. 1977 A numerical study of 2-D turbulence. J. Comput. Phys. 25, 1–31.\nHall, I. M., Bassom, A. P. & Gilbert, A. D. 2003a The eﬀect of ﬁne structure on the stability of\nplanar vortices. Eur. J. Mech. B.\/Fluids 22, 179–198.\nHall, I. M., Bassom, A. P. & Gilbert, A. D. 2003b The eﬀect of viscosity on the stability of planar\nvortices with ﬁne structure. Q. J. Mech. Appl. Maths 56 (4), 649–657.\nHeijst, G. J. F. van, Kloosterziel, R. C. & Williams, C. W. M. 1991 Laboratory experiments on\nthe tripolar vortex in a rotating ﬂuid. J. Fluid Mech. 225, 301–331.\nKoumoutsakos, P. 1997 Inviscid axisymmetrization of an elliptical vortex. J. Comput. Phys. 138,\n821–857.\nLe Dize`s, S. 2000 Non-axisymmetric vortices in two-dimensional ﬂows. J. Fluid Mech. 406, 175–198.\nLegras, B. & Dritschel, D. 1993 Vortex stripping and the generation of high vorticity gradients\nin two-dimensional ﬂows. Appl. Sci. Res. 51, 445–455.\nLlewellyn Smith, S. G. 1995 The inﬂuence of circulation on the stability of vortices to mode-one\ndisturbances. Proc. R. Soc. Lond. A 451, 747–755.\nMacaskill, C., Bassom, A. P. & Gilbert, A. D. 2002 Nonlinear wind-up in a strained planar\nvortex. Eur. J. Mech. B.\/Fluids 21, 293–306.\nMcWilliams, J. C. 1984 The emergence of isolated coherent vortices in turbulent ﬂow. J. Fluid\nMech. 146, 21–43.\nMelander, M. V., McWilliams, J. C. & Zabusky, N. J. 1987 Axisymmetrization and vorticity-\ngradient intensiﬁcation of an isolated two-dimensional vortex through ﬁlamentation. J. Fluid\nMech. 178, 137–159.\nMo¨ller, J. D. & Montgomery, M. T. 1999 Vortex Rossby waves and hurricane intensiﬁcation in\na barotropic model. J. Atmos. Sci. 56, 1674–1687.\nMorel, Y. G. & Carton, X. J. 1994 Multipolar vortices in two-dimensional incompressible ﬂows.\nJ. Fluid Mech. 267, 23–51.\nPingree, R. D. & Le Cann, B. 1992 Anticyclonic eddy X91 in the southern bay of Biscay, May\n1991 to February 1992. J. Geophys. Res. 97, 14 353–14 367.\nThresholds for the formation of satellites in two-dimensional vortices 405\nRossi, L. F., Lingevitch, J. F. & Bernoff, A. J. 1997 Quasi-steady monopole and tripole attractors\nfor relaxing vortices. Phys. Fluids 9 (8), 2329–2338.\nSchecter, D. A., Dubin, D. H. E., Cass, A. C., Driscoll, C. F., Lansky, I. M. & O’Neil, T. M.\n2000 Inviscid damping of asymmetries on a two-dimensional vortex. Phys. Fluids 12 (10),\n2397–2412.\nThuburn, J. & Lagneau, V. 1999 Eulerian mean, contour integral, and ﬁnite-amplitude wave\nactivity diagnostics applied to a single-layer model of the winter Stratosphere. J. Atmos. Sci.\n56, 689–710.\nTurner, M. R. & Gilbert, A. D. 2007 Linear and nonlinear decay of cat’s eyes in two-dimensional\nvortices, and the link to Landau poles. J. Fluid Mech. 593, 255–279.\nTurner, M. R., Gilbert, A. D. & Bassom, A. P. 2008 Neutral modes of a two-dimensional vortex\nand their link to persistent cat’s eyes. Phys. Fluids 20 (2), 027101-1–027101-10.\n"}