{"doi":"10.1016\/j.ast.2010.08.010","coreId":"140858","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/5787","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/5787","10.1016\/j.ast.2010.08.010"],"title":"Stochastic axial compressor variable geometry schedule optimisation","authors":["Gallar, L.","Arias, M.","Pachidis, Vassilios","Singh, R."],"enrichments":{"references":[{"id":37920914,"title":"A practical method of predicting transonic compressor performance,","authors":[],"date":"1961","doi":"10.1115\/1.3673194","raw":"[28] Swan, S.C., A practical method of predicting transonic compressor performance, Transactions of the ASME, pp. 322-330, July 1961.","cites":null},{"id":37920901,"title":"Adaption in natural and artificial systems,","authors":[],"date":"1975","doi":null,"raw":"[19] Holland, J.H., Adaption in natural and artificial systems, University of Michigan Press, 1975.","cites":null},{"id":37920881,"title":"Airfoil design using a genetic algorithm and an inverse method,","authors":[],"date":"2003","doi":"10.2514\/6.2003-43","raw":"[7] Gardner, B.A. and Selig, M.S., Airfoil design using a genetic algorithm and an inverse method, AIAA 2003-0043, 2003.","cites":null},{"id":37920910,"title":"An improved compressor performance prediction model, ImechE C423\/028,","authors":[],"date":"1991","doi":null,"raw":"[26] Wright, P.I. and Miller, D.C., An improved compressor performance prediction model, ImechE C423\/028, 1991.","cites":null},{"id":37920913,"title":"Analysis of experimental low-speed loss and stall characteristics of two-dimensional compressor blade cascades,","authors":[],"date":"1957","doi":null,"raw":"[27] Lieblein, S., Analysis of experimental low-speed loss and stall characteristics of two-dimensional compressor blade cascades, NACA RM E57A28, 1957.","cites":null},{"id":37920876,"title":"Application of multiobjective optimization to axial compressor preliminary design,","authors":[],"date":"2006","doi":"10.1016\/j.ast.2006.03.007","raw":"[5] Keskin, A. and Bestle, D., Application of multiobjective optimization to axial compressor preliminary design, Aerospace science and technology 10, pp. 581-589, 2006.","cites":null},{"id":37920892,"title":"Automatic aerodynamic design optimisation of turbomachinery components - an industrial perspective.","authors":[],"date":"2004","doi":"10.1115\/2000-gt-0523","raw":"[15] Shahpar, S., Automatic aerodynamic design optimisation of turbomachinery components - an industrial perspective. VKI Lecture Series on Optimisation Methods & Tools for Multicriteria\/Multidisciplinary Design, pp. 1-40, 2004.","cites":null},{"id":37920890,"title":"Biobjective design optimization for axial compressors using Tabu Search,","authors":[],"date":"2008","doi":"10.2514\/1.32794","raw":"[13] Kipouros, T., Jaeggi, D.M., Dawes, W.N., Parks, G.T., Savill, A.M. and Clarkson, P.J., Biobjective design optimization for axial compressors using Tabu Search, AIAA Journal, Vol. 46, No. 3, pp. 701-711, 2008.","cites":null},{"id":37920882,"title":"Cascade airfoil design by multiobjective genetic algorithms, Genetic algorithms in engineering systems: innovations and applications, No 446,","authors":[],"date":"1997","doi":"10.1049\/cp:19971150","raw":"[8] Obayashi, S., Tsukahara, T. and Nakamura, T., Cascade airfoil design by multiobjective genetic algorithms, Genetic algorithms in engineering systems: innovations and applications, No 446, 1997.","cites":null},{"id":37920877,"title":"Components map generation of gas turbine engine using genetic algorithms and engine performance deck data,","authors":[],"date":"2006","doi":"10.1115\/gt2006-90975","raw":"[6] Changduk Kong, J.K. and Lee, C., Components map generation of gas turbine engine using genetic algorithms and engine performance deck data, GT2006-90975, 2006.","cites":null},{"id":37920915,"title":"Compressor IGV off design performance and loss modelling, International Symposium of Air Breathing Engines 2009, Paper 1221,","authors":[],"date":"2009","doi":null,"raw":"[29] Gallar, L., Pachidis, V. and Singh, R., Compressor IGV off design performance and loss modelling, International Symposium of Air Breathing Engines 2009, Paper 1221, 2009. Nomenclature Abbreviations GA Genetic  algorithm IGV Inlet  guide  vane RL Running  line SM Surge  margin VIGV  Variable inlet guide vane VSV  Variable stator vane Greek symbols ߟ Adiabatic  efficiency ߮  Angle of rotation – IGV and VSV settings ߣ Constant  of  proportionality ߨ Pressure  ratio Subscripts 0,1,2  IGV, first or second row of VSV’s respectively * Design  conditions Latin symbols ܽ Axial N Spool  speed NRT  Compressor aerodynamic speed ܰ ξܶ Τ P Total  pressure T Total  temperature U Blade  speed V Flow  absolute  velocity W  Mass flow \/ Flow relative velocity","cites":null},{"id":37920873,"title":"Gas turbine performance (2 nd ed),","authors":[],"date":"1998","doi":"10.1002\/9780470774533","raw":"[1] Walsh P. and Fletcher P., Gas turbine performance (2 nd ed), Blackwell Science Ltd, Oxford, 1998 [2] Despierre, A., Gas turbine combustor design using genetic algorithms, MSc thesis Cranfield University, 1996.","cites":null},{"id":37920888,"title":"Genetic algorithm based optimisation of intercooled recuperated turbofan design,","authors":[],"date":"2003","doi":"10.2514\/6.2003-1210","raw":"[10] Whellens, M.W., Singh, R. and Pilidis, P., Genetic algorithm based optimisation of intercooled recuperated turbofan design, AIAA 2003-1210, 2003.","cites":null},{"id":37920891,"title":"Insight into highquality aerodynamic design spaces through multiobjective optimization, CMES:","authors":[],"date":"2008","doi":null,"raw":"[14] Kipouros, T., Jaeggi, D.M., Dawes, W.N., Parks, G.T., Savill, A.M. and Clarkson, P.J., Insight into highquality aerodynamic design spaces through multiobjective optimization, CMES: Computer Modeling in Engineering & Sciences, Vol. 37, No. 1, pp. 1-44, 2008.","cites":null},{"id":37920906,"title":"Multi-objective Design Optimisation for Axial Compressors,","authors":[],"date":"2005","doi":"10.1007\/978-3-540-31880-4_62","raw":"[25] Kipouros, T., Jaeggi, D.M., Dawes, W., Parks, G.T. and Savill, M., Multi-objective Design Optimisation for Axial Compressors, in 3rd Aerodynamic Design Optimisation Seminar (ADOS 2005), Rolls-Royce plc., UK, 2005.","cites":null},{"id":37920889,"title":"Multiobjective gas turbine engine controller design using genetic algorithms,","authors":[],"date":"1996","doi":"10.1109\/41.538616","raw":"[11] Chipperfield, A. and Fleming, P., Multiobjective gas turbine engine controller design using genetic algorithms, IEEE Trnasactions on industrial electronics, Vol 43, No. 5, 1996 [12] Ghisu, T., Parks, G.T., Jarret, J.P and Clarkson, P.J., Integrated design optimisation of gas turbine compression systems, in 4th AIAA Multidisciplinary Design Optimization Specialist Conference, Schaumburg, Illinois, USA, 2008. AIAA-2008-1979.","cites":null},{"id":37920898,"title":"Numerical methods for unconstrained optimisation and nonlinear equations,","authors":[],"date":"1983","doi":"10.1137\/1.9781611971200","raw":"[16] Dennis, J.E. and Schnabel, R.B., Numerical methods for unconstrained optimisation and nonlinear equations, Prentice Hall, 1983.","cites":null},{"id":37920902,"title":"Particle swarm optimization,","authors":[],"date":"1995","doi":"10.1109\/icnn.1995.488968","raw":"[22] Kennedy, J. and Eberhart, R., Particle swarm optimization,  Proceedings of the IEEE Int. Conf. on Neural Networks, Piscataway, NJ, pp. 1942–1948, 1995.","cites":null},{"id":37920899,"title":"Practical methods of optimisation,","authors":[],"date":"1987","doi":"10.1002\/9781118723203.ch7","raw":"[17] Fletcher, R., Practical methods of optimisation, John Wiley, 1987 [18] Rao, S.S., Engineering optimisation:theory and practice, John Wiley, 1996.","cites":null},{"id":37920875,"title":"Preliminary gas turbine combustor design using a genetic algorithm, International gas turbine and aeroengine congress and exhibition, ASME 97-GT-72,","authors":[],"date":"1997","doi":"10.1115\/97-gt-072","raw":"[3] Despierre, A., Stuttaford, P.J. and Rubini, P.A., Preliminary gas turbine combustor design using a genetic algorithm, International gas turbine and aeroengine congress and exhibition, ASME 97-GT-72, 1997. 0.65 0.7 0.75 0.8 0.85 0.9 0.95 70 75 80 85 90 95 100 R e l a t i v e A d i a b a t i c E f f i c i e n c y ( % ) NRT (%) Datum SM1 SM2 50 60 70 80 90 100 C o r r e c t e d N R T ( % ) NRT (%) SM1 Datum  Aerospace Science and Technology [4] Gaiddon, A. and Knight, D.D., Multicriteria design optimization of integrated three-dimensional supersonic inlets, Journal of propulsion and power, Vol 19, pp. 456-463, 2003.","cites":null},{"id":37920885,"title":"Single and multiobjective optimisation for high fidelity CFD using genetic algorithms, Evolutionary methods for design optimisation and control,","authors":[],"date":null,"doi":null,"raw":"[9] Duvigneau, R. and Visonneau, M. Single and multiobjective optimisation for high fidelity CFD using genetic algorithms, Evolutionary methods for design optimisation and control, 19-21 September, Athens, Greece, 2001.","cites":null},{"id":37920905,"title":"The development of a multi-objective Tabu Search algorithm for continuous optimisation problems,","authors":[],"date":"2008","doi":"10.1016\/j.ejor.2006.06.048","raw":"[24] Jaeggi, D.M., Parks, G.T., Kipouros, T. and Clarkson, P.J., The development of a multi-objective Tabu Search algorithm for continuous optimisation problems, European Journal of Operational Research, Vol. 185, pp. 1192-1212, 2008.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2011-07-01T00:00:00Z","abstract":"The design of axial compressors is dictated by the maximisation of flow\nefficiency at on design conditions whereas at part speed the requirement for\noperation stability prevails. Among other stability aids, compressor variable\ngeometry is employed to rise the surge line for the provision of an adequate\nsurge margin. The schedule of the variable vanes is in turn typically obtained\nfrom expensive and time consuming rig tests that go through a vast combination\nof possible settings. The present paper explores the suitability of stochastic\napproaches to derive the most flow efficient schedule of an axial compressor for\na minimum variable user defined value of the surge margin. A genetic algorithm\nhas been purposely developed and its satisfactory performance validated against\nfour representative benchmark functions. The work carries on with the necessary\nthorough investigation of the impact of the different genetic operators employed\non the ability of the algorithm to find the global extremities in an effective\nand efficient manner. This deems fundamental to guarantee that the algorithm is\nnot trapped in local extremities. The algorithm is then coupled with a\ncompressor performance prediction tool that evaluates each individual's\nperformance through a user defined fitness function. The most flow efficient\nschedule that conforms to a prescribed surge margin can be obtained thereby fast\nand inexpensively. Results are produced for a modern eight stage high bypass\nratio compressor and compared with experimental data available to the research.\nThe study concludes with the analysis of the existent relationship between surge\nmargin and flow efficiency for the particular compressor under scrutiny. The\nstudy concludes with the analysis of the existent relationship between surge\nmargin and flow efficiency for the particular compressor under scrutiny","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140858.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.ast.2010.08.010","pdfHashValue":"356836332f206864c8e14a91d4c025950c5e473c","publisher":"Elsevier Science B.V., Amsterdam.","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/5787<\/identifier><datestamp>2012-02-06T17:43:16Z<\/datestamp><setSpec>hdl_1826_19<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Stochastic axial compressor variable geometry schedule optimisation<\/dc:title><dc:creator>Gallar, L.<\/dc:creator><dc:creator>Arias, M.<\/dc:creator><dc:creator>Pachidis, Vassilios<\/dc:creator><dc:creator>Singh, R.<\/dc:creator><dc:subject>Axial compressor<\/dc:subject><dc:subject>Compressor performance<\/dc:subject><dc:subject>Genetic algorithm<\/dc:subject><dc:subject>Optimisation<\/dc:subject><dc:subject>Variable geometry<\/dc:subject><dc:description>The design of axial compressors is dictated by the maximisation of flow\nefficiency at on design conditions whereas at part speed the requirement for\noperation stability prevails. Among other stability aids, compressor variable\ngeometry is employed to rise the surge line for the provision of an adequate\nsurge margin. The schedule of the variable vanes is in turn typically obtained\nfrom expensive and time consuming rig tests that go through a vast combination\nof possible settings. The present paper explores the suitability of stochastic\napproaches to derive the most flow efficient schedule of an axial compressor for\na minimum variable user defined value of the surge margin. A genetic algorithm\nhas been purposely developed and its satisfactory performance validated against\nfour representative benchmark functions. The work carries on with the necessary\nthorough investigation of the impact of the different genetic operators employed\non the ability of the algorithm to find the global extremities in an effective\nand efficient manner. This deems fundamental to guarantee that the algorithm is\nnot trapped in local extremities. The algorithm is then coupled with a\ncompressor performance prediction tool that evaluates each individual's\nperformance through a user defined fitness function. The most flow efficient\nschedule that conforms to a prescribed surge margin can be obtained thereby fast\nand inexpensively. Results are produced for a modern eight stage high bypass\nratio compressor and compared with experimental data available to the research.\nThe study concludes with the analysis of the existent relationship between surge\nmargin and flow efficiency for the particular compressor under scrutiny. The\nstudy concludes with the analysis of the existent relationship between surge\nmargin and flow efficiency for the particular compressor under scrutiny.<\/dc:description><dc:publisher>Elsevier Science B.V., Amsterdam.<\/dc:publisher><dc:date>2011-10-31T23:02:25Z<\/dc:date><dc:date>2011-10-31T23:02:25Z<\/dc:date><dc:date>2011-07-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>1270-9638<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.ast.2010.08.010<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/5787<\/dc:identifier><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1270-9638","1270-9638"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2011,"topics":["Axial compressor","Compressor performance","Genetic algorithm","Optimisation","Variable geometry"],"subject":["Article"],"fullText":"Accepted Manuscript\nStochastic axial compressor variable geometry schedule\noptimisation\nLuis Gallar, Manuel Arias, Vassilios Pachidis, Riti Singh\nPII: S1270-9638(10)00114-8\nDOI: 10.1016\/j.ast.2010.08.010\nReference: AESCTE 2572\nTo appear in: Aerospace Science and Technology\nReceived date: 3 February 2010\nRevised date: 9 August 2010\nAccepted date: 24 August 2010\nPlease cite this article in press as: L. Gallar et al., Stochastic axial compressor variable geometry schedule\noptimisation, Aerospace Science and Technology (2010), doi:10.1016\/j.ast.2010.08.010\nThis is a PDF file of an unedited manuscript that has been accepted for publication. As a service to our\ncustomers we are providing this early version of the manuscript. The manuscript will undergo copyediting,\ntypesetting, and review of the resulting proof before it is published in its final form. Please note that during\nthe production process errors may be discovered which could affect the content, and all legal disclaimers\nthat apply to the journal pertain.\n Aerospace Science and Technology \n \n1 \n Stochastic axial compressor variable geometry schedule optimisation \nLuis Gallar, Manuel Arias, Vassilios Pachidis, Riti Singh \nDepartment of Power and Propulsion, Cranfield University, Gas Turbine Engineering Group, Cranfield, Bedfordshire, MK430AL, England \nElsevier use only: Received date here; revised date here; accepted date here \nAbstract \nThe design of axial compressors is dictated by the maximisation of flow efficiency at on design conditions whereas at part \nspeed the requirement for operation stability prevails. Among other stability aids, compressor variable geometry is employed \nto rise the surge line for the provision of an adequate surge margin. The schedule of the variable vanes is in turn typically \nobtained from expensive and time consuming rig tests that go through a vast combination of possible settings. \nThe present paper explores the suitability of stochastic approaches to derive the most flow efficient schedule of an axial \ncompressor for a minimum variable user defined value of the surge margin. A genetic algorithm has been purposely \ndeveloped and its satisfactory performance validated against four representative benchmark functions. The work carries on \nwith the necessary thorough investigation of the impact of the different genetic operators employed on the ability of the \nalgorithm to find the global extremities in an effective and efficient manner. This deems fundamental to guarantee that the \nalgorithm is not trapped in local extremities.  \nThe algorithm is then coupled with a compressor performance prediction tool that evaluates each individual’s performance \nthrough a user defined fitness function. The most flow efficient schedule that conforms to a prescribed surge margin can be \nobtained thereby fast and inexpensively. Results are produced for a modern eight stage high bypass ratio compressor and \ncompared with experimental data available to the research. The study concludes with the analysis of the existent relationship \nbetween surge margin and flow efficiency for the particular compressor under scrutiny. The study concludes with the analysis \nof the existent relationship between surge margin and flow efficiency for the particular compressor under scrutiny. \n  © 2010 Elsevier Science. All rights reserved \nKeywords: Axial Compressor; Variable Geometry; Genetic Algorithm; Optimisation; Compressor Performance.\n1. Compressor variable geometry operation \nSurge occurs when the pumping capability of the \ncompressor is exhausted and the flow breaks away from the \nblade in an irretrievable manner. This causes an abrupt \nreversal of the airflow through the compressor.  To this \nregard, surge margin is a measure of how close an \noperating point is to surge. Safe operation of a jet engine at \nsome conditions requires the value of surge margin to be \ngreater than a minimum.  \nIt is a known fact that at part speed the reduction in the \naxial velocity ܸܽ  of the flow through an axial compressor \novercomes the reduction in the spool speed, ܷ, and so \npushes the early stages towards surge. There is a number of \nmethods available to the designer to alleviate this undesired \npart speed compressor behaviour, usually known as “part \nspeed crutches”, that include multi spooling, handling \nbleeds and variable geometry stator blade rows as the most \ncommon. In particular, handling bleeds achieve an \nincreased mass flow through the early stages of the \ncompressor – for an increased ܸܽ  and therefore a reduced \nincidence angle – by dumping overboard the excess of flow \nthat would choke the rear stages otherwise. On the other \nhand, variable IGV’s and VSV’s redirect the air towards \nthe respective downstream rotors so that the incidence \nangle to those rotors is kept well within an acceptable range \naway from the stalling incidence. The effect attained with \nboth systems is however different (fig. 1); whereas the air \nbleed promotes a lower working line, by skewing the \ncompressor variable blade rows the surge line is raised with \na correspondent change in the compressor aerodynamic \nspeed lines. It is generally accepted that a variable \ngeometry stator row is required for each additional stage \nbeyond 5[1]. To a first order, the working line position on \nthe compressor map is regarded as unaffected by any re-\nstagger of the blade rows, although strictly speaking it is a \nfunction of the compressor efficiency that indeed varies \nwith changes in the blade row stagger angle. \nELSEVIER \n Aerospace Science and Technology \n \n2 \n \nFigure 1: Effect on bleeds and variable geometry on the \ncompressor map \n \n    At low speed the early stage variable geometry stators \npush the speed lines almost horizontally. At high spool \nspeeds, however, their impact is subtler since stall is \ncontrolled by the rear stages and early stages migrate \ntowards choke. At such speed, by further opening the \nvariable vanes, the blade passage sectional area is increased \nand the compressor is able to swallow a larger mass flow – \nincreased capacity - with a modest improvement in surge \nline. If the VSVs settings are rescheduled in such manner, \nthe compressor is said to be upflowed.  \n    In power generation applications the low pressure spool \nmust run at a speed synchronised with the grid frequency, \nusually 50 or 60Hz. The variable vanes and the bleeds \nvalves are operated jointly to accommodate changes in \npower demand; in other words, at the same firing \ntemperature and spool speed the attainable pressure ratio \nand mass flow are modulated to meet the load \nrequirements. In aero applications on the other hand, \nvariable blade rows are optimised for flow efficiency at \nhigh speed, and for part-speed surge margin at low speeds. \nIt is for this reason that the IGVs are generally devised as \nthin flat or little cambered profiles aligned with the flow – \nno swirl component is introduced in the oncoming flow- at \nnominal conditions for minimum pressure losses. To \nrestrain the compressor from surge at off design conditions \nthe flat plates are skewed in as much as the incidence to the \nfirst rotor is acceptable (fig. 2). The cost of doing this is a \nremarkable rise in pressure loss that emerges as the flow \ndetaches from the plate.  \n2. IGV\/VSV Schedule eduction \n   The IGV\/VSVs and bleed valves settings are usually \nmapped into the engine control unit scheduled versus the \naerodynamic speed of the compressor so that the  \n \nFigure 2: IGV operation fundamentals \n \ncompressor geometry and bleeds are univocally defined for \na given spool speed. During the engine design process the \nVIGVs and VSVs are devised and optimised for design \npoint operation following the usual rules and numerical \nprocedures. Conversely at off design conditions, the \nsettings that constitute the IGV\/VSV schedule are usually \nobtained from rig tests in which a large number of possible \ncombinations of the variable stator settings is tested and \ncompared. This trial and error process is carried out for the \nwhole operating envelope of the compressor and, although \neffective, it is also lengthy and expensive. The aim of this \nwork is to engineer a computational tool able to deliver the \nmost flow efficient IGV\/VSV schedule that at the same \ntime conforms to a prescribed minimum surge margin. In \nso doing, not only the required experimental trials could be \nshortened and made cost effective but the rig resources \ncould be employed in other tasks.  \n    During the tests the variable stator rows are moved \nindependently from each other by means of separate \nmechanical actuators that permit the blades to be \nrestaggered at the controller’s will. Nevertheless, for \nsimplicity, weight and cost reasons the engine is equipped \nwith a single mechanical actuator that is connected with \neach variable row by a rod. Therefore, the movement of the \nVSVs rows obeys a fixed proportionality that depends on \ncertain geometrical parameters of the gearing mechanism. \nThe proportionality constant can be changed to fit a \ndetermined optimised schedule – in fact to obtain such \nconstant is the object of the aforementioned rig trials- but \nonce fixed it constrains the movement of the stator rows; \n Aerospace Science and Technology \n \n3 \ni.e. for a given turn of the VSV1, ߮1, the VSV2 is forced to \nrotate an angle ߮2, equal to ߣ times ߮1. It is clear that a non \nlinear response of the system is desirable from an \naerodynamic point of view, but such benefits are offset by \nthe mechanical simplicity of a single actuator system. As an \nexample, figure 3 shows the datum schedule for the three \nvariable rows of the eight stage axial compressor employed \nin the current study. \nThe optimisation of the variable geometry schedule of a \ncompressor in isolation provides spurious solutions. A \npoint on the working line – defined by a determined value \nof the non dimensional mass flow and a given pressure \nratio - can be achieved with different settings of the \nvariable geometry rows. However, it is unlikely that for \nthose different configurations the speed at which the \ncompressor runs would be the same. Any change in spool \nspeed will have an impact on the efficiency of its \ncorrespondent downstream turbine and although the \ncompressor efficiency may be raised the turbine efficiency \ncan plummet and the overall performance of the engine can \nturn out to be impaired. It is for this reason that the variable \ngeometry schedule of a compressor should be derived in \nconjuction with its associated turbine. However and to a \nfirst order, it is not unreasonable to assume that the \ncharacteristic is flat for most of the power range for modern \nturbines. \n3. Variable geometry schedule optimiser \n3.1. General arrangement \nA genetic algorithm based optimiser has been chosen to \nobtain the most flow efficient variable geometry schedule \nwith user specified surge margin criteria. The choice of \nsuch method is dictated by the properties of the problem to \nbe optimised. Namely, the algorithm handles three degrees \nof freedom (߮0, ߮1, ߮2), and this fact gives rise to multiple \nlocal optima for a myriad of angle combinations. Moreover, \nloss and stall models used to calculate compressor \naerodynamics are generated from empirical data and are \nusually expressions that fit the mentioned data or in some \ncases losses are given in tabular form from which any \noperating point is found by interpolation. Furthermore, the \nprediction of the compressor performance is a highly \nconstrained problem – e.g. De Haller number and \nLieblein’s equivalent diffusion factors, minimum \nacceptable surge margin, or the maximum acceptable spool \nspeed variation are parameters that severely restrict the \ndesign space. It is for all these reasons that the problem is \nmultimodal and highly constrained, and as such is suitably \ntackled with GAs and other heuristic techniques as \ndemonstrated previously in the literature [2 to 15], in \ncontrast with classical gradient based numerical approaches \nlike those undertaken by Dennis and Schnabel [16], \nFletcher [17] and Rao [18] that perform successfully for \nsmooth functions where the shape of the objective function \nis known beforehand. On top of all, the problem is \ncharacterised by \n \nFigure 3: Datum compressor variable geometry schedule \n \nconflicting design options that make impossible a trial and \nerror approach. In particular, surge margin is commonly \nameliorated by design decisions that impair the compressor \nefficiency. Genetic algorithms have been successfully \napplied to virtually every aspect of the design of gas \nturbines: from models ideated to design combustors \nfollowing a nodal network approach [2,3], to engine inlet \ndesign [4] or axial compressors aerodynamic design [5], \nengine components map generation techniques [6] and \nblade aerofoil design based on a parameterization of \nBeziers curves [7,8]. This type of optimiser has also been \ncoupled with computational fluid dynamics techniques to \nnarrow the design space and alleviate the time required to \ncomplete CFD based designs [9]. Wider scopes of \napplication include intercooled recuperated turbofan design \n[10] or even jet engine controller design [11].The fact that \nthere is no requirement for the fitness function to be \ndefined analytically makes these codes particularly \nattractive to the design of axial compressors where most of \nthe correlations employed are attempts to fit empirical data.  \nIn this work a genetic algorithm has been developed \nfrom scratch. The code has been programmed in Matlab \nand has been coupled with a Fortran 1D mean line analysis \ncode to predict the performance of the compressor. The \ninterface between both codes is accomplished by means of \ntxt data files. The GA generates the txt data files that \nencode the compressor geometry and characteristics \nrequired by the Fortran code as an input. In turn, the \nprediction code assesses the fitness of the created \nchromosome and delivers a new txt data file that contains \nthe predicted compressor performance to be read by the \nGA. The program structure is sketched in fig. 4. \nOne of the results provided by the mean line analysis \ncode is the mass flow that the compressor is passing at a \ngiven aerodynamic speed. By skewing the variable \ngeometry of the compressor the aerodynamic speed at \nwhich a determined mass flow passes through the \ncompressor changes. To a first order, for the engine to \noperate at the same point that it does with the original \nvariable geometry schedule it is the value of the non  \n-0.2\n0\n0.2\n0.4\n0.6\n0.8\n1\n72.5 77.5 82.5 87.5 92.5 97.5 102.5\nN\non\n D\nim\nen\nsi\non\nal\n V\nan\ne \nSe\ntti\nng\nNRT (%)\nIGV\nVSV 1 & 2\n Aerospace Science and Technology \n \n4 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \ndimensional mass flow and pressure ratio that must be kept \nconstant, rather than the aerodynamic speed of the \ncompressor that varies when the variable geometry of the \ncompressor is skewed. Prior to the application of any \ngenetic operator, this effect is accounted for in the \nalgorithm by means of a loop that finds the spool speed at \nwhich the mass flow and pressure ratio are within an error \nof 10-3 of their datum values. \n3.2. Genetic algorithm structure \n    The genetic algorithm had its breakthrough with the \nwork undertaken by Holland [19] and Goldberg [20] and \nbelongs to a group of heuristic optimisation techniques like \nthe simulated annealing [21], the particle swarm \noptimisation [22] or the Tabu search [23 to 25]. The \npremise onto which the genetic algorithm is founded is to \nmimic the natural selection in which only the strongest \nindividuals make it to survival while less fit individuals die \naway. The main advantage of the GA is its robustness and \nits ability to avoid getting trapped in local maxima once the \nalgorithms parameters are tuned by means of a sensitivity \nanalysis. This is guaranteed by the algorithm’s mechanisms \nthat produce diversity in the population, particularly the \nnumber of chromosomes per generation and the rate of \nmutation.  \nThe code operates by generating a random population of \ncompressors where the IGV’s \/ VSV’s schedule is \nrepresented by a string of zeros and ones so that it can be \neasily handled mathematically. The program then translates \nsuch strings to input files that are read by the prediction \nprogram to evaluate the performance of each individual of \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nthe population. The fitness subroutine assigns to every \ncompressor a fitness value that corresponds to the adiabatic \nefficiency of such compressor. The proximity of the \nworking line to the surge line can be accounted for in the \ncalculations implicitly in the fitness function by penalising \nthose solutions with a small surge margin or by rejecting \nany individuals that violate a given surge margin constraint. \nOnce the fitness of every individual has been obtained they \nare subjected to the genetic operators. First the \nchromosomes are selected randomly in pairs and forced to \ncompete so that the fittest of the two replaces the less fit in \nthe original population in what it is known as a \n“tournament selection”. The resultant individuals are \nrandomly selected to mate and generate an offspring \npopulation. The children are generated in a so called \nmultipoint crossover strategy in which each bit of the \noffspring is randomly chosen as the correspondent bit from \neither of the parents. Lastly, following natural genetics, the \npopulation is subjected to a degree of mutation that \ntransmutes a prescribed percentage of bits in the population \nto its opposite value. In order to assure that the fittest \nindividuals are not discarded from the population and hence \naccelerate the convergence of the code to the solution, after \nthe competition the ensuing chromosomes with the highest \nfitness value are separated from the lot and set aside in an \n“elite” group that is exempted from undergoing any further \ntransformation during that generation. To conclude the \ncalculations the program runs mutation free for a number of \ngenerations in what is called a damping process to let the \nprogram converge to a solution. The algorithm stops when \nthe average fitness of the population equals the fitness of \nFigure 4: Genetic algorithm general arrangement \n Aerospace Science and Technology \n \n5 \nthe fittest individual; that is, when all the individuals in the \npopulation have become the fittest. \n3.2.1. Validation – Benchmark functions \nTo investigate the capabilities of the algorithm to \naccurately predict the location of global maxima and assess \nthe sensitivity of the code to the different algorithm control \nparameters the program has been subjected to trial by \nseveral benchmark functions with multiple local maxima, \ngiven by the following expressions (functions A to D; all \nfor   0 ൑ x ൑ 20 and 0 ൑ y ൑ 10): \n \nz = 20 ൥sin൫ඥ0.1 + (xെ 4)\n2 + (y െ 4)2൯\nඥ0.1 + (xെ 4)2 + (yെ 4)2 ൩  \n \nݖ = 1െ (ݔ sin(4ݔ) + 1.1ݕ sin(2ݕ))    \n \nݖ = 1 െ (ݕ sin(4ݔ) + 1.1ݔ sin(2ݕ))   \n \nۖە\n۔\nۖۓ ݖ = (cos\n2(ݔ)െ cos2(ݕ))2\nඥݔ2 + ݕ2    \nݏݑܾ݆݁ܿݐ݁݀ ݐ݋ ݐ݄݁ ܿ݋݊ݏݐݎܽ݅݊ݐݏ ൜ݔ ȉ ݕ > 0.75ݔ + ݕ < 15\n \n \nThe results provided by the code are grouped in table 1, \nand are found to agree closely with the maxima found \nanalytically by the method of Lagrange multipliers. The \nruns are carried out for 100 chromosomes per generation, \nduring 100 generations. The number of competitions per \ngeneration is 120 after which the resultant chromosomes \nare crossed 100 times. The mutation rate is 10%, 5 \nelements are kept within the elite and the algorithm ends \nwith 30 damping generations. The calculations are \ncompleted in 10 seconds.  \nFigure 5 plots the evolution of the fitness value (for this \nsimple case the fitness value is the value of the function z \nthat needs to be maximised) of the best specimen and the \naverage of the population for the function D as the \ncalculations progress. The results show that within the first \n40 generations the algorithm is able to capture at least one \nchromosome with a fitness value of 0.37 whilst for the \nremainder of the generations the program explores other \nregions of the design space. The average fitness of the \npopulation rises gently over 90 generations (continuous \ntrend line) while the population is subjected to mutation. \nFor the last generations the absence of mutation allows the \ncode to rapidly converge to the final solution. \n3.2.2. GA’s input parameters sensitivity analysis \nThe performance of the GA is heavily dependent on the \nright choice of input parameters, and care must be put to \nassure that the program has not been trapped in any local \nmaxima. On the other hand, an excessively conservative \napproach would eventually find the right solution to the \n \nTable 1: Benchmark functions optimiser results. \n \nFigure 5: Maximum fitness value evolution – Function D  \nproblem but at the cost of a dramatic increase in \ncomputational time. Therefore, it is of the utmost \nimportance to carry out a sensitivity analysis to tune the \nalgorithm. The effect of the input parameters on the \nalgorithm’s behaviour in outline is: \n \nx A number of competitions greater than the numbers of \nchromosomes (around 20%) improves the \nconvergence. \nx A small percentage of mutation (1-5%) may hinder \nthe algorithm from finding the solution and the code is \ntrapped on local maxima. Conversely, if the mutation \nis excessive (20%) the program eventually finds the \nglobal maximum but it behaves as a random search \ntechnique. \nx The number of elements in the elite group should not \nrepresent a large percentage of the population as this \ndelays unnecessarily the convergence to the solution. \nThere is a threshold of generations and chromosomes \nbelow which there is no guarantee that the global \nmaximum is found. This is demonstrated by the \nerratic behaviour of the algorithm for runs with less \nthan 100 chromosomes and a small number of \ngenerations. Figure 6 and 7 illustrate this behaviour, \nand are an indicator of the repetitiveness of the \nalgorithm. Particularly figure 7 groups the results of \nthe maximum deviation from an average of 5 identical \nruns for the same operating point. The 30% deviation \nthat appears for 50 chromosomes shows that the \nalgorithm fails to reach the global maximum \nunequivocally. \n \n0\n0.05\n0.1\n0.15\n0.2\n0.25\n0.3\n0.35\n0.4\n0 20 40 60 80 100 120\nFi\ntn\nes\ns v\nal\nue\nNumber of generations\nFittest\nAverage\n Aerospace Science and Technology \n \n6 \n \nFigure 6: Ave. fitness value evolution – Function D \n \nFigure 7: Max. dev. from final average value – Function D \n  \nThe sensitivity of the algorithm to the number of \ngenerations and the percentage of mutation is investigated \nby three different sets of runs. In the baseline case the \nnumber of competitions is increased 70% from the baseline \ncase (300 generations, 120 competitions, 100 individuals, \n10% mutation) whereas in cases B and C the percentage of \nmutation is modified to 20% and 2% respectively. \nIncreasing the number of competitions results in a less \neffective coverage of the design space compared to the \nbaseline as illustrated in figs. 8 and 9 where each \nchromosome is plotted as a dot. This is reasonable since the \nnumber of different individuals that make it through the \ncompetition operator and are allowed to mate is sternly \nreduced by increasing the competitions. \nOther effects associated to the increase in the number of \ncompetitions are: \nx The number of generations required to damp the \nsolution (no mutation) and converge to the fittest \nindividual is generally reduced. \nx The number of generations required to find the location \nof the global maximum is normally greater. This is a \nconsequence of the previous – greater number of \ngenerations without mutation results in a worse \ncoverage of the design space.  \nx The average fitness value reached during the \nfluctuation period is also higher. \nx Overall, the final solution value is slightly improved \nand the deviation minimised when compared to the \nsame percentage reduction in mutation rate. \n \nIt is found that an increase in the mutation rate has the \nopposite effect to any increments in the number of \ncompetitions. As an example, figure 10 shows the evolution \nof the calculations for the baseline (10% mutation) and the \nhigh and low mutation scenarios (20% and 2% mutation). It \ncan be observed that the average fitness of the population in \nthe initial phase is slightly higher for moderate values of \nthe mutation rate and increases sharply for the low \nmutation case. Thereafter the mutation operator is switched \noff and the algorithm is allowed to converge to the final \nsolution, and it does so in a reasonably quick manner (less \nthan 20 additional generations). On the other hand, for high \n \n \nFigure 8: Design space coverage – Baseline case \n \n \nFigure 9: Design space coverage – case A \n0.24\n0.26\n0.28\n0.3\n0.32\n0.34\n0.36\n0.38\n0 100 200 300 400 500\nFi\ntn\nes\ns \nGenerations\n20\n50\n100\n150\nPopulation size\n0\n5\n10\n15\n20\n25\n30\n35\n40\n45\n50\n0 100 200 300 400 500\nD\nev\nia\ntio\nn \nfr\nom\n s\nol\nut\nio\nn \n(%\n)\nGenerations\n20\n50\n100\n150\nPopulation size\n Aerospace Science and Technology \n \n7 \n \nFigure 10: Ave. fitness value – Baseline and B and C cases \n \nFigure 11: Design space coverage – case C \n \nvalues of mutation the algorithm performs poorly in that \nafter a lower average initial phase, it behaves erratically for \nalmost 100 generations until it is eventually able to pick \nand bring the fittest individual out of the crowd. On the \nother hand, although the reduction in mutation rate rises the \naverage of the fitness of the population, the coverage of the \nsearch space is less efficient and the code is more likely to \nget trapped in local extremities (fig. 11). \n3.3. Compressor performance prediction program \nThe code employed to evaluate the fitness function for \neach compressor is a Fortran computer program used to \nobtain the preliminary off design performance of axial flow \ncompressors. It is an industry proprietary 1-D mean line \nmulti stage analysis that uses the correlations published and \nvalidated by Wright and Miller [26] to calculate the loss, \nflow turning and annulus wall blockage growth across the \nblades. These correlations are based on the diffusion factor \nas ideated by Lieblein [27] and modified by Swan [28]. \nBesides, the stall incidence is calculated with the help of \nthe expressions developed by Miller, and the interested \nreader is encouraged to confer [26] and its associated \nreferences for further details. Due to the strong flow \nseparation present across variable vane rows at off design \nconditions Lieblein’s based approaches to predict blade \nlosses are flawed and hence the loss models employed were \nupgraded by Gallar et al [29] .  \nThe program requires some input data including number \nof stages, annulus geometry, blade geometry, variable \ngeometry schedule and bleed data. It obtains the \ncompressor performance via an iterative process. First of \nall, the mean line velocity triangles are obtained solving 1D \nEuler and mass flow continuity equations. The annulus wall \nblockage, rotor and stator loss coefficients can be derived \napplying blade loss and blockage empirical correlations. \nFrom those coefficients and the stage pressure ratio the \nstage temperature rise can be obtained and the velocity \ntriangles are calculated again. The process is repeated \niteratively until consistent values of mean-line velocity \ntriangles, blade row losses and annulus wall blockage are \nfound. Once the program has converged, the remainder \nblade angles are then derived from correlations of incidence \nand deviation. For validation purposes, the code has been \napplied to two different state-of-the-art eight stage axial \ncompressors, A and B. Results are shown in figures 12 and \n13 and it can be observed that the computational results \nfollow closely the rig data. \n4. Results \nTo illustrate its capabilities the program has been applied to \na state of the art compressor of a modern high by pass ratio \nturbofan that features a VIGV row and two rows of VSVs, \nfor a defined value of the minimum surge margin \nadmissible (SM1). The population size of the algorithm is \n100 individuals that run over 300 generations with a 10% \nmutation rate. The design parameters that can be changed \nin the program are three: IGV, VSV1 and VSV2 settings  \n \n \nFigure 12: Compr. A – Performance prediction validation \n0\n0.05\n0.1\n0.15\n0.2\n0.25\n0.3\n0.35\n0.4\n0 100 200 300 400\nA\nve\nra\nge\n fi\ntn\nes\ns \nva\nlu\ne\nNumber of generations\nMutation 20%\nMutation 10%\nMutation 2%\n0\n20\n40\n60\n80\n100\n120\n20 40 60 80 100\nRig\nComputations\nExp Surge Line\n% of design capacity\n% of design ʌ\n Aerospace Science and Technology \n \n8 \n \nFigure 13: Compr. B – Performance prediction validation \nare allowed to vary ±10 degrees around the datum. The \nfitness function is the flow efficiency of the compressor. \nSolutions with a surge margin smaller than a user defined \nvalue are assigned a fitness value of zero and die away in \nthe subsequent generation. \nThe progression of the algorithm for this real-world \noptimisation problem is depicted in figure 14. The \nalgorithm starts with a fittest individual with an efficiency \nof 0.45 and rises to an average of 0.65 after 5 generations. \nDuring 295 generations it explores the design space and as \na result the efficiency of the fittest individual rises slowly \nup to 0.8243 after 95 generations. During the remaining \n200 generations the algorithm does not find a fitter \nindividual. After the mutation is switched off, it takes 4 \ngenerations for the GA to converge to the solution. \nThe resultant schedule is plotted in figures 15 and 16 for \nthe IGV and VSV1 and 2 respectively. The optimised \nsolution exhibits a clear trend towards a more opened \nposition of the IGV row with respect to the datum. The first \nrow of variable geometry is more opened at high speeds \nand gets progressively closer to the nominal down to \n85%NRT; then it matches the original schedule until the \nsolution departs again slightly from the nominal for the \nlower region of the speed range. The second row of \nvariable vanes on the other hand, is more open at the top \nend of the speed range and more closed for the remaining \nof the speed range.  \nFigure 17 reflects the benefits of the proposed new \nmethodology when applied to the compressor under study \ncompared with experimental data obtained for the datum \nschedule on a compressor rig. As expected, at high speed \nthe gain in compressor efficiency obtained is minimal as \nthe compressor blading is optimised for flow efficiency at \ndesign conditions. Results show that a marked rise in \ncompressor efficiency can be attained with respect to the \nnominal schedule utilising the new methodology, in \nparticular at partial speed operation, for different values of \nthe minimum surge margin required for engine operation. \nThe line labelled SM1 refers to the maximum adiabatic that \ncan be attained with the same surge margin prescribed for \nthe datum schedule throughout the operating speed range. \nThe SM2 line shows the maximum flow efficiency that can \nbe obtained for the nominal surge margin increased by 5%. \nIt is noticeable that for both scenarios the compressor \nefficiency is still higher than the datum, despite the increase \n \n \nFigure 14: VSV optimisation – GA progression \n \nFigure 15: IGV optimised schedule \n \nFigure 16: VSV1 and VSV2 optimised schedule \n0\n20\n40\n60\n80\n100\n120\n20 40 60 80 100\nRig\nComputations\n% of design capacity\n% of design ʌ\n0.8215\n0.822\n0.8225\n0.823\n0.8235\n0.824\n0.8245\n0.4\n0.45\n0.5\n0.55\n0.6\n0.65\n0.7\n0.75\n0.8\n0.85\n0 100 200 300\nFi\ntte\nst \nel\nem\nen\nt i\nn \nth\ne \npo\npu\nla\ntio\nn\nAv\ner\nag\ne \nfit\nne\nss\n v\nal\nue\nNumber of generations\nAverage\nFittest\n-0.2\n0\n0.2\n0.4\n0.6\n0.8\n1\n70 75 80 85 90 95 100\nN\non\n D\nim\nen\nsio\nna\nl I\nG\nV\n S\net\ntin\ng\nNRT (%)\nDatum IGV\nOptimised IGV\n-0.2\n0\n0.2\n0.4\n0.6\n0.8\n1\n70 75 80 85 90 95 100\nN\non\n D\nim\nen\nsi\non\nal\n V\nSV\n1 \nSe\ntti\nng\nNRT (%)\nDatum VSV1&2\nOptimised VSV1\nOptimised VSV2\n Aerospace Science and Technology \n \n9 \n \nFigure 17: Optimised schedule efficiency \n \nFigure 18: Optimised schedule aerodynamic speed \n \nin surge margin required from the machine in the SM2 \ncase.  \nMoreover, the subtle change in efficiency trend that is \npresent at 85%NRT for all three scenarios is caused by the \noperation of the bleed valves at such speed. The opening of \nthe valves allows the compressor to reach slightly higher \nefficiencies since the required surge margin for engine \noperation is provided by dumping the air overboard through \nthe bleed valves rather than giving up adiabatic efficiency. \nThe mentioned efficiency gain is obtained with a \nconsiderably reduction in aerodynamic speed (around 5%) \nfor the slower segment of the operating envelope with \nrespect to the datum, for the same mass flow and pressure \nratio (fig. 18). On the other hand, the careful scrutiny of the \nresults suggests that the mass flow for this particular \ncompressor is chiefly controlled by the stagger of the inlet \nguide vanes.  Those results are then justified by the fact that \nthe marked opening of the IGVs promotes a reduction in \ncompressor losses by reducing the flow incidence onto the \nvanes. To assure that the compressor supplies the same \nmass flow and pressure ratio – same operating point – the \nincrease in capacity caused by the IGVs reschedule is offset \nby the mentioned decay in aerodynamic speed.  \nFor each operating point the program reaches a \nconverged solution in around 3 hours, using dll libraries. \nThis avoids calling the compressor performance code as an \nexternal executable saving a considerable amount of time. \n5. Conclusions \nThe aim of the present paper is to divulge the discussed \nmethodology rather than comment on the results obtained \nsince these will undoubtedly depend on the particular \ncompressor under study. Stochastic optimisation methods \nand in particular genetic algorithms have been found as a \npowerful and adequate methodology suited to derive the \nmost flow efficient schedule of the variable geometry of an \naxial compressor or at least delimit the search range and \nhence minimise the need for expensive and time consuming \nengine tests in a quick manner. \nA genetic algorithm has been developed and coupled \nwith a compressor performance prediction tool to find the \ngeometry schedule that maximises the adiabatic efficiency \nfor a user defined value of the surge margin. Satisfactory \nresults have been obtained using a 1D mean line code to \npredict the compressor efficiency. Besides, the modular \ncharacter of the tool enables the researcher to substitute the \ncompressor evaluation tool with 2D or 3D models for an \nenhanced accuracy of the results Furthermore, the tool \nenables the user to assess the impact of some design \ndecisions at part speed operation during the design phase of \nthe engine and in so doing promotes a better understanding \nof the expected performance of the compressor at part \nspeed. This state of the art tool is suited to be upgraded to \ninclude the effect of bleeds and power of takes in the \ncalculations for a greater applicability of the tool.  \nResults for a modern high bypass ratio engine eight \nstage axial compressor are shown as an example of the \nmethodology employed and compared with experimental \ndata obtained for the datum schedule from the compressor \nrig. \nAcknowledgments \nThe authors would like to acknowledge the support of \nRolls-Royce plc. to this project. \nReferences \n[1] Walsh P. and Fletcher P., Gas turbine performance (2nd \ned), Blackwell Science Ltd, Oxford, 1998 \n[2] Despierre, A., Gas turbine combustor design using \ngenetic algorithms, MSc thesis Cranfield University, \n1996. \n[3] Despierre, A., Stuttaford, P.J. and Rubini, P.A., \nPreliminary gas turbine combustor design using a \ngenetic algorithm, International gas turbine and \naeroengine congress and exhibition, ASME 97-GT-72, \n1997. \n0.65\n0.7\n0.75\n0.8\n0.85\n0.9\n0.95\n1\n70 75 80 85 90 95 100\nR\nel\nat\niv\ne A\ndi\nab\nat\nic\n E\nff\nic\nie\nnc\ny (\n%\n)\nNRT (%)\nDatum\nSM1\nSM2\n50\n55\n60\n65\n70\n75\n80\n85\n90\n95\n100\n50 60 70 80 90 100\nC\nor\nre\nct\ned\n N\nRT\n (%\n)\nNRT (%)\nSM1\nDatum\n Aerospace Science and Technology \n \n10 \n[4] Gaiddon, A. and Knight, D.D., Multicriteria design \noptimization of integrated three-dimensional supersonic \ninlets, Journal of propulsion and power, Vol 19, pp. \n456-463, 2003. \n[5] Keskin, A. and Bestle, D., Application of multi-\nobjective optimization to axial compressor preliminary \ndesign, Aerospace science and technology 10, pp. 581-\n589, 2006.  \n[6] Changduk Kong, J.K. and Lee, C., Components map \ngeneration of gas turbine engine using genetic \nalgorithms and engine performance deck data, GT2006-\n90975, 2006. \n[7] Gardner, B.A. and Selig, M.S., Airfoil design using a \ngenetic algorithm and an inverse method, AIAA 2003-\n0043, 2003. \n[8] Obayashi, S., Tsukahara, T. and Nakamura, T., Cascade \nairfoil design by multiobjective genetic algorithms, \nGenetic algorithms in engineering systems: innovations \nand applications, No 446, 1997. \n[9] Duvigneau, R. and Visonneau, M. Single and \nmultiobjective optimisation for high fidelity CFD using \ngenetic algorithms, Evolutionary methods for design \noptimisation and control, 19-21 September, Athens, \nGreece, 2001. \n[10] Whellens, M.W., Singh, R. and Pilidis, P., Genetic \nalgorithm based optimisation of intercooled recuperated \nturbofan design, AIAA 2003-1210, 2003. \n[11] Chipperfield, A. and Fleming, P., Multiobjective gas \nturbine engine controller design using genetic \nalgorithms, IEEE Trnasactions on industrial electronics, \nVol 43, No. 5, 1996  \n[12] Ghisu, T., Parks, G.T., Jarret, J.P and Clarkson, P.J., \nIntegrated design optimisation of gas turbine \ncompression systems, in 4th AIAA Multidisciplinary \nDesign Optimization Specialist Conference, \nSchaumburg, Illinois, USA, 2008. AIAA-2008-1979. \n[13] Kipouros, T., Jaeggi, D.M., Dawes, W.N., Parks, G.T., \nSavill, A.M. and Clarkson, P.J., Biobjective design \noptimization for axial compressors using Tabu Search, \nAIAA Journal, Vol. 46, No. 3, pp. 701-711, 2008. \n[14] Kipouros, T., Jaeggi, D.M., Dawes, W.N., Parks, G.T., \nSavill, A.M. and Clarkson, P.J., Insight into high-\nquality aerodynamic design spaces through multi-\nobjective optimization, CMES: Computer Modeling in \nEngineering & Sciences, Vol. 37, No. 1, pp. 1-44, 2008. \n[15] Shahpar, S., Automatic aerodynamic design \noptimisation of turbomachinery components - an \nindustrial perspective. VKI Lecture Series on \nOptimisation Methods & Tools for \nMulticriteria\/Multidisciplinary Design, pp. 1-40, 2004. \n[16] Dennis, J.E. and Schnabel, R.B., Numerical methods \nfor unconstrained optimisation and nonlinear equations, \nPrentice Hall, 1983. \n[17] Fletcher, R., Practical methods of optimisation, John \nWiley, 1987 \n[18] Rao, S.S., Engineering optimisation:theory and \npractice, John Wiley, 1996. \n[19] Holland, J.H., Adaption in natural and artificial \nsystems, University of Michigan Press, 1975. \n[20] Goldberg, D.E., Genetic Algorithms in Search, \nOptimization, and Machine Learning, Addison-Wesley \nProfessional, 1989. \n[21] Kirkpatrick, S., Gelatt, C.D. and Vecchi, M.P., \nOptimization by Simulated Annealing, Science, Vol \n220, Number 4598, pp. 671-680, 1983. \n[22] Kennedy, J. and Eberhart, R., Particle swarm \noptimization,  Proceedings of the IEEE Int. Conf. on \nNeural Networks, Piscataway, NJ, pp. 1942–1948, \n1995. \n[23] Glover, F. and Laguna, M., Tabu Search, Kluwer \nAcademic Publishers, Boston, MA, 1997. \n[24] Jaeggi, D.M., Parks, G.T., Kipouros, T. and Clarkson, \nP.J., The development of a multi-objective Tabu Search \nalgorithm for continuous optimisation problems, \nEuropean Journal of Operational Research, Vol. 185, \npp. 1192-1212, 2008. \n[25] Kipouros, T., Jaeggi, D.M., Dawes, W., Parks, G.T. and \nSavill, M., Multi-objective Design Optimisation for \nAxial Compressors, in 3rd Aerodynamic Design \nOptimisation Seminar (ADOS 2005), Rolls-Royce plc., \nUK, 2005. \n[26] Wright, P.I. and Miller, D.C., An improved compressor \nperformance prediction model, ImechE C423\/028, \n1991.  \n[27] Lieblein, S., Analysis of experimental low-speed loss \nand stall characteristics of two-dimensional compressor \nblade cascades, NACA RM E57A28, 1957. \n[28] Swan, S.C., A practical method of predicting transonic \ncompressor performance, Transactions of the ASME, \npp. 322-330, July 1961. \n[29] Gallar, L., Pachidis, V. and Singh, R., Compressor IGV \noff design performance and loss modelling, \nInternational Symposium of Air Breathing Engines \n2009, Paper 1221, 2009.  \nNomenclature \nAbbreviations \nGA Genetic algorithm \nIGV Inlet guide vane \nRL Running line \nSM Surge margin \nVIGV Variable inlet guide vane \nVSV Variable stator vane \n \nGreek symbols \nߟ Adiabatic efficiency \n߮ Angle of rotation – IGV and VSV settings \nߣ Constant of proportionality \nߨ Pressure ratio \n \nSubscripts \n0,1,2 IGV, first or second row of VSV’s respectively \n* Design conditions \nLatin symbols \nܽ Axial \nN Spool speed \nNRT Compressor aerodynamic speed ܰ ξܶΤ  \nP Total pressure \nT Total temperature \nU Blade speed \nV Flow absolute velocity  \nW Mass flow \/ Flow relative velocity \n \n \n"}