{"doi":"10.1016\/B978-0-444-53159-9.00004-8","coreId":"64119","oai":"oai:nora.nerc.ac.uk:879","identifiers":["oai:nora.nerc.ac.uk:879","10.1016\/B978-0-444-53159-9.00004-8"],"title":"The collection of drainage samples for environmental analyses from active stream channels","authors":["Johnson, C.C.","Flight, D.M.A.","Ander, E.L.","Lister, T.R.","Breward, N.","Fordyce, F.M.","Nice, S.E."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":["De Vivo, Benedetto","Belkin, Harvey E","Lima, Annamaria"],"datePublished":"2008-05-02","abstract":"The collection of drainage samples from active stream channels for geochemical mapping is now a well-established procedure that has readily been adapted for environmental studies. This account details the sampling methods used by the British Geological Survey in order to establish a geochemical baseline for the land area of Great Britain. This involves the collection of stream sediments, waters and panned heavy mineral concentrates for inorganic chemical analysis. The methods have been adapted and used in many different environments around the world. Detailed sampling protocols are given and sampling strategy, equipment and quality control are discussed","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/64119.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/879\/1\/SamplingChapter_finaldraft.pdf","pdfHashValue":"9bb3de3eb0b73433800fff7ab6e67467fbc6e688","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:879<\/identifier><datestamp>\n      2017-10-04T00:28:59Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533131<\/setSpec><setSpec>\n      7375626A656374733D533130<\/setSpec><setSpec>\n      74797065733D626F6F6B5F73656374696F6E<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/879\/<\/dc:relation><dc:title>\n        The collection of drainage samples for environmental analyses from active stream channels<\/dc:title><dc:creator>\n        Johnson, C.C.<\/dc:creator><dc:creator>\n        Flight, D.M.A.<\/dc:creator><dc:creator>\n        Ander, E.L.<\/dc:creator><dc:creator>\n        Lister, T.R.<\/dc:creator><dc:creator>\n        Breward, N.<\/dc:creator><dc:creator>\n        Fordyce, F.M.<\/dc:creator><dc:creator>\n        Nice, S.E.<\/dc:creator><dc:subject>\n        Ecology and Environment<\/dc:subject><dc:subject>\n        Earth Sciences<\/dc:subject><dc:description>\n        The collection of drainage samples from active stream channels for geochemical mapping is now a well-established procedure that has readily been adapted for environmental studies. This account details the sampling methods used by the British Geological Survey in order to establish a geochemical baseline for the land area of Great Britain. This involves the collection of stream sediments, waters and panned heavy mineral concentrates for inorganic chemical analysis. The methods have been adapted and used in many different environments around the world. Detailed sampling protocols are given and sampling strategy, equipment and quality control are discussed.<\/dc:description><dc:publisher>\n        Elsevier<\/dc:publisher><dc:contributor>\n        De Vivo, Benedetto<\/dc:contributor><dc:contributor>\n        Belkin, Harvey E<\/dc:contributor><dc:contributor>\n        Lima, Annamaria<\/dc:contributor><dc:date>\n        2008-05-02<\/dc:date><dc:type>\n        Publication - Book Section<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/879\/1\/SamplingChapter_finaldraft.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Johnson, C.C.; Flight, D.M.A.; Ander, E.L.; Lister, T.R.; Breward, N.; Fordyce, F.M.; Nice, S.E..  2008  The collection of drainage samples for environmental analyses from active stream channels.    In: De Vivo, Benedetto; Belkin, Harvey E; Lima, Annamaria, (eds.) Environmental geochemistry: site characterization, data analysis and case histories.  Oxford, UK, Elsevier, 59-92.      \n <\/dc:identifier><dc:relation>\n        http:\/\/www.sciencedirect.com\/science\/book\/9780444531599<\/dc:relation><dc:relation>\n        10.1016\/B978-0-444-53159-9.00004-8<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/879\/","http:\/\/www.sciencedirect.com\/science\/book\/9780444531599","10.1016\/B978-0-444-53159-9.00004-8"],"year":2008,"topics":["Ecology and Environment","Earth Sciences"],"subject":["Publication - Book Section","PeerReviewed"],"fullText":"The collection of drainage samples for environmental analyses from \nactive stream channels \n \nJohnson, C.C., Flight, D.M.A, Ander, E.L., Lister, T.R., Breward, N., Fordyce, F.M.* \nand Nice, S.E. \nAll British Geological Survey, Keyworth, Nottingham, NG12 5 GG,  \nexcept * British Geological Survey, Murchison House, West Mains Rd, Edinburgh, \nEH9 3LA \n \nABSTRACT \nThe collection of drainage samples from active stream channels for geochemical mapping is now a \nwell-established procedure that has readily been adapted for environmental studies. This account \ndetails the sampling methods used by the British Geological Survey in order to establish a geochemical \nbaseline for the land area of Great Britain. This involves the collection of stream sediments, waters and \npanned heavy mineral concentrates for inorganic chemical analysis. The methods have been adapted \nand used in many different environments around the world. Detailed sampling protocols are given and \nsampling strategy, equipment and quality control are discussed. \n \nINTRODUCTION \nThroughout human history rivers have played a vital role in human sustenance, settlement and \ntransportation and of all the earth’s systems it is in the drainage environment where man probably has \nhad the greatest impact. From a geological perspective the flow of water is an important process in the \nshaping of the earth’s surface and early civilisations knew how to use drainage channels to trace \nvaluable metals and minerals dispersed in alluvium back to their source. Theophrastus (300 BC) \ndescribes how the ancient Greeks searched for ore deposits by tracing detrital anomalies in rivers \n(Caley and Richards, 1956) and copper for pre-Bronze Age cultures was located using alluvial \ndispersion trains (Wertime, 1973). The art of panning detrital material for precious minerals both from \nactive and defunct drainage channels is a long established skill and an activity that supplements the \nincome of farmers in many parts of the developing world. \n \nThe collection and chemical analysis of various sample media from the drainage system is a well-\nestablished exploration tool having its origins in the Soviet Union (Fersman, 1939) and subsequently \napplied elsewhere, for example Lovering et al. (1950) and Hawkes and Bloom (1955). Although the \nmajority of early surveys were concerned with mineral exploration there are examples of regional \ngeochemical mapping based on drainage samples being applied to environmental problems (e.g. \nThornton and Webb, 1979, Plant and Moore, 1979). The anthropogenic effect on drainage sediment \ngeochemistry was reviewed by Cooper and Thornton (1994). \n \nWebb and Howarth (1979) wrote: “Although it was apparent more than 20 years ago that geochemical \natlases would eventually become a national cartographic requirement, regional geochemical mapping \nis still in the experimental stage. This trend is now evident in activity in a number of countries. The \nmethods being employed, however, are so diverse that there is an urgent need for international \ncollaboration aimed at securing data that are as mutually compatible as possible..”.  This need was \nfinally addressed by the International Geological Correlation Programme (IGCP) Project 259  “A \nglobal geochemical database for environmental and resource management” (Darnley et al., 1995). This \nstates that wherever the landscape permits, drainage samples, specifically stream sediments, have been \nthe preferred sampling medium for reconnaissance exploration surveys. \n \nCurrent output of publications on environmental applications of drainage surveys is now far greater \nthan for exploration investigations (e.g. Lee et al., 2003; Gonçalves et al., 2004; Schreck et al., 2005; \nand Ettler et al., 2006). There is also a greater emphasis on multi-purpose environmental baseline data \ngenerated from multi-media sampling as demonstrated by the Geochemical Atlas of Europe (Salminen \net al., 2005) and the environment and resource evaluation of the Tellus geochemical mapping project in \nNorthern Ireland (Young and Smyth, 2005). \n \n 1\nA variety of sample media can be classified as drainage samples. These include stream, lake, overbank \nand floodplain sediments; stream and lake water; suspended\/colloidal sediment in streams or lakes; and \nprecipitates or coatings on stones and boulders from the stream bed. The use of drainage sample media \nin geochemistry was comprehensively reviewed by Hale and Plant (1994). The account presented here \nis specifically concerned with procedures for collecting samples from the active drainage channel \n(stream sediment, suspended sediment, stream water and panned heavy mineral concentrates) and lake, \noverbank and floodplain samples are not discussed further. The procedural section in this account is \nbased on the British Geological Survey (BGS) G-BASE (Geochemical Baseline Survey of the \nEnvironment) Project. This is a long established programme to produce geochemical maps of inorganic \nelements of the United Kingdom land area based mainly on high density sampling of stream sediments \n(Johnson et al., 2005). \n \nDRAINAGE BASINS \nThe study of streams is part of the scientific discipline known as hydrology. Some of the terminology \nassociated with the drainage system is summarised in Table 1. A stream can be defined as being a body \nof water confined by the land surface as its base (known as the stream “bed”) and laterally by banks. It \nis a term often used to cover all naturally flowing water; “river” is a term generally applied to a large \nnatural stream. Stream water may or may not flow all year but the channel or course along which it \nflows is a feature that, with or without water, can be sampled throughout the year. Intermittent streams, \nwhich flow for only part of the year, are usually found in regions where there is a marked rainfall \ncontrast between seasons or seasonal temperature variations result in the melting of ice or snow. An \nintermittent stream in an arid area is also sometimes referred to by the Arabic term “wadi”.  These \nstreams are often associated with hazardous events such as flash floods where sudden heavy rain or \nrapidly melting snow upstream can result in a torrent of debris and water further downstream in areas \nwhere there has been no recent precipitation. These events cause significant redistribution of detrital \nmaterial and are a very important consideration in the health and safety of sampling teams. Streams that \nform only for a short period during times of precipitation are referred to as ephemeral streams. \n \nStreams are part of a drainage basin system which has inputs, flows, stores and outputs of both water \nand detrital material. The drainage basin concept is illustrated in Figure 1 which shows basins defined \nby a topographic feature known as the watershed.  Drainage basins, sometimes also referred to as \ndrainage catchments, can be broken down into smaller or larger “nested” basins that can be defined in \nterms of the stream rank or order. A hierarchy of streams can be set up, the more objective and \nstraightforward  system is known as the Strahler stream order (Strahler, 1957) which is also illustrated \nin Figure 1.  \n \nHigh order drainage basins often define administrative boundaries for the management of resources e.g. \nthe Hydrometric Areas of the United Kingdom (Institute of Hydrology, 2003). In Earth and \nEnvironmental Sciences the drainage basin is an important means of defining an area equivalent in \nmany respects to post or zip codes that have such widespread application in Geographical Information \nSystems (GIS). The drainage basin area is not only important as a means of delineating a data set \nwithin a GIS but it is also fundamental in the sampling and data interpretation processes. In remote \nunder-developed areas rivers generally are the only means of ground access into an area so sampling \nand mapping is very much based along the river system. In areas of high relief the drainage channels \nrepresent the mostly likely place to find rock outcrops as a result of downward erosion by the stream \nsystem. The BGS mapping of northern Sumatra, Indonesia (1975-1980) was entirely based on drainage \nbasin areas and mapping teams were assigned basins to sample during seasonal field campaigns. \nDrainage basin reports formed the basis for later regional compilations. \n \nInterpreting results from a drainage sample requires an understanding of its derivation and the \nbehaviour of chemical elements in the drainage environment. A drainage sample is a composite of \nmaterial derived upstream of the sampling site limited by the watershed boundary. In this way a sample \ncan be collected that is representative of a much larger area than just the point represented by the \nsample site (its true representativity is discussed later in this account). The area covered depends on the \norder of the drainage basin with first order basin generally covering areas of <10 km2 and third and \nfourth order basins areas of  >100 km2 though this will very much depend on the geomorphology of the \nlandscape. The drainage sampling described here is based on the sampling of low-order streams, \ngenerally 1st to 3rd order so the sample represents a relatively small area and is not a generalised \ncomposite of too many drainage basins. \n 2\n DRAINAGE SAMPLING \nDrainage sampling has a significant advantage over other types of media because  a wide variety of \ndifferent sample media can be collected from a single site. This represents a very economical and \neffective way of generating geochemical information and such a multi-media survey has great value in \ninterpreting the distribution and behaviour of determinands in the surface environment. For example, \nthe distribution of arsenic in stream sediments and stream waters over Mesozoic sedimentary ironstone \noutcrops in eastern England show the benefits of being able to compare the geochemistry of different \nsample media in a regional geochemical survey (Figure 2). In this case, very high levels of arsenic are \npresent in stream sediments over the ironstone outcrops, but the very low mobility of arsenic when \nbound to sedimentary iron oxides is illustrated by the absence of corresponding elevated arsenic levels \nin the stream waters. \n \nFrom a logistical point of view the ability to collect a single sample that represents a large area greatly \nreduces the number of samples needing to be collected. The fact that one can collect drainage samples \nfrom adjacent tributaries from sites that may only be tens of metres apart greatly reduces the amount of \ntime spent walking between sites. Anyone that has been involved in sampling will testify to the time \nand effort saved by not having to walk up hills and mountains to collect samples from near watersheds \nas the stream effectively brings the material down the valleys to the sampler. \n \nAlthough there are standard procedures for the collection of environmental samples for very specific \npurposes (e.g. guidance in collecting bottom sediments in association with water quality, ISO 5667-\n12:1995) there are no nationally or internationally prescribed standards for the collection of drainage \nsamples. The recommendations of Darnley  et al. (1995) provide a top level of guidance to those \nplanning sampling programmes where, at project level, there should always be detailed instructions on \nhow samples should be collected, as shown for example in Salminen et al. (1998) (FOREGS project \ngeochemical mapping field manual) and Johnson (2005) (BGS G-BASE field procedures manual). \nSuch detailed documentation is essential to give quality assurance to results and provide necessary \ninformation for the data users to establish whether it is fit for its intended purpose. In any \nenvironmental survey the sampling procedure used should be recorded as a coded field within the \nresulting database. The G-BASE project now includes a “sampling protocol” code as part of the field \nform completed at each sampling site (Figure 3).  \n \nSAMPLING STRATEGY \nThe broad range of procedural options available to an environmental scientist planning a sampling \nproject using drainage samples is discussed in detail by Hale (1994). Although this is aimed at the \nexploration geochemist, the sample campaign planning decisions faced by environmental scientists are \njust the same. The sampling plan must firstly take into account the stakeholders of the project, that is \norganisations or individuals that have an investment or interest in the project and will have a planned \nuse for the data. In this sense planning the project strategy needs to work backwards from the point of \ndeciding what products need to be delivered and what they have to be used for. At this point it can be \ndecided which sampling media can best meet the objectives of the user. The environmental scientist or \ngeochemist needs to communicate scientific output in terms that are understandable to stakeholders that \nmay not understand the science but need information to satisfy their requirement. For example, \ndetermining if stream water concentrations of heavy metals exceed statutory levels.  \n \nWhether or not objectives of the stakeholders can be achieved greatly depends on our knowledge as to \nthe usefulness of the various sampling media and the uncertainty that can be associated with a set of \nresults when delivering an objective. This requires the skills and experience of a geochemist who must \nbe able to justify decisions made during the planning phase. The choice of sample media, and the \nfraction of that sample media to be used, will determine what element concentrations and distributions \nwill be best defined. Analytical methodologies employed will decide whether element concentrations \nreflect total levels or merely a partial extraction. This is particularly important in environmental health \nstudies where the availability of essential or toxic elements rather than an understanding of the total \nconcentration determine the level of risk. Multi-media surveys with a wide range of analytical methods \nemployed are a good way of satisfying a wide range of stakeholders (an example of this is the Tellus \nProject in Northern Ireland , Young and Smyth, 2005).  \n 3\n \nHowever, it is rare that surveys have the luxury of a budget to achieve all that is desirable and often \ncompromises have to be made in the sampling and analytical strategy. An example of this could be in \nthe fraction size of sediment collected. Fine sediment may be good at discriminating chemical \nanomalies for elements diffused by hydromorphic dispersion  but it may miss coarser grains \ntransported predominantly by mechanical dispersion and not transported in the lighter and finer \nsediment fractions. With industrial slag, for example, coarser mineral grains that do not readily \nbreakdown would be missed if only very fine sediment was collected. It is in such instances where the \nmulti-media opportunities afforded at a single drainage site make drainage sampling an attractive \nstrategy, especially as a first-stage environmental geochemical sampling tool. \n \nIn addition to being able to satisfy the stakeholders objectives within an available budget there are \nlogistical constraints to any project. These would include ease of access to a sampling area and climatic \nconditions (particularly in relation to seasonal variations). For the latter, consideration of seasonal \nstream flow in drainage catchments is an important criteria both from a scientific and safety view point. \nFurthermore climate may also be associated with ease of access with heavy rain or snow making roads \nand tracks impassable and river crossings difficult. The ease of access more often than not relates to \none of the biggest expenditures in the sampling budget namely the transport of personnel and samples \nto and from sample sites. \n \nIn inaccessible areas a choice has to be made between high cost helicopters or collecting on foot. The \nlatter may only require modest expenditure but over a considerably longer period of time, so overall \nexpenditure could be the same as a helicopter-borne survey. In a commercial project time and money \nwill be of prime concern. For national surveys where there is a large component of institutional \nbuilding and involvement of local people to be considered, maximising the benefit to the local \ncommunity by carrying out a ground based rather than helicopter survey will be a more acceptable \nstrategy. \n \nQuestions of sampling strategy are reviewed well elsewhere (see Darnley et al., 1995) and include \ndiscussion of decisions to be made on the optimum fraction size of sediment to be employed, sampling \ndensity, and methods of chemical analysis.  A knowledge of the behaviour of chemical elements in \ndifferent environments and an appreciation of element associations (see Table 2 and Table 3) greatly \nhelps in the planning and interpretative phases of the project. If it is determined that certain elements \nare of great importance to the data users (e.g. mercury) then sampling strategy may have to be modified \nto collect the sample with out compromising the results for the most important elements. \n \nOnce decisions have been made it is always a good strategy to carry out an orientation survey to test \nout sampling plans. Examples of such orientations can be found described in Plant (1971) (drainage \nsampling in Great Britain); British Geological Survey (1999a) (drainage sampling in the Atlas \nMountains of Morocco) and Ranasinghe et al. (2002) (drainage sampling in Sri Lanka). \n \nPROCEDURES \nThe following procedures are derived from the G-BASE field procedures manual (Johnson, 2005). \nThey are presented here as a generic template for multi-purpose drainage sampling and are methods \nthat have been developed and refined over a period of more than thirty years. The basic procedures \nhave changed little since reported by Plant and Moore (1979) and have been adapted and applied to \nmany major geochemical mapping projects around the world spanning many climatic zones (e.g. \nSumatra, Indonesia - Stephenson et al., 1982 and Muchsin et al., 1997; Ecuador - Williams et al., 2000; \nand Morocco - Johnson et al., 2001.) Such adaptations to different climatic zones and stakeholder \nrequirements are discussed at the end of this section. \n \nGeneric sampling considerations \nThere are some fundamental issues that need to be addressed in order to understand important steps \nincorporated into the procedures described in the following subsections. \nReliability of sampling teams.  The quality of an environmental survey is only as good as the most \npoorly controlled part of a survey and this will frequently be the sampling. Procedures must be in place \nto ensure samplers are reliable and are strictly following protocols, particularly when the work involves \nthe use of many different samplers. They need to be motivated and understand why they are collecting \n 4\nthe samples in the prescribed way. Good team leaders are essential in this process. Rotation of \nindividuals in different sampling pairs is important to maintain a check on procedural discrepancies. \nThe more widespread use of GPS has greatly improved the reliability in sample site positioning and \nthis gives a confirmation that samplers have actually visited sites as scheduled. \nAvoiding contamination. Environmental studies involve determining trace levels of elements or in the \ncase of water samples ultra-trace levels and procedures have to be designed so as to avoid introducing \ncontamination through the sampling tools, sample handling and the storage containers. Any orientation \nstudies should be designed to include steps to test for contamination such as subjecting samples of pure \nsilica sand or de-ionised water to all the steps in the sampling procedure. In the following subsections \ntrademarked products such as Kraft™ paper bags, polyethylene Nalgene™ water containers, Millex™ \nfilter papers or Swinex™ filter holders are referred to. These are items which the G-BASE project has \nfound suitable for its survey, other surveys may use other trademarked products – the important point is \nthat every piece of equipment used in the sampling must be investigated as a potential source of \ncontamination. \n \nSampling team and responsibilities \nSampling is a team effort best led by personnel that have had practical experience of sampling \nthemselves. The organisation of a typical sampling team is shown in Figure 4 and consists of a Project \nManager, a Field Team Leader and Assistant and a number of sampling pairs. The Project Manager is \nresponsible overall for the sampling strategy and logistics, the teams health and safety, managing the \nsamplers’ contracts, sampling budget and delivering samples to the laboratory for analysis. As part of \nthe quality assurance the Project Manager should have regular inspection of the field work. The Field \nTeam Leader is responsible for the day-to-day operations of the sampling team including allocation of \ndaily sampling quotas and checking samples and field forms at the end of each sampling period \n(usually daily). The leader will need to be an experienced sampler and a good team worker in order to \nmaintain the motivation and confidence of the samplers. The leader’s assistant will be less experienced \nin managing a team but someone that bridges the gap between Team Leader and samplers, with an \nexpectation that they can both share the responsibilities of the leader as well as being actively involved \nin the sampling.  \n \nThe key personnel are the samplers who should always work in pairs but not always with the same \npartner. This satisfies health and safety requirements and by varying the make up of each pair ensures a \nconsistent implementation of sampling procedures throughout the team. BGS uses samplers that are \nundergraduates or recent graduates of earth or environmental sciences seeking to gain practical \nexperience in sampling. They generally do not earn a wage but are given a daily subsistence allowance \nand the knowledge that their work experience is an invaluable addition to their curriculum vitae. This \nmodel of employment has been used by the G-BASE project for more than 35 years and several BGS \ngeochemical mapping projects internationally (e.g. Morocco and Madagascar). When working in more \nremote or difficult areas the sampling pair may consist of a graduate plus a labourer. If sampling areas \nof special difficulty, urban environments and remote jungle being examples at two extremes, samplers \nmay need to be accompanied by personnel with specialist knowledge of the area. For example, \nG-BASE whilst carrying out drainage sampling in the Glasgow area of Scotland, sampling pairs were \nassisted by municipal workers.  \n \nAny sampling campaign will usually commence with a training day for the samplers so they have a \ngood knowledge of the sampling procedures and how to complete field forms that record information \nabout the sampling site and the sample itself. Ideally, at the commencement of a sampling campaign \nthe sampling team will have a number of experienced samplers who can be paired off with the \ninexperienced ones in the first few days of the sampling. The number of sampling teams and pairs \ndepends very much on the logistics of the operation. Use of too many samplers may result in collecting \nsamples faster than they can be collated or analysed and will, if vehicles are being used, require larger \nor more vehicles for transport. Too few samplers will lead to unacceptably slow sampling rates and \nalso results in overdue dependence on a small number of samplers. It is also good practice to ensure \nteam leaders are regularly brought together for sampling training to ensure procedures are being \ncorrectly followed with no deviations.  \n \nAll personnel should be asked to contribute to a field campaign report at the end of sampling. In this \nway any deviations from standard procedure can be documented and suggested improvements to the \n 5\nmethodology can be recommended. A review of these recommendations on an annual basis leads to \nimprovements in procedures that can be included in sampling protocol revisions. \n \n \nField sampling equipment \nA list of equipment required for drainage sampling is given in Table 4.  A great advantage of \ngeochemical methods over geophysical methods is that the field equipment is relatively cheap and \ngenerally readily available. The equipment can be divided into three parts; there are the items necessary \nfor (i) collecting the sample;  (ii) describing and marking the sampling site; and (iii) carrying and \ntransporting the equipment and samples. Such equipment can be adapted to suit the aims and objectives \nof a survey particularly where local alternatives may be readily more available (see discussion). \n \nSampling Procedures \nThe mantra of sampling is to “avoid introducing contamination” during the sampling process. Samplers \nshould not wear hand jewellery and all sampling equipment must be free of contaminants and cleaned \nthoroughly between sample sites. Water sample analysis, in particular, involves determinations to very \nlow concentrations and care should be taken to wash hands in the stream water first to remove any \nsweat or lotions (such as sun cream), and handling sample bottles must be done in such a way that the \ninside of bottles or lids are not touched by the hand. \n \nSite selection \nSites will have been pre-plotted on a topographic map and samplers should make their way to the \ndesignated site. However, the precise sampling site requires the samplers to understand what \nconstitutes a good sampling site. This will to some extent depend on the nature of the survey. For the \nG-BASE baseline mapping the instructions are: \no Find a site with flowing water and a good supply of sediment in the stream bed \no Always sample upstream of any tracks and roads \no Avoid places where there is obvious bank-fall or soil material in the stream  \no Avoid sampling where animals congregate in the stream to drink \no Sample above any obvious contamination to the natural system (e.g. a land drain outlet, mine \nwaste or a dumped car) \n \nOne sampler should walk 50-100 m upstream (along the bank) of the intended site to check for any \nlocalised contamination, prior to initiating sample collection. Sometimes it is impossible to fulfil all the \nabove criteria. For example during dry periods the stream may have no water or the entire length of the \nstream may have been dredged and straightened by agricultural activity. If no alternative is available, \nless suitable sites will have to be used with adequate comments and descriptions recorded on the field \nform. As the sampling methodology is based on low order streams the depth of water should generally \nbe no more than waist deep. \n \nThe selection of the exact spot for sampling is a skill that develops with experience. Figure 6 shows a \ntypical cross section of a stream channel for a 1st or 2nd order stream and shows a typical site where \nsediment should be collected. Samplers should seek to sample typical flow regimes rather than sites \nwhich favour depositional sorting, e.g. centre of streams away from banks and not behind obstructions. \nIn surveys where heavy or larger detrital minerals are being sought, samples should be taken from the \nhigher energy part of the channel (i.e. where the water is flowing fastest) or from downstream of \nboulders where an obstruction to stream flow has resulted in the deposition of the heaviest part of the \nrivers mechanically transported load. \n \nOn arrival at site, samples should be collected in the order of stream water, stream sediment and \npanned heavy mineral concentrate. A flow chart of procedures is shown in Figure 7 which \ndemonstrates the team effort of a sampling pair to efficiently sample a site in a strictly prescribed order. \nTime spent at each site will vary according to the experience of the samplers and the ease of collecting \nand sieving fine sediment. On average a drainage site should take 30 - 40 minutes to sample. \n \n 6\nThe following procedures describe the specific way in which the G-BASE project collects drainage \nsamples. \n \nCollecting a stream water  \n1. Sampler 1 unpacks all the sampling equipment. Sampler 2 labels the water sample bottles (and \nthe sediment and panned concentrate bags). Four bottles are used for various analytical \nmethods. The pre-allocated site number (taken from the field card) is written on the sample \ncontainers, using the black permanent ink marker. The site number becomes the sample \nnumber by including a sample type code as a suffix, in the case of waters this is “W”. The \nnumber should be written along the side, starting from the cap end. The following sample–\ntype codes must also be written on each container:  F\/UA – filtered unacidified  (30 ml \nNalgene™ bottle); F\/A – filtered and acidified (60 ml Nalgene™ bottle); pH (30 ml \npolyethylene bottle); and Alkalinity\/Conductivity – (250 ml Nalgene™ polyethylene bottle). \nSampler 2 commences by collecting the filtered samples first.   \n2. Water samples are collected the mid-stream flow, on the upstream side of the sediment \nsample location. Sampler 2 should stand facing upstream and sediment must not be disturbed. \nThe filter should be removed from the self-seal bag without contaminating the connector - it \nshould only be handled along its sides. Flush the syringe three times with stream water before \nconnecting a clean Millex™ filter; filters should never be used at more than one site. Flush \nthe filter with 5-10 ml of stream water. Carefully rinse the Nalgene™ bottles and caps with \nfiltered stream water (minimum 10 ml). Special care must be taken to ensure that the sample \ncontainers and lids remain uncontaminated; the inside of lids and containers should not be \nhandled and must not be allowed to come into contact with hands, soil, vegetation, or \nunfiltered water. If they need to be put down while open they must be placed on a clean \npolythene bag.  Fill the 60 ml bottle to the neck and completely fill the 30 ml bottle. Apply \ncaps tightly, ensuring that no leakage occurs. Place the filtered samples into a clean 15 x \n43 cm polythene bag tied with a knot then transported inside a self-seal polythene bag. If the \nbottle, cap or filter are dropped, or otherwise contaminated, a replacement must be used and \nthe process re-started. In situations where filtration is difficult (i.e. very turbid waters), the \nF\/A sample should be collected first. An additional 250 ml Nalgene™ bottle may be filled \nwith unfiltered water, marked with the sample number and the relevant sample type(s), and \ntaken to the field base for filtration. It is important to try and filter the sample for trace \nelement analysis at site, as an unquantifiable rate of cation adsorption onto container walls \nand suspended sediment may occur from the larger bottle before filtration. In areas where the \nwater tends to have a particularly high proportion of suspended material 'pre-filters' are \nincluded in the sampling kit. This should only be done where absolutely necessary in order to \navoid confusion and incorrect filtration; the sample teams should be reminded of the \nprocedure to use. The pre-filtering process uses a coarser 25 µm pre-filter mounted in a \nSwinnex ™ filter holder. The sample is first passed through the coarse pre-filter then through \nthe 0.45 µm Millex™ disposable filter. \n3. Sampler 2 collects the pH and conductivity\/alkalinity samples immediately after the filtered \nwater samples. Like the filtered samples, they should be collected from the mid-stream flow, \non the upstream side of the sampler. Thoroughly rinse the sample containers and caps with \nstream water three times. Submerge the containers in the stream to fill; then seal underwater, \nensuring that all air has been expelled. Place the unfiltered samples into a clean, self-seal \npolythene bag along with the knotted bag containing the filtered water samples. \n4. Sampler 2, in order to complete the water colour and suspended solids part of the field form, \nneeds to determine these by filling a polythene bag (15 x 43 cm) with stream water and \nholding it up against the sky as a background to observe the water colour and transparency. \n \nThe “dirty filter” with the >0.45 µm suspended sediment can be used as an additional sample media \nfrom this site and can be bagged and labelled for future analysis. Note that the F\/A samples are \nacidified using Aristar-grade concentrated nitric acid when samples are returned to the field base each \nday. This is because it is undesirable to have the samplers carrying concentrated acid while in the field. \nSamples are acidified to 1% v\/v (i.e. 0.6 ml conc. acid per 60 ml of sample). An additional precaution \nagainst contamination, one that is not employed by G-BASE,  is the use of disposable vinyl gloves \n(Salminen et al., 1998). Many surveys collecting stream waters will routinely determine pH, alkalinity \nand conductivity at site. The G-BASE project does such measurements back at the field base always \nwithin 24 hours of sample collection. This gives better reproducibility than on site field measurements. \n 7\nCollecting stream sediment \n1. Sampler 1 downstream of the water sampling will wash the trenching tool (shovel), sieve \nnest, both pans, the plastic funnel and both sets of thick black protective rubber gloves with \nstream water. The sieve nest (Figure 5) is assembled on top of the glass-fibre pan, in a stable \nposition, as close to the sediment collection point as possible. The collection pan and sieves \nmust be clean and free from any particulate matter prior to commencement of sampling.  \n2. The sediment collection position should be an active area of the stream bed (Figure 6), and \nshould ideally be centrally placed in the stream, to minimise contamination from any bank \nfall material. Sampler 2 firstly, removes the uppermost (10 to 20 cm) heavily oxidised \nsediment with the shovel and then loads the top sieve with coarsely sorted sediment from \nbeneath the oxidised layer, taking care to drain off excess water and remove any large clasts \nbefore placing the material into the top sieve. If the sediment lies on a base of peat or clayey \ntill, take care to ensure that the sediment is sampled without digging into the underlying fixed \nmaterial. It will normally be necessary to dig 15 - 25 kg (wet weight ) of material to provide a \nsufficient final sample weight. If there is abundant sediment in the stream bed this can \nnormally be achieved from a single “hole”, if sediment is scarce then several holes may need \nto be dug over a length of the stream bed of no more than 5 m. \n3. Sampler 1 as loading the sieve proceeds,  rubs the stream sediment through the top sieve, \nproviding sufficient (normally 2-3 kg) <2000 µm material in the lower sieve to produce \nadequate <150 µm material. During this process look out for any contaminant material in the \nsediment, which should be removed from the sieve and the details noted on the field data card. \nBefore the upper sieve becomes too full and heavy it should be removed and shaken to allow \nmore <2000 µm material to fall through into the bottom sieve. It is very important to make \nsure the outside of the upper sieve is free of any sediment otherwise coarse grains could fall \ninto the fine sediment when shaking. The upper sieve material can then be discarded and this \nmaterial is often worth observing for stream clast lithologies, which are noted on the field data \ncard. Several cycles of filling, rubbing, shaking and discarding of the top sieve material may \nbe required to provide enough material in the lower sieve. This is dependant on the physical \nnature of the stream sediment material.  \n4. Once there is sufficient material in the lower sieve Sampler 1  should mix around and rub the \n< 150 µm to help material to pass through into the collecting pan. If the lower sieve material is \nvery dry and sandy it is often necessary to sprinkle a small amount of water into the lower \nsieve while mixing and rubbing the material. Care must be taken not to flood the collecting \npan with too much water otherwise there is a danger of fine material being washed \naway.  \n5. When the lower sieve material has been well mixed and rubbed through, Sampler 1  rinses the \nrubber gloves and then uses the funnel to rinse any particulate material off of the top rim and \nouter sides of the lower sieve, ensuring that the volume of water which goes into the sieve is \nkept to a minimum. The lower sieve should then be picked up carefully, without disturbing the \ncollecting pan, and gently shaken to allow additional <150 µm material to fall through into the \ncollecting pan. If there appears to be insufficient material in the collecting pan, the lower sieve \nmay be replaced and the material re-mixed and rubbed while sprinkling with a small volume \nof water (<100 ml). The gloves and sieve top and outer sides should then be re-rinsed and the \nsieve carefully lifted and shaken as before. Take particular care at this stage to avoid biasing \nthe sediment sample by incorporating oversize material. Once there is enough sediment in the \ncollecting pan, remove the lower sieve and retain the <2000 µm material which it contains. \nLeave the pan containing the <150 µm sample undisturbed for about 20 minutes to allow \nthe settling out of suspended material. \n6. While Sampler 2 is panning  (see below) Sampler 1 completes the field form (Figure 3) with \nsite and sample descriptions. \n7. When the fine material has settled in the collecting pan, Sampler 1 decants the fine sediment \nslurry into a sample bag. Sampler 1 puts on a pair of rubber gloves, cleans them in the stream \nwater, then slowly decants excess water from the surface of the sediment collecting pan. The \nsediment sample is then homogenised by firmly, but carefully, shaking the pan to mix the \ndense, particulate material with the fine colloidal fraction. This is important as if there is an \nexcess of material, any portion discarded must be the same as the portion which is retained \n(final sample volume should be  200–250 ml). At this stage, the sediment details (colour, clay, \nand organic content, the latter two estimated as high\/medium\/low) should be noted. Next, \nSampler 1 thoroughly rinses clean the polypropylene funnel with stream water then transfer \n 8\nthe sample, via the funnel, to the appropriate, numbered Kraft™ paper bag 10 x 20 cm (4 x 8 \nin). See the water sampling procedure, step 1, for sample number allocation – for stream \nsediments the G-BASE project uses the sample type code “C”. The Kraft™ bag is sealed by \nfolding the tab over three times and bending the wire fixings over the ends of the envelope. \nPlace the sealed Kraft™ bag in a 15 x 43 cm (6 x 17 in) polythene bag and tie a loose knot in \nthe polythene bag to prevent loss or contamination during transport. The sealed bags are \nplaced into a plastic box, and then into a rucksack, taking care to ensure that the sample bag is \nupright. \n \nCollecting panned concentrate \n1. Sampler 2 commences collecting the panned concentrate while the sediment is settling in the \ncollecting pan.  The <2000 µm material retained from the sediment collection process is tipped \ninto the wooden Malaysian “dulang” style pan, using water from the funnel to wash all the \nmaterial from the sieve. \n2. Further wet <2000 µm sediment from as deep as possible within the stream bed, using the top \nsieve placed directly on the wooden pan. Copious amounts of water may be used to aid sieving \nat this stage. Once the wooden pan is almost full of <2000 µm material the panned heavy \nmineral concentrate is then collected using the following three stages; \n(a) Removal of clay and organic material which binds grains together by repeated \nwashing and stirring of the material in the pan. The pan should not be submerged \nduring this procedure but clean water should be continually added and dirty water \npoured out. Once the grains feel well separated and the water being poured out looks \nrelatively clean, proceed to stage (b). \n(b) Formation of heavy-mineral bed by vigorous shaking of pan with ample water for \na minimum duration of two minutes. This allows density separation in the pan \nmaterial and is extremely important before proceeding to stage (c). \n(c) Selective removal of the less dense fraction by circulating the pan on the surface \nof the water in an elliptical fashion to yield 20 to 40 g of heavy mineral (density \ngreater than 2.9 g\/cm3) concentrate. This process is best demonstrated by an \nexperienced sampler and it is important during stage (c) to regularly stop circulating \nand re-shake the material to maintain density separation. \n3. Sampler 2 inspects the final concentrate with a hand lens and notes the presence and relative \nabundance of heavy minerals on the field form. The funnel is used to transfer the concentrate \nmaterial to a numbered, 8 x 13 cm (3” x 5”) Kraft™ sample bag using sufficient water to \nensure complete recovery of all grains. The sample type code for a panned concentrate is “P”. \n  \nCollecting duplicate samples \nOne sample in every hundred samples collected by the G-BASE project is a duplicate sample. A \npredefined sample and duplicate site number is allocated to samplers who must collect a duplicate \nstream sediment and stream water sample from a single site. A duplicated panned sample is not \ngenerally collected because such samples are not routinely submitted for chemical analysis. It is \nstipulated that a stream sediment and water duplicate should be collected within 25 m of the original \nsample. \n \nDry Sites \nDuring periods of prolonged dryness small first-order streams in the UK may dry out so collecting a \nwater sample is not possible. However, the stream sediment and panned concentrate can still be \nsampled. The 2000 µm sieve can be used to collect approximately  5 kg of material and stored in \nlabelled self-seal polythene bags. If the material is predominantly clay, less material needs to be \ncollected and if the sample is still moist then  dry sieving will not be appropriate and larger stones and \nfragments are removed by hand. The bulk sample can be carried to the next wet site or base camp for \nsubsequent wet-sieving and panning. \n \nBefore leaving the site, as was performed on arrival, all equipment should be thoroughly rinsed to \nremove traces of particulate material to avoid between site contamination. The field form should be \nchecked to ensure that all observations have been noted. If any field observations are not applicable at \na site, e.g. there is no contamination, the relevant box should be struck through so it is clear that the \nobservation was investigated but there was nothing to record. Finally, on departure, the site should be \n 9\nclear with all of the samples and field equipment packed in the rucksacks ready to be taken to the next \nsite. \n \nOn return to field base stream sediment samples require careful handling. At the end of each sampling \nday the field team leader and assistant will go through a procedure of checking samples in by marking \nchecklists confirming the sample numbers are readable and correct. The paper sample bags should be \nhung up to air dry. The Kraft™  paper sample bags will allow water to seep out but not the fine \nsediment. However, the samples should not be dried until they are rock hard, the paper bag should be \ndry and the sediment having a plastic consistency. Wet paper bags left unattended will rot in a very \nshort time and samples will be lost. \n \nControl Samples \nAn important part of the sampling methodology relates to the use of control samples in order that the \ndata can be quality controlled and quality assured (see Johnson et al., this volume). While it is only \nduplicates that are created during the sampling process, these, along with replicates, blanks (for waters) \nand secondary reference materials need to be assigned sample numbers so they are included as part of \nthe routine sample submission and are “blind” to the analyst. Duplicate samples are collected from a \nsingle site according to the procedures described earlier. A pair of duplicate samples (i.e. a normal \nsample and an additional sample collected at the same site) help to define the within site sampling \nuncertainty.  Each sample of the duplicate pair can be split in the laboratory (again following a strictly \ndefined procedure) to give replicates. Replicates help to define any laboratory or within sample \nuncertainty. For waters a blank sample is created from de-ionised water and acidified in the same \nmanner as normal water samples. This acts as a check to see if any contaminants are added during the \nprocess of sample acidification and sample storage. Nested ANOVA analysis of the duplicate and \nreplicate samples (Sinclair, 1983) can be used to assign the source of variability between sample sites, \nwithin sites and between sites. The point of such an analysis is to demonstrate the validity of the \nsampling strategy. It is obviously highly desirable to have the maximum variance attributed to between \nsites variability. If the combined sampling and analytical variance (i.e. within site and within sample \nvariance) exceeds 10% then there are issues with the sampling strategy that need to be explained. A \ncommon cause of a high analytical variance is when element results are at or near the lower limit of \ndetection. \n \nThe G-BASE project collects samples in random number order (Plant, 1973) as this helps to identify \nany correctable systematic errors introduced during sample preparation and analysis, processes in \nwhich the samples are handled in numeric order. For every block of one hundred numbers, five \nnumbers are reserved for control samples so when they are submitted within a batch of samples they \nare “blind” to the analyst. The control samples inserted are one duplicate sample, two replicate samples \nand two secondary reference materials (SRM) used to monitor accuracy and precision as well as to \nlevel data between different field campaigns (see Johnson et al., this volume). Including the original \nsample of the duplicate pair this means 8% of samples submitted are control samples, a point not to be \nover looked in setting the budget for analyses.  \n \nThese blind control samples are in addition to any primary reference materials (PRM) that the \nlaboratory may also analyse. For the G-BASE project the BGS laboratories usually insert a PRM at the \nbeginning and end of each batch of five hundred samples. As G-BASE generally collects and analyses \n2000-3000 samples each field campaign eight percent of the samples is more than adequate to carry out \nquality control procedures. However, if sample number are less than 500 it is recommended that the \nnumber of duplicates and replicates per hundred samples should be doubled. \n \nHealth and Safety \nHealth and safety considerations should be an important part of planning a drainage sampling \ncampaign and instruction on health and safety issues must be given to sampling teams before they \ncommence work. Apart from the obvious duty of care a project manager has for their sampling team \nand the samplers have for each other, serious accidents to personnel can seriously disrupt or terminate a \nsampling program. It is surprising how often samplers or labourers employed to collect and carry \nsamples, often involving crossing or working near deep water, have never been asked such a \n 10\nfundamental question as to whether they could swim. A risk assessment should always be part of a \nsampling plan whether or not it is a statutory requirement of the country of work. A summary of the G-\nBASE project health and safety concerns and mitigating actions are given in Table 5. In urban areas the \nhealth and safety aspects of working in heavily polluted culverted streams makes it essential that the \nfield geochemists have the assistance and involvement of municipal authorities during the sampling. \n \nDISCUSSION \nSampling equipment \nFor collecting drainage samples the fundamental piece of equipment is the sieve set and this is shown \ndiagrammatically in Figure 5. This is the wooden sieve set with nylon mesh that has been used \nthroughout the history of BGS G-BASE project and has a proven history of robustness. The use of a \nnylon sieve mesh and wooden sieve relate to a desire to minimise any contamination that may be \nintroduced through sampling equipment. Plastic polymer sieve sets are currently undergoing trials on \nseveral BGS projects. Steel equipment can introduce elements such as V, Cr, Mn and W and plastics \ncan contain high levels of Cd and Sb. Similarly sample bags and water containers have to be free of \nsources of contamination. Water containers can be particularly problematical if they for example \ncontain metal foil-inserts in the cap or are made of plastic from which trace elements can readily be \nleached by the acidic water sample. \n \nThe sieve set can readily be adapted to suit the working environment. For the BGS reconnaissance \ngeochemical mapping in the tropical climate of Sumatra (at a sampling density of approximately one \nsediment per 15 km2 - Stephenson et al., 1982, and Muchsin et al., 1997) the 2000 µm mesh sieve was \nused but not the 150 µm sieve - the fine sediment sieving was carried out in the laboratory. In the semi-\narid Anti-Atlas Mountains (geochemical exploration with drainage sediments at one sample per km2) \nthe sieve sets were reduced in diameter to 25 cm to lighten the load samplers had to carry in the hot \nclimate. These were equally efficient at sieving dry sediment. Orientation work in this Moroccan \nenvironment, where the streams where predominantly dry for more than 10 months in the year, showed \nthat a coarser stream sediment fraction was more suitable for defining anomalies associated with \nmineralization (British Geological Survey, 1999a). BGS’s ongoing geochemical sampling in \nMadagascar has not used sieve sets and is instead using just flat wooden framed sieve screens sieving \ndirectly into a collecting pan. This greatly reduces the amount of equipment samplers have to carry but \nwill increase sampling error due to the greater risk of unsieved material entering the pan. The G-BASE \nproject has a preference for wet sieving as fine particles are more likely to be disaggregated than in \ndried sediment where the fine fraction of the sediment may form concretions of larger particle size. \n \nInformation collected at site is generally recorded onto a field form then later entered into a database on \na PC. BGS has tested hand-held computers, with GPS attachment, for inputting data directly into a \ndigital field database (Scheib, 2005). Although these offer the potential for greater efficiency in \ncreating the field database, they still have an unproven reliability in areas of difficult terrain and \nextremes of climate, and are not suitable for use by untrained samplers. GPS has greatly assisted in the \naccurate positioning of sample sites but where reliable topographic maps are available grid references \nfrom these are still the prime locational reference. It should be borne in mind that in steep-sided stream \ngorges or wooded areas GPS units can report inaccurate coordinates. \n \nRepresentative nature of drainage sediments \nMuch literature is available on just what a drainage sediment represents, particularly with respect to \ntrying to trace anomaly trains from mineralization (e.g. Hawkes, 1976; and Ottesen and Theobold, \n1994). Potentially, drainage sampling has a great advantage over other types of sample media (such as \nsoil or rock sampling) which have a much reduced area of representativity and are far more \ninhomogeneous. Soil sampling presents considerable problems for regional geochemical mapping \nbecause of: the variation in soil types; the variable nature of horizons and the depths at which they \noccur; the limited cover in upland areas; and the wide variation in pH and Eh in soils which critically \naffects the solubility and concentration of metals (Plant and Moore, 1979). However, Plant and Moore \n(1979) do concede that soils may be the optimum medium in agricultural areas of lowland England \nparticularly for larger scale geochemical maps. \n 11\n The nature of the processes that combine to produce the water or detritus at a stream sampling site \nmean that it is unlikely that the sample is truly representative of the entire drainage basin upstream \nfrom the site (Ottesen et al., 1989; Bölviken et al., 2004; and Peh et al., 2006). While the fine sediment \nof overbank and flood plain alluvium in certain environments can be more representative of the \ndrainage catchment, generally they have more limited applicability because they are a composite from \na very broad area on account of the order of the drainage basin with which they are associated. The \nlong established and widely employed method of stream sediment sampling (see listing in Plant et al., \n1988, 1997) testify to the fact that this method is the preferred method of regional mapping that, \nproviding the sampling procedure has been strictly followed, consistently produces satisfactory \nregional geochemical maps. There are specific parts of the procedure (e.g. the settling of the fine \nsediment) that are designed to address some of the issues of representativity (see discussion at the end \nof Plant and Moore, 1979) and further emphasises the importance of following instructions in a precise \nmanner. \n \nThere are circumstances where the drainage sample does not represent material derived from the basin \nupstream of the site and these should be dealt with at the orientation phase of the project. Such \ncircumstances would include wind blown material collecting in the drainage channel or exotic \nmaterials introduced to the drainage basin through anthropogenic activity.  \n \nAnthropogenic activity has significantly impacted on drainage basin systems throughout the world \n(Owens et al., 2005). Even in the more remote inaccessible regions of the world such as the Amazon \nbasin or the jungles of SE Asia logging activities have significantly changed rainwater run-off and \npercolation and resulted in huge volumes of soil entering the stream system more rapidly than under \nnatural undisturbed conditions (Fletcher and Muda, 2005). Humans have dammed, straightened, \ndredged and redirected rivers throughout history. Although most nations of the world are now more \nappreciative of the importance of good environmental management of river systems there are still many \neconomically less developed communities that would see the river system as the principal means of \nremoving waste and rubbish. If the strategy of the sampling is to determine the presence of \nanthropogenic contamination, then sampling sites should not seek to avoid these effects. If the survey is \nconcerned with the natural baseline, then anthropogenic effects should be actively avoided by the \nappropriate selection of sampling sites, such as avoiding old mine dumps or always sampling upstream \nof urban areas.  \n \nUrban environments provide a particularly challenging environment for drainage sampling. For \nexample in 2003 BGS adapted its standard regional drainage sampling methods to carry out a drainage \nsurvey of the city of Glasgow, Scotland (Fordyce et al., 2004). Access to sampling sites was difficult in \nthe city environment and the project was greatly helped by the involvement of Glasgow City Council. \nThe adaptability of the drainage sampling method for use in both rural and urban environments enabled \na direct comparison between rural and urban sediments and waters. A quantitative assessment of the \nimpact of urbanisation and industry can then be made by comparing the rural and urban areas with \nsimilar geological settings. The Glasgow urban survey saw the G-BASE project involved for the first \ntime in the analysis of drainage samples for organic compounds (Total Petroleum Hydrocarbons \n(TPH); Polycyclic Aromatic Hydrocarbon (PAH); Poly-Chlorinated Biphenyls (PCB) and Organo-\nTin). The survey highlighted the many difficulties and procedural changes that were needed in the \ncollection and storage of drainage sediment samples to be analysed for organic compounds. \n \nThe introduction of wind blown sediment from outside the drainage basin is not a problem in the \nUnited Kingdom but it was an issue that BGS had to address during orientation studies for \nreconnaissance geochemical mapping in the semi-arid Anti-Atlas mountains of Morocco. As the area \nwas located to the north of the Sahara Desert, there was more than ample evidence of wind blown \ndeposits and a sampling strategy had to be devised to minimise any dilution by wind-blown sediment. \nThe orientation was carried out by the chemical analysis of many fraction sizes of the stream sediment \nalong stream channels down from mineralised and unmineralised areas. This work suggested a coarser \nfraction of sediment ( -250 µm) was more appropriate for this type of climatic zone (British Geological \nSurvey, 1999a).  Evidence from Ti\/Zr ratios suggested some aeolian dilution was present in the finest -\n63  µm fraction (Dickson and Scott, 1998). \n \n 12\nA further frequently raised issue concerning representativity relates to the as yet undiscussed dimension \nof time. Concerns of temporal variability are often aired when geochemical maps based on drainage \nsamples collected over many years are compiled. This is particularly the case for stream waters where \neven daily let alone seasonal variations in the water system might be expected to cause considerable \nvariability in element concentrations. Geochemical maps produced by BGS have consistently shown \nthat this is not the case and is a tribute to the robustness of the sampling method. In the stream water \ngeochemical atlas of Wales (British Geological Survey, 1999b), in spite of the documented influence \nthat temporal variations are known to have on stream water composition, it is spatial controls that \npredominate at a regional scale (Hutchins et al., 1999). Indeed, analytical uncertainty in the \ngeochemical maps is probably more significant than any temporal variations. The drainage sampling of \nthe Tellus Project in Northern Ireland in 2004 extended the stream sediment and water sampling carried \nout by the G-BASE project in 1994-1996. Again, compilation of the two data sets derived from \nsamples collected more than ten years apart shows the dominance of spatial controls over temporal \nones. \n \nOther drainage site media \nThis account has been specifically concerned with stream sediments, stream waters and panned heavy \nmineral concentrates, all collected from the same site. For the G-BASE project the stream sediments \nand stream waters are submitted for inorganic chemical analyses, water samples benefiting by \nimprovements to detection limits in the past decade enabling ultra-low element concentrations to now \nbe reported. The panned heavy mineral concentrates have not generally been analysed unless follow-up \nwork has been carried out. However, all are inspected at site and observed minerals and contaminants \nare recorded. The samples are an excellent resource for identifying drainage catchment mineralisation \nand lithologies as well as anthropogenic contamination (Photograph 1). Indeed, all the G-BASE excess \nsamples are stored at the National Geological Data Centre, Keyworth, UK and are available for further \nstudy. The value of excess sample powders in research should not be underestimated. \n \nThe availability of other sample media at a drainage site has been briefly mentioned previously. The \ndirty water filters with the > 45 µm suspended sediment captured on the filter disks could be very \nuseful in studies of the suspended-sediment load. The Fe and Mn coatings on pebbles and other \nchemical precipitates (e.g. insoluble iron hydroxides) could also be collected as these are known to \nhave good scavenging properties for certain trace elements. \n \nCONCLUSIONS \n1. Drainage samples, specifically stream waters and sediments in this account, have a long and well-\nestablished use in geochemical and environmental studies and given the right climatic and \ngeomorphological conditions, should be the sampling media of choice. \n2. A single drainage site enables the environmental scientists to study several different media at one \nlocation, each of which can assist in interpreting the chemical behaviour and distribution of an \nelement in the surface environment. \n3. There are issues relating to how representative of the drainage catchment results from drainage \nsamples are. Geochemical maps from many areas of the world have repeatedly proven the accurate \nrepresentation of drainage basin geochemistry using stream sediments. \n4. Representativity can be addressed in an orientation phase of a project and can be satisfied by \nfollowing strict well-documented procedures. Such procedures will address issues of health and \nsafety as well as quality control. \n5. There is surprisingly little temporal control on the spatial patterns on water or stream sediment \ngeochemical maps where samples may have been collected over periods of many years. Analytical \nmethod variability over a period of time is generally a bigger problem than any temporal effects \nwhen creating seamless geochemical maps for drainage samples collected over a long period of \ntime. \n \n \n \n \n 13\nACKNOWLEDGEMENTS \n \nThis chapter is published with the permission of the Director of the British Geological Survey (NERC). \nFigures  1 and 6 were  prepared by Lauren Noakes and Henry Holbrook respectively (both BGS). \n \n \n \nREFERENCES \nAndrews-Jones, D.A.. 1968. The application of geochemical techniques to mineral exploration. \nColorado School of Mines, Mineral Indus. Bull., 11, No 6. \nBolviken, B., Bogen, J., Jartun, M., Langedal, M., Ottesen, R.T., Volden, T. 2004. Overbank \nsediments: a natural bed blending sampling medium for large - scale geochemical mapping. \nChemometrics And Intelligent Laboratory Systems, Vol. 74, 183-199. \nBritish Geological Survey. 1999a. Résultats de l'étude d'orientation et analyses chimiques des \"Stream \nSediments\" dans le domaine de l'Anti-Atlas (Maroc). British Geological Survey Report prepared for \nthe Moroccan Ministry of Mines and Energy, Rabat, Morocco. \nBritish Geological Survey. 1999b. Regional geochemistry of Wales and part of west-central England: \nstream water. (Keyworth, Nottingham: British Geological Survey.)  ISBN 0 85272 363 6. \nCaley, E.R., Richards, J.F.C. 1956. Theophrastus on Stones: Introduction Greek Text, English \nTranslation, and Commentary. (Columbus, Ohio, USA: The Ohio State University.)  \nCooper, D.C., Thornton, I. 1994. Drainage geochemistry in contaminated terrains. 447-497 in \nDrainage Geochemistry. Hale, M., and Plant, J.A. (editors). Handbook of Exploration Geochemistry, 6. \n(Amsterdam: Elsevier.) \nDarnley, A.G., Bjorklund, A., Bolviken, B., Gustavsson, N., Koval, P.V., Plant, J.A., Steenfelt, A., \nTauchid, M., Xuejing, X. 1995. A global geochemical database for environmental and resource \nmanagement. UNESCO publishing, 19. \nDickson, B.L., Scott, K.M. 1998. Recognition of aeolian soils of the Blayney district, NSW: \nimplications for mineral exploration. Journal of Geochemical Exploration, Vol. 63, 237-251. \nEttler, V., Mihaljevic, M., Sebek, O., Molek, M., Grygar, T., Zeman, J. 2006. Geochemical and Pb \nisotopic evidence for sources and dispersal of metal contamination in stream sediments from the \nmining and smelting district of Pribram, Czech Republic. Environmental Pollution, Vol. 142, 409-417. \nFersman, A.E. 1939. Geochemical and mineralogical methods of prospecting for useful minerals.  in \nU.S. Geol. Surv. Circ. 127, 1952, 37pp. (US Geological Survey.) \nFletcher, W K, Muda, J. 2005. Dispersion of gold in stream sediments in the Sungai Kuli region, \nSabah, Malaysia. Geochemistry: Exploration, Environmental, Analysis, Vol. 5, 211-214. \nFordyce, F.M., Dochartaigh, B.É.Ó., Lister, T.L., Cooper, R., Kim, A.W., Harrison, I., Vane, C.H., \nBrown, S.E. 2004. Clyde Tributaries: Report of Urban Stream Sediment and Surface Water \nGeochemistry for Glasgow. British Geological Survey, Keyworth, UK, Commissioned Report No. \nCR\/04\/037. \nGonÇalves, M.A., Nogueira, J.M.F., Figueiras, J., Putnis, C.V. 2004. Base-metals and organic content \nin stream sediments in the vicinity of a landfill. Applied Geochemistry, Vol. 19, 137-151. \nHale, M. 1994. Strategic choices in drainage geochemistry. 111-144 in Drainage Geochemistry. Hale, \nM., and Plant, J.A.. (editors). Handbook of Exploration Geochemistry, 6. (Amsterdam: Elsevier.) \nHale, M., Plant, J.A. 1994. Drainage Geochemistry. Handbook of Exploration Geochemistry. No. 6. \n(Amsterdam: Elsevier.)  \nHawkes, H.E. 1976. The downstream dilution of stream sediment anomalies. Journal of Geochemical \nExploration, Vol. 6, 345-358. \nHawkes, H.E., Bloom, H. 1955. Heavy metals in stream sediment used as exploration guides. Mining \nEngineer, Vol. 8, 1121-1126. \n 14\nHutchins, M.G., Smith, B., Rawlins, B.G., Lister, T.R. 1999. Temporal and spatial variability of stream \nwaters in Wales, the Welsh borders and part of the West Midlands, UK. 1. Major ion concentrations. \nWater Research, Vol. 33, 3479-3491. \n \nInstitute of Hydrology. 2003. Hydrological data UK. Hydrometric Register and Statistics 1996-2000. \n(Institute of Hydrology, NERC, Wallingford, England.)  \nISO 5667-12:1995. Water quality - Sampling - Part 12: Guidance on sampling of bottom sediments. \nJohnson, C.C. 2005. 2005 G-BASE Field Procedures Manual. British Geological Survey, Keyworth, \nUK, Internal Report No. IR\/05\/097. \nJohnson, C.C, Lister, T.R., Flight, D.M.A., Ander, E.L. 2007. Data conditioning of environmental \ngeochemical data: quality control procedures used in the British Geological Survey’s Regional \nGeochemical Mapping Project.  Chapter ?? in this book.  \nJohnson, C.C., Breward, N., Ander, E.L., Ault, L. 2005. G-BASE: baseline geochemical mapping of \ngreat Britain and northern Ireland. Geochemistry-Exploration Environment Analysis, Vol. 5, 347-357. \nJohnson, C.C., Flight, D.M.A., Lister, T.R., Strutt, M.H. 2001. La rapport final pour les travaux de \nrecherches géologique pour la realisation de cinq cartes géochimique au 1\/100 000 dans le domaine de \nl'Anti-Atlas (Maroc). British Geological Survey Confidential Internal Report prepared for the \nMoroccan Ministry of Mines and Energy, Commissioned Report Series, No.CR\/01\/031. \nLee, S., Moon, J-W., Moon, H-S. 2003. Heavy metals in the bed and suspended sediments of Anyang \nRiver, Korea: Implications for water quality. Environmental Geochemistry And Health, Vol. 25, 433-\n452. \nLovering, T.S, Huff, L.C., Almond, H. 1950. Dispersion of copper from the San Manuel copper \ndeposit, Pinal County, Arizona. Economic Geology, Vol. 45, 493-514. \nMuchsin, M., Johnson, C.C., Crow, M.J., Djumsari, A., Sumartono. 1997. Atlas Geokimia Daerah \nSumatera Bagian Selatan\/ Geochemical Atlas of Southern Sumatra. Regional Geochemical Atlas \nSeries of Indonesia. No. 2. (Directorate of Mineral Resources, Bandung, Indonesia and British \nGeological Survey, Keyworth, UK.)  \nOttesen, R.T., Bogen, J., Bölviken, B., and Volden, T. 1989. Overbank sediment: a representative \nsample medium for regional geochemical mapping. Journal Of Geochemical Exploration, Vol. 32, \n257-277. \nOttesen, R.T., and Theobold, P.K. 1994. Stream sediments in mineral exploration. 147-184 in \nDrainage Geochemistry. Hale, M., and Plant, J.A. (editors). Handbook of Exploration Geochemistry, 6. \n(Amersterdam: Elsevier.) \nOwens, P.N., Batall, R.J., Collins, A .J., Gomez, B., Hicks, D.M., Horowitz, A .J., Kondolf, G.M., \nMarden, M., Page, M.J., Peacock, D.H., Petticrew, E.L., Salomons, W., Trustrum, N.A. 2005. Fine-\ngrained sediment in river systems: Environmental significance and management issues. River Research \nand Applications, Vol. 21, 693-717. \nPeh, Z., Miko, S., and Mileusnic, M. 2006. Areal versus linear evaluation of relationship between \ndrainage basin lithology and geochemistry of stream and overbank sediments in low-order \nmountainous drainage basins. Environmental Geology, Vol. 49, 1102-1115. \nPlant, J.A. 1971. Orientation studies on stream sediment sampling for a regional geochemical survey in \nnorthern Scotland. Transactions of the Institute Mining & Metallurgy, Vol. 80, 323-346. \nPlant, J.A. 1973. A random numbering system for geological samples. Transactions of the Institute \nMining & Metallurgy, Vol. 82, 63-66. \nPlant, J.A, Hale, M., Ridgeway, J. 1988. Developments in regional geochemistry for mineral \nexploration. Transactions of the Institute of Mining and Metallurgy, B. Applied Earth Science, Vol. 97, \n116-140. \nPlant, J.A, Klaver, G., Locutura, J., Salminen, R., Vrana, K., Fordyce, F.M. 1997. The Forum of \nEuropean Geological Surveys Geochemistry Task Group: geochemical inventory. Journal Of \nGeochemical Exploration, Vol. 59, 123-146. \n 15\nPlant, J.A., Moore, P.J. 1979. Geochemical mapping and interpretation in Britain. Philosophical \nTransactions of the Royal Society, Vol. B288, 95-112. \nPlant, J.A., Raiswell, R.W. 1994. Modifications to the geochemical signatures of ore deposits and their \nassociated rock in different surface environments. 73-109 in Drainage Geochemistry. Hale, M., and \nPlant, J.A. (editors). Handbook of Exploration Geochemistry, 6. (Amsterdam: Elsevier.) \nRanasinghe, P.N., Chandrajith, R.L.R., Dissanayake, C.B., Rupasinghe, M.S. 2002. Importance of \ngrain size factor in the distribution of trace elements in stream sediments of tropical high grade terrains \n– A case study from Sri Lanka. Chemie der Erde Geochemistry, Vol. 62, 243- 253. \nSalminen, R., Batista, M.J., Bidovec, M., Demetriades, A., De Vivo, B., De Vos, W., Duris, M., \nGilucis, A., Gregorauskiene, V., Halamic, J., Heitzmann, P., Lima, A., Jordan, G., Klaver, G., Klein, \nP., Lis, J., Locutura, J., Marsina, K., Mazrek, U.A., O'Connor, P.J., Olsson, S.Å., Ottesen, R.T., \nPetersell, V., Plant, J.A., Reeder, S., Salpeteur, I., Sandström, H., Siewers, U., Steenfelt, A., Tarvainen, \nT. 2005. Geochemical Atlas of Europe. Part 1 - Background Information, Methodology and Maps. \nGeochemical Atlas of Europe. (Geological Survey of Finland.)  ISBN 951-690-921-3 \nSalminen, R., Tarvainen, T., Demetriades, A., Duris, M., Fordyce, F.M., Gregorauskiene, V., Kahelin, \nH., Kivisilla, J., Klaver, G., Klein, P., Larson, J.O., Lis, J., Locutura, J., Marsina, K., Mjartanova, H., \nMouvet, C., O’Connor, P., Odor, L., Ottonello, G., Paukola, T., Plant, J.A., Reimann, C., Schermann, \nO., Siewers, U., Steenfelt, A., Van der Sluys, J., De Vivo, B., Williams, L. 1998. FOREGS \ngeochemical mapping field manual. Geological Survey of Finland, Guide 47. \nScheib, A.. 2005. G-BASE Trials of SIGMA Digital Field Data Capture; Feedback and \nRecommendations. British Geological Survey, Keyworth, UK, Internal Report No. IR\/05\/015. \nSchreck, P., Schubert, M., Freyer, M., Treutler, H.C., Weiss, H. 2005. Multi-metal contaminated \nstream sediment in the Mansfeld mining district: metal provenance and source detection. \nGeochemistry-Exploration Environment Analysis, Vol. 5, 51-57. \nSinclair, A.J. 1983. Univariate Analysis. 57-81 in Statistics and Data Analysis in Geochemical \nProspecting. Howarth, R.J. (editor). Handbook of Exploration Geochemistry, 2. (Amsterdam: \nElsevier.) \nStephenson, B., Ghazhali, S.A., and Harwidjaja. 1982. Regional Geochemical Atlas of Northern \nSumatra. Regional Geochemical Atlas Series of Indonesia. No. 1. (Directorate of Mineral Resources, \nBandung, Indonesia and British Geological Survey, Keyworth, UK.)  \nStrahler, A.N. 1957. Quantitative analysis of watershed geomorphology. Transactions of American \nGeophysical Union, Vol. 38, 913-920. \nThornton, I., and Webb, J.S. 1979. Geochemistry and health in the United Kingdom. Philosophical \nTransactions of the Royal Society, Vol. B288, 151-168. \nWebb, J.S., and Howarth, R.J. 1979. Regional geochemical mapping. Philosophical Transactions of the \nRoyal Society, Vol. B288, 81-93. \nWertime, T.A. 1973. The beginning of metallurgy: a new look. Science, Vol. 182, 875-887. \nWilliams, T.M., Dunkley, P.N., Cruz, E., Actimbay, V., Gaibor, A., Lopez, E., Baez, N., Aspden, J.A. \n2000. Regional geochemical reconnaissance of the Cordillera Occidental of Ecuador: economic and \nenvironmental applications. Applied Geochemistry, Vol. 15, 531-550. \n \nYoung M.E., Smyth, D. 2005. New geoscience surveys in Northern Ireland. European Geologist, \nNo.19, pp. 24-26. European Federation of Geologists, Brussels, Belgium \n \n \n \n \n \nList of Photographs \n \nPhotograph 1: Anthropogenic contamination seen in heavy mineral panned \nconcentrates. \n 16\n \n \nList of  Tables \n \nTable 1 : Explanation of terms used in drainage sampling \n \nTable 2: Summary of some typical element associations found in stream sediments  \n \nTable 3: Relative mobility of elements in the different surface environments  \n \nTable 4: List of sampling equipment for collecting stream sediments, stream waters \nand panned concentrates as used by the G-BASE project \n \nTable 5: Summary of the main health and safety issues for the G-BASE project in the \nUK and suggested mitigating actions \n \n \nList of Figures \n \nFigure 1: Example of the delineation of drainage basins by watershed and the Strahler \n(1957) system for determining stream order \n \nFigure 2: An example from the G-BASE project of a gridded image for arsenic in \nstream sediments (top) and stream waters (bottom) from Eastern England \n \nFigure 3: Example of field form used for recording information at a drainage sample \nsite  \n \nFigure 4: Organisational chart of personnel for a typical sampling project  \n \nFigure 5: Diagram of a nested sieve set used for stream sediment sampling  \n \nFigure 6: A typical sediment sampling site (temperate zone) for 1st or 2nd order stream  \n \nFigure 7: Flow chart summarising the procedures at a drainage site for the collection \nof stream water, sediment and heavy mineral concentrate.\n 17\n \n \n \n \n \nPhotograph 1: Anthropogenic contamination observed in some G-BASE panned \nheavy mineral concentrates. Top – Sample 307349P showing oxidised lead shot. \nBottom – Sample 307364P showing steel shot and a flake of paint. \n 18\n \n \nTERM DEFINITION \nAlluvium a recent deposit of sand, mud, etc., formed by flowing water \nConfluence where two streams merge. If the streams are of equal size then the \nconfluence is often referred to as a “fork” \nDispersion train is a feature of variable length found extending downstream from a point \nand defined by the decreasing presence of a mineral or chemical element \nDrainage basin a region of land where water from precipitation (or snowmelt) drains \ndownhill into a body of water such as a stream. Drainage basins are \ndivided from each other by topographic barriers called a watershed. Also \nreferred to as drainage catchment, water basin or drainage area. Drainage \nbasins can be nested together to form larger basins that can be described \nby the rank of the largest river, e.g. 4th order drainage basin \nEphemeral a term used to describe a stream that forms only during or immediately \nafter precipitation \nFloodplain sediment alluvium accumulated adjacent to high-order stream \nHeadwater the section of the stream closest to its source where a discernable stream \nbed can be identified \nHeavy mineral concentrate in this context is a sub-sample of the stream sediment that has been \ncreated by separating out the heavier minerals present in the stream \nsediment. The most common way of doing this is by panning the sediment \nto give a panned concentrate \nHydrology the science dealing with the occurrence, circulation, distribution, and \nproperties of the waters of the earth and its atmosphere \nIntermittent a term used to describe a stream that only flows for part or parts of the \nyear \nMouth the point at which the stream discharges into a “static” body of water such \nas a lake or ocean \nOverbank sediment alluvium accumulated adjacent to low-order stream \nPerennial a term used to describe a stream that flows all year \nRiver a large natural stream \nSource a spring from which the stream emerges or other point of origin \nSpring the point at which a stream emerges at the land surface \nStream a body of water with a detectable current confined within a bed and banks. \nA general term applied to all flowing natural waters regardless of size. \nRegional names may be used such as beck, bourne, brook, burn, kill, \ncreek or run \nStream bed the base of a stream \nStream order hierarchical system of ranking streams whereby low-order streams are \nsmall and high-order streams big \nStream sediment represents a composite sample of detrital material derived from the \ndrainage basin upstream of the sample site. Typically composed of \nweathered bedrock and material derived from overburden and is generally \napplied to the <2 mm fraction. Anything bigger than this is generally \nreferred to as clasts, pebbles, stones or boulders \nThalweg is the stream’s longitudinal section, i.e. a line joining the deepest point in \nthe channel at each stage from source to mouth \nTributary a stream joining another stream. When streams of similar size join they \nare referred to as a “branches”  \nWatershed is a topographic feature dividing drainage basins though American \nterminology would actually refer to the whole area enclosed by the \ntopographic feature as the watershed \n \nTable 1 : Explanation of terms used in drainage sampling \n \n \n 19\n Geological or environmental features Principal associated elements and element ratios \nCarbonate rocks  (limestones, dolomites, calc-schist) CaO    Sr    MgO \nArgillaceous and pelitic source rocks Li       B       Ga \nArgillaceous Red Beds (eg Mercia Mudstone) with evaporites K2O   MgO   Sr    Se \nBlack shales and graphitic schists  \nBa   Mo   V   U    \nCu   Ni  Ag  Se  Cd \nSedimentary ironstones Fe2O3    As    P2O5    U \nBasic igneous rocks in unmineralised areas MgO  TiO2   Ni  Cu  V\/Cr \nUltrabasic rocks and derived sediments Cr     MgO    Ni    Cr\/V \nEvolved granites \nBe  Li  U   Sn   Rb\/K2O \n Y  La Mo  \n‘Normal’ Granites  Be   K2O  Rb   U   Li   Sr  \nGranodiorites and some intermediate igneous rocks Be   Sr   Ca   K2O   \nResistate elements for sediment provenance variation,  \nespecially in greywackes and arenites \nLa  Y  Zr  TiO2  Th Ce  Nb \n- and ratios of these. \nGeneralised Urban – industrial contamination Sn   Pb   Cu   Sb   Cd   Zn \nIndustrial contamination – heavy engineering \nSn   Pb   Cu   Sb   Cd   Zn Cr  Ni  \nV  Mn \nSecondary hydrous oxide formation in stream sediments Mn    Co      As  Al   Fe2O3\n \n \nMineralisation (vein type sulphide) Pb  Zn  Ba   Cu  Cd  Sb  Bi As \nMineralisation  (Red-bed type) Ba     Cu     Bi    Ag      \nMineralisation  (porphyry type) Mo    Cu     Sb \nGold mineralisation (‘pathfinder’ elements) As      Sb      Bi \nTable 2: Summary of some typical element associations found in stream \nsediments (elements in italics are not of primary importance in the association) \n \n \n \n \n 20\n \n \nEnvironmental Conditions Relative \nmobilities Oxidising Acid Neutral to alkaline Reducing \nVery high Cl, I, Br Cl, I, Br Cl, I, Br Cl, I, Br \n S, B S, B S, B  \n   Mo, V, U, Se, Re  \n     \nHigh Mo, V, U, Se, Re Mo, V, U, Se, Re   \n Ca, Na, Mg, F, Sr, Ra Ca, Na, Mg, F, Sr, Ra Ca, Na, Mg, F, Sr, Ra Ca, Na, Mg, F, Sr, Ra \n Zn Zn   \n  Cu, Co, Ni, Hg, Ag,Au   \n     \nMedium Cu, Co, Ni, Hg, Ag,Au    \n As, Cd As, Cd As, Cd  \n     \nLow Si, P, K Si, P, K Si, P, K Si, P, K \n Pb, Li, Rb, Ba, Be Pb, Li, Rb, Ba, Be Pb, Li, Rb, Ba, Be  \n Bi, Sb, Ge, Cs, Tl Bi, Sb, Ge, Cs, Tl Bi, Sb, Ge, Cs, Tl  \n  Fe, Mn Fe, Mn Fe, Mn \n     \nVery low  Fe, Mn    \nto Al, Ti, Sn, Te, W Al, Ti, Sn, Te, W Al, Ti, Sn, Te, W Al, Ti, Sn, Te, W \nimmobile Nb, Ta, Pt, Cr, Zr Nb, Ta, Pt, Cr, Zr Nb, Ta, Pt, Cr, Zr Nb, Ta, Pt, Cr, Zr \n Th, Rare Earths Th, Rare Earths Th, Rare Earths Th, Rare Earths \n   Zn Zn \n   Cu, Co, Ni, Hg, Ag, Au Cu, Co, Ni, Hg, Ag, Au \n    S, B \n    Mo, V, U, Se, Re \n    As, Cd \n    Pb, Li, Rb, Ba, Be \n    Bi, Sb, Ge, Cs, Tl \n \n \n \n \nTable 3: Relative mobility of elements in the different surface environments \n(taken from Plant and Raiswell, 1994 based on that of Andrews-Jones, 1968)  \n \n \n 21\n \nITEM COMMENTS \nGeneral  \nTopographic maps of field area Scale as required by project. Need to have clean copies to be used as “master \nplots” and working copies for daily use by samplers \nGeological and other maps Maps such as geology, land-use, soil type etc. to help provide samplers with \nsupplementary information about sites and catchments \nBinocular microscope and lamp Used to assist identification of panned concentrate minerals\/contaminants  \nField forms and folders Field forms as illustrated in Figure 3 and a folder to keep them dry and clean. \nIdeally could be replaced by hand held computer devices \nStationery Permanent ink markers, biro, pencils, elastic bands, etc. \nCommunication devices Mobile phones or short-wave radio if no mobile phone coverage \nSample number checklist Used for allocating numbers and collating samples \nID passes and letters Sampling will attract local attention and a sampler’s ID and their mission \nneeds to be clearly stated and permitted \nFirst aid kit To include survival aids such as whistle and survival bags if needed \nHigh visibility jackets Required in all working environments \nRucksacks Each sampling pair require an equipment rucksack and a sample rucksack \nGeological hammer and hand lens Goggles to be used when hammering. Hand lens to look at rocks and minerals \nGPS and compass Used for locating sites and navigating \nKnox Protractor Used for measuring and plotting points on maps \nPortable computer If practical in field location a PC can be used to database field data or with \nGIS can be used to plan sampling \nStream Sediment  \nSieve set See Figure 5. Ideally made of wood with nylon mesh fixed together with \nnylon bolts plus fibre glass pan for collecting sediment \nPlastic funnel To be used to help pour sample into sample bag \nRubber gloves To be used to help rub sediment through sieve mesh \nSample bags Kraft™ strong paper 4”x 8” (10 x 20 cm) sample bag stuck with waterproof \nglue. Paper allows sediment to dry. \nPlastic bags and containers for \ntransporting samples \nMiscellaneous plastic bags are required to place samples for transport to \nprevent leakages. Also rigid  plastic containers are useful to protect samples \nin the rucksack \nTrenching tool\/shovel Wooden, polyethylene\/polypropylene, stainless steel with any paint stripped \noff \nStream Water  \nPlastic syringe 25 ml syringes \nMillex™ sealed filters Pre-loaded with 0.45 µm Millipore cellulose filters \nPlastic bags Miscellaneous self-seal plastic bags for keeping dirty and clean equipment \napart \n30 ml polythene bottles For collecting water sample for pH determination in field lab \n250 ml Nalgene™ polythene bottle For collecting water sample to be determined for alkalinity and conductivity \nin the field lab \n30 ml Nalgene™ polythene bottle For collecting filtered unacidified sample (for major anions\/NPOC)  \n60 ml Nalgene™ polythene bottle For collecting filtered acidified sample (for ICP-MA & -AES) \nConc. HNO3 and dropping pipette Used to acidify water samples in field base \nPanned Concentrate  \nPan Variety of types of pan available \nSample bags Kraft™ strong paper 3”x 5” (8 x 13 cm) sample bag \nSuspended load  \nSelf-seal plastic bag 3”x 5” (8 x 13 cm) bag with white panel for storing “dirty” filter from water \nsample collection \nTable 4: List of sampling equipment for collecting stream sediments, stream \nwaters and panned concentrates as used by the G-BASE project \n  \n 22\n 23\nHigh\/Medium risk activity Summary of measures to reduce risk \nDriving in field area • receive appropriate vehicle driving training \n• use vehicle appropriate for type of fieldwork  \nTransporting heavy loads and \nequipment by vehicle \n• do not overload vehicles \n• secure equipment and samples \n• transport acid in special anti-spill containers \nLifting heavy loads\/ loading and \nunloading samples \n• receive manual handling training \n• use appropriate storage crates for sample transportation \n• don't overload storage crates \n• do not load\/unload heavy items alone \nCarrying heavy loads in the field • use good quality rucksacks offering high level of support and \nadjusted appropriately for the carrier \n• share the load between the two samplers \n• sensible handling of load whilst negotiating obstacles (e.g. \npass load across a wall rather than climbing over the wall with \nrucksack still on) \nSampling drainage samples • attend sampling training day \n• dress appropriately with good footwear and always take \nwaterproof clothing \n• stick to recognised paths. Do not take risks crossing barbed \nwire fences\/stone walls or rivers\/streams for the sake of \nmaking a shortcut \nWalking on roads used by frequent \ntraffic \n• always use Hi-vis jackets and rucksacs with Hi-vis strips \n• seek alternative footpaths if available \n• where no footway, walk into oncoming traffic except when \napproaching the brow of a hill \nRemote working • always sample in pairs \n• inform team leaders of proposed route \n• carry emergency telephone contact numbers \nAdverse weather • pay attention to weather forecasts \n• do not sample areas in times of flood \n• take appropriate measures against exposure to the sun \n• during thunderstorms follow standard procedures to avoid \nlightening strikes and in particular don't carry a metal \nequipment  \nAttack by animals • avoid potentially dangerous animals (e.g. bulls and guard \ndogs) where possible by choosing an alternative route \nMilitary, shooting area and other \nhazardous land use \n• always have permission to enter such areas first \n• team leaders to advise samplers of such potential areas on \ntheir map \n• team leaders plan daily sampling areas so hazards such as \nlarge rivers or railways do not have to be crossed \n• always wear Hi-vis jackets \nExposure to infection, agrochemicals \nand pesticides \n• samplers to be advised of dangers on training day \n• avoid contaminated sites or fields being sprayed \n• observe agricultural exclusion notices when encountered in \nthe field \nExposure to substances used by the \nfield team \n• receive training and H&S procedures for handling conc acids \n• glue sediment and pan bags in a well ventilated area, \n \nTable 5: Summary of the main health and safety issues for the G-BASE project \nin the UK and suggested mitigating actions \n \n \n \n \nFigure 1: Example of the delineation of drainage basins by watershed and the \nStrahler (1957) system for determining stream order \n \nThe shaded areas define the watersheds for the drainage basins of first order streams. \nNote that the first order basins are components of a much large drainage basins, here \nthe third order drainage basin is defined by the bold dashed line. According to the \nStrahler system of stream ordering the end tributaries are designated as first order \nstreams. Two first-order streams merge to form a second-order stream segment; two \nsecond-order streams join, forming a third-order and so on. It takes at least two \nstreams of any given order joining to form a stream of the next higher order.\n 24\n  \n \n \n \n \nFigure 2: An example from the G-BASE project of a gridded image for arsenic in \nstream sediments (top) and stream waters (bottom) from Eastern England. Maps \nhave a 10 km grid outline and show how stream water and stream sediment \nmaps can be used in combination to explain the distribution and behaviour of \nelements in the surface environment. The Mesozoic sedimentary ironstone \nreferred to in the text outcrops along a north-westerly line from Skegness. \n 25\nFigure 3: Example of field form used for recording information at a drainage \nsample site\n 26\nPROJECT\nMANAGER\nField Team\nLeader\n(Team A)\nSampling Pair 1\nSampler 1 & 2\nSampling Pair 2\nSampler 1 & 2\nSampling Pair 3\nSampler 1 & 2\nSampling Pair 4\nSampler 1 & 2\nSAMPLING TEAM A\nField Team\nLeader\n(Team B)\nSampling Pair 1\nSampler 1 & 2\nSampling Pair 2\nSampler 1 & 2\nSampling Pair 3\nSampler 1 & 2\nSampling Pair 4\nSampler 1 & 2\nSAMPLING TEAM B\nAssistant\nTeam Leader\nAssistant\nTeam Leader\nTeams C..D...\n \nFigure 4: Organisational chart of personnel for a typical sampling project \n \nFigure 5: Diagram of a nested sieve set used for stream sediment sampling. Top: \ncross-section plan view (dimensions in mm). Bottom: cut-away 3-D visualisation \n(from engineering drawing by Humphrey Wallis, BGS for ABS (acetyl butyl \nstyrene) polymer plastic sieve sets). \n 27\n \n \n \n \n \n \n \n \n \nFigure 6: A typical sediment sampling site (temperate zone) for 1st or 2nd order \nstream \n \n \n \n 28\nSAMPLER 1 SAMPLER 2\nUNPACK AND\nWASH EQUIPMENT\nLABEL WATER\nBOTTLES AND\nSAMPLE BAGS\nINSPECT SITE\nAND STREAM\nCLASTS\nSET UP SIEVE SET\nDETERMINE\nWATER COLOUR\nAND TURBIDITY\nCOLLECT\nFILTERED WATER\nCOLLECT\nUNFILTERED\nWATER\nSIEVE (RUB AND SHAKE)\nSEDIMENT INTO\nCOLLECTING PAN\nCOMPLETE FIELD\nFORM\nDIG SEDIMENT,\nDRAIN AND PLACE\nIN SIEVE\nDECANT AND BAG\nSEDIMENT\nLEAVE\nSEDIMENT TO\nSETTLE IN\nPAN\nPAN < 2MM\nSEDIMENT\nBAG PANNED\nHEAVY MINERAL\nCONCENTRATE\nWASH\nEQUIPMENT\nAND PACK\nPRIOR TO\nLEAVING SITE  \n \nFigure 7: Flow chart summarising the procedures at a drainage site for the \ncollection of stream water, sediment and heavy mineral concentrate. Certain \nprocedures are repeated when duplicate samples are collected.  \n \n \n \n 29\n"}