{"doi":"10.1029\/2010GL042822","coreId":"97776","oai":"oai:nora.nerc.ac.uk:10541","identifiers":["oai:nora.nerc.ac.uk:10541","10.1029\/2010GL042822"],"title":"Wind-controlled export of Antarctic Bottom Water from the Weddell Sea","authors":["Jullion, L.","Jones, S.C.","Naveira Garabato, A.C.","Meredith, M. P."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"Recent studies suggest that the variability in Antarctic Bottom Water (AABW) properties in the Scotia Sea on time scales up to decadal may be linked to changes in the baroclinicity of the Weddell gyre, with vertical variations in the density structure at the gyre's northern edge acting to control the export of AABW over the South Scotia Ridge and toward the mid-latitude South Atlantic. We test this hypothesis by analysing the AABW properties in fifteen occupations of the SR1b hydrographic section (1993-2009) in eastern Drake Passage alongside possible forcings as derived from atmospheric reanalysis data. We show that variability in the wind stress over the Weddell gyre leads changes in AABW properties in the SR1b section by approximately five months. The sign of the lagged correlation is consistent with the notion of the AABW export from the Weddell Sea being controlled by the gyre's baroclinic adjustment to wind forcing on time scales of several months. Variability in the regional winds is found to be closely linked to the Southern Annular Mode (SAM). These results suggest that there may be a causal relationship between the SAM's positive tendency observed in recent decades and the subsequent warming of AABW detected across much of the Atlantic Ocean. Citation: Jullion, L., S. C. Jones, A. C. Naveira Garabato, and M. P. Meredith (2010), Wind-controlled export of Antarctic Bottom Water from the Weddell Sea, Geophys. Res. Lett., 37, L09609, doi: 10.1029\/2010GL042822","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/97776.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/10541\/1\/grl26971.pdf","pdfHashValue":"addb8c87a2e2c1e1c12ff65f6f3f43aaa4f4295e","publisher":"American Geophysical Union","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:10541<\/identifier><datestamp>\n      2013-11-14T10:29:19Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533230<\/setSpec><setSpec>\n      7375626A656374733D533233<\/setSpec><setSpec>\n      7375626A656374733D533137<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/10541\/<\/dc:relation><dc:title>\n        Wind-controlled export of Antarctic Bottom Water from the Weddell Sea<\/dc:title><dc:creator>\n        Jullion, L.<\/dc:creator><dc:creator>\n        Jones, S.C.<\/dc:creator><dc:creator>\n        Naveira Garabato, A.C.<\/dc:creator><dc:creator>\n        Meredith, M. P.<\/dc:creator><dc:subject>\n        Marine Sciences<\/dc:subject><dc:subject>\n        Meteorology and Climatology<\/dc:subject><dc:subject>\n        Hydrology<\/dc:subject><dc:description>\n        Recent studies suggest that the variability in Antarctic Bottom Water (AABW) properties in the Scotia Sea on time scales up to decadal may be linked to changes in the baroclinicity of the Weddell gyre, with vertical variations in the density structure at the gyre's northern edge acting to control the export of AABW over the South Scotia Ridge and toward the mid-latitude South Atlantic. We test this hypothesis by analysing the AABW properties in fifteen occupations of the SR1b hydrographic section (1993-2009) in eastern Drake Passage alongside possible forcings as derived from atmospheric reanalysis data. We show that variability in the wind stress over the Weddell gyre leads changes in AABW properties in the SR1b section by approximately five months. The sign of the lagged correlation is consistent with the notion of the AABW export from the Weddell Sea being controlled by the gyre's baroclinic adjustment to wind forcing on time scales of several months. Variability in the regional winds is found to be closely linked to the Southern Annular Mode (SAM). These results suggest that there may be a causal relationship between the SAM's positive tendency observed in recent decades and the subsequent warming of AABW detected across much of the Atlantic Ocean. Citation: Jullion, L., S. C. Jones, A. C. Naveira Garabato, and M. P. Meredith (2010), Wind-controlled export of Antarctic Bottom Water from the Weddell Sea, Geophys. Res. Lett., 37, L09609, doi: 10.1029\/2010GL042822.<\/dc:description><dc:publisher>\n        American Geophysical Union<\/dc:publisher><dc:date>\n        2010<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/10541\/1\/grl26971.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Jullion, L.; Jones, S.C.; Naveira Garabato, A.C.; Meredith, M. P..  2010  Wind-controlled export of Antarctic Bottom Water from the Weddell Sea.   Geophysical Research Letters, 37 (9), L09609. 4, pp.  10.1029\/2010GL042822 <http:\/\/doi.org\/10.1029\/2010GL042822>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.agu.org\/journals\/gl\/gl1009\/2010GL042822\/2010GL042822.pdf<\/dc:relation><dc:relation>\n        10.1029\/2010GL042822<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/10541\/","http:\/\/www.agu.org\/journals\/gl\/gl1009\/2010GL042822\/2010GL042822.pdf","10.1029\/2010GL042822"],"year":2010,"topics":["Marine Sciences","Meteorology and Climatology","Hydrology"],"subject":["Publication - Article","PeerReviewed"],"fullText":"Click\nHere\nfor\nFull\nArticle\nWind‐controlled export of Antarctic Bottom Water\nfrom the Weddell Sea\nL. Jullion,1 S. C. Jones,1,2 A. C. Naveira Garabato,1 and M. P. Meredith3\nReceived 8 February 2010; revised 30 March 2010; accepted 6 April 2010; published 14 May 2010.\n[1] Recent studies suggest that the variability in Antarctic\nBottom Water (AABW) properties in the Scotia Sea on\ntime scales up to decadal may be linked to changes in the\nbaroclinicity of the Weddell gyre, with vertical variations\nin the density structure at the gyre’s northern edge acting\nto control the export of AABW over the South Scotia\nRidge and toward the mid‐latitude South Atlantic. We test\nthis hypothesis by analysing the AABW properties in\nfifteen occupations of the SR1b hydrographic section\n(1993–2009) in eastern Drake Passage alongside possible\nforcings as derived from atmospheric reanalysis data. We\nshow that variability in the wind stress over the Weddell\ngyre leads changes in AABW properties in the SR1b\nsection by approximately five months. The sign of the\nlagged correlation is consistent with the notion of the\nAABW export from the Weddell Sea being controlled by\nthe gyre’s baroclinic adjustment to wind forcing on time\nscales of several months. Variability in the regional winds\nis found to be closely linked to the Southern Annular\nMode (SAM). These results suggest that there may be a\ncausal relationship between the SAM’s positive tendency\nobserved in recent decades and the subsequent warming\nof AABW detected across much of the Atlantic Ocean.\nCitation: Jullion, L., S. C. Jones, A. C. Naveira Garabato,\nand M. P. Meredith (2010), Wind‐controlled export of Antarctic\nBottom Water from the Weddell Sea, Geophys. Res. Lett., 37,\nL09609, doi:10.1029\/2010GL042822.\n1. Introduction\n[2] The Drake Passage (Figure 1) is situated north and\nwest of the Weddell Sea (WS), where Weddell Sea Deep\nWater (WSDW), the main contributor to Antarctic Bottom\nWater (AABW) [Orsi et al., 1999] filling much of the global\nocean abyss, is produced. The WSDW leaving the WS\nthrough deep passages in the South Scotia Ridge en-\ncompasses the most recently ventilated components of the\nwater mass [Gordon et al., 2001; Naveira Garabato et al.,\n2002a]. Upon entering the Scotia Sea, WSDW can flow\nwestward toward the Drake Passage [Naveira Garabato et\nal., 2002b] or northeastward toward the Georgia and\nArgentine basins [Meredith et al., 2000, 2001; Naveira\nGarabato et al., 2002b]. The less‐recently ventilated com-\nponents of WSDW can also spread northward by navigating\naround the eastern side of the island chain at the eastern\nedge of the Scotia Sea [Locarnini et al., 1993]. Ultimately,\nWSDW constitutes the densest component of the lower limb\nof the Atlantic Meridional Overturning Circulation.\n[3] In recent years, evidence indicating that the AABW of\nWS origin has warmed (∼0.0025°C yr−1) across the length\nof the Atlantic Ocean since the 1970s has been mounting\n[Coles et al., 1996; Zenk and Morozov, 2007; Johnson and\nDoney, 2006; Meredith et al., 2008a; Johnson et al., 2008].\nHowever, observations of the evolution of WSDW properties\nwithin the WS itself reveal no corresponding warming trend.\nSpecifically, Fahrbach et al. [2004] found no decadal‐scale\nchange in the temperature of the WSDW in the WS between\n1992 and 2002, although they noted a significant warming\ntrend (0.01°C a−1) in the Weddell Sea Bottom Water density\nclass prior to 1998 and a subsequent weakening of the trend.\nRobertson et al. [2002] reported slightly warmer WSDW in\nthe WS in the 1990s compared with the 1970s, but noted that\nstrong interannual variability in WSDW properties prevented\nthem from identifying significant trends.\n[4] Seeking to reconcile these two seemingly inconsistent\nsets of observations, Meredith et al. [2008a] hypothesised\nthat the warming of AABW in the Atlantic Ocean abyss has\nbeen caused by a decadal‐scale change in the range of\nWSDW density classes exported from the WS, with sig-\nnificant interannual variability superimposed. There is a\nneed to understand this interannual variability so as to\nenable the correct interpretation of temporally sparse ob-\nservations, and because the processes controlling WSDW\nexport on interannual time scales may also operate on the\ndecadal time scales pertinent to the AABW warming trend.\nMeredith et al. [2008a] suggested that the interannual var-\niability of WSDW properties in the eastern Scotia Sea was\ncaused by changes in the baroclinicity of the Weddell gyre.\nA stronger (weaker) Weddell gyre would lead to lighter\n(denser) water being exported over the South Scotia Ridge,\nresulting in a change in AABW properties in the Scotia Sea\non pressure surfaces (their Figure 10).\n[5] Here, we test the plausibility that the “Weddell gyre\nintensity” hypothesis may underlie the interdecadal warming\nof AABW observed across the Atlantic Ocean by analyzing\nthe interannual variability in the thermohaline properties of\nWSDW across eastern Drake Passage. Because of the lack of\nlong‐term measurement of the Weddell gyre’s baroclinicity,\nwe compare our property time series with the wind stress\nover the Southern Ocean, believed to be the primary driver of\nthe Weddell gyre intensity [Martinson and Iannuzzi, 2003].\n2. Data Set\n2.1. Hydrographic Data\n[6] We have compiled fifteen repeats of the SR1b\nConductivity‐Temperature‐Depth (CTD) section conducted\n1School of Ocean and Earth Science, National Oceanography\nCentre, University of Southampton, Southampton, UK.\n2Now at British Oceanographic Data Centre, Liverpool, UK.\n3British Antarctic Survey, Cambridge, UK.\nCopyright 2010 by the American Geophysical Union.\n0094‐8276\/10\/2010GL042822\nGEOPHYSICAL RESEARCH LETTERS, VOL. 37, L09609, doi:10.1029\/2010GL042822, 2010\nL09609 1 of 4\nacross the eastern Drake Passage (Figure 1) between 1993\nand 2009 (one section every austral spring\/summer except\nfor the summers of 1994\/95 and 1998\/99) by scientists of the\nNational OceanographyCentre, Southampton, and the British\nAntarctic Survey. The sections were occupied as part of the\nWorld Ocean Circulation Experiment (WOCE) and post‐\nWOCE repeat hydrographic programme. Instrumental and\nsampling (resulting from undersampling in the horizontal and\nin the vertical) errors are estimated to be 0.001°C and 0.002 for\nQ and S respectively. A description of how these uncertainties\nare calculated is detailed in thework ofNaveiraGarabato et al.\n[2009]. In order to avoid spurious signals introduced by ACC\nfrontal meandering and to look at water mass properties, the\nCTD data are re‐gridded in neutral density\/dynamic height (at\n400 dbar relative to 2000 dbar, \u00012000) coordinates as in the\nwork of Naveira Garabato et al. [2009].\n2.2. Ancillary Data\n[7] To attempt to establish a link between changes in\nAABW properties and climate variability over the Southern\nOcean, we examine a range of ancillary data sets. Monthly\nzonal and meridional wind stress anomalies (anomalies are\ncalculated by removing the annual cycle at each grid point)\nare extracted from the ECMWF ERA‐Interim reanalysis\n(http:\/\/data‐portal.ecmwf.int\/data\/d\/interim_moda\/) for the\n1989–2009 period. The El Niño‐Southern Oscillation\n(ENSO) and the Southern Annular Mode (SAM) (Figure 2,\nbottom) are the two dominant modes of large‐scale climate\nvariability in the Southern Ocean [see, e.g., Marshall et al.,\n2004; Turner, 2004, and references therein]. We use the\nBivariate EnSo Timeseries (BEST) ENSO index (http:\/\/\nwww.cdc.noaa.gov\/people\/cathy.smith\/best\/) and an obser-\nvation‐based SAM index (http:\/\/www.antarctica.ac.uk\/met\/\ngjma\/sam.html) to study their respective impacts on the\nWeddell\/Drake Passage regional climate.\n3. Interannual Variability of AABW Properties\n[8] We compute the mean potential temperature, salinity\nand neutral density of the densest class of AABW (gn =\n28.28–28.32 kg m−3) regularly present in the SR1b section\n(Figure 2, top). Focussing on this density class provides\nstatistical advantages, for the regional residence time of\nthe denser AABW classes exported to the Scotia Sea has\nbeen estimated to be ∼1 year [Meredith et al., 2008a], thus\nallowing consideration of our sections as mutually inde-\npendent. In practice, our results are qualitatively insensitive\nto the choice of density class.\n[9] Figure 2 shows that the AABW in the SR1b section is\nsubject to pronounced interannual variability (of amplitude\n∼0.1°, 0.01 and 0.01 for potential temperature, salinity and\nneutral density, respectively). Between December 2004 and\nDecember 2006, there is a strong cooling and freshening of\nthe AABW, reaching minima ofQ ∼ −0.26°C and S ∼ 34.666.\nTwo other cold and fresh pulses occur around 1996 and 1999\n(Q ∼ −0.22°C and S ∼ 34.666), although gaps in the time\nseries limit the resolution of those events. No significant\ndecadal trends are detected. This is perhaps to be expected\ngiven the relatively short length of the time series and the\nproximity to the AABW source, which results in the magni-\ntude of the observed interannual variability in Drake Passage\nAABW temperature being much larger than the AABW\nwarming trend reported in the South Atlantic (on the order of\n0.0025°C yr−1).\n4. Relationship Between AABW Properties and\nWind Stress Over the Southern Ocean\n[10] The link between the interannual variability of\nAABW properties in the SR1b section and the baroclinicity\nof the Weddell gyre is investigated by calculating lagged\ncorrelations between the time series shown in Figure 2 and\nthe monthly zonal wind stress anomalies south of 30°S.\nFigure 1. Map and bathymetry of the Drake Passage. The\nposition of the SR1b hydrographic repeat section is shown\n(black cross). The simplified circulation of light WSDW\noverflowing the South Scotia Ridge (black arrows) and of\ndense WSDW circumnavigating the South Sandwich Islands\n(white arrows) is adapted from Naveira Garabato et al.\n[2002b].\nFigure 2. (top) Time series of potential temperature, salinity\nand neutral density of AABW on Sr1b. (bottom) The 1‐year\nlow‐pass filtered ENSO and SAM indexes time series over\nthe same period.\nJULLION ET AL.: WIND‐CONTROLLED EXPORT OF AABW L09609L09609\n2 of 4\nHigh correlations are found with a 5‐month lag over the\nSouthern Ocean (Figure 3). The banded nature of the high\npositive\/negative correlations over the Southern Ocean\/\nsubtropical region, which evoke a SAM‐like pattern, clearly\nsuggests that the variability of AABW properties is signif-\nicantly influenced by large‐scale changes in the wind stress.\nThe circumpolar nature of the high correlations reflects the\nstrong degree of coherence in the variability of the westerly\nwind stress over the Southern Ocean, mainly associated with\nfluctuations in the SAM.\n[11] These results do not imply a causal relationship\nbetween the wind stress over the entire Southern Ocean and\nthe interannual variability of AABW properties, but rather\nthat hemispheric‐scale changes in the wind stress co‐vary\nwith the winds (and the wind stress curl in particular) over\nthe WS. The focus of our correlation analyses is on wind\nstress rather than on its curl because the scarcity of ob-\nservations assimilated by the ERA‐Interim reanalysis in the\nSouthern Ocean and the second‐order derivative nature of\nthe curl render it very sensitive to errors. Moreover, we\nargue that because of the predominant zonal direction of the\nwinds over the Southern Ocean, the wind stress curl is\nprimarily driven by the meridional gradient of the zonal\nwind stress. Therefore, we conclude that the alternating\nbands in the correlation pattern over the Southern Ocean\nshown in Figure 3 strongly suggest that the wind stress curl\nover the Weddell region at five months lag controls the\nexport of AABW out of the WS, likely through changes in\nthe gyre’s baroclinicity.\n[12] Lagged correlations of local winds show significance\nat the 95% level with the SAM index at short time lags (r =\n0.496 at 0 month lag). Correlations of local winds with the\nENSO index are marginally significant at the 95% level at\nvery short lags (r = −0.141 at 0 month lag), and also at lags\napproaching 3 years, reflecting the quasi‐cyclical nature of\nthis climate mode. Correlations with SAM greatly exceed\nthose with ENSO in magnitude, reflecting the predominance\nof this mode in determining local winds. During a positive\n(negative) SAM phase, stronger (weaker) westerlies between\n50°S and 70°S increase (decrease) the wind stress curl and\npredictably spin up (slow down) the cyclonic Weddell gyre,\ncontracting (relaxing) isopycnals and leading to a warmer,\nsaltier and lighter (cooler, fresher and denser) class of\nAABW being exported to the Scotia Sea.\n5. Discussion\n[13] We provide evidence that interannual variability in\nthe properties of the AABW exiting the WS toward Drake\nPassage is driven by the wind stress curl over the Weddell\ngyre, likely through changes in the gyre’s baroclinicity\naffecting the density classes of the AABW exported out of\nthe WS. The time lag involved (5 months) suggests that the\ngyre must adjust over time scales of two months (assuming a\nvelocity of 0.1 m s−1 [Nowlin and Zenk, 1988] results in a\ntransit time of 3 months from the Orkney Passage to Sr1b).\nLittle is known about the extent, controls and time scales of\nthe variability in the Weddell gyre’s baroclinic structure,\npartly because of the lack of wintertime hydrographic\nmeasurements. Meredith et al. [2008a] discussed some\nlocalized observational evidence suggestive of interannual\nchanges in the gyre’s baroclinicity. Beckmann et al. [1999],\nin turn, showed that the gyre transport in the BRIOS general\ncirculation model exhibits a marked annual cycle correlated\nwith the local wind stress curl, but did not comment on the\nmodal partitioning of the gyre’s response. However,he 2–\n3 month baroclinic adjustment time scale found here appears\nshort in the context of geostrophic adjustment theory [e.g.,\nAnderson and Gill, 1975], which suggests that baroclinic\nadjustment to changes in wind forcing for a Weddell‐sized\nbasin should occur on considerably longer (multiannual)\ntime scales. Some observational evidence indicating sub-\nstantial wind‐forced baroclinic adjustment of a sub‐polar\ngyre on seasonal time scales is available from the high‐\nlatitude North Atlantic and Arctic oceans [e.g., Proshutinsky\net al., 2002]; however, the mechanistic interpretation of this\nfast response is unclear and requires further investigation.\n[14] We have shown that the variability of the zonal wind\nstress over the northern WS is modulated by the SAM over\nrelatively short time scales (0–5 months). Martinson and\nIannuzzi [2003] instead highlighted the possible role of\nENSO in influencing the intensity and upper‐ocean prop-\nerties of the Weddell gyre, through changes in cyclonic\nforcing over the region. Our results suggest that the SAM is\nthe primary climate mode (with a secondary influence of\nENSO) regulating the gyre’s baroclinicity and the export of\nAABW out of the WS.\n[15] Many previous studies have demonstrated how\natmospheric forcing can influence the properties of upper‐\nocean and intermediate water masses in the Southern Ocean\n[e.g., Meredith et al., 2008b; Sallée et al., 2008; Naveira\nGarabato et al., 2009]. Here, we provide rare evidence of\na direct, short‐term (∼5 months) influence of atmospheric\nvariability on the properties and (implicitly) circulation of\nbottom waters at some distance from their source. This\nhighlights the complex coupled nature of atmosphere\/ocean\/\ntopography interactions in the Southern Ocean, and em-\nphasizes the challenge inherent in trying to resolve these\nprocesses in simulations of the lower limb of the oceanic\noverturning circulation.\n[16] We have observed pronounced interannual variability\nof AABW properties at a distance from its source. This\nillustrates the difficulty in reliably determining interdecadal\nvariations in bottom water properties in regions near the\nwater mass formation areas from temporally‐sparsed\nhydrographic measurements. Notwithstanding this, the\nmechanism we have suggested here to explain interannual\nchanges in AABW property may also underlie the warming\ntrend observed along much of the length of the Atlantic\nOcean in recent decades. Indeed, as well as interannual\nvariability, SAM has exhibited a trend toward a more posi-\ntive state (implying stronger westerly winds over the\nFigure 3. Spatial correlation at 5 months lag between the\nzonal wind anomalies and potential temperature time series\nof the densest AABW. The black line are the 90% and 95%\nconfidence interval levels. The black box shows where the\ncorrelations of the averaged wind stress anomalies and the\nSAM and ENSO index are calculated.\nJULLION ET AL.: WIND‐CONTROLLED EXPORT OF AABW L09609L09609\n3 of 4\nSouthern Ocean) since the 1960s, due at least partly to\nanthropogenic causes [Marshall et al., 2004; Thompson and\nSolomon, 2002]. This is the correct sign of change to lead to a\nwarming of the AABW exported from the WS, if the\nmechanism we have outlined is also in operation on decadal\ntime scales. If proven, this would indicate that the warming\nobserved along nearly the entire length of the abyssal\nAtlantic in recent decades has a root cause that includes\nforcing from anthropogenic actions.\n[17] Acknowledgments. This work would not have been possible\nwithout the hard work of all the officers, crew members, and scientists\nonboard RRS James Clark Ross who participated in the data collection dur-\ning the 15 repeats of the SR1b section.\nReferences\nAnderson, D., and A. Gill (1975), Spin‐up of a stratified ocean, with appli-\ncations to upwelling, Deep Sea Res. Oceanogr. Abstr., 22(9), 583–596.\nBeckmann, A., H. Hellmer, and R. Timmermann (1999), A numerical\nmodel of the Weddell Sea: Large‐scale circulation and water mass distri-\nbution, J. Geophys. Res., 104(C10), 23,375–23,391.\nColes, V. J., M. S. McCartney, D. B. Olson, and W. M. Smethie Jr. (1996),\nChanges in Antarctic Bottom Water properties in the western South\nAtlantic in the late 1980s, J. Geophys. Res., 101(C4), 8957–8970.\nFahrbach, E., M. Hoppema, G. Rohardt, M. Schröder, and A. Wisotzki\n(2004), Decadal‐scale variations of water mass properties in the deep\nWeddell Sea, Ocean Dyn., 54(1), 77–91.\nGordon, A. L., M. Visbeck, and B. Huber (2001), Export of Weddell Sea\ndeep and bottom water, J. Geophys. Res., 106(C5), 9005–9017.\nJohnson, G. C., and S. C. Doney (2006), Recent western South Atlantic\nbottom water warming, Geophys. Res. Lett., 33, L14614, doi:10.1029\/\n2006GL026769.\nJohnson, G. C., S. G. Purkey, and J. M. Toole (2008), Reduced Antarctic\nmeridional overturning circulation reaches the North Atlantic Ocean,\nGeophys. Res. Lett., 35, L22601, doi:10.1029\/2008GL035619.\nLocarnini, R., T. Whitworth III, and N. D. Nowlin (1993), The importance\nof the Scotia Sea on the outflow of Weddell Sea deep water, J. Mar. Res.,\n51(1), 135–153.\nMarshall, G. J., P. A. Stott, J. Turner, W. M. Connolley, J. C. King, and\nT. A. Lachlan‐Cope (2004), Causes of exceptional atmospheric circula-\ntion changes in the Southern Hemisphere, Geophys. Res. Lett., 31,\nL14205, doi:10.1029\/2004GL019952.\nMartinson, D., and R. Iannuzzi (2003), Spatial\/temporal patterns in\nWeddell gyre characteristics and their relationship to global climate,\nJ. Geophys. Res., 108(C4), 8083, doi:10.1029\/2000JC000538.\nMeredith, M., R. Locarnini, K. V. Scoy, A. Watson, K. Heywood, and\nB. King (2000), On the sources of Weddell Gyre Antarctic Bottom\nWater, J. Geophys. Res., 105(C1), 1093–1104.\nMeredith, M. P., A. C. Naveira Garabato, D. P. Stevens, K. J. Heywood,\nand R. J. Sanders (2001), Deep and bottom waters in the eastern Scotia\nSea: Rapid changes in properties and circulation, J. Phys. Oceanogr.,\n31(8), 2157–2168.\nMeredith, M. P., A. C. Naveira Garabato, A. L. Gordon, and G. C. Johnson\n(2008a), Evolution of the deep and bottom waters of the Scotia Sea,\nSouthern Ocean, during 1995–2005, J. Clim., 21, 3327–3343.\nMeredith, M. P., E. J. Murphy, E. J. Hawker, J. C. King, and M. I. Wallace\n(2008b), On the interannual variability of ocean temperatures around\nSouth Georgia, Southern Ocean: Forcing by El Niño\/Southern Oscilla-\ntion and the Southern Annular Mode, Deep Sea Res., Part II, 55,\n2007–2022.\nNaveira Garabato, A. C., E. McDonagh, D. P. Stevens, K. J. Heywood, and\nR. J. Sanders (2002a), On the export of Antarctic Bottom Water from the\nWeddell Sea, Deep Sea Res., Part II, 49, 4715–4742.\nNaveira Garabato, A. C., K. J. Heywood, and D. P. Stevens (2002b), Mod-\nification and pathways of Southern Ocean deep waters in the Scotia Sea,\nDeep Sea Res., Part I, 49, 681–705.\nNaveira Garabato, A. C., L. Jullion, D. P. Stevens, K. J. Heywood, and\nB. A. King (2009), Variability of subantarctic mode water and Antarctic\nintermediate water in the Drake Passage during the late Twentieth and\nearly Twenty‐First Century, J. Clim., 22, 3661–3688, doi:10.1175\/\n2009JCLI2621.1.\nNowlin, W., and W. Zenk (1988), Westward bottom currents along the\nmargin of the south shetland island arc, Deep Sea Res., Part A, 35,\n269–301, doi:10.1016\/0198-0149(88)90040-4.\nOrsi, A. H., G. C. Johnson, and J. L. Bullister (1999), Circulation, mixing,\nand production of Antarctic Bottom Water, Prog. Oceanogr., 43(1),\n55–109.\nProshutinsky, A., R. Bourke, and F. McLaughlin (2002), The role of the\nbeaufort gyre in arctic climate variability: Seasonal to decadal climate\nscales, Geophys. Res. Lett., 29(23), 2100, doi:10.1029\/2002GL015847.\nRobertson, R., M. Visbeck, and A. Gordon (2002), Long‐term temperature\ntrends in the deep waters of the Weddell Sea, Deep Sea Res., Part II, 49,\n4791–4806.\nSallée, J. B., K. Speer, and R. Morrow (2008), Response of the antarctic\ncircumpolar current to atmospheric variability, J. Clim., 21, 3020–\n3039, doi:10.1175\/2007JCLI1702.1.\nThompson, D. W. J., and S. Solomon (2002), Interpretation of recent south-\nern hemisphere climate change, Science, 296(5569), 895–899,\ndoi:10.1126\/science.1069270.\nTurner, J. (2004), The El Nino‐Southern Oscillation and Antarctica, Int. J.\nClimatol., 24(1), 1–31, doi:10.1002\/joc.965.\nZenk, W., and E. Morozov (2007), Decadal warming of the coldest Antarc-\ntic Bottom Water flow through the Vema Channel, Geophys. Res. Lett.,\n34, L14607, doi:10.1029\/2007GL030340.\nS. C. Jones, British Oceanographic Data Centre, Joseph Proudman Bldg.,\n6 Brownlow St., Liverpool L3 5DA, UK.\nL. Jullion and A. C. Naveira Garabato, School of Ocean and Earth\nScience, National Oceanography Centre, European Way, University of\nSouthampton, Southampton SO14 3ZH, UK. (l.jullion@noc.soton.ac.uk)\nM. P. Meredith, British Antarctic Survey, Madingley Rd., Cambridge\nCB3 0ET, UK.\nJULLION ET AL.: WIND‐CONTROLLED EXPORT OF AABW L09609L09609\n4 of 4\n"}