{"doi":"10.1016\/S1359-835X(02)00137-9","coreId":"140905","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/927","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/927","10.1016\/S1359-835X(02)00137-9"],"title":"Prediction of stiffness and stresses in z-fibre reinforced composite laminates","authors":["Grassi, Marcello","Zhang, Xiang","Meo, Michele"],"enrichments":{"references":[{"id":37921684,"title":"Derivation of boundary conditions for micromechanics analyses of plain and satin weave composites.","authors":[],"date":null,"doi":"10.1177\/002199830003400901","raw":"Whitcomb JD, Chapman CL & Tang X. Derivation of boundary conditions for micromechanics analyses of plain and satin weave composites. J Comp Mat. 34(2000), 724-747.","cites":null},{"id":37921671,"title":"Fibre insertion process for improved damage tolerance in aircraft structures.","authors":[],"date":"1994","doi":null,"raw":"Freitas G, Fusco T, Magee C & Dardzinski P. Fibre insertion process for improved damage tolerance in aircraft structures. J. of Advanced materials, 25 (1994).","cites":null},{"id":37921688,"title":"Interlaminar stresses in composite laminates with a circular hole. Composite Structures.","authors":[],"date":"1997","doi":"10.1016\/s0263-8223(97)80014-1","raw":"Hu FZ & Soutis C. Interlaminar stresses in composite laminates with a circular hole. Composite Structures.  37 (1997), 223-232.","cites":null},{"id":37921674,"title":"laminate and sub-element test results for Z-fiber TM reinforced IM7\/977-3 uni-directional tape and fabric.","authors":[],"date":"1998","doi":null,"raw":"Preliminary lamina, laminate and sub-element test results for Z-fiber TM reinforced IM7\/977-3 uni-directional tape and fabric. AZTEX, Version 1.3 – 1998.","cites":null},{"id":37921677,"title":"Low velocity impact damage characteristics of Z-fibre reinforced sandwich panels – an experimental study.","authors":[],"date":null,"doi":"10.1016\/s0263-8223(98)00110-x","raw":"Palazotto AN, Gummadi LNB, Vaidya UK, Herup EJ. Low velocity impact damage characteristics of Z-fibre reinforced sandwich panels – an experimental study. Composite Structures, 43(1999), 275-288.","cites":null},{"id":37921678,"title":"Mechanical response of composite materials with through-the-thickness reinforcement.","authors":[],"date":"1993","doi":null,"raw":"Farley GL & Dickinson LC. Mechanical response of composite materials with through-the-thickness reinforcement. NASA CR-14753, 1993, 123-143.","cites":null},{"id":37921683,"title":"Prediction of composites properties from a representative volume element.","authors":[],"date":"1996","doi":"10.1016\/0266-3538(95)00141-7","raw":"Sun CT & Vaidya RS. Prediction of composites properties from a representative volume element. Composite Sci & Tech. 1996, Vol. 56, 171-179.","cites":null},{"id":37921687,"title":"Prediction of effective three-dimensional elastic constants of translaminar reinforced composites.","authors":[],"date":"1999","doi":"10.1177\/002199839903301104","raw":"Dickinson LC, Farley GL, & Hinders MK. Prediction of effective three-dimensional elastic constants of translaminar reinforced composites. J of Composite Materials. 33 (1999), 1002-1029.","cites":null},{"id":37921685,"title":"Stiffness of composite laminates with z-fibre reinforcement.","authors":[],"date":"1999","doi":"10.2514\/6.1999-1294","raw":"Lin CJ & Chan WS. Stiffness of composite laminates with z-fibre reinforcement. Proc AIAA\/ASME\/ASCE\/AHS\/ASC Structures, Structural Dynamics, & Materials Conference, St. Louis MO, April 1999. Paper No. AIAA-99-1294, 918-924","cites":null},{"id":37921676,"title":"The influence of z-pinning on toughness and impact performance of carbon fibre polymer composite materials. MSc Thesis,","authors":[],"date":"1999","doi":null,"raw":"Bitsianis N. The influence of z-pinning on toughness and impact performance of carbon fibre polymer composite materials. MSc Thesis, Cranfield University, 1999.","cites":null},{"id":37921689,"title":"The mechanics of z-fibre reinforcement.","authors":[],"date":"1996","doi":null,"raw":"Barrett DJ. The mechanics of z-fibre reinforcement. Composite Struts, 36 (1996), 23-32.","cites":null},{"id":37921681,"title":"The Z-Fiber process, throughthickness reinforcement for composite structures.","authors":[],"date":"1994","doi":null,"raw":"Altergott W. The Z-Fiber process, throughthickness reinforcement for composite structures. Proc of the 10th DOD\/NASA\/FAA Conf of Fibrous Composites in Structural design, NAWCADWAR-94096-60, 1994, pp.71-93.","cites":null},{"id":37921682,"title":"Three-dimensional effective elastic constants for thick laminates.","authors":[],"date":"1988","doi":"10.1177\/002199838802200703","raw":"Sun CT & Li S. Three-dimensional effective elastic constants for thick laminates. Journal of Composite Materials. 1988. Vol. 22, 629-","cites":null},{"id":37921680,"title":"Z-direction pinning of composite laminates for increased survivability.","authors":[],"date":"1992","doi":"10.2514\/6.1992-1099","raw":"Childress JJ and Freitas G. Z-direction pinning of composite laminates for increased survivability. Proc of the AIAA Aerospace Design Conference, 1992, 1092-1099.","cites":null},{"id":37921672,"title":"Z-pinned composite laminates: improvements in delamination resistance.","authors":[],"date":null,"doi":null,"raw":"Cartie DDR & Partridge IK. Z-pinned composite laminates: improvements in delamination resistance. Proc 5 th Int Conf on Deformation and Fracture of Composites,","cites":null},{"id":37921690,"title":"Z-pinned composite laminates: knockdown in compressive strength.","authors":[],"date":"1999","doi":null,"raw":"Craig A & Fleck NA. Z-pinned composite laminates: knockdown in compressive strength. 5th Int Conf on Deformation and Fracture of Composites, 1999, 60-68.","cites":null},{"id":37921691,"title":"Z-pinned woven laminates: interlaminar fracture results and pinned quality considerations.","authors":[],"date":"2000","doi":null,"raw":"Troulis M, Cartie DDR, L Barattoni & Partridge IK. Z-pinned woven laminates: interlaminar fracture results and pinned quality considerations. Proc. Int Conf. On Deformation & Fracture of Composites (DFC 6), Manchester, April 2000. Published in Composites Part A: applied science and manufacturing, Vol. 33 (2002), 1653-","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2002-12-01T00:00:00Z","abstract":"The mechanical properties of z-pinned composite laminates were examined\nnumerically. Finite element calculations have been performed to understand how\nthe through-thickness reinforcement modifies the engineering elastic constants\nand local stress distributions. Solutions were found for four basic laminate\nstacking sequences, all having two percent volume fraction of z-fibres. For the\nstiffness analysis, a micromechanicalfinite element model was employed that was\nbased on the actual geometric configuration of a z-pinned composite unit cell.\nThe numerical results agreed very well with some published solutions. It showed\nthat by adding two percent volume fraction of z-fibres, the through-thickness\nYoung’s modulus was increased by 22-35 percent. The reductions in the in-plane\nmoduli were contained within 7-10 percent. The stress analysis showed that\ninterlaminar stress distributions near a laminate free edge were significantly\naffected when z-fibres were placed within a characteristic distance of one z-\nfibre diameter from the free edge. Local z-fibres carried significant amount of\ninterlaminar normal and shear stress","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140905.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/S1359-835X(02)00137-9","pdfHashValue":"2c5add625fca3df34ad78bde341e73ef24c805a3","publisher":"Elsevier Science B.V., Amsterdam.","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/927<\/identifier><datestamp>2011-11-13T23:01:29Z<\/datestamp><setSpec>hdl_1826_19<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Prediction of stiffness and stresses in z-fibre reinforced composite laminates<\/dc:title><dc:creator>Grassi, Marcello<\/dc:creator><dc:creator>Zhang, Xiang<\/dc:creator><dc:creator>Meo, Michele<\/dc:creator><dc:description>The mechanical properties of z-pinned composite laminates were examined\nnumerically. Finite element calculations have been performed to understand how\nthe through-thickness reinforcement modifies the engineering elastic constants\nand local stress distributions. Solutions were found for four basic laminate\nstacking sequences, all having two percent volume fraction of z-fibres. For the\nstiffness analysis, a micromechanicalfinite element model was employed that was\nbased on the actual geometric configuration of a z-pinned composite unit cell.\nThe numerical results agreed very well with some published solutions. It showed\nthat by adding two percent volume fraction of z-fibres, the through-thickness\nYoung’s modulus was increased by 22-35 percent. The reductions in the in-plane\nmoduli were contained within 7-10 percent. The stress analysis showed that\ninterlaminar stress distributions near a laminate free edge were significantly\naffected when z-fibres were placed within a characteristic distance of one z-\nfibre diameter from the free edge. Local z-fibres carried significant amount of\ninterlaminar normal and shear stresse<\/dc:description><dc:publisher>Elsevier Science B.V., Amsterdam.<\/dc:publisher><dc:date>2011-11-13T23:01:29Z<\/dc:date><dc:date>2011-11-13T23:01:29Z<\/dc:date><dc:date>2002-12-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>M. Grassi, X. Zhang and M. Meo, Prediction of stiffness and stresses in z-fibre\nreinforced composite laminates, Composites Part A: Applied Science and\nManufacturing, Volume 33, Issue 12, December 2002, Pages 1653-1664.<\/dc:identifier><dc:identifier>1359-835X<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/S1359-835X(02)00137-9<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/927<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1359-835X","1359-835x"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2002,"topics":[],"subject":["Article"],"fullText":"Composites Part A: applied science and manufacturing, 33 (2002), 1653-1664 \nPrediction of stiffness and stresses in Z-fibre reinforced composite laminates \n \nM. Grassi, X. Zhang*, and M. Meo \nCollege of Aeronautics, Cranfield University, Bedford MK43 0AL, UK \n(Received 14 November 2001; revised 9 September 2002; accepted 19 September 2002) \n \nAbstract \nThe mechanical properties of z-pinned composite laminates were examined numerically. Finite element \ncalculations have been performed to understand how the through-thickness reinforcement modifies the \nengineering elastic constants and local stress distributions. Solutions were found for four basic laminate \nstacking sequences, all having two percent volume fraction of z-fibres. For the stiffness analysis, a micro-\nmechanical finite element model was employed that was based on the actual geometric configuration of a \nz-pinned composite unit cell. The numerical results agreed very well with some published solutions. It \nshowed that by adding two percent volume fraction of z-fibres, the through-thickness Young’s modulus \nwas increased by 22-35 percent. The reductions in the in-plane moduli were contained within 7-10 \npercent. The stress analysis showed that interlaminar stress distributions near a laminate free edge were \nsignificantly affected when z-fibres were placed within a characteristic distance of one z-fibre diameter \nfrom the free edge. Local z-fibres carried significant amount of interlaminar normal and shear stresses.  \nKeywords: Z-fibre; 3-Dimentional reinforcement; mechanical properties; stress concentration; finite \nelement analysis (FEA). \n \n1. Introduction  \nThe notorious interlaminar weakness of laminated \ncomposites can be overcome by using fibrous \nreinforcement in the thickness direction, also \nknown as the z-direction. Established processes \nsuch as industrial stitching and z-pinning offer \neconomic means of achieving increased \ninterlaminar fracture toughness [1-2]. This paper \ndeals with z-pinned composites, which is defined \nas composite laminates with up to five per cent \nvolume fraction of the z-fibres or z-pins. These z-\npins can be made of steel, titanium, glass, Kevlar, \nand carbon fibres depending on application [3]. \nThis new 3D composite offers significant \nimprovement in impact resistance, compression-\nafter-impact (CAI) strength, and the ultimate \nstrength of stiffener pull-off [3-7]. It can be \nfabricated with small changes to the conventional \ncure cycles by using the Z-FiberTM∗ technique, \nwhich allows composite designers to utilize the \nadvantages of the well-established manufacturing \napproaches and yet to obtain three dimensional \nproperties where needed [8-9].  \nThe z-pinning process will affect laminate’s \nstiffness properties and hence the global elastic \nresponse of z-pinned composite. Therefore, \ncrucial to the development of the technology is to \n                                                 \n* Corresponding author:   \nEmail: xiang.zhang@cranfield.ac.uk  (X. Zhang). \nTel No. 01234 754621. Fax No. 01234 758203 \n∗ Z-fiberTM is a registered trademark of Aztex Inc., \nWaltham, MA, USA. \nobtain a better understanding of the mechanism \nand mechanics of z-pinned composites. \nEvaluating the engineering stiffness constants and \nexamining the stress distribution around a z-fibre \ncould be a first step towards the development of a \ndesign tool for predicting damage initiation and \ndamage propagation in z-pinned composites.   \nFor conventional laminated composites, there are \ntwo approaches to obtain the stiffness properties, \ni.e. macro-mechanical and micro-mechanical \nmethods. The former uses experimental data from \nstandard coupon specimens to build a set of \nmaterial constitutive equations that results in \nengineering elastic constants. This approach treats \na composite as homogenous orthotropic \ncontinuum, which may yield a useful design tool. \nHowever, to obtain an in-depth understanding of \nthe material behaviour and accurate mechanical \nproperties an alternative method is necessary. The \nmicro-mechanical approach does not assume \nhomogeneity, but defines the micro-structural \ndetails and uses the known material properties \nspecific to both fibre and matrix to determine the \noverall behaviour of the composite material [10-\n12]. Assuming that both the material structures \nand the mechanical response are periodical, \ncomposites can be modelled by a representative \nvolume element (RVE) or a unit-cell (UC). A unit \ncell is the smallest region in a periodic material \nstructure. This technique can also model more \ncomplicated textile composites, such as woven \nfabrics [12].  \n  \n \n \nThe unit cell approach has also been employed \nfor modelling z-pinned laminates [13-14]. Lin & \nChan [13] used an analytical unit cell model that \nwas based on the classical laminate theory, i.e. \nthe rule of mixtures, by transferring the z-fibre \nstiffness onto the laminate plane and \nsuperimposing z-fibre stiffness to the in-plane \nlaminate stiffness. While this approach is \napplicable to simple laminates, it is over-\nsimplistic for z-pinned composites since it does \nnot consider the interactions between the z-fibre \nand the surrounding resin zone (see Fig. 1a). The \nnumerical or finite element (FE) unit cell model \non the other hand takes account of the important \nmicro-structural details, such as the pure resin \nregion and the misaligned in-plane fibre region, \nboth of which can influence the stiffness values. \nDickinson et al [14] made a detailed FE unit cell \nmodel and performed an extensive parametric \nstudy of the z-pinned laminates in order to obtain \nthe engineering elastic constants. He examined \nthe effects of z-fibre material, volume fraction \nand insertion angle, and also the influence of the \nmisaligned fibre region around the z-pins and the \nresin-rich pocket. However, a detailed stress \nanalysis appears to have been omitted, which \nwould help to understand the stiffness variations \ndue to the presence of z-pins.  \nIt is also important to examine the stress changes \ndue to the insertion of z-fibres, so that stress-\nbased failure criteria may be applied for \npredicting damage initiation at stress raisers, e.g. \nat laminate free edges and open-hole edges. The \nstress state in a laminate is basically two-\ndimensional, but in the presence of transverse \nloads (such as impact load) or geometrical \ndiscontinuities (such as free edges, open holes, \nand ply-drops) it becomes essentially three-\ndimensional with very high interlaminar stress \ncomponents [15]. Since the characteristic \ndimension of the z-fibre induced stress field is \nless than an individual ply thickness, z-fibre \neffect on stress components has been analysed at \nmicro-mechanical scales [16-17]. Barrett [16] \nmade a detailed FE study on a cracked z-pinned \nlaminate. The work concentrated on the crack-tip \nstresses and the effect of z-fibres on interlaminar \n(Mode I) crack growth; the in-plane fibre \nwaviness and the resin pools around z-fibres were \nnot included in the FE model. It was found that an \nintact z-fibre could reduce the three principle \nstresses by 67-76% when the z-fibre was placed \nin the immediate vicinity of the stress \nconcentration zone. This result implies that crack \npropagation rate will be significantly reduced due \nto local intact z-fibres.  \nThe objective of this work was to evaluate the \neffect of z-pinning on engineering elastic \nconstants and on local stress distributions near a \nz-fibre. The laminates used in the study had 2% \nvolume fraction of z-fibres, which is the typical \ndensity used in many structural tests [18]. The \nwork was carried out using a finite element unit \ncell model for stiffness analysis and a more \ndetailed micro-scale 3D FE model for \ninterlaminar stress analysis. The unit cell model \nfor stiffness evaluation was similar to the \nnumerical model devised by Dickinson et al [14]. \nThe results presented in this paper were \ncalculated in the linear elastic field and the curing \nstresses were not taken into account.  \n \n2. Finite element models \n2.1 Unit cell model for engineering elastic \nconstants \nFig.1 (a) is a microscopic photograph of a \nunidirectional (UD) laminate with a single z-fibre \nshowing the distinct microstructures of the pure \nresin pocket and the misaligned in-plane fibres \nsurrounding the z-fibre. In this study a 3D finite \nelement unit-cell model, Fig. 1 (b), was used to \nmodel the microstructure of the unit cell. This \nmicro-mechanical model consisted of 20-noded \nhexahedral elements. Different geometric shapes \nwere used to mesh different regions within the \nunit cell following the star-pattern approach [14] \nto maintain mesh compatibility across the \ninterface between the plies of different \norientations. The NASTRAN software package \nwas employed to perform the FE analysis. Four \nbasic laminate stacking sequences were studied, \ni.e. unidirectional [0]4, cross-ply [0, 90]s, angle-\nply [±45]s, and quasi-isotropic [+45, 90, -45, 0]s. \nThe composite laminate used in this \ncomputational example was made of the \nAS4\/3501-6 carbon\/epoxy pre-preg, and the z-\nfibre pins were made of impregnated carbon tows \n(T300\/9310) with axial Young’s modulus of 144 \nGPa. The basic material properties inputted in the \nFE model were taken from references [11, 14] as \ngiven in Table 1 in order to validate the results \nagainst published data.  \nIt should be noted that the z-fibre diameter used \nin the present work was 0.28 mm, but in reference \n[14] two z-fibre diameters, 0.254 and 0.635 mm, \nwere used. According to the literature, typical \nrange of z-fibre diameter is between 0.15 mm and \n1 mm depending on different applications [3, 9]. \nHowever, since the main variables of the model, \n  \n \n \ni.e. the size of the resin pocket inclusion and \ndeviated fibre region, were kept as the function of \nz-fibre diameter, the relative z-fibre densities in \nthe two computational models were the same. \nTherefore, a direct comparison with [14] could be \nmade. The region of intact lamina was not an \nissue for this model; therefore each single lamina \nwas modelled as a homogeneous three-\ndimensional orthotropic continuum with principal \naxes oriented in the local reference frames \nwithout the distinct representation of the fibres \nand matrix. \n \n                                       \n                    (a)       \n \n                                                                              (b) \nFig. 1 (a) Microscopic photograph of a unidirectional laminate with a single z-fibre inserted; \n           (b) 3D finite element unit cell model (XY view) used in this study. \nTable 1. Basic material properties used in the finite element models (unit: GPa). \nMaterials E1  E2  E3  G12  G23  G13  ν12 ν23 ν13 Vf \nLamina \n(AS4\/3501-6) \n136.40 8.90 8.90 5.95 3.21 5.94 0.25 0.38 0.25 0.6 \nZ-fibre \n(T300\/9310) \n144.00 7.31 7.31 4.45 2.65 4.45 0.25 0.39 0.25  \nEpoxy Resin \n(3501-6) \n4.44   1.65   0.34    \n \nZ-fibre \nPure resin   \npocket \n  Misaligned \n  in-plane fibres \n Y \nX Z \n  \n \n \n \nz-fibre in three \ndifferent positions \nfrom the free edge \n \nFig. 2 (a) Schematic of a z-pin reinforced laminate with three different parametric distances from the free-\nedge. \n \n \n \n \n \nFig. 2 (b) Finite element model of ¼ z-pinned cross-ply laminate, [0, 90], under applied micro-strain \nε0=0.1%. \nAccording to references [10-11], the engineering \nelastic constants of a heterogeneous composite \ncan be described by equivalent engineering \nconstants of a macroscopically homogeneous \nmaterial. This could be done by averaging the \nmicro-stresses and micro-strains ( ijσ and ijε ) over \nthe volume of the unit cell to yield the average \nmacroscopic stresses and strains as given in \nequations (1) & (2):  \n dVzyx\nV V\nijij ),,(\n1_ ∫= σσ  (1) \n dVzyx\nV V\nijij ),,(\n1_ ∫= εε  (2) \nd3 \nz-fiber density = 2% \nz-fiber diameter = 0.28 mm \na = 2.11 mm \nb = 1.45 mm \nh = 0.132 mm \n \nz-pin distance from the free-edge: \nd1 = 1.25 mm \nd2 = 0.69 mm \nd3 = 0.25 mm \n \n \n \nb 4h \nz-fibre reinforced plate \n  plate free-edge \na \n ε0 = 0.1% (applied) \n 5110 nodes \n 1044 elements \n 15330 d.o.f. \n layer mesh bias  = 0.25 \n row mesh bias  = 0.25 \nGlobal reference \nframe directions \n10 columns 13 rows \n6 layers \nεo \nεo \n  d2 \n d1 \n  \n \n \nThe equivalence between the actual \nheterogeneous composite medium and the \nhomogeneous medium described by the average \nstresses and strains and the equivalent elastic \nconstants were demonstrated in [11]. The direct \nuse of the above equations would be \ncomputationally expensive especially for models \nwith a large numbers of degree of freedom. In \norder to avoid such problem the average strains \ncould be found by applying the Gauss theorem \nthat equates the stain energy between the volume \nof the unit cell and the boundary surface [11]: \ndSnunu\nV\ndV\nV ijjiV\nijij )(2\n11_ +== ∫∫εε    (3) \nwhere, V and S are, respectively, the volume and \nthe boundary surface of the unit cell, ui is the ith \ncomponent of displacements and nj the jth \ncomponent of the unit normal to S. The boundary \ndisplacements are determined by FEA.  \nThe principle of strain energy equivalence \nbetween the external work and the stored \ndeformation energy of the unit cell can be \nexpressed as:  \n VP ijijii\n__\n2\n1\n2\n1 εσδ =   (4) \nWhere Pi is the external load applied on the unit \ncell, and δi is resultant displacement found by \nfinite element analysis. From equations (3) & (4) \nthe average stress component acting on the unit \ncell is obtained as: \n  \nV\nP\nij\nii\nij _\n_\nε\nδσ =   (5) \nThe effective elastic constants can then be found \nfrom the average stress and strain components. \nThe boundary conditions and the external loads \napplied on the unit cell depend on the elastic \nconstant required [11-12].  \n \n2.2 Model for interlaminar stress analysis \nA 3-D model consisting of 20-noded hexahedral \nquadratic elements was used to model a z-pinned \nlaminate. The micro-mechanical model \nrepresented a rectangular block of laminate \ncontaining one z-pin that might be placed in three \ndifferent locations indicated as d1, d2, and d3 with \nrespect to the distance from z-pin to free edge as \nshown in Fig. 2(a). For meshing compatibility \nthree z-fibre locations were allocated in the FE \nmodel but only one location was effectively \nassigned with the z-fibre material property whilst \nthe other two had the properties of baseline \nlaminate. FE model is shown in Fig. 2(b).  \nThe z-fibre reinforced laminates analysed in this \nsection were cross-ply [0, 90]s and angle-ply \n[±45]s sequences. The z-fibres were arranged in a \nsquare array with a space of 2.11 mm \nrepresenting a volume density of 2%. The length \nfor both models was 2.11 mm; the width was 1.45 \nmm for the [0, 90]s laminate (522 20-noded \nhexahedronal solid elements, 3039 nodes) and 2.9 \nmm for the [±45]s laminate where symmetric \nboundary condition cannot be applied (2088 20-\nnoded hexahedronal solid elements, 9489 nodes). \nThis 3D FE model was used to examine the stress \ndistribution near a z-fibre and the interlaminar \nstress variation at the free edge. The distance \nbetween a z-pin and the free edge had a \nparametric variation from five times of a z-pin \ndiameter (pin was placed far from the free-edge, \nat d3 position) to one z-pin diameter (z-pin closest \nto the free edge, at d1 position). The applied strain \nwas 0.1% along the x-axis.  \n \n3. Results and discussion \n \n3.1 Comparison of elastic constants \nTables 2 to 6 present calculated elastic constants \nand comparisons with some published results [13, \n14] for various stacking sequences. As a baseline \nsolution, Table 2 provides the elastic constants for \nthe unpinned laminates. Tables 3, 4, 5 & 6 \ncontain the elastic properties for the four different \nlaminates, respectively; all had 2% volume \ndensity of z-fibres. In this numerical study it was \nassumed that z-fibres were inserted at right angles \n(90o) to the principal in-plane axes, i.e. z-fibres \nare parallel to the z-axis of the classical laminate \ntheory. It should be noted that the closed form \nsolution (CFS) [13] was originally formulated for \na z-pinned sandwich panel with two laminate \nfaceplates and a centre core. The elastic constants \nquoted in these tables for the CFS [13] were \nobtained by the authors of this paper by assuming \na zero-thickness centre core. Therefore, two \nfaceplates together with the correct laminate \nstacking sequence can be treated as a single \nlaminate. The analytical CFS [13] only provided \nin-plane elastic properties. The comparisons show \nthat the FE results obtained in this work agreed \nvery well with both the closed form solution \n(CFS) [13] and the numerical unit cell solution \n[14]. Detailed comparisons for pinned and \nunpinned laminates based on this study are \ndiscussed below.    \nFirstly, for all four z-pinned laminates considered \nin this work, the through-thickness longitudinal \nmodulus Ez increased significantly, by 22-35%, as \n  \n \n \nshown in Fig. 3(a). The magnitude of increment \ndepended on laminate stacking sequence. The \nPoisson’s contraction ratio in the thickness \ndirection was reduced because of the added z-\nfibre stiffness.  \nTable 2. Stiffness values for control cases (unpinned). Unit of elastic modulus: GPa \nLay-up Ex  Ey  Ez  Gxy  Gyz Gxz  νxy νyz νxz \nAnalytical Closed Form Solution [13] \n[0, 0]s 136.40 8.90 8.90 5.95 3.21 5.94 0.25 0.38 0.25 \n[0, 90]s 72.88 72.88 \/\/ 5.95 \/\/ \/\/ 0.03 \/\/ \/\/ \n[45, -45]s 20.57 20.57 \/\/ 35.36 \/\/ \/\/ 0.73 \/\/ \/\/ \n[45, 0, -45, 90]s 53.34 53.29 \/\/ 20.65 \/\/ \/\/ 0.29 \/\/ \/\/ \nUnit Cell Model [14] \n[0, 0]s 136.40 8.85 8.85 5.95 3.21 5.94 0.25 0.38 0.25 \n[0, 90]s 72.80 72.80 10.05 5.90 4.16 4.16 0.03 0.36 0.36 \n[45, -45]s 20.52 20.52 10.05 35.30 4.25 4.25 0.73 0.10 0.10 \n[45, 0, -45, 90]s 53.28 53.28 10.05 20.64 4.23 4.21 0.29 0.26 0.26 \nUnit Cell Model (this study) \n[0, 0]s 136.40 8.86 8.81 5.95 3.20 5.94 0.25 0.37 0.25 \n[0, 90]s 72.80 72.80 10.05 5.94 4.15 4.15 0.03 0.34 0.34 \n[45, -45]s 20.60 20.60 10.03 35.32 4.29 4.29 0.75 0.12 0.12 \n[45, 0, -45, 90]s 53.28 53.28 10.05 20.64 4.21 4.23 0.29 0.26 0.26 \nTable 3. Stiffness values for z-pinned UD laminate [0]4 with 2% z-fibre density. \n Ex  Ey  Ez  Gxy  Gyz  Gxz  νxy νyz νxz \nCFS [13] 133.81 8.86 11.60 5.79 3.22 5.79 0.26 0.37 0.26 \nUC [14] 123.10 8.85 11.17 5.80 3.17 5.70 0.31 0.31 0.20 \nUC (this study) 121.80 8.60 11.92 5.81 3.13 5.67 0.33 0.27 0.24 \nTable 4. Stiffness values for z-pinned cross-ply [0, 90]s with 2% z-fibre density. \n Ex  Ey  Ez  Gxy  Gyz  Gxz  νxy νyz νxz \nCFS [13] 71.50 71.50 \/\/ 5.80 \/\/ \/\/ 0.032 \/\/ \/\/ \nUC [14] 67.48 67.48 12.30 5.87 4.00 4.00 0.04 0.29 0.29 \nUC (this study) 67.30 67.30 12.31 5.82 3.98 3.98 0.05 0.30 0.30 \n \nTable 5. Stiffness values for z-pinned angle-ply [45, -45]s with 2% z-fibre density. \n  \n \n \n Ex  Ey  Ez  Gxy  Gyz  Gxz  νxy νyz νxz \nCFS [13] 20.09 20.09 \/\/ 34.69 \/\/ \/\/ 0.72 \/\/ \/\/ \nUC [14] 20.10 20.10 12.37 32.00 4.13 4.13 0.71 0.09 0.09 \nUC (this study) 19.45 19.45 12.27 31.90 4.10 4.10 0.70 0.10 0.10 \n \nTable 6. Stiffness values for z-pinned laminate [+45, 0, -45, 90]s with 2% z-fibre density. \n Ex  Ey  Ez  Gxy  Gyz  Gxz  νxy νyz νxz \nCFS [13] 52.35 52.35 \/\/ 20.25 \/\/ \/\/ 0.28 \/\/ \/\/ \nUC [14] 49.70 49.70 12.30 19.00 4.09 4.09 0.30 0.21 0.21 \nUC (this study) 49.51 49.51 12.00 18.87 3.98 3.98 0.29 0.19 0.19 \n \n8.81\n11.92\n10.05\n12.31\n10.03\n12.27\n10.05\n12\n0\n4\n8\n12\n16 unpinned \n2% Pinned\n \nEz(GPa) \n[04] [0,90]s [45,-45]s [+45,0,-45,90]s  \n \n136.4\n121.8\n72.8\n67.3\n20.6 19.45\n53.28 49.51\n0\n20\n40\n60\n80\n100\n120\n140 unpinned \n2% Pinned\n \nFig. 3 Stiffness variations for four different laminates: (a) through-thickness longitudinal modulus Ez; (b) \nin-plane longitudinal modulus Ex.  \nComposites Part A: applied science and manufacturing, 33 (2002), 1653-1664 \nFor the in-plane elastic properties, all stacking \nsequences showed a small reduction in the Young’s \nmoduli that were contained within 10%. Examples \nfor the longitudinal modulus Ex are shown in Fig. \n3(b). The worst case was Ex of the UD laminate \n[0]4. This can be attributed to the influence of \nmisaligned in-plane fibres and pure resin region \ncaused by insertion of z-fibres; the deviated in-\nplane fibres along the longitudinal direction and the \npure resin zone would make the longitudinal \nstiffness and strength weaker. For the [0, 90]s \nlaminate the reductions in moduli Ex or Ey were \nabout 7%. The reduction in the shear modulus Gxy \nfor the [0]4 and [0, 90]s laminates was less \nsignificant compared to the reduction in the \nYoung’s modulus because the angled fibre region \naround a z-pin can carry more shear load and thus \nprovides extra stiffness that offsets the added \ncompliance due to the pure resin region. The local \nshear stresses carried by the deviated fibres can be \nseen in Fig. 4. For the [±45]s laminate Gxy was \nreduced by 9%, whilst for the quasi-isotropic \nlaminate a smoothed almost uniform reduction in \nEx, Ey and Gxy was observed (6-7%).  \nThe computational results demonstrated that the \nin-plane fibre alignment is a critical factor for the \nin-plane stiffness values of z-pinned composites. \nFrom this point of view, z-pin diameters should \nbe minimised in order to minimise the angle of \nmisaligned in-plane fibres and to avoid micro-\nbuckling during compressive loads.   \n \nThe CFS [13] appeared to have predicted some of \nthe elastic constants quite well. The model was \nbased on the volume fraction of z-fibres using the \nsimple rule of mixture for the laminate properties \nand the classic laminate theory. Since the z-fibre \nvolume fraction plays a crucial role in some \nelastic properties, such as the transverse and shear \nmoduli, the CFS was accurate enough for these \nconstants. However, larger differences resulted \nbetween the CFS and FE solutions in the in-plane \nlongitudinal modulus, Ex, as shown in Fig. 3(b) \nand Tables 3, 4, and 6. In these cases, the CFS \noverestimated the values of Ex for the UD and \ncross-ply laminates, and Gxy for the angle-ply \nlaminate. This is because that the closed-form \nanalysis did not consider the effect of the \nmisaligned in-plane fibres and resin pocket \naround a z-pin, which do weaken the stiffness and \nstrength in the longitudinal direction. However, \nthe overall results obtained from the CFS [13] \nwere accurate enough. The disagreement with the \ntwo FE results was contained within 5-7% as \nshown in Tables 3-6. The CFS model is easy to \nuse for quick estimation of the stiffness properties \nfor this new composite material.  \nIt’s worth mentioning that the FE results of this \nstudy were also validated against the \nexperimental data provided in [4]. The tests were \nconducted with a different carbon fibre material \nusing also 2% volume fraction of z-fibres. The \nsame range of variations in the elastic constants \nas aforementioned examples was found.   \n \n \nFig. 4 In-plane shear stress distribution around a z-fibre (UD laminate). Note: deviated in-plane \nfibre region carried shear stresses providing extra stiffness that offset the added compliance due to \nthe pure resin region. Unit: MPa. \n3.2 Stress field around a z-fibre \n  \n \n \nThe stress field in a z-fibre inclusion is essentially \nthree-dimensional under uniaxial loads. This can \nbe demonstrated by the following example. A \nuniform strain of 0.1% was applied in the x-axis \nof a unidirectional laminate. It resulted in an \nincreased shear path along the misaligned fibre \nregion as well as interlaminar stress components. \nThis was due to the excessive mismatch of the \nelastic properties between the z-fibre and the \nsurrounding laminate region. The von Mises \nstress is plotted in Fig. 5 showing high stress \nconcentration around the z-pin. The figure also \nshows that the stress perturbation due to the z-\npin’s presence disappeared beyond a distance of \nabout two z-fibre diameters from the axis line of \nthe z-pin. Therefore, z-fibre spacing and its \ninteraction with the resin-rich zone should be \nfurther studied. \nThe FE results also showed that when carrying \nthe through-thickness stress components z-fibres \nabsorbed up to 25% of the total elastic strain \ndeformation energy stored in the unit cell; a non-\nuniform shear lag at the interface of the z-fibre \nand matrix was observed from the numerical \nexample. Therefore material compatibility and the \ninterfacial adhesive bond between the z-fibres and \ntheir surrounding matrix are important because a \nlarge part of the through-thickness loads is \ntransferred to the z-fibres. This was also \nmentioned in several papers based on \nexperimental investigations, e.g. ref [18]. From \nthis point of view, for carbon\/epoxy laminates a \ncarbon z-pin would be a better choice, which \noffers excellent adhesion to the surrounding \nthermo-set resin and good compatibility \ncharacteristics.   \n \n \nFig. 5 Von Mises stress field around a z-fibre (UD laminate). Applied strain εo = 0.1%. Stress unit: MPa. \n \n3.3 Interlaminar stresses \nAt the laminate free edge, the interlaminar \nstresses are extremely high. According to the \nclassic lamination theory, the interlaminar normal \nstress (or peeling stress) for the [0\/90] cross-ply \nlaminate goes to infinity at the free edge. This is a \nstress singularity problem. The distance over \nwhich the free-edge interlaminar stresses rise \nshapely is very small. According to the study by \nHu & Soutis [15] this characteristic distance had a \nmaximum length of 2-ply thickness. Therefore, \nfor carbon\/epoxy composite this distance is about \n0.25 mm. In order to study the effect of z-pinning \non interlaminar stresses, z-pins were placed at \nthree parametric distances, i.e. d1, d2 and d3, being \n1.25, 0.69 and 0.25 mm from the free edge \nrespectively as shown in Fig. 2. It was expected \nthat only the z-fibre position at d=d3 could give \nrelevant results with regard to stress singularity. \nTwo laminate stacking sequences were studied in \nthe present work. They were [0\/90]s and [±45]s \nlaminates.  \nComposites Part A: applied science and manufacturing, 33 (2002), 1653-1664 \n \n                                                                                  (a) \n                    (b) \n  \n \n \n                  (c) \nFig. 6 FE results of σz stress distributions for [0, 90]s cross-ply laminate: (a) through-the-thickness variation \n(along z-axis); (b) from inside plate to the free edge (y-axis);  (c) along the free-edge (x-axis). \n \nSince the [0, 90]s laminate exhibits only a Poisson \nmismatch between the layers (no shear coupling), \nstress components σz and τyz are the non-zero \ninterlaminar stresses. Fig. 6 shows the \ndistributions of the interlaminar normal stress, σz, \nalong the three principal axes and for both pinned \nand unpinned laminates. Figs. 6(a) & (b) show \nthat the maximum interlaminar peeling stress was \nreduced significantly at the free edge when a z-\npin are placed at the immediate vicinity of the \nfree edge, i.e. d=d3. The peak stresses for the pin \ndistances d1 and d2 had virtually the same values \nas those of unpinned laminate. However, when \nthe peeling stress in the localised laminate was \nreduced by placing a z-pin at d=d3, the z-pin itself \npicked up these high free-edge stresses, as shown \nin Fig. 6(c), in order to satisfy the equilibrium \nconditions. Similar stress distributions were found \nfor the interlaminar shear stress component τyz. \nTherefore, in the stress concentration regions z-\nfibres resist interlaminar stresses if they are \nplaced in the close vicinity of the stress raiser. \nSince the interface between a z-fibre pin and the \nsurrounding resin pool is relatively weak, \ndelamination damage is still likely to initiate from \nthis free edge region.  \nThe [±45]s angle-ply laminate exhibits only shear \ncoupling (no Poisson mismatch between layers), \nso τxz is the only non-zero interlaminar stress. The \ninterlaminar shear stress has its maximum value \nat the mid-thickness and reduces to zero on the \noutside of the laminate. Figs. 7(a) & (b) plot \nthrough-the-thickness distributions of τxz showing \nthat z-pinning can reduce the maximum shear in \nthe mid-thickness by about 15% if a pin was \nplaced at d=d3. The stress values for pin distances \nd1 and d2 were virtually the same as those of \nunpinned laminate. Part of the through-thickness \nstress was carried by the z-fibre placed at d = d3, \nas shown in Fig. 7(c). The differences in the \nlegends in Figures 6 and 7 should be noted. \nThe above stress analysis showed that \ninterlaminar stress components could be reduced \nonly when z- fibres were placed in the immediate \nvicinity to the free edge (within 0.25 mm).\nComposites Part A: applied science and manufacturing, 33 (2002), 1653-1664 \n \n \n                        (a) \n \n               (b) \n  \n \n \n \n                   (c) \nFig. 7 FE results of τxz stress distribution for [45, -45]s angle-ply laminate: (a) through-the-thickness \nvariation (along z-axis);  (b) from inside plate to the free-edge (y-axis); (c) along the free-edge (x-\naxis). \n \n \nEven though the stress distributions were \nsignificantly affected, there were no overall \nreductions in these peak stresses in the region \nsince the z-pins picked up some high stresses. \nBarrett [16] obtained similar results for a different \nstress singularity problem, i.e. an interlaminar \ncrack in z-pinned laminate under Mode I loading.  \nIt should be noticed that over such a small \ndistance the assumption of material homogeneity \nfor the laminates might break down and the bi-\nmaterial nature of the composite should be taken \ninto account. Further work is necessary for more \ndetailed stress analysis using micro-mechanical \nmodels for the surrounding matrices.  \n \n4. CONCLUSIONS \nThree-dimensional micro-mechanical finite \nelement models were employed to examine the \nmechanical behaviour of z-pinned laminates. \nTasks performed were: (a) calculation of the \nengineering elastic constants, and (b) study of \nstress distribution around a z-fibre and at z-\npinned laminate free edges. Following main \nconclusions may be drawn.  \nBy adding two percent volume fraction of z-fibres \nthe through-thickness Young’s modulus (Ez) was \nincreased significantly, i.e. by 22-35%, for the \nfour different laminates studied in this work. The \nreductions in the in-plane moduli were contained \nwithin 7-10%. Therefore, the z-fibre technique is \nvery effective for design against damages caused \nby out-of-plane loads, e.g. impact and stiffeners \npull-off.  \nThe interlaminar stress distributions near the free \nedge of a z-pinned laminate were significantly \naffected when z-fibres were placed within a \ncharacteristic distance of one z-fibre diameter \nfrom the free-edge. Detailed numerical analysis \nshowed that local z-fibres carried significant \namount of the interlaminar normal and shear \n  \n \n \nstresses. Therefore, z-pins may be used to \nreinforce free edges around structural cut-outs \nand to reinforce structural interface of co-cured \ncomponents such as stiffeners flanges.    \nAcknowledgement  \nThe work reported here was funded by the DTI \nCARAD programme, via the MERCURYM \nproject. The authors would also like to \nacknowledge Dr I Partridge, Dr. D Cartie and M \nTroulis for helpful discussions. \n \nReferences \n1.  Freitas G, Fusco T, Campbell T, Harris J & \nRosenberg S. Z-FiberTM Technology and \nProducts for Enhancing Composite Design. \nProc of 83rd Meeting of the AGARD SMP, \n1996, CP-590.  \n2.  Freitas G, Fusco T, Magee C & Dardzinski P. \nFibre insertion process for improved damage \ntolerance in aircraft structures. J. of Advanced \nmaterials, 25 (1994). \n3.  Cartie DDR & Partridge IK. Z-pinned \ncomposite laminates: improvements in \ndelamination resistance. Proc 5th Int Conf on \nDeformation and Fracture of Composites, \n1999. \n4.  Preliminary lamina, laminate and sub-element \ntest results for Z-fiberTM reinforced IM7\/977-\n3 uni-directional tape and fabric. AZTEX, \nVersion 1.3 – 1998. \n5.  Bitsianis N. The influence of z-pinning on \ntoughness and impact performance of carbon \nfibre polymer composite materials. MSc \nThesis, Cranfield University, 1999.  \n6.  Palazotto AN, Gummadi LNB, Vaidya UK, \nHerup EJ. Low velocity impact damage \ncharacteristics of Z-fibre reinforced sandwich \npanels – an experimental study. Composite \nStructures, 43(1999), 275-288.  \n7.  Farley GL & Dickinson LC. Mechanical \nresponse of composite materials with \nthrough-the-thickness reinforcement. NASA \nCR-14753, 1993, 123-143. \n8.  Childress JJ and Freitas G. Z-direction \npinning of composite laminates for increased \nsurvivability. Proc of the AIAA Aerospace \nDesign Conference, 1992, 1092-1099.   \n9.  Altergott W. The Z-Fiber process, through-\nthickness reinforcement for composite \nstructures. Proc of the 10th DOD\/NASA\/FAA \nConf of Fibrous Composites in Structural \ndesign, NAWCADWAR-94096-60, 1994, \npp.71-93. \n10.  Sun CT & Li S. Three-dimensional effective \nelastic constants for thick laminates. Journal \nof Composite Materials. 1988. Vol. 22, 629-\n639.  \n11.  Sun CT & Vaidya RS. Prediction of \ncomposites properties from a representative \nvolume element. Composite Sci & Tech. \n1996, Vol. 56, 171-179.  \n12.  Whitcomb JD, Chapman CL & Tang X. \nDerivation of boundary conditions for micro-\nmechanics analyses of plain and satin weave \ncomposites. J Comp Mat. 34(2000), 724-747. \n13.  Lin CJ & Chan WS. Stiffness of composite \nlaminates with z-fibre reinforcement. Proc \nAIAA\/ASME\/ASCE\/AHS\/ASC Structures, \nStructural Dynamics, & Materials \nConference, St. Louis MO, April 1999. Paper \nNo. AIAA-99-1294, 918-924 \n14.  Dickinson LC, Farley GL, & Hinders MK. \nPrediction of effective three-dimensional \nelastic constants of translaminar reinforced \ncomposites. J of Composite Materials. 33 \n(1999), 1002-1029. \n15.  Hu FZ & Soutis C. Interlaminar stresses in \ncomposite laminates with a circular hole.  \nComposite Structures.  37 (1997), 223-232.    \n16.  Barrett DJ. The mechanics of z-fibre \nreinforcement. Composite Struts, 36 (1996), \n23-32. \n17.  Craig A & Fleck NA. Z-pinned composite \nlaminates: knockdown in compressive \nstrength. 5th Int Conf on Deformation and \nFracture of Composites, 1999, 60-68. \n18.  Troulis M, Cartie DDR, L Barattoni & \nPartridge IK. Z-pinned woven laminates: \ninterlaminar fracture results and pinned \nquality considerations. Proc. Int Conf. On \nDeformation & Fracture of Composites \n(DFC 6), Manchester, April 2000.  \n \n \nPublished in Composites Part A: applied science and manufacturing, Vol. 33 (2002), 1653-\n1664. Publisher: Elsevier.  \n"}