{"doi":"10.1016\/j.ecocom.2007.06.009","coreId":"63992","oai":"oai:nora.nerc.ac.uk:1161","identifiers":["oai:nora.nerc.ac.uk:1161","10.1016\/j.ecocom.2007.06.009"],"title":"Modelling the third dimension: Incorporating topography into the movement rules of an individual-based spatially explicit population model","authors":["Alderman, J.","Hinsley, S. A."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007","abstract":"A wide variety of topographical and environmental elements have been shown or proposed to influence the movement decisions of dispersing animals. Most real landscapes have topographical elements such as hills, valleys and urban developments, which can all act to modify a species’ perceptual range and directly influence movement behaviour. If a visual-based perceptual ability enables a dispersing individual to locate suitable habitat patches at a distance, then it is to be expected that topographical features would act to modify the overall success of this strategy. However, the majority of individual-based Spatially Explicit Population Models (SEPM) employ only two-dimensional landscapes.\\ud\n\\ud\nTo investigate the effects of topographical elevation on dispersal patterns, a three-dimensional visual-based perceptual range algorithm was added to the dispersal rules of an individual-based SEPM. To explore the possible influences of a behavioural-based response to topography, an algorithm modelling valley-seeking behaviour was also developed. The performance of both algorithms was compared with that of a two-dimensional visual-based perceptual range algorithm. The overall consequences of dispersal under each algorithm were measured by recording population sizes in a target wood in the centre of a modelled, real landscape.\\ud\n\\ud\nThe size of the population in the target wood, modelled using both of the three-dimensional algorithms, exhibited sensitivity to the direction of dispersal in interaction with perceptual range, which differed from that predicted by the two-dimensional approach. Population size was dependant on the spatial configuration of habitat patches and on the topography of the landscape, both of which could guide dispersers either towards or away from the target patch depending on the particular combinations of dispersal directions and perceptual ranges selected. Topography was found to have a greater effect on dispersal at shorter perceptual ranges, and thresholds in the results for all three algorithms suggested the existence of species and landscape dependant optimal perceptual ranges. It is recommended that both topography and topographical-based dispersal-altering algorithms, commensurate with the studied species’ behaviour, be incorporated into the movement rule-base of dispersal simulation models. The modelling of topography and its effects on movement in patchy landscapes are seen as essential ingredients in future landscape planning","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/63992.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/1161\/1\/Alderman_Hinsley.pdf","pdfHashValue":"19c3d6c275e0f9e55447106214fe11670903751e","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:1161<\/identifier><datestamp>\n      2012-11-22T11:46:52Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533131<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/1161\/<\/dc:relation><dc:title>\n        Modelling the third dimension: Incorporating topography into the movement rules of an individual-based spatially explicit population model<\/dc:title><dc:creator>\n        Alderman, J.<\/dc:creator><dc:creator>\n        Hinsley, S. A.<\/dc:creator><dc:subject>\n        Ecology and Environment<\/dc:subject><dc:description>\n        A wide variety of topographical and environmental elements have been shown or proposed to influence the movement decisions of dispersing animals. Most real landscapes have topographical elements such as hills, valleys and urban developments, which can all act to modify a species’ perceptual range and directly influence movement behaviour. If a visual-based perceptual ability enables a dispersing individual to locate suitable habitat patches at a distance, then it is to be expected that topographical features would act to modify the overall success of this strategy. However, the majority of individual-based Spatially Explicit Population Models (SEPM) employ only two-dimensional landscapes.\\ud\n\\ud\nTo investigate the effects of topographical elevation on dispersal patterns, a three-dimensional visual-based perceptual range algorithm was added to the dispersal rules of an individual-based SEPM. To explore the possible influences of a behavioural-based response to topography, an algorithm modelling valley-seeking behaviour was also developed. The performance of both algorithms was compared with that of a two-dimensional visual-based perceptual range algorithm. The overall consequences of dispersal under each algorithm were measured by recording population sizes in a target wood in the centre of a modelled, real landscape.\\ud\n\\ud\nThe size of the population in the target wood, modelled using both of the three-dimensional algorithms, exhibited sensitivity to the direction of dispersal in interaction with perceptual range, which differed from that predicted by the two-dimensional approach. Population size was dependant on the spatial configuration of habitat patches and on the topography of the landscape, both of which could guide dispersers either towards or away from the target patch depending on the particular combinations of dispersal directions and perceptual ranges selected. Topography was found to have a greater effect on dispersal at shorter perceptual ranges, and thresholds in the results for all three algorithms suggested the existence of species and landscape dependant optimal perceptual ranges. It is recommended that both topography and topographical-based dispersal-altering algorithms, commensurate with the studied species’ behaviour, be incorporated into the movement rule-base of dispersal simulation models. The modelling of topography and its effects on movement in patchy landscapes are seen as essential ingredients in future landscape planning.<\/dc:description><dc:publisher>\n        Elsevier<\/dc:publisher><dc:date>\n        2007<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/1161\/1\/Alderman_Hinsley.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Alderman, J.; Hinsley, S. A..  2007  Modelling the third dimension: Incorporating topography into the movement rules of an individual-based spatially explicit population model.   Ecological Complexity, 4 (4). 169-181.  https:\/\/doi.org\/10.1016\/j.ecocom.2007.06.009 <https:\/\/doi.org\/10.1016\/j.ecocom.2007.06.009>     \n <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/j.ecocom.2007.06.009<\/dc:relation><dc:relation>\n        doi:10.1016\/j.ecocom.2007.06.009<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/1161\/","http:\/\/dx.doi.org\/10.1016\/j.ecocom.2007.06.009","doi:10.1016\/j.ecocom.2007.06.009"],"year":2007,"topics":["Ecology and Environment"],"subject":["Publication - Article","PeerReviewed"],"fullText":" 1\nModelling the third dimension: incorporating \ntopography into the movement rules of an individual-\nbased spatially explicit population model \n \nJ. Alderman ¹, S.A. Hinsley ² \n \n¹ Landscape and Biodiversity Research Group, School of Applied Sciences, University of \nNorthampton, Park Campus, Northampton, NN2 7AL, UK. email: jolyon.alderman@btinternet.com \n \n² Centre for Ecology and Hydrology, Monks Wood, Abbots Ripton, Huntingdon, Cambridgeshire, \nPE28 2LS, UK. email: sahi@ceh.ac.uk \n \nCorrespondence address: Dr. J Alderman, 2 Friars Avenue, Delapre, Northampton, Northamptonshire, \nNN4 8PY, UK. email: jolyon.alderman@btinternet.com \n \n \nAbstract \n \nA wide variety of topographical and environmental elements have been shown or \nproposed to influence the movement decisions of dispersing animals. Most real \nlandscapes have topographical elements such as hills, valleys and urban \ndevelopments, which can all act to modify a species’ perceptual range and directly \ninfluence movement behaviour. If a visual-based perceptual ability enables a \ndispersing individual to locate suitable habitat patches at a distance, then it is to be \nexpected that topographical features would act to modify the overall success of this \nstrategy. However, the majority of individual-based Spatially Explicit Population \nModels (SEPM) employ only two-dimensional landscapes. \n \nTo investigate the effects of topographical elevation on dispersal patterns, a three-\ndimensional visual-based perceptual range algorithm was added to the dispersal rules \nof an individual-based SEPM. To explore the possible influences of a behavioural-\nbased response to topography, an algorithm modelling valley-seeking behaviour was \nalso developed. The performance of both algorithms was compared with that of a two-\ndimensional visual-based perceptual range algorithm. The overall consequences of \n  \n 2\ndispersal under each algorithm were measured by recording population sizes in a \ntarget wood in the centre of a modelled, real landscape.  \n \nThe size of the population in the target wood, modelled using both of the three-\ndimensional algorithms, exhibited sensitivity to the direction of dispersal in \ninteraction with perceptual range, which differed from that predicted by the two-\ndimensional approach. Population size was dependant on the spatial configuration of \nhabitat patches and on the topography of the landscape, both of which could guide \ndispersers either towards or away from the target patch depending on the particular \ncombinations of dispersal directions and perceptual ranges selected. Topography was \nfound to have a greater effect on dispersal at shorter perceptual ranges, and thresholds \nin the results for all three algorithms suggested the existence of species and landscape \ndependant optimal perceptual ranges. It is recommended that both topography and \ntopographical-based dispersal-altering algorithms, commensurate with the studied \nspecies’ behaviour, be incorporated into the movement rule-base of dispersal \nsimulation models. The modelling of topography and its effects on movement in \npatchy landscapes are seen as essential ingredients in future landscape planning. \n \n \nKeywords \n \nElevation, dispersal, PatchMapper, perceptual range, SEPM, topography \n \n \n1. Introduction \n \nOne of the effects of habitat fragmentation is to isolate species in separate habitat \npatches, with dispersal between the patches requiring individuals to traverse \nunsuitable and often inhospitable parts of the landscape, often referred to as ‘the \nmatrix’ (Andren, 1994; Fahrig, 1997; Haydon and Pianka, 1999; Zollner and Lima, \n1999; Ricketts, 2001; Fahrig, 2003). The degree to which a particular dispersing \nspecies is successful in locating fragmented habitat is dependent, in part, on the \nphysical characteristics of the species and its behavioural responses to the various \n  \n 3\nlandscape elements (Alderman et al., 2005). The resulting inter-patch movements \nresult in species-dependant dispersal-flow patterns linking the various patches within \na landscape (Alderman, 2005).    \n \n   A wide variety of topographical and environmental elements have been either \nshown or proposed to influence the movement decisions of dispersing animals \n(Gustafson and Gardner, 1996; Roland et al., 2000; Tischendorf and Fahrig, 2000; \nTuck and Hassall, 2004; Pe’er et al., 2005; Kindlmann et al., 2005). Individuals of \nparticular species have also been shown to vary their search strategies in response to \ntheir immediately perceived surroundings (Zollner and Lima, 2005; Heinz and Strand, \n2006). Aside from environmental cues, such as wind, precipitation, magnetic fields \nand polarised light (Yeomans, 1995; Acevedo et al., 2005; Schooley and Branch, \n2005), animals may also respond to various topographical-based elements. These \ninclude the influence of slope aspect and gradient on the migration patterns of red \ndeer (Cervus elaphus) (Mysterud et al., 2001), the hill-climbing behaviour of the \nlesser spotted fritillary (Melitaea trivia) (Pe’er et al., 2004) and a preference of the \nAfrican elephant (Loxodonta africana) for level ground (Wall et al., 2006). \n \n   Early definitions of the distance over which a particular species is able to \ndistinguish between different landscape elements include its ‘radius of detection’, \n‘reactive distance’ or ‘detection distance’ (Cain, 1985; Fahrig, 1988; Adler and \nNuernberger, 1994). More recently, the concept has become referred to as ‘perceptual \nrange’. An individual species’ visual perceptual range defines the areal extent of the \nlandscape over which individuals of that species can make visual distinctions between \ndifferent landscape elements (Zollner and Lima, 1997; Zollner, 2000). The detected \nlandscape elements can be used by an individual as basic information on which to \nformulate its movement choices (Olden et al., 2004). Perceptual range can therefore \nbe expected to influence the population sizes in individual habitat patches and the \ndistribution of a population throughout a particular landscape. For a dispersing \nindividual, a reduction of its perceptual range results in less of the landscape being \n‘seen’. This in turn increases the time spent in the matrix before locating a habitat \npatch, thereby increasing the chance of dispersal mortality through factors such as \nreserve depletion and predation (Lima and Zollner, 1996; Schooley and Wiens, 2003).  \n  \n 4\nThe concept of visual-perceptual range, viewed as a functional trait of an individual \nspecies moving within its environment, can also be considered as a component of the \n‘eco-field’ paradigm proposed by Farina and Belgrano (2004). Within this paradigm, \nvisual-based perceptual range would form an emergent property of a multi-\ndimensional landscape, creating a ‘view’ of the landscape within the cognitive space \nof the dispersing individual, contributing to that individual’s overall perception of the \nlandscape.   \n \n   Most landscapes are not two-dimensional and incorporate topographical \nheterogeneity to varying degrees (Pe’er et al., 2006). If a visual-based perceptual \nability enables a dispersing individual to locate suitable habitat patches at a distance, \nthen it is to be expected that topographical features would act to modify the overall \nsuccess of this strategy. Hills could, for example, act to obscure the view of \npotentially suitable habitat (Fig. 1). Valleys could act as corridors, guiding a disperser \ntowards or away from potentially suitable habitat. Determining the dispersal-flow \npaths of individuals that use visual-based perceptual range, in a two-dimensional \nrepresentation of a topographically rich landscape, is likely to give misleading results. \nThere is a distinct possibility of predicting false dispersal paths and incorrectly \nestimating the population sizes in target patches. Depending on the relative positions \nof disperser, topographical feature and habitat patch, determining the dispersal flow \npaths in a three-dimensional representation of the same landscape should more \naccurately describe the complexity of the response of the disperser to a real landscape \nand thus give more dependable results.  \n \n   This study describes a three-dimensional visual-based perceptual range algorithm, \nwhich, when added to the dispersal rules of an individual-based Spatially Explicit \nPopulation Model (SEPM), enables the elevation of a landscape to influence inter-\npatch dispersal paths. To explore the additional benefits of modelling elevation, the \nmodel was further enhanced by the addition of a behavioural-based topographical \nresponse, in the form of a valley-seeking algorithm. The performance of both \nalgorithms was compared with that of a two-dimensional visual-based perceptual \nrange algorithm, by recording their respective effects on dispersal paths through a \nlandscape of fragmented habitat patches. The overall consequences of dispersal under \n  \n 5\neach algorithm were measured by recording population size in a target wood in the \ncentre of the modelled landscape.   \n \nWithin north-western European agricultural landscapes, woodland is highly \nfragmented and exists largely as scattered patches (Pain and Pienkowski, 1997, \nHinsley et al., 1998, Benton et al., 2003). In such landscapes, territorial woodland \nspecies are forced to disperse between patches, with dispersal occurring on a \nlandscape scale (Saïd and Servanty, 2005). The nuthatch (Sitta europaea) is an \nexample of a residential, univoltine territorial woodland species, which is known to \ndisperse from the natal patch in search of suitable breeding habitat (Nilsson, 1987; \nPravosudov, 1993; Matthysen et al., 1995; Matthysen and Currie, 1996). It has been \nfound that univoltine territorial species are ideal for modelling with individual based \nSEPMs (Alderman, J., 2005) and, allied to the availability of landscape and nuthatch \nhabitat occupancy data, it was decided to base this study on the dispersal of \nnuthatches within an agricultural landscape in eastern England. This landscape is \ndominated by intensive arable agriculture within which woodland is relatively scarce \n(c. 3% of land cover) and about 50% occurs in patches of 10 ha or less (Forestry \nCommission 1980, unpubl.)  The overall consequences of dispersal under each \nalgorithm were measured by recording population size in a target wood (Monks \nWood) in the centre of the modelled landscape.  \n \n2. Methods \n \n2.1. Model Species and Study Area \n \nThe nuthatch is a small (c. 21-23 g) cavity-nesting woodland passerine (Matthysen \nand Adriaensen, 1998), resident in the UK. The nuthatch is noted as being sensitive to \nisolation (e.g. Enoksson et al., 1995; Hinsley et al., 1995; Matthysen et al., 1995; \nBellamy et al., 1998), suggesting that perceptual range may play a part in the viability \nof nuthatch populations in fragmented landscapes. Previous work (Bellamy et al., \n1998; Alderman, 2005; Alderman et al., 2005) has indicated that the fragmented \nnature of woodland in the study area and its effects on nuthatch dispersal play an \nimportant role in the scarcity and distribution of the species in this landscape.  \n  \n 6\n \n   The study area is located in Cambridgeshire, in eastern England, centred on Monks \nWood (52°24’N, 0°14’W) (Fig. 2). The area comprises 20 × 20 km (40,000 ha) of \nintensively farmed landscape. Approximately 4% (1,660 ha) of the area was wooded \nand 34 woods were deemed suitable for nuthatch occupancy, with the total area of \nbreeding quality nuthatch territory being approximately 300 ha (0.75% of the total \nlandscape area) (Bellamy et al., 1998). South Rockingham Forest, about 12 km west \nof the main study area, was the most suitable area within reasonable dispersal distance \ncapable of acting as a source of immigrant nuthatches. The landscape ranges in \nelevation from 0-70 m above sea level (ASL), with the higher ground lying to the \nwest and forming a (slight) ridge through the middle of the study area. Several valleys \nare apparent, running largely north-west to south-east (Fig. 3). Monks Wood itself lies \non a shallow north-facing slope.  \n \n \n2.2. Model Description \n \nThis study uses PatchMapper, an individual-based spatially explicit population model \n(SEPM), which combines an individual-based population simulator with a grid-based \nrepresentation of the landscape. Coded in Java, for portability, a set of interactive \nscreens control the simulation and enable user-selection of life history, dispersal and \nterritorial parameters, as well as initial population size. Different habitat \nconfigurations and landscape management scenarios can be evaluated with a choice of \nlandscapes, either input from a GIS or user generated. Emigration from the landscape \nis modelled by ‘losing’ an individual once it crosses the landscape edge (an absorbing \nboundary), which is a more realistic approach than modelling with reflective or \nwrapped boundaries (e.g. Pulliam et al.,1992, Tischendorf and Fahrig, 2000). \nImmigration is modelled by enabling individuals to enter the landscape from an edge, \nwith immigration direction being from one of the cardinal or quadrantal compass \npoints, or from all directions. Both immigration direction and yearly rate are user-\nselectable. To incorporate the possible effects of landscape structure on dispersal \npatterns, user-selectable perceptual range and field-of-view mechanisms are integrated \ninto the inter-patch dispersal rules, allowing the disperser to move directly to the \n  \n 7\nnearest wood within the specified range and field-of-view. During a simulation run, \nthe locations of individuals are superimposed on the landscape, presenting a real-time \nvisual output to the user. PatchMapper is further described in Alderman (2005), with \ntypical applications given in Alderman et al. (2004) and Alderman et al. (2005). For \nthe tests in this study, and to improve the model, PatchMapper was modified to \ninclude vector-based dispersal movement and landscape-specific topographical data.  \n \n \n2.3. Landscape Modelling \n \nThe maintenance of a metapopulation within a particular landscape comprising matrix \nand fragmented habitat, depends in part on successful dispersal between habitat \npatches (Gill, 1978; Stacey and Taper, 1992; Hanski 1994; Hanski 1998). Apart from \nthe two-dimensional spatial configuration of habitat patches, topographical features \nmay also influence inter-patch dispersal flow patterns, particularly if vision is the \nmain perceptual mechanism.  \n \n   The size of the population within a particular patch will depend, in part, on both the \nsize and quality of that patch. Nuthatch quality habitat is defined in terms of the area \n(a mutually exclusive territory) of woodland required for a pair of nuthatches to breed \nsuccessfully, with territory area depending on the number and size of suitable \ndeciduous woodland trees, namely oaks (Quercus), elms (Ulmus), beech (Fagus) and \nhazel (Corylus) (Enoksson and Nilsson, 1983; Nilsson, 1987; Enoksson 1990; \nMatthysen and Andriaensen 1998). To enable comparisons of nuthatch territories in \ndifferent countries, territory area classifications have been established. These range \nfrom ‘excellent’ at 1 pair per hectare to ‘very poor’ at 1 pair per 20 hectares (Bellamy \net al., 1998). It is likely that the distribution of suitable deciduous woodland trees (i.e. \nhabitat quality) within a patch will differ, resulting in variations in species density \nwithin that patch. To increase realism, the quality of patches should therefore be \nmodelled, in addition to their area and location, together with landscape topographical \nfeatures. \n \n  \n 8\n   To meet these requirements, PatchMapper uses three maps for each simulation, in \nthe form of cartographic views of the study area. Two maps model the habitat \nstructure and habitat quality (Alderman, 2005), whilst the third models the elevation \nof the study area. Each map is digitised as a two-dimensional square-celled lattice, \nstored in a two-dimensional array. All arrays are at the same resolution (Fig. 4).  \n \n   The structural map is a binary representation of habitat and matrix of the study area, \nmodelling the two-dimensional structure of woods and matrix (Fig. 4a). The quality \nmap is a binary representation of the suitability of the habitat for the establishment of \nnuthatch territories (Alderman et al., 2005) (Fig. 4b). The topographical map is a \nmulti-value representation of elevation within the study area, defining the elevation of \neach modelled cell as an integer (Fig. 3). The three maps are linked via a coupled \nlattice structure (Alderman, 2005). During dispersal, reference is made to all three \nlattices to determine behaviour appropriate to habitat structure, habitat quality and \nelevation.  \n \n   For the tests in this study, all three maps were digitised onto 200 × 200 square-\ncelled lattices, which for the area in question (20 × 20 km) gave a minimum resolution \nof 1 ha. Modelling at this resolution meant that smaller landscape features such as \nhedgerows, individual trees and woods smaller than 1 ha, which may act as refuges \nfor dispersing nuthatches, could not be modelled. This could be a problem with some \nlandscapes, but in this case, as the study area contained few individual mature trees or \nrows of trees (Bellamy et al., 1998), the choice was thought an acceptable \ncompromise between model run times and landscape resolution.  \n \n \n2.4. Species Modelling \n \nNuthatches were modelled by applying behavioural rules to each individual bird, with \nreference to the structure of the habitat and to landscape quality, an approach in which \nboth landscape structure and species’ characteristics govern population sizes and \ndistribution (Alderman, 2005). Nuthatch life history, dispersal and territorial \nparameters were taken from the literature (Alderman et al., 2005).  \n  \n 9\n \n \n2.5. Modelling Dispersal \n \nIn the model, dispersing nuthatches search for habitat, traversing the matrix with a \ncorrelated random walk. Individuals moved a ±  45 degree zig-zag course, centred \nabout a main dispersal angle, with at least a modelled 100 m movement before each \nchange of direction. The number of steps between directional changes was determined \nat random from a uniform distribution. The result was a nearly straight dispersal path; \nsuch paths are thought to maximise the chance of habitat detection over a perfectly \nstraight one (Zollner and Lima, 1999). Dispersal into the landscape was from the \nlandscape edge, with the main dispersal direction determined by the test, whilst \ndispersal from a patch within the landscape was either directly to a nearby patch if one \nwas within perceptual range, or in a random direction.  \n \n   During inter-patch dispersal, the bird moved to the first perceived nearest visible \nhabitat cell. If more than one visible habitat cell was found at the same distance, a \nrandom choice was made to avoid any directional biasing. When a habitat patch was \nencountered, it was searched for suitable nuthatch habitat. If none was found, the \nsearch was resumed for a new patch. If suitable habitat was found, then depending on \nits occupancy status, a new territory was established, a pair formed or, if no vacancies \nexisted, the disperser was forced to search for further suitable habitat within the wood, \nor to search the landscape for another wood (Alderman et al., 2005).  \nThe basic dispersal rules carried out a two-dimensional search of the landscape. In \norder to model the possible effects of elevation and slope on dispersal, two additional \nalgorithms were combined with the basic dispersal rules, namely ‘elevation’ and \n‘valley-seek’, which are described as follows.   \n \n \n2.6. Modelling Elevation \n \nThe general principles behind modelling elevation are given in Fig. 5.  \n \n  \n 10\n   With reference to Fig. 5, scanning outwards from the disperser’s current position \n(point A), in single cell steps (representing the modelled landscape resolution), the \nelevation of a scan point when viewed from the disperser’s current position (angle \nOAX) was calculated in accordance with the following expression.   \n \n \n \n \n ElevationCurrent  Elevation Point Scan  if\nElevationCurrent  Elevation Point Scan  if\n(AY)Point Scan  oPosition tCurrent  from Distance\n(AO)Elevation Current  -Elevation Point Scan  90\n(AO)Elevation Point Scan  -Elevation Current \n(AY)Point Scan  oPosition tCurrent  from Distance\n1\n1\n≥\n<\n⎪⎪\n⎪\n⎩\n⎪⎪\n⎪\n⎨\n⎧\n⎟⎟⎠\n⎞\n⎜⎜⎝\n⎛+°\n⎟⎟⎠\n⎞\n⎜⎜⎝\n⎛\n=∠\n−\n−\nTan\nTan\nOAX\ndef\n \n \n \n   The initial value of angle OAX is set to 0 and stored. At each scanned step the angle \nOAX is calculated and compared with the stored value. If the new angle is less than \nthe previous one, then the cell is invisible and the new angle is discarded. If the new \nangle is greater or equal to the previous one, then the cell is visible and the new angle \nis stored and used as the comparison value for the next step. A flow-chart of the basic \nsequence is given in Fig. 6, which stops when a visible habitat cell is found, or when \nthe perceptual range is reached (measured by the Euclidean distance from the current \nposition to the scan point, as per distance AX in Fig. 5).  \n \n   Adding an offset to the elevation of the disperser at the start of the scanning process \nenabled the height above the landscape to be modelled. This feature allows an \nindividual to keep at a fixed height above the ground and also allows a wide variety of \nspecies to be modelled, from ground dwelling to high flying\/migratory.  \n \n   The basic elevation algorithm determines which cells are visible from a given \nlocation, but is limited to a single-cell field of view. Implicit in the concept of visual \nperceptual range is a species’ field of view, but published coverage of this subject is \nsparse (Olden et al., 2004). For the tests in this study, a 90-degree field of view was \nemployed, as a compromise between computational efficiency and ensuring that cell \ncoverage was a factor in the resultant model behaviour. To accommodate a field of \nview, the basic sequence was modified, such that after each movement step a search \n  \n 11\nof all cells within the field of view (up to the perceptual range) was carried out. The \nsearch looked at all cells, progressively fanning out from the origin (Alderman et al., \n2005).  \n \n   The complete algorithm records all visible cells within the individual’s perceptual \nrange, the number of which depends on the topology of the section of landscape being \nsearched and varies dynamically as the disperser moves through the landscape. \nCompare this to a two-dimensional search, where the same number of cells would be \nvisible at all times. By determining which patches are visible, the effects of elevation \ncan now be used to influence an individual’s movement rules.   \n \n \n2.7. Valley Seeking \n \nThe elevation algorithm models all parts of the landscape that a disperser can ‘see’, \nwithin the (user-selected) perceptual range and field of view. Modification of the \ndispersal flow depends solely on the visibility of a habitat patch. It is likely, however, \nthat other topographical features will also modify the dispersal direction. One of these \nmay be the slope of the landscape, as is the case with african elephants’ apparent \npreference for level ground (Wall et al., 2006) and the hill-topping behaviour of the \nlesser spotted fritillary (Pe’er et al., 2005). Even in sparsely wooded landscapes, it is \nlikely that trees and bushes will still be present along watercourses. Preferring to \ntravel under forest cover rather than cross open areas, dispersing nuthatches (and other \nwoodland birds) may therefore follow valleys, where suitable cover is more likely to \nbe found (Haas, 1995; Machtans et al., 1996; Belisle and Desrochers, 2002). \nAnalogously, ringlet butterflies (Aphantopus hyperantus) have been shown to disperse \nbetween forest glades using open rides rather than via more direct routes through \ndense woodland (Sutcliffe and Thomas, 1996). To incorporate this concept, a valley-\nseeking algorithm was added, in which a dispersing individual looks ahead for a cell \nlower than their current position. If a lower cell is visible, the dispersal direction is \naltered to the bearing from the current position to the lower cell. (The same basic \nelevation modelling algorithm was used, but modified to look for a lower, rather than \na habitat, cell.) When selected, the valley-seek algorithm is applied at each dispersal \n  \n 12\nstep, followed by the elevation algorithm. In this way, dispersers seek-out and move \ntowards lower ground, or down valleys. To prevent a disperser becoming trapped, at \nthe end of a valley for example, the dispersal direction is not altered if a lower cell \ncannot be found.   \n \n \n3. Tests \n \nTo enable a comparison between modelling dispersal in a two-dimensional landscape \n(the current commonly employed modelling scenario) and the two described \ntopographical-based algorithms, three tests were devised, called here ‘2D’, ‘elevation’ \nand ‘valley-seek’.  \n \n   To act as a base comparison, the first test (2D) used the habitat and quality \nlandscapes given in Fig. 4, modelling a two-dimensional landscape with no \ntopographical data. To gauge the effects of elevation on the visual-perceptual abilities \nof dispersers, the second test (elevation) incorporated topographical data, adding the \nlandscape given in Fig. 3, to those used for the first test. To gauge the effects of a \npossible topographical-based behavioural response on dispersal, the third test (valley-\nseek) added the valley-seeking algorithm to the set of landscapes. All tests measured \nthe average number of pairs of nuthatches in our target wood, Monks Wood, at the \ncentre of the test landscape, over 5,000 yearly cycles, with an immigration rate of 15 \nindividual birds per cycle from each of the cardinal and quadrantal directions in turn. \nThe tests were repeated for eight (modelled) perceptual ranges from 0 to 10 km, the \nindividual values used were as in Figs. 9 and 10. All tests used a field-of-view of 90 \ndegrees.  \n \n \n4. Results     \n \nWith eight dispersal directions, eight perceptual ranges and three test scenarios, the \ntotal number of predictions for the nuthatch population size in Monks Wood was 192. \nTherefore, the results were summarised as follows: 4.1.) showing the differences in \n  \n 13\npopulation sizes for both of the topographical test scenarios, elevation and valley-\nseek, compared with those predicted by 2D (Tables 1 and 2, difference calculated as \ntest prediction – 2D prediction), 4.2.) illustrating the directional sensitivity of each of \nthe test scenarios for selected perceptual ranges (Figs. 7 and 8) and 4.3.) illustrating \nthe effects of increasing perceptual range for each of the test scenarios for selected \nimmigration directions (Figs. 9 and 10). Perceptual ranges of 200 m and 2 km were \nselected because, i) 200 m was representative of the known perceptual ranges of \nvarious ground and tree dwelling species (Alderman, 2005) and ii) 2 km corresponded \nto the maximum distance over which a human observer at ground level in a similar \nlandscape was able to clearly identify woods (Alderman, pers. obs.). The actual \nperceptual range of the nuthatch is unknown. Immigration from the west and the south \neast was selected because, i) previous work (Alderman et al., 2004, Alderman, 2005) \nhad shown that the most likely source of immigrants for the study area was a forest 12 \nkm to the west and ii) immigration from the south east gave similar results for the \nthree algorithms at the 200 m perceptual range (Fig. 7), but significantly different \nresults at the 2 km range between all three algorithms (Fig. 8).  \n \n4.1. Overall results \n \nThe overall results of the tests showed that, as with previous modelling studies \n(Alderman et al., 2004; Alderman, 2005), the nuthatch population in Monks Wood \nwas dependent on both perceptual range and the direction of immigration into the \nstudy area for all three test scenarios.  \n \n   Both the elevation and the valley-seek algorithms showed a similar overall range of \ndeviations from the numbers of pairs of nuthatches in Monks Wood predicted by 2D \n(Tables 1 and 2). The differences in predicted numbers when comparing 2D with \nelevation ranged from  –4.26 (-29%) to +2.84 (+32%) pairs, and those comparing 2D \nwith valley-seek ranged from –5.21 (-52%) to +2.48 (+35%) pairs. Both comparisons \nshowed increasing deviations with increasing perceptual range. The 2D-elevation \ncomparisons resulted in 8 deviations of more than ± 1 pair for perceptual ranges < 1 \nkm, but 17 such predictions for ≥ 1 km. For the same two categories of perceptual \n  \n 14\nrange, the 2D-valley-seek comparisons resulted in 10 and 16 such deviations \nrespectively. \n \n   Despite these similar ranges of deviations, the pattern of deviation in relation to \nperceptual range and immigration direction differed. For deviations of more than ± 1 \npair, as perceptual range increased, the 2D-elevation comparisons were increasingly \npositive, whilst the 2D-valley-seek comparisons remained predominantly negative. \nFor a range of 1 km and above, of the 17 qualifying 2D-elevation comparisons, 12 \nwere positive; of the 16 qualifying valley-seek comparisons, only 4 were positive. In \ncontrast, for perceptual ranges below 1 km, 2 of the 8 qualifying 2D-elevation \ncomparisons and 2 of the 10 qualifying valley-seek comparisons were positive.  \n \n   The comparison responses were dependent on both immigration direction and \nmovement algorithm. For example, for the 2D-elevation comparisons, the north-\neasterly direction results peaked at +2.43 pairs at a perceptual range of 0.5 km and \nthen dropped to a low of –4.26 pairs at 10 km, whereas the southerly direction gave an \nessentially flat response, +0.82 to –1.00 pairs, over the whole range. For the 2D-\nvalley-seek comparisons, the north-easterly direction resulted in a low of  –5.21 pairs \nat a perceptual range of 0.5 km, rose to +0.97 pairs at 2 km and finally fell back to –\n3.78 pairs at 10 km. As a contrast, the north-westerly direction resulted in a dip of –\n2.59 pairs at 0.1 km and rose to a maximum of +1.15 pairs at 5 km. For some \ndirections, and particularly for valley-seek, a small change in perceptual range could \nresult in a relatively large change in numbers compared to 2D, e.g. from 2.17 to –0.32 \nfor a southerly direction and an increase in range from 0.1 to 0.2 km, and from 0.10 to \n–5.21 for a north easterly direction and an increase from 0.2 to 0.5 km. \n \n4.2. Directional sensitivity \n \nAt a perceptual range of 200 m, the 2D tests resulted in a population size in Monks \nWood of approximately 6 ± 0.20 (95% C.I.) to 8 ± 0.22 pairs for all immigration \ndirections, except from the west, which predicted lower numbers of about 4 ± 0.18 \npairs (Fig. 7). The elevation algorithm showed a similar sensitivity to immigration \ndirection for all directions, except the north-west, where the predicted numbers were \n  \n 15\nlower at approximately 3 ± 0.16 pairs, and the south-west, where numbers were \nhigher at about 9 ± 0.21 pairs. The valley-seek algorithm gave a similar response to \nthe 2D and elevation algorithms for immigration from the north, east, south-east, \nsouth and west, but numbers were less for the south-west (approximately 4 ± 0.19 \npairs) and north-east (approximately 3 ± 0.17 pairs). With immigration from the \nnorth-west, the valley-seek and elevation algorithms predicted similar population \nsizes of 2 ± 0.16 to 3 ± 0.17 pairs, compared with the 2D algorithm’s prediction of 6 ± \n0.2 pairs. All three algorithms gave a similar result for immigration from the north \nwith a prediction of approximately 7 ± 0.2 pairs. \n \n   At a perceptual range of 2 km, the 2D predicted population size for Monks Wood \nbecame directionally dependant, varying from approximately 14 ± 0.17 pairs for \nnorth-easterly immigration to approximately 3 ± 0.16 pairs for southerly immigration \n(Fig. 8). The response for the elevation algorithm was effectively the same as that of \nthe 2D algorithm for immigration from the north, north-west, west, south-west and \nsouth. The population size in Monks Wood was greater than when using the 2D \nalgorithm for easterly and south-easterly immigration, but less for north-easterly \nimmigration. The response for the valley-seek algorithm differed significantly from \nboth the 2D and elevation algorithms, demonstrating greater sensitivity to \nimmigration from the north and north-east and lower sensitivity to south-easterly and \nwesterly immigration. For this algorithm, the population size in Monks Wood was \nsignificantly greater than for the 2D algorithm for the northerly direction and \nsignificantly less in the westerly and south-easterly directions. All three algorithms \ngave a similar response for the north-westerly immigration direction.  \n \n \n4.3. Perceptual range effects \n \nFor the westerly direction, the population size predicted by the 2D and elevation \nalgorithms remained effectively the same at approximately 5 pairs, up to a perceptual \nrange of about 0.5 km (Fig. 9). Above this range, the 2D algorithm predicted a rise in \npopulation to an upper threshold of 6-7 pairs at 1 km, and then remaining effectively \nthe same to the upper limit of the test (10 km). The elevation algorithm resulted in an \n  \n 16\nincrease in population size to an upper threshold of about 8 pairs at a similar range (1 \nkm), declining to 6-7 pairs at the upper limit of the test.  \n \n   For the south-westerly direction, the population size predicted by the 2D and \nelevation algorithms remained effectively the same at approximately 5 pairs, up to a \nperceptual range of about 0.2 km (Fig. 10). Above this range, the 2D algorithm \npredicted a rise in population to 8-9 pairs, decreasing to about 7 pairs at the upper \nlimit of the test (10 km). The elevation algorithm resulted in an increase in population \nsize from the 0.2 km perceptual range, rising to a peak of about 12 pairs at 2 km, \ndeclining to approximately 10 pairs at the upper limit.   \n \n   For both selected immigration directions, the valley-seek algorithm resulted in a \nthreshold at approximately 0.5 km perceptual range, above which the predicted \npopulation size in Monks Wood decreased to a minimum at 1-2 km, followed by a \nslight increase from 2-10 km (Figs. 9 and 10). Although for the westerly direction the \npopulation size was effectively constant from 0-0.5 km, it oscillated over this range \nfor the south-easterly direction, with a peak at 0.1 km and a dip at 0.2 km. Apart from \nthis oscillation, all three algorithms resulted in effectively similar population sizes in \nMonks Wood for both directions, up to 0.2-0.5 km. Above this range, the valley-seek \nalgorithm always predicted significantly lower population sizes. Overall, the valley-\nseek algorithm showed less sensitivity to perceptual range than did 2D or elevation, \nindicating that such behaviour in response to topography could have a powerful effect \non dispersal flows through landscapes and on settlement patterns.  \n \n \n5. Discussion \n \nThe landscape used for this study was largely flat, with shallow valleys and a \ndifference between maximum and minimum elevation of only 70 m and is typical of \nEnglish lowlands. Despite this moderate topography, the size of the population in \nMonks Wood modelled using both of the three-dimensional algorithms, exhibited \ndirectional sensitivity in interaction with perceptual range, which differed from that \npredicted by the two-dimensional approach (Figs. 7-10). Thus, the population in \n  \n 17\nMonks Wood was dependant on the spatial configuration of habitat patches and the \ntopography of the landscape, both of which acted to guide dispersal towards or away \nfrom the target patch. The effect on dispersal of these landscape elements is \nparticularly important in cases where immigration is essential in maintaining the \npopulation (Stacey and Taper, 1992; Alderman et al., 2004; Alderman, 2005).  \n \n   The differences in directional sensitivity and predicted population sizes (Table 1, \nFigs. 7 and 8) between the 2D and elevation algorithms were moderate, the maximum \ndifference in population size across all directions being 40%. This suggests that in \nsome circumstances modelling elevation could be an unwanted complication, \nincreasing the data requirements and debugging and run-times. However, the 2D-\nelevation comparisons that produced population differences greater than ± 1 pair were \nmore likely to be positive at greater perceptual ranges suggesting that a 2D approach \ncould under-estimate population sizes under certain combinations of topography and \nperceptual range. Furthermore, that differences were apparent in such a flat landscape \nindicated that topography has considerable potential to influence directional dispersal \ndecisions. In more dramatically three-dimensional landscapes, such as the Lake \nDistrict (UK) or Fjordland (Norway), the distribution and orientation of hills and \nvalleys would be expected to produce greater differences. Topography will also \ninfluence vegetation structure, e.g. riparian woodland in valley bottoms (Dmowski \nand Kozakiewicz, 1990; Machtans et al., 1996), which will in turn influence dispersal \npaths. When elevation is known to affect behaviour (e.g. Pe’er et al., 2004; Wall et al., \n2006), then elevation modelling becomes an essential pre-requisite. \n \n   The valley-seek algorithm gave a distinctly different response to the 2D and \nelevation algorithms, being highly directional, even at the lower perceptual ranges \n(Figs. 7 and 8). Also, the much more flat response to changes in perceptual range \n(Figs. 9 and 10) suggested that topography was overriding perceptual range to some \nextent. To illustrate this, Fig. 11 shows dispersal-flow paths (Alderman et al., 2005), \nusing valley-seek, generated by recording the accumulated paths of all dispersal \nwithin the landscape over 500 cycles, for perceptual ranges of 0.2 km and 2 km and \n15 immigrants per cycle. All immigrants entered the landscape from a randomly \nchosen direction. Superimposing the dispersal-flow diagrams over the topographical \n  \n 18\nlandscape (see Fig. 3), revealed that topography had a greater effect on dispersal at the \nlower perceptual range. At 0.2 km, dispersal closely mapped to the valleys and lower \nground, with little movement over the higher ground (Fig. 11a). A low perceptual \nrange will contain fewer patches and reduce the choice of dispersal direction. Under \nthe valley-seek algorithm, the slope of the nearby landscape had a greater effect than \nperceptual range on dispersal patterns, but as perceptual range increased, the effect of \ntopography was overcome. At higher perceptual ranges, dispensers were provided \nwith a potentially greater field of view and could therefore ‘see’ directly across and \nalong valleys. This placed a greater number of patches within range, reducing the \neffect of topography on dispersal flow patterns (Fig. 11b). Perceptual range is \ntraditionally modelled with a static isotropic 360-degree field-of-view, although this is \nnot likely to be realistic (Olden et al., 2004). The inclusion of topography results in a \nmore realistic anisotropic perceptual range, in which not only the outer boundaries, \nbut also the visible area within, vary dynamically as the disperser progresses through \nthe landscape. As noted in the results, abrupt changes in numbers for some \nimmigration directions across small changes in perceptual range (Table 2) might \nrepresent points at which dispersal paths make sudden changes, for example across a \nridge into the next valley. Although a disperser can continually update its decisions as \nit moves, as previously unseen topography comes into view, topography will still be \nhaving a large influence on initial choice of direction, and hence also on any \nsubsequent updating. \n \n   The dependence of the population size in Monks Wood on both perceptual range \nand elevation suggests that inter-patch dispersal paths will be strongly influenced by \nboth these elements. A valley-seeking algorithm was chosen for this study, as one \npossible example of elevation-based behaviour. Such behaviour has not been noted in \nnuthatch dispersal, but was not thought unrealistic. An actual example of such \nbehaviour was revealed in African elephants which dispersed along flatter paths if \npossible, avoiding moving uphill as an energy saving strategy (Wall et al., 2006). In \nthis case, a valley-seeking algorithm would be appropriate. On the other hand, if \nmodelling the hill-topping behaviour of the lesser spotted fritillary (Pe’er et al., 2004), \na valley-avoidance algorithm would be required. \n \n  \n 19\n   Little empirical evidence exists regarding the visual perceptual range of individual \nspecies and such data are difficult to estimate (Wennergren et al., 1995; Lima and \nZollner, 1996; Zollner, 2000). Work on small mammals has found perceptual ranges \nof under 10 m for the marsh rice rat (Oryzomys palustris) (Schooley and Branch, \n2005) and 0-30 m for the white footed mouse (Peromyscus leucopus) (Zollner and \nLima, 1997) and the root vole (Microtus oeconmus) (Andreassen et al., 1998), \ndepending on the visual obstruction of the habitat. Perceptual ranges of 300-500 m \nhave been found for the eastern fox squirrel (Sciurus niger) and the grey squirrel \n(Sciurus carolinensis) (Zollner, 2000). These are all ground or tree dwelling species \nand although it is intuitively likely that birds have the ability to detect landscape \nfeatures at greater distances, no details on the actual perceptual ranges of birds were \nfound in the literature. The variety of perceptual ranges amongst even this limited \nnumber of species suggests that topographical-based algorithms should be \nparameterised with data for the species being studied, rather than using generic \nvalues. This is further reinforced by the presence of thresholds in the results for all \nthree algorithms used in this current study, which suggests the existence of species \nand landscape dependant optimal perceptual ranges.  \n \n   Perceptual range has been included in several spatially explicit population models \n(SEPMs) in one form or another, but has rarely been explored (e.g. Saarenmaa et al., \n1988; Doak et al., 1992; Turner et al., 1993; Adler and Nuernberger, 1994; Turner et \nal., 1994; Schippers et al., 1996). In the few that have investigated in more detail, all \nfound that, in general, increasing perceptual range increased dispersal success within \nartificial landscapes (Cain, 1985; Fahrig, 1988; Zollner and Lima, 1999; Alderman, \n2005; Zollner and Lima, 2005), but only two-dimensional landscapes were used. One \nrecent (but rare) example of modelling the effects of elevation, investigated the hill-\ntopping behaviour of the lesser spotted fritillary (Melitaea trivia) (Pe’er et al., 2005). \nThe authors discovered that the butterfly’s movements could be channelled into \nspecific routes, or ‘virtual corridors’ in a modelled landscape of hills. However, \ndespite finding a dual response to perceptual range (3 m and 50 m) when carrying out \nfieldwork on the real movement of the butterfly, their model did not include the \neffects of perceptual range on dispersal patterns.    \n \n  \n 20\n   Our study is based on visual-based perceptual ability, but other forms of perception \nalso exist such as the detection of polarised light in the pond slider turtle (Trachemys \nscripta) (Yeomans, 1995) and olfactory perception in the cactus bug (Chelinidea \nvittiger) (Schooley and Wiens, 2003). Anemotaxis has also been demonstrated in \nmarsh rice rats (Oryzomys palustris) which search upwind or downwind, but not \ncrosswind, for habitat that is beyond their visual perceptual range (Schooley and \nBranch, 2005). It is likely that these forms of perceptual ability would also be \nmodulated by landscape topography. Depending on the size of the organism in \nquestion and its scale of movement, landscape elements may also contribute to \ntopography, for example, hedgerows may act as guidelines for butterflies (Dover and \nFry, 2001) and other organisms, and towns and cities may alter movement paths. \nRecords of migrant passerines ringed at various sites in north Norfolk (UK), showed \nthat birds were retrapped on the coast to the east of the town of Holkham, but not to \nthe west. Instead, birds were later retrapped inland, suggesting that further westward \nmovement along the coast was inhibited by the birds’ reluctance to overfly the town. \nThe subsequent movement inland may have been facilitated by the presence of \nhedgerows providing an alternative route (R. Baker, pers. com.). \n \n   The method of modelling elevation described in this study extends the concept of \nperceptual range into the third dimension, enabling the effects of elevation and \nelevation-based behaviour on inter-patch dispersal to be modelled. Simulation models \nhave been proposed as key tools in the study of complex systems and the generic \nmodel presented here has the further advantage of being landscape independent \n(Green and Sadedin, 2005). PatchMapper’s use of separate lattices for various aspects \nof the landscape (habitat, habitat quality and elevation) means that experiments with \nelevation can be undertaken by altering the elevation landscape lattice and not the \nelevation algorithm. (Changing the complete landscape only requires a new set of \nlattices [Alderman et al., 2005]). This approach offers an increase in realism over \ntraditional two-dimensional landscape modelling, providing the promise of more \naccurate predictions of population sizes and dispersal paths. As described within the \neco-field paradigm, the results illustrate that an organisms perception of the \nlandscape, and hence its response to it during dispersal, is multifunctional and that \ntopography is an essential function. Therefore, the modelling of topography and its \n  \n 21\nrelated effects on movement in patchy landscapes are seen as essential ingredients in \nfuture landscape planning, assisting, for example, with the creation of additional \nhabitat and movement corridors (Chardon et al., 2003; Sutherland et al., 2004; Watts \net al., 2004). \n \nAcknowledgements \n \nThanks to Ruth Swetnam for supplying the digital landscapes.  \n \n \nReferences \n \nAcevedo, P., Delies-Mateos, M., Escudero, M.A., Vicente, J., Marco, J., Gortazar,    \nC., 2005. Environmental constraints in the colonisation sequence of roe deer \n(Capreolus capreolus Linnaeus, 1758) across the Iberian Mountains, Spain. Journal of \nBiogeography 32, 1671-1680. \n \nAdler, R.A., Nuernberger, B., 1994. Persistence in Patchy Irregular Landscapes. \nTheoretical Population Biology 45, 41-75. \n \nAlderman, J., McCollin, D., Hinsley, S., Bellamy, P., Picton, P., Crockett, R., 2004.    \nSimulating population viability in fragmented woodland: nuthatch (Sitta europaea L.) \npopulation survival in a poorly wooded landscape in eastern England. In: R. Smithers \n(Editor), Landscape Ecology of Trees and Forests. Proceedings 12th Annual \nIALE(UK) Conference. 21st-24th June 2004. IALE(UK). Royal Agricultural College, \nCirencester, pp. 76-83. \n \nAlderman, J., 2005. Conservation by Simulation. Ph.D. Thesis. School of Applied \nSciences, University of Northampton, Park Campus, Northampton, UK. \n \nAlderman, J., McCollin, D., Hinsley, S., Bellamy, P., Picton, P., Crockett, R., 2005.     \nModelling the effects of dispersal and landscape configuration on population \ndistribution and viability in fragmented habitat. Landscape Ecology 20, 857-870.  \n  \n 22\n \nAndren, H., 1994. Effects of habitat fragmentation on birds and mammals in \nlandscapes with different proportions of suitable habitat: a review. Oikos 71, 355-366. \n \nAndreassen, H.P., Bjornbom, E., Carlson, R.G., Gunderson, G., Gunderson, H., 1998. \nVisual cues as determinants of perceptual range in root voles Microtus oeconmus. \nActa Theriologica 43, 371-378. \n \nBellamy, P.E., Brown, N.J., Enoksson, B., Firbank, L.G., Fuller, R.J., Hinsley, S.A., \nSchotman, A.G.M., 1998. The influences of habitat, landscape structure and climate \non local distribution patterns of the nuthatch (Sitta europaea L.). Oecologia 115, 127-\n136.   \n \nBelisle, M., Desrochers, A., 2002. Gap-crossing decisions by forest birds: an \nempirical basis for parameterizing spatially-explicit, individual-based models. \nLandscape Ecology 17, 219-231.  \n \nBenton, T.G., Vickery, J.A., Wilson, J.D., 2003. Farmland biodiversity: is habitat \nheterogeneity the key? Trends in Ecology and Evolution 18, 182-188. \n \nCain, M.L., 1985. Random Search by Herbivorous Insects: A Simulation Model. \nEcology 66, 876-888. \n \nChardon, J.P., Adriaensen, F., Matthysen, E., 2003. Incorporating landscape elements \ninto a connectivity measure: a case study for the speckled wood butterfly (Pararge \naegeria L.). Landscape Ecology 18, 561-573. \n \nDmowski, K., Kozakiewicz, M., 1990. Influence of a shrub corridor on movements of \npasserine birds to a lake littoral zone. Landscape Ecology 4, 99-108.  \n \nDoak, D.F., Marino, P.C., Kareiva, P.M., 1992. Spatial scale mediates the influence of \nhabitat fragmentation on dispersal success: implications for conservation. Population \nBiology 41, 315-336. \n  \n 23\n \nDover, J.W., Fry, G.L.A., 2001. Experimental simulation of some visual and physical \ncomponents of a hedge and the effects on butterfly behaviour in an agricultural \nlandscape. Entomologia Experimentalis et Applicata 100, 221-233. \n \nEnoksson, B., 1990. Autumn territories and population regulation in the nuthatch Sitta \neuropaea: an experimental study. Journal of Animal Ecology 59, 1047-1062. \n \nEnoksson, B., Nilsson, S.G., 1983. Territory size and population density in relation to \nfood supply in the nuthatch Sitta europaea (Aves). Journal of Animal Ecology 52, \n927-935. \n \nEnoksson, B., Angelstam, P., Larsson, K., 1995. Deciduous forest and resident birds: \nthe problem of fragmentation in a coniferous forest landscape. Landscape Ecology 10, \n267-275. \n \nFahrig, L., 1988. A General Model of Populations in Patchy Habitats. Applied \nMathematics and Computation 27, 53-66. \n \nFahrig, L., 1997. Relative effects of habitat loss and fragmentation on population \nextinction. Journal of Wildlife Management 61, 603-610. \n \nFahrig, L., 2003. Effects of habitat fragmentation on biodiversity. Annual Review \nEcology and Systematic 34, 487-515. \n \nFarina, A., Belgrano, A., 2004. The eco-field: a new paradigm for landscape ecology. \nEcological Research 19, 107-110. \n \nGill, D.E., 1978. The metapopulation ecology of the Red-spotted Newt, \nNotophthalmus viridescens (Rafinesque). Ecological Monographs 48, 145-166. \n \nGreen, D.G., Sadedin, S., 2005. Interactions matter – complexity in landscapes and \necosystems. Ecological Complexity 2, 117-130. \n  \n 24\n \nGustafson, E.J., Gardner, R.H., 1996. The effect of landscape heterogeneity on the \nprobability of patch colonisation. Ecology 77, 94-107.  \n \nHaas, C.A., 1995. Dispersal and use of corridors by birds in wooded patches on an \nagricultural landscape. Conservation Biology 9, 845-854. \n \nHanski, I., 1994. A practical model of metapopulation dynamics. Journal of Animal \nEcology 63, 151-162.  \n \nHanski, I., 1998. Metapopulation dynamics. Nature 396, 41-49. \n \nHaydon, D., Pianka, R., 1999. Metapopulation theory, landscape models and species \ndiversity. Ecoscience 6, 316-328. \n \nHeinz, S.K., Strand, E., 2006. Adaptive patch searching strategies in fragmented \nlandscapes. Evolutionary Ecology 20, 113-130. \n \nHinsley, S.A., Bellamy, P.E., Newton, I., Sparks, T.H., 1995. Habitat and landscape \nfactors influencing the presence of individual bird species in woodland fragments. \nJournal of Avian Biology 26, 94-104. \n \nHinsley, S.A., Bellamy, P.E., Enoksson, B., Fry, G., Gabrielsen, L., McCollin, D., \nSchotman, A., 1998. Geographical and land-use influences on bird species richness in \nsmall woods in agricultural landscapes. Global Ecology and Biogeography Letters 7, \n125-135. \n \nKindlmann, P., Aviron, S., Burel, F., 2005. When is landscape matrix important for \ndetermining animal fluxes between resource patches? Ecological Complexity 2, 150-\n158. \n \nLima, S.L., Zollner, P.A., 1996. Towards a behavioural ecology of ecological \nlandscapes. Trends in Ecology and Evolution 11, 131-134. \n  \n 25\n \nMachtans, C.S., Villard, M-A., Hannon, S., 1996. Use of riparian buffer strips as \nmovement corridors by forest birds. Conservation Biology 10, 1366-1379. \n \nMatthysen, E., Adriaensen, F., Dhondt, A.A., 1995. Dispersal distances of nuthatches, \nSitta europaea, in a highly fragmented forest habitat. Oikos 72, 375-381. \n \nMatthysen, E., Currie, D., 1996. Habitat fragmentation reduces disperser success in \njuvenile nuthatches Sitta europaea: evidence from patterns of territory establishment. \nEcography 19, 67-72. \n \nMatthysen, E., Adriaensen, F., 1998. Forest size and isolation have no effect on \nreproductive success of eurasian nuthatches (Sitta europaea). The Auk 115, 955-963. \n \nMysterud, A., Langvatn, R., Yoccoz, N.G., Stenseth, N.C., 2001. Plant phenology, \nmigrating and geographical variation in body weight of a large herbivore: the effect of \na variable topography. Journal of Animal Ecology 70, 915-923. \n \nNilsson, S., 1987. Limitation and regulation of population density in the nuthatch Sitta \neuropaea (Aves) breeding in natural cavities. Journal of Animal Ecology 56, 921-937 \n \nOlden, J.D., Schooley, R.L., Monroe, J.B., Poff, N.L., 2004. Context-dependent \nperceptual ranges and their relevance to animal movements in landscapes. Journal of \nAnimal Ecology 73, 1190-1194. \n \nPain, D.J. and Pienkowski, M.W. (Editors), 1997. Farming and Birds in Europe: the \nCommon Agricultural Policy and its Implications for Bird Conservation. Academic \nPress, London. \n \nPe’er, G., Saltz, D., Thuckle, H., Motro, U., 2004. Response to topography in a \nhilltopping butterfly and implications for modelling nonrandom dispersal. Animal \nBehaviour 68, 825-839. \n \n  \n 26\nPe’er, G., Saltz, D., Thuckle, H., Motro, U., 2005. Virtual Corridors for Conservation \nManagement. Conservation Biology 19, 1997-2003. \n \nPe’er, G., Saltz, D., Thuckle, H., Motro, U., 2006. Connectivity in heterogeneous \nlandscapes: analysing the effect of topography. Landscape Ecology 21, 47-61. \n \nPravosudov, V.V., 1993. Social organisation of the nuthatch (Sitta europaea). Ornis \nScandinavica 24, 290-296. \n \nPulliam, H., Dunning, J., Liu, J., 1992. Population dynamics in complex landscapes: a \ncase study. Ecological Applications 2, 165-177. \n \nRicketts, T., 2001. The Matrix Matters: Effective Isolation in Fragmented Landscapes. \nThe American Naturalist 158, 87-99. \n \nRoland, J., Keyghobadi, N., Fownes, S., 2000. Alpine Parnassius butterfly dispersal: \neffects of landscape and population size. Ecology 81, 1642-1653.  \n \nSaarenmaa, H., Stone, N.D., Folse, L.J., Packard, J.M., Grant, W.E., Makela, M.E., \nCoulson, R.N., 1988. An artificial intelligence modelling approach to simulating \nanimal\/habitat interactions. Ecological Modelling 44, 125-141.  \n \nSaïd, S., Servanty, S., 2005. The influence of landscape structure on female roe deer \nhome-range size. Landscape Ecology 20, 1003-1012. \n \nSchippers, P., Verboom, J., Knaapen, J.P., Apeldoorn, R.C., 1996. Dispersal and \nhabitat connectivity in complex heterogeneous landscapes: an analysis with a GIS-\nbased random walk model. Ecography 19, 97-106. \n \nSchooley, R.L., Wiens, J.A., 2003. Finding habitat patches and directional \nconnectivity. Oikos 102, 559-570.  \n \n  \n 27\nSchooley, R.L., Branch, L.C., 2005. Limited perceptual range and anemotaxis in \nmarsh rice rats Oryzomys palustris. Acta Theriologica 50, 59-66. \n \nStacey, P.B., Taper, M., 1992. Environmental variation and the persistence of small \npopulations. Ecological Applications 2, 18-29. \n \nSutherland, W.J., Pullin, A.S., Dolman, P.M., Knight, T.M., 2004. The need for \nevidence-based conservation. Trends in Ecology and Evolution 19, 305-308. \n \nSutcliffe, O.L., Thomas, C.D., 1996. Open corridors appear to facilitate dispersal by \nRinglet Butterflies (Aphantopus hyperantus) between woodland clearings. \nConservation Biology 10, 1359-1365. \n \nTischendorf, L., Fahrig, L., 2000. On the useage and measurement of landscape \nconnectivity. Oikos 90, 7-19.  \n \nTuck, J.M., Hassall, M., 2004. Foraging behaviour of Armadillidium vulgare \n(Isopoda: Oniscidae) in heterogeneous environments. Behaviour 141, 233-234.  \n \nTurner, M.G., Wu, Y., Romme, W.H., Wallace, L.L., 1993. A landscape simulation \nmodel of winter foraging by large ungulates. Ecological Modelling 69, 163-184. \n \nTurner, M.G., Wu, Y., Wallace, L.L., Romme, W.H., Brenkert A., 1994. Simulating \nwinter interactions among ungulates, vegetation and fire in northern yellowstone park. \nEcological Applications 4, 472-496. \n \nWall, J., Douglas-Hamilton, I., Vollrath, F., 2006. Elephants avoid costly \nmountaineering. Current Biology 16, 527-529. \n \nWatts, K., Griffiths, M., Quine, C., Ray, D., Humphrey, J., 2004. Towards a woodland \nhabitat network for Wales. Contract report to the Countryside Council for Wales and \nthe Forestry Commission, Wales. Report no. EC046CT (F13\/7\/369). Forest Research, \nAlice Holt.   \n  \n 28\n \nWennergren, U., Ruckelshaus, M., Kareiva, P., 1995. The promise and limitations of \nspatial models in conservation biology. Oikos 74, 349-356. \n \nYeomans, S.R., 1995. Water-finding in adult turtles: random search or oriented \nbehaviour. Animal Behaviour 49, 977-987.  \n \nZollner, P.A., 2000. Comparing the landscape level perceptual abilities of forest \nsciurids in fragmented landscapes. Landscape Ecology 15, 523-533. \n \nZollner, P.A., Lima, S.L., 1999. Search strategies for landscape-level interpatch \nmovements. Ecology 80, 1019-1030. \n \nZollner, P.A., Lima, S.L., 2005. Behavioural tradeoffs when dispersing across a \npatchy landscape. Oikos 108, 219-230.  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n  \n 29\n \n \n \n \n \n \n Perceptual Range (km) \nImmigration \nDirection \n0 0.1 0.2 0.5 1 2 5 10 \nNorth 0.00 -2.50 -1.68 0.32 0.19 -0.30 1.58 1.17 \nNorth East 0.00 -0.60 0.79 2.43 -0.60 -3.64 -3.17 -4.26 \nEast 0.00 -0.26 0.45 1.08 0.69 1.77 0.48 0.63 \nSouth East 0.00 -0.54 0.32 -0.97 2.19 2.84 1.88 2.12 \nSouth    0.00 0.08 0.82 0.36 0.79 -0.15 -1.00 -0.97 \nSouth West 0.00 0.23 -2.09 0.83 0.49 1.27 1.24 0.03 \nWest 0.00 -0.30 0.78 -0.54 1.38 1.22 0.26 -0.37 \nNorth West 0.00 -1.20 -1.35 2.16 1.07 0.05 -1.01 -2.20 \n \n  \nTable 1 - Differences between the mean predicted numbers of pairs of nuthatches in Monks Wood for \nthe 2D and elevation dispersal algorithms, resulting from immigration into the landscape from the \ncardinal and quadrantal immigration directions over perceptual ranges of 0-10 km. Difference \ncalculated as: elevation – 2D. \n \n \n \n \n \n \n \n \n \n \n \n \n  \n 30\n \n \n \n \n \n \n Perceptual Range (km) \nImmigration \nDirection \n0 0.1 0.2 0.5 1 2 5 10 \nNorth 0.00 0.17 -0.71 0.47 0.56 2.48 0.04 -2.97 \nNorth East 0.00 0.35 0.10 -5.21 -1.19 0.97 -0.50 -3.78 \nEast 0.00 -1.34 -1.72 -0.26 0.56 0.08 -0.68 0.64 \nSouth East 0.00 -0.85 0.17 -3.32 -5.08 -4.29 -3.43 -3.27 \nSouth    0.00 2.17 -0.32 -0.58 -0.11 1.29 -0.56 0.58 \nSouth West 0.00 -0.36 -3.37 -4.90 -1.38 -0.77 0.31 1.70 \nWest 0.00 1.99 -0.56 0.13 -2.87 -3.33 -3.42 -3.17 \nNorth West 0.00 -2.59 -1.63 -0.04 0.98 0.01 1.15 0.45 \n \n \nTable 2: Differences between the mean predicted numbers of pairs of nuthatches in Monks Wood for \nthe 2D and valley-seek dispersal algorithms, resulting from immigration into the landscape from the \ncardinal and quadrantal immigration directions over perceptual ranges of 0-10 km. Difference \ncalculated as: valley-seek – 2D. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n  \n 31\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 1010 20\n \n \n \n \n \n \n \n \n \n \n \n \nFig. 1 - An example of the possible effects of topography on the visual perceptual range of a dispersing \nindividual, located within the central patch. When modelling the landscape in two dimensions the \nwhole area encompassed by the circle (the visual perceptual range) is visible, giving the individual a \nchoice of moving to either the upper or the lower patch. When modelling the same landscape in three \ndimensions, the higher ground restricts the view to the shaded area, limiting the individual’s choice of \npatch to the lower one. \n \n \n \n10\n10\n10 \n10 \n2\n20 \n10\n10 \n20\n20 \n  \n 32\n \n \n \n \n \n \n   \nN \n  \n \n \n \n \n \n \n \n 20 km  \n \n \n \n \nFig. 2 - Location of the 20 × 20 km study area and its position within the county of Cambridgeshire in \neastern England, UK.  \n \n \n \n \n \n \n \n \n \n \n \n \n \n  \n 33\n \n \n \n \n \n \nMonks\nWood \nA\nB \nC \nD \nE\nN  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFig. 3 - The topography of the study area, with the woodland patches (both suitable and unsuitable) \nsuperimposed in white. The topographical landscape is modelled as a multi-level representation of the \nlandscape and integrated into the model, as described in the text. Each modelled elevation level is \nshown shaded, ranging from high ground (70 m ASL) shown light grey, through to black, which \nrepresents low ground (0 m ASL), in 10 m steps. Several valleys are present, such as those labelled A-\nE, which run in a roughly south-easterly direction from higher ground to the west. The target patch, \nMonks Wood, is located in the centre of the landscape on a shallow north-facing slope.  \n \n \n \n \n \n \n \n \n \n \n  \n 34\n \n \n \n \n \n \na \nMonks \nWood \nb \nN\n N   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFig. 4 - The structural and topographical landscapes. The structural landscape (Fig. 4a) is a binary \nrepresentation of the landscape, comprising woods (potential habitat) and matrix. For illustration, \nwoods containing suitable habitat are shown in black, with all other woods shaded light grey. The \nquality landscape (Fig. 4b) represents the areas of habitat of sufficient quality to contain nuthatch \nterritories. Note that even though certain woods within the study area may have been identified as \ncontaining habitat of suitable quality for the establishment of nuthatch territories, such woods will most \nlikely contain both suitable and unsuitable habitat (Alderman et al., 2005).  \n \n \n \n \n \n \n \n \n \n \n  \n 35\n \n \n \n \nO \nA \nVisible VisibleShadow Shadow Visible \nF \nD \nScan Direction \nCE \nB\nX \nY \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFig. 5 - A cross-section of a landscape, demonstrating the basic principles behind elevation \nmeasurement, with points OAX, showing the measurement of the elevation angle of an example scan \npoint, as described in the text. Point A is the disperser’s current position and X is an example scan \npoint. Distance AO represents the elevation of the current position, relative to the scan point, X, and \nAY is the horizontal distance from the current position to X. Distance AX is the Euclidean distance \nfrom the current position to the scan point, which is used to determine the perceptual range limiting \nvalue. The topography of the landscape results in certain parts of the landscape (between points B-C \nand D-E, labelled ‘shadow’), being hidden from the disperser. The other parts (between points A-B, C-\nD and E-F, labelled ‘visible’), are visible. Movement is constrained to be to the left only, because all \nview to the right is obscured by the rising slope (to the right of A). All parts of the landscape would be \nvisible if two-dimensional landscape modelling was employed.  \n \n \n \n \n \n \n \n \n  \n 36\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nSET CURRENT VIEW \nANGLE TO 0 DEGREES \n \nGET ELEVATION FOR \nNEXT STEP OUTWARDS\n \nCALCULATE THE NEXT \nVIEW ANGLE  \n \nSTORE \nCELL \nLOCATION \nNEXT ANGLE \n>= CURRENT \nVIEW ANGLE?\n \nSET \nCURRENT \nVIEW ANGLE \nTO NEW \nVIEW ANGLE \nWITHIN \nPERCEPTUAL \nRANGE? \nY = VISIBLE \nN = NOT \nVISIBLE \nY \nN \n \nEXIT \nSTART \n \nHABITAT \nCELL? \nN \nY \n \n \n \nEXIT  \n \n \n \n \n \n \n \n \n \nFig. 6 - The basic elevation modelling algorithm, which stops either when the perceptual range is \nreached or a habitat cell is found. For the tests in this study, the algorithm was modified to \naccommodate a 90-degree field of view, as described in the text. \n  \n 37\n \n \n \n \n \n \n0\n5\n10\n15\nNorth\nNorth East\nEast\nSouth East\nSouth\nSouth West\nWest\nNorth West\n2D elevation valley-seek\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFig. 7 - Directional sensitivity to immigration of the size of the nuthatch population in Monks Wood \nfor a perceptual range of 200 m and an annual immigration rate of 15 individuals. The numerical scale \ngives the predicted numbers of pairs of nuthatches averaged over 5,000 yearly cycles.  \n \n \n \n \n \n \n \n \n \n \n  \n 38\n \n \n \n \n \n \n \n \n0\n5\n10\n15\nNorth\nNorth East\nEast\nSouth East\nSouth\nSouth West\nWest\nNorth West\n2D elevation valley-seek\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFig. 8 - Directional sensitivity to immigration of the size of the nuthatch population in Monks Wood \nfor a perceptual range of 2 km and an annual immigration rate of 15 individuals. The numerical scale \ngives the predicted numbers of pairs of nuthatches, averaged over 5,000 yearly cycles.  \n \n \n \n \n \n \n \n \n \n \n  \n 39\n \n \n \n \n \n \n0\n2\n4\n6\n8\n10\n12\n14\n0 0.1 0.2 0.5 1 2 5 10\nPerceptual Range (km)\nM\nea\nn \nPr\ned\nic\nte\nd \nPa\nirs\n2D elevation valley-seek \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFig. 9 - Mean predicted numbers of pairs of nuthatches in Monks Wood for a westerly immigration \ndirection over a perceptual range of 0-10 km and an annual immigration rate of 15 individuals. The \nerror bars give 95% confidence intervals. \n \n \n \n \n \n \n \n \n \n  \n 40\n \n \n \n \n0\n2\n4\n6\n8\n10\n12\n14\n0 0.1 0.2 0.5 1 2 5 10\nPerceptual Range (km)\nM\nea\nn \nPr\ned\nic\nte\nd \nPa\nirs\n2D elevation valley-seek \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFig. 10 - Mean predicted number of pairs of nuthatches in Monks Wood for south-easterly immigration \ndirection over a perceptual range of 0-10 km and an annual immigration rate of 15 individuals. The \nerror bars give 95% confidence intervals. \n \n \n \n \n \n \n \n \n \n \n \n  \n  \n41\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFig. 11 - Dispersal-flow diagrams of the study landscape, showing the inter-patch dispersal paths for \nperceptual ranges of 0.2 km (11a) and 2 km (11b) using the valley-seek algorithm. Dispersal density is \nrecorded for 15 individuals (blue), 16-20 (green), 21-50 (orange) and 50+ (red). The lower flow \ndensities (of 10 individuals and less) have been removed, revealing portions of the underlying \ntopography to give some idea of its influence on dispersal patterns.  \n \n"}