{"doi":"10.1063\/1.1580636","coreId":"102906","oai":"oai:epubs.surrey.ac.uk:2523","identifiers":["oai:epubs.surrey.ac.uk:2523","10.1063\/1.1580636"],"title":"Polymeric amorphous carbon as p-type window within amorphous silicon solar cells","authors":["Khan, RUA","Silva, SRP","van Swaaij, RACMM"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-06-02","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"AMER INST PHYSICS","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2523<\/identifier><datestamp>\n      2017-10-31T14:05:48Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:6E616E6F656C656374726F6E696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2523\/<\/dc:relation><dc:title>\n        Polymeric amorphous carbon as p-type window within amorphous silicon solar cells<\/dc:title><dc:creator>\n        Khan, RUA<\/dc:creator><dc:creator>\n        Silva, SRP<\/dc:creator><dc:creator>\n        van Swaaij, RACMM<\/dc:creator><dc:publisher>\n        AMER INST PHYSICS<\/dc:publisher><dc:date>\n        2003-06-02<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2523\/1\/polymeric_amorphous_SILVA_03.pdf<\/dc:identifier><dc:identifier>\n          Khan, RUA, Silva, SRP and van Swaaij, RACMM  (2003) Polymeric amorphous carbon as p-type window within amorphous silicon solar cells   APPLIED PHYSICS LETTERS, 82 (22).  pp. 3979-3981.      <\/dc:identifier><dc:relation>\n        http:\/\/apl.aip.org\/resource\/1\/applab\/v82\/i22\/p3979_s1<\/dc:relation><dc:relation>\n        10.1063\/1.1580636<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2523\/","http:\/\/apl.aip.org\/resource\/1\/applab\/v82\/i22\/p3979_s1","10.1063\/1.1580636"],"year":2003,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"APPLIED PHYSICS LETTERS VOLUME 82, NUMBER 22 2 JUNE 2003\nDownPolymeric amorphous carbon as p-type window within amorphous silicon\nsolar cells\nR. U. A. Khana)\nBlackett Laboratory, Imperial College London, London SW7 2BW, United Kingdom\nS. R. P. Silva\nSchool of Electronics and Physical Sciences, University of Surrey, Guildford, Surrey GU2 7XH,\nUnited Kingdom\nR. A. C. M. M. van Swaaij\nDelft University of Technology, DIMES, PO Box 5053, NL-2600, The Netherlands\n~Received 7 November 2002; accepted 2 April 2003!\nAmorphous carbon (a-C) has been shown to be intrinsically p-type, and polymeric a-C ~PAC!\npossesses a wide Tauc band gap of 2.6 eV. We have replaced the p-type amorphous silicon carbide\nlayer of a standard amorphous silicon solar cell with an intrinsic ultrathin layer of PAC. The\nthickness of the p layer had to be reduced from 9 to 2.5 nm in order to ensure sufficient conduction\nthrough the PAC film. Although the resulting external parameters suggest a decrease in the device\nefficiency from 9.2% to 3.8% due to a reduced value of open-circuit voltage, the spectral response\nshows an improvement in the 400–500-nm wavelength range, as a consequence of the wider band\ngap of the PAC layer. © 2003 American Institute of Physics. @DOI: 10.1063\/1.1580636#Hydrogenated amorphous silicon (a-Si:H) is a com-\nmonly used thin-film semiconductor for solar cell applica-\ntions. It possesses a Tauc band gap of 1.7 eV, so that the peak\nin absorption occurs at the optimum energy for coupling to\nthe solar spectrum. However, the performance of the p – i – n\nstructure may be reduced due to the decrease in the band gap\nof the p layer due to doping, which results in greater optical\nabsorption within this layer and therefore impaired device\nefficiency, particularly at shorter wavelengths. This is par-\ntially overcome with the use of p-type amorphous silicon\ncarbide (a-SiC:H), which possesses a wider Tauc band gap\nof 1.95 eV.\nAmorphous carbon (a-C) is a potential candidate for\nthis layer as it has been documented that it is intrinsically\np-type.1,2 Working solar cells comprising n-C\/p-Si hetero-\njunctions have been demonstrated.3 In particular, polymeric\namorphous carbon ~PAC! possesses a wide Tauc band gap of\n;2.7 eV,4 which results in reduced absorbance at shorter\nwavelengths. Furthermore, both the electronic properties and\nband gap may be optimized5,6 by varying the ratio of the sp2\nand sp3 hybridized phases. Transport at room temperature\nhas been attributed to hopping between sp2 clusters,7 as the\ngap states are highly localized.8,9 However, the low-mobility\nlocalized conduction properties of these films are not appli-\ncable if an ultrathin a-C layer is grown. This would allow\nthe holes to tunnel from the transparent conducting oxide\n~TCO! contact through to the i-a-Si:H layer. It is already\npossible to improve the blue response of a-Si:H solar cells\nby growing a boron-doped a-C layer onto an a-SiC:H\nlayer.10,11 In this letter, we show that if the a-SiC:H layer is\nreplaced by an ultrathin a-C:H layer an enhanced spectral\nresponse at short wavelengths is observed. This demonstrates\na!Electronic mail: riz.khan@ic.ac.uk3970003-6951\/2003\/82(22)\/3979\/3\/$20.00\nloaded 28 Sep 2010 to 131.227.178.118. Redistribution subject to AIP lthe possible use of a-C:H thin films as a layer in a-Si:H\nsolar cells.\nThe standard p – i – n a-Si:H solar cells were deposited\nusing rf-plasma-enhanced chemical vapor deposition\n~PECVD! onto Asahi U-type TCO.12 The layer of PAC was\nprepared using room temperature rf-PECVD, in a manner\ndescribed previously.13 These films possessed a Tauc band\ngap of 2.6–2.7 eV, a resistivity of ;1014 V cm, and a refrac-\ntive index of 1.6. The device structure is shown in Fig. 1. For\nthe back contact, Ag was used in order to obtain optimal\nreflection. The solar cells were characterized by measuring\nthe external parameters under AM1.5 illumination and the\nspectral response. From the latter, the quantum efficiency of\nthe cell was extracted.\nThe external parameters of the\np-PAC\/i-a-Si:H\/n-a-Si:H solar cell, as compared to a stan-\ndard p-a-SiC:H\/i-a-Si:H\/n-a-Si:H device, are shown in\nTable I. The thickness of both p-type layers is also shown for\ncomparison, and it was found that utilizing a thicker layer of\nPAC ~5 nm! resulted in a vastly reduced photogenerated volt-\nage. This is likely to be due to the high resistivity of the PAC\nfilm that would reduce the current to the transparent conduct-\ning oxide contact. Also, while the efficiency of the cell has\nbeen reduced from 9.2% to 3.8%, there is little variation in\nthe value of short-circuit current density (Jsc), which re-\nFIG. 1. Device structure for solar cells with a-SiC:H or a-C:H p layer.9 © 2003 American Institute of Physics\nicense or copyright; see http:\/\/apl.aip.org\/about\/rights_and_permissions\n3980 Appl. Phys. Lett., Vol. 82, No. 22, 2 June 2003 Khan, Silva, and van Swaaij\nDownmains between 16 and 17 mA cm22, and is indicative of the\nultrathin PAC film acting as a suitable p layer. The fill factor\nhas also not been significantly reduced by the utilization of\nthe PAC layer, and remains between 0.6 and 0.7. The likely\nreason for the reduction in cell efficiency is therefore the\nreduction in open-circuit voltage Voc from 0.8 to 0.4 V.\nTo examine reasons for the lower Voc value, we used\npreviously obtained I – V data for PAC thin films as a func-\ntion of temperature, where, by fitting to an Arrhenius depen-\ndence, an activation energy value of 0.7 eV was derived.\nThis was attributed to the energy difference between the\nFermi level and the valence-band density of states.14 Using\nthis value, and values of 1.7 eV for the band gap of amor-\nphous silicon and 0.2 eV for the activation energy of n-type\na-Si:H,15 we have constructed a band diagram that is shown\nin Fig. 2. Due to the fact that the conductivity is low within\nPAC, a significant potential is expected to be dropped over it.\nIn the theoretical case, for the standard\na-SiC:H-containing solar cell assuming the parameters\nshown earlier and a value of activation energy of 0.3 eV for\np-type a-Si:H, the internal voltage within the i layer at zero\nbias is 1.2 V, which equals the voltage required for the flat-\nband condition to occur. Due to the injection of charge from\nboth electrodes, a positive current is measured at this volt-\nage. The Voc condition is observed at a lower voltage, when\nthe current swept out of the device due to the internal electric\nfield equals the current injected into the device, and has been\nmeasured here to be 0.8 V. In the case of the PAC-containing\ndevice, the Fermi level is 0.7 eV above the valence-band\nedge. Therefore, the flat-band condition would be expected\nto occur at 0.8 V. Assuming that the charge injection is simi-\nlar in this device, Voc would be expected to be correspond-\ningly smaller, and is measured here to be 0.4 V. Therefore,\nTABLE I. External parameters for p-PAC\/i-a-Si:H\/n-a-Si:H solar cell,\ncompared to a p-a-SiC:H\/i-a-Si:H\/n-a-Si:H cell.\na-C:H a-SiC:H\nThickness ~nm! 2.5 9\nEfficiency ~%! 3.84 9.20\nJsc ~mA cm22) 16.3 17.2\nVoc ~V! 0.38 0.79\nFill factor 0.62 0.68\nFIG. 2. Band diagram at zero bias showing n-a-Si:H\/i-a-Si:H\/p-a-C:H\nstructure.loaded 28 Sep 2010 to 131.227.178.118. Redistribution subject to AIP lthis value is consistent with a greater hole activation energy\nfor PAC as compared to p-type a-SiC:H.\nFigure 3 shows the I – V characteristics for a device con-\ntaining an a-C:H p layer as opposed to one containing an\na-SiC:H p layer. In this case, it is clearly observed that a\nsmaller value of Voc will result in a smaller I – V product, and\ntherefore will be expected to reduce the cell efficiency.\nTherefore, the interpretation outlined earlier suggests the re-\nduction of built-in potential and therefore Voc , and hence the\nefficiency, of the device.\nThe variation in quantum efficiency ~QE! with incident\nlight wavelength, for different bias voltages, is shown in Fig.\n4~a! for the device containing an a-C:H p layer and in Fig.\n4~b! for one containing an a-SiC:H p layer. It may firstly be\nobserved that in the case of Fig. 4~a!, however, there is a\nreduction in QE with an applied bias of only 0.28 V, as\nopposed to a value of 0.6 V for the a-SiC:H containing cell\nshown in Fig. 4~b!. This may be explained by observing Fig.\n3, which shows that at a bias voltage of 0.28 V, the current\nstarts to rise for the a-C:H containing cell, resulting in a\nlower I – V product and hence a reduced QE. In the case of\nthe a-SiC:H-containing cell, the current starts to rise above\n0.6 V, which would result in a similar decrease in QE. The\nsecond and most important point to note, however, is that for\ndevices with an applied voltage of 20.5 V, the QE in the\n400–500-nm wavelength range increases from 0.62 to 0.82\nfor the a-C:H-containing cell, as compared with 0.58–0.82\nfor the a-SiC:H-containing cell. This demonstrates a small\nbut noticeable increase in the QE over this wavelength range,\nand may be attributed to the fact that the p-type layer pos-\nsesses a wider band gap in the case of the a-C:H-containing\ncell than for the a-SiC:H-containing cell. We have also\nshown that a tunneling current in the low-mobility p-type\nPAC layer may be used effectively for photovoltaic applica-\ntions.\nIn conclusion, the p-type a-SiC:H layer of a standard\namorphous silicon solar cell has been replaced with poly-\nmeric amorphous carbon, and a working photovoltaic device\nhas been demonstrated. At a p layer thickness of 2.5 nm, the\nlayer is thin enough for conduction to take place through to\nthe TCO contact, but with larger thicknesses, the high resis-\ntivity of the material results in no photovoltaic effect. Al-\nthough the measurements shown here demonstrate a decrease\nFIG. 3. I – V characteristic for cell containing a-C:H p layer as compared to\ncell containing a-SiC:H p layer.icense or copyright; see http:\/\/apl.aip.org\/about\/rights_and_permissions\n3981Appl. Phys. Lett., Vol. 82, No. 22, 2 June 2003 Khan, Silva, and van Swaaij\nDownFIG. 4. QE versus wavelength at dif-\nferent bias voltages for ~a! cell con-\ntaining a-C:H p layer and ~b! cell con-\ntaining a-SiC:H p layer.in the external parameters, in particular the value of Voc , an\nimprovement in the spectral response in the 400–500-nm\nregime has been observed. This has been attributed to the\nwider band gap of the p layer, resulting in lower optical\nabsorbance in this wavelength range. The external param-\neters of the PAC-containing film are comparable to standard\na-Si:H solar cells that only utilize a-Si layers as opposed to\nan a-Si:C p layer. Future research should be directed to-\nwards lowering the activation energy of the PAC layer, as\nthis will limit the open-circuit voltage, as long as the absorp-\ntion response of the layer is not compromised.\nThe authors acknowledge discussions with G. A. J. Ama-\nratunga.\n1 S. R. P. Silva, J. D. Carey, R. U. A. Khan, E. G. Gerstner, and J. V.\nAnguita, Handbook of Thin Films ~Academic, New York, 2000!.\n2 N. L. Rupesinghe, R. J. Cole, M. Chhowalla, G. A. J. Amaratunga, and P.\nWeightman, Diamond Relat. Mater. 9, 1148 ~2000!.loaded 28 Sep 2010 to 131.227.178.118. Redistribution subject to AIP l3 K. M. Krishna, M. Umeno, Y. Nukaya, T. Soga, and T. Jimbo, Appl. Phys.\nLett. 77, 1472 ~2000!.\n4 R. U. A. Khan, A. P. Burden, S. R. P. Silva, J. M. Shannon, and B. J. Sealy,\nCarbon 37, 777 ~1999!.\n5 C. A. Davis, S. R. P. Silva, R. E. Dunin-Borkowski, G. A. J. Amaratunga,\nK. M. Knowles, and W. M. Stobbs, Phys. Rev. Lett. 75, 4258 ~1995!.\n6 D. R. McKenzie, D. Muller, and B. A. Pailthorpe, Phys. Rev. Lett. 67, 773\n~1991!.\n7 D. Dasgupta, F. Demichelis, and A. Tagiaferro, Philos. Mag. B 63, 1255\n~1991!.\n8 C. W. Chen and J. Robertson, J. Non-Cryst. Solids 227, 602 ~1998!.\n9 R. U. A. Khan, J. D. Carey, S. R. P. Silva, B. J. Jones, and R. C. Barklie,\nPhys. Rev. B 63, 121201 ~2001!.\n10 C. H. Lee and K. S. Lim, Appl. Phys. Lett. 72, 106 ~1998!.\n11 C. H. Lee and K. S. Lim, Appl. Phys. Lett. 75, 569 ~1999!.\n12 M. Zeman, R. A. C. M. M. van Swaaij, E. Schroten, L. L. A. Vosteen, and\nJ. W. Metselaar, Mater. Res. Soc. Symp. Proc. 507, 409 ~1998!.\n13 J. V. Anguita, S. R. P. Silva, A. P. Burden, B. J. Sealy, S. Haq, M. Hebron,\nI. Sturland, and A. Prichard, J. Appl. Phys. 86, 6276 ~1999!.\n14 R. U. A. Khan, A. C. Ferrari, and S. R. P. Silva ~unpublished!.\n15 R. A. Street, Hydrogenated Amorphous Silicon ~Cambridge University\nPress, Cambridge, UK, 1991!.icense or copyright; see http:\/\/apl.aip.org\/about\/rights_and_permissions\n"}