{"doi":"10.1109\/TADVP.2008.2011284","coreId":"100870","oai":"oai:epubs.surrey.ac.uk:268","identifiers":["oai:epubs.surrey.ac.uk:268","10.1109\/TADVP.2008.2011284"],"title":"Millimetre Wave Substrate Integrated Waveguide Antennas: Design and Fabrication Analysis","authors":["Henry, M","Free, C E","Izqueirdo, B","Batchelor, J","Young, P"],"enrichments":{"references":[{"id":840975,"title":"A low profile 77 GHz three beam antenna for automotive radar,”","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":833890,"title":"A new micro-machined millimeter-wave and terahertz snap-together rectangular waveguide technology,”","authors":[],"date":"1999","doi":"10.1109\/75.755047","raw":null,"cites":null},{"id":841613,"title":"Antenna Theory Analysis and Design, 2nd ed.","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":840269,"title":"Compact folded waveguide,” in","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":831992,"title":"Design consideration and performance analysis of substrate integrated waveguide components,”","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":838306,"title":"Design of low-profile millimeterwave substrate integrated waveguide power divider\/combiner,”","authors":[],"date":"2007","doi":"10.1007\/s10762-007-9229-5","raw":null,"cites":null},{"id":839012,"title":"Dielectric waveguide microwave integrated circuits-an overview,”","authors":[],"date":"1976","doi":"10.1109\/TMTT.1976.1128965","raw":null,"cites":null},{"id":832562,"title":"Dispersion characteristics of substarte integrated rectangular waveguide,”","authors":[],"date":"2002","doi":"10.1109\/LMWC.2002.803188","raw":null,"cites":null},{"id":834461,"title":"Fabrication and characterization of micromachind rectangular waveguide components for use at millimeter-wave and terahertz frequencies,”","authors":[],"date":"2000","doi":"10.1109\/22.859472","raw":null,"cites":null},{"id":837627,"title":"Integrated microstrip and rectangular waveguide in planar form,”","authors":[],"date":"2001","doi":"10.1109\/7260.914305","raw":null,"cites":null},{"id":839641,"title":"Measurment of guide wavelength in rectangular dielectric waveguides,”","authors":[],"date":"1976","doi":"10.1109\/TMTT.1976.1128966","raw":null,"cites":null},{"id":831849,"title":"Millimeter-wave 3-D integration techniques using LTCC and related multi-layer circuits,” in","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":835782,"title":"Millimeter-wave substrate integrated waveguides and filters in photoimageable thick-film technology,”","authors":[],"date":"2005","doi":"10.1109\/TMTT.2005.859862","raw":null,"cites":null},{"id":835104,"title":"Photo-imageable thick-film circuits up to 100 GHz,” in","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":836335,"title":"Photonic bandgap dielectric waveguide filter,”","authors":[],"date":"2002","doi":"10.1109\/7260.993293","raw":null,"cites":null},{"id":833227,"title":"Silicon micromachined waveguides for millimeter-wave and submillimeter-wave frequencies,”","authors":[],"date":"1993","doi":"10.1109\/75.205665","raw":null,"cites":null},{"id":836962,"title":"Substrate integrated waveguide directional couplers,” presented at the Asia,","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":842332,"title":"The Services Textbook of Radio.","authors":[],"date":"1958","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-01-01","abstract":"<p>The paper presents a new concept in antenna design, whereby a photo-imageable thick-film process is used to integrate a waveguide antenna within a multilayer structure. This has yielded a very compact, high performance antenna working at high millimeter-wave (mm-wave) frequencies, with a high degree of repeatability and reliability in antenna construction. Theoretical and experimental results for 70 GHz mm-wave integrated antennas, fabricated using the new technique, are presented. The antennas were formed from miniature slotted waveguide arrays using up to 18 layers of photo-imageable material. To enhance the electrical performance a novel folded waveguide array was also investigated. The fabrication process is analyzed in detail and the critical issues involved in the fabrication cycle are discussed. The losses in the substrate integrated waveguide have been calculated. The performance of the new integrated antenna is compared to conventional metallic, air-filled waveguide antennas, and also to conventional microstrip antenna arrays operating at the same frequencies.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:268<\/identifier><datestamp>\n      2017-10-31T13:57:31Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:6E616E6F656C656374726F6E696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/268\/<\/dc:relation><dc:title>\n        Millimetre Wave Substrate Integrated Waveguide Antennas: Design and Fabrication Analysis<\/dc:title><dc:creator>\n        Henry, M<\/dc:creator><dc:creator>\n        Free, C E<\/dc:creator><dc:creator>\n        Izqueirdo, B<\/dc:creator><dc:creator>\n        Batchelor, J<\/dc:creator><dc:creator>\n        Young, P<\/dc:creator><dc:description>\n        <p>The paper presents a new concept in antenna design, whereby a photo-imageable thick-film process is used to integrate a waveguide antenna within a multilayer structure. This has yielded a very compact, high performance antenna working at high millimeter-wave (mm-wave) frequencies, with a high degree of repeatability and reliability in antenna construction. Theoretical and experimental results for 70 GHz mm-wave integrated antennas, fabricated using the new technique, are presented. The antennas were formed from miniature slotted waveguide arrays using up to 18 layers of photo-imageable material. To enhance the electrical performance a novel folded waveguide array was also investigated. The fabrication process is analyzed in detail and the critical issues involved in the fabrication cycle are discussed. The losses in the substrate integrated waveguide have been calculated. The performance of the new integrated antenna is compared to conventional metallic, air-filled waveguide antennas, and also to conventional microstrip antenna arrays operating at the same frequencies.<\/p><\/dc:description><dc:date>\n        2009-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/268\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Henry, M, Free, C E, Izqueirdo, B, Batchelor, J and Young, P  (2009) Millimetre Wave Substrate Integrated Waveguide Antennas: Design and Fabrication Analysis   IEEE Transactions on Advanced Packaging, 32 (1).       <\/dc:identifier><dc:relation>\n        10.1109\/TADVP.2008.2011284<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/268\/","10.1109\/TADVP.2008.2011284"],"year":2009,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"IEEE TRANSACTIONS ON ADVANCED PACKAGING, VOL. 32, NO. 1, FEBRUARY 2009 93\nMillimeter Wave Substrate Integrated Waveguide\nAntennas: Design and Fabrication Analysis\nM. Henry, Member, IEEE, C. E. Free, Member, IEEE, B. S. Izqueirdo, J. Batchelor, Member, IEEE, and\nP. Young, Member, IEEE\nAbstract—The paper presents a new concept in antenna design,\nwhereby a photo-imageable thick-film process is used to integrate\na waveguide antenna within a multilayer structure. This has\nyielded a very compact, high performance antenna working at\nhigh millimeter-wave (mm-wave) frequencies, with a high degree\nof repeatability and reliability in antenna construction. Theoret-\nical and experimental results for 70 GHz mm-wave integrated\nantennas, fabricated using the new technique, are presented. The\nantennas were formed from miniature slotted waveguide arrays\nusing up to 18 layers of photo-imageable material. To enhance the\nelectrical performance a novel folded waveguide array was also\ninvestigated. The fabrication process is analyzed in detail and the\ncritical issues involved in the fabrication cycle are discussed. The\nlosses in the substrate integrated waveguide have been calculated.\nThe performance of the new integrated antenna is compared to\nconventional metallic, air-filled waveguide antennas, and also to\nconventional microstrip antenna arrays operating at the same\nfrequencies.\nIndex Terms—Millimeter wave antenna arrays, substrate in-\ntegrated waveguides (SIW), photo-imageable fabrication, slotted\nwaveguide antenna arrays.\nI. INTRODUCTION\nS UBSTRATE integrated circuits (SICs) are a new conceptfor high-frequency electronics, which yields high perfor-\nmance from very compact planar circuits [1]. The basic idea\nbehind the technique is that of integrating nonplanar 3-D struc-\ntures within a multilayer circuit. However, existing integration\ntechniques using precision machining cannot economically\nachieve the required precision for millimeter-wave (mm-wave)\ncomponents, particularly for mass production. In the last few\nyears a number of papers based on substrate integrated circuits\nand waveguides (SICs, SIWs) on planar microstrip substrates\nhave appeared in the literature, but only for frequencies up\nManuscript received September 08, 2007; revised August 04, 2008. Current\nversion published February 13, 2009. This work was supported in part by the\nEPSRC Grants for University of Surrey under Grant GR\/S62369\/01 and in part\nby the University of Kent under Grant GR\/S62352\/01. This work was recom-\nmended for publication by Associate Editor S. Dvorak upon evaluation of the\nreviewers comments.\nM. Henry was with Advanced Technology Institute, University of Surrey,\nGU2 7XH Guildford, U.K. She is now with Rutherford Appleton Laboratory,\nSpace Science and Technology Department, OX11 0QX Oxfordsire, U.K.\n(e-mail: manju.henry@stfc.ac.uk).\nC. E. Free is with the Advanced Technology Institute, University of Surrey,\nGU2 7XH Guildford, Surrey, U.K. (e-mail: c.free@surrey.ac.uk).\nB. S. Izquierdo, J. C. Batchelor, and P. Young are with the Department of\nElectronics, University of Kent, CT2 7NT Kent, U.K.\nColor versions of one or more of the figures in this paper are available at\nhttp:\/\/ieeexplore.ieee.org.\nDigital Object Identifier 10.1109\/TADVP.2008.2011284\nto X-band. Most of the integrated waveguides that have been\nreported used VIA fenced sidewalls, realized using relatively\nelementary fabrication techniques. With these techniques the\ndiameter and spacing of the individual VIAs will affect the loss\nand bandwidth of the waveguide [2], [3]. Such integrated struc-\ntures cannot be regarded as homogeneous waveguide, but will\nbe similar in performance to an artificial periodic waveguide.\nHowever, there have been a number of successful attempts to\nform substrate integrated waveguides using micro-machining\ntechniques. McGrath et al. [4] formed an air-filled waveguide\nchannel in silicon, and reported measured losses of around\n0.02 dB\/mm at 100 GHz. In [5], Digby et al., used a dif-\nferent micro-machining process to form a substrate integrated\n100 GHz air-filled waveguide. Their measured data, around\n0.05 dB\/mm at 100 GHz was slightly higher than that of\nMcGrath, but it was suggested by the authors that the high\nattenuation might have been due to some of the waveguide\nwalls being only one skin depth thick. A further variation of\nthe air-filled SIW structure was reported by Collins et al. [6],\nwho used a micro-machining approach to form the waveguide\ntrough on one substrate, and this was combined with a second\nsubstrate using a “snap-together- technique,” to form the final\nenclosed waveguide. This was a somewhat simpler fabrication\napproach than that used by McGrath, and by Digby, and this\nwas reflected in the higher measured attenuation of around\n0.2 dB\/mm at 100 GHz. The key differences between the\npresent work, and that of authors using micro-machining, are\nthat a very low cost technique was used to form dielectric-filled\nwaveguides, leading to structures that were inherently robust\nand cheap.\nThe primary objective of the present paper is to provide an\nin-depth analytical investigation of the fabrication techniques\nthat could be employed to integrate efficiently novel 3-D wave-\nguide structures within ceramic circuit modules. However, the\nnecessary inclusion of dielectric within the waveguide restricts\nthe use of these circuits above 100 GHz, with this frequency\nlimit being mainly decided by the loss tangent of the integrated\nsubstrate material.\nThis paper describes the techniques for integrating mm-wave\nantennas within ceramic modules using a relatively new process,\nnamely photo-imageable thick-film [7], [8]. Since this type of\nprocess enables the circuit structure to be built up layer-by-layer,\nit is ideal for forming 3-D structures. The work described in the\npaper demonstrates the viability and potential of photo-image-\nable fabrication technology through the measured, practical per-\nformance of novel mm-wave integrated antennas arrays working\naround 70 GHz.\n1521-3323\/$25.00 © 2009 IEEE\nAuthorized licensed use limited to: University of Surrey. Downloaded on June 5, 2009 at 07:51 from IEEE Xplore.  Restrictions apply.\n94 IEEE TRANSACTIONS ON ADVANCED PACKAGING, VOL. 32, NO. 1, FEBRUARY 2009\nII. FABRICATION METHODOLOGY\nPhoto-imageable thick-film conductors and dielectric contain\na photo vehicle with the pastes. This enables layers of conductor\nor dielectric to be printed and then directly imaged using UV\nradiation. The system enables fine lines and gaps to be fab-\nricated with dimensions down to 10 m. Moreover, because\nstructures can be built up layer-by-layer, it is easy to provide\ninterconnections between planar and nonplanar circuits within\na single ceramic circuit. This scheme can be used to design\nlow-cost, high-performance passive circuits such as resonators,\nfilters, power dividers, etc. [9], [10]. A further advantage is\nthat the technology is compatible with many fabrication pro-\ncesses such as thin film, HTCC, and LTCC. A particular advan-\ntage of photo-imageable materials for the work being reported\nhere is that the sidewalls of the integrated waveguides can be\nmade from continuous metal, rather than using a VIA fence. The\nprocess of making such a sidewall is simply to develop channels\nin the dielectric layer, and then to subsequently fill them with\nmetal.\nA. Photo-Imageable Fabrication\nThe process mainly consists of four main steps as shown in\nthe Fig. 1.\nStep 1) The thick film paste is screen printed on alumina\nsubstrate, leveled at room temperature and dried at\n80 C for 45 min.\nStep 2) The printed paste is exposed to UV through photo\npatterned chrome masks and in the exposed region\nthe paste polymerizes and hardens.\nStep 3) The unexposed material is removed by spraying the\ncircuit with developer, and finally dried with an air\nspray.\nStep 4) The circuit is fired at 850 C for 60 min to burn off\nthe binders in the paste and leave the final pattern of\nconductor or dielectric.\nUnlike the conventional metal etching process the photo-im-\nageable fabrication does not require the intermediate photo-re-\nsist spinning and developing as the photo-vehicle required for\nUV exposure and hardening is contained in the material itself.\nThe advantage of using this fabrication is the ability of the\nprocess to achieve the fine geometries demanded by mm-wave\ncircuits.\nB. Waveguide Integration\nThe 3-D waveguide structures were built up, layer-by-layer,\nusing the photo-imageable thick-film process. The layers\nwere printed onto an alumina base to give rigidity to the final\nstructure. A layer of silver conductor (Fodel 6778) paste was\nfirst printed onto the alumina to form the bottom broad wall\nof the waveguide [Fig. 2(a)]. Next, a layer of dielectric (Fodel\nQM44F) is screen printed, photo-imaged and fired to form\nvertical trenches. Conductor paste is then screen printed and\nphoto-imaged to fill the trenches, so forming the sidewalls\nof the waveguide [Fig. 2(b)]. These last two steps were re-\npeated a number of times to build up the required height of the\nwaveguide. Finally, the top layer of conductor is printed, and\nradiating slots are photo-imaged and fired to form the top wall\nof the waveguide [Fig. 2(c)]. The schematic view of the cross\nFig. 1. Steps in a photo-imageable process (a) printing (b) exposure (c) devel-\noping (d) firing.\nFig. 2. Steps in a waveguide integration process, printing (a) bottom wall (b)\nside walls (c) top wall and radiating slots. (d) Cross-sectional view of the inte-\ngrated waveguide on alumina substrate.\nsection of the integrated waveguide is shown in Fig. 2(d). It was\nfound to be necessary to have the registration of intermediate\nlayers accurate to within m, which required a sophisti-\ncated mask aligner for exposing each layer. The uniformity\nof the sidewalls is a critical factor in the integration process,\nas nonuniform sidewalls will lead to significant loss in the\nstructure.\nC. Fabrication Analysis\n1) Fabrication Quality: Clearly, with antennas operating\nat very high frequencies, and consequently very small wave-\nlengths, the quality and accuracy of the fabrication process is a\nkey issue. In our case it was important that the radiating slots\nwere being formed with precise dimensions and high quality\nedges. To demonstrate the quality of the fabrication process,\nan enlarged version of one of the radiating slots is shown in\nFig. 3(a). To further indicate the quality achievable with the\nAuthorized licensed use limited to: University of Surrey. Downloaded on June 5, 2009 at 07:51 from IEEE Xplore.  Restrictions apply.\nHENRY et al.: MILLIMETER WAVE SUBSTRATE INTEGRATED WAVEGUIDE ANTENNAS: DESIGN AND FABRICATION ANALYSIS 95\nFig. 3. (a)–(c) Photographs showing the quality and capability of the fabrica-\ntion process under careful control of the processing parameters. (d) SEM picture\nshowing the shrunk conductor strip inside the trench after firing.\nTABLE I\nRATE OF SHRINKAGE ON CONDUCTORS, DIELECTRICS\nAND CIRCUITS OF DIFFERENT GEOMETRIES\nphoto-imageable process, 50- GSG coplanar probe pads\nwith 30 m spacing between the signal line and ground pads\nis shown in Fig. 3(b), and a fabricated miniature branch line\ncoupler in Fig. 3(c).\n2) Fabrication Issues:\na) Shrinkage: The main problem encountered with the\nphoto-imageable fabrication process was shrinkage in the con-\nductors and dielectrics during firing. In particular, the amount of\nshrinkage was different for the conductors and dielectrics. Also,\nit was found that the degree of shrinkage varied with the area of\nconductor or dielectric being fired. The difference in the rates\nof shrinkage for conductors, dielectrics, and circuits of different\ngeometries and areas are given in Table I. The significance of\nthe data in Table I is that it shows that it is not uniformly ob-\nserved throughout the fabrication cycle and therefore cannot be\ntaken into account at the design stage. The shrinkage was a se-\nrious issue when trying to fill VIAs and trenches. An SEM pic-\nture of a trench filled with conductor at an intermediate stage\nin the waveguide fabrication is shown in Fig. 3(d). After firing\nthe inner conductor shrinks creating spaces on either side of the\nwall.\nIt was found that the only way to overcome fabrication is-\nsues related to shrinkage is to carefully control the process. The\nfabrication parameters (development and exposure times) need\nFig. 4. Photographs of conductor surface to show (a) shrinkage after firing, (b)\nand after optimizing the fabrication process.\nFig. 5. The dielectric layer of thickness 60 \u0000m printed and dried without inter-\nmediate firing steps showing cracks at the corners after firing; (a) track corner;\n(b) VIA corners.\nto be refined for different layers, and for different circuit ge-\nometries. In the integration process described in this paper the\nshrinkage in VIAs and trenches was compensated in the -di-\nrection by printing extra conductor layers. Correct compensa-\ntion in the – plane was achieved by increasing the exposure\ntime and decreasing the development time. To illustrate the ef-\nfectiveness of this technique Fig. 4(a) shows the trenches filled\nbefore compensation for shrinkage, and Fig. 4(b) shows the con-\nductor-filled trenches after compensation.\nIn order to achieve the required degree of interlayer resolu-\ntion, a Quintel Q7000 mask aligner was used. To achieve op-\ntimum resolution it was found that some care was needed in the\nchoice of alignment marks to ensure they were compatible with\nthe mask aligner being used.\nb) Processing Time: In this study, 250 mesh stainless steel\nscreens were used to print the dielectric, giving a postfiring\nthickness of around 15 m. The conductor thickness, using 325\nmesh screens for printing, was around 8 m after firing. The\ntotal inner height of the integrated waveguide shown in Fig. 2.\nwas 60 m. This was formed from four layers of dielectric.\nIn all, eight layers of conductor were needed, including trench\nfilling and compensating for shrinkage. Using this technique,\nthe time required to finish a layer was one day, the most time\nconsuming aspect being the firing and cooling in a single\nchamber furnace. So integrating a waveguide section of 60 m\noccupied around one and a half week. Hence, it was attractive\nto try and save processing time by printing and drying a number\nof layers and then co-firing in one step. Our experience was\nthat circuits would develop cracks at the corners after firing.\nThe results of an unsuccessful attempt to build a 60- m-thick\ndielectric prior to firing are shown in Fig. 5, where significant\ncracking is evident.\nIII. INTEGRATED ANTENNA DESIGNS\nThis section discusses the design, simulation and theoretical\nanalysis of two different antenna topologies operating around\nAuthorized licensed use limited to: University of Surrey. Downloaded on June 5, 2009 at 07:51 from IEEE Xplore.  Restrictions apply.\n96 IEEE TRANSACTIONS ON ADVANCED PACKAGING, VOL. 32, NO. 1, FEBRUARY 2009\nFig. 6. Schematic showing the antenna structure.\n75 GHz and integrated into a single ceramic structure. Two\nstructures were considered:\n1) A simple substrate integrated waveguide antenna con-\nsisting of a 2 4 array of slots.\n2) A novel folded waveguide antenna array.\nA. Simple Integrated Waveguide Antenna Arrays\n1) Antenna Structure: Fig. 6 shows the structure of a simple\nintegrated waveguide antenna, consisting of a 2 4 array of ra-\ndiating slots. The feed consisted of a 50- microstrip line with\na tapered transition to provide impedance matching between the\nmicrostrip and the integrated waveguide section [11]. The input\npower is split equally into two linear arrays each having four\nslots, using a conventional side-fed H-plane divider [12], where\nthe separation between the two inductive walls can be adjusted\nfor maximum coupling into both sections. This feeding tech-\nnique introduces a phase difference of 180 between the two\nlinear arrays. Hence, the slots either side of the dividing wall\narray were positioned on opposite sides of the respective waveg-\nuides to give a further 180 phase difference This ensured that\nall the eight slots of the antenna radiated in phase.\nThe end slots were positioned a distance of from the\nshorted ends of the waveguide, as shown in Fig. 6, with the\nremaining slots separated by , so that all the slots would\nbe exited by maxima in the standing wave patterns. Thus the\nslot positions ensured maximum radiation from the antenna.\nThe slot lengths were to ensure good radiation, without\ncausing end-to-end mutual coupling between adjacent slots. The\nphysical lengths of the slots can be calculated from\n(1)\nwhere is the free space wavelength and is the permittivity\nof the dielectric.\n2) Antenna Dimensions: The dielectric waveguide antenna\narray with radiating slots was designed using conventional di-\nelectric waveguide theory [13], [14]. The design was then simu-\nlated and optimised using 3-D electromagnetic simulation soft-\nware HFSS to obtain maximum radiation. The optimized dimen-\nsions for a 2 3 slot array are shown in Fig. 7, where all di-\nmensions are in millimeters. The simulation results are shown\nin Fig. 8 for a representative SIW antenna; it should be noted\nthat the simulation was performed for at 76 GHz using Hybridas\nHD1000 thick-film dielectric, whereas our SIW antennas were\nFig. 7. Schematic showing integrated slotted waveguide antenna dimensions:\nall dimensions given here are in millimeters.\nFig. 8. (a) HFSS model, (b) field pattern, (c) return loss (d) radiation pattern at\nE-plane and H-plane, for the SIW antenna optimised for 76 GHz and obtained\nfrom simulation.\nintegrated using a similar but slightly different dielectric namely\nDupont QM 44 F due to the unavailability of the earlier paste in\nthe market.\n3) Experimental Results: The return loss and radiation\npattern for the integrated waveguide 2 3 array are plotted\nin Fig. 9; the return loss shows a good match at the design\nfrequency, and there is a well defined radiation pattern, with the\ncross-polar level more than 20 dB down on copolar level.\nB. Folded Waveguide Antenna Arrays\nThe concept of an antenna array using a folded waveguide\nwas proposed to extend the substrate integration strategy to\nlower frequencies [15]. The mode in a folded waveguide\nresembles that of a conventional rectangular waveguide. As a\nresult of this folding, as shown in Fig. 10, the width (a) of the\nguide is reduced by 50%, and the height of the guide is doubled\n(b). But, the height has got little effect on the propagation\nAuthorized licensed use limited to: University of Surrey. Downloaded on June 5, 2009 at 07:51 from IEEE Xplore.  Restrictions apply.\nHENRY et al.: MILLIMETER WAVE SUBSTRATE INTEGRATED WAVEGUIDE ANTENNAS: DESIGN AND FABRICATION ANALYSIS 97\nFig. 9. Experimental results for a 2\u0000 3 antenna array (a) return loss (b) radia-\ntion pattern at 73.5 GHz.\nFig. 10. Folded Waveguide antennas—Basic Concept.\nFig. 11. Design dimensions of a four slot folded waveguide antenna, all dimen-\nsions are in millimeters.\nFig. 12. Integrated folded waveguide antenna (a) top conductor layer, (b) in-\ntermediate conductor layer.\ncharacteristic and can be set as small as required. So the overall\neffect is to reduce the substrate area occupied by the antenna.\n1) Antenna Structure and Dimensions: The dimensions of a\n74-GHz, 4-slot folded waveguide antenna were optimised using\nHFSS and the results are shown in Fig. 11.\nThe antenna was fabricated using the photoimageable\nprocess that has been described previously. The photographs\nin Fig. 12(a) and (b) show the top and the intermediate layers\nduring the fabrication of a folded waveguide antenna. As well\nas showing the structure of the antenna, these photographs\nare a further indication of the quality of the photoimageable\nthick-film process. It can be seen from Fig. 13 that the measured\nreturn loss of the back-to-back transition is very good, greater\nFig. 13. Measured return loss of a back-to back folded waveguide transition.\nFig. 14. Folded Waveguide Antenna (a) return loss (b) radiation pattern.\nthan 20 dB, in the vicinity of the working frequency, showing\nthat the transition as behaving as expected.\n2) Experimental Results: The return loss and radiation pat-\ntern for a 4-slot folded waveguide antenna are shown in Fig. 14.\nThe antenna shows good cross-polar level and a good match\nclose to the resonant frequency.\nIV. INTEGRATED WAVEGUIDE LOSS ANALYSIS\nSince the antenna were fabricated using integrated waveg-\nuides, it was important to gain some insight into the practical\nlosses of the waveguide. To achieve this, waveguide lines of\ndifferent lengths, but with the same cross sections, were fabri-\ncated and the line loss measured using a vector network analyzer\n(HP 8510 XF), which had previously been calibrated using an\non-wafer calibration kit. The ends of the wave-guide sections\nwere tapered to connect with the coplanar probing pads. Each\ntapered section had an axial length of 2 mm. The return loss and\ninsertion loss of integrated waveguides of length 1.9 mm and\nwidth 1.266 mm are plotted in Fig. 15.\nThe results show that the integrated waveguide structure, in-\ncluding the tapered sections, has relatively low insertion loss up\nto 100 GHz, with a value of dB at the antenna design fre-\nquency (74 GHz). The losses tend to increase with frequency\ndue to increase in dielectric loss and conductor surface losses.\nThe losses in the tapered feeds, and also the probe-circuit mis-\nmatch losses, were de-embedded by computing the difference\nin the insertion losses of two wave-guide structures of different\nlengths. After de-embedding, the magnitude of the loss in the\nSIW was calculated and the loss is plotted as a function of fre-\nquency in Fig. 16. Fig. 17 shows the wave number and guided\nAuthorized licensed use limited to: University of Surrey. Downloaded on June 5, 2009 at 07:51 from IEEE Xplore.  Restrictions apply.\n98 IEEE TRANSACTIONS ON ADVANCED PACKAGING, VOL. 32, NO. 1, FEBRUARY 2009\nFig. 15. S-parameters plotted for substrate integrated waveguide and a simple\nmicrostrip line.\nFig. 16. Loss plotted in dB\/mm and dB\/\u0000g of a substrate-integrated waveguide\nof width 1.26 mm.\nFig. 17. The wave number \u0000\u0002\u0002 and guided wavelength \u0000\u0000 \u0002 of a substrate in-\ntegrated waveguide plotted against frequency.\nwavelength deduced from the measured phase data. The loss\nwas calculated to be at 74 GHz. It can be seen that the\nlosses are relatively small and this indicates that the integrated\nwaveguide structure is a usable interconnection technology up\nto high millimeter-wave frequencies.\nSimilar loss measurements were carried out for folded waveg-\nuides and it was found that the losses increased by around 20%.\nThis relatively small increase in loss, compared with the simple\nunfolded structure, indicates that the folded waveguide concept\nis viable in practical situations where substrate area is at a pre-\nmium. Fig. 18. shows images of the folded waveguide structures\nused for the insertion loss measurements.\nFig. 18. Folded waveguide sections of different length for insertion loss mea-\nsurement (dimensions in millimeters).\nFig. 19. The measured frequency response of three identical SIW antennas to\nillustrate the repeatability of thick-film processing.\nTABLE II\nTHREE-DIMENSIONAL TOLERANCES MEASURED ON THE CRITICAL DIMENSIONS\nOF SIW AND SIW ANTENNAS AFTER PROCESS MODIFICATION\nV. REPEATABILITY AND TOLERANCE ANALYSIS\nOF THICK FILM PROCESS\nThe section details the repeatability and tolerance involved\nin the thick film fabrication process. The frequency response of\nthe substrate integrated waveguide antenna fabricated on three\ndifferent supporting ceramic substrates is shown in Fig. 19.\nThe plot shows almost similar results for the same structure,\nwhich has gone through different printing and firing process\nand illustrates the repeatability of the thick film process in\nconstructing substrate integrated waveguide structures. Table II\ngives the 3-D tolerance measured on the critical SIW dimen-\nsions. The percentage values shown in the table are calculated\nby measuring the dimensions of the fabricated geometry after\nthe process modifications to account for shrinkage. The results\nindicate that the geometrical dimensions could be achieved\nwithin 5% under well-controlled process.\nVI. ANALYSIS OF INTEGRATED WAVEGUIDE PERFORMANCE\nThe primary aim of the current study was to establish the po-\ntential of photoimageable thick-film technology for fabricating\nminiature mm-wave components. An antenna, using novel tech-\nniques, was chosen for the investigation because it was relatively\ndemanding in terms of the required quality of fabrication and\nAuthorized licensed use limited to: University of Surrey. Downloaded on June 5, 2009 at 07:51 from IEEE Xplore.  Restrictions apply.\nHENRY et al.: MILLIMETER WAVE SUBSTRATE INTEGRATED WAVEGUIDE ANTENNAS: DESIGN AND FABRICATION ANALYSIS 99\nTABLE III\nPERFORMANCE COMPARISON TABLE FOR SIW AND A CONVENTIONAL\nMETALLIC ANTENNA ARRAY AT 74 GHZ\nalso because of the small dimensions that were needed. A fur-\nther benefit of the choice of an antenna was that there was per-\nformance data available in the literature [16] for antennas fabri-\ncated using other technologies, against which the performance\nof the integrated substrate approach could be compared.\nObviously, it was important to obtain some indication of the\nefficiency of the SIW antenna in comparison with the more con-\nventional microstrip patch array at mm-wave frequencies. For\nthis efficiency analysis, the total loss (dielectric and conductor)\nfor a section of waveguide is compared to that of an equivalent\nmicrostrip line. Direct comparisons are difficult, because mi-\ncrostrip interconnections normally have an impedance of 50 ,\nwhereas waveguide has a somewhat higher impedance How-\never, if we compare microstrip having the same overall dimen-\nsions as the integrated waveguide, i.e., occupying the same sub-\nstrate area, then we find that the microstrip has a loss around\n50% higher than that of the integrated waveguide. Moreover,\nfor an array giving similar radiation performance the total area\nof the substrate integrated waveguide antenna will be th\nof that occupied by a microstrip [16]. Therefore, the substrate\nintegrated waveguide structure will offer an advantage in terms\nof reduced surface area and efficiency that will be significant for\nhighly integrated millimeter-wave circuits, where substrate area\nis at a premium.\nThe three-slot substrate integrated waveguide antenna per-\nformance has been compared with that from a conventional\nmetallic air-filled waveguide antenna, as shown by the data\nin Table III. In this table, the gain for a conventional metallic\nwavguide antenna was calculated from [17] and the total loss\nis calculated from [18]. The minimum physical area was cal-\nculated for both antennas, and for the SIW the physical area\nwas reduced by % compared to the metallic waveguide\nair-filled antennas.\nVII. CONCLUSION\nThe results have demonstrated that photoimageable\nthick-film technology is a viable approach for the fabrica-\ntion of circuits working at high millimetre-wave frequencies,\noffering both low-loss interconnections and the potential to\nrealise fine circuit geometries. The techniques of using the\ntechnology to fabricate 3-D integrated waveguides within a\nplanar circuit proved successful, and led to the development\nof a high performance, miniature antenna working at 74 GHz.\nThe technique could be extended to LTCC, which would permit\nparallel processing of the layers and avoid the need for the time\nconsuming sequential processing of each layer.\nREFERENCES\n[1] W. Menzal and J. Kassner, “Millimeter-wave 3-D integration tech-\nniques using LTCC and related multi-layer circuits,” in Proc. 30th Eur.\nMicrowave Conf. Proc., Paris, France, 2000, pp. 33–53.\n[2] D. Deslandes and K. Wu, “Design consideration and performance anal-\nysis of substrate integrated waveguide components,” in Eur. Microw.\nConf., Milan, Italy, Sep. 2002, pp. 881–884.\n[3] Y. Cassivi, L. Perregrini, P. Arcoini, M. Bressan, K. Wu, and G. Con-\nciauro, “Dispersion characteristics of substarte integrated rectangular\nwaveguide,” IEEE Microw. Wireless Compon. Lett., vol. 21, no. 9, pp.\n333–335, Sep. 2002.\n[4] W. R. McGrath, C. Walker, M. Yap, and Y.-C. Tai, “Silicon microma-\nchined waveguides for millimeter-wave and submillimeter-wave fre-\nquencies,” IEEE Microw. Guided Wave Lett., vol. 3, no. 3, pp. 61–63,\nMar. 1993.\n[5] C. E. Collins et al., “A new micro-machined millimeter-wave and tera-\nhertz snap-together rectangular waveguide technology,” IEEE Microw.\nGuided Wave Lett., vol. 9, no. 2, pp. 63–65, Feb. 1999.\n[6] J. W. Digby et al., “Fabrication and characterization of micromachind\nrectangular waveguide components for use at millimeter-wave and ter-\nahertz frequencies,” IEEE Trans. Microwave Theory Tech., vol. 48, no.\n8, pp. 1293–1302, Aug. 2000.\n[7] M. Henry, C. E. Free, B. S. Izquerido, J. Batchelor, and P. Young,\n“Photo-imageable thick-film circuits up to 100 GHz,” in Proc. 39th Int.\nSymp. Microelectron. IMAPS, San Diego, CA, Nov. 2006, pp. 230–236.\n[8] D. Stephens, P. R. Young, and I. D. Robertson, “Millimeter-wave sub-\nstrate integrated waveguides and filters in photoimageable thick-film\ntechnology,” IEEE Trans. Microwave Theory Tech., vol. 53, no. 12, pp.\n3822–3838, Dec. 2005.\n[9] C. Y. Chang and W. C. Hsu, “Photonic bandgap dielectric waveguide\nfilter,” IEEE Microw. Wireless Compon. Lett., vol. 12, no. 4, pp.\n137–139, Apr. 2002.\n[10] Y. Cassivi, D. Deslandes, and K. Wu, “Substrate integrated waveguide\ndirectional couplers,” presented at the Asia, Pacific Conf., Kyoto,\nJapan, Nov. 2002.\n[11] D. Deslandes et al., “Integrated microstrip and rectangular waveguide\nin planar form,” IEEE Microw. Wireless Compon. Lett., vol. 11, no. 2,\npp. 68–70, Feb. 2001.\n[12] K. Song, Y. Fan, and Y. Zhang, “Design of low-profile millimeter-\nwave substrate integrated waveguide power divider\/combiner,” , Int. J.\nInfrared Millimeter Waves, vol. 28, no. 6, pp. 473–478, 2007.\n[13] R. M. Knox, “Dielectric waveguide microwave integrated circuits-an\noverview,” IEEE Trans. Microwave Theory Tech., vol. 24, no. 11, pp.\n806–814, Nov. 1976.\n[14] H. Jacobs, G. Novick, G. M. Locascio, and M. M. Chrepta, “Measur-\nment of guide wavelength in rectangular dielectric waveguides,” IEEE\nTrans. Microwave Theory Tech., vol. 24, no. 11, pp. 815–820, Nov.\n1976.\n[15] N. Grigoropoulos and P. R. Young, “Compact folded waveguide,” in\nProc. 34th Eur. Microwave Conf., Amsterdam, The Netherlands, 2004,\npp. 973–976.\n[16] F. Kolak and C. Eswarappa, “A low profile 77 GHz three beam antenna\nfor automotive radar,” IEEE MTT-S Dig., vol. 2, pp. 1107–1110, 2001.\n[17] C. A. Balanis, Antenna Theory Analysis and Design, 2nd ed. New\nYork: Wiley.\n[18] E. V. D. Glazier and H. R. L. Lamont, The Services Textbook of\nRadio. London, U.K.: Her Majesty’s Stationery Office (HMSO),\n1958, vol. 5, Transmission and Propagation.\nManju Henry received the M.S. and Ph.D. degrees\nin electronic engineering from Cochin University of\nScience and Technology, Kerala, India in 1998 and\n2002, respectively.\nIn 2002, she joined the Institute for High fre-\nquency and Microwave Techniques, Forshungszen-\ntrum, Karlsruhe, Germany as a Postdoctoral\nResearcher. From 2004 to 2006, she was a Research\nFellow in the EPSRC funded project on millimeter\nwave antenna integration to ceramic multichip\nmodule technology at the University of Surrey,\nGuildford, U.K. She joined the MMT group at Rutherford Appleton Labora-\ntory, Science and Technology Facilities Council, Chilton, U.K., in 2007, and is\ncurrently developing novel frequency selective surfaces and design topologies\nfor Schottky-based frequency multipliers. She has more than 35 publications in\ninternational journals and conferences.\nAuthorized licensed use limited to: University of Surrey. Downloaded on June 5, 2009 at 07:51 from IEEE Xplore.  Restrictions apply.\n100 IEEE TRANSACTIONS ON ADVANCED PACKAGING, VOL. 32, NO. 1, FEBRUARY 2009\nCharles Free is a graduate in electronic engineering.\nAfter working as a Senior Research Engineer in in-\ndustry he moved to academia, and he is currently a\nReader in Microwave Technology at the University\nof Surrey, Surrey, U.K. His research interests are pri-\nmarily in microwave circuits and antennas. He is the\nauthor of over 100 papers.\nBenito Sanz-Izquierdo received the B.Sc. from the\nUniversity of Las Palmas de Gran Canaria, Spain, in\n1998 and the M.Sc. and Ph.D. degrees from the Uni-\nversity of Kent, Kent, U.K., in 2002 and 2007, respec-\ntively.\nHe has been working as a Research Associate in\nthe Department of Electronics of the University of\nKent since 2003. His research interests are multi-\nband, wearable antennas, RFID antennas, substrate\nintegrated waveguides components, electromag-\nnetic band-gap structures, and frequency selective\nsurfaces.\nJohn C. Batchelor (SM’07) received the B.Sc. and\nPh.D. degrees from the University of Kent, Canter-\nbury, U.K., in 1991 and 1995, respectively.\nFrom 1997 to 2006, he was a Lecturer with the\nElectronics Department, University of Kent, and\nin 2006, he became a Senior Lecturer of electronic\nengineering. His current research interests include\nprinted antennas, body-worn antennas, electro-\nmagnetic- band gap structures, and low-frequency\nfrequency-selective surfaces for application in smart\nbuildings.\nAuthorized licensed use limited to: University of Surrey. Downloaded on June 5, 2009 at 07:51 from IEEE Xplore.  Restrictions apply.\n"}