{"doi":"10.1016\/j.rse.2010.06.006","coreId":"56048","oai":"oai:nora.nerc.ac.uk:10886","identifiers":["oai:nora.nerc.ac.uk:10886","10.1016\/j.rse.2010.06.006"],"title":"Hyperspectral remote sensing of cyanobacterial pigments as indicators for cell populations and toxins in eutrophic lakes","authors":["Hunter, Peter D.","Tyler, Andrew N.","Carvalho, Laurence","Codd, Geoffrey A.","Maberly, Stephen C."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"The growth of mass populations of toxin-producing cyanobacteria is a serious concern for the ecological\\ud\nstatus of inland waterbodies and for human and animal health. In this study we examined the performance\\ud\nof four semi-analytical algorithms for the retrieval of chlorophyll a (Chl a) and phycocyanin (C-PC) from data\\ud\nacquired by the Compact Airborne Spectrographic Imager-2 (CASI-2) and the Airborne Imaging Spectrometer\\ud\nfor Applications (AISA) Eagle sensor. The retrieval accuracies of the semi-analytical models were\\ud\ncompared to those returned by optimally calibrated empirical band-ratio algorithms. The best-performing\\ud\nalgorithm for the retrieval of Chl a was an empirical band-ratio model based on a quadratic function of the\\ud\nratio of re!ectance at 710 and 670 nm (R2=0.832; RMSE=29.8%). However, this model only provided a\\ud\nmarginally better retrieval than the best semi-analytical algorithm. The best-performing model for the\\ud\nretrieval of C-PC was a semi-analytical nested band-ratio model (R2=0.984; RMSE=3.98 mg m−3). The\\ud\nconcentrations of C-PC retrieved using the semi-analytical model were correlated with cyanobacterial cell\\ud\nnumbers (R2=0.380) and the particulate and total (particulate plus dissolved) pools of microcystins\\ud\n(R2=0.858 and 0.896 respectively). Importantly, both the empirical and semi-analytical algorithms were\\ud\nable to retrieve the concentration of C-PC at cyanobacterial cell concentrations below current warning\\ud\nthresholds for cyanobacteria in waterbodies. This demonstrates the potential of remote sensing to contribute\\ud\nto early-warning detection and monitoring of cyanobacterial blooms for human health protection at regional\\ud\nand global scales","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/56048.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/10886\/2\/N010886PP.pdf","pdfHashValue":"18e47c7c4592de2570fd0661bae56222f45f8dfa","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:10886<\/identifier><datestamp>\n      2012-11-22T12:12:28Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533131<\/setSpec><setSpec>\n      7375626A656374733D533136<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/10886\/<\/dc:relation><dc:title>\n        Hyperspectral remote sensing of cyanobacterial pigments as indicators for cell populations and toxins in eutrophic lakes<\/dc:title><dc:creator>\n        Hunter, Peter D.<\/dc:creator><dc:creator>\n        Tyler, Andrew N.<\/dc:creator><dc:creator>\n        Carvalho, Laurence<\/dc:creator><dc:creator>\n        Codd, Geoffrey A.<\/dc:creator><dc:creator>\n        Maberly, Stephen C.<\/dc:creator><dc:subject>\n        Ecology and Environment<\/dc:subject><dc:subject>\n        Health<\/dc:subject><dc:description>\n        The growth of mass populations of toxin-producing cyanobacteria is a serious concern for the ecological\\ud\nstatus of inland waterbodies and for human and animal health. In this study we examined the performance\\ud\nof four semi-analytical algorithms for the retrieval of chlorophyll a (Chl a) and phycocyanin (C-PC) from data\\ud\nacquired by the Compact Airborne Spectrographic Imager-2 (CASI-2) and the Airborne Imaging Spectrometer\\ud\nfor Applications (AISA) Eagle sensor. The retrieval accuracies of the semi-analytical models were\\ud\ncompared to those returned by optimally calibrated empirical band-ratio algorithms. The best-performing\\ud\nalgorithm for the retrieval of Chl a was an empirical band-ratio model based on a quadratic function of the\\ud\nratio of re!ectance at 710 and 670 nm (R2=0.832; RMSE=29.8%). However, this model only provided a\\ud\nmarginally better retrieval than the best semi-analytical algorithm. The best-performing model for the\\ud\nretrieval of C-PC was a semi-analytical nested band-ratio model (R2=0.984; RMSE=3.98 mg m−3). The\\ud\nconcentrations of C-PC retrieved using the semi-analytical model were correlated with cyanobacterial cell\\ud\nnumbers (R2=0.380) and the particulate and total (particulate plus dissolved) pools of microcystins\\ud\n(R2=0.858 and 0.896 respectively). Importantly, both the empirical and semi-analytical algorithms were\\ud\nable to retrieve the concentration of C-PC at cyanobacterial cell concentrations below current warning\\ud\nthresholds for cyanobacteria in waterbodies. This demonstrates the potential of remote sensing to contribute\\ud\nto early-warning detection and monitoring of cyanobacterial blooms for human health protection at regional\\ud\nand global scales.<\/dc:description><dc:publisher>\n        Elsevier<\/dc:publisher><dc:date>\n        2010<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/10886\/2\/N010886PP.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Hunter, Peter D.; Tyler, Andrew N.; Carvalho, Laurence; Codd, Geoffrey A.; Maberly, Stephen C..  2010  Hyperspectral remote sensing of cyanobacterial pigments as indicators for cell populations and toxins in eutrophic lakes.   Remote Sensing of Environment, 114. 2705-2718.  https:\/\/doi.org\/10.1016\/j.rse.2010.06.006 <https:\/\/doi.org\/10.1016\/j.rse.2010.06.006>     \n <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/j.rse.2010.06.006<\/dc:relation><dc:relation>\n        10.1016\/j.rse.2010.06.006<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/10886\/","http:\/\/dx.doi.org\/10.1016\/j.rse.2010.06.006","10.1016\/j.rse.2010.06.006"],"year":2010,"topics":["Ecology and Environment","Health"],"subject":["Publication - Article","PeerReviewed"],"fullText":" \nCopyright © 2010 Elsevier B.V. \n \nThis version available http:\/\/nora.nerc.ac.uk\/10886\/  \n \n \nNERC has developed NORA to enable users to access research outputs \nwholly or partially funded by NERC. Copyright and other rights for material \non this site are retained by the authors and\/or other rights owners. Users \nshould read the terms and conditions of use of this material at \nhttp:\/\/nora.nerc.ac.uk\/policies.html#access  \n \n \nThis document is the author’s final manuscript version of the journal \narticle, incorporating any revisions agreed during the peer review \nprocess. Some differences between this and the publisher’s version \nremain. You are advised to consult the publisher’s version if you wish \nto cite from this article. \n \nwww.elsevier.com\/  \n \n \n \nArticle (refereed) \n \n \n \nHunter, Peter D.; Tyler, Andrew N.; Carvalho, Laurence; Codd, \nGeoffrey A.; Maberly, Stephen C.. 2010 Hyperspectral remote \nsensing of cyanobacterial pigments as indicators for cell populations \nand toxins in eutrophic lakes. Remote Sensing of Environment, 114. \n2705-2718. 10.1016\/j.rse.2010.06.006 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nContact CEH NORA team at  \nnoraceh@ceh.ac.uk \n \n \nThe NERC and CEH  trade marks and logos (‘the Trademarks’) are registered trademarks of NERC in the UK and \nother countries, and may not be used without the prior written consent of the Trademark owner. \n 1 \nHyperspectral remote sensing of cyanobacterial pigments 1 \nas indicators for cell populations and toxins in eutrophic 2 \nlakes  3 \n 4 \nPeter D. Hunter\na,*\n, Andrew N. Tyler\na\n, Laurence Carvalho\nb\n, Geoffrey A. Codd\nc\n and Stephen C. 5 \nMaberly\nd\n 6 \n 7 \na\nSchool of Biological and Environmental Science, University of Stirling, Stirling,  8 \nFK9 4LA, United Kingdom. 9 \n \n10 \nb\nCentre for Ecology & Hydrology, Bush Estate, Penicuik, Midlothian,  11 \nEH26 0QB, United Kingdom. 12 \n \n13 \nc\nDivision of Molecular Microbiology,  College of Life Sciences , University of Dundee, 14 \nDundee, DD1 5EH, United Kingdom. 15 \n \n16 \nd\nCentre for Ecology & Hydrology, Lancaster Environment Centre, Library Avenue, Bailrigg, 17 \nLancaster, LA1 4AP, United Kingdom.18 \n                                                \n*\nCorresponding author. Tel.: +44 1786 467810; fax: +44 1786 467843. \nE-mail address: p.d.hunter@stir.ac.uk \n 2 \nAbstract 1 \nThe growth of mass populations of toxin-producing cyanobacteria is a serious concern for the 2 \necological status of inland waterbodies and for human and animal health.  In this study we 3 \nexamine the performance of four semi-analytical algorithms for the retrieval of chlorophyll a 4 \n(Chl a) and phycocyanin (C-PC) from data acquired by the Compact Airborne Spectrographic 5 \nImager-2 (CASI-2) and the Airborne Imaging Spectrometer for Applications (AISA) Eagle 6 \nSensor.  The retrieval accuracies are compared to those returned by semi-empirical band-ratio 7 \nalgorithms optimised for these datasets.  The best-performing algorithm for the retrieval of 8 \nChl a was a semi-empirical band-ratio model (R\n2\n = 0.832; RMSE = 29.8%).  The best 9 \nperforming model for the retrieval of C-PC was a semi-analytical nested band ratio model (R\n2\n 10 \n= 0.984; RMSE = 3.98 mg m\n-3\n).  The concentrations of C-PC retrieved using the semi-11 \nanalytical model were also correlated with those of cyanobacterial cells (R\n2\n = 0.380) and of 12 \nthe particulate and total (particulate plus dissolved) pools of microcystins (R\n2\n = 0.858 and 13 \n0.896 respectively).  Importantly, both the semi-empirical and semi-analytical algorithms 14 \nwere able to retrieve the concentration of C-PC at cyanobacterial cell concentrations below 15 \ncurrent warning thresholds for cyanobacteria in waterbodies.  This demonstrates the potential 16 \nof remote sensing to contribute to early-warning detection and monitoring of cyanobacterial 17 \nblooms for human health protection, at regional and global scales.  18 \n 19 \nKey words: Cyanobacteria; human health; lakes; microcystin; imaging spectrometry; risk 20 \nassessment21 \n 3 \nIntroduction 1 \n1.1 Mass populations of toxic cyanobacteria 2 \nCyanobacteria (blue-green algae) are natural and cosmopolitan inhabitants of fresh, brackish 3 \nand marine waters.  They are particularly well adapted for growth in nutrient-enriched lakes 4 \nand other slow-flowing inland waters and often form mass populations (as blooms, scums or 5 \nbiofilms) during summer and autumn in temperate latitudes.  These mass populations are a 6 \nserious concern because they can have profound and far-reaching adverse environmental and 7 \neconomic impacts on natural and controlled waterbodies (Pearson et al., 2001; Havens, 8 \n2008).  Cyanobacterial populations can also pose significant risks to animal and human health 9 \nbecause several species can produce potent toxins (cyanotoxins).  These toxins constitute 10 \nsome of the most hazardous of all waterborne biological substances and include agents with 11 \n(examples in parentheses): neurotoxic (anatoxin-a, anatoxin-a[S], beta-methylamino alanine, 12 \nsaxitoxins); hepatotoxic and tumour-promoting (microcystins, nodularins); cytotoxic and 13 \ngenotoxic (cylindrospermopsins), and endotoxic (lipopolysaccharides) properties (Codd et 14 \nal., 2005b; Metcalf et al., 2008).  The microcystins (MC), of which over 90 structural variants 15 \nare known, are among the most common and potent of the cyanotoxins. 16 \n 17 \nBlooms of toxigenic cyanobacteria in waterbodies used for drinking water, aquaculture, crop 18 \nirrigation and recreation are increasing in abundance and spread due to eutrophication.  19 \nHuman exposure to bloom-forming cyanobacteria and their toxins most commonly occurs via 20 \ndrinking water or incidental ingestion, dermal contact and inhalation (Codd et al., 2005b).  21 \nHowever, there is also evidence that cyanotoxins can be transferred to crops intended for 22 \nhuman consumption via spray-irrigation with contaminated water (Codd et al., 1999; Tyler et 23 \nal., 2009).  Cyanotoxins have been linked with numerous incidences of ill health in humans, 24 \nranging from cases of mild skin irritation and gastrointestinal illnesses to acute (and 25 \n 4 \noccasionally fatal) poisonings (Pilotto et al., 1997; Carmichael et al., 2001).  These health 1 \nrisks may be further exacerbated if incidences of blooms continue to increase under a 2 \nwarming climate (Johnk et al., 2008; Paerl & Huisman, 2008). 3 \n 4 \nCyanobacterial abundance is a useful indicator of inland and coastal water quality and is one 5 \nof the biological quality metrics being considered for the assessment of lake ecological status 6 \nunder the European Union’s Water Framework Directive (EU WFD) (2000\/60\/EC).  The 7 \nmonitoring of cyanobacteria and cyanotoxins is also necessary so that timely warnings can be 8 \nprovided to safeguard animal and human health.  Cyanotoxin concentrations are rarely 9 \nroutinely monitored in waterbodies as the analyses are costly, and require specialist 10 \nlaboratory facilities and technical expertise.  Consequently, existing monitoring programmes 11 \ntend to focus on cyanobacterial cell numbers (or biovolume) rather than cyanotoxin 12 \nidentification and quantification.  The resource costs involved in both sampling lakes and 13 \nanalysing cyanobacterial densities, limits agencies across Europe to generally only monitor a 14 \nsingle location, from a small proportion of lakes at a monthly frequency at best.  15 \nConsequently, conventional monitoring programmes are only aimed at providing a general 16 \nassessment of ecological quality at these lakes and are insufficient to provide timely warnings 17 \nof bloom development across whole lake areas or across large geographical regions. 18 \n 19 \nThere is a clear need to develop techniques that can complement and extend current 20 \napproaches to monitoring and managing cyanobacteria and their toxins in inland, transitional 21 \nand coastal waters.  Indeed, this has recently been acknowledged by a number of international 22 \nbodies (WHO, 2003, 2004; Codd et al., 2005a).  Techniques including flow cytometry and 23 \nspectrofluorometry (with specificity for diagnostic cyanobacterial pigments) offer 24 \npossibilities for real-time monitoring of cyanobacteria in the field.  However, such techniques 25 \n 5 \ncan be less effective where monitoring needs to be undertaken routinely across numerous 1 \nlakes at a regional or national scale.  Moreover, as cyanobacterial bloom and scum 2 \ndistribution can change rapidly in space and time, e.g. according to wind speed and direction, 3 \nobservations at fixed stations or along set transects may be unrepresentative of cyanobacterial 4 \ndistribution and abundance throughout the entire waterbody (Rantajarvi et al., 1998; Kutser, 5 \n2004). 6 \n 7 \nIn view of this, there is considerable interest in developing remote sensing-based techniques 8 \nto detect and map cyanobacterial blooms from space.  Recent advances in ocean colour 9 \nremote sensing have demonstrated that it is possible to develop bespoke inversion algorithms 10 \nfor mapping different phytoplankton functional types (PFTs) and size classes (Nair et al., 11 \n2008) and to recognise important bloom-forming species including coccolithophores (Smyth 12 \net al., 2002), diatoms (Sathyendranath et al., 2004) red tide dinoflagellates (Tomlinson et al., 13 \n2009) and toxigenic cyanobacteria (Ramos et al., 2005; Westberry et al., 2005).  Similarly, in 14 \ninland waters there is a small but growing body of evidence to suggest that the identification 15 \nand quantification of cyanobacteria is possible from measurements of remote-sensing-16 \nreflectance (Rrs(0\n+\n, )) because of their unique bio-optical traits (Hunter et al., 2008a; Kutser 17 \net al., 2006; Reinart & Kutser, 2006).  A comprehensive review of recent progress in this 18 \nfield can be found in Kutser (2009). 19 \n 20 \n1.2 Remote sensing of cyanobacterial blooms 21 \nChl a concentration is used as a standard measure of phytoplankton biomass in fresh and 22 \nmarine waters and numerous inversion algorithms for the retrieval of Chl a from 23 \nmeasurements of Rrs(0\n+\n, ) have been developed for both Case 1 waters (those waters whose 24 \noptical properties are determined primarily by phytoplankton and covarying coloured 25 \n 6 \ndissolved organic matter and detrital material (CDOM)), and Case 2 waters (whose optical 1 \nproperties are significantly influenced by other constituents such as mineral particles and 2 \nCDOM that do not covary with phytoplankton concentration) (Gons, 1999; Tyler et al., 3 \n2006).  Because Chl a is almost ubiquitous across phytoplankton, the retrieval of Chl a alone 4 \ndoes not provide any information on the presence and abundance of specific taxa.  However, 5 \nthe development of new inversion algorithms for the retrieval of the cyanobacterial biomarker 6 \npigment C-phycocyanin (C-PC) from Rrs(0\n+\n, ) offers a route to detect and quantify 7 \ncyanobacterial biomass in inland and coastal waters.  To date, three different types of 8 \ninversion algorithms have been developed for the retrieval of C-PC over turbid inland waters.  9 \nThese include the baseline algorithm proposed by Dekker (1993), the band-ratio algorithms 10 \nfor C-PC retrieval of Schalles et al. (2000) and Hunter et al. (2008b; 2009), and the semi-11 \nempirical nested band-ratio of Simis et al. (2005) (hereafter referred to as the SIMIS 12 \nalgorithm).  13 \n 14 \nThe SIMIS semi-analytical nested band-ratio algorithm retrieves the value of C-PC 15 \nabsorption coefficient at 620 nm.  It includes a correction for absorption by Chl a at the 620 16 \nnm C-PC absorption maximum.  The algorithm is based on an earlier model for Chl a 17 \nretrieval developed by Gons (1999) for MERIS (Medium Resolution Imaging Spectrometer) 18 \nonboard the European Space Agency’s Envisat  (hereafter referred to as the GONS 19 \nalgorithm).  These algorithms exploit the relationship between subsurface irradiance 20 \nreflectance and the absorption and backscattering properties of optically-active constituents in 21 \nthe water column as defined by Gordon et al. (1975): 22 \n 23 \n)λ()λ(\n)λ(\nλ),(0\nb\nb\nba\nb\nfR      (1) 24 \n 7 \n 1 \nWhere  is an empirically determined scale factor dependent on the ambient light field and 2 \na(λ) and bb(λ) are the coefficients for total absorption and backscattering respectively.  If  3 \nand bb are assumed to be spectrally-independent, and bb is known for a particular wavelength, 4 \nthen absorption by water and its main constituents can be solved from the ratio R(λ2):R(λ1) 5 \nand a known value for a at wavelength λ2: 6 \n 7 \nbb b\nR\nR\nbaa\n)λ(\n)λ(\n])λ([)λ(\n1\n2\n21     (2) 8 \n 9 \nThe GONS algorithm uses the ratio of reflectance for λ1 = 665 and λ2 = 709 nm to estimate 10 \nthe Chl a absorption coefficient at 665 nm.  It assumes that a(λ1) can be attributed to 11 \nabsorption by water [aw(λ1)] and phytoplankton pigments [aph(λ1)], and that a(λ2) can be 12 \nattributed entirely to absorption by water [aw(λ2)].  This ignores the possible contributions of 13 \nnon-phytoplankton particulates (inorganic and organic suspended particulate matter) and 14 \nCDOM to a(λ1) and  a(λ2).  It also assumes that absorption by phytoplankton pigments is 15 \nnegligible at a(λ2).  The empirical correction factor  is introduced to relate absorption at λ1 to 16 \nthat measured at the same wavelength.  The following relationship for the retrieval of Chl a 17 \nabsorption at 665 nm [achl(665)] is then obtained: 18 \n 19 \nachl(665) aw(709) bb\nR(709)\nR(665)\nbb aw(665) ?\n1  20 \n (3) 21 \n 22 \n 8 \nThe value of bb is estimated according to Gons (1999; 2005) by using a wavelength further 1 \ninto the NIR and inverting Eq. (1) using an estimate of f based upon an empirical relation 2 \nincorporating the average cosine of downward irradiance: 3 \n 4 \nbb (779)\n1.61 R(779)\n0.082 0.6 R(779)\n    (4) 5 \n 6 \nThe concentration of Chl a is then returned by dividing achl(665) by the specific absorption 7 \ncoefficient of Chl a at 665 nm ( )665(\n*\nchla ) as shown below: 8 \n 9 \n)665(\/)665(  Chl\n*\nchlchl aaa      (5) 10 \n 11 \nThe above algorithm was modified in Simis et al. (2005) for the retrieval of C-PC through the 12 \nintroduction of the ratio of reflectance at λ1 = 620 and λ2 = 709 nm and an empirically 13 \nderived factor  for the correction of a(620) that mimics the use of the constant  used in Eq. 14 \n3.  To account for co-absorption by Chl a and C-PC at 620 nm it is necessary firstly to 15 \nestimate absorption by Chl a at 620 nm [achl(620)] and then subtract this from a(620) to yield 16 \nthe absorption by C-PC [aCPC(620)].  This is achieved by the introduction of the conversion 17 \nfactor  that relates in vivo absorption by Chl a at 665 nm to that at 620 nm.  Subsequently, 18 \naCPC(620) can be solved from: 19 \n 20 \naCP C aw(709) bb\nR(709)\nR(620)\nbb aw(620) ?\n1 [? achl(665)] (6) 21 \n 22 \n 9 \nby substitution of aw(620) = 0.281, aw(665) = 0.401 and aw(709) = 0.727 from Buiteveld et al. 1 \n(1994) and  = 0.84,  = 0.68 and  = 0.24 from Simis et al. (2005).  The concentration of C-2 \nPC is retrieved by dividing by the specific absorption coefficient for C-PC at 620 nm: 3 \n 4 \n)620(\/)620( CPC\n*\nCPCCPC aa      (7) 5 \n 6 \nThe inversion algorithm developed by Simis et al. (2005) has recently been tested using 7 \nextensive in-situ radiometric measurements at a series of lakes and reservoirs in the 8 \nNetherlands, Spain and the United States (c.f., Randolph et al., 2008; Ruiz-Verdu et al., 2008; 9 \nSimis et al., 2007) and was found to outperform other algorithms for C-PC retrieval.  The 10 \ninversion algorithm was also recently successfully used to retrieve C-PC estimates from 11 \nMERIS data {Guanter et al. 2010}.   The wider testing of this algorithm for the retrieval of C-12 \nPC from Rrs(0\n+\n, ) spectra measured by airborne and spaceborne sensors is necessary because 13 \nthe incursion of errors due to atmospheric and adjacency effects can have a significant effect 14 \non the estimation of pigment concentrations from remotely sensed data (Alikas & Reinart, 15 \n2008). 16 \n 17 \nIn addition to the bespoke algorithm for the retrieval of C-PC of Simis et al. (2005), a 18 \nmedium-independent model to retrieve pigment concentrations has been developed by 19 \nDall′Olmo et al. (2003).  This model uses the value of Rrs(0\n+\n, ) in three bands to estimate the 20 \npigment concentrations: 21 \n 22 \n)()]()([ ion concentratPigment 3rs2\n-1\nrs1\n-1\nrs RRR    (8) 23 \n 24 \nWidely \nrecognised \n?? \n 10 \nThe specific wavelengths used in the model must be optimised for the pigment of interest 1 \nthrough empirical iteration.  Dall’Olmo et al. (2003) developed the algorithm originally for 2 \nthe retrieval of Chl a in terrestrial vegetation and turbid inland waters.  The theory behind the 3 \nmodel is that the reciprocal of reflectance at wavelength 1 should be maximally sensitive to 4 \nabsorption by the pigment of interest.  Dall’Olmo and Gitelson (2005) suggest a wavelength 5 \nbetween 660 to 690 nm for the retrieval of Chl a.  However, as reflectance in this spectral 6 \nregion is also affected to varying degrees by absorption by mineral particles, organic detritus 7 \nand CDOM, a second wavelength, 2, that is minimally sensitive to absorption by the 8 \npigment of interest, and is close to 1, is needed to correct for co-absorption by other 9 \noptically-active constituents.  It has been shown that 2 should occur between 710 to 730 nm 10 \nfor the retrieval of Chl a (Dall'Olmo & Gitelson, 2006; Gitelson et al., 2006). 11 \n 12 \nTo account for potential differences in backscattering, potentially caused by non-13 \nphytoplankton particulates, a third wavelength 3 is introduced into the model at which 14 \nabsorption is dominated by water (i.e. 3 should be minimally sensitive to absorption by 15 \npigments, mineral particles, organic detritus and CDOM).  Dall′Olmo and Gitelson (2005) 16 \nlocated 3 between 740 and 760 nm.   17 \n 18 \nThe semi-analytical algorithm derived by Dall′Olmo (2003) has been well-validated for the 19 \nretrieval of Chl a using empirical datasets and radiative transfer modelling (Dall'Olmo & 20 \nGitelson, 2005; Dall'Olmo & Gitelson, 2006; Gitelson et al., 2008).  Hunter et al. (2008a) 21 \npreviously adapted this algorithm to estimate C-PC concentrations in experimental cultures of 22 \ncyanobacteria.  This was achieved by setting λ1 = 630, λ2 = 660 and λ3 = 750 nm after 23 \niterative tuning of the algorithm.  However, the ability of the algorithm to estimate C-PC in 24 \nnatural inland waters has yet to be examined. 25 \n 11 \n  1 \nIn the present study, we test the performance of the semi-analytical algorithms of Gons 2 \n(1999), Simis et al. (2005) and Dall′Olmo et al (2003) for the retrieval of Chl a and C-PC in 3 \ninland waters using imagery from the Compact Airborne Spectrographic Imager-2 (CASI-2) 4 \nand the hyperspectral Airborne Imaging Spectrometer for Applications (AISA) Eagle and 5 \nHawk sensors.  We compare their performance to that of several semi-empirical algorithms 6 \noptimised for our specific dataset.  We also analyse the relationships between the estimated 7 \nC-PC concentrations and the measured concentrations of cyanobacterial cells and toxins 8 \n(microcystins).  The potential utility of remote sensing as a means of monitoring 9 \ncyanobacterial blooms in inland waters is discussed and some directions for future research 10 \nare outlined. 11 \n 12 \n2. Methods 13 \n2.1 Study sites 14 \nThe study was undertaken at two shallow, eutrophic lakes in the UK (Fig. 1).  Loch Leven is 15 \nthe largest lake (13.3 km\n2\n) in lowland Scotland (56 12 N, 3 22 W) with a mean depth of 3.9 16 \nm.  Loch Leven water quality has been adversely affected by nutrients from domestic, 17 \nagricultural and industrial sources and, while there is some evidence for recovery (Carvalho 18 \n& Kirika, 2003; Ferguson et al., 2008), cyanobacterial blooms continue to occur during 19 \nsummer months.  These blooms are typically dominated by genera such as Anabaena, 20 \nMicrocystis, Snowella and Woronichinia.  Esthwaite Water is a small lake in the English 21 \nLake District (54 21 N, 3 0 W) with a mean depth of 6.4 m.  The lake receives nutrients from 22 \na local sewage treatment works and a fish farm.  Cyanobacterial blooms dominated by genera 23 \nsuch as Anabaena, Aphanizomenon, Microcystis, Planktothrix and Woronichinia occur 24 \n 12 \nannually during the summer.  Table 1 provides a summary of the physical and 1 \nphysicochemical characteristics of the two lakes. 2 \n 3 \n2.2 Water sampling and analysis 4 \n2.2.1. Lake sampling for algorithm development and testing 5 \nWater samples were collected from both lakes concurrrent with the airborne remote sensing 6 \nflights to provide ground reference data for algorithm development and testing.  Five litre 7 \nsamples were collected from the surface using a large bucket at 5 stations across each lake.  8 \nThe 5L water samples were thoroughly mixed to uniformly disperse any buoyant 9 \ncyanobacterial cells, and then split into replicate aliquots for phytoplankton cell counts and 10 \npigment and microcystin analysis.  The samples intended for phytoplankton counts were 11 \nimmediately fixed with Lugol’s Iodine solution (1% v\/v).  Samples for pigment analysis were 12 \nstored on ice in the dark for <6 h before they were filtered by passing the sample through 13 \nreplicate Whatman GF\/F filters under vacuum pressure and freezing the filters at -80 C until 14 \nfurther analysis could be performed.  Samples for microcystin analysis were stored in the 15 \ndark at 4 C and processed within 48 h. 16 \n 17 \n2.2.2. Phytoplankton cell counts 18 \nThe concentration of cyanobacterial cells was determined in all the samples collected during 19 \nthe lake cruises.  Cells were counted under an inverted microscope according to standard 20 \nprocedures (Brierley et al., 2007) with taxonomy following John et al. (2003).  Biovolumes 21 \nwere calculated for the Loch Leven samples using appropriate geometric models for each 22 \ntaxon (Hillebrand et al., 1999).  In addition, cell counts from routine fortnightly surveys were 23 \nprovided for both lakes by the Centre for Ecology & Hydrology. 24 \n 25 \n 13 \n2.2.3. Pigment analysis 1 \nChl a was extracted by manual grinding of filter discs for 1 min and soaking in 90% acetone 2 \nin the dark for 20 h at -20°C {Hunter et al., 2008}.  The extracts were clarified by 3 \ncentrifugation (10 min, 5000 x g) and the concentration of Chl a was determined by 4 \nspectrophotometry using the equations of Lorenzen (1967).  C-PC was extracted into a 50 5 \nmmol L\n-1\n sodium phosphate buffer (pH 7.0) using probe ultrasonication (1 min in 15 s bursts) 6 \nand 9 consecutive freeze-thaw cycles (-80 to 4°C).  This is a modification of the method 7 \npresented in Sarada et al. (1999) and was used here to increase extraction efficiency.  The 8 \nextracts were clarified by centrifugation (10 min, 5000 x g) and C-PC was determined by 9 \nspectrophotometry using the equations of Bennett and Bogorad (1973).   10 \n 11 \n2.2.4. Microcystin (MC) analysis   12 \nMCs were analysed by enzyme-linked immunosorbent assay (ELISA) according to Metcalf et 13 \nal. (2000).  The procedure included polyclonal antibodies raised against the commonly-14 \noccurring MC structural variant, MC-LR, which show similar cross-reactivities with all other 15 \nMC variants tested, e.g. MC-LY, -LA and -LW.  The ELISA was calibrated with purified 16 \nMC-LR and MC concentrations expressed as microcystin-LR equivalents.  Environmental 17 \nsamples were analysed by ELISA either directly to determine extracellular (dissolved) MCs 18 \nonly, or after boiling in a waterbath at 100\no\nC for one minute to release MCs from the 19 \ncyanobacterial cells (Metcalf & Codd, 2000).  In the latter case, the MCs determined 20 \ncomprised the soluble (extracellular) plus particulate (intracellular) toxin pools (Metcalf and 21 \nCodd, 2000), and are termed “total microcystin”.  Analysis of all environmental samples for 22 \nMCs was performed in triplicate.      23 \n 24 \n2.3 Radiometric measurements 25 \n 14 \nRadiometric measurements were made concurrent to the airborne overflights so that the 1 \naccuracy of the atmospheric correction applied to the CASI-2 and AISA Eagle data could be 2 \nassessed.  Shipboard measurements of downwelling (Ed(0\n+,λ)) and water-leaving radiance 3 \n(Lw(0+,λ)) just above the water surface were collected at the sampling stations using an ASD 4 \nFieldSpec HandHeld VNIR (Analytical Spectral Devices Inc., Boulder, CO) spectrometer.  5 \nThe ASD FieldSpec instrument has a spectral interval of 1.4 nm and a full-width half 6 \nmaximum of 3 nm over the sampling range of 348-1074 nm.   7 \n 8 \nThe instrument was mounted on a telescopic pole that was extended over the side of the 9 \nvessel at 0.5 m above the water surface to ensure that measurements were not affected by 10 \nshadows cast by the boat.  The measurement geometry followed Mobley (1999) with spectra 11 \nacquired at an approximate viewing zenith angle = 42° and azimuth angle = 135° over solar 12 \nzenith angles = 42.1-58.1°.  This measurement geometry was used to minimise the 13 \ncontribution of sky radiance (Lsky(0+, )) to Lw(0+,λ) and because the spectra were collected 14 \nunder clear skies and over turbid water the skylight effect would have been largely limited to 15 \nthe blue wavelengths that were not utilised this study.  We therefore did not invoke a 16 \ncorrection for the skylight term.  Ed(0\n+,λ) was obtained from a calibrated Spectralon 17 \nreflectance panel.  Rrs(0\n+\n, ) was calculated as the ratio of Lw(0+,λ) to Ed(0\n+,λ). 18 \n 19 \n2.4 Remote sensing 20 \n2.4.1. Data acquisition 21 \nThe AISA Eagle and Hawk sensors were flown in tandem over Esthwaite Water and Loch 22 \nLeven on the 13 and 26 April, 2007.  CASI-2 was flown over Loch Leven on 22 August 23 \n2007.  The overflights occurred between 10:00 and 14:00 h Greenwich Mean Time under 24 \nclear skies.  The AISA Eagle is a 12-bit pushbroom sensor with a 1024 pixel swath width 25 \n 15 \n(field of view (FOV) = 39.7°) across 126 spectral pixels over the range 400-970 nm and a 2.9 1 \nnm spectral resolution.  The AISA Hawk is a 14-bit pushbroom hyperspectral sensor with a 2 \n320 pixel swath width (FOV = 24.0°) across 237 spectral pixels over the range 970-2450 nm 3 \nand an 8 nm spectral resolution.  CASI-2 is a fully-customisable 12-bit pushbroom sensor. 4 \nCASI-2 was operated in Spatial Mode providing a 512 pixel swath width (FOV = 54.4°) and 5 \n12 spectral pixels.  The channel configuration used for CASI-2 was optimised for the imaging 6 \nof Case 2 waters as described by Hunter et al. (2008b).   7 \n 8 \nThe sensors were flown on a Dornier 228-101 fixed wing airplane at an altitude between 9 \n2900-3200 m (above ground level) and at a ground speed of 135 knots (250 kph).  The 10 \nresulting AISA Eagle and Hawk imagery had spatial resolutions (at nadir) of between 2.0-2.1 11 \nm and 3.6-3.9 m respectively and the CASI-2 imagery had a spatial resolution of 12 \napproximately 6 m.  The imagery was flown in a south-to-north direction over Esthwaite and 13 \na southeast-to-northwest direction over Loch Leven to minimise sun glint effects.  Four 14 \nseparate flightlines with an overlap of approximately 30% were flown over Loch Leven and 15 \nmosaicked together to achieve full lake coverage.  The aircraft turn time between flightlines 16 \nwas typically less than 5 min. 17 \n 18 \n2.4.2. Geometric and atmospheric correction 19 \nThe airborne imagery was geometrically corrected for pitch, roll and yaw effects using the 20 \nazgcorr programme and geolocated using navigation data obtained by a differentiation global 21 \nposition system.  The individual AISA Eagle and Hawk bandsets were mosaicked together 22 \nusing coordinate based layer stacking.  The AISA Eagle and Hawk at-sensor radiances were 23 \natmospherically corrected to Rrs(0\n+\n, ) using the Fast Line-of-Sight Atmospheric Analysis of 24 \nSpectral Hypercubes (FLAASH) module in RSI ENVI (v.4.5).  FLAASH is a physics-based 25 \n 16 \natmospheric correction model developed by Spectral Sciences Incorporated (Alder-Golden et 1 \nal., 1999) and based upon the widely-used and well-validated MODTRAN4 (MODerate 2 \nresolution atmospheric TRANsmission) radiative transfer code.  FLAASH has been used 3 \nsuccessfully in previous research for the atmospheric correction of hyperspectral data 4 \n{Kutser, 2004; Cooley et al. 2002}. 5 \n 6 \nThe inputs into FLAASH comprised the altitude of the sensor, the ground elevation above sea 7 \nlevel, the pixel size of the imagery and the flight date and time.  The atmospheric model used 8 \nwas the MODTRAN4 Sub-Arctic.  The concentration of aerosols was retrieved on a pixel-by-9 \npixel basis according to the 2-band (K-T) method of Kaufman et al. (1997) using a rural 10 \nmodel and the AISA Hawk channels located at 660 and 2100 nm, and 420 and 800 nm.  11 \nWater vapour was retrieved pixel-by-pixel using the water absorption feature located at 1135 12 \nnm.  The AISA Eagle spectra were interpolated to a final resolution of 0.5 nm and the 13 \naccuracy of the atmospheric correction was assessed by checking for quantitative agreement 14 \nwith the Rrs(0\n+\n, ) spectra calculated from the in-situ radiometry.  The accuracy of the 15 \natmospheric correction was assessed on the basis of the root mean square error (RMSE). 16 \n 17 \nIt was not possible to correct the CASI-2 data using FLAASH because the sensor does not 18 \npossess channels in the near- and mid-infrared needed for aerosol and water vapour retrieval.  19 \nIn addition, because FLAASH only models the atmosphere for a single nadir looking 20 \ndirection, it does not account for the increase in path length that occurs in the cross-track 21 \ndirection for wide FOV sensors such as CASI-2.  We therefore used the empirical line 22 \ntechnique {Karpouzli and Malthus, 2003} to convert the CASI-2 at-sensor radiances to 23 \napproximate Rrs(0\n+\n, ). 24 \n 25 \n 17 \n2.5 Development and testing of inversion algorithms 1 \nWe tested the semi-analytical algorithms of Gons (1999) and Dall′Olmo et al. (2003) for the 2 \nretrieval of Chl a and of Simis et al. (2005), and a modified version of Dall′Olmo et al. 3 \n(2003), for the retrieval of C-PC.  The algorithms of Gons (1999) and Simis et al. (2005) 4 \nestimate the values of achl(665) and aCPC(620) respectively; the values for achl(665) and 5 \naCPC(620) were converted to pigment concentrations by dividing by the specific absorption 6 \ncoefficients for Chl a at 665 nm (0.0153 m\n-1\n) and C-PC at 620 nm (0.007 m\n-1\n) as given in 7 \nSimis et al. (2007).   8 \n 9 \nThe wavelengths used in the medium-independent algorithm developed by Dall′Olmo et al 10 \n(2003) can be spectrally-tuned to optimise Chl a retrieval.  In this study, we adopted the 11 \nparameterisation of the algorithm used by Gitelson et al. (2008) for MERIS-like sensors:  12 \n 13 \nChl a 23.1 117.4 {[Rrs\n-1(600 670) Rrs\n-1(700 730)] Rrs(740 760)}  \n (9) 14 \n 15 \nWe did not re-optimise the algorithm for the retrieval of Chl a so that we could test its ability 16 \nfor generalisation.   17 \n 18 \nIn addition, we adapted the algorithm of Dall′Olmo et al. (2003) for estimating C-PC.  Here, 19 \nit was necessary to optimise the wavelengths and coefficients used for C-PC retrieval.  This 20 \nwas achieved by initially setting λ1 = 620 nm (C-PC absorption maximum) and λ3 = 730 nm 21 \nand then regressing the model )7 3 0() ]λ()6 2 0([ r s2\n- 1\nr s\n- 1\nr s RRR against the measured 22 \nconcentration of C-PC for values of λ2 between 560 and 660 nm.  In the second iteration, λ2 23 \nwas set to 600 nm and then the model )λ() ]6 0 0()6 2 0([ 3r s\n- 1\nr s\n- 1\nr s RRR  was regressed against 24 \nthe measured concentrations of Chl a for values of λ3 between 700 and 775 nm.  In the final 25 \n 18 \niteration, λ3 was set to 725 nm and λ1 was optimised by regressing the model 1 \n)7 2 5() ]6 0 0()λ([ r s\n- 1\nr s1\n- 1\nr s RRR  against the measured concentrations of Chl a for values of λ1 2 \nbetween 610 and 630 nm.  This resulted in the following algorithm for C-PC retrieval: 3 \n 4 \n)725()]600()615([ CPC rs\n-1\nrs\n-1\nrs RRR     (10) 5 \n 6 \nThe wavelengths used in Eq. 10 differ somewhat from those originally employed for the 7 \nretrieval of C-PC by Hunter et al. (2008a) (λ1 = 630; λ2 = 660; λ3 = 750).  This is mostly 8 \nlikely because the Rrs(0+,λ) made in Hunter et al. (2008a) were made from laboratory  9 \ncultures of cyanobacteria. 10 \n 11 \nTo evaluate the performance of the algorithms proposed by Gons (1999), Simis et al. (2005) 12 \nand Dall′Olmo et al. (2003), we developed a number of semi-empirical algorithms for the 13 \nretrieval of Chl a and C-PC that were optimised for our study lakes.  We used the band-ratios 14 \n[Rrs(705):Rrs(670)] and [Rrs(705):Rrs(620)] for the estimation of Chl a and C-PC respectively 15 \nbecause these indices have been used effectively in previous research (Hunter et al., 2008b, 16 \n2009).  The semi-empirical algorithms were derived by regressing the band-ratios against the 17 \nmeasured concentrations of Chl a and C-PC.  In addition, we derived a further algorithm for 18 \nthe retrieval of C-PC by incorporating both the [Rrs(705):Rrs(620)] and [Rrs(705):Rrs(670)] 19 \nband-ratios in a multivariate regression model.  It was anticipated that this might provide a 20 \nrudimentary correction for the effect of Chl a absorption on the retrieval of C-PC.   21 \n 22 \nThe performance of the inversion algorithms was assessed on the basis of the coefficient of 23 \ndetermination (R\n2\n) and the root mean square error (RMSE) derived comparison with the 24 \nmeasured pigment concentrations.  Subsequently, the retrieved concentrations of Chl a and 25 \n 19 \nC-PC from the best-performing algorithms were compared to cyanobacterial cell counts and 1 \nmeasured MC concentrations by regression analysis. 2 \n 3 \n3. Results and discussion 4 \n3.1 Cyanobacterial cells, pigments and toxins 5 \nThe seasonal change in the abundance of cyanobacteria in Esthwaite Water and Loch Leven 6 \nis shown in Fig. 2 and a summary of the pigment and cell concentrations measured in the 7 \nlakes concurrent to the airborne overflights is presented in Table 2.  The AISA Eagle data 8 \ncollected over Loch Leven on 13 Apr coincided with the end of the spring diatom bloom and 9 \nthe beginning of the clear water phase.  The abundance of cyanobacteria at this time was very 10 \nlow (approximately 26 cells cm\n-3\n). The mean concentrations of Chl a and C-PC were 11 \nconsequently also low at 6.58 and 1.15 mg m\n-3\n respectively and C-PC:Chl a ratio was 0.175. 12 \n 13 \nThe AISA Eagle data acquired on 26 Apr over Esthwaite Water coincided with the early 14 \nstages of a bloom of the potentially-toxic cyanobacterium Anabaena circinalis.  The mean 15 \nconcentration of cyanobacteria measured in the lake on 26 Apr was approximately 18 767 16 \ncells cm\n-3\n, but this varied considerably among the various sampling stations.  The mean 17 \nconcentrations of Chl a and C-PC were 10.4 and 16.8 mg m\n-3\n respectively; the C-PC:Chl a 18 \nratio was 1.62 which suggests cyanobacterial dominance (Simis et al., 2005).   19 \n 20 \nThe CASI-2 flights over Loch Leven on 22 Aug also coincided with a cyanobacterial bloom: 21 \nin this instance co-dominated by Aphanothece spp., Woronichinia naegeliana and, to a lesser 22 \nextent, Microcystis aeruginosa.  The mean concentration of cyanobacteria on 22 Aug was 25 23 \n238 cells ml\n-1\n, but again this varied considerably between sampling stations.  The mean 24 \n 20 \nconcentrations of Chl a and C-PC were 36.3 and 68.9 mg m\n-3\n respectively and the C-PC:Chl 1 \na ratio was 1.90, which again strongly indicates cyanobacterial dominance. 2 \n 3 \nMicrocystins were detected by ELISA in both lakes (Fig. 3).  Confirmation of the toxins was 4 \nprovided by high performance liquid chromatography with photodiode array detection  5 \n(Metcalf et al., 2000). This yielded characteristic peaks (abs. max. 238 nm) of multiple MC 6 \nvariants (data not shown).  In all instances, the total concentration of MCs measured in the 7 \ntwo waterbodies exceeded the current guideline value of 1 mg m\n-3\n MC-LR in drinking water 8 \nestablished by the World Health Organisation (WHO) (WHO, 2002, 2003) and were thus of 9 \nsignificance for human health.  The lowest mean concentration of total MCs was measured in 10 \nLoch Leven on 13 Apr and the highest mean concentration was measured in the same lake 11 \nduring the cyanobacterial bloom on 22 Aug.  The MCs occurred in dissolved form in the 12 \nwater phase and in the cyanobacteria-containing particulate fraction.  The % distribution 13 \nbetween these pools varied widely (Fig. 3) from being almost entirely soluble (mean 94% : 14 \nLoch Leven, April) to being almost entirely particulate (mean 96% : Loch Leven, August).   15 \n 16 \nThis variability in MC compartmentation has implications for the use of remote sensing as a 17 \ntool for aiding risk assessment activities for human health protection.  It is not possible to 18 \ndetect dissolved MCs directly by remote sensing.  The concentration of cyanobacterial cells 19 \nwithin a MC-producing bloom can, however, be used as an indicator of potential MC 20 \nconcentrations.  The implicit assumptions are that (i) the MC pool is predominantly 21 \nintracellular and (ii) MC concentrations per cell are relatively uniform within and between 22 \nblooms.  If a substantial proportion of the total MC pool occurs in the soluble phase, or where 23 \nenvironmental conditions influence intracellular MC pool sizes, then it cannot necessarily be 24 \n 21 \nassumed that remotely sensed estimates of cyanobacterial cell biomass will provide a reliable 1 \nmeasure of bloom MC concentrations.   2 \n 3 \nThe largely extracellular proportion (ca. 94%) of the total MC pool detected in Loch Leven 4 \nmay have included an over-winter residual of the MCs released during the decline of the 5 \ncyanobacterial bloom in the previous autumn.  This possibility is raised because: (i) the 6 \nresidence time in Loch Leven is ca. 180 days (Table 1); (ii) although MCs are susceptible to 7 \nmicrobial degradation in water, biodegradation rates are temperature-dependent and minimal 8 \nin winter (Ward, 1999).  The very low concentrations of cyanobacterial cells and C-PC 9 \nmeasured in Esthwaite on 13 Apr would therefore not have provided a sentinel indication of 10 \npotential risks to health because of this dissolved MC pool.    11 \n 12 \n3.2 Atmospheric correction 13 \nThe AISA Eagle Rrs(0\n+,λ) spectra calculated by the FLAASH atmospheric correction model 14 \nwere realistic for Case 2 waters in terms of their shape and magnitude and they demonstrated 15 \na reasonable level of correspondence with the in-situ Rrs(0\n+,λ) spectra.  The Rrs(0\n+,λ) 16 \nspectrum calculated by FLAASH and that measured near to Station 01 on Esthwaite Water 17 \nduring the overflights on 26 Apr is shown in Fig. 4.  The shape of the Rrs(0\n+,λ) spectrum 18 \ncalculated by FLAASH closely resembles that measured in-situ and the reflectance troughs 19 \nassociated with the Chl a and C-PC absorption peaks have been clearly preserved.  Moreover, 20 \nthe FLAASH calculated spectrum mainly lies within the 95% confidence interval for mean 21 \nin-situ Rrs(0\n+,λ). 22 \n 23 \nThe RMSE of Rrs(0\n+,λ) calculated by FLAASH from the AISA Eagle data for all stations on 24 \nLoch Leven on 13 Apr ranged from 0.0048 to 0.0168 (400 to 800 nm) (equating to a 25 \n 22 \nRMSE(%) of between 26.4 and 77.7%).  The RMSE on the values of Rrs(0\n+,λ) calculated by 1 \nFLAASH from the AISA Eagle data from Esthwaite Water on 26 Apr ranged from 0.00369 2 \nto 0.0114 (400 to 800 nm) (equating to a RMSE(%) of between 19.7 and 141.9%).   3 \n 4 \nCorrespondence between reflectance measured in-situ and from the aircraft was strongly 5 \nwavelength-dependent and generally strongest in the green, red and on the NIR shoulder 6 \n(520-720 nm) and poorest in the blue (<500 nm) and at NIR wavelengths beyond 750 nm.  7 \nThe relatively large uncertainties observed in the blue region were partly due to the poorer 8 \nradiometric calibration of the AISA Eagle sensor and strong aerosol and water vapour 9 \nscattering.  The degree of correspondence also deteriorated significantly with the time 10 \nelapsed between the overflights and the in-situ sampling (Fig. 5). 11 \n 12 \nThe empirical line correction applied to the CASI-2 data yielded coefficients of determination 13 \nfor the regression equations between R\n2\n = 0.76 and 0.99 for the 13 channels (see Table 3).  14 \nThe accuracy of empirical line correction was generally better for the channels centred at red 15 \nand near-infrared wavelengths used in the semi-empirical and semi-analytical algorithms 16 \npigment retrieval (R\n2\n = 0.86-0.98).   17 \n 18 \n3.3 Retrieval of Chl a 19 \nThe relationship between the measured concentrations of Chl a and the [Rrs(710):Rrs(670)] 20 \nband-ratio was strongly non-linear.  The two best-performing semi-empirical algorithms for 21 \nthe retrieval of Chl a were derived using quadratic functions of the [Rrs(710):Rrs(670)] band-22 \nratio.  The inversion algorithm employing the decadic log of Chl a as the response variable 23 \nprovided the marginally better estimation (R\n2\n = 0.856; RMSE = 5.29 mg m\n-3\n) (see Table 4).  24 \nThis algorithm markedly outperformed the semi-empirical algorithms based upon linear 25 \n 23 \nfunctions of [Rrs(710):Rrs(670)] and also performed better than the semi-analytical algorithm 1 \nof Dall'Olmo et al. (2003).   2 \n 3 \nThe Dall'Olmo et al. (2003) algorithm did provide reasonable estimates of Chl a when 4 \napplied to the data acquired over Esthwaite Water on 26 Apr and the CASI-2 data acquired 5 \nover Loch Leven on 22 Aug (R\n2\n = 0.796; RMSE = 9.92 mg m\n-3\n (44.5%)).  However, the 6 \nalgorithm greatly underestimated the concentrations of Chl a measured in Loch Leven on 13 7 \nApr (R\n2\n = 0.019; RMSE = 35.6 mg m\n-3\n (541%)).  The reasons for this are not entirely clear.  8 \nThe algorithm is not based upon a ratio of Rrs( ,0+) and is thus likely to be more sensitive to 9 \nshifts in the amplitude of the water-leaving signal.  The comparatively low phytoplankton 10 \nbiomass in Loch Leven in early April would certainly have enhanced the contributions from 11 \nnon-phytoplankton particles and bottom reflectance to the water-leaving signal.  In addition, 12 \nthe atmospheric correction of the AISA Eagle data from 13 Apr was poorer than that 13 \nachieved for the other datasets.  These factors could have produced shifts in spectral 14 \namplitude sufficient to impair algorithm performance. 15 \n 16 \nThe ac h l(665)\n values retrieved using the algorithm of Gons (1999) were very strongly 17 \ncorrelated with the measured concentrations of Chl a (R\n2\n = 0.879) (see Fig. 6).  However, the 18 \nalgorithm tended to overestimate the actual concentrations of Chl a and consequently the 19 \nRMSE was larger (22.6 mg m\n-3\n) than that returned by the best-performing semi-empirical 20 \nalgorithm.  The over-estimation of Chl a by the Gons (1999) algorithm might have been the 21 \nresult of using an inappropriate value of ac h l\n*(6 6 5) , rather than errors in the estimation of 22 \nac h l(665)\n.  We did not determine ac h l\n*(6 6 5)  in this study.  Instead, we used the value measured 23 \nby Simis et al. (2005).  However, ac h l\n* ( ) can vary in response to changes in pigment 24 \ncomposition and packaging, which is similarly dependent on the physiological status, size 25 \n 24 \nspectra and floristic composition of the phytoplankton community (Bricaud et al., 1995, , 1 \n2004). 2 \n 3 \nSimis et al. (2005) found that ac h l\n*(6 6 5)  varied between 0.0138 and 0.0203 m\n-1\n in Lake 4 \nIjsselmeer in the Netherlands.  The substitution of ac h l\n*(6 6 5)  = 0.0203 m\n-1\n into the Gons 5 \n(1999) algorithm was sufficient to reduce the RMSE for the estimation of Chl a in Eshtwaite 6 \nWater and Loch Leven to 11.9 mg m\n-3\n (41.4%).  This not only emphasises the extent to which 7 \nac h l\n* ( ) can vary, but also why it is important to make rigorous measurements of the specific 8 \ninherent optical properties of waterbodies so that analytically-based algorithms can be 9 \nproperly parameterised for constituent retrieval.  There is a clear need for more detailed 10 \nstudies of the inherent optical properties of inland waterbodies to support algorithm 11 \ndevelopment and testing. 12 \n 13 \nThis issue notwithstanding, the  coefficients estimated by the semi-analytical 14 \nalgorithm of Gons (1999) were as strongly correlated with the measured concentrations of 15 \nChl a as the band-ratios employed in the semi-empirical inversion algorithms.  This is 16 \nperhaps somewhat surprising given that the semi-empirical algorithms were optimised using 17 \nthese specific datasets.  It is considered that semi-analytical algorithms are more transferable 18 \nacross different water types.  The fact that the accuracy of the semi-analytical algorithms is 19 \nshown here to be comparable to that achievable with optimised semi-empirical models 20 \nmerely strengthens the case for the wider use of analytical approaches for the retrieval of in-21 \nwater constituents.  However, while analytical algorithms are widely used for Chl a retrieval 22 \nin coastal and ocean waters, they have yet to be widely tested in inland waters.  This is a clear 23 \npriority for future research. 24 \n 25 \n 25 \n3.4 Retrieval of C-PC 1 \nThe best performing semi-empirical algorithm for the retrieval of C-PC was developed using 2 \na quadratic model based on the [Rrs(710):Rrs(620)] band-ratio (R\n2\n = 0.982; RMSE = 4.00 mg 3 \nm\n-3\n (13.8%)) (Table 5).  However, all the semi-empirical algorithms for the retrieval of C-PC 4 \nreturned estimates of C-PC with R\n2\n values >0.86 and RMSEs <10.5 mg m\n-3\n.  Interestingly, 5 \nthe multivariate regression model incorporating both the [Rrs(710):Rrs(620)] and 6 \n[Rrs(710):Rrs(670)] band-ratios provided a better estimation of C-PC (R\n2\n adj. = 0.935; RMSE 7 \n= 7.13 (24.6)) than the model using only the [Rrs(710):Rrs(620)] band-ratio (R\n2\n = 0.907; 8 \nRMSE = 9.22 (31.8)).  This suggests that the incorporation of the [Rrs(710):Rrs(670)] band-9 \nratio was partly effective in providing a rudimentary correction for Chl a absorption at 620 10 \nnm.  However, clearly it might not be possible to generalise this type of empirical correction 11 \nto other waterbodies beyond those considered here.  12 \n 13 \nThe values of aCPC(620) estimated by the algorithm of Simis et al. (2005) were strongly 14 \ncorrelated with the measured concentration of C-PC (R\n2\n = 0.984) and the resulting 15 \nconcentrations of C-PC derived from these coefficients also demonstrated a near 1:1 16 \nrelationship with measured C-PC values (RMSE = 3.98 mg m\n-3\n (13.7%)) ( Fig. 6).  The 17 \naccuracy of C-PC retrieval provided by the Simis et al. (2005) algorithm was superior to that 18 \nachieved by the semi-empirical inversion algorithms.   19 \n 20 \nThe semi-analytical algorithm based upon the model proposed by Dall'Olmo et al. (2003) for 21 \nthe retrieval of Chl a also performed strongly (R\n2\n = 0.921; RMSE = 2.65 mg m\n-3\n (9.15%)) 22 \nwhen applied to the dataset collected over Loch Leven on 13 Apr and Esthwaite Water on 26 23 \nApr. We could not apply this algorithm to the CASI-2 dataset acquired over Loch Leven on 24 \n22 Aug because of the incompatible channel configuration.  The Simis et al. (2005) algorithm 25 \n 26 \nwas not particularly sensitive to the uncertainties in atmospheric correction in spite of the fact 1 \nthat it uses an absolute value of Rrs(0+, ) to estimate the bb(779) coefficient and has 2 \npreviously been shown to be sensitive to shifts in spectral amplitude (Ruiz-Verdu et al., 3 \n2008).  However, it is likely that the any errors in the estimation of bb(779) are relatively 4 \ninsignificant at high C-PC concentrations. 5 \n 6 \nThe superior performance of the Simis et al. (2005) algorithm is almost certainly attributable 7 \nto the fact that it corrects for the contribution of Chl a to absorption at 620 nm.  The relative 8 \ncontribution of Chl a to absorption at 620 nm is obviously strongly dependent on the floristic 9 \ncomposition of the phytoplankton community and, more specifically, on the abundance of 10 \ncyanobacteria containing C-PC.  The relative contribution of Chl a to total pigment 11 \nabsorption at 620 nm can thus be expected to be inversely proportional to C-PC:Chl a.  The 12 \ncontribution of Chl a is relatively insignificant in waters with high C-PC:Chl a ratios.  13 \nHowever, in waters with low C-PC:Chl a ratios, the increased contribution of Chl a to total 14 \nabsorption at 620 nm is known to lead to errors on the estimation of C-PC (Simis et al., 15 \n2007).  We found that the value of the relative residuals increases significantly at C-PC:Chl a 16 \n≤ 0.5 (Fig. 7), in agreement with findings reported elsewhere (Ruiz-Verdu et al., 2008; 17 \nRandolph et al., 2008; Hunter et al., 2008b).   18 \n 19 \nThe cell counts made at Esthwaite Water and Loch Leven suggest that C-PC:Chl a = 0.5 is 20 \napproximately equivalent to 6500 cells ml\n-1\n.  Importantly, this cell concentration is below the 21 \nWHO health guidance values for cyanobacteria cell numbers in recreational waters.  This is 22 \nsignificant because it suggests that this algorithm (and the best-performing semi-empirical 23 \nalgorithms) can detect cyanobacterial cells at concentrations significantly below those at 24 \nwhich they would typically pose risks to human health by recreational contact and ingestion.  25 \n 27 \nThis emphasises the fact that remote sensing has the potential to provide early-warnings of 1 \ncyanobacterial bloom development (Hunter et al., 2009).   2 \n 3 \n3.5 Comparisons between cyanobacterial cells, pigments and microcystins 4 \nThe C-PC estimates retrieved using the algorithm of Simis et al. (2005) were weakly, but 5 \nsignificantly, related to the concentration of cyanobacterial cells (R\n2\n = 0.380; p = 0.014) (Fig. 6 \n8a).  The retrieved concentrations of C-PC were also significantly correlated with 7 \ncyanobacterial biovolume as measured in the samples from Loch Leven (R\n2\n = 0.483; p = 8 \n0.026) (no biovolume estimates were available for Esthwaite Water).  The retrieved estimates 9 \nof Chl a were not significantly correlated with either cyanobacterial cell numbers or 10 \nbiovolume. 11 \n 12 \nThe relationship between cyanobacterial cell concentration and that of the C-PC biomarker 13 \npigment was notably weaker than those previously reported elsewhere (e.g. Brient et al., 14 \n2008; Randolph et al., 2008).  It is possible that some of the scatter in this relationship might 15 \nbe simply explained by the uncertainties inherent in microscopic cell counts.  However, the 16 \nintracellular concentration of C-PC is also known to be strongly dependent upon irradiance 17 \nand the supply of fixed nitrogen (Fogg et al., 1973; Jiang & Qiu, 2005; Raps et al., 1983).  18 \nThe relationship between cell and C-PC concentrations measured in the water column is 19 \ntherefore likely to vary in response to seasonal patterns in both light and nutrient supply. 20 \n 21 \nIntriguingly, in our case the majority of the scatter observed in the relationship between cell 22 \nnumbers and C-PC concentration was the result of within-lake spatial variation rather than 23 \nseasonal (or between-lake) variation.  This implies that C-PC cell quotas were highly variable 24 \nwithin the individual blooms.  This variability might reflect differences in water depth and 25 \n 28 \ncirculation among the sampling stations which in turn is likely to have influenced the light 1 \nhistory (in terms of quality and quantity) of the cyanobacterial cells.  That is, positively 2 \nbuoyant cells stationed in shallow waters might have experienced significantly higher 3 \nirradiances compared to cells entrained within deeper vertically mixing waters.   4 \n 5 \nHeterogeneity in the species composition of the blooms might also have contributed to scatter 6 \nin the cell-pigment relationship.  Phycobiliprotein cell quotas can vary markedly across 7 \ndifferent cyanobacteria (e.g. Patel et al., 2005).  This is likely to cause variability in the 8 \nassociation between the concentrations of cells and pigments in the water column where 9 \nspatial distribution of species is not uniform.  This is particularly likely to occur where 10 \nblooms are composed of both buoyancy-regulating and non-buoyancy-regulating species.   11 \n 12 \nThe Loch Leven bloom on 22 Aug contained both buoyancy-regulating (Microcystis, 13 \nWoronichinia) and non-buoyancy-regulating genera (Aphanothece).  These differing traits 14 \nmight have led to variability in their distribution throughout Loch Leven and consequently 15 \ninfluenced the correlation between cell numbers and pigment concentrations.  That said, the 16 \nbloom on Esthwaite Water on 22 Apr was almost entirely dominated by Anabaena: thus 17 \nvariability in species composition cannot be used to explain the lack of a strong correlation 18 \nbetween cells and pigments in this instance. 19 \n 20 \nThe relationship between the concentration of cyanobacterial cells and total MCs was also 21 \nweak and only just significant (R\n2\n = 0.251; p = 0.057).  This can be partly explained by the 22 \nfact that MC production is influenced to some extent by nutrient supply and environmental 23 \nconditions.  Cellular MC content has been shown to correlate positively with nutrient supply 24 \nand to decrease at high irradiances (Rapala et al., 1997; Wiedner et al., 2003).  The accessory 25 \n 29 \nphycobiliproteins and MCs thus appear to respond in similar ways to variations in resource 1 \nsupply.  Therefore, it is perhaps not surprising that the retrieved concentrations of C-PC in 2 \nEsthwaite Water and Loch Leven were very strongly correlated with the concentrations of 3 \nparticulate (R\n2\n = 0.906; p = <0.0005) and total MCs (R\n2\n = 0.896; p = <0.0005) (Fig. 8b).  4 \nStrong correlations between the phycobiliprotein and MC content of cyanobacteria have also 5 \nbeen reported elsewhere (e.g. Izydorczyk et al., 2005).  Chl a was less strongly correlated 6 \nwith total MCs (R\n2\n = 0.665; p = <0.0005).  These observations imply that the C-PC content 7 \nof cells might provide a crude measure of bloom MC content (assuming that MC-producing 8 \nstrains are present).   9 \n 10 \n3.6 Monitoring cyanobacterial populations in lakes 11 \nInformation on the presence and abundance of cyanobacteria in lakes is needed to (i) feed 12 \ninto local, regional and national monitoring activities such as those required under the EU 13 \nWFD; (ii) provide intelligence to support risk assessment activities to protect human health 14 \nfrom toxin-producing blooms; (iii) provide essential information on ecosystem processes and 15 \nfunction.  However, standard lake monitoring programmes are currently constrained by an 16 \ninability to obtain this information at high spatial and temporal resolutions.  Sampling at a 17 \nsingle or a small number of stations will rarely provide a representative estimate of 18 \ncyanobacterial abundance where blooms are distributed patchily across lakes.  Moreover, 19 \nsince blooms can increase and decrease over relatively short time scales (e.g., days to weeks), 20 \nsamples collected on a fortnightly or monthly basis are unlikely to trace the underlying 21 \ndynamism of cyanobacterial populations in lakes. 22 \n 23 \nMounting concerns about the pressures impacting aquatic ecosystems mean that the 24 \ndevelopment of more effective and efficient monitoring systems is becoming an ever-25 \n 30 \nincreasing priority.  In Europe, the WFD has placed an increased burden on those agencies 1 \nresponsible for monitoring, assessing and managing the ecological status of Europe’s surface 2 \nwaters.  The metrics being considered for the assessment of lake ecological status include Chl 3 \na concentration and cyanobacterial biomass.  It has been widely shown that Chl a can be 4 \nestimated relatively reliably in inland waters using remotely sensed data (Kutser, 2004; Tyler 5 \net al., 2006; Gons et al., 2008).  This study and others also now show that cyanobacterial 6 \nbiomass estimation by remote sensing is achievable (Simis et al., 2007; Ruiz-Verdu et al., 7 \n2008; Randolph et al., 2008).   Remote sensing-based estimates of phytoplankton biomass 8 \ncould thus strongly contribute to regulatory monitoring of surface water ecological status 9 \nunder the WFD, although operational capability is currently restricted to larger lake systems 10 \nobservable from ocean colour platforms. 11 \n 12 \nThe remotely-sensed estimation of cyanobacterial biomass could also be used to support 13 \nhazard recognition and risk assessments activities for the protection of human and animal 14 \nhealth.  It has been shown that remotely sensed information can be integrated with existing 15 \nalert monitoring protocols such as the WHO guideline levels (GLs) for recreational waters to 16 \naid the assessment of human health risks (Hunter et al., 2009).  The WHO GLs for 17 \nrecreational waters indicate that cyanobacterial cell concentrations of  ≥ 20 000 and ≥ 100 18 \n000 cells ml\n-1\n equate to low and moderate risks respectively of adverse health effects in 19 \nhumans,  while the presence of cyanobacterial scums is considered to pose the highest risks to 20 \nhuman health.  Significantly, we have demonstrated that cyanobacterial populations can be 21 \ndetected using remote sensing at levels well below those currently used to provide human 22 \nhealth warnings.  The use of remote sensing platforms for the early-warning of cyanobacterial 23 \nblooms in lakes and other waterbodies for health protection would therefore seem to be 24 \nfeasible. 25 \n 31 \n 1 \nThe value of using remotely sensed imagery to map cyanobacterial populations and provide 2 \nintelligence for health protection is clearly shown in Figs. 9 and 10.  These mapped C-PC 3 \nimage products show that the distribution of cyanobacterial cells in Esthwaite Water and 4 \nLoch Leven was very patchy with thick surface scums clearly visible on both lakes.  This 5 \npatchiness was almost certainly caused by buoyant cyanobactria becoming entrained within 6 \nadvective currents and massing as scums on windward shorelines (Hunter et al., 2008b).  The 7 \nheterogeneous and transient nature of these scums complicates their detection in the field and 8 \nthis can affect the assessment of health risks.   9 \n 10 \nIn spite of the fact that thick scums had formed elsewhere on both lakes, cyanobacterial cell 11 \nconcentrations in the water samples collected from the sampling stations on Esthwaite Water 12 \nand Loch Leven never exceeded 100 000 cells per ml (i.e. the WHO GL for moderate risk).  13 \nHowever, the scums recognised in the AISA Eagle and CASI-2 imagery are evidence of 14 \nmuch greater risks to human health.  This is also supported by the measured concentrations of 15 \nMCs in these waterbodies.  This highlights the extent to which limited sampling at discrete 16 \nstations in a heterogeneous waterbody may provide inadequate warning of the risks to health.   17 \n 18 \nSpatially synoptic intelligence provided by remote sensing platforms, particularly with the 19 \npossibility of near real-time reporting, may overcome the limitations of heterogeneity and 20 \npoint sampling (cloud cover permitting).  Indeed, the next generation of high spatial and 21 \nspectral resolution satellite-based imaging spectrometers, such as the German-led 22 \nEnvironmental Mapping and Analysis Program (EnMAP), will offer new opportunities for 23 \nmonitoring phytoplankton populations in much smaller waterbodies.   24 \n 25 \nEnMAP \nref. \navailable ? \n 32 \nThe inversion algorithms currently used for the retrieval of constituent concentrations in Case 1 \n2 waters were designed primarily for application with multispectral ocean colour sensors.  To 2 \nexploit fully the hyperspectral capabilities of the new generation of spaceborne imaging 3 \nspectrometers it will be necessary to develop new and better approaches to the inversion of 4 \nwater-leaving optical signals.  In this respect, there is clearly a need for further work on the 5 \ndevelopment and testing of inversion algorithms for inland (and coastal) Case 2 type waters. 6 \n 7 \n4. Conclusions 8 \nThe accuracy of different semi-empirical and semi-analytical inversion algorithms for the 9 \nretrieval of Chl a and C-PC was examined using high-resolution and multi-temporal AISA 10 \nEagle and CASI-2 imagery from two shallow lakes in the UK.  The best performing 11 \nalgorithm for the retrieval of Chl a was a nonlinear semi-empirical model.  The absorption 12 \ncoefficients returned by the semi-analytical algorithm of Gons (1999) were also strongly 13 \ncorrelated with the measured pigment concentrations, but the actual retrieved pigment 14 \nconcentrations were subject to significant errors.  These were mostly likely due to variability 15 \nin the specific absorption coefficient of chlorophyll and as such the algorithm could easily be 16 \nmodified to reduce these uncertainties.  The best performing inversion algorithm for the 17 \nretrieval of C-PC was the semi-analytical nested band ratio algorithm of Simis et al. (2005).  18 \nThe absorption coefficients and actual C-PC concentrations returned by this algorithm were 19 \nstrongly correlated with those measured in the water samples collected from the lake.  These 20 \nresults demonstrate that the performance of analytically-based algorithms is equal or superior 21 \nto that of widely used semi-empirical approaches.  The greater transferability of the analytical 22 \nmodels also makes them better suited to regional or global scale monitoring of phytoplankton 23 \npigments in lakes.  These results strongly suggest that remotely sensed data might contribute 24 \nsignificantly to the proactive and regulatory monitoring of lakes. 25 \n 33 \n 1 \nThe concentrations of C-PC retrieved using the semi-analytical nested band ratio algorithm 2 \nwere correlated (albeit weakly) with cyanobacterial cell numbers and biovolume.  Very 3 \nstrong correlations were observed between the estimated C-PC concentrations and the 4 \nmeasured concentration of MCs.  This implies that C-PC concentrations retrieved from 5 \nremotely sensed data might provide a useful indication of the potential risks to human health.  6 \nThe ability to map cyanobacterial populations at a synoptic scale and recognise the presence 7 \nof hazardous surface scums is a clear advantage of utilising remotely sensed imagery in this 8 \ncontext.  This study demonstrated that cyanobacterial populations can be detected using 9 \nremote sensing at concentrations well below those of human health significance.  This 10 \nsuggests that remote sensing platforms can contribute to the early-warning monitoring of 11 \ncyanobacterial populations for human health protection. 12 \n 13 \nAcknowledgements 14 \nThis research was funded by a grant from the UK Natural Environmental Research Council 15 \n(NERC) under the Environment and Human Health programme (NE\/E009328\/1).  AISA 16 \nEagle and Hawk and CASI-2 data were acquired by NERC’s Airborne Research and Survey 17 \nFacility and preliminary processing was conducted by the Data Analysis Node of NERC’s 18 \nEarth Observation Data Acquisition and Analysis Service at the Plymouth Marine 19 \nLaboratory.  The Freshwater Biological Association generously provided boat access at 20 \nEsthwaite Water.  Kinross Estates kindly provided access to Loch Leven.  We thank Bryan 21 \nSpears, Jack Kelly and Ben James for assisting with fieldwork and Marianne Reilly for 22 \nmicrocystin analyses. 23 \n 24 \nReferences 25 \n 34 \nAlder-Golden, S. M., Matthew, M. W., Bernstein, L. S., Levine, R. Y., Berk, A., Richtsmeier, 1 \nS. C., Acharya, P. K., Anderson, G. P., Felde, G., Gardner, J., Hoke, M., Jeong, L. S., 2 \nPukall, B., Ratkowski, A., & Burke, H.-H. (1999). Atmospheric correction for short-3 \nwave spectral imagery based on MODTRAN4. SPIE Proceedings on Imaging 4 \nSpectrometry, 3753, 61-69. 5 \nAlikas, K. & Reinart, A. (2008). Validation of the MERIS products on large European lakes: 6 \nPeipsi, Vanern and Vattern. Hydrobiologia, 599, 161-168. 7 \nBennett, A. & Bogorad, L. (1973). Complementary chromatic adaptation in a filamentous 8 \nblue-green-alga. Journal of Cell Biology, 58, 419-435. 9 \nBricaud, A., Babin, M., Morel, A., & Claustre, H. (1995). Variability in the chlorophyll-10 \nspecific absorption-coefficients of natural phytoplankton - analysis and 11 \nparameterization. Journal of Geophysical Research-Oceans, 100, 13321-13332. 12 \nBricaud, A., Claustre, H., Ras, J., & Oubelkheir, K. (2004). Natural variability of 13 \nphytoplanktonic absorption in oceanic waters: Influence of the size structure of algal 14 \npopulations. Journal of Geophysical Research-Oceans, 109. 15 \nBrient, L., Lengronne, M., Bertrand, E., Rolland, D., Sipel, A., Steinmann, D., Baudin, I., 16 \nLegeas, M., Le Rouzic, B., & Bormans, M. (2008). A phycocyanin probe as a tool for 17 \nmonitoring cyanobacteria in freshwater bodies. Journal of Environmental Monitoring, 18 \n10, 248-255. 19 \nBrierley, B., Carvalho, L., Davies, S., & Krokowski, J. (2007). Guidance on the quantitative 20 \nanalysis of phytoplankton in freshwater samples. In Phytoplankton Classification Tool 21 \n(Phase 2). Final Report to SNIFFER (pp. 63-88). Edinburgh: SNIFFER. 22 \n 35 \nBuiteveld, H., Hakvoort, J. H. M., & Donze, M. (1994). The optical properties of pure water. 1 \nOcean Optics XII, 2258, 174-183. 2 \nCarmichael, W. W., Azevedo, S. M. F. O., An, J. S., Molica, R. J. R., Jochimsen, E. M., Lau, 3 \nS., Rinehart, K. L., Shaw, G. R., & Eaglesham, G. K. (2001). Human fatalities from 4 \ncyanobacteria: Chemical and biological evidence for cyanotoxins. Environmental 5 \nHealth Perspectives, 109, 663-668. 6 \nCarvalho, L. & Kirika, A. (2003). Changes in shallow lake functioning: response to climate 7 \nchange and nutrient reduction. Hydrobiologia, 506, 789-796. 8 \nCodd, G. A., Azevedo, S. M. F. O., Bagchi, S. N., Burch, M. D., Carmichael, W. W., 9 \nHarding, W. R. et al. (2005a). CyanoNet: A global network for cyanobacterial bloom 10 \nand toxin risk management. International Hydrologolical Programme. Initial 11 \nsituation assessment and recommendations. (Rep. No. 76). UNESCO, Paris. 12 \nCodd, G. A., Metcalf, J. S., & Beattie, K. A. (1999). Retention of Microcystis aeruginosa and 13 \nmicrocystin by salad lettuce (Lactuca sativa) after spray irrigation with water 14 \ncontaining cyanobacteria. Toxicon, 37, 1181-1185. 15 \nCodd, G. A., Morrison, L. F., & Metcalf, J. S. (2005b). Cyanobacterial toxins: risk 16 \nmanagement for health protection. Toxicology and Applied Pharmacology, 203, 264-17 \n272. 18 \nDall'Olmo, G. & Gitelson, A. A. (2005). Effect of bio-optical parameter variability on the 19 \nremote estimation of chlorophyll-a concentration in turbid productive waters: 20 \nexperimental results. Applied Optics, 44, 412-422. 21 \n 36 \nDall'Olmo, G. & Gitelson, A. A. (2006). Effect of bio-optical parameter variability and 1 \nuncertainties in reflectance measurements on the remote estimation of chlorophyll-a 2 \nconcentration in turbid productive waters: modeling results. Applied Optics, 45, 3577-3 \n3592. 4 \nDall'Olmo, G., Gitelson, A. A., & Rundquist, D. C. (2003). Towards a unified approach for 5 \nremote estimation of chlorophyll-a in both terrestrial vegetation and turbid productive 6 \nwaters. Geophysical Research Letters, 30. 7 \nDekker, A. G. (1993). Hyperspectral Remote Sensing of Inland Water Quality. The 8 \nNetherlands: Vrije University, Amsterdam. 9 \nFerguson, C. A., Carvalho, L., Scott, E. M., Bowman, A. W., & Kirika, A. (2008). Assessing 10 \necological responses to environmental change using statistical models. Journal of 11 \nApplied Ecology, 45, 193-203. 12 \nFogg, G. E., Stewart, W. D. P., Fay, P., & Walsby, A. E. (1973). The Blue-Green Algae. 13 \nLondon and New York: Academic Press. 14 \nGitelson, A. A., Dall'Olmo, G., Moses, W., Rundquist, D. C., Barrow, T., Fisher, T. R., 15 \nGurlin, D., & Holz, J. (2008). A simple semi-analytical model for remote estimation 16 \nof chlorophyll-a in turbid waters: Validation. Remote Sensing of Environment, 112, 17 \n3582-3593. 18 \nGitelson, A. A., Vina, A., Verma, S. B., Rundquist, D. C., Arkebauer, T. J., Keydan, G., 19 \nLeavitt, B., Ciganda, V., Burba, G. G., & Suyker, A. E. (2006). Relationship between 20 \ngross primary production and chlorophyll content in crops: Implications for the 21 \nsynoptic monitoring of vegetation productivity. Journal of Geophysical Research-22 \nAtmospheres, 111. 23 \n 37 \nGons, H. J. (1999). Optical teledetection of chlorophyll a in turbid inland waters. 1 \nEnvironmental Science & Technology, 33, 1127-1132. 2 \nGons, H. J., Auer, M. T., & Effler, S. W. (2008). MERIS satellite chlorophyll mapping of 3 \noligotrophic and eutrophic waters in the Laurentian Great Lakes. Remote Sensing of 4 \nEnvironment, 112, 4098-4106. 5 \nGordon, H. R., Brown, O. B., & Jacobs, M. M. (1975). Computed relationships between 6 \ninherent and apparent optical properties of a flat homogeneous ocean. Applied Optics, 7 \n14, 417-427. 8 \nHavens, K. E. (2008). Cyanobacterial blooms: effects on aquatic ecosystems. In H.K.Hudnell 9 \n(Ed.), Cyanobacterial Harmful Algal Blooms: State of the Science and Research 10 \nNeeds (pp. 733-747). Berlin: Springer-Verlag. 11 \nHillebrand, H., Durselen, C. D., Kirschtel, D., Pollingher, U., & Zohary, T. (1999). 12 \nBiovolume calculation for pelagic and benthic microalgae. Journal of Phycology, 35, 13 \n403-424. 14 \nHunter, P. D., Tyler, A. N., Gilvear, D. J., & Willby, N. J. (2009). Using remote sensing to 15 \naid the assessment of human health risks from blooms of potentially-toxic 16 \ncyanobacteria. Environmental Science & Technology, 43, 2627-2633. 17 \nHunter, P. D., Tyler, A. N., Presing, M., Kovacs, A. W., & Preston, T. (2008a). Spectral 18 \ndiscrimination of phytoplankton colour groups: The effect of suspended particulate 19 \nmatter and sensor spectral resolution. Remote Sensing of Environment, 112, 1527-20 \n1544. 21 \n 38 \nHunter, P. D., Tyler, A. N., Willby, N. J., & Gilvear, D. J. (2008b). The spatial dynamics of 1 \nvertical migration by Microcystis aeruginosa in a eutrophic shallow lake: A case 2 \nstudy using high spatial resolution time-series airborne remote sensing. Limnology 3 \nand Oceanography, 53, 2391-2406. 4 \nIzydorczyk, K., Tarczynska, M., Jurczak, T., Mrowczynski, J., & Zalewski, M. (2005). 5 \nMeasurement of phycocyanin fluorescence as an online early warning system for 6 \ncyanobacteria in reservoir intake water. Environmental Toxicology, 20, 425-430. 7 \nJiang, H. B. & Qiu, B. S. (2005). Photosynthetic adaptation of a bloom-forming 8 \ncyanobacterium Microcystis aeruginosa (Cyanophyceae) to prolonged UV-B 9 \nexposure. Journal of Phycology, 41, 983-992. 10 \nJohn, D. M., Whitton, B. A., & Brook, A. J. (2003). The freshwater algal flora of the British 11 \nIsles: an identification guide to freshwater and terrestrial algae. Cambridge: 12 \nCambridge University Press. 13 \nJohnk, K. D., Huisman, J., Sharples, J., Sommeijer, B., Visser, P. M., & Stroom, J. M. 14 \n(2008). Summer heatwaves promote blooms of harmful cyanobacteria. Global 15 \nChange Biology, 14, 495-512. 16 \nKaufman, Y. J., Wald, A. E., Remer, L. A., Gao, B. C., Li, R. R., & Flynn, L. (1997). The 17 \nMODIS 2.1-mu m channel - Correlation with visible reflectance for use in remote 18 \nsensing of aerosol. IEEE Transactions on Geoscience and Remote Sensing, 35, 1286-19 \n1298. 20 \nKutser, T. (2004). Quantitative detection of chlorophyll in cyanobacterial blooms by satellite 21 \nremote sensing. Limnology and Oceanography, 49, 2179-2189. 22 \n 39 \nKutser, T. (2009). Passive optical remote sensing of cyanobacteria and other intense 1 \nphytoplankton blooms in coastal and inland waters. International Journal of Remote 2 \nSensing, 30, 4401-4425. 3 \nKutser, T., Metsamaa, L., Strombeck, N., & Vahtmae, E. (2006). Monitoring cyanobacterial 4 \nblooms by satellite remote sensing. Estuarine Coastal and Shelf Science, 67, 303-312. 5 \nLorenzen, C. J. (1967). Determination of chlorophyll and pheo-pigments - 6 \nspectrophotometric equations. Limnology and Oceanography, 12, 343-346. 7 \nMetcalf, J. S., Banack, S. A., Lindsay, J., Morrison, L. F., Cox, P. A., & Codd, G. A. (2008). 8 \nCo-occurrence of beta-N-methylamino-L-alanine, a neurotoxic amino acid with other 9 \ncyanobacterial toxins in British waterbodies, 1990-2004. Environmental 10 \nMicrobiology, 10, 702-708. 11 \nMetcalf, J. S., Bell, S. G., & Codd, G. A. (2000). Production of novel polyclonal antibodies 12 \nagainst the cyanobacterial toxin microcystin-LR and their application for the detection 13 \nand quantification of microcystins and nodularin. Water Research, 34, 2761-2769. 14 \nMetcalf, J. S. & Codd, G. A. (2000). Microwave oven and boiling waterbath extraction of 15 \nhepatotoxins from cyanobacterial cells. FEMS Microbiology Letters, 184, 241-246. 16 \nNair, A., Sathyendranath, S., Platt, T., Morales, J., Stuart, V., Forget, M. H., Devred, E., & 17 \nBouman, H. (2008). Remote sensing of phytoplankton functional types. Remote 18 \nSensing of Environment, 112, 3366-3375. 19 \nPaerl, H. W. & Huisman, J. (2008). Climate - Blooms like it hot. Science, 320, 57-58. 20 \n 40 \nPatel, A., Mishra, S., Pawar, R., & Ghosh, P. K. (2005). Purification and characterization of 1 \nC-phycocyanin from cyanobacterial species of marine and freshwater habitat. Protein 2 \nExpression and Purification, 40, 248-255. 3 \nPearson, M. J., Bateman, I. J., & Codd, G. A. (2001). Measuring the recreational and amenity 4 \nvalues affected by toxic cyanobacteria: a contingent valuation study of Rutland Water, 5 \nLeicestershire. In R.K.Turner, I. J. Bateman, & W. N. Adger (Eds.), Economics of 6 \nCoastal and Water Resources: Valuing Environmental Functions (pp. 67-89). 7 \nDordrecht, The Netherlands: Kluwer. 8 \nPilotto, L. S., Douglas, R. M., Burch, M. D., Cameron, S., Beers, M., Rouch, G. J., Robinson, 9 \nP., Kirk, M., Cowie, C. T., Hardiman, S., Moore, C., & Attewell, R. G. (1997). Health 10 \neffects of exposure to cyanobacteria (blue-green algae) during recreational water-11 \nrelated activities. Australian and New Zealand Journal of Public Health, 21, 562-566. 12 \nRamos, A. G., Martel, A., Codd, G. A., Soler, E., Coca, J., Redondo, A., Morrison, L. F., 13 \nMetcalf, J. S., Ojeda, A., Suarez, S., & Petit, M. (2005). Bloom of the marine 14 \ndiazotrophic cyanobacterium Trichodesmium erythraeum in the Northwest African 15 \nupwelling. Marine Ecology-Progress Series, 301, 303-305. 16 \nRandolph, K., Wilson, J., Tedesco, L., Li, L., Pascual, D. L., & Soyeux, E. (2008). 17 \nHyperspectral remote sensing of cyanobacteria in turbid productive water using 18 \noptically active pigments, chlorophyll a and phycocyanin. Remote Sensing of 19 \nEnvironment, 112, 4009-4019. 20 \nRantajarvi, E., Olsonen, R., Hallfors, S., Leppanen, J. M., & Raateoja, M. (1998). Effect of 21 \nsampling frequency on detection of natural variability in phytoplankton: unattended 22 \n 41 \nhigh-frequency measurements on board ferries in the Baltic Sea. Ices Journal of 1 \nMarine Science, 55, 697-704. 2 \nRapala, J., Sivonen, K., Lyra, C., & Niemela, S. I. (1997). Variation of microcystins, 3 \ncyanobacterial hepatotoxins, in Anabaena spp. as a function of growth stimuli. 4 \nApplied and Environmental Microbiology, 63, 2206-2212. 5 \nRaps, S., Wyman, K., Siegelman, H. W., & Falkowski, P. G. (1983). Adaptation of the 6 \ncyanobacterium Microcystis aeruginosa to light-intensity. Plant Physiology, 72, 829-7 \n832. 8 \nReinart, A. & Kutser, T. (2006). Comparison of different satellite sensors in detecting 9 \ncyanobacterial bloom events in the Baltic Sea. Remote Sensing of Environment, 102, 10 \n74-85. 11 \nRuiz-Verdu, A., Simis, S. G. H., de Hoyos, C., Gons, H. J., & Pena-Martinez, R. (2008). An 12 \nevaluation of algorithms for the remote sensing of cyanobacterial biomass. Remote 13 \nSensing of Environment, 112, 3996-4008. 14 \nSarada, R., Pillai, M. G., & Ravishankar, G. A. (1999). Phycocyanin from Spirulina sp: 15 \ninfluence of processing of biomass on phycocyanin yield, analysis of efficacy of 16 \nextraction methods and stability studies on phycocyanin. Process Biochemistry, 34, 17 \n795-801. 18 \nSathyendranath, S., Watts, L., Devred, E., Platt, T., Caverhill, C., & Maass, H. (2004). 19 \nDiscrimination of diatoms from other phytoplankton using ocean-colour data. Marine 20 \nEcology-Progress Series, 272, 59-68. 21 \n 42 \nSchalles, J. F. & Yacobi, Y. Z. (2000). Remote detection and seasonal patterns of 1 \nphycocyanin, carotenoid and chlorophyll pigments in eutrophic waters. Archiv fur 2 \nHydrobiologie Special Issues Advances in Limnology, 55, 153-168. 3 \nSimis, S. G. H., Peters, S. W. M., & Gons, H. J. (2005). Remote sensing of the cyanobacterial 4 \npigment phycocyanin in turbid inland water. Limnology and Oceanography, 50, 237-5 \n245. 6 \nSimis, S. G. H., Ruiz-Verdu, A., Dominguez-Gomez, J. A., Pena-Martinez, R., Peters, S. W. 7 \nM., & Gons, H. J. (2007). Influence of phytoplankton pigment composition on remote 8 \nsensing of cyanobacterial biomass. Remote Sensing of Environment, 106, 414-427. 9 \nSmyth, T. J., Moore, G. F., Groom, S. B., Land, P. E., & Tyrrell, T. (2002). Optical modeling 10 \nand measurements of a coccolithophore bloom. Applied Optics, 41, 7679-7688. 11 \nTomlinson, M. C., Wynne, T. T., & Stumpf, R. P. (2009). An evaluation of remote sensing 12 \ntechniques for enhanced detection of the toxic dinoflagellate, Karenia brevis. Remote 13 \nSensing of Environment, 113, 598-609. 14 \nTyler, A. N., Hunter, P. D., Carvalho, L., Codd, G. A., Elliott, J. A., Ferguson, C. A., Hanley, 15 \nN. D., Hopkins, D. W., Maberly, S. C., Mearns, K. J., & Scott, E. M. (2009). 16 \nStrategies for monitoring and managing mass populations of toxic cyanobacteria in 17 \nrecreational waters: a multi-interdisciplinary approach. Environmental Health, 8 18 \n(Suppl. 1), S11. 19 \nTyler, A. N., Svab, E., Preston, T., Presing, M., & Kovacs, W. A. (2006). Remote sensing of 20 \nthe water quality of shallow lakes: A mixture modelling approach to quantifying 21 \nphytoplankton in water characterized by high-suspended sediment. International 22 \nJournal of Remote Sensing, 27, 1521-1537. 23 \n 43 \nWard, C. J. (1999). Investigations into the toxicology and persistence of microcystins. PhD 1 \nThesis, University of Dundee, Scotland. 2 \nWestberry, T. K., Siegel, D. A., & Subramaniam, A. (2005). An improved bio-optical model 3 \nfor the remote sensing of Trichodesmium spp. blooms. Journal of Geophysical 4 \nResearch-Oceans, 110. 5 \nWHO (2003). Guidelines for safe recreational water environments. Vol. 1, Coastal and fresh 6 \nwaters Geneva: World Health Organisation. 7 \nWHO (2004). Guidelines for drinking-water quality (Rep. No. Vol. 1). Geneva: WHO. 8 \nWiedner, C., Visser, P. M., Fastner, J., Metcalf, J. S., Codd, G. A., & Mur, L. R. (2003). 9 \nEffects of light on the microcystin content of Microcystis strain PCC 7806. Applied 10 \nand Environmental Microbiology, 69, 1475-1481. 11 \n"}