{"doi":"10.1109\/ITNG.2008.154","coreId":"136313","oai":"oai:bradscholars.brad.ac.uk:10454\/2493","identifiers":["oai:bradscholars.brad.ac.uk:10454\/2493","10.1109\/ITNG.2008.154"],"title":"Intelligent quality performance assessment for e-banking security using fuzzy logic","authors":["Aburrous, Maher R.","Hossain, M. Alamgir","Thabatah, Fadi","Dahal, Keshav P."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008","abstract":"Security has been widely recognized as one of the\\ud\nmain obstacles to the adoption of Internet banking\\ud\nand it is considered an important aspect in the\\ud\ndebate over challenges facing internet banking. The\\ud\nperformance evaluation of e-banking websites\\ud\nrequires a model that enables us to analyze the\\ud\nvarious imperative factors and criteria related to the\\ud\nquality and performance of e-banking websites. Ebanking\\ud\nsite evaluation is a complex and dynamic\\ud\nproblem involving many factors, and because of the\\ud\nsubjective considerations and the ambiguities\\ud\ninvolved in the assessment, Fuzzy Logic (FL) model\\ud\ncan be an effective tool in assessing and evaluating\\ud\nof e-banking security performance and quality. In\\ud\nthis paper, we propose an intelligent performance\\ud\nassessment model for evaluating e-banking security\\ud\nwebsites. The proposed model is based on FL\\ud\noperators and produces four measures of security\\ud\nrisk attack dimensions: direct internal attack,\\ud\ncommunication tampering attack, code programming\\ud\nattack and denial of service attack with a\\ud\nhierarchical ring layer structure. Our experimental\\ud\nresults show that direct internal attack risk has a\\ud\nlarge impact on e-banking security performance. The\\ud\nresults also confirm that the risk of direct internal\\ud\nattack for e-banking dynamic websites is doubled\\ud\nthat of all other attacks","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/136313.pdf","fullTextIdentifier":"https:\/\/bradscholars.brad.ac.uk\/bitstream\/10454\/2493\/1\/dahal19.pdf","pdfHashValue":"d211bf50d4be884cb7b28e668047489837e27fa6","publisher":"IEEE Computer Society Press.","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:bradscholars.brad.ac.uk:10454\/2493<\/identifier><datestamp>\n                2014-05-20T09:12:48Z<\/datestamp><setSpec>\n                com_10454_413<\/setSpec><setSpec>\n                col_10454_6345<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nIntelligent quality performance assessment for e-banking security using fuzzy logic<\/dc:title><dc:creator>\nAburrous, Maher R.<\/dc:creator><dc:creator>\nHossain, M. Alamgir<\/dc:creator><dc:creator>\nThabatah, Fadi<\/dc:creator><dc:creator>\nDahal, Keshav P.<\/dc:creator><dc:subject>\nInternet banking<\/dc:subject><dc:subject>\nE-banking security<\/dc:subject><dc:subject>\nInternet security<\/dc:subject><dc:subject>\nFuzzy logic<\/dc:subject><dc:description>\nSecurity has been widely recognized as one of the\\ud\nmain obstacles to the adoption of Internet banking\\ud\nand it is considered an important aspect in the\\ud\ndebate over challenges facing internet banking. The\\ud\nperformance evaluation of e-banking websites\\ud\nrequires a model that enables us to analyze the\\ud\nvarious imperative factors and criteria related to the\\ud\nquality and performance of e-banking websites. Ebanking\\ud\nsite evaluation is a complex and dynamic\\ud\nproblem involving many factors, and because of the\\ud\nsubjective considerations and the ambiguities\\ud\ninvolved in the assessment, Fuzzy Logic (FL) model\\ud\ncan be an effective tool in assessing and evaluating\\ud\nof e-banking security performance and quality. In\\ud\nthis paper, we propose an intelligent performance\\ud\nassessment model for evaluating e-banking security\\ud\nwebsites. The proposed model is based on FL\\ud\noperators and produces four measures of security\\ud\nrisk attack dimensions: direct internal attack,\\ud\ncommunication tampering attack, code programming\\ud\nattack and denial of service attack with a\\ud\nhierarchical ring layer structure. Our experimental\\ud\nresults show that direct internal attack risk has a\\ud\nlarge impact on e-banking security performance. The\\ud\nresults also confirm that the risk of direct internal\\ud\nattack for e-banking dynamic websites is doubled\\ud\nthat of all other attacks.<\/dc:description><dc:date>\n2009-03-19T16:50:40Z<\/dc:date><dc:date>\n2009-03-19T16:50:40Z<\/dc:date><dc:date>\n2008<\/dc:date><dc:type>\nConference paper<\/dc:type><dc:type>\npublished version paper<\/dc:type><dc:identifier>\nAburrous, M. R., Hossain, M. A., Thabatah, F. and Dahal, K. P. (2008)\\ud\nIntelligent quality performance assessment for e-banking security using fuzzy\\ud\nlogic. In: Fifth International Conference on Information Technology: New\\ud\nGenerations (ITNG 2008). IEEE Computer Society. pp.420-425.<\/dc:identifier><dc:identifier>\n90012164<\/dc:identifier><dc:identifier>\n90013385<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/10454\/2493<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nhttp:\/\/www2.computer.org\/portal\/web\/csdl\/doi\/10.1109\/ITNG.2008.154<\/dc:relation><dc:rights>\nCopyright © [2008] IEEE. Reprinted from Fifth\\ud\nInternational Conference on Information Technology: New Generations (ITNG\\ud\n2008). This material is posted here with permission of the IEEE. Such\\ud\npermission of the IEEE does not in any way imply IEEE endorsement of\\ud\nany of the University of Bradford's products or services. Internal or\\ud\npersonal use of this material is permitted. However, permission to\\ud\nreprint\/republish this material for advertising or promotional purposes or for creating new collective works for resale or redistribution must be\\ud\nobtained from the IEEE by writing to pubspermissions@ ieee.org.\\ud\nBy choosing to view this document, you agree to all provisions of the\\ud\ncopyright laws protecting it.<\/dc:rights><dc:publisher>\nIEEE Computer Society Press.<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":null,"language":null,"relations":["http:\/\/www2.computer.org\/portal\/web\/csdl\/doi\/10.1109\/ITNG.2008.154"],"year":2008,"topics":["Internet banking","E-banking security","Internet security","Fuzzy logic"],"subject":["Conference paper","published version paper"],"fullText":" The University of Bradford Institutional \nRepository \nhttp:\/\/bradscholars.brad.ac.uk \nThis work is made available online in accordance with publisher policies. Please \nrefer to the repository record for this item and our Policy Document available from \nthe repository home page for further information. \nTo see the final version of this work please visit the publisher’s website. Where \navailable access to the published online version may require a subscription. \nAuthor(s): Aburrous, M. R., Hossain, M. A., Thabatah, F. and Dahal, K. P. \nTitle: Intelligent quality performance assessment for e-banking security using \nfuzzy logic. \nPublication year: 2008 \nConference title: Fifth International Conference on Information Technology: New \nGenerations (ITNG 2008). \nPublisher: IEEE Computer Society Press. \n Link to original published version: \nhttp:\/\/www2.computer.org\/portal\/web\/csdl\/doi\/10.1109\/ITNG.2008.154 \nCitation: Aburrous, M. R., Hossain, M. A., Thabatah, F. and Dahal, K. P. (2008) \nIntelligent quality performance assessment for e-banking security using fuzzy \nlogic. In: Fifth International Conference on Information Technology: New \nGenerations (ITNG 2008). IEEE Computer Society. pp.420-425. \nCopyright statement: Copyright © [2008] IEEE. Reprinted from Fifth \nInternational Conference on Information Technology: New Generations (ITNG \n2008). This material is posted here with permission of the IEEE. Such \npermission of the IEEE does not in any way imply IEEE endorsement of \nany of the University of Bradford's products or services. Internal or \npersonal use of this material is permitted. However, permission to \nreprint\/republish this material for advertising or promotional purposes \nor for creating new collective works for resale or redistribution must be \nobtained from the IEEE by writing to pubspermissions@ ieee.org. \nBy choosing to view this document, you agree to all provisions of the \ncopyright laws protecting it. \n 1\nIntelligent Quality Performance Assessment for E-Banking Security using \nFuzzy Logic \n \n \nMaher Aburrous \nDept. of Computing, \nUniversity of \nBradford, UK  \nmrmaburr@bradford.ac.uk \n \n \nM. A. Hossain  \nDept. of Computing, \nUniversity of \nBradford, UK  \nm.a.hossain1@bradford.ac.uk \n \nFadi Thabatah. \nMIS Department \nPhiladelphia \nUniversity, Jordan \nffayez@philadelphia.edu.jo \n \n \nKeshav Dahal \nDept. of Computing, \nUniversity of \nBradford, UK. \nk.p.dahal@bradford.ac.uk \n \n \nAbstract \n \n \n   Security has been widely recognized as one of the \nmain obstacles to the adoption of Internet banking \nand it is considered an important aspect in the \ndebate over challenges facing internet banking. The \nperformance evaluation of e-banking websites \nrequires a model that enables us to analyze the \nvarious imperative factors and criteria related to the \nquality and performance of e-banking websites. E-\nbanking site evaluation is a complex and dynamic \nproblem involving many factors, and because of the \nsubjective considerations and the ambiguities \ninvolved in the assessment, Fuzzy Logic (FL) model \ncan be an effective tool in assessing and evaluating \nof e-banking security performance and quality. In \nthis paper, we propose an intelligent performance \nassessment model for evaluating e-banking security \nwebsites. The proposed model is based on FL \noperators and produces four measures of security \nrisk attack dimensions: direct internal attack, \ncommunication tampering attack, code programming \nattack and denial of service attack with a \nhierarchical ring layer structure. Our experimental \nresults show that direct internal attack risk has a \nlarge impact on e-banking security performance. The \nresults also confirm that the risk of direct internal \nattack for e-banking dynamic websites is doubled \nthat of all other attacks. \n \n1. Introduction \n \n   Electronic banking systems provide users with easy \naccess to banking services, including, retrieving the \nbalance of an account, money transfers between \naccounts, retrieving an account history, etc [8].  \n   The number of personal computers and internet \nusers are increasing. Customers often like to use new \ninformation technologies for the various online \ntransactions related internet banking and online \nshopping. In online shopping, the internet provides \ncustomers with the selection flexibility and saves \nthem a great deal of time in making shopping \ndecisions. The increasing volume of electronic \ncommerce generates a corresponding demand for \nelectronic payment processes offered by financial \ninstitutions and banks. Furthermore, other follow-up \nactivities such as paying bills, transferring funds \nbetween accounts, and credit card-related \ntransactions need to be processed online [7]. \nTherefore, the customer-oriented demand on internet \nbanking increases.  \nSecurity has been widely recognized as one of \nthe main obstacles to the adoption of internet \nbanking [4]. The performance evaluation of e-\nbanking websites requires a model that enables us to \nanalyse the various important factors related to the \nquality and performance of e-banking websites. \nSince e-banking site evaluation is a complex and \ndynamic problem, Fuzzy Logic (FL) can be an \neffective tool in assessing and evaluating e-banking \nsecurity performance since FL offers a natural way \nof dealing with quality factors rather than exact \nvalues. \nIn this paper, we investigate the different quality \ndimensions related to internet banking security by \ntrying to answer questions such as: What are the \nmost important criteria with reference to security that \nsatisfies e-banking customers and bankers. Moreover, \nwe design and formulate a simple method to assess \nthe quality of e-banking websites for customers and \ndecision-makers. The different criteria selected for \nevaluating the e-banking websites are derived \nthrough a comprehensive investigation, exploratory \nfieldwork, interviews, observations, survey \nquestionnaire, automated assessing scanning tools \nand consultation with several experts. \nThe paper is organized as follows: Section 2 \npresents the methodology used to collect data and \nSection 3 discusses the security architecture of \ninternet banking and FL Expert System. Section 5 \npresents the proposed FL model for e-banking \nsecurity performance and quality assessment. Section \n6 shows the different rule base structure and entries \nfor all the proposed model phases. Section 7 reveals \nthe implementation results after defuzzification \nprocess and then conclusions are given in Section 8. \n \n \n 2\n2. Research Methodology \n \n2.1 Exploratory Fieldworks: Case Study \n \n   We conducted an exploratory fieldwork case study \non leading private-sector banks in Jordan over three-\nmonth period to achieve the research objectives.  \nThe research techniques used in the case study are: \nopen and semi-structured interviews, observations \nand participation in the project management, and \nreview of documents. We used an open and semi \nstructured interviews with the senior executives of \nthe IT department, e-security and e-banking \noperations in the banks.  \n   We discovered from the conducted interviews that \ninternet banking in Jordan is facing difficulties that \nlimit the development of e-banking services in the \nfuture. These difficulties include: lack of regulations, \npolicies and e-banking laws and legislation to protect \ncustomers from internet fraud, lack of internet \nconnections speed and telecommunications \ninfrastructures, lack of internet awareness culture and \ngeneral computer skills, high internet connection \ncosts and finally security, privacy and trust problems \nthat highly influence the acceptance of internet \nbanking and increases the fear of using it [3].  \n \n2.2 Mail Questionnaire Survey \n \n   We designed a mail questionnaire, which has been \nsent to a number of random Jordan Ahli Bank \nemployees and clients. The primary objectives of the \nquestionnaire were (1) to assess the satisfaction of \ncustomers regarding the performance quality and \nsecurity procedures of Jordan Ahli Bank internet \nbanking website (2) to reveal the perception of \nclients in terms of using the internet both as \ncommunication tool and as a delivery channel.  \n   The questionnaire survey showed that the security \nfactor is considered one of the most important factors \nrelated to e-banking since services such as money \ntransfers and electronic payments cannot be \nvulnerable to any kind of attacks [19]. Furthermore, \nthe lack of assurance, trust, privacy and security \nhinder the e-banking development. In other words, \nwhen customers don’t trust security and privacy in e-\nbanking, they don’t make transactions related to \nmoney via the internet [20].  \n \n2.3 Automatic Security Scanning Tools \n \n   With the help of automated hacking and cracking \ntools as well as web scanner applications, we \nmanaged to test and assess the level of security and \nvulnerability of the e-banking websites case study. \nThis process helped us in determining and analyzing \nthe critical factors related to scanning, testing and \nassessing e-banking websites performance factors. \nFor example, we used Acunetix Web Vulnerability \nScanner (WVS) [1] for automatically testing web \nsites for vulnerabilities such as SQL attacks, Cross \nSite Scripting, CRLF injection, Directory Traversal, \nAuthentication Hacking and Google Hacking.  \n   So we can see from the case study, the survey \nconducted, and the automatic security scanning tools \nthat the greatest challenge to e-banking websites is \nwinning the trust of customers over privacy and \nsecurity. Different quality and performance \ndimensions related to internet banking security \nassessment were also produced from these \nexperiments as well as specifying all the security \nrisks categories and criteria that can damage and \nhinder e-banking websites and threat their existence. \n \n3. Internet Banking and Fuzzy Logic \n \n3.1 Internet Banking Security Architecture \n \nThere are many threats that any internet banking \ndynamic website can fall into, including, spoofing, \ndenial-of-service attack, SQL injection, phishing \nattacks, sniffing, page hijacking, brute force, buffer \noverflows, and social engineering. Financial \ninstitutions engaging in any form of internet banking \nshould have effective and reliable methods to \nauthenticate their customers. These methods include, \nthe use of customer passwords, personal \nidentification numbers(PIN), digital certificates using \npublic key infrastructure (PKI), physical devices \nsuch as smart cards, one-time passwords (OTPs), \nUSB plug0-ins, transaction profile scripts, and \nbiometric identification [11]. Moreover, most \ninternet banks offer other protective measures to \nensure information is safe and secure such as secure \nlogins, limited logins (lock out if exceed) and limited \nsessions (require to re-login if inactive for a period of \ntime [18]. \n   Internet attackers have become more sophisticated \nsince they moved from network level attacks such as \nabusing firewall and filtering rules to application \nlevel, that of attacking and exploiting code within \nweb applications such as SQL injections or input \nvalidation attacks and direct internal level such as \nsocial engineering and phishing attacks. \nDirect internal attacks are the primary threat to \ncomputer systems since they are likely to have \nspecific goals and objectives, and have legitimate \naccess to the system. This type of attack can be \nextremely difficult to detect or protect against [13]. \nThe direct internal attack can affect all components \n 3\nof computer security and the confidentiality of \ninformation on the system. \n \n3.2 FL Expert System \n \nA fuzzy expert system is an expert system that uses \nFL instead of Boolean logic. In other words, it is a \ncollection of membership functions and rules that are \nutilised to reason about data [6].  \nFuzzy approach requires sufficient expert \nknowledge in the formulation of the rule base, the \ncombination of the sets and the defuzzification. In \nGeneral, the employment of FL might be helpful for \ncomplex processes such as when there is no simple \nmathematical model. Fourali [12] highlights the \nrelevance of FL to the task of measuring educational \nachievement in which he introduced the principles \nbehind FL and illustrated how these principles could \nbe applied by educators in the area of assessment \nusing portfolio evidence. Murphy [17] discussed the \nprimary risk factors in developing projects and the \nkeys to a successful risk management programme. \nCox [9] examined the organisation of a business rule \nsystems and looked at how these rules should be \norganised and written in order to address the \nuncertainty and imprecision of business decisions \nusing FL.  \nAbdul Rahim [2] showed the utilisation of fuzzy \ntechnology in modeling subjective, vague and \nuncertain web usability and design guidelines. \nYuksel [20] determined the key quality dimensions \nin internet banking using survey questionnaire. \nDavoli [10] presented a Fuzzy Quality Tree for web \ninspection (FQT4web), a qualitative, robust and \nefficient inspector-based methodology for website \nevaluation that has a hierarchical structure. In his \npaper, he produced six measures of quality \ndimensions and an overall quality score for web sites. \nFinally, Alasgarova [5] examined the beneficial \naspects of using fuzzy database for credit risk \nprediction decision. \nThe inference process in FL goes through four \nsteps [9] Fuzzification, . Inference, Composition and \nDefuzzification. \n \n4. System Design \n  \nSince FL offers a more natural way of assessing \nsecurity factors instead of exact values, we used it to \nevaluate and assess the security of the dynamic \ninternet banking websites by classifying all the \nonline security risks, threats and vulnerability \naccording to an important weight. This classification \nwill enable us to produce an overall security score \nfor an e-banking website. The proposed system \nshown in Figure 1 has been implemented in \nMATLAB and is designed using four main e-\nbanking risk criteria, including: Direct internal attack \nrisk, communication tampering attack risk, code \nprogramming attack risk and denial of service attack \nrisk. Two IT auditors from each bank (5 banks) and a \nquestionnaire have been used for judging the \nimportance of the above four criterions.  \nFrom each case-study, we choose two IT \nauditors to answer the questionnaire, which consisted \nof 80 scaled questions (20 questions for each risk). \nInstructions have been given to the IT auditors to tick \nthe corresponding box on the satisfaction scale, then \nto decide the minimum position and the maximum \nposition he\/s accepts. For instance, an assessor might \nthink that question 2 for the selected risk criteria is \nfair but not strong, hence he may tick box 5 on the \nscale, and then he may realize also that a lower rating, \ni.e. 4 is acceptable [12]. Calculation of the \nassessment criteria can be computed as follows: \nAverage outcome: (1*1+2*2+2*3+3*4+2*5)\/10 = \n3.3 \nAnalysis of the data collected from the IT auditors \nrevealed that the internal direct attack is the highest \nsecurity risk factor, and other risks have lower \nimpact. In other words, the internal direct risk attack \nfactor is double that of others. The internal direct \nattack deals with human factor, which is not easy to \nbe controlled and managed. On the other hand, the \nother security risk factors can be controlled and \neliminated by the various kinds of hardwares and \nsoftwares such as: firewalls, automated scanning \ntools and antivirus applications to protect the \nnetwork. The complete framework is demonstrated \nin Figure 1 with all criteria. \n \n \nFigure 1: Structure of the system in MATLAB \n \n \nFigure 2 : Ring layer 1 - Phase 2 evaluation \n 4\n \n \nFigure 3 : Pahse 3 evaluation - Final Security \nRating \n \n5. System Criteria \n \n5.1 Criteria Considered in Evaluating the \nSecurity of E-banking Sites \nSecurity assessment is performed based on four \nrisk attack criteria: direct internal attack, \ncommunication tampering attack, code programming \nattack and denial of service attack. There are four \ncomponents for each criterion as shown in Table 1, \nwhich explains the relationship between criteria and \ncomponents. Table 1 also shows that there are two \nring layers, where the first ring layer contains: \ncommunication tampering attack, code programming \nattack and denial of service attack and the second \nring layer contains only the direct internal attack. \nThe proposed model is based on fuzzy operators \nfor e-banking website security evaluation, which \nproduces four measures of security risk attack \ndimensions with a hierarchical ring layer structure. \nThe four criteria have been prioritized according to \ntheir importance using weights as concluded from \nthe survey where each criterion is divided further \ninto four components as shown in Table 1. \nDeveloped in the model are two ring layers where \nthe criteria of the least important ones are placed in \nthe first layer with a weight equal to 0.2, and their \nunion produces Rule base 2 ( Phase 2 evaluation). \nThe criteria with the greater importance are placed in \nthe second ring layer and assigned a weight of 0.4, \nand it produces rule base 1 (Direct internal attack \nevaluation) as shown in Figure 3. The combination \nof rule base 2 and rule base 1 derives rule base 3 \n(Phase 3 evaluation) which represents the final \nsecurity rating as shown in Figure 4. \n  \nFinal Rating = 0.4* Direct internal attack crisp \n[second ring layer] +  ((0.2*Communication \ntampering attack crisp)+(0.2*Code programming \nattack crisp) + (0.2 *Denial of service attack crisp)) \n[First ring layer]   Or \nFinal Rating = 0.4* Direct internal attack Crisp \n[second ring layer] +0.6*Phase 3 crisp [First ring \nlayer] \n \nTable 1: Layers of  e-banking risk attacks criteria. \n \n5.2 Primary Inputs and Output of the System \n \n   There are four criteria and for each criterion there \nare four components. Therefore, there are sixteen \ncomponents in total, where for each component, five \nquestions are defined and a component is judged on \nthe scale 1-5 inclusive based on the outcome of these \nfive questions. Each component takes one integer \nvalue as primary input [14]. Membership values of \nthe three fuzzy sets (“low risk”, ”moderate risk”, \n“high risk”) were produced using fuzzification to the \ninteger crisp values of the four components of each \ncriterion. Defining five output fuzzy sets: \n“annoying”, “harmful“, “destructive”, (triangular \nmembership function) and “safe”,”catastrophic” \n(Trapezoidal membership function). \n \n6. The Rule Base \n \n6.1 The Rule Base for Phase 1 \n \n   The rule base has four input parameters and one \noutput and contains all the “IF-THEN” rules of the \nsystem. For each entry of the rule base, each \ncomponent is assumed to be one of three values and \neach criterion has four components. Therefore, the \nrule base contains (34) = 81entries. A sample of the \nstructure and the entries of the rule base for phase 1 \nare shown in Table 2. The system structure for direct \ninternal attack is the joining of its four components \nCriteria No. Component Layer nol \n1 Phishing Attack \n2 Social Engineering \n3 Brute Force \n \nDirect \ninternal \nattack \n4 Insider Attack \nLayer Two \n(2) \nSecond Ring\nSubtotal \nWeight = \n1 Sniffing \n2 Spoofing  \n3 Port Scans \n \nCommunicati\non tampering \nattack 4 Page Hijacking \n1 SQL Injection \n2 Buffer Overflow \n3 Cross Site Scripting \n \nCode \nprogramming \nattack 4 Trojan Horse \n1 Ping of Death \n2 Ping Flood \n3 Man in the Middle  \n \nDenial of \nservice attack \n \n(Weight =0.2) 4 Smurf Attack \n \n \n \n \n \n \nLayer One \n(1) \nFirst Ring \n \n \nSubtotal \nWeight = \n0.6 \nTotal Weight  1 \n 5\nTable 4: Rule Base 3 structure and entries for \nphase 3 \nR\nul\ne \n Phase 2 Direct Internal \nAttack \nFinal \nSecurity \nRating \n1 Low Risk Low Risk Safe \n2 Low Risk Moderate Risk Destructive \n3 Low Risk High Risk Catastrophic \n4 Moderate Risk Low Risk Annoying \n5 Moderate Risk Moderate Risk Destructive \n6 Moderate Risk High Risk Catastrophic \n7 High Risk Low Risk Harmful \n8 High Risk Moderate Risk Destructive \n9 High Risk High Risk Catastrophic\n(phishing attack, social engineering attack, insider \nattack, and brute force attack), which produces the \ndirect internal attack rule base 1.  \n \nTable 2 : Sample of the rule base1 structure and \nentries for direct internal attack  valuation \nRu\nle\n Phishing \nAttack \nSocial \nEngineeri\nng Attack \nInsider \nAttack \nBrute \nForce \nAttack \nDirect \nInternal  \nAttack \n1 Low Risk Low Risk Low Risk Low Risk Safe \n3 Low Risk Low Risk Low Risk High Risk Harmful \n27 Low Risk High Risk High Risk High Risk Catastrophic \n28 Mod. Risk Low Risk Low Risk Low Risk Annoying \n30 Mod. Risk Low Risk Low Risk High Risk Harmful \n54 Mod. Risk High Risk High Risk High Risk Destructive \n55 High Risk Low Risk Low Risk Low Risk Harmful \n57 High Risk Low Risk Low Risk High Risk Destructive \n79 High Risk High Risk High Risk Low Risk Catastrophic \n \n6.2 The Rule Base for Phase 2 \nIn phase 2, there are three inputs, which are (denial \nof service attack, communication tampering attack \nand code programming attack) and one output. A \nsample of the structure and the entries of the rule \nbase for phase 2 are illustrated in Table 3. \nThe system structure for phase 2 is the combination \nof three attacks (denial of service attack, \ncommunication tampering attack and code \nprogramming attack), which produces rule base 2. \n \nTable 3 :  Rule Base2 structure and entries for \nphase 2 \n \n6.3 The Rule Base for Phase 3 \n   In phase 3, there are two inputs, which are: the \ndirect internal attack and “Phase2”which is the \noutput from phase 2, and one output. The structure \nand the entries of the rule base for phase 3 are shown \nin Table 4. \nThe system structure for phase 3 is the combination \nof direct internal attack and “Phase2”, which \nproduces rule base 3 and the final security rating. \n7. Defuzzification and Interesting \nexperimental Results \n \n Clipping method [15] is used in aggregating the \nconsequences and the aggregated surface of the rule \nevaluation is defuzzified using Mamdani method [16] \nto find the Center Of Gravity (COG). Centroid \ndefuzzification technique shown in equation (1) can \nbe expressed as where x* is the defuzzified output, \nµi(x) is the aggregated membership function and x is \nthe output variable.  \n \n \nEquation (1) \n \nThe proposed intelligent e-banking website \nsecurity evaluation system has been implemented in \nMATLAB 6.5. The results of some input \ncombinations are listed in Tables 5, 6. The security \nrating will be low (15.6 %), which means that the e-\nbanking website is secure, highly protected and hard \nto be hacked or penetrated when all risk attacks have \nzero inputs. Further, the security rating will be high \n(84.4 %), which means that the e-banking website is \nnot secured enough and can be easily hacked or \npenetrated when the direct internal attack has 10 \ninputs values and all other risks values have zero \ninputs as shown in Table 5.  Whereas, the security \nrisk attack will be equilibrium (50%), which means \nthat the e-banking site is somehow secure and \nprotected but it can be penetrated or hacked when the \ndirect internal attack has zero input and all other risk \nattacks have the value of 10 inputs as shown in Table \n6. This result shows that the direct internal attack is \nmore important than all other risk attacks.  \n \nTable 5: Four highest (10) inputs for criteria \n(Direct internal attack) and all other lowest (0) \ninputs \nR\nul\ne \n Denial of \nService \nAttack \nCommunic\nation \nAttack \nCode \nProgramming \nAttack \nRating \n1 Low Risk Low Risk Low Risk Safe \n2 Low Risk Low Risk Mod. Risk Annoying \n9 Low Risk High Risk High Risk Destructive \n10 Mod. Risk Low Risk Low Risk Annoying \n12 Mod. Risk Low Risk High Risk Harmful \n18 Mod. Risk High Risk High Risk Catastrophic \n19 High Risk Low Risk Low Risk Harmful \n20 High Risk Low Risk Mod. Risk Harmful \n27 High Risk High Risk High Risk Catastrophic \nN\no  \nDenial of \nService \nAttack \nCommunic\nation \nAttack \nCode \nProgramm \nAttack \nDirect \nInternal \nAttack \n% \nSecurity \nRating \n1 10 10 10 0 \n2 10 10 10 0 \n3 10 10 10 0 \n4 10 10 10 0 \n \n50.0 \n \n 6\n \nTable 6: Four lowest (0) inputs for criteria (Direct \ninternal attack) and all other highest (10) inputs \n \n8. Conclusions and Future Work \n \nIn this paper, we proposed an intelligent performance \nassessment model for e-banking security evaluation \nwebsites. Fuzzy Logic (FL) was used in the design \nphase and MATLAB was utilised in the \nimplementation phase of our model. The results \nindicate that the worst security rate equals 87.5% and \nthe best security rate is 15.6% rather than a full range, \ni.e. 0 to 100, because of the fuzzification process. \nMoreover, the results show that the direct internal \nattack risk has a large impact on e-banking security \nperformance since it achieves a security rate of to \n84.4 %.  \nInteresting results can also be noticed when the \ndirect internal attack has four input values from ten, \nand all other attacks have (0) input value since the \nsecurity rating produced was 55.7%. This means that \nthe e-banking website is somehow secure, but it can \nbe penetrated.  Proper training of e-banking \ncustomers on recognising and avoiding the direct \ninternal security attacks may help improving the \nsecurity and enhancing the customers overall \nconfidence over long terms. The utilisation of FL in \nassessing e-banking security evaluation is still wide \nopen research area, which can reveal quite \ninteresting results. We are going to examine in near \nfuture how the results and security rate are changed \nwhen more risk criteria, ring layers and different \nrelative importance weight for these risks are added \nand taken into accounts. \n \nReferences: \n \n[1] http:\/\/www.ebankingsecurity.com. \n[2] A. R. Ahmad and O. Basir. Fuzzy Inferencing in \nthe Webpage Layout Design. Working Paper. System \nDesign Engineering University of Waterloo, Waterloo, \nCanada, 2003. \n[3] A. Al Sukkar and H. Hasan. Toward a Model for the \nAcceptance of Internet Banking in Developing Countries. \nInformation Technology for Development, Vol. 11(4) 381-\n398 Wiley Periodicals, 2005. \n[4] A. M. Aladwani. Online banking: a field study of \ndrivers, development challenges, and expectations. \nInternational Journal of Information Management 21 (4), \n213-225, 2001. \n[5] A. N. Alasgarova. Financial Credit Risk Prediction \nwith Fuzzy System. Engineering and Applied Sciences \ndepartment, Khazar University, 2005. \n[6] J. Buckley and D. Tucker. Second generation fuzzy \nexpert system. Fuzzy Sets and Systems, 31:271{284, 1989. \n[7] F. O. Celikcapa and G. G. Emel. E-Banking Options: \nWhich one best fits for customer?. Uludag University, \nBursa, 16059, Turkey, 2002. \n[8] J. Claessens, B. Preneel and J. Vandewalle. A \nTangled World Wide Web of Security Issues. First Moday, \nVol. 7, No. 3, 2002. \n[9] E. Cox. FL and Measures of Certainty in E-\nCommerce Expert System. Article. Scianta Intelligence, \nChapel Hill, 2001. \n[10] P. Davoli, E. Corradini, E. Garzillo, M. Nuccio, and \nA. Russo. Inspection of Museum Web Application \nQuality- Analysis of Selected European Sites. Proceeding \nCDROM. Toronto: Archives & Museum Informatics, \nMarch 2004. \n[11] Federal Financial Institutions Examination Council. \nAuthentication in an Internet Banking Environment, \nFFIEC gencies (August 2001 Guidance).  \n[12] C. Fourali. Using FL in Educational Measurement: \nThe Case of Portfolio Assessment. Research Department, \nCity & Guilds, London. Vol.11, No. 3, 1997. \n[13] P. Gaonjur and C. Bokhoree. Risk of Insider Threats \nin Information Technology Outsourcing: Can deceptive \ntechniques be applied?. School of Business Informatics, \nUniversity of Technology, Mauritius, 2006. \n[14] M. S. Hasan, M. A. Hossain and M. L. Rahman. FL \nBased Decision Support System for E-Commerce Site \nAssessment. Proceedings International Conference on \nComputing & Information Technology (ICCIT), pp. ID-72, \nDhaka, Bangladesh, 2004. \n[15] C. Y. Ho, B. W. Ling, and J. D. Reiss. Fuzzy \nImpulsive Control of High-Order Interpolative Low-Pass \nSigma–Delta Modulators. IEEE Transactions on Circuits \nand Systems—I: Regular Papers, Vol. 53, No. 10, October \n2006. \n[16] M. Liu, D. Chen and C. Wu. The continuity of \nMamdani method. International Conference on Machine \nLearning and Cybernetics, Page(s): 1680 - 1682 vol.3, \n2002. \n[17] Dr. J. Murphy. Assuring Performance in E-Commerce \nSystems. Proc. of IEE 16th UK Teletraffic Symposium, pp. \n29\/1-29\/7, Harlow, May 2000. \n[18] F. Owen. Is Online Banking A Safe Choice. \nEzineArticles.com, 2006. \n[19] C. Ranganathan and S. Ganapathy. Key Dimensions \nof Business-to-Customer Web Sites. Information and \nManagement, Vol. 39, 2002. \n[20] H. Yuksel. Quality Dimensions of Internet Banking: \nAn Empirical Study. 35th International Conference on \nComputer and Industrial Engineering, 2005. \nN\no  \nDenial of \nService \nAttack \nCommunic\nation \nAttack \nCode \nProgramm \nAttack \nDirect \nInternal \nAttack \n% \nSecurity \nRating \n1 0 0 0 10 \n2 0 0 0 10 \n3 0 0 0 10 \n4 0 0 0 10 \n \n84.4 \n \n"}