{"doi":"10.1144\/SP335.16","coreId":"57614","oai":"oai:nora.nerc.ac.uk:10039","identifiers":["oai:nora.nerc.ac.uk:10039","10.1144\/SP335.16"],"title":"Lateral variations and linkages in thrust geometry : the Traligill Transverse Zone, Assynt Culmination, Moine Thrust Belt, NW Scotland","authors":["Krabbendam, M.","Leslie, A.G."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":["Law, R.D.","Butler, R.W.H.","Holdsworth, R.E.","Krabbendam, M.","Strachan, R.A."],"datePublished":"2010","abstract":"Abrupt lateral changes in thrust geometry occur in many fold-and-thrust belts along so-called transverse zones, commonly related to pre-existing basement faults. However, the causative structures are usually concealed. We analyse here the Traligill Transverse Zone in the Assynt Culmination of the Caledonian Moine Thrust Belt, NW Scotland. This transverse zone trends sub-parallel to the WNW transport direction and is associated with en echelon faults cutting thrusts, discontinuity of thrust architecture and oblique fold-and-thrust structures. Thick thrust sheets north of the Transverse Zone contain thick basement slices; thrust sheets to the south are thin and involve a thin-bedded sequence. The Traligill Transverse Zone developed above the Loch Assynt Fault, a basement cross-fault, , and reactivated Proterozoic ductile shearzone. Piercing point analysis shows that the cross-fault was active both before and after thrusting. Thrusting thus affected strata that were already disrupted by steep faults. The amplitude of the disturbance in fold-and-thrust architecture along the Traligill Transverse Zone is much greater than the vertical displacement along the fault; this is attributed to localised transpressional thrust-stacking. Other basement cross-faults and their relationship with lateral variations within the Moine Thrust Belt and in other thrust belts are discussed","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/57614.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/10039\/1\/Krabbendametal_Assynt_2010_NORA.pdf","pdfHashValue":"0a7350ad616d9bef50592e9b6324fc0c8830f7eb","publisher":"Geological Society of London","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:10039<\/identifier><datestamp>\n      2012-11-22T12:10:52Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533130<\/setSpec><setSpec>\n      74797065733D626F6F6B5F73656374696F6E<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/10039\/<\/dc:relation><dc:title>\n        Lateral variations and linkages in thrust geometry : the Traligill Transverse Zone, Assynt Culmination, Moine Thrust Belt, NW Scotland<\/dc:title><dc:creator>\n        Krabbendam, M.<\/dc:creator><dc:creator>\n        Leslie, A.G.<\/dc:creator><dc:subject>\n        Earth Sciences<\/dc:subject><dc:description>\n        Abrupt lateral changes in thrust geometry occur in many fold-and-thrust belts along so-called transverse zones, commonly related to pre-existing basement faults. However, the causative structures are usually concealed. We analyse here the Traligill Transverse Zone in the Assynt Culmination of the Caledonian Moine Thrust Belt, NW Scotland. This transverse zone trends sub-parallel to the WNW transport direction and is associated with en echelon faults cutting thrusts, discontinuity of thrust architecture and oblique fold-and-thrust structures. Thick thrust sheets north of the Transverse Zone contain thick basement slices; thrust sheets to the south are thin and involve a thin-bedded sequence. The Traligill Transverse Zone developed above the Loch Assynt Fault, a basement cross-fault, , and reactivated Proterozoic ductile shearzone. Piercing point analysis shows that the cross-fault was active both before and after thrusting. Thrusting thus affected strata that were already disrupted by steep faults. The amplitude of the disturbance in fold-and-thrust architecture along the Traligill Transverse Zone is much greater than the vertical displacement along the fault; this is attributed to localised transpressional thrust-stacking. Other basement cross-faults and their relationship with lateral variations within the Moine Thrust Belt and in other thrust belts are discussed.<\/dc:description><dc:publisher>\n        Geological Society of London<\/dc:publisher><dc:contributor>\n        Law, R.D.<\/dc:contributor><dc:contributor>\n        Butler, R.W.H.<\/dc:contributor><dc:contributor>\n        Holdsworth, R.E.<\/dc:contributor><dc:contributor>\n        Krabbendam, M.<\/dc:contributor><dc:contributor>\n        Strachan, R.A.<\/dc:contributor><dc:date>\n        2010<\/dc:date><dc:type>\n        Publication - Book Section<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/10039\/1\/Krabbendametal_Assynt_2010_NORA.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Krabbendam, M.; Leslie, A.G..  2010  Lateral variations and linkages in thrust geometry : the Traligill Transverse Zone, Assynt Culmination, Moine Thrust Belt, NW Scotland.    In: Law, R.D.; Butler, R.W.H.; Holdsworth, R.E.; Krabbendam, M.; Strachan, R.A., (eds.) Continental tectonics and mountain building: the legacy of Peach and Horne.  London, UK, Geological Society of London, 335-357.  (Geological Society, London, Special Publications, 335).      \n <\/dc:identifier><dc:relation>\n        http:\/\/sp.lyellcollection.org\/content\/vol335\/issue1\/<\/dc:relation><dc:relation>\n        10.1144\/SP335.16<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/10039\/","http:\/\/sp.lyellcollection.org\/content\/vol335\/issue1\/","10.1144\/SP335.16"],"year":2010,"topics":["Earth Sciences"],"subject":["Publication - Book Section","PeerReviewed"],"fullText":"Krabbendam & Leslie: Traligill Transverse Zone \nGeological Society, London, Special Publications 335 \nContinental Tectonics and Mountain Building: the legacy of Peach and Horne \n \nLateral variations and linkages in thrust geometry: the Traligill \nTransverse Zone, Assynt Culmination, Moine Thrust Belt, NW Scotland \n \nM KRABBENDAM & A G LESLIE \nBritish Geological Survey, \nMurchison House, West Mains Road, Edinburgh EH9 3LA, UK \nCorresponding author: mkrab@bgs.ac.uk \n \nAbstract \nAbrupt lateral changes in thrust geometry occur in many fold-and-thrust belts along so-called \ntransverse zones, commonly related to pre-existing basement faults. However, the causative \nstructures are usually concealed. We analyse here the Traligill Transverse Zone in the Assynt \nCulmination of the Caledonian Moine Thrust Belt, NW Scotland. This transverse zone trends \nsub-parallel to the WNW transport direction and is associated with en echelon faults cutting \nthrusts, discontinuity of thrust architecture and oblique fold-and-thrust structures. Thick thrust \nsheets north of the Transverse Zone contain thick basement slices; thrust sheets to the south are \nthin and involve a thin-bedded sequence. The Traligill Transverse Zone developed above the \nLoch Assynt Fault, a basement cross-fault, , and reactivated Proterozoic ductile shearzone. \nPiercing point analysis shows that the cross-fault was active both before and after thrusting. \nThrusting thus affected strata that were already disrupted by steep faults. The amplitude of the \ndisturbance in fold-and-thrust architecture along the Traligill Transverse Zone is much greater \nthan the vertical displacement along the fault; this is attributed to localised transpressional thrust-\nstacking. Other basement cross-faults and their relationship with lateral variations within the \nMoine Thrust Belt and in other thrust belts are discussed.  \n(end of Abstract) \n \n \n Page 1 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \n \nFold-and-thrust belts are intensely studied features of mountain belts around the world; countless \npapers have reported on their geometry, kinematics, mechanics and petroleum potential (McClay \n1992; 2004 and references therein). Many studies have dealt with palinspastic reconstructions and \nbalanced cross-sections parallel to the thrust transport direction; far fewer have focussed on the 3-\nD architecture of fold-and-thrust belts, and how lateral variations in thrust architecture in different \nsegments of a thrust belt are linked via so-called transverse zones (e.g. Mitra 1988; Thomas 1990; \nFermor, 1999; Paulsen and Marshak; Bégin and  Spratt 2002). This relative paucity in research is, \nin part, a consequence of the difficulty in obtaining rigorous constraint upon the 3-D geological \nmodel.  In recent years, exploration in both off-shore and onshore thrust belts has generated 3-D \nseismic data sets and enabled 3-D visualisation and interpretation of thrust geometries (e.g. \nHinsch et al. 2002; Gorney et al. 2007). Seismic data are, however, by their nature relatively low-\nresolution and it is advantageous to compare and contrast seismically constrained models with \nwell-exposed on-shore analogues. \nThe authors have revised the classic geological map, the “Assynt Special Sheet” \n(Geological Survey of Great Britain 1923; British Geological Survey 2007), in the Moine Thrust \nBelt in the Caledonides of NW Scotland. In this paper we describe an abrupt lateral change in \nthrust architecture that occurs across the Traligill Transverse Zone (TTZ). The TTZ transects the \nAssynt Culmination (Figs. 1, 2), the largest and one of the most spectacular and historically \nsignificant of all the culminations in the Moine Thrust Belt. In contrast to other studies on \ntransverse zones (e.g. Mitra 1988; Paulsen and Marshak 1999; Bégin and Spratt 2002), the \ndisplacement evolution on cross-faults associated with the TTZ in Assynt can be accurately \ndetermined using well-constrained piercing points, both within the Moine Thrust Belt and in its \nforeland.  We will show how displacements across normal faults oriented sub-parallel to the \nsubsequent thrust direction can create small steps in the pre-thrust template, but that such small \nsteps can cause large-scale complexities within the thrust belt.   \n \nGeological Setting \nThe Moine Thrust Belt (Fig. 1) is among the best exposed and studied fold-and-thrust belts in the \nworld, and dominates the geological structure of the NW Highlands of Scotland. The belt \ndeveloped during the Scandian (Silurian) phase of the Caledonian Orogeny (e.g. van Breemen et \nal. 1979; Freeman et al. 1998; Dallmeyer et al. 2001; Strachan et al. 2002). The roof of the \nMoine Thrust Belt is defined by the Moine Thrust, a structure which carries the Neoproterozoic \nMoine Supergroup in its hanging wall. These Moine rocks are dissected and repeated by a \nnumber of ductile thrusts (Barr et al. 1986) and are arranged within a regional-scale structure that, \nlike the Moine Thrust Belt structurally below, incorporates culminations and abrupt lateral \nvariations (Leslie et al. this volume). In the footwall of the Moine Thrust, the Moine Thrust Belt \nconsists of a series of thrust sheets that transport rocks that can be confidently correlated with the \nforeland.  \nThe Moine Thrust Belt has been studied for over 150 years, largely because it contains a \ngreat variety of well-exposed thrust geometries,.  In some places the Moine Thrust Belt is a \nsingle, simple thrust plane; elsewhere thrust sheets are piled on top of each other in wild and \nglorious complexity (e.g. Elliot & Johnson 1980, Butler 1982, 1984, Butler et al. 2007; Butler \nthis volume; Coward 1982, 1983, 1985). Thrust sheets vary in thickness from km-scale to less \nthan 10 m and a wide range of different thrust geometries are present.  These include foreland and \nhinterland dipping-duplexes (e.g. Breabag Dome, Dundonnel), anticlinal stacks, thrust nappes, \n Page 2 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \ntrue fold-nappes (Lochalsh) and lateral ramps. In some places the thrust belt consists of a single \nthrust (eg. at Knockan Crag), in other places thrusting is thin-skinned (eg. near Eriboll; south and \nwestern part of Assynt culmination), whilst elsewhere thrusting was relatively thick-skinned (eg \nnear Achnashellach and near Kishorn).  Variability along an east-west cross-section (along the \nthrust direction) can be readily explained by the very different rheological properties of the \nlithologies involved in the thrust belt. These lithologies range from massive Lewisian Gneiss \nbasement, thick-bedded Torridon Sandstone, to thin incompetent dolomitic siltstone layers \nsandwiched between Cambro-Ordovician dolostone and Cambrian quartz-arenite (Fig. 3).  \nHowever, the Cambro-Ordovician cover strata are characterised by a remarkable lateral \nuniformity in thickness and lithology, with all units (some less than 10 m thick) continuously \npresent along a strike length of c. 200 km (eg. Peach et al. 1907, p. 364, Prigmore & Rushton \n1999). This begs the question why there is such a strong lateral (i.e. along strike) variability in \nkinematics and architecture, within the thrust belt.  \n \nLithologies in the Moine Thrust Belt and its environs \nIn the Foreland west of the Moine Thrust Belt the oldest rocks are in the Lewisian Gneiss \nComplex, and comprise felsic to intermediate Archaean orthogneisses (Scourian Gneiss), intruded \nby the Early Palaeoproterozoic mafic and ultramafic Scourie Dyke Swarm (Park et al. 2002). The \ncomplex is unconformably overlain by the early-Neoproterozoic Torridon Group which consists \nof several kilometres of coarse red arkosic cross-bedded sandstone (Applecross Formation).   \nHeterolithic units of conglomerate, breccia, sandstone and mudstone of the Diabaig Formation are \nlocally present beneath the Applecross Formation (Stewart 2002). \nAnother major unconformity separates the Torridon Group from the overlying Cambro-\nOrdovician sequence (Fig. 3). The lower part of this sequence (Ardvreck Group) is dominated by \nthe Eriboll Formation, comprising the arenitic Basal Quartzite and Pipe Rock members (each 75 – \n100 m thick); the latter is characterised by abundant Skolithos ‘pipes’; these distinctive trace \nfossils form ideal strain markers (Wilkinson et al. 1975; Coward & Kim, 1981). The much \nthinner An t-Sron Formation comprises dolomitic siltstone and dolostone of the Fucoid Beds \nMember (10 – 20 m thick), succeeded everywhere by coarse quartz arenite of the Salterella Grit \nMember (c. 7 m thick). The siliciclastic Ardvreck Group is succeeded by the calcareous Durness \nGroup, of which only the three lowest Formations occur in Assynt. The lower Ghrudaidh \nFormation (c. 65 m thick) comprises dark grey dolostones; these are succeeded everywhere by \npale grey dolostones of the Eilean Dubh Formation (c. 120 m thick).   Only small occurrences of \nthe still younger Sailmhor Formation occur in Assynt; these dolostones are characterized by \nabundant chert concretions and distinctive burrow-mottling. Park et al. (2002), Wright and \nKnight (1995), McKie (1991); Prigmore & Rushton (1999) and Armstrong et al. (2006) provide \ndetailed descriptions of the Cambro-Ordovician sequence; relevant here is that the sub-Cambrian \nunconformity is a remarkably planar surface and that the Cambro-Ordovician formations record \nan extremely uniform stratigraphical thickness along the length of the Moine Thrust Belt, very \nmuch a ‘layer-cake’ (the thickness variations shown above are along 200 km strike length, from \nDurness to Skye, Fig. 1).  \n  \nThe Moine Supergroup, of which only the lowermost Morar Group is relevant here, is always \nseparated from the other lithologies by the Moine Thrust. The Morar Group comprises a thick \nsequence of arkosic to sub-arkosic psammites with subsidiary pelite and semipelite of fluvial \n Page 3 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \norigin; all are of broadly similar age and origin as the Torridon Group of the Foreland, with which \nthey have been correlated (Krabbendam et al. 2008).  \n Two plutons and several swarms of dykes and sills are present within the Assynt \nCulmination (Fig. 2); see Parsons (1999) and Goodenough et al. (2004) for reviews. The Loch \nAilsh Pluton comprises feldspar- and pyroxene-syenite and has been dated at 439 ± 4 Ma \n(Halliday et al. 1987); it is generally regarded to predate thrusting along the Moine Thrust. The \nLoch Borralan Pluton comprises nepheline-, feldspar- and quartz-syenite and has been dated at \n430 ± 4 Ma (van Breemen et al. 1979). In contrast to the Loch Ailsh Pluton, the Loch Borralan \nPluton appears to truncate most thrusts within the Assynt Culmination.  \n \nHistory of research \nThe ‘Highlands Controversy’ was a long-lasting, and at times intense and acrimomious, mid-19th \nCentury scientific debate concerned with the problem how non-fossiliferous metamorphosed \nrocks (Moine psammites) could overlie fossiliferous sedimentary strata (Durness ‘limestone’) on \napparently concordant boundaries. Major scientific figures of the time such as Sir Roderick \nImpey Murchison, Professors Charles Lapworth and James Nicol, geologists Charles Callaway, \nBen Peach and John Horne and  Sir Archibald Geikie all examined, and argued over, the \ninterpretations of key localities including Loch Erribol, Assynt, Ullapool and Kinlochewe. The \nscientific debate and the colourful lives of the participants has been comprehensively described \nby Oldroyd (1990); here only a summary focussing on Assynt is given.   \nThe apparently simple geometry of the (single) Moine Thrust at Knockan Crag (Fig. 2), \njust south of the Assynt Culmination, convinced Murchison and his supporters of the existence of \na simple stratigraphical sequence whereby unfossiliferous Moine rocks were deposited on \nfossiliferous limestone in simple succession; the Moine rocks were interpreted as Silurian in age.  \nIn contrast, James Nicol showed that such simplicity could not explain the local complexities of \nthe geology in central Assynt. Nicol (1857) suggested the existence of a repetition of the \nquartzite-limestone sequence and attributed this to the existence of a steep (normal) fault near \nInchnadamph in Assynt, roughly at the level of what later became known as the Sole Thrust (Fig \n2.). Murchison however,  spent some time in the valley of the River Traligill (Fig. 2), (apparently \nin the company of the “handsomest Highland lass I have ever seen”; Oldroyd, 1990, p 78) and \nconvinced himself that all the rocks were in stratigraphical order. He reasoned further that a \nsecond quartzite occurred stratigraphically above the limestone and that the entire sequence was \nfolded into broad, open folds (probably the Droighin antiform, or the Breabag Dome, now \nrecognised as anticlinal thrust stacks, see below).. On a cross-section through Assynt however, \nMurchison (1867) did not show any kind of faulting, even though he must have seen the well-\nexposed and conspicuous Traligill Thrust.  Much later, Callaway (1883) started to doubt the \n‘Murchisonian Doctrine’ and his cross-sections of Cnoc an Droighin and Conival in Assynt (Fig. \n4) are very reminiscent of modern-day cross-sections except that repetition of stratigraphical \nsequences was still mainly attributed to steeply-dipping faults rather than shallow-dipping faults \n(compare Oldroyd 1990, p210, with Coward 1982 and British Geological Survey 2007). \nThe ‘Highlands Controversy’ was intellectually solved by Charles Lapworth (1883, \n1884) on the key outcrops near Loch Erribol, in the northern part of the Moine Thrust Belt.  In the \nmeantime, Archibald Geikie, who had previously supported the ‘Murchisonian Doctrine’  but had \nnow superseded Murchison as Director of the Geological Survey,  sent a team of surveyors led by \nBenjamin Peach and John Horne to the NW Highlands, to settle the issue once and for all. In the \nfield, Peach and Horne were quickly convinced by Charles Lapworth of the validity and elegance \n Page 4 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \nof his solution involving low-angle thrust repetitions and so started to map the Loch Eriboll area \nin detail. Peach, Horne and colleagues gradually worked their way south along the entire thrust \nbelt, producing exquisite geological maps along the way. Their work culminated with the classic \nGeological Survey memoir describing ‘The geological structure of the NW Highlands of \nScotland’ (Peach et al. 1907) and publication of the ‘Assynt Special Sheet’ (Geological Survey of \nGreat Britain, 1923). \nThose publications did not however solve all of the geometrical problems, especially how \none thrust might join with, or link into, another.  For instance, one remaining problem was the \nnorthern termination of the Ben More Thrust, as discussed in Elliot & Johnson (1980) and \nKrabbendam & Leslie (2004); another problem was the southern continuation of the Glencoul \nThrust near Inchnadamph, with different solutions proposed by Bailey (1935), Christie (1963) \nand Elliot & Johnson (1980). Coward (1982) suggested the existence of large-scale ‘surge-zones’ \ninvolving linkage between frontal thrusts and extensional faults at the rear as a solution, a model \nrejected by Krabbendam and Leslie (2004).  \n \nOverview of the Assynt Culmination \nThe overall structure of the Assynt District is that of a bulge or culmination in the Moine Thrust \nplane (Fig. 2).  The overall thrust movement was to the WNW (McClay & Coward 1981), and \nmost thrusts dip gently to the ESE. Within the Assynt Culmination, major individual thrust sheets \nbroadly overlap each other in such a way that the more northerly thrust sheets overlie those to the \nsouth. The structurally highest, and also largest, thrust sheet is the Ben More Thrust Sheet (Fig. \n2), with a strike length over 20 km (Krabbendam & Leslie 2004); small klippen of the Ben More \nThrust Sheet occur farther west (Peach et al. 1907; Coward 1985). The floor thrust in the \nculmination is defined as the Sole Thrust (Fig. 2), although this is not necessarily one single \nthrust plane. South of the Assynt Culmination, as at the classic Knockan Crag locality (now \nfeaturing a visitor centre dedicated to the geology of the Moine Thrust Belt), the Moine Thrust \nrests directly on the Foreland, so that the Moine Thrust and the Sole Thrust are effectively the \nsame structure.  \nThe Assynt Culmination is transected by the Traligill Transverse Zone (TTZ).  This \ntransverse zone trends WNW-ESE, sub-parallel to the thrust transport direction, and is associated \nwith an en echelon fault system cutting thrusts, discontinuity of the thrust architecture, and \noblique fold and thrust structures (Fig. 2).  The effect of the Transverse zone on the Ben More \nand Moine thrusts is  only minor but below the Ben More Thrust the thrust architecture differs \ngreatly to north and south of the transverse zone; these differences are the focus of this paper.   \n \nThrust architecture north of Traligill Transverse Zone \nThe area north of Traligill Transverse Zone is dominated by the Glencoul Thrust Sheet (Figs. 2, \n4); this structure terminates near Loch Glencoul in the NW of the culmination (Krabbendam & \nLeslie 2004). The northern part of the Glencoul Thrust Sheet comprises a single thick slab of \nLewisian Gneiss, overlain by Basal Quartzite on Glas Bheinn and Beinn Uidhe (Fig. 4); the \nGlencoul Thrust emplaces Lewisian Gneiss over Durness Group dolostone in the footwall (Butler \nin Alison et al. 1988). Southwest of Ghlas Bheinn, the footwall of the Glencoul Thrust comprises \nthe ‘Achmore imbricates’, dominated by Durness Group dolostone ; these were described in \ndetail by Coward (1984) and are not considered further here. West of Glas Bheinn, Basal \nQuartzite occurs in the immediate hanging wall of the Glencoul Thrust; farther south (Point A on \nFigure 4), Pipe Rock is emplaced over the dolostone of the Achmore imbricates. The Glencoul \n Page 5 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \nThrust, therefore, does lose some of its stratigraphical separation as the thrust ramps up through \nthe hanging wall succession towards the south (Elliott & Johnson, 1980).   \n South of Glas Bheinn and Beinn Uidhe, there are two large bodies of Lewisian Gneiss, in \ncontrast to the single slab exposed north of those summits (Figs. 4, 6d). In three dimensions, these \ntwo bodies are flattened cylinders plunging to the ESE (Figure 6a). There are at least at least six \nsubsidiary thrusts between the Glencoul Thrust and the overlying Ben More Thrust in this area: \neach of these, and the Glencoul thrust, are now described in turn from west to east. Most thrusts \nappear to be splays of the thrust that underlies the north side Beinn Uidhe and Glas Bheinn (Fig. \n4).   \n \nThe Cnoc an Droighinn surge zone revisited  \nEast of Achmore Farm, the Glencoul Thrust emplaces Pipe Rock over Eilean Dubh dolostone of \nthe Achmore Imbricates (Fig. 4). Some 100 m above the Glencoul Thrust, a subsidiary thrust, the \nCnoc Dubh Thrust, emplaces Basal Quartzite over Pipe Rock and north of Point B, a  c. 4 km2 \noutcrop of Lewisian Gneiss  rests on the Glas Bheinn Thrust.  The gneiss is unconformably \noverlain by Basal Quartzite near Point B (Fig. 4) but the eastern contact of the Lewisian Gneiss is \nalso a thrust (the Cnoc an Droighinn Thrust) that locally emplaces Pipe Rock onto Lewisian \nGneiss (Point C).  Near Point D, east-dipping dip slopes of Pipe Rock occur, whilst farther east \nBasal Quartzite occurs at Point E.  This suggests the presence of another thrust, termed here the \nPoll an Droighinn Thrust between these two points, although outcrop is poor.  The Poll an \nDroighinn Thrust is interpreted here as a later breaching thrust (see below). Farther east, and \nstructurally higher still, is the Beinn Uidhe Thrust, which has the eastern body of Lewisian Gneiss \nin its immediate hanging wall.  In the north, the Beinn Uidhe Thrust is traced along the SW slopes \nof the Beinn Uidhe plateau (via point H), emplacing Basal Quartzite over Pipe Rock, whilst to the \nsouth the thrust is traced along the slopes beneath the Beinn an Fhurain plateau (point G). A \nfurther subsidiary thrust (the Loch nan Cuaran Thrust) occurs east of, and structurally above, the \nhigher Lewisian Gneiss body; this thrust is  a splay branching off the Beinn Uidhe Thrust at \npoints G and H.  The thrust has only minor displacement but commonly thickens Pipe Rock or \nBasal Quartzite , and locally emplaces Basal Quartzite over Pipe rock (east of Point G, Fig. 4).  \nNorth of Poll an Droighinn between the Glencoul and Ben More Thrusts, it not only \nappears there is repetition (in map and section view, Figs. 4 and 6a) of the two Lewisian Gneiss \nbodies but also of the thrusts surrounding the two bodies. Thus, the Beinn Uidhe Thrust appears \nto be equivalent to the Glas Bheinn Thrust, both carrying Lewisian Gneiss in their hanging walls. \nThe Cnoc an Droighinn Thrust is equivalent to the Loch nan Cuaran Thrust, both minor thrusts \nstructurally above the Lewisian Gneiss bodies. Coward (1982) suggested that the two areas of \ngneiss were originally part of a single mass, disrupted by a NW-dipping extensional fault as part \nof a ‘surge zone’.  This putative extensional fault would extend from Inchnadamph NE ward, via \nPoll an Droighinn and point I, to the Leathaid Riabhaich gully and would have resulted in the \nwestern Lewisian Gneiss body being dropped down by some 400 m to the west with respect to \nthe eastern body (Coward 1982). The new revision mapping however demonstrates that strata and \nthrusts between Beinn Uidhe and Beinn an Fhurain show too much continuity to allow such \ndisplacement and invalidates the interpretation of Coward.  Furthermore, we find no evidence that \nthe cross fault identified in the lower reaches of the Allt Poll an Droighinn continues to the NE \ntowards Point I, rather it trends E-W and probably connects to cross-faults farther east near Point \nG (Poll an Droighinn Fault on Fig. 4). Moreover, the northern cross fault near Point I displaces \nthe Beinn Uidhe thrust and a small fold and has limited (< 50 m) down-to-the-east displacement. . \n Page 6 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \nThe contact at Leathaid Riabhaich was re-interpreted by Krabbendam & Leslie (2004) as the trace \nof the Ben More Thrust, steepened above an oblique culmination wall, rather than an extensional \nfault. \nWe prefer instead to explain the gross duplication by a breaching thrust that repeated an \nalready thickened series of thrust sheets.    The most likely candidate for such a breaching thrust \nis the Poll an Droighinn Thrust (Figs. 4, 6a); some (later?) breaching movement may also have \nbeen taken up by Cnoc an Droighinn Thrust, as this locally emplaces Pipe Rock over Lewisian \nGneiss (Point C), a younger-over-older relationship commonly seen with breaching thrusts.  \n  \nThe Droighinn Anticlinal Stack \nThe thrusts traced southward from Cnoc an Droighinn are folded over an anticlinorium – the \nDroighinn Anticline of Bailey (1935) and Coward (1982), (Fig.4). This fold is presumably \nformed by antiformal stacking of underlying thrust imbricates; however, the core of the anticlinal \nstack is nowhere exposed and so its components and internal architecture cannot be constrained \n(Fig. 6d).  North of the Poll an Droighinn Fault at least two antiformal folds occur, separated by \nthe Glas Bheinn Thrust; to the south of the Fault the antiform continues as a single structure and \ncrosses the River Traligill at the trace of the Gleann Dubh Fault (Point J, Fig. 4). The continuity \nof the anticline across the Poll an Droighinn Fault implies that this cross-fault cannot have \nsignificant displacement (Bailey 1935; c.f. Coward 1982).  The axis of the Droighinn Anticline \ntrends c. 130-310°, markedly oblique to the thrust transport direction (Coward & Kim, 1981). \nSouth of the Poll an Droighinn Fault, the Droighinn Anticline has a monoformal profile \nwith a gently NE-dipping limb and a moderate to steeply SW-dipping limb, the latter exposing \nextensive quartzite dip-slopes.  On the NE limb three thrusts occur: the uppermost is the Beinn \nUidhe Thrust, marked by a small occurrence of Lewisian Gneiss in the immediate hanginwall in \nthe north (near Point G).  The middle thrust is termed the Beinn an Fhurain Thrust marked by a \ndistinct nick in the west slope of Beinn an Fhurain; here it emplaces a folded sequence of Basal \nQuartzite and Pipe Rock over Pipe Rock and a thin sliver of An t-Sron Formation (Point F).  The \nBeinn an Fhurain Thrust possibly links with the Poll an Droighinn Thrust.  The lowermost thrust \nis discussed later.  \n \nThrust architecture south of Traligill Transverse Zone \nThe thrust architecture south of the Traligill Transverse Zone is dominated by the Breabag – \nStronchrubie system that stretches from the Sole Thrust in the east, to Glen Oykel in the west \nwhere it is overlain by the Ben More Thrust (Figs. 5, 6b, 6c).  In the north, the Traligill Thrust (Tr \non Fig. 5) forms a convenient boundary, whilst in the south the system appears to be truncated by \nthe Loch Borralan Pluton in an area of poor exposure. The quartzite-dominated Breabag Dome \nstructure in the east and the dolostone-dominated Stronchrubie imbricates in the west were \nregarded by Peach et al. (1907), and by Elliott & Johnston (1980), as separate thrust systems. \nHowever, Coward (1984) demonstrated that individual horses can be traced from the Breabag \nDome into the Stronchrubie imbricates, thus collectively forming a single thrust duplex system.  \nCoward’s work (1984) is, with only minor modifications, the basis of the published revised \ngeological map and cross-section for this area (British Geological Survey 2007). The thrust sheets \nare arranged within an anticlinal stack termed the Breabag Dome (Fig. 6c), such that strata dip \nwestward towards the Foreland on the western slopes of Breabag and are commonly well-\nexposed in large-scale dip-slopes.  East of the hinge, thrusts and strata dip eastward.  The axis of \nthe Breabag Dome trends north-south and approximately follows the summit ridge of Breabag \n Page 7 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \n(Fig. 5). The thrusts in the Stronchrubie imbricate system dip gently to the east and the hinge \nzone of the gentle intervening, north-south syncline underlies the three klippen of Cnoc nan \nUamh, Beinn nan Cnaimhseag and Beinn an Fhuarain. The latter two klippen comprise Torridon \nGroup rocks and quartzite and are generally regarded as part of the Ben More Thrust sheet (Peach \net al. 1907; Geological Survey of Great Britain1923; Elliot & Johnson 1980).  In contrast, the \nCnoc nam Uamh Klippe contains Pipe Rock and An t-Sron Fm and is described further below.  \n The Breabag Dome comprises at least six discrete thrust sheets, with the lowest thrust (1) \nexposed in the topographical depression of Cùil Dhubh (point P on Fig. 5) , and the highest (6) in \nthe SE near Point Q (Fig. 5).  Thrusts (2), (3) and (4)  have a considerable strike length (c. 8 km) \nand can be traced from the Loch Borralan Pluton in the south to Gleann Dubh and Bealach \nTraligill. However, subsidiary thrust (5a) is confined to Breabag and Glen Oykel, and the \npositions of the westerly branch points of this thrust are reasonably well constrained on the ridge \nof Breabag (see purple dots marking branch points on Figure 5). The easterly branching points are \nless well constrained as they occur in the poorly exposed valley floor of Glen Oykel. Thrust (4a) \nonly occurs in the southern part of the Breabag Dome.    \n Individual thrust sheets climb stratigraphy towards the west, so that their trailing edges \ncontain quartzite and their leading edges contain dolostone (Coward, 1984). This is best \nillustrated in thrust sheet (2) which exposes westerly dip-slopes of Pipe Rock and minor Basal \nQuartzite on the western slopes of Breabag, with wide outcrops of Fucoid Beds in the low ground \nnear point R (Fig. 5), giving way to gentle east-dipping to sub-horizontal Durness dolostones \nfarther west in the same thrust sheet.   \n In Glen Oykel in the east, three small inliers of Lewisian Gneiss, overlain by Basal \nQuartzite, occur within thrust sheets (4) and (5). This shows that these high-level thrust sheets \n’sampled’ the basement gneiss but it is not known whether the large thrust sheets farther west and \nlower down in the structural pile (e.g. thrust sheets (2) and (3)) also ‘sampled’ Lewisian Gneiss, \nas the critical levels are nowhere exposed. The eastern flank of the Breabag Dome is a composite \nfold-and-thrust duplex system and incorporates a number of separate fold hinges, some of which \nare spectacularly exposed, e.g. near point S (Fig. 5).  The very sinuous exposure pattern of thrust \n(5a) around point T is a consequence of the intersection of the valley topography and the \nmonoformally folded profile of the thrust. \nSouth-east from Inchnadamph, a large boggy area is underlain mainly by Eilean Dubh \nFormation dolostones. A great number of subsidiary thrusts occur in the so-called Stronchrubie \nimbricates. Two of these carry a sliver of the Sailmhor Formation, the highest stratigraphical level \npreserved in the Assynt District. Near point U on Fig. 5, the lower imbricates are admirably \nexposed in the Stronchrubie cliffs (a classic excursion stop, see Butler, in Alison et al. 1988) and \nit can be seen that the Stronchrubie thrust functions as the floor thrust to this system. The \nStronchrubie Thrust lies c. 70 m structurally above the Sole Thrust, which occur at the base of the \nStronchrubie cliffs.  Towards the NE, imbricates of Eilean Dubh Formation (locally also with \nGhrudaidh Formation) root into the Traligill Thrust (point V on Fig. 5).  The Traligill Thrust dips \nc.  20° to the SSW, and probably links with the Stronchrubie Thrust, albeit reoriented later (see \nbelow).  That stated, a direct link between these two thrusts has not been established due to \nstructural complexity and paucity of outcrop in the area immediately SE of Inchnadamph   \n \nThe Cnoc nan Uamh Klippe   \n Page 8 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \nThe Cnoc nan Uamh Klippe (Fig. 5) contains Pipe Rock, Fucoid Beds, and Salterella Grit; the \nklippe structurally overlies dolostones of the Stronchrubie imbricates.  Subsidiary thrusts occur \nwithin the klippe and emplace Pipe Rock over Fucoid Beds  and create repetitions of Fucoid Beds \nand Salterella Grit.  Some 500 m to the east is another small klippe of steeply dipping Pipe Rock; \nthis klippe and the Cnoc nan Uamh klippe probably belong to the same thrust sheet. It is unlikely \nthat the Cnoc nan Uamh klippe belongs to the Ben More Thrust Sheet, since klippen to the south \ncomprise mainly Torridon Group rocks.  A link with the Beinn an Fhurain or Beinn Uidhe thrust \nsheets is more likely, but cannot be proven.   \n \nSummary of thrust structures on either side of the transverse zone \nTo summarise, north of the Traligill Transverse Zone there are two major thrusts, repeated by \nlater breaching.  The thrust sheets are relatively thick (up to 500 m) and individual thrusts must \nhave taken up several kilometres of displacement in order to emplace Lewisian Gneiss over Pipe \nRock (Fig. 6a). Thrusting involved thick slabs of Lewisian Gneiss and Eriboll Formation \nquartzite; stratigraphically higher formations are essentially absent, so that thrusting clearly \nworked low in the stratigraphical succession and ‘dug’ deep into basement.  \n In contrast, thrusting to the south of the TTZ is predominantly thin-skinned, involving \nmainly cover strata. Thrust sheets are much thinner and more numerous (at least 6) than north of \nthe TTZ. Thrust sheets typically lack the incorporation of thick slices of basement gneiss.    \n \nTraligill Transverse Zone and its cross faults   \nAny attempt to establish links (or otherwise) between the different thrust geometries on either \nside of the Traligill Transverse Zone, necessitates the study of the high-angle en-echelon fault \nsystem that is associated with the transverse zone. That system of faults is aligned with the \nProterozoic WNW-ESE trending Stoer Shear Zone, which has been identified within the \nLewisian Gneiss in the Foreland (Cartwright et al. 1987, British Geological Survey 2002a, 2007). \nThe Stoer Shear Zone, although not studied in detail, is similar to the Canisp Shear Zone farther \nsouth (Fig. 2). The Canisp Shear Zone is a km-wide shear zone, formed by repeated ductile \nmovement during the so-called Inverian amphibolite-facies event at c. 2500 Ma and more \nlocalized ‘Laxfordian’ movement between 1700 and 1600 Ma (Attfield 1987, Park et al. 2002).  \nBeacom et al. (2001) showed that the Canisp Shear Zone also experienced wide-spread brittle \nreactivation. The Stoer Shear Zone can be traced to the western end of Loch Assynt.  Loch \nAssynt is a (glacial) erosional trough excavated along a fault that displaces the Cambro-\nOrdovician sequence and the Sole Thrust (see below); this fault is termed here the Loch Assynt \nFault.  It is likely that the Loch Assynt Fault represents brittle reactivation of (part of) the Stoer \nShear Zone.    \nFarther ESE within the Assynt Culmination,  there are two separate faults (Gleann Dubh \nFault, Bealach Traligill Fault), arranged in en echelon fashion (Figs 4, 5, 7 a, b). The Gleann \nDubh and Bealach Traligill Fault have an overlap of c. 1 km and a c. 300 m wide relay ramp.  \nBetween the Gleann Dubh and the Loch Assynt Fault there is no overlap; instead there is a c. 2 \nkm long gap without fault separation (between the Cnoc nam Uamh Klippe and Inchnadamph; \nFig. 5).  There are three separate piercing point pairs that constrain the true displacement of the \ndifferent segments of this cross-fault system. Each is assessed in turn below. \n Page 9 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \nIn the east, the Bealach Traligill Fault (also called Traligill Pass Cross Fault, Elliott & \nJohnson 1980) has a strong topographical expression near point W; here a spectacular gorge is \nlined with strongly fractured and locally brecciated quartzite (Figs. 5, 7a,b). In the east, this fault \ndisplaces the Moine Thrust and the Ben More Thrust Sheet, with an apparent sinistral \ndisplacement of c. 250 m (see also Fig. 2). West of the Ben More Thrust, precise constraints are \nprovided by the displacement of An t-Sron Formation on either side of the fault, WNW of \nBealach Traligill (Fig 5, 7b). The axis of the Breabag Dome fold provides a reliable piercing \npoint that further constrains fault displacement. The displacement is c. 360m, with a sinistral \nstrike slip component of c. 300 m and a downthrow to the NE of c. 200 m (Fig. 7c).  \n  The Bealach Traligill Fault stops short of the trace of the Droighinn Anticline and \ndisplacement is taken up on another fault, the Gleann Dubh Fault, in an en echelon arrangement \n(Fig. 7b). This fault displaces the Droighinn Anticline, the axis of which provides another reliable \npiercing point. The displacement of this piercing point involves c. 90 m sinistral with c. 20 m \ndownthrow to the NE (Fig. 7d).  This strike-slip movement is corroborated by shallow NE-\nplunging slickenlines on an exposed fault surface at [NC 2795 2065]. This segment of the fault \nmust die out towards the NW, as the SW limb of the Droighinn Anticline shows little or no \ndisplacement.  \nIn the Foreland, the Loch Assynt Fault displaces the so-called Double Unconformity.  \nThe Double Unconformity is the intersection of the base-Cambrian  unconformity, which dips c. \n10-12 degrees to the east, and the base-Torridon unconformity, which is broadly sub-horizontal. \nThis intersection line trends NNE-SSW (Fig. 7a), at high angles to the Loch Assynt Fault. On the \nsouth side of Loch Assynt, the Double Unconformity intersection is about 100 m above loch \nlevel, whilst on the north side it lies c.20 m below loch level. Piercing point analysis shows that \nthe Loch Assynt Fault has a sinistral displacement of c. 1300 m, with a downthrow to the NE of c. \n120 m (Fig. 7e).   \nThe Loch Assynt Fault, lying outside the thrust belt, records the cumulative fault \ndisplacement accumulated since deposition of the Cambro-Ordovician sequence, i.e. the sum of \npre-thrust, syn-thrust and post-thrust displacements. In contrast, the Glean Dubh and Bealach \nTraligill Faults only record displacement accumulated since the formation of the anticlinal fold \nstructures, i.e. syn- and post-thrust displacements. The cross-faults within the Traligill Transverse \nZone thus experienced c. 1000 m of sinistral displacement along the Loch Assynt segment prior \nto thrusting, but were reactivated after thrusting, with only some 300 m syn- to post thrusting \ndisplacement. The model in Fig. 8 summarises the main features of the pre-thrust template, \nillustrating how prior to thrusting a c. 100 m high step in the cover and basement had developed.  \nTwo conclusions can be drawn from this piercing point analysis: \n1) Sedimentary strata did not form continuous, uninterrupted planes prior to thrusting, but \nhad already been transected, and displaced, by one (or more) normal faults, whose trend \nwas at a small angle to the subsequent thrusting direction; \n2) Displacements within the thrust belt (along the Gleann Dubh and Bealach Traligill faults) \nare limited, thus potentially allowing for reliable linkages to be established between the \nthrust system north and south of Traligill. \nLinks across the Traligill Transverse Zone  \n Page 10 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \nThe Ben More Thrust and the Sole Thrust  can be easily traced across the Traligill \nTransverse Zone (Figs. 2, 5).  Around Bealach Traligill, the sequence of An t- Sron and \nGhrudaidh formations that crops out on either side of the Bealach Traligill Fault provides an \nimportant marker (point W on  Figs. 5, 7).  These rocks are overlain by a major thrust (6), \ncarrying Basal Quartzite.  This thrust can be traced through the west wall of Conival towards the \nnorth to thrust (6’), where it links directly with the Beinn Uidhe Thrust. The Beinn Uidhe Thrust \nand Thrust (6) merge with the Ben More Thrust some 600 m SE of Bealach Traligill (Fig. 5).   \nSimilarly, thrust (5), which carries An t-Sron and Ghrudaidh formations in its \nhangingwall, can be confidently traced across to the north side of the Bealach Traligill Fault (as \nthrust 5’). However, its fate farther to the NNW is unclear. The region around point X (Fig. 5) is \nextremely complicated and only moderately well exposed.  Overall, the situation is that the axis \nof the Breabag Dome plunges to the north, whilst the Droighin Anticline plunges towards the SE, \nboth towards Point X.  A tight, cuspate synclinal saddle structure lies in between.  Moreover, \nnumerous thrusts appear to branch off from each other, both near point X and farther NW (see \npurple dots on Figure 5), in an interlocking manner, so that it becomes a difficult to establish \nwhich individual thrust links with which.   \n Lower down in the thrust pile, the Traligill Thrust is a major thrust, well exposed in the \nTraligill Valley (Tr on Figs. 4, 5).  Here, it strikes WNW –ESE, sub-parallel to the thrust \ntransport direction. Imbricates of Durness Group dolostones which belong to the Stronchrubie-\nBreabag system are well-defined in the hanging wall of this thrust, and it is likely that the \nTraligill Thrust and the Stronchrubie Thrust are the same structure (see earlier discussion). A \ncontinuous sequence all the way down from Eilean Dubh Formation to Basal Quartzite occurs in \nthe footwall of the Traligill Thrust,  (this is probably the sequence which led Murchison astray). \nThe strata in the footwall of the Traligill Thrust and the thrust itself are folded by the Droighin \nAnticline. Consequently, the Traligill Thrust can be traced beneath the Cnoc an Uamh Klippe , is \nfolded over by the Droighinn Anticline, and links to the westernmost thrust below Beinn an \nFhurain (termed here the Northern Traligill Thrust, Fig. 4; see also Elliott & Johnson 1980, Fig \n15).  The key now is how this Northern Traligill Thrust links with those to the north of Poll an \nDroighinn Fault (Figs. 4, 6d).  If the Beinn an Fhurain Thrust links with the (breaching) Poll an \nDroighinn Thrust, than it is likely that the Northern Traligill Thrust links with Glas Bheinn Thrust \nand that the Glencoul Thrust underlies or splays southwards into the concealed Droighinn \nAnticlinal Stack (e.g. Elliot & Johnson 1980).  Another (end member) possibility is that the Poll \nand Droighinn breaching thrust and its related breaching peters out near Poll an Droighinn; in that \ncase the Beinn an Fhurain Thrust links with the Cnoc Dubh Thrust (folded over the Droighinn \nAnticline) and  the Northern Traligill Thrust could link with the Glencoul Thrust, again folded \nover the Droighinn Anticline.  This is attractive as both the Glencoul and Traligill thrust serve as \nmajor floor thrusts, but it would require that the Droighin Anticline developed after the \ndevelopment of the Glencoul – Traligill – Stronchrubie Thrust system.   \nIn summary, some individual thrusts can be linked across the Traligill Transverse Zone, e.g. \nthrust (6) with the Beinn Uidhe Thrust. The Traligill Transverse Zone in upper Gleann Dubh is \nmarked by a cuspate synclinal saddle, in between the two lobate anticlines (Droighinn and \nBreabag Dome). Whether the Glencoul Thrust links directly to the Traligill Thrust is uncertain, \nbut overall the Glencoul Thrust Sheet (sensu lato) grades into the Breabag – Traligill – \nStronchrubie imbricate system by extensive splaying or interfingering with some thrust sheets \nwedging out to the north, and others to the south (Fig. 6d).   \n Page 11 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \n \nDiscussion \nThe Traligill Transverse Zone that disrupts the thrust structure in Central Assynt has the \nfollowing pertinent characteristics.   \n The Traligill Tranverse Zone developed sub-parallel to, and structurally above, a pre-\nexisting fault (the Loch Assynt Fault) that displaced both basement and cover prior to \nthrusting. Fault displacement was sinistral with a component of down-throw to the NE. \nNo stratigraphical changes occur across fault; the fault is post-depositional (post Early-\nOrdovician), although it reactivated the long-lived ductile Proterozoic Stoer Shear Zone \nidentified in the Lewisian basement. Minor displacements occurred syn- to post-thrusting. \n The thrust system to the south is characterised by numerous, thin thrust sheets, mainly \ninvolving thin cover strata; to the north there are fewer but thicker thrust sheets, \ninvolving thick basement slivers.  The thrust front in the north also propagated further, \nresulting in a bend in the thrust front.  The two thrust systems are linked by complex \ninterfingering and branching across the Traligill Tranverse Zone.  \n The Droighinn Anticline in the north and the Breabag Dome axis in the south both plunge \ntowards the cross-fault; the complimentary synform in the centre is an extremely \ncomplicated, cuspate saddle structure. \n The vertical displacement on the Loch Assynt Fault (c. 100 m) is relatively small \ncompared to the scale of the transverse zone. On the NE side of the fault system, the \namplitude of the Droighinn anticlinal stack is of the order of 1000 m (Figure 6d).  It thus \nappears that the scale and complexity of the disturbance associated with the Traligill \nTransverse Zone grew larger with time, starting from an original relatively minor \ndisturbance. This may be explained, at least in part, by oblique ‘piling-up’ of thrust sheets \nby sinistral transpression against the initial basement step.  \n Sinistral transpression is likely to have occurred as a consequence of the small angle \nbetween the strike of the Loch Assynt Fault (305°N) and the thrust transport direction (c. \n290°N; McClay and Coward 1981); this is schematically shown on Fig. 8. Sinistral \ntranspression is also supported by the strain measurements (using Skolithos pipes as strain \nmarkers) of Coward and Kim (1981). They documented moderately strong sinistral \nshearing combined with east-west to ENE-WSW contraction within thrust sheets on the \nnorth side of the Traligill Transverse Zone. The highest sinistral shearing (γ = 0.5 - 0.6) \nwas observed in the core of the Droighinn Anticline. It should be noted that the oblique \norientation of the Droighinn Anticline (within c. 20° of the thrust transport direction) \ncannot solely be explained by rotation of the fold axes (like sheath folds or flow \nperturbation folds, Cobbold and Quinquis 1980; Alsop and Holdsworth 2004); the \nsinistral shear strains measured by Coward and Kim (1981) are not sufficient (γ < 0.6) to \ngenerate such a rotation.  Instead the Droighinn Anticline, and its associated (concealed) \nanticlinal stack, must have primarily formed in a highly oblique orientation, with little \nsubsequent rotation (see also Coward & Kim, 1981 and Coward and Potts 1983); again \nthis is consistent with local transpression.    \n \nTransverse zones and their origin: comparisons with other thrust belts \nThrusts and nappes in many fold-and-thrust belts commonly show a remarkable lateral continuity \n(eg. Canadian Rocky Mountains; Price, 1981), all thrusts and nappes have to stop somewhere. \nAbrupt lateral changes in thrust architecture commonly occur along so-called transverse zones. \n Page 12 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \nStructures that connect thrusts from one side to the other across the transverse zone can include \nlateral and oblique ramps and strike-slip faults, grouped together as “lateral connectors”  \n(Thomas, 1990). Specific studies on lateral thrust terminations and transverse zones in thrust belts \ninclude studies in the Appalachians (Mitra 1988, Thomas and Bayona 2002); Rocky Mountains in \nUtah (e.g. Paulsen & Marshak 1988, 1997) and in Canada (Fermor 1999; Bégin and Spratt 2002); \nthe Andes (Mon et al. 2005, Hinsch et al. 2002); Alps (Laubscher  1985); Pakistan (McDougall \nand Khan 1990) and the Pyrenees (Soto et al. 2002).  Less sharp changes in thrust architecture \ninvolving curvature of the thrust front are related to the salient-recess problems and are \nparticularly well studied in the Appalachians (e.g. Tull & Holm 2005).   \n Transverse zones in thrust belts can have a number of causes.  On the large-scale, one of \nthe tectonic plates involved can be an indentor, the India – Asia collision being a good example.  \nAt the edges of such an indentor numerous strike-slip and transverse zones are likely to develop \n(McDougall & Khan 1990). However, there are a number of smaller-scale causes, more relevant \nto this study in the Moine Thrust Belt: \n   \n1) Lateral facies changes in the stratigraphy without basement faulting (Fig. 9a).  Such \nchanges, however, are not necessarily aligned with the thrust transport direction, nor \nconcentrated along a particular zone.  Such changes, therefore, would be expected to have \na gradual, tapering effect on the overall thrust geometry, a good example being the study \nof Soto et al. (2002) in the southern Pyrenees.  However, if the lateral facies changes \ninvolve ‘easy glide horizons’ (e.g. shale or evaporates) the effects may be more \npronounced. \n2) A basement fault not affecting overlying strata, with the cover strata having a flat \nunconformity (Fig. 9b), i.e. without post-depositional displacement. Such a structure \nwould only affect the thrust architecture if thrusting involved the basement. An additional \neffect may develop if there is a distinct difference in orientation of the principal fabric \nwithin the basement, for instance if the fabric is sub-horizontal on one side and sub-\nvertical on another. Lateral changes within the Moine Thrust Belt across the Laxford \nShear Zone may be a good example of this situation (see also discussion below).  \n3) Thickness variations in the stratigraphy above a basement fault (Fig. 9c); in this case the \nbasement fault must have been active during deposition of the cover strata. In the Sevier \nfold-thrust belt, Utah, Paulsen & Marschak (1999) document a thickness variation in \nProterozoic to Permian strata from 3 to 9 km across the Charlestown Transverse Zone; \nthis thickness variation is interpreted to be the result of normal faulting in the \nPrecambrian basement. On the down-thrown side, where the sedimentary package is \nthickest, thrusts propagated farthest onto the foreland and involved thick thrust sheets, \ncomprising sedimentary strata only.  On the up-thrown side, basement slices are involved \nin the thrusting. The Charlestown Transverse Zone above the interpreted basement fault \nlinks thrusts on either side via a complex zone of lateral ramps and strike-slip faults. At a \nlate stage (possibly due to a slight change in transport direction to a more transpressive \nregime?) the Uinta-Cottonwood arch developed, oriented at right angles to the thrust \nfront.   \n4) A basement fault that affected overlying strata after deposition, so that the cover strata \nrest upon a planar unconformity, which is subsequently displaced (Fig. 9d); this is the \nsituation described in the Traligill Transverse Zone.  Such a fault would have an effect on \n Page 13 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \nthe thrust architecture if thrusting affected cover rocks only, but also if it affected cover \nand basement. \n \nCalassou et al. (1993) used sand box modelling to study the effects of a basement fault in the \nfootwall exactly parallel to the thrust direction, but with a uniform hangingwall, very much like \nthe situation (4) above. The model of Calassou et al. (1993) showed:  \n1) lateral interfingering of thrust sheets, both in map view and in cross-section along the \ntranverse zone,  \n2) thrusts developing above the down-thrown side of the basement fault propagating further \non the foreland, defining a bend in the thrust front,  \n3) a different thrust geometry in the compartments on either side of the transverse zone, \nwith fewer but thicker thrust sheets on the downthrown side.   \n \nThese features are similar to the situation across the Traligill Transverse Zone. However, the \ndifference with Assynt is that the scale of the transverse zone in the models is proportional to the \nbasement step, and no oblique anticlinal stacking developed.  This is probably because the \nbasement fault in the models was positioned exactly parallel to the thrust transport direction, a \nsituation that would be rare in nature.    \n \nAn additional factor of importance, therefore, is the angular relationship between the strike of the \npre-existing fault and the subsequent thrust transport direction. In Figs. 9c and 9d, if the transport \ndirection is clockwise from the strike of the fault, thrusts need to ramp up and over the basement \nstep, and local transpression is expected.  Conversely,  if the transport direction is anticlockwise \nfrom the strike of the fault, thrusts would ‘descend’ the basement step, and local transtension is \nexpected.   \nIn many cases where pre-existing basement faults are invoked as a parent structure to a transverse \nzone, the contact of the transverse zone with the basement is concealed by external parts of the \nthrust belt or by its foreland basin.  For instance, in the Canadian Rocky Mountains, a number of \nlateral changes in thrust architecture are well documented and thought to relate Proterozoic \nbasement shear zones (eg. McMechan 2002; Bégin and Spratt 2002 and references therein).  \nHowever, a 400 km wide foreland basin separates the thrust front from Proterozoic outcrop and \nthe nature of the shear zones can only be constrained by drilling and geophysical means (eg. Ross \net al. 1991; Pana 2003).  This means for instance that in NE British Columbia (McMechan 2002) \nit is difficult to distinguish between scenario 3) and 4) above. In the case of the Moine Thrust Belt \npost-Caledonian tilting, uplift and erosion has fortuitously revealed the foreland basement in \ncontact with the thrust belt, allowing good constraints on the character and displacement of the \npre-existing basement structure, and its link with the thrust belt, as shown by the detailed piercing \npoint analysis.  \n \nOther transverse zones in the Moine Thrust Belt and Moine Nappe \nThe Lewisian gneiss basement in the Foreland of the Moine Thrust Belt contains a number of \nWNW-ESE striking Palaeoproterozoic shear zones (Fig. 1; Coward & Park 1987, Attfield 1987, \nBeacom et al. 2001, Kinny et al. 2005). In outline, the effects of these shear zones on the Moine \nThrust Belt are as follows (described from north to south – see Fig. 1 for locations): \n \n Page 14 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \n1) The Rispond Shear Zone is a steep zone of ductile shearing (Ramsay 1997).  The later \nFaraid Head Fault lies parallel to the shear zone and is long recognised to be responsible \nfor down-faulting the Moine Thrust Belt to the north (Peach et al. 1907), probably \nduring the  Devonian or Permo-Triassic (Holdsworth et al. 2007).  There is no direct \nevidence that the Rispond Shear Zone was reactivated as the Faraid Head Fault \n(Holdsworth pers. comm. 2008).  Moreover,where the shear zone runs under the thrust \nbelt, the thrust architecture is dominated by the Arnaboll, Lochan Rhiabhach and Moine \nthrusts.  These thrusts are rather continuous along strike and do not show a pronounced \ntransverse zone  across the projected trace of the shear zone (Holdsworth et al. 2007; \nBritish Geological Survey 2002b). Farther SE (south and east of Eriboll) there are lateral \nramps in the thrust belt (Holdsworth et al. 2006); the nature of the Rispond Shear Zone \nhere is unclear and a link between the two structures would require further study. \n2) The Laxford Shear Zone is a wide shear zone (Beach et al. 1974; Goodenough et al. \n2009; this volume), the southern part of which lines up with Loch More. Here, neither \nthe Sole Thrust nor the Cambro-Ordovician sequence in the Foreland are much \ndisplaced, so little post-Ordovician movement has occurred on faults related to the \nLaxford Shear Zone. As no Torridon Group rocks occur in the Foreland or in the thrust \nbelt in this region, it cannot be determined whether post-Torridon movement occurred \nalong the shear zone.  However, c. 2 km south of Loch More is a major oblique ramp \n(Elliot & Johnson 1980) marking the termination of a large thrust sheet with a thick \nbasement sliver, with the Bhuirich Dome also occurring here (Butler 1984, British \nGeological Survey 2007). It is likely that these major lateral changes in thrust \narchitecture were at least in part rooted above the Laxford Shear Zone.  \n3) The Stoer Shear Zone underlies the Traligill Transverse Zone as already described. \n4) The Canisp Shear Zone is another wide shear zone, associated with a monoclinal \nsteepening of the fabric in the Lewisian basement (e.g. Attfield 1987) and demonstrable \nbrittle reactivation (Beacom et al. 2001). The Sole Thrust and base-Cambrian \nunconformity in the Foreland are not appreciably displaced.  Nevertheless, the Canisp \nShear Zone does line up with the Loch Borralan Pluton and the approximate southern \ntermination of the Ben More Thrust Sheet (British Geological Survey 2007). It also \napproximately lines up with the Oykel Transverse Zone (Leslie et al. 2009, this volume), \nsee below. \n5) The Gruinard Shear Zone coincides with the apparent northern termination of the \nKinlochewe Thrust Sheet. It should be noted that between the Assynt Culmination and \nthe Kinlochewe Thrust Sheet, there are only a few small-scale culminations (at \nLangwell, Ullapool, Dundonell) and that the Moine Thrust over much of this segment is \na simple, smooth structure.  \n6) The Loch Maree Fault is a major NW-SE trending fault, associated with a number of \nother faults and parallel to relatively narrow Proterozoic (Laxfordian) shear zones (Park \n2002). It has major pre-Torridon movement (slicing the outcrop of the Loch Maree \nGroup in two) as well as post-Torridon movement, which near Poolewe in the west must \nhave dropped down the base-Stoer Group unconformity by at least 1500 m (Park 2002, \nBritish Geological Survey 1999).  In the east, the Loch Maree Fault cuts through the \nentire Moine Thrust Belt and thus must have also experienced post-Caledonian \nmovement. The Loch Maree Fault is coincident with the SE boundary of the Kinlochewe \nThrust Sheet comprising a thick sheet of Lewisian Gneiss with minor Torridon Group \n Page 15 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \nrocks. It forms the NW boundary of the Achnashellach Culmination, which is \ncharacterised by medium-thick skinned thrusting involving abundant Torridon Group \nrocks and minor basement slivers (Butler et al. 2007).  The thickness of Torridon \nsandstone in the Achnaschellach thrust sheets is considerably more than in the \nKinlochewe Thrust Sheet (Butler et al. 2007).  \n7) The Torridon Shear Zone (also termed Diabaig or Shieldaig Shear Zone) at Loch \nTorridon (Wheeler et al. 1987; Wheeler 2007) lines up to the SE with a change from the \nAchnashellach Culmination in the north to (in the south) thin-skinned thrusting of \nCambro-Ordovician strata at Loch Kishorn and the Kishorn Nappe, with its massive \nbasement slice in Lochcarron and even larger Lochalsh fold-nappe (e.g. Coward & Potts \n1985). However, neither the Sole Thrust nor the base-Cambrian unconformity are \ndisplaced in this area, suggesting lack of Palaeozoic or later reactivation along this shear \nzone.   \n8) The Oykel Tranverse Zone is a major transverse zone in the ductile Moine Nappe, above \nthe Moine Thrust, to the SE of the Assynt Culmination, (Leslie et al. this volume). In \npart due to the thick uniform nature of the Morar group rocks, thrust sheets are thicker \nand the whole process works on a larger scale.  Regional gravity data modelling have \nbeen used to argue that the Oykel Transverse Zone was generated above an underlying \nramp in the basement-cover interface (Leslie et al. this volume).  This ramp is \ninterpreted as the result of re-activation of a WNW-ESE trending sub-vertical basement \nshear zone, possibly the Canisp Shear Zone.  \n \nOverall, it is clear that the lateral variations in thrust architecture along the length of the Moine \nThrust Belt are strongly influenced by the existence of Proterozoic shear zones, and the brittle \nfaults that commonly developed along these shear zones.  These shear or fault zones trend WNW-\nESE to NW-SE, and were thus aligned at small angles (10 – 15°) to the thrust transport direction \n(towards c. 290 °). Some faults cut through the entire thrust belt (Loch Maree Fault); other faults \nappear not to have displaced the base-Cambrian unconformity (Laxford Shear Zone, Torridon \nShear Zone; see scenario depicted in Fig. 9b), but still appear to mark lateral changes in thrust \ngeometry, others have little influence. These different relationships depend probably upon \nwhether or not the causal structures experienced Neoproterozoic or Palaeozoic (brittle) \nreactivation, displacing the Torridon or Cambro-Ordoovician sequence.  It is probable that many \nof the NW-SE shear zones were reactivated during Iapetan rifting as transfer or strike-slip faults, \nseparating normal-fault blocks (c.f. Lister et al. 1986). Superficially, it appears coincidental that \nsuch (rather distal) rift-related transfer zones would be appropriately oriented to become thrust-\nrelated transverse zones, several hundred million years later.  However, if continental collision \nand related thrusting is approximately frontal with respect to the older rifted, passive margin it \ndeforms, than such ‘coincidences’ may become the rule rather than the exception, as also argued \nin the Appalachians (Tull & Holm 2005).   \n \nConclusions \nThe Traligill Tranverse Zone in the Assynt Culmination in the Moine Thrust Belt marks a \npronounced lateral change in thrust architecture. To the south, thrusting is predominantly thin-\nskinned and involved mainly cover strata dominate whilst to the north few, but thick-skinned, \nthrusts sheets were generated, each typically containing thick basement slivers. This northern \ndomain also was thrust farther onto the Foreland. Whilst some individual thrusts can be linked, \n Page 16 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \nthere is extensive interfingering of thrusts across the transverse zone. A large oblique anticlinal \nstack occurs.  The Transverse Zone overlies a pre-existing fault (Loch Assynt Fault), oriented at \nsmall angles to the thrust transport direction. Piercing-point analysis shows this fault records pre-\nthrusting as well as syn- to post thrusting displacement. The pre-thrusting faulting caused a step \nin the basement and cover strata of about 100 m. The resultant Transverse Zone is much larger in \nscale than the original step; this enhancement was probably caused by oblique, transpressional \nthrust stacking. The study shows that relatively small disturbances in the pre-thrusting template \ncan lead to significant lateral variations in thrust geometry. A number of shear zones with similar \ntrends are related to other lateral variations along the length of the Moine Thrust Belt.  \n \nReferences \nAllison, I., May, F. & Strachan, R. 1988. An excursion guide to the Moine geology of the Scottish \nHighlands, Scottish Academic Press. \nAlsop, G. I. & Holdsworth, R. E. 2004. Shear zone folds; records of flow perturbation or structural \ninheritance? In: Alsop, G. I., Holdsworth, R. E., McCaffrey, K. J. W. & Hand, M. (Eds). Flow \nprocesses in faults and shear zones. Geological Society Special Publications, 224, 177-199. \nArmstrong, H., Raine, R. & Smith, M. P. 2006. Iapetus - From coast to coast.  ICOS 2006 post-conference \nfield trip, University of Birmingham, Birmingham. \nAttfield, P. 1987. The structural history of the Canisp Shear Zone. In: Park, R. G. & Tarney, J. (Eds). \nEvolution of the Lewisian and comparable Precambrian high grade terrains. Geological Society \nSpecial Publication, 27, 165-173. \nBailey, E. B. 1935. The Glencoul Nappe and the Assynt Culmination. Geological Magazine, 72, 151-165. \nBarr, D., Holdsworth, R. E. & Roberts, A. M. 1986. Caledonian ductile thrusting in a Precambrian \nmetamorphic complex: the Moine of NW Scotland. Bulletin of the Geological Society of America, \n97, 754-764. \nBeach, A., Coward, M. P. & Graham, R. H. 1974. An interpretation of the structural evolution of the \nLaxford front. Scottish Journal of Geology, 9, 297-308. \nBeacom, L. E., Holdsworth, R. E., McCaffrey, K. J. W. & Anderson, T. B. 2001. A quantitative study of \nthe influence of pre-existing compositional and fabric heterogeneities upon fracture-zone \ndevelopment during basement reactivation. In: Holdsworth, R. E., Strachan, R. A., Macgloughlin, \nJ. F. & Knipe, R. J. (Eds). The nature and significance of fault zone weakening. Geological \nSociety Special Publication, 186, 195-211. \nBégin, N. J. & Spratt, D. A. 2002. Role of transverse faulting in along-strike termination of Limestone \nMountain Culmination, Rocky Mountain thrust-and-fold belt, Alberta, Canada. Journal of \nStructural Geology, 24, 689-707. \n British Geological Survey. 1999. Gairloch, Scotland Sheet 91 and 100, Solid and Drift Geology. 1:50 000. \nBritish Geological Survey, Keyworth, Nottingham. \nBritish Geological Survey. 2002a. Point of Stoer, Scotland Sheet 107W, Solid and Drift Geology. 1:50 000. \nBritish Geological Survey, Keyworth, Nottingham. \nBritish Geological Survey. 2002b. Loch Eriboll, Scotland Sheet 114W, Solid Geology. 1:50 000. British \nGeological Survey, Keyworth, Nottingham. \nBritish Geological Survey. 2007. Assynt. Scotland Special Sheet. Bedrock. 1:50 000 Geology Series. \nBritish Geological Survey., Keyworth, Nottingham. \nButler, R. W. H. 1982. A structural analysis of the Moine Thrust Zone between Loch Eriboll and Foinaven, \nNW Scotland. Journal of Structural Geology, 4, 19-29. \nButler, R. W. H. 1984. Structural evolution of the Moine Thrust Belt between Loch More and Glendhu, \nSutherland. Scottish Journal of Geology, 20, 161-179. \nButler, R. W. H., Matthews, S. J. & Morgan, R. K. 2007. Structural evolution of the Achnashellach \nCulmination, southern Moine thrust belt; testing the duplex model. In: Ries, A. C., Butler, R. W. \nH. & Graham, R. H. (Eds). Deformation of the continental crust; the legacy of Mike Coward. \nGeological Society Special Publications, 272, 103-120. \n Page 17 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \nCalassou, S., Larroque, C. & Malavieille, J. 1993. Transfer zones of deformation in thrust wedges; an \nexperimental study. Tectonophysics, 221, 325-344. \nCallaway, C. 1883. The age of the newer gneissoic rocks of the northern Highlands. Quarterly Journal of \nthe Geological Society of London, 39, 355-422. \nCartwright, I. & Barnicoat, A. C. 1987. Petrology of Scourian supracrustal rocks and orthogneisses from \nStoer, NW Scotland: implications for the geological evolution of the Lewisian complex. In: Park, \nR. G. & Tarney, J. (Eds). Evolution of the Lewisian and comparable Precambrian high grade \nterrains. Geological Society Special Publication, 27, 93-107. \nChristie, J. M. 1963. The Moine thrust zone in the Assynt region, Northwest Scotland. University of  \nCalifornia Publications in Geological Sciences, 40, 345-440. \nCobbold, P. R. & Quinquis, H. 1980. Development of sheath folds in shear regimes. Journal of  Structural \nGeology, 2, 119-126. \nCoward, M. P. 1982. Surge zones in the Moine Thrust Zone of NW Scotland. Journal of Structural \nGeology, 4, 247-256. \nCoward, M. P. 1983. The thrust and shear zones of the Moine Thrust Zone of NW Scotland. Journal of the \nGeological Society of London, 140, 795-811. \nCoward, M. P. 1984. The strain and textural history of thin-skinned tectonic zones: examples from the \nAssynt region of the Moine thrust zone. Journal of Structural Geology, 6, 89-99. \nCoward, M. P. 1985. The thrust structures of southern Assynt, Moine thrust zone. Geological Magazine, \n122, 596-607. \nCoward, M. P. & Kim, J. H. 1981. Strain within thrust sheets. In: McClay, K. R. & Price, N. J. (Eds). \nThrust and Nappe Tectonics. Geological Society Special Publication, 9, London, 275-292. \nCoward, M. P. & Park, R. G. 1987. The role of mid-crustal shear zones in the Early Proterozoic evolution \nof the Lewisian. In: Park, R. G. & Tarney, J. (Eds). Evolution of the Lewisian and Comparable \nPrecambrian High Grade Terrains. Geological Society Special Publication, 27, 127-138. \nCoward, M. P. & Potts, G. J. 1983. Complex strain patterns developed at the frontal and lateral tips to shear \nzones and thrust zones. Journal of Structural geology, 5, 383-399. \nCoward, M. P. & Potts, G. J. 1985. Fold nappes: examples from the Moine Thrust Zone. In: Gee, D. G. & \nSturt, B. A. (Eds). The Caledonide Orogen - Scandinavia and related areas.  Wiley, 1147-1158. \nDallmeyer, R. D., Strachan, R. A., Rogers, G., Watt, G. R. & Friend, C. R. L. 2001. Dating deformation \nand cooling in the Caledonian thrust nappes of north Sutherland, Scotland: insights from \n40Ar\/39Ar and Rb-Sr chronology. Journal of the Geological Society, 158, 501-512. \nDubey, A. K. 1997. Simultaneous development of noncylindrical folds, frontal ramps, and transfer faults in \na compressional regime; experimental investigations of Himalayan examples. Tectonics, 16, 336-\n346. \nElliott, D. & Johnson, M. R. W. 1980. Structural evolution in the northern part of the Moine thrust belt, \nNW Scotland. Transactions of the Royal Society of Edinburgh: Earth Sciences, 71, 69-96. \nFermor, P. 1999. Aspects of the three-dimensional structure of the Alberta Foothills and Front Ranges. \nGeological Society of America Bulletin, 111, 317-346. \n Freeman, S. R., Butler, R. W. H., Cliff, R. A. & Rex, D. C. 1998. Direct dating of mylonite evolution; a \nmulti-disciplinary geochronological study from the Moine thrust zone, NW Scotland. Journal of \nthe Geological Society of London, 155, 745-758. \nGeological Survey of Great Britain 1923. Geological map of the Assynt District Scotland, 1:63 360. \nGoodenough, K. M., Park, R. G., Krabbendam, M., Myers, J., Wheeler, J., Loughlin, S., Crowley, Q., \nKinny, P., L, F. C. R., Beach, A. & Graham, R. H. 2009. The Laxford Shear Zone: an Archaean \nterrane boundary? In: Law, R., Butler, R. W. H., Strachan, R. A. & Krabbendam, M. (Eds). \nContinental tectonics and mountain building: the legacy of Peach and Horne. Geological Society \nSpecial Publications.  this volume \nGoodenough, K. M., Young, B. N. & Parsons, I. 2004. The minor intrusions of Assynt, NW Scotland: early \ndevelopment of magmatism along the Caledonian Front. Mineralogical Magazine, 68, 541-559. \nGorney, D., Escalona, A., Mann, P., Magnani, M. B., Levander, A., Christeson, G., Zelt, C. A., Schmitz, \nM., Clark, S., Guedez, M. C., Bezada, M., Arogunmati, Y., Aitken, T. & Beardsley, A. 2007. \nChronology of Cenozoic tectonic events in western Venezuela and the Leeward Antilles based on \nintegration of offshore seismic reflection data and on-land geology. AAPG Bulletin, 91, 653-684. \n Page 18 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \nHalliday, A. N., Aftalion, M., Parsons, I., Dickin, A. P. & Johnson, M. R. W. 1987. Syn-orogenic alkaline \nmagmatism and its relationship to the Moine Thrust Zone and the thermal state of the lithosphere \nin NW Scotland. Journal of the Geological Society of London, 144, 611-618. \nHinsch, R., Krawczyk, C. M., Gaedicke, C., Giraudo, R. & Demuro, D. 2002. Basement control on oblique \nthrust sheet evolution; seismic imaging of the active deformation front of the Central Andes in \nBolivia. Tectonophysics, 355, 23-39. \nHoldsworth, R. E., Strachan, R. A., Alsop, G. I., Grant, C. J. & Wilson, R. W. 2006. Thrust sequences and \nthe significance of low-angle, out-of-sequence faults in the northernmost Moine Nappe and Moine \nthrust zone, NW Scotland. Journal of the Geological Society of London, 163, 801-814. \nHoldsworth, R. E., Alsop, G. I. & Strachan, R. A. 2007. Tectonic stratigraphy and structural continuity of \nthe northernmost Moine thrust zone and Moine Nappe, Scottish Caledonides. In: Ries, A. C., \nButler, R. W. H. & Graham, R. H. (Eds). Deformation of the continental crust; the legacy of Mike \nCoward. Geological Society Special Publications, 272, 121-142. \nKinny, P. D., Friend, C. R. L. & Love, G. J. 2005. Proposal for a terrane-based nomenclature for the \nLewisian Gneiss Complex of NW Scotland. Journal of the Geological Society of London, 162, \n175-186. \nKrabbendam, M. & Leslie, A. G. 2004. Lateral ramps and thrust terminations: an example from the Moine \nThrust Zone, NW Scotland. Journal of the Geological Society of London, 161, 551-554. \nKrabbendam, M., Prave, A. P. & Cheer, D. 2008. A fluvial origin for the Neoproterozoic Morar Group, \nNW Scotland; implications for Torridon - Morar group correlation and the Grenville Orogen \nForeland Basin. Journal of the Geological Society of London, 165, 379-394. \nLapworth, C. 1883. The Secret of the Highlands. Geological Magazine, decade 2, 10, 120-128. \nLapworth, C. 1884. On the structure and metamorphism of the rocks of the Durness-Eriboll district. \nProceedings of the Geologists' Association, 8, 438-442. \nLaubscher, H. P. 1985. Large-scale, thin-skinned thrusting in the southern Alps; kinematic models. \nGeological Society of America Bulletin, 96, 710-718. \nLeslie, A. G., Krabbendam, M., Kimbell, G. S. & Strachan, R. A. 2009. The Oykel Transverse Zone: \nlinking mullions, regional gravity, and large-scale lateral variations in ductile thrust architecture in \nthe Moine Nappe, Northern Highlands, Scotland. In: Law, R., Butler, R. W. H., Strachan, R. A. & \nKrabbendam, M. (Eds). Continental tectonics and mountain building: the legacy of Peach and \nHorne. Geological Society Special Publications. this volume \nMcClay, K. R. 1992. Thrust tectonics Chapman and Hall, London. \nMcClay, K. R. 2004. Thrust tectonics and hydrocarbon systems. AAPG Memoir  82. \nMcClay, K. R. & Coward, M. P. 1981. The Moine Thrust Zone: an overview. In: McClay, K. R. & Price, \nN. J. (Eds). Thrust and Nappe Tectonics. Geological Society Special Publication, 9, London, 241-\n260. \nMcDougal, J. W. & Khan, S. H. 1990. Strike-slip faulting in a foreland fold-thrust belt; the Kalabagh Fault \nand western Salt Range, Pakistan. Tectonics, 9, 1061-1075. \nMcKie, T. 1990. Tidal and storm influenced sedimentation from a Cambrian transgressive passive margin \nsequence. Journal of the Geological Society of London, 147, 785-794. \nMcMechan, M. 2002 Structural geometry in the Carbon Creek area of the Rocky Mountain Fold and Thrust \nBelt, northeastern British Columbia. Bulletin of Canadian Petroleum Geology, 50, 407-418. \nMitra, S. 1988. Three-dimensional geometry and kinematic evolution of the Pine Mountain thrust system, \nSouthern Appalachians. Geological Society of America Bulletin, 100, 72-95. \nMon, R., Monaldi, C. R. & Salfity, J. A. 2005. Curved structures and interference fold patterns associated \nwith lateral ramps in the Eastern Cordillera, Central Andes of Argentina. Tectonophysics, 399, \n173-179. \nMurchison, R. I. 1867. Siluria, J Murray, London. \nNichol, J. 1857. On the red sandstone and conglomerate, and the superposed quartz rocks, limerstones and \ngneiss on the north-west coast of Scotland. Quarterly Journal of the Geological Society of \nLondon, 13, 17-39. \nOldroyd, D. R. 1990. The Highlands Controversy: Constructing Geological Knowledge through Fieldwork \nin Nineteenth-Century Britain, University of Chicago Press, Chicago. \n Page 19 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \nPană, D. I. 2003. Precambrian Basement of the Western Canada Sedimentary Basin in Northern Alberta. . \nAlberta Geological Survey Earth Sciences Report 2002-02. \nPark, R. G. 2002. The Lewisian geology of Gairloch, NW Scotland. Geological Society of London,  Memoir  \n26. \nPark, R. G., Stewart, A. D. & Wright, D. T. 2002. The Hebridean terrane. In: Trewin, N. H. (Eds). The \nGeology of Scotland.   Geological Society, London, 45-80. \nParsons, I. 1999. Late Ordovician to mid-Silurian alkaline intrusions of the North-west Highlands of \nScotland. In: Stephenson, D., Bevins, R. E., Milward, D., Highton, A. J., Parsons, I., Stone, P. & \nWadsworth, W. J. (Eds). Caledonian Igneous rocks of Great Britain. Geological Conservation \nReview Series, 17 Chapman & Hall, 345-393. \nPaulsen, T. & Marshak, S. 1998. Charleston transverse zone, Wasatch Mountains, Utah; structure of the \nProvo Salient's northern margin, Sevier fold-thrust belt. Geological Society of America Bulletin, \n110, 512-522. \nPaulsen, T. & Marshak, S. 1999. Origin of the Uinta Recess, Sevier fold-thrust belt, Utah; influence of \nbasin architecture on fold-thrust belt geometry. Tectonophysics, 312, 203-216. \nPeach, B. N., Horne, J., Gunn, W., Clough, C. T., Hinxman, L. W. & Teall, J. J. H. 1907. The geological \nstructure of the North-West Highlands of Scotland, 668, 52 plates. \nPrice, R. A. 1981. The Cordilleran foreland thrust and fold belt in the southern Canadian Rocky Mountains. \nIn: McClay, K. R. & Price, N. J. (Eds). Thrust and Nappe Tectonics. Geological Society Special \nPublication,  9, London, 427-448. \nPrigmore, J. K. & Rushton, A. W. A. 1999. Scotland: Cambrian and Ordovician of the Hebridean Terrane. \nIn: Rushton, A. W. A., Owen, A. W., Owens, R. M. & Prigmore, J. K. (Eds). British Cambrian to \nOrdovician Stratigraphy. Geological Conservation Review Series,  18 Chapman & Hall, 295-315. \nRamsay, J. G. 1997. The geometry of a deformed unconformity in the Caledonides of NW Scotland. In: \nSengupta, S. (Eds). Evolution of geological structures in micro- to macro-scales.   Chapman & \nHall, London, 445-472. \nRoss, G. M., Parrish, R. R., Villeneuve, M. E. & Bowring, S. A. 1991. Geophysics and geochronology of \nthe crystalline basement of the Alberta Basin, western Canada. Canadian Journal of Earth \nSciences, 28, 512-522. \nSabine, P. A. 1953. The petrography and geological significance of the post-Cambrian minor intrusions of \nAssynt and the adjoining districts of north-west Scotland. Quarterly Journal of the Geological \nSociety of London, 109, 137-171. \nSchreurs, G., Haenni, R. & Vock, P. 2001. Four-dimensional analysis of analog models; experiments on \ntransfer zones in fold and thrust belts. In: Koyi, H. A. & Mancktelow, N. S. (Eds). Tectonic \nmodeling; a volume in honor of Hans Ramberg. Geological Society of America Memoir,  193, \n179-190. \nSoto, R., Casas, A. M., Storti, F. & Faccenna, C. 2002. Role of lateral thickness variations on the \ndevelopment of oblique structures at the western end of the South Pyrenean central unit. \nTectonophysics, 350, 215-235. \nStewart, A. D. 2002. The Later Proterozoic Torridonian Rocks of Scotland: their Sedimentology, \nGeochemistry and Origin. Geological Society Memoir  24. \nStrachan, R., Smith, M., Harris, A. L. & Fettes, D. J. 2002. The Northern Highland and Grampian terranes. \nIn: Trewin, N. H. (Eds). The Geology of Scotland.   The Geological Society, London, 81-147. \nThomas, W. A. 1990. Controls on locations of transverse zones in thrust belts. Eclogae Geologicae \nHelvetiae, 83, 727-744. \nThomas, W. A. & Bayona, G. 2002. Palinspastic restoration of the Anniston transverse zone in the \nAppalachian thrust belt, Alabama. Journal of Structural Geology, 24, 797-826. \nTull, J. F. & Holm, C. S. 2005. Structural evolution of a major Appalachian salient-recess junction; \nconsequences of oblique collisional convergence across a continental margin transform fault  \nGeological Society of America Bulletin, 117, 482-499. \nVan Breemen, O., Aftalion, M. & Johnson, M. R. 1979. Age of the Loch Borrolan complex, Assynt and \nlate movements along the Moine Thrust Zone. Journal of the Geological Society of London, 16, \n489-495. \n Page 20 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \nWheeler, J. 2007. A major high-strain zone in the Lewisian Complex in the Loch Torridon area, NW \nScotland; insights into deep crustal deformation  In: Ries, A. C., Butler, R. W. H. & Graham, R. \nH. (Eds). Deformation of the continental crust; the legacy of Mike Coward. Geological Society \nSpecial Publication,  272, 27-45. \nWheeler, J., Windley, B. F. & Davies, F. B. 1987. Internal evolution of the major Precambrian shear belt at \nTorridon, NW Scotland. In: Park, R. G. & Tarney, J. (Eds). Evolution of the Lewisian and \ncomparable Precambrian high grade terrains. Geological Society Special Publication,  27, 217-\n233. \nWilkinson, P., Soper, N. J. & Bell, A. N. 1975. Skolithus pipes as strain markers in mylonites. \nTectonophysics, 28, 143-157. \nWright, D. T. & Knight, I. 1995. A revised chronostratigraphy for the lower Durness group. Scottish \nJournal of Geology, 31, 11-22. \n \n \n Page 21 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \nFigure Captions \n \n \n \nFigure 1. Geological map of the Moine Thrust Belt, North West Highlands.   MT = Moine Thrust,  LC = \nLangwell Culmination; UC = Ullapool Culmination; DC = Dundonell Culmination; FH = Faraid Head.  No \ndetails east of Moine Thrust shown.  Inset shows position of Figure 2. \n \n Page 22 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \n \n \nFigure 2.  Simplified structure of the Assynt Culmination, showing main thrust sheets and Caledonian \nigneous intrusions.  BM = klippen of the Ben More Thrust Sheet.  Location of Figures 4 and 5 indicated. \nSee also British Geological Survey (2007). \n \n Page 23 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \n \n \nFigure 3. Generalised vertical section for Assynt, also to be used as key for Figures 4, 5, 6, 7.  Scale bar \napplicable to Cambro-Ordovician rocks only. See also Park et al. (2002); British Geological Survey (2007). \n \n Page 24 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \n \n \nFigure 4. Geological map of the Droighinn area, northern part of the Assynt Culmination.  Detailed \ngeology in Ben More Thrust Sheet, Stronchrubbie-Breabag System and Achmore imbricates not shown.  \nPosition of cross-section  line A-A' and D-D' (see Figure 6) is indicated.  Grid ticks refer to NC square of \nthe British National Grid.  Points A to J are explained in the text.  For key see Figure 3; purple points are \nselected branching points.  After British Geological Survey (2007). \n \n \n Page 25 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \n \n \nFigure 5. Geological map of the Stronchrubbie-Breabag System area, central part of the Assynt \nCulmination.  Thrusts are numbered.  Detailed geology in Ben More Thrust Sheet is not shown.  Position of \ncross-section lines B-B', C-C' and D-D' (see Figure 6) is indicated.  Grid ticks refer to NC square of the \nBritish National Grid.  Points P to X are explained in the text.  For key see Figure 3. Tr = Traligill Thrust; \nbr = breaching thrust.  After British Geological Survey (2007). \n \n Page 26 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \n \nFigure 6.  Figure 6.  Cross-sections showing thrust architecture in Assynt Culmination.  Locations of \nsection lines are indicated on Figures 4 and 5.  For key see Figure 3.  Ben More Thrust sheet is hatched. No \nvertical exaggeration. See also British Geological Survey (2007).  BFT = Beinn an Fhurain Thrust, BMT = \nBen More Thrust, BUT = Beinn Uidhe Thrust,  CDT = Cnoc Dubh Thrust, Droi = Cnoc an Droighinn \nThrust, GBT = Glas Bheinn Thrust, GcT = Glencoul Thrust, LCT = Loch nan Cuaran Thrust, PDT = Poll \nan Droighinn Thrust, TT= Traligill Thrust, ST = Sole Thrust \na) Cross-section across Droighinn area, north of Traligill Transverse Zone. \nb) Cross-section across Breabag-Stronchrubbie system, just south of Traligill Transverse Zone. \nc) Cross-section across Breabag-Stronchrubbie system, 2-3 km south of Traligill Transverse Zone. \nd) North-south cross-section (normal to transport direction) across the Traligill Transverse Zone. \n \n Page 27 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \n \n \n \nFigure 7. Piercing point analysis along the Traligill Tranverse Zone: \na)  Overview map of the Foreland, showing position of 'Double Unconformity' abd the main cross-faults.   \nb) Detail of upper Traligill, showing Droighinn Anticline and Breabag Dome displaced by Gleann Dubh \nand Bealach Traligill Fault. \nc) Piercing point analysis of Gleann Dubh Fault. \nd) Piercing point analysis of Bealach Traligill Fault. \ne) Piercing point analysis of Loch Assynt Fault. \n \n Page 28 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \n \n \nFigure 8: Schematic block diagram of the Traligill Transverse Zone, showing inferred architecture of \nbasement and cover prior to thrusting. \n Page 29 of 30 \nKrabbendam & Leslie: Traligill Transverse Zone \n Page 30 of 30 \n \n \n \nFigure 9: possible lateral variations in pre-thrusting templates:   \na) wedge of sediment;  \nb) pre-depositional fault in basement, not displacing cover strata; \nc) syn-depositional fault in basement, active during deposition of cover strata;   \nd) pre & post -depositional fault in basement displacing cover strata after deposition. \n  Note that different angles between the feature and  the subsequent thrust transport direction (arrows) can \nlead to local transpression (TP) or transtension (TT); see text for discussion. \n"}