{"doi":"10.1109\/TIE.2009.2032202","coreId":"65174","oai":"oai:dro.dur.ac.uk.OAI2:6686","identifiers":["oai:dro.dur.ac.uk.OAI2:6686","10.1109\/TIE.2009.2032202"],"title":"Cost-effective condition monitoring for wind turbines.","authors":["Yang,  W.","Tavner,  P. J.","Crabtree,  C. J.","Wilkinson,  M."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-01-01","abstract":"Cost-effective wind turbine (WT) condition monitoring assumes more importance as turbine sizes increase and they are placed in more remote locations, for example, offshore. Conventional condition monitoring techniques, such as vibration, lubrication oil, and generator current signal analysis, require the deployment of a variety of sensors and computationally intensive analysis techniques. This paper describes a WT condition monitoring technique that uses the generator output power and rotational speed to derive a fault detection signal. The detection algorithm uses a continuous-wavelet-transform-based adaptive filter to track the energy in the prescribed time-varying fault-related frequency bands in the power signal. The central frequency of the filter is controlled by the generator speed, and the filter bandwidth is adapted to the speed fluctuation. Using this technique, fault features can be extracted, with low calculation times, from direct- or indirect-drive fixed- or variable-speed WTs. The proposed technique has been validated experimentally on a WT drive train test rig. A synchronous or induction generator was successively installed on the test rig, and both mechanical and electrical fault like perturbations were successfully detected when applied to the test rig","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65174.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/6686\/1\/6686.pdf","pdfHashValue":"7d2a11fc67ecf0904a73c0125b004fe234a2a155","publisher":"IEEE","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:6686<\/identifier><datestamp>\n      2011-12-14T10:02:58Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Cost-effective condition monitoring for wind turbines.<\/dc:title><dc:creator>\n        Yang,  W.<\/dc:creator><dc:creator>\n        Tavner,  P. J.<\/dc:creator><dc:creator>\n        Crabtree,  C. J.<\/dc:creator><dc:creator>\n        Wilkinson,  M.<\/dc:creator><dc:description>\n        Cost-effective wind turbine (WT) condition monitoring assumes more importance as turbine sizes increase and they are placed in more remote locations, for example, offshore. Conventional condition monitoring techniques, such as vibration, lubrication oil, and generator current signal analysis, require the deployment of a variety of sensors and computationally intensive analysis techniques. This paper describes a WT condition monitoring technique that uses the generator output power and rotational speed to derive a fault detection signal. The detection algorithm uses a continuous-wavelet-transform-based adaptive filter to track the energy in the prescribed time-varying fault-related frequency bands in the power signal. The central frequency of the filter is controlled by the generator speed, and the filter bandwidth is adapted to the speed fluctuation. Using this technique, fault features can be extracted, with low calculation times, from direct- or indirect-drive fixed- or variable-speed WTs. The proposed technique has been validated experimentally on a WT drive train test rig. A synchronous or induction generator was successively installed on the test rig, and both mechanical and electrical fault like perturbations were successfully detected when applied to the test rig.<\/dc:description><dc:subject>\n        Adaptive signal processing<\/dc:subject><dc:subject>\n         Condition monitoring<\/dc:subject><dc:subject>\n         Fault diagnosis<\/dc:subject><dc:subject>\n         Induction generators<\/dc:subject><dc:subject>\n         Signal processing<\/dc:subject><dc:subject>\n         Synchronous generators<\/dc:subject><dc:subject>\n         Time-frequency analysis<\/dc:subject><dc:subject>\n         Wavelet transforms<\/dc:subject><dc:subject>\n         Wind power generation.<\/dc:subject><dc:publisher>\n        IEEE<\/dc:publisher><dc:source>\n        IEEE transactions on industrial electronics, 2010, Vol.57(1), pp.263-271 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2010-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:6686<\/dc:identifier><dc:identifier>\n        issn:0278-0046 <\/dc:identifier><dc:identifier>\n        doi:10.1109\/TIE.2009.2032202<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6686\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1109\/TIE.2009.2032202<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6686\/1\/6686.pdf<\/dc:identifier><dc:rights>\n        ©2010 IEEE. This material is presented to ensure timely dissemination of scholarly and technical work. Copyright and all rights therein are retained by authors or by other copyright holders. All persons copying this information are expected to adhere to the terms and constraints invoked by each author's copyright. In most cases, these works may not be reposted without the explicit permission of the copyright holder\\ud\n\\ud\nPersonal use of this material is permitted. However, permission to reprint\/republish this material for advertising or promotional purposes or for creating new collective works for resale or redistribution to servers or lists, or to reuse any copyrighted component of this work in other works must be obtained from the IEEE.\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0278-0046","0278-0046"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":["Adaptive signal processing","Condition monitoring","Fault diagnosis","Induction generators","Signal processing","Synchronous generators","Time-frequency analysis","Wavelet transforms","Wind power generation."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n09 April 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nYang, W. and Tavner, P. J. and Crabtree, C. J. and Wilkinson, M. (2010) ’Cost-effective condition monitoring\nfor wind turbines.’, IEEE transactions on industrial electronics., 57 (1). pp. 263-271.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1109\/TIE.2009.2032202\nPublisher’s copyright statement:\n2010 IEEE. This material is presented to ensure timely dissemination of scholarly and technical work. Copyright and\nall rights therein are retained by authors or by other copyright holders. All persons copying this information are\nexpected to adhere to the terms and constraints invoked by each author’s copyright. In most cases, these works may\nnot be reposted without the explicit permission of the copyright holder Personal use of this material is permitted.\nHowever, permission to reprint\/republish this material for advertising or promotional purposes or for creating new\ncollective works for resale or redistribution to servers or lists, or to reuse any copyrighted component of this work in\nother works must be obtained from the IEEE.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \n \nDurham Research Online \n \nDeposited in DRO: \n09 April 2010 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status: \nPublished version \n \nCitation for published item: \nYang, W. and Tavner, P. J. and Crabtree, C. J. and Wilkinson, M. (2010) 'Cost-effective \ncondition monitoring for wind turbines.', IEEE transactions on industrial electronics., 57 (1). \npp. 263-271. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1109\/TIE.2009.2032202 \n \nPublisher’s copyright statement: \n©2010 IEEE. This material is presented to ensure timely dissemination of scholarly and \ntechnical work. Copyright and all rights therein are retained by authors or by other copyright \nholders. All persons copying this information are expected to adhere to the terms and \nconstraints invoked by each author's copyright. In most cases, these works may not be \nreposted without the explicit permission of the copyright holder \n \nPersonal use of this material is permitted. However, permission to reprint\/republish this \nmaterial for advertising or promotional purposes or for creating new collective works for \nresale or redistribution to servers or lists, or to reuse any copyrighted component of this work \nin other works must be obtained from the IEEE. \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nIEEE TRANSACTIONS ON INDUSTRIAL ELECTRONICS, VOL. 57, NO. 1, JANUARY 2010 263\nCost-Effective Condition Monitoring for\nWind Turbines\nWenxian Yang, Peter J. Tavner, Senior Member, IEEE, Christopher J. Crabtree, and Michael Wilkinson\nAbstract—Cost-effective wind turbine (WT) condition moni-\ntoring assumes more importance as turbine sizes increase and\nthey are placed in more remote locations, for example, offshore.\nConventional condition monitoring techniques, such as vibration,\nlubrication oil, and generator current signal analysis, require the\ndeployment of a variety of sensors and computationally intensive\nanalysis techniques. This paper describes a WT condition monitor-\ning technique that uses the generator output power and rotational\nspeed to derive a fault detection signal. The detection algorithm\nuses a continuous-wavelet-transform-based adaptive filter to track\nthe energy in the prescribed time-varying fault-related frequency\nbands in the power signal. The central frequency of the filter\nis controlled by the generator speed, and the filter bandwidth\nis adapted to the speed fluctuation. Using this technique, fault\nfeatures can be extracted, with low calculation times, from direct-\nor indirect-drive fixed- or variable-speed WTs. The proposed\ntechnique has been validated experimentally on a WT drive train\ntest rig. A synchronous or induction generator was successively\ninstalled on the test rig, and both mechanical and electrical fault-\nlike perturbations were successfully detected when applied to the\ntest rig.\nIndex Terms—Adaptive signal processing, condition moni-\ntoring, fault diagnosis, induction generators, signal processing,\nsynchronous generators, time–frequency analysis, wavelet trans-\nforms, wind power generation.\nNOMENCLATURE\nA Estimated energy of the frequency compo-\nnent of interest.\namin, amax Minimum and maximum wavelet scales\nconsidered by the adaptive bandpass filter.\na Wavelet scale.\nb Wavelet time-shift parameter.\nε Voltage or current transducer error.\ne Specific unbalance.\nfrm Rotational frequency of the generator\nrotor.\nfse Electrical supply frequency.\nManuscript received December 5, 2008; revised September 3, 2009. First\npublished September 22, 2009; current version published December 11, 2009.\nThis work was supported by the U.K. Engineering and Physical Sciences\nResearch Council Supergen Wind Program EP\/D034566\/1.\nW. Yang is with the New and Renewable Energy Centre, NE24 3AG\nBlyth, U.K.\nP. J. Tavner is with the School of Engineering and Computing Sciences,\nDurham University, DH1 3LE Durham, U.K. (e-mail: Peter.Tavner@durham.\nac.uk).\nC. J. Crabtree is with Durham University, DH1 3LE Durham, U.K.\nM. Wilkinson is with Garrad Hassan, BS2 0QD Bristol, U.K.\nColor versions of one or more of the figures in this paper are available online\nat http:\/\/ieeexplore.ieee.org.\nDigital Object Identifier 10.1109\/TIE.2009.2032202\nG Balance quality grade.\nIi Line currents.\nm Unbalanced mass.\nMeq Equivalent mass of the test rig rotor.\nω Angular frequency of interest.\nωc Mean frequency of the prescribed fre-\nquency component during the time in-\nterval T .\nωfg Fluctuation of the generator rotational\nfrequency.\nωf Fluctuation of the frequency of interest.\nωupper, ωlower Upper and lower cutoff frequencies of the\nadaptive filter.\nω0 Central angular frequency of the mother\nwavelet.\nωrm Angular rotational frequency of the gener-\nator rotor.\nP Three-phase total power output from the\ngenerator.\nr Effective radius of the equivalent unbal-\nanced mass.\nRAB , RBC , RCA Combined line-to-line resistances.\nRAS , RBS , RCS Brush gear and slip ring resistances.\nRAV , RBV , RCV Load bank resistances.\nRA, RB , RC Generator rotor winding resistances.\nδR Electrical resistance imbalance.\ns Induction machine slip.\nψ Mother wavelet function.\nT Sliding window averaging time interval.\nt0 Starting time moment of the sliding\nwindow.\nUe Electrical asymmetry on the generator\nrotor.\nUm Mechanical unbalance on the generator\nrotor.\nVi Phase voltages.\nx Real-time signal.\nη Constant between ωfg and ωf .\nI. INTRODUCTION\nOVER THE last 40 years, there has been an increasedapplication of wind turbines (WTs) around the world,\nwith growth in rating from 30 kW to > 5 MW and, more\nrecently, their application offshore [1]. To reduce the cost of\nenergy from WTs, there is a pressing need to improve the WT\navailability and reduce the operational and maintenance (O&M)\n0278-0046\/$26.00 © 2010 IEEE\nAuthorized licensed use limited to: University of Durham. Downloaded on April 09,2010 at 13:54:59 UTC from IEEE Xplore.  Restrictions apply. \n264 IEEE TRANSACTIONS ON INDUSTRIAL ELECTRONICS, VOL. 57, NO. 1, JANUARY 2010\nFig. 1. Variation in power output from a 33-kW fixed-speed WT over five\nsuccessive periods of 900 s, each showing the large variation in the signal due\nto wind turbulence (taken from [7]).\ncosts. Aside from developing more advanced machine designs\n[2] to improve the availability, an effective way to achieve\nthis improvement would be to apply reliable and cost-effective\ncondition monitoring [3], which is why this subject is attracting\nindustrial and academic attention.\nThe wind industry currently uses condition monitoring sys-\ntems (CMSs), such as vibration, temperature, lubrication oil,\nand generator current analysis, developed from other rotating\nmachine power generation industries [4]–[6], where they have\nachieved success. However, despite their application in the\nwind industry [7], they have not yet proven their effectiveness\ndue to the peculiarities of a WT, which has a slow speed and\nrapidly varying torque. Commercial WT CMSs mostly employ\nvibration-based techniques, which are sophisticated, and the\nsensors and cabling are costly. The technique is also not ideally\nsuited to all WT types and faults. Lubrication oil analysis is\nbecoming more popular for detecting gearbox tooth and bearing\nwear but cannot detect failures outside the gearbox. More\nadvanced techniques, such as optical strain measurement, have\nbeen developed for monitoring WT blade integrity. However,\nthese are expensive, and recent reliability surveys [8] have\nshown that WT electrical systems have a higher failure rate than\nthe mechanical systems. For these reasons, an electrically based\nWT CMS would be beneficial and could be more comprehen-\nsive, simpler, and cheaper than other techniques. This paper will\npropose such a technique.\nInstantaneous electric power measurement has been demon-\nstrated on induction machines for detecting motor faults [9].\nThree-phase total power monitoring has also been applied to\nWTs as a condition monitoring and fault diagnosis signal [10]\nbut has not achieved commercial application. This research will\nbe based entirely on the use of this signal and the generator\nspeed for condition monitoring. Power output measurement\nwas considered for condition monitoring in [7] and [10], but\nFig. 1, taken from [7], shows how the WT power output signal\nexperiences continuous and rapid variations during operation.\nThe work reported in this paper is an enhancement of the\nresearch described in [11], now including the following:\n1) a more comprehensive description of the background\ntechnology and the state of the art of the proposed\ntechnique;\n2) an improved mathematical presentation;\n3) additional figures to enhance the description of the\ntechnique;\n4) more substantial experimental results;\n5) an amended conclusion.\nFig. 2. Structures of real large WTs. (a) Geared. (b) Direct drive.\nThe novelties of the proposed technique are summarized as\nfollows:\n1) a technique for WT condition monitoring based on mea-\nsuring the generator total power signal rather than more\nconventional measurements validated by experiments on\na test rig with a simple fault setup;\n2) a new adaptive continuous-wavelet-transform (CWT)-\nbased energy tracking method, reducing the calculation\ntime for feature extraction when applied to lengthy sig-\nnals, making possible less time-intensive WT condition\nmonitoring;\n3) the successful detection of two types of fault using this\nmethod has been demonstrated on two WT arrangements,\nincluding both electrical and mechanical faults;\n4) the proposed method is more efficient for the detection\nof faults in variable-speed WTs than other more conven-\ntional techniques;\n5) the technique used in this paper can be applied to any WT\ngenerator for tracking any characteristic, fault-related fre-\nquency component, so it is general and could be applied\nto detect a variety of faults depending on the choice of\nfrequency selected.\nWavelet transforms have been successfully used in condition\nmonitoring and diagnosis of rotating electrical machine faults\n[1], [12]–[14]. However, most used the discrete wavelet trans-\nform (DWT) rather than the CWT, although the latter is superior\nto the former in multiresolution signal analysis. However, the\nCWT involves more intensive convolution calculations than the\nDWT, making it more difficult to process lengthy online data,\nsuch as WT monitoring signals. Moreover, it is inconvenient to\napply the traditional time–frequency–amplitude CWT image to\nmachine condition monitoring, as was done in [15]. Wavelets\nhave been proposed for WT condition monitoring [16], [17] but\nhave not yet received commercial application.\nII. APPLYING GENERATOR POWER MONITORING TO WTs\nA WT converts the kinetic energy of the wind into electrical\nenergy, utilizing mechanical and electrical conversion, control,\nand transmission systems. The architectures of two commonly\nused large WTs are shown in Fig. 2.\nThe application of vibration, temperature, and lubrication oil\ntechniques to monitoring WTs should improve their availability\nbut, to date, is not being widely used for the following reasons:\n1) lack of practical industry experience with condition mon-\nitoring in the wind environment;\n2) difficulties collecting and interpreting the data, including\nthe risk of false or missed alarms;\nAuthorized licensed use limited to: University of Durham. Downloaded on April 09,2010 at 13:54:59 UTC from IEEE Xplore.  Restrictions apply. \nYANG et al.: COST-EFFECTIVE CONDITION MONITORING FOR WIND TURBINES 265\n3) the fact that present techniques may not be suited to all\ntypes of WTs such as shown in Fig. 2;\n4) the fact that developing reliable WT condition monitoring\ntechniques requires complex and lengthy collaboration\nbetween WT operators and manufacturers in the field.\nWT power flows are disturbed by both mechanical and\nelectrical faults [16], [17]. To measure the WT shaft torque is\ncostly and usually impractical for a real WT. In contrast, shaft\nspeed and electrical power output are routinely monitored for\nWTs, but, to date, commercial CMSs do not use these signals.\nIn comparison with conventional stator current analysis,\nwidely adopted for condition monitoring motors [4], [6], power\nmonitoring could have the following disadvantages.\n1) The error in the total power signal depends not only on\nthe voltage and current transducer error ε but also on the\nmeasurement method. In the three-wattmeter method, the\nerror will be 6ε, but, in the two-wattmeter method,\nthe error is limited to 4ε, whereas the current signal error\nwould be only ε. Therefore, the signal-to-noise ratio for\nbasic analysis should be better for current than power\nanalysis.\nOn the other hand, monitoring based on power analysis could\nhave the following advantages.\n1) The power signal is already available from the generator\nterminal voltage and current signals for the control of the\nWT and can conveniently be accessed.\n2) Fewer cheaper transducers than accelerometers and oil\ndebris probes are required for power monitoring.\n3) Mechanical and electrical faults both disturb the genera-\ntor power output, so power monitoring could detect both\ntypes of faults.\n4) Single line current analysis contains the mains frequency\ncarrier, whereas this is absent in the power signal. There-\nfore, the signal-to-noise ratio for faulty feature analysis\nshould be better for power than current analysis, balanc-\ning the aforementioned transducer error effect.\n5) In the power signal, the fault-related frequency side-\nbands, around the mains frequency, are folded down\naround dc, limiting the bandwidth needed to monitor the\nsignal.\nAn example of the current, voltage, and power signals mea-\nsured under faulty conditions on an induction generator, fitted to\nthe test rig described in the following, is shown in Fig. 3, where\nthe signals were collected when a periodic rotor electrical\nasymmetry was applied in the presence of serious noise due\nto power system imbalance.\nThe fault in Fig. 3 was applied at the time intervals of 20–40 s\nand 60–80 s and was absent in the other time intervals. It\ncan be seen that the amplitudes of both the current–time and\nvoltage–time waveforms gave no indication of abnormal con-\nditions, whereas the total three-phase power signal P changes\nsignificantly during the abnormality due to the presence of 2fse\nand 2sfse components. The total power P (t) was calculated\nusing\nP (t) =\n3∑\ni=1\nIi(t) · Vi(t). (1)\nFig. 3. Comparison of current, voltage, and total power signal in the presence\nof a rotor asymmetry fault. (a) Line currents. (b) Phase voltages. (c) Total power.\nIII. DESIGN OF WAVELET-BASED ADAPTIVE FILTER\nIn this paper, a CWT-based adaptive filter has been designed\nto track the energy in the power signal in the prescribed fault-\nrelated frequency bands rather than at all frequencies of the\nmonitoring signal. In this way, the wavelet calculation can\nsignificantly be reduced, and the results can be displayed graph-\nically rather than as a screen dump image, making the technique\nattractive for online application. Details of the technique are\ndescribed as follows.\nThe CWT of a real-time signal x(t) can be defined as\nCWT(b, a) = 1√|a|\n∞∫\n−∞\nx(t)ψ∗\n(\nt− b\na\n)\ndt (2)\nwhere the asterisk “∗” indicates the complex conjugate.\nTraditionally, the wavelet function ψ(t) is dilated or com-\npressed by changing the scale parameter a so that all signal\ncomponents ranging from frequency 0 to half the sampling\nfrequency can be projected onto an appropriate time-scale map,\nas shown in Fig. 4. The bottom figure shows the time waveform\nof a sample signal of increasing frequency being inspected; the\ntop figure shows the wavelet coefficients of this signal obtained\nat different wavelet scales and times.\nMany of the calculations shown in Fig. 4 are unnecessary for\nWT condition monitoring because the fault-related frequencies\nare few in number and the energy extracted at nonfault-related\nfrequencies is not helpful to assess the machine condition.\nTherefore, an adaptive CWT-based filter has been designed,\nwhich only extracts energy at known fault frequencies, while\nfrequencies unrelated to the fault are left unprocessed. The\ncalculation time for the new technique will be much shorter\nthan that for a conventional CWT applied to a broad band-\nwidth signal. Therefore, the proposed CWT-based energy\ntracking technique should prove more efficient for online\nprocessing of WT monitoring signals than conventional CWT\nprocessing.\nAuthorized licensed use limited to: University of Durham. Downloaded on April 09,2010 at 13:54:59 UTC from IEEE Xplore.  Restrictions apply. \n266 IEEE TRANSACTIONS ON INDUSTRIAL ELECTRONICS, VOL. 57, NO. 1, JANUARY 2010\nFig. 4. Illustrative example of the conventional CWT.\nFig. 5. Two-dimensional sliding window.\nA time–frequency sliding window has been designed for this\ntask, as shown in Fig. 5. Its central frequency ωc is the mean\nfrequency during the time interval T of the prescribed fault-\nrelated frequency band. The upper and lower cutoff frequencies\nωupper and ωlower are adapted to the fluctuation of the generator\nrotational speed ωfg in that interval, i.e.,⎧⎨\n⎩\nωupper = ωc + ωf\/2\nωlower = ωc − ωf\/2\nωf = ηωfg.\n(3)\nFrom Fig. 4, it is noticed that ωf could also be a time-\nvarying parameter, intrinsically dependent on the turbulence of\nthe wind. Experience has shown that onshore wind turbulence\nvaries between 12% and 20%, whereas offshore turbulence\napproximates to ∼6%.\nThe relationship between any prescribed frequency ω and its\ncorresponding wavelet scale a is\na =\nω0\nω\n. (4)\nWith the aid of (3) and (4), the range of the wavelet scales\nfor conducting bandpass filtering can be determined by\na ∈ [amin amax] (5){\namin = ω0ωupper\namax = ω0ωlower .\n(6)\nTABLE I\nCOMPUTATIONAL EFFICIENCY COMPARISON BETWEEN CWT, DWT,\nAND PROPOSED APPROACH\nSubsequently, by performing the CWT locally in the scale\nrange defined by (5), a matrix of wavelet coefficients is obtained\nCWTlocal(b, a) =\n1√|a|\n∞∫\n−∞\nx(t)ψ∗\n(\nt− b\na\n)\ndt. (7)\nThe energy A of the frequency component of interest in the\ntime interval T is estimated by\nA(t0 + T\/2)=max (|CWTlocal(b, a)|)\n{\na ∈ [amin amax]\nb ∈ [t0 t0 + T ].\n(8)\nThe sliding window is moved forward along the signal; the\nmaximum and minimum wavelet scales in (5) being redefined\nwithin each time interval according to the generator rotational\nspeed ωfg. Then, using the aforementioned technique, the en-\nergy A in the fault-related frequency band is calculated in each\ntime interval using (7) and (8). These calculations are repeated\nuntil the whole signal has been processed. Finally, a curve\nof the energy variation in the fault-related frequency band is\nobtained, and changes in the running condition of the WT can\nbe assessed.\nThis task could have been accomplished using a series of\nconventional bandpass filters set up to cover the expected speed\nrange of the turbine. However, such an analysis would not have\nthe advantages of the CWT in processing nonstationary signals\nshown in Fig. 1 and [18].\nTo verify the computational efficiency of the proposed tech-\nnique compared to the traditional CWT and DWT, a calculation\nwas performed to extract the 50-Hz energy component from\n1 s of line current signal, sampled at a frequency of 2 kHz.\nThe time taken by each approach is listed in Table I. The\ncalculations were done in a computer with 1.4 GHz of Intel\nPentium processor and 512 MB of RAM.\nFrom Table I, it can be concluded that the proposed energy\ntracking technique is the most computationally efficient of the\nthree approaches.\nIV. WT CONDITION MONITORING BY POWER\nSIGNAL ANALYSIS\nIn view of the proposed advantages of generator power\nsignal analysis for detecting both mechanical and electrical\nfaults in a variety of designs of WT drive train, it has been\napplied in this paper, in combination with the energy tracking\nmethod described previously, to develop a new WT condition\nmonitoring technique.\nAuthorized licensed use limited to: University of Durham. Downloaded on April 09,2010 at 13:54:59 UTC from IEEE Xplore.  Restrictions apply. \nYANG et al.: COST-EFFECTIVE CONDITION MONITORING FOR WIND TURBINES 267\nFig. 6. Schematic diagrams of the WT drive train test rig. (a) With permanent-magnet synchronous generator installed. (b) With induction generator\ninstalled.\nA. WT Drive Train Test Rig\nOne of the difficulties in gaining practical industry experi-\nence of condition monitoring on real WTs is the lack of collab-\noration needed with WT operators and manufacturers, due to\ndata confidentiality, particularly when faults are present. This\ncan be avoided by gaining condition monitoring experience\nusing a controllable experimental test rig to which defined faults\ncan be applied. Therefore, the technique proposed in this paper\nhas been validated experimentally on a WT drive train test\nrig designed to investigate condition monitoring signals in the\nlaboratory. This test rig was described in detail in [16] and was\nequipped first with a permanent-magnet synchronous generator\nand, subsequently, with an induction generator, both as shown\nin Fig. 6.\nThe synchronous generator [Fig. 6(a)], such as might be used\nin a direct-drive WT, was rated for the experiment at 10 kW,\nthree-phase 54-pole permanent-magnet machine with a rectified\noutput feeding a resistive load bank.\nThe induction generator [Fig. 6(b)], such as might be used\nin a geared-drive WT, was rated for the experiment at 30 kW,\nthree-phase four-pole wound-rotor machine, with the rotor cir-\ncuit coupled via slip rings to a three-phase resistive load bank,\nso that rotor electrical imbalance could be applied, and the\ngenerator stator fed the three-phase mains.\nThe test rig comprises a 54-kW dc variable-speed motor\nand a two-stage gearbox, instrumented and controlled using\nLabVIEW. In the experiments, a variety of wind speed inputs\ncould be applied to the test rig via the dc motor, the speed\nof which is controlled by an external model incorporating the\nproperties of natural wind at a variety of speeds and turbulences\nand the mechanical behavior of a 2-MW WT operating under\nclosed-loop conditions. Relevant signals were collected from\nthe terminals of the generator and the drive train when subjected\nto this driving speed.\nA number of electrical and mechanical drive train faults\ncould be applied to the test rig. Because they are not necessarily\nAuthorized licensed use limited to: University of Durham. Downloaded on April 09,2010 at 13:54:59 UTC from IEEE Xplore.  Restrictions apply. \n268 IEEE TRANSACTIONS ON INDUSTRIAL ELECTRONICS, VOL. 57, NO. 1, JANUARY 2010\nprecise replicas of WT faults, they have been called “fault-like\nperturbations” but contain similarities with faults on real WTs.\nIn this paper, to verify the efficacy of the proposed condi-\ntion monitoring technique for WTs, two “faultlike perturba-\ntions” were applied to two different generator configurations as\nfollows.\n1) In the first configuration, with the synchronous gener-\nator representing a direct-drive WT, the “faultlike per-\nturbation” applied was mechanically unbalanced on the\ngenerator rotor, representing the effect of a mechanical\nunbalance fault on the WT generator drive train.\n2) In the second configuration, with the slip-ring induction\ngenerator representing a geared-drive WT, the “fault-like\nperturbation” applied was electrically asymmetric on the\ngenerator rotor, representing the effect of a rotor winding\nfault, brush imbalance, or air gap eccentricity in the WT\ngenerator.\nDetails of both experimental arrangements are described as\nfollows.\nB. Mechanical Unbalance Fault Simulated on Rotor of\nSynchronous Generator\nThe mechanical unbalance fault was simulated by attaching\na 1-kg mass to the generator rotor with an equivalent rotating\nmass of 290.7 kg, which is ∼0.3%. This represents a balance\nquality grade of G 7.8 (7.8 mm\/s), within the limit of G 16\n(16 mm\/s) prescribed in ISO1940-1:2003 for a low-speed pro-\npeller shaft, applicable to a direct-drive WT shaft. The details\nof this estimation are given in Appendix A. The peak-to-peak\nmeasured displacement of the generator shaft changed a little\nbefore and after the placement of the unbalanced mass, varying\nin the range 90–140 μm. The equivalent vibration velocity\nwould have been 0.13–0.21 mm\/s, with the generator running\nat the maximum rotational speed of 28 r\/min well within the\n0.71-mm\/s limit that is acceptable for machines ≤ 15 kW\nprescribed in ISO2372:1974.\nWhen the synchronous generator ran at varying speed repre-\nsenting the wind driving situation, the speed, torque, and total\npower were measured using a sampling frequency of 1 kHz,\nand the “fault-like perturbation” was periodically applied to the\nrotor. The time waveforms of the signals before and after the\napplication are shown in Fig. 7(a).\nFrom Fig. 7(a), it can be seen that, in the presence of the mass\nunbalance fault, the driving shaft torque signal gave a response\nat the shaft rotational frequency frm, as expected, fluctuating\nby 8% range due to the combined effects of mass unbalance\nfault and wind driving turbulence, which can be compared to\nfluctuating by 4% due to the wind driving turbulence alone. By\ncontrast, the generator power showed only a slight change in the\npresence of the fault. In this case, the fault-related frequency is\nfrm, and the CWT-based energy tracking technique was applied\nto extract energy at this frequency, as shown in Fig. 7(b). This\nprovided a clear indication of the presence or absence of the\nmechanical unbalance fault despite the fact that the shaft speed\nwas varying continuously throughout the experiment and the\neffect could not be observed in the unprocessed total power\nsignal shown in Fig. 7(a).\nFig. 7. Mass unbalance fault applied to a synchronous generator rotor on the\nWT test rig, representing a direct-drive WT. (a) Signals when a mass unbalance\nfault was simulated on a synchronous generator rotor. (b) Detecting a mass\nunbalance fault from the power signal.\nTABLE II\nPARAMETERS USED FOR CALCULATION RESULTS IN FIG. 7\nIt can be seen from Fig. 7(b) that a 0.3% or G 7.8 unbal-\nance fault was easily detectable. This shows that the proposed\ntechnique has the potential to detect an incipient mechanical\nunbalance fault of 0.3% or G 7.8 on a direct-drive WT. The\nparameters used for this calculation are given in Table II.\nC. Electrical Asymmetry on Rotor of\nInduction Generator\nThe electrical asymmetry was simulated on the induction\ngenerator by adjusting the phase resistances in the load bank\nexternally connected to the rotor. Two levels of rotor asymmetry\nwere applied to investigate the effect of an incipient fault. These\nwere an electrical asymmetry of Ue = 4.7% and, then, a larger\nasymmetry of 9.2%. The details of the rotor circuit and the\nestimation of asymmetry are described in Appendix B and\nin Table IV.\nAuthorized licensed use limited to: University of Durham. Downloaded on April 09,2010 at 13:54:59 UTC from IEEE Xplore.  Restrictions apply. \nYANG et al.: COST-EFFECTIVE CONDITION MONITORING FOR WIND TURBINES 269\nFig. 8. Electrical asymmetry applied to an induction generator rotor on the test\nrig, representing a geared-drive WT. (a) Signals when an electrical asymmetry\nfault was simulated on an induction generator rotor. (b) Detecting an electrical\nasymmetry fault from the power signal.\nAs in the mechanical unbalance experiment, the rotational\nspeed, mechanical drive shaft torque, and generator total power\nsignals were measured when the “faultlike perturbation” was\nperiodically applied to the rotor. A smaller fault was applied in\nthe period 60–120 s and a larger fault between 180 and 240 s,\nwith the rotor circuits being balanced in the periods 0–60 s,\n120–180 s, and 240–300 s. The time waveforms of the signals\ncollected in this experiment are shown in Fig. 8(a), and it can\nbe seen that, due to the effect of the varying generator speed,\nthe fault symptom cannot be observed clearly from either the\ngenerator shaft torque or total power.\nWhen the rotor phase resistances are imbalanced, the genera-\ntor current, voltage, and power are modulated twice by the slip\nfrequency as the rotor asymmetry moves through the air gap\nmagnetic field twice for every pole pair cycle [4]. Therefore, in\nthis case, the fault-related frequency is 2sfse, and the CWT-\nbased energy tracking technique was applied to extract the\nenergy at that frequency, as shown in Fig. 8(b).\nFrom Fig. 8(b), it can be seen that the smaller, 4.7%, fault was\nnot clear although it is still visible, so the condition monitoring\nalgorithm had limited detectability in this case. This lack of\ndetectability was due to the residual imbalances present in the\nTABLE III\nPARAMETERS USED FOR CALCULATION RESULTS IN FIG. 8\nrotor windings, brush gear, and connections, as well as the\nnegative influence of the timely varying generator rotational\nspeed which partially hid the faulty feature. However, the larger\n9.2% fault was clearly visible in the figure and, therefore,\nreadily detectable despite the fact that the 2sfse frequency\nsignal was varying during the experimental processes.\nThis shows that the proposed technique has the potential to\ndetect an incipient 9.2% electrical asymmetry fault on a geared-\ndrive WT generator. The parameters used for this calculation\nare given in Table III.\nV. CONCLUSION\nTo improve the WT availability and reduce the O&M costs,\na new WT condition monitoring technique has been proposed.\nFrom this research, the following conclusions can be reached.\n1) In comparison with the conventional vibration, tem-\nperature measurement, and lubrication oil analysis,\nthe technique proposed shows the following potential\nadvantages:\na) reduced capital cost;\nb) ability to detect both electrical and mechanical faults;\nc) applicable to both geared and direct-drive WTs.\n2) The proposed CWT-based energy tracking method not\nonly reduces the calculation needed to extract features\nfrom lengthy online data but also provides a feasible\ncondition monitoring approach that is applicable to WTs\noperating at either fixed or variable speed.\n3) Experiments have shown that the proposed technique is\ncapable of detecting both mechanical and electrical faults\nin WT drive trains of different types.\n4) The technique is a feasible way to establish a sim-\nple, cheap, but potentially global cost-effective CMS for\na WT.\nThe technique now needs to be applied to the power signals\nobtained from real WTs during real mechanical and electrical\nfaults to determine the detectability of the algorithm and its\nability to detect incipient faults in both cases.\nFurther work will also be needed to establish the ability of\nthis technique for a wider range of faults and for a variable-\nspeed WT under closed-loop control.\nAPPENDIX A\nGENERATOR ROTOR MECHANICAL UNBALANCE\nBased on BS ISO1940-1:2003, the balance quality grade G\nmay be calculated by\nG = e · 2πfrm (A1)\nwhere\ne =mr\/Meq (A2)\nUm =(m\/Meq)× 100. (A3)\nAuthorized licensed use limited to: University of Durham. Downloaded on April 09,2010 at 13:54:59 UTC from IEEE Xplore.  Restrictions apply. \n270 IEEE TRANSACTIONS ON INDUSTRIAL ELECTRONICS, VOL. 57, NO. 1, JANUARY 2010\nFig. 9. Rotor circuit diagram, including a resistive load bank.\nTABLE IV\nELECTRICAL ASYMMETRY APPLIED TO TEST RIG IN FIG. 8\nFor the test rig shown in Fig. 6(a), the unbalance mass m =\n1.0 kg, the effective radius r = 865 mm, and the equivalent\nrotating mass of the test rig Meq = 290.7 kg. The average\nrotational speed of the generator rotor is 25 r\/min. This gives\na balance quality grade and mechanical unbalance for Fig. 7 of\nG 7.8 (G = 7.8 mm\/s) and Um = 0.3%, respectively.\nAPPENDIX B\nGENERATOR ROTOR ELECTRICAL ASYMMETRY\nThe details of the generator rotor circuit shown in Fig. 6(b)\ntaking into account the external resistive load bank are shown\nin Fig. 9.\nThe balanced circuit resistances were given by\n⎧⎨\n⎩\nRAB = RAV + RBV + RAS + RBS + (RA + RB)\/2\nRBC = RBV + RCV + RBS + RCS + (RB + RC)\/2\nRCA = RCV + RAV + RCS + RAS + (RC + RA)\/2.\n(B1)\nThe circuits are balanced, giving\nRAB = RBC = RCA = R = 7.60 Ω (B2)\nwhere R = (RAB + RBC + RCA)\/3.\nThen, the electrical imbalance can be estimated through\ncalculating the residual circuit resistance δR, i.e.,\nδR = |RABeiθ1 + RBCeiθ2 + RCAeiθ3 | (B3)\nwhere i =\n√−1, θ1 = 0, θ2 = 2π\/3, and θ3 = 4π\/3.\nThe percentage fault can be described by\nUe = (δR\/R)× 100. (B4)\nThe larger the value of Ue, the more serious the electrical\nasymmetry. The electrical asymmetries applied in Fig. 8 are\nlisted in Table IV.\nACKNOWLEDGMENT\nThe authors would like to thank the New and Renewable En-\nergy Centre, Blyth, for the assistance for the original provision\nof the test rig.\nREFERENCES\n[1] J. F. Manwell, A. L. Rogers, and J. G. McGowan, “Status of offshore wind\nenergy in the United States,” in Proc. IEEE Power Eng. Soc. Summer\nMeeting, Jul. 15–19, 2001, vol. 1, pp. 10–13.\n[2] H. Polinder, F. F. A. van der Pijl, G. J. de Vilder, and P. J. Tavner, “Com-\nparison of direct-drive and geared generator concepts for wind turbines,”\nIEEE Trans. Energy Convers., vol. 21, no. 3, pp. 725–733, Sep. 2006.\n[3] J. Nilsson and L. Bertling, “Maintenance management of wind power\nsystems using condition monitoring systems—Life cycle cost analysis for\ntwo case studies,” IEEE Trans. Energy Convers., vol. 22, no. 1, pp. 223–\n229, Mar. 2007.\n[4] P. J. Tavner, “Review of condition monitoring of rotating electrical ma-\nchines,” IET Elect. Power Appl., vol. 2, no. 4, pp. 215–247, Jul. 2008.\n[5] D. Casadei, F. Filippetti, A. Yazidi, C. Rossi, and G. A. Capolino, “Diag-\nnostic technique based on rotor modulating signals signature analysis for\ndoubly fed induction machines in wind generator systems,” in Conf. Rec.\nIEEE IAS Annu. Meeting, Oct. 8–12, 2006, vol. 3, pp. 1525–1532.\n[6] A. Bellini, F. Filippetti, C. Tassoni, and G. A. Capolino, “Advances in di-\nagnostic techniques for induction machines,” IEEE Trans. Ind. Electron.,\nvol. 55, no. 12, pp. 4109–4126, Dec. 2008.\n[7] P. Caselitz and J. Giebhardt, “Rotor condition monitoring for improved\noperational safety of offshore wind energy converters,” Trans. ASME, J.\nSol. Energy Eng., vol. 127, no. 2, pp. 253–261, May 2005.\n[8] F. Spinato, P. J. Tavner, G. J. W. van Bussel, and E. Koutoulakos, “Reli-\nability of wind turbine subassemblies,” IET Renew. Power Gener., vol. 3,\nno. 4, pp. 1–15, 2009.\n[9] S. F. Legowski, A. H. M. Sadrul Ula, and A. M. Trzynadlowski, “Instanta-\nneous power as a medium for the signature analysis of induction motors,”\nIEEE Trans. Ind. Appl., vol. 32, no. 4, pp. 904–909, Jul.\/Aug. 1996.\n[10] W. Q. Jeffries, J. A. Chambers, and D. G. Infield, “Experience with\nbicoherence of electrical power for condition monitoring of wind turbine\nblades,” Proc. Inst. Elect. Eng.—Vis. Image Signal Process., vol. 145,\nno. 3, pp. 141–148, Jun. 1998.\n[11] W. Yang, P. J. Tavner, C. J. Crabtree, and M. Wilkinson, “Research on a\nsimple, cheap but globally effective condition monitoring technique for\nwind turbines,” presented at the XVIII Int. Conf. Electrical Machines\n(ICEM), Vilamoura, Portugal, Sep. 2008, Paper ID 1053.\n[12] J. Cusido, L. Romeral, J. A. Ortega, J. A. Rosero, and A. E. Garcia, “Fault\ndetection in induction machines using power spectral density in wavelet\ndecomposition,” IEEE Trans. Ind. Electron., vol. 55, no. 2, pp. 633–643,\nFeb. 2008.\n[13] A. Ordaz-Moreno, R. de Jesus Romero-Troncoso, J. A. Vite-Frias,\nJ. R. Rivera-Gillen, and A. Garcia-Perez, “Automatic online diagnosis\nalgorithm for broken-bar detection on induction motors based on discrete\nwavelet transform for FPGA implementation,” IEEE Trans. Ind. Electron.,\nvol. 55, no. 5, pp. 2193–2202, May 2008.\n[14] M. Riera-Guasp, J. A. Antonino-Daviu, M. Pineda-Sanchez,\nR. Puche-Panadero, and J. Perez-Cruz, “A general approach for the\ntransient detection of slip-dependent fault components based on the\ndiscrete wavelet transform,” IEEE Trans. Ind. Electron., vol. 55, no. 12,\npp. 4167–4180, Dec. 2008.\n[15] S. S. Tsai, C. T. Hsieh, and S. J. Huang, “Enhancement of damage-\ndetection of wind turbine blades via CWT-based approaches,” IEEE\nTrans. Energy Convers., vol. 21, no. 3, pp. 776–781, Sep. 2006.\n[16] W. Yang, P. J. Tavner, and M. Wilkinson, “Condition monitoring and\nfault diagnosis of a wind turbine synchronous generator drive train,” IET\nRenew. Power Gener., vol. 3, no. 1, pp. 1–11, Mar. 2009.\n[17] E. Wiggelinkhuizen, T. Verbruggen, H. Braam, L. Rademakers, J. Xiang,\nand S. Watson, “Assessment of condition monitoring techniques for off-\nshore wind farms,” Trans. ASME, J. Sol. Energy Eng., vol. 130, no. 3,\npp. 1–9, Aug. 2008.\n[18] S. K. Lee, “An acoustic decay measurement based on time–frequency\nanalysis using wavelet transform,” J. Sound Vib., vol. 252, no. 1, pp. 141–\n153, Apr. 2002.\nAuthorized licensed use limited to: University of Durham. Downloaded on April 09,2010 at 13:54:59 UTC from IEEE Xplore.  Restrictions apply. \nYANG et al.: COST-EFFECTIVE CONDITION MONITORING FOR WIND TURBINES 271\nWenxian Yang received the Ph.D. degree in me-\nchanical engineering from Xi’an Jiaotong University,\nXi’an, China, in 1999. He completed his postdoctoral\nresearch in Northwestern Polytechnical University,\nXi’an, in 2001.\nHe was with the City University of Hong Kong,\nKowloon, Hong Kong; Nottingham Trent Uni-\nversity, Nottingham, U.K.; Cranfield University,\nCranfield, U.K.; and Durham University, Durham,\nU.K. He is currently a Technical Specialist with the\nNew and Renewable Energy Centre, Blyth, U.K. He\nhas worked in the areas of new and renewable energy, signal processing, ma-\nchine condition monitoring and fault diagnosis, nondestructive testing and non-\ndestructive evaluation, and artificial intelligence in both industry and academia.\nPeter J. Tavner (SM’08) received the M.A. degree\nfrom Cambridge University, Cambridge, U.K., in\n1969 and the Ph.D. degree from Southampton Uni-\nversity, Southampton, U.K., in 1978.\nHe held research and technical positions in the\nindustry, including being a Group Technical Director\nwith FKI Energy Technology, Loughborough, U.K.\nHe is currently a Professor of new and renewable en-\nergy and the Head of the School of Engineering and\nComputing Sciences, Durham University, Durham,\nU.K. His research interest includes machines for\nrenewable energy, condition monitoring, and reliability.\nDr. Tavner was the recipient of the Institution Premium of the Institution of\nElectrical Engineers, U.K.\nChristopher J. Crabtree received the M.Eng.\ndegree in engineering from Durham University,\nDurham, U.K., in 2007, having studied new and\nrenewable energy as an electrical engineer, where\nhe is currently working toward the Ph.D. degree in\ncondition monitoring of offshore wind turbines.\nHis research interests include the development\nof condition monitoring techniques using industrial\ndata and a test rig.\nMichael Wilkinson received the M.Sc. degree in\nelectromagnetic sensing from Durham University,\nDurham, U.K., in 2003 and the Eng.D. degree with\na thesis on condition monitoring for offshore wind\nturbines from Newcastle University, Newcastle upon\nTyne, U.K., in 2007, in a collaborative project with\nDurham University and FKI Energy Technology.\nIn 2007, he joined Garrad Hassan, Bristol, U.K., as\npart of the operational projects team, where he has\nbeen monitoring wind farms worldwide on behalf\nof owners. His research interests include condition\nmonitoring and reliability of wind turbines.\nAuthorized licensed use limited to: University of Durham. Downloaded on April 09,2010 at 13:54:59 UTC from IEEE Xplore.  Restrictions apply. \n"}