{"doi":"10.1016\/j.ijinfomgt.2005.11.007","coreId":"101708","oai":"oai:epubs.surrey.ac.uk:1138","identifiers":["oai:epubs.surrey.ac.uk:1138","10.1016\/j.ijinfomgt.2005.11.007"],"title":"eCommerce in China: the Case of Travel","authors":["Li, Li","Buhalis, Dimitrios"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-04-01","abstract":"<p>On-line customer research has been conducted for European and American markets by marketers and academics.  Whilst eCommerce and tourism develop rapidly in China, understanding of Chinese Internet travellers is required.  This article investigates features of this on-line segment through a survey with 634 responses.  It aims to establish segmental information and identify influential factors of eShopping adoption by Internet travellers in China.  The key findings include that surveyed lookers who are in the age group of 31-40 and those who live in Pearl River Delta are most likely to book travel on-line.  Also, age, area of residence, type of travel website most visited, length of time using the Internet, self-efficacy, domain-specific innovativeness and perception of the Internet are influential factors of Chinese lookers becoming bookers.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1138<\/identifier><datestamp>\n      2017-10-31T14:00:47Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6172747368756D616E736369656E636573:746F757269736D<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1138\/<\/dc:relation><dc:title>\n        eCommerce in China: the Case of Travel<\/dc:title><dc:creator>\n        Li, Li<\/dc:creator><dc:creator>\n        Buhalis, Dimitrios<\/dc:creator><dc:description>\n        <p>On-line customer research has been conducted for European and American markets by marketers and academics.  Whilst eCommerce and tourism develop rapidly in China, understanding of Chinese Internet travellers is required.  This article investigates features of this on-line segment through a survey with 634 responses.  It aims to establish segmental information and identify influential factors of eShopping adoption by Internet travellers in China.  The key findings include that surveyed lookers who are in the age group of 31-40 and those who live in Pearl River Delta are most likely to book travel on-line.  Also, age, area of residence, type of travel website most visited, length of time using the Internet, self-efficacy, domain-specific innovativeness and perception of the Internet are influential factors of Chinese lookers becoming bookers.<\/p><\/dc:description><dc:date>\n        2006-04-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1138\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Li, Li and Buhalis, Dimitrios  (2006) eCommerce in China: the Case of Travel   International Journal of Information Management, 26 (2).  pp. 153-166.      <\/dc:identifier><dc:relation>\n        10.1016\/j.ijinfomgt.2005.11.007<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1138\/","10.1016\/j.ijinfomgt.2005.11.007"],"year":2006,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"1eCommerce in China: the Case of Travel\nLi Li\nDimitrios Buhalis\nUniversity of Surrey\nAbstract\nOn-line customer research has been conducted for European and American markets\nby marketers and academics. Whilst eCommerce and tourism develop rapidly in\nChina, understanding of Chinese Internet travellers is required. This article\ninvestigates features of this on-line segment through a survey with 634 responses. It\naims to establish segmental information and identify influential factors of eShopping\nadoption by Internet travellers in China. The key findings include that surveyed\nlookers who are in the age group of 31-40 and those who live in Pearl River Delta are\nmost likely to book travel on-line. Also, age, area of residence, type of travel website\nmost visited, length of time using the Internet, self-efficacy, domain-specific\ninnovativeness and perception of the Internet are influential factors of Chinese lookers\nbecoming bookers.\nKeywords: eCommerce, tourism, China, Internet travellers, bookers, lookers-only,\neShopping\n1. Corresponding author: Li Li, School of Management, University of Surrey,\nGuildford, Surrey, GU2 7XH, UK. Email: l.li@surrey.ac.uk Tel: +44(0)2086614905.\nFax: +44(0)2086614901\n2Introduction\nConsumers’ on-line behaviour is different in nature from traditional consumer\nbehaviours due to the unique characteristics and interaction of technology and culture\n[12]. As on-line channels are becoming increasingly important for businesses\nworldwide, researchers and marketers try to understand eCustomers’ on-line\nbehaviour. Large volume of papers has been written on American and European on-\nline segments [7, 14, 24, 28, 41]. This article outlines eCommerce development in\nChina’s tourism industry and discusses Chinese Internet travellers’ characteristics and\ntheir adoption of eShopping for travel products.\neCommerce in China\nPricewaterhouseCoopers comments that pure eCommerce, practically, does not exist\nin China. However, China’s eCommerce does exist, but it is a world away from the\nsmooth and real-time transactions experienced in Internet advanced countries [23].\nOne-stop on-line shop with real-time purchasing is rarely seen in China’s cybermarket;\ninstead the majority of commercial websites provide information about products only.\nHence, Chinese eCustomers usually have to go through off-line means to purchase\ngoods and services that they found or booked on the Internet.\n• The Size of the Chinese eCommerce Market\nFigure 1 demonstrates the incrementing size of China’s on-line segment. Exceeding\nJapan and South Korea (64.5 million and 29.2 million Internet users respectively [25]),\nChinese on-line population have become the main force of Internet expansion in Asia\nwith almost 80 million users in 2003, which is only 6% of the total mainland Chinese\n3[10, 36]. The real figure should be higher than the official statistic which does not\ninclude users who share the same computer or login in to go on-line [17].\nAccording to CNNIC [11], the majority of Chinese Internet users are students and\npeople in engineering field, younger than 35. The on-line population often use the\nInternet to receive\/send emails (88.4% of the total users), to read news (59.2%) and\nsearch information including travel-related information (61.6%) [11]. In addition,\nduring 2003 over 40% of the surveyed Chinese Internet users are cyberbuyers,\nincreased from 32% in 2000. They often purchase books, CDs and computer\nappliances from the net [18]. \nThe growing number of Internet users and cyberbuyers has provided an opportunity\nfor eBusiness development in China. In contrast to 1500 websites in 1997, there are\nover 590 thousand in 2003. Most of them are eCommerce sites and over 45% of these\nsites have eCommerce capabilities [10, 16]. Chinese enterprises have created national\nleading porters (sina.com, sohu.com, and 163.com), and the largest on-line book\nretailer in China is dangdang.com. These sites are the counterparts of America’s\nYahoo and Amazon in that order. Other key players include Alibaba.com, China’s\nforemost Business-to-Business website, eLong.com and Ctrip.com, leading on-line\ntravel companies, and EachNet, China’s largest cyber marketplace. On average, two\ncommercial websites are being registered every day in China [19].  \n \n• The Value of the Chinese Cybermarket\nThe first on-line sale in March 1998 symbolised the beginning of China’s eCommerce\n[38]. US$40 million were generated in 1999 in China, opposed to US$8 million in\n1998 [3]. The total value of consumer on-line purchasing reached US$38.6 million in\n42000 [29]. eBay, the US on-line auction giant, estimates that China's eCommerce\nrevenue will reach more than US$16 billion in the near future [37]. Moreover,\naccording to Easyspace Ltd. Company, the market’s value is projected to expand to\nUS$23 billion within three years, in contrast to the current value of US$500 million\nper year [52].\nCompared with American and European markets, China’s eCommerce capacity lags\nbehind [54]. For example, consumer eCommerce revenues for the first quarter of\n2002 in the America was US$17 billion; whereas in China, eCommerce revenue is\nprojected to reach only US$4.8 billion by 2004 [18]. However, this is understandable.\nConsumers in developing countries tend to purchase goods off-line due to a number\nof factors that affect eCommerce development. In China, the trade tradition is\nrepresented with “pay off in cash on good’s arrival” on a face-to-face basis. This\nnorm still shapes Chinese consumers’ buying behaviour nowadays, which virtually\nchallenges the payment modes that are widely available for on-line transactions.\nChinese eCustomers\nThe main reasons for Chinese Internet users shopping on-line are time-saving, lower\ncosts, easy to use and looking for rare goods; and around 22% of the buyers purchase\nout of curiosity [11]. Cyberbuyers in mainland China are different from those in\nHong Kong and Singapore, who claim that convenience in delivery and ease in\npurchase is the main reason for shopping on-line and rank unique merchandise the\nsecond as a factor promoting on-line buys [26, 49].\nFigure 2 portrays Chinese eCustomers’ changing attitude toward eShopping over the\nperiod of time from 1998 to 2003. First of all, there are concerns over product quality,\n5trustworthiness of retailers and security, which are also worries for the cyberbuyers in\nHong Kong and Singapore [49]. In the first year of China’s eCommerce, product\nquality, post-purchase services, and the trustworthiness of product providers most\nconcerned many mainland Chinese Internet users (around 58%). After a continuous\nfall from 1999 to 2001, this issue still bothered 42% of Chinese Internet users in 2003\n[10]. While this may set an alarm for Chinese eRetailers, it probably results from\ncurrent limited regulations and poor enforcement of protecting customer’s rights in\nelectronic commerce in the country. However, more people are expected to develop a\npositive attitude towards eShopping as China’s eCommerce develops with improving\nservice infrastructure and legal environment.\nSecurity is the second major concern for Chinese eCustomers. Around 30% worry\nabout the security of pay on-line in recent years, opposed to 50% in 1998, as\nillustrated in Figure 2. This worry will continue to be an issue for eCommerce given\nthe fact that American consumers are still concerned with security after so many years\nof extensive acceptance of Internet and eCommerce with functional and reliable\nbanking infrastructure [18]. \n \nDespite of the wide recognition that the unsophisticated pay and delivery\ninfrastructure hinder eCommerce developments in China [5, 6, 22, 56], Chinese\nInternet users do not seem to be troubled with payment modes available for on-line\npurchases. The percentage of users complaining that the payment methods are\ninconvenient has been declining, as illustrated in Figure 2. In 2003, only around 7%\nof the users felt that the on-line pay modes not convenient [10]. The downward trend\nseems to mirror and support BDA-China’s argument that the lack of sophisticated\npayment systems does not pose a major obstacle to China’s eCommerce, because its\n6cash-on-delivery system is a reliable and popular means of payment for on-line\npurchases [18]. This may also suggest that the on-line payment system will soon not\nbe a main obstacle to China’s eCommerce development.\nFurthermore, around 10% of Internet users perceive goods delivery being slow in\nChina. The percentage has been decreasing since 2001. This may hint that postal\nservices in the country generally satisfy customers and on-line merchants. Efendioglu\net al [18] comment that the emerging private courier companies in China and the\ncontracts between China’s postal service and on-line merchants for goods delivery\nsignificantly minimize the distribution challenge for the eBusinesses.\neTourism in China\nAlthough the Internet has become an important information source with its rich travel\ninformation and increasingly diverse tourist products, China’s eTourism is at its infant\nstage of development [50, 53]. In 2003, only 2% of the total e-tickets issued through\nCivil Aviation Authority of China’s Electronic Tourist Distribution system were\nbooked on-line [46]. This represents the on-line air bookings nationwide, commented\nby Mr Jian Zhao, the Marketing Manager of TravelSky, in the personal interview in\nMay 2004 in London. In the hospitality sector, the Internet is used as a marketing tool\nfor providing information about the properties. For those who receive on-line\nreservations, Internet sales represent a small proportion of total revenue. On-line\nsales in Beijing are on average at around 4% of total sales, and 3-star hotels generate\nhigher on-line sales than 4-star and 5-star properties do [31]. Due to the lack of\nmutual trust between the hoteliers and customers, off-line confirmation for on-line\nreservation is commonly used [31, 53].\n7China’s travel service sector has encountered revolutionary changes due to the\ncommercial use of the Internet. Businesses from IT industry take advantage of\neCommerce, and become on-line travel agencies, such as the tourism division of\n163.com (an Internet portal), Byecity.com, Ctrip.com and eLong.com. These new\nentrants are often backed by advanced technology companies and competitive tourism\norganisations with funds from Chinese and foreign conglomerates. Despite their\ninnovative technologies, competing with the key conventional tour operators and\ntravel agencies is still challenging. More Chinese on-line agencies are gradually\nmoving towards the combination of on-line and off-line due to the pressure of\nprofitability [53]. Call centres thus become their core business units, demonstrated by\n40% of Internet sales being reported by Ctrip.com’s and eLong.com’s hotel\nreservation call centres [31].\nIn China’s marketspace, around 7.5% of Internet users search travel information on-\nline [11]. These individuals are actually the lookers. During 2003, 6.6% of Chinese\neCustomers purchased tickets and 3.4% booked hotel rooms [10]. These bookers\nrepresent early adopters of eShopping for tourism products. As independent travel\nand self-driving holidays become popular in China, the demand for use of the net for\ninformation search and\/or travel bookings is expected to increase [53].\nResearch Design\nThe study of Chinese Internet travellers is very limited. A research was carried out to\ninvestigate the characteristics of Chinese travel lookers and their adoption of\neShopping for tourism products. It takes consideration of a variety of variables,\nwhich will be discussed below. They can be categorised into socio-demographics,\n8travel-related behaviour, perception of the Internet, self-efficacy, customer domain-\nspecific innovativeness (DSI), Guanxi and wired lifestyle. The research aims to\nestablish segmental information of Chinese e-tourists (including lookers-only and\nbookers) and to identify their different characteristics, based on results of an on-line\nsurvey with over 600 participants.\n• Factors\nSocio-demographic information including education level, age, income and\noccupation are considerably different among bookers, lookers and other Internet users\n[35]. In China, economy and tourism are better developed in Beijing and Tianjin Belt,\nthe Yangtze River Delta covering Shanghai, and the Pearl River Delta [44, 48, 53].  \nHence, these areas should be the major Chinese e-tourists generating regions.\nFurr, Bonn and Hausman [21] report that American Internet users who travel longer\ndistances tend to be more affluent and better educated, and tend to spend more for\ntravel services, compared with non-Internet users who travel shorter distances to the\nsame destination regions. Membership of Frequent Flyer Programmes, frequency of\ntravel and the number of trips yearly are important indicators of lookers’ probability\nof being bookers [35].\nBase upon the theories of innovation diffusion, reasoned action and planned\nbehaviour, perception of the Internet, self-efficacy, DSI, and wired-lifestyle are\ninfluential factors that explain eShopping adoption [1, 2, 11, 12, 13, 15, 20, 33, 42, 43,\n47]. Customers’ attitude towards the Internet as an information and reservation tool\nfor travel bookings is determined by the perceived attributes of the Internet. Formed\nattitude has a direct relationship with intention to shop travel on-line [13].  Self-\n9efficacy is the “consumer’s self-assessment of his\/her capabilities to shop on-line”\n[47]. This concept represents Theory of Planned Behaviour’s perceived behavioural\ncontrol [2], and is positively associated with intention to purchase goods from the Net\n[47].\nAccording to Citrin’s et al [13] study on DSI, a looker is likely to be an experienced\nInternet user, and be innovative within the domain of the Internet and Web. For\ninstance, a person with a high level of DSI is more likely to be the first person in\nhis\/her circle of friends to visit a new travel website. A wired lifestyle is vital to\npredicting Internet shopping. This concept can be examined through the length and\nfrequency of a user using the Internet and the products that the user has purchased\n[13]. The more frequently customers use the Internet, the more likely they become\neShoppers [43]. It is also reported that American travellers often search websites of\non-line travel services to compare travel prices [35].\nCultural norms shape customers’ buying behaviour. In collectivist cultures, like\nChina and Korea, family and other members will offer help when anyone in the group\nsuffers losses after selecting a risky option, whereas people in individualist culture are\nexpected to bear the consequences of their own decisions [40]. This is named cushion\neffect. Park and Jun [40] observe that Korean Internet users show higher perceived\nrisks on privacy, security and product than American users, but still frequently\npurchase products on-line. They comment that this is a result of the cushion effect.\nGuanxi is an aspect of Chinese cultural values, meaning a network of relationships\nimplanted with reciprocal obligations through a self-conscious manipulation of\nvarious socio-cultural symbols including Renqing and Ganqing [51]. An individual is\nobliged to pay back the debt of gratitude to another person whom he\/she owe Renqing\n10\nto [30]. Ganqing stands for friendship, implying expectations and obligations of\ngetting\/granting favourable responses from\/to one’s friends [30, 34]. Efendioglu et al\n[18] detect Guanxi’s cultural characteristics in the current transaction systems in\nChina’s eCommerce. Chinese eRetailers use customers’ “moral obligation to return a\nfavour” to encourage on-line sales.\n• Research Questions\nIn order to establish segmental information of Chinese Internet travellers and to\nidentify characteristic differences between lookers-only and bookers. Two questions\nare raised:\n1) Who are using the Internet for travel-related activities in China?\n2) What characteristics do the Chinese lookers have?\nThe second question leads to seven hypothesises that are set as follows:\nH1:There is difference between lookers-only’s and bookers’ socio-demographics.\nH2:There is difference between lookers-only’s and bookers’ travel-related variables.\nH3:There is difference between lookers-only’s and bookers’ wired lifestyle.\nH4:There is difference between lookers-only’s and bookers’ DSI.\nH5:There is difference between lookers-only’s and bookers’ self efficacy.\nH6:There is difference between lookers-only’s and bookers’ Guanxi variables.\nH7:There is difference between lookers-only’s and bookers’ perception of the\nInternet.\n• Questionnaire Development\nA questionnaire was designed to obtain socio-demographic information of\nrespondents, their wired lifestyle in relation to travel and leisure activities and the\n11\nattributes explained by DSI, self-efficacy, Guanxi and perception of the Internet. The\nstatements listed in Table 1 were developed to tap the attribute variables, were placed\non a seven-point Likert scale (from 1 to 7) to capture more variances. All the\nquestions were initially developed in English and then translated into Chinese. To\nensure the accuracy of translation, a convenient group of 12 Chinese students was\ninvited to the pilot study. Two minor changes on wording in Chinese were then made\naccordingly.\n• Sampling and Data Collection\nGiven the large on-line population in China, contacting with individual Internet users\nis practically impossible. The study is interested in those who use the Internet for\ntravel-related activities. In order to reach this particular segment, corporation with\neLong.com, a leading on-line travel company in China, was established to implement\nan on-line survey in June 2004. It was difficult to decide the sample size because\nresponse rate of a similar survey in China was not known. To obtain sufficient\nresponses for data analysis, 103,000 registered customers of the company were\nrandomly selected from its database and were contacted through emails. When\nrespondents submitted the questionnaire form on-line, answers were automatically\nstored in a self-built database. The on-line survey offered an effective way to reach\nthe subjects of research interest; however, the sampling method reduced the ability to\ngeneralise findings.\n• Data Analysis Methods\nPerception of the Internet was tapped with 12 statements. To ensure the instrument\nwas valid, a factor analysis was employed to identify underlying dimensions of the\nconcept, which could then be used as independent variables to facilitate interpretation\n12\nof findings. Descriptive statistics were used. For categorical variables, distribution\nfrequency and mode values were computed. Means and standard deviations were\ncalculated for the continuous variables.\nChi-square test and t-test were exploited to compare mean values, so that hypothesis\nH1-H7 could be examined. Chi-square test was performed on variables measured on\nnominal scales, and those with skewed distributions. The test for all the variables\nsatisfied the criterion of minimum expected cell frequency – “at least 80 per cent of\ncells have expected frequencies of 5 or more” [39]. T-test was used to compare\nmeans of other concepts that were quantified on continuous scales. It was performed\nby using randomly selected 130 cases, half of which were lookers-only and the other\nhalf were bookers. 27 missing values in the t-test sample were replaced with their\ncorresponding mean values. This approach was considered appropriate because all\nthese variables had skewness values ranging -1 and +1.\nFindings\nThe on-line survey obtained 634 usable questionnaires. 563 of the respondents have\nbooked travel on-line (e.g. bookers), accounting for 89%, and 71 were lookers-only.\nThe sample appears to be bookers biased.\nTable 2 illustrates the results of the factor analysis. Four components were identified\nand were named compatibility, complexity, communicability and financial advantage.\nThis is consistent with the perceived attributes of an innovation postulated in\ninnovation diffusion theory [42]. The four-factor-solution explains a total of 68% of\nthe variance with each factor contributing over 15%. Given that a number of strong\n13\nfactor loadings, and that all the variables loaded substantially on only one factor, the\nmodified instrument performs fairly well in tapping the concept.\n• Segmental Information\nSocio-demographics\nTable 3 shows the comparison between socio-demographics of the research sample\nand the official statistics reported by [13]. The samples of this research represent a\nfair equal balance in terms of gender, opposed to CNNIC’s finding that 60% of\nInternet users are male. Also, over 55% of surveyed individuals are single, which is\nvery close to the official figure.\nIn contrast to CNNIC’s statistics, there are only 5% of the respondents who have high\nschool (and below) schooling and almost 50% have bachelor degrees. This may be\ndue to the biased sample, in that respondents are actual customers of a commercial\ntravel company. It can be identified as the limitation to the generalisability of the\nresults to all Chinese online population. However, it seems like that university\ngraduates are the prime markets for travel services, especially on-line. Hence, the\nsample is more representative of Chinese e-tourists.\nThe mainstream of surveyed respondents is in their 20s and 30s: over 61% of them\nbelong to the age group of 21-30, and almost 28% in the bracket of 31-40. Half of the\nrespondents are white-collar workers. 80% of them live in a small family of no more\nthan three people. The one-child policy imposed in the late 1970s in China results in\nmany 3-member Chinese families. The research’s statistics have well reflected this\nphenomenon. Given the overwhelming proportion of the respondents age between 21\n14\nand 40, and 44% of the total sampled individuals are married, it is most likely that\nthese “3 people” households are of “parents with one child” families.\nFurthermore, as shown in Figure 3, over 73% of them report a household annual\nincome of over US$5700 (monthly income times 12) while 18% earn over US$1446\nevery month. Compared with the national average annual disposable income for the\nurban residents, which is US$1023 in 2003 [36], most of the surveyed lookers appear\nto be affluent.\nAs can be seen in Figure 4, 46%, 30% and 14% of surveyed lookers live in Beijing\nand Tianjin areas, Yangtze River Delta and Pearl River Delta respectively. These are\nthree major urban regions, representing relatively higher Internet penetration within\nChina [13]. This finding may indicate that eCommerce in these areas are more\nadvanced than that of other places of the country. It also reflects the fact that\npotential Chinese tourists are generated in these economically better-developed\nregions [27]. \n \nTesting Hypothesis -- Chi-square test results indicate that there are not significant\ndifferences in gender, marital status, education level, occupation, household size and\nhousehold income between lookers-only and bookers. However, heterogeneity in age\ngroup and area of residence between the categorical lookers exists (p<0.0001) (see\nTable 4).\nStatistics suggest that lookers who are aged between 31 and 40 are most likely to\nbook travel on-line. The percentage of the age group members who have purchased\ntravel products is 90%, representing the highest score across all the age groups. This\n15\nmay be because this specific segment is more affluent than those who are younger and\nhave just started a career. Lookers who are over 51 years old are most unlikely to\nbook travel on-line, exemplified by 54% of them being lookers-only. Maybe, it is due\nto their less developed proficiency in using the Internet for shopping. However, this\ngroup of people are potential bookers for tourism firms as they research on-line and\nmay purchase travel off-line.\nAs demonstrated in the second half of Table 4, across regions, lookers in Pearl River\nDelta are most likely to book travel on-line. By contrast, it is actually surprising to\nsee Beijing and Tianjin only come third in the same statistics. The figures also reveal\nthat those living outside the three Delta areas are most likely to only browse the\nwebsites, which probably indicates that they are slower adopters of eShopping for\ntourism products.\nTravel-Related Behaviours\nOn average, respondents took 4.7 domestic trips during the last 12 months, and 23%\nof them had two trips. However, the number of international trips taken by the\nrespondents averages only 0.8. Less than 30% of them travelled to overseas\ndestinations at least once last year. This actually represents a remarkable proportion\nof outbound tourism market embedded in the sample, considering that only 1.6% of\nmainland Chinese visited other countries in 2003 [36]. This, again, suggests that\nmany surveyed lookers are over-average-income earners, and may be in a managerial\nposition with opportunities of travelling abroad for business. Moreover, 50% of the\nrespondents are members of a frequent flyer programme (FFP), reflecting that\nChinese tourism companies have been exercising loyalty programmes in a certain\n16\nscale to retain their customers. It may also imply that a proportion of the surveyed\nlookers are sophisticated and frequent travellers, at least within the country.\nTesting Hypothesis -- Computed significant value for continuity correction is 0.874 in\nthe chi-square test on “FFP membership” and “Have you ever booked travel service\non-line?”. Hence, there is no difference in FFP membership between lookers-only\nand bookers. Moreover, the p values of above 0.05 in t-test suggest that the\ndifferences in the mean figures of “number of domestic trips taken last year” and\n“number of international outbound trips taken last year” between the two categorical\nmembers are insignificant too. Therefore, rejecting H2, the null hypothesis for travel-\nrelated variables is accepted.\nWired Lifestyle: Tourism Perspective\nTable 5 presents respondents’ Internet usage. Almost 50% of them use the Internet\nover 31 hours every week. It seems that the surveyed lookers are heavy Internet users,\nconsidering the average weekly usage of 13 hours in the nation [13]. More than 80%\nof the subjects have over four years of Internet experience, which also suggests that\nmost of them are experienced users.\n85% of total trips booked through the Internet are domestic. While over 89% of\nrespondents report that they purchased hotel rooms for their last on-line booked trips,\n55% bought air tickets. Moreover, over 50% purchased both air tickets and hotel\nrooms. While 42% of the trips are two-people travels, a great proportion of the\nbookers (27%) travelled alone. Around 40% of bookers consumed over RMB2500\n(around US$300) for their last trips booked on-line.\n17\nIn relation to last trips booked on-line, the majority of the bookers used public\ntransportation, but about 30% of bookers drove cars to the destinations. Over 60% of\nthe subjects planned their trips two weeks before departure; whereas 24% prepared\nmore than 3 weeks in advance. 76% of the repliers designed trip itinerary themselves,\nwhich may indicate that Chinese travel agents are playing a fairly insignificant role in\nhelping travellers to arrange their on-line booked holidays. This indicates the\nemergence of disintermediation in China’s eTourism.\nTesting Hypothesis -- The length of time using the Internet is significantly different\nbetween lookers-only and bookers. As shown in Table 6, users who have less than\none year experience with the Internet are more likely to browse the web only.\nLookers who have used the Internet for seven years and more are most likely to book\ntravel on-line. However, lookers-only and bookers do not differ in terms of weekly\nInternet usage, personal payment for Internet service, and frequency of using the\nInternet for travel information in a year, as the computed p values that are greater than\n0.05. The absence of significant relationship between frequency of Internet usage and\nbooking travel on-line does not support the notion that more frequently customers use\nthe Internet, the more likely the eShopping will be adopted by the users [35, 43]. This\nmay demonstrate that researchers should appreciate regional differences in\neCommerce adoption by Internet users.\nStatistic test indicates that people “who visit principals’ websites most often” are\nmore likely to book travel on-line (see Table 7). This seems to represent a rather\ndifferent on-line behaviour pattern from the American Internet travellers who visit the\nwebsites of tourism travel agencies most often are also the most likely to book on-line\n18\n[35]. The finding may also, to some extend, raise a sign of dis-intermediation in\nChina’s tourism industry.\n• Attribute Variables\nAs detailed in Table 8, the overall mean value for domain-specific innovativeness is\n4.22, suggesting that the sampled lookers are overall innovative within the domain of\ntravel websites. The respondents seem to have a fairly high self-assessment of their\ncapabilities to purchase travel on-line. The mean score of 4.36 for Ganqing variable\nseems to propose that surveyed lookers are price-conscious and may seek alternative\nmeans to purchase discounted products off-line, such as personal network. However,\nRenqing does not seem to affect their decision-making on purchase. This is probably\ndue to the low level of “personal touch” in on-line transactions.\nIt seems that the surveyed Chinese have an overall positive perception towards the\nInternet, as demonstrated by the mean values of compatibility, financial advantage,\ncommunicability and complexity. They regard the Internet as a good channel for\npurchasing goods despite concerns over use of credit card on-line (mean value for “I\ndon’t feel safe to use credit card on-line” (PRA1) = 4.45), which may reflect that\ncushion effect also exist in China’s eCommerce. As illustrated in Table 8, financial\nadvantage construct’s mean is 4.6. This, once again, suggests that price is a factor\ndriving samples lookers to shop from the Net. This finding echoes previously\nmentioned CNNIC’s report on why Chinese cyberbuyers purchase goods from the\nInternet. It is also evident that the commercial use of the Internet for booking travels\nis well communicated within respondents. This implies that when the message is\ndelivered to later adopters, the eShopping adoption process may accelerate.\nFurthermore, surveyed individuals do not feel performing eShopping of tourism\n19\nproducts is difficult (mean=2.81). This indicates that respondents are experienced\nInternet users and sophisticated e-tourists.\nTesting Hypothesis -- T-test results suggest accepting H4, H5, and H7 (p<0.05). To\nsome extend, bookers and lookers-only differ in domain-specific innovativeness, self-\nefficacy and perception of the Internet, as illustrated in Table 9. In terms of having a\nfirst-go with a new travel website (DSI1) and showing interest in shopping from a\nnew travel website (DSI2), the lookers-only are less innovative than the bookers.\nThese findings confirm Citrin’s et al [13] assertion that a potential eCustomer is likely\nto be innovative within the domain of the Internet and Web.\nDifference in self-efficacy between surveyed lookers-only and bookers is statistically\nsignificant. An Internet user’s expectation about the outcomes of eShopping travel,\nand the person’s belief about own capability to perform the behaviour model the\nprobability of his\/her engaging in eShopping, according to social cognitive theory [4].\nIn these data, bookers demonstrate a relatively higher level of self assessment on\nproficiency in shopping travel on-line. This appears to echo the positive relationship\nbetween intention to shop on-line and self-efficacy reported in other studies [2, 47].   \n \nA Chi-square test was carried out to compare the means of “I feel confident that I can\nuse the Internet for shopping travel products” (EFF2) between the groups, because the\nvariable has a skewed distribution. It reveals that difference between the mean values\nis not statistically significant (p>0.05). Although lookers-only have not booked travel\nproducts on-line, they show the same degree of positive confidence in using the\nInternet to purchase tourism products (mean=5.46, see Table 8). This is probably due\nto that respondents are experienced Internet users. They may have made purchases of\n20\nother goods on-line; hence they feel confident in using the Internet to book travel\nproducts.\nSurveyed lookers-only and bookers differ in perception of the Internet. While\nbooking travel on-line does not appear complicated (PCX1 and PCX2) to both\ncategorical members, it does pose a relatively higher degree of complexity to the\nlookers-only as shown in Table 9. Moreover, the bookers tend to feel purchasing\ntravel from the Web is compatible with their lifestyle (CMP1 and CMP2) whereas\nlookers-only have an opposite view on this. In line with notions of innovation\ndiffusion theory, these findings indicate that perceived attributes of the Internet as a\nreservation tool for tourism products explain how rapidly it is adopted. Furthermore,\nbeing consistent with intention-based studies, compatibility of electronic travel\nshopping with customers’ lifestyle positively influences the intention to adopt\neShopping, whereas complexity reduces the intention [13, 15, 40, 42, 45, 47].\nAs mentioned previously, surveyed lookers may seek alternative means, such as\npersonal network, to purchase discounted products off-line. However, a closer\ninvestigation on Guanxi between lookers-only and bookers reveals that the groups do\nnot differ in terms of the impact of this cultural norm on their decision making on\neShopping travel product. It appears that Guanxi does not explain Chinese\neCustomers adopting eShopping for tourism products. This may be because the\nInternet has become an important channel offering rich travel information and diverse\ntourism products in China, and Chinese lookers can search and compare travel\nproducts with a great flexibility. Consequently, dependency on personal networks for\npurchasing on-line tourism products is reduced.\n21\nDiscussion\nResearch findings reveal a number of significant influential factors of sampled\nChinese lookers adopting eShopping for travel products, as summaries in Table 10.\nThe sample data suggests that bookers are more innovative than lookers-only in\nrelation to visiting a new travel website. This reaffirms Citrin’s et al [13] notion that\nDSI is an important concept in understanding customer’s intention to shop on-line.\nWhile both surveyed lookers-only and bookers hold a positive self-assessment on\ntheir proficiency in using the Internet to shop tourism products, bookers demonstrate a\nrelatively higher degree of self-efficacy. As this concept represents TPB’s perceived\nbehavioural control, this finding is coherent with the theory of planned behaviour [1].\nFurthermore, differences between lookers-only’s and bookers’ perception of the\nInternet, in particular perceived compatibility and complexity, confirm the visions of\nIDT [42] and theory of reasoned actions [20]. The intention of a potential eCustomer\npurchasing tourism products on-line is partially determined by his\/her attitude towards\neShopping, which is governed by the perceived attributes of the Internet\/Web as a\nreservation tool. Bookers appear to have a more positive attitude toward shopping on-\nline, which explains why they are early adopters of eShopping. Although financial\nadvantage and communicability variables have positive mean values in this study,\nmean value differences between surveyed bookers and lookers-only are not\nstatistically significant. This implies that these two factors are not important in\nexplaining respondents adopting eShopping for travel products in these data.\nThe research findings throw lights to managerial decision-makings. The proliferation\nof the Internet represents threats as well as opportunities for Chinese tourism firms.\nThe study identified a very low level of travel agents’ involvement in helping\n22\neCustomers design itinerary for the trips booked on-line. As most of the surveyed\nChinese Internet travellers represent domestic tourists, who are generally experienced\nin travelling within the state [55], they may prefer making a travel plan that best meets\ntheir own requirements. Hence, eCustomers may bypass travel agents and book\ntourism products from the principals’ websites, which challenges Chinese travel\nagencies with dis-intermediation.\nPotential for business development in the marketspace is tremendous. Although the\nInternet has been emerging as an important travel information source and sales\nchannel in China, its functionalities are still at early stage of development, compared\nwith the good eCommerce practices such as Lastminute.com, Travelocity.com and\nmany others. Hence, to gain competitive advantage, Chinese entrepreneurs ought to\nreact quickly and embrace innovative eSolutions for management and operations.\nGiven the large customer base in China, opportunities also lay in customer acquisition\nby engaging influential forces and identifying potential profitable segments. As\nmentioned previously, the majority of surveyed Chinese lookers are well-educated\nindividuals living in the three economically advanced Deltas. Most of them are\nwhite-collar workers with an above-average income and a small family to support.\nThese people represent early adopters of eShopping in the Chinese society, and form\nthe force that influences others to accept and engage in purchasing travel services\nfrom the Net. Chinese lookers who are aged between 21 and 30 rank second in the\ntendency of purchasing travel on-line. Geographically, the Yangtze River Delta is the\nsecond best region behind Pearl River Delta for fast market penetration. Hence, firms\nmay wish to increase forces to target these segments if they want to acquire new\ncustomers effectively and quickly.\n23\nConclusion\nThis paper has established segmental information of sampled Chinese Internet travel\nlookers. It has also investigated influential factors of adopting eShopping for tourism\nproducts. Research findings initiate managerial implications and solutions that can be\nrealised by utilising Internet-based applications. The potential of business\ndevelopment in the cybermarket are tremendous for the Chinese tourism companies,\nprovided they recognise the strategic implications of information communication\ntechnologies and take full advantage of them. For scholars, this study raises the\nquestion of to what extend theoretical ground developed in the Western communities\nare applicable in the Chinese context. It is advisable that researchers need to take into\naccount regional differences when trying to understand eCustomers from different\ncultural backgrounds.\nGiven the large on-line population in China, the non-probability sampling method\nwith the relatively small sample size in this study would limit the ability to generalise\nfindings as representative to the Chinese population as well as other markets.\nNonetheless, as contributions of this research, it has provided an in-depth knowledge\nabout Chinese Internet travellers, and confirms theories and previous studies of other\nauthors that explain the adoption of commercial use of the Internet. Future research\nshould take into consideration of regulatory factors that may affect the adoption of\nbooking travel on-line in China.\n24\nFigure 1. Internet Users in China: 1997-2003\n79.5\n33.78.9\n22.5\n59.1\n2.10.62\n0\n20\n40\n60\n80\n100\n1997 1998 1999 2000 2001 2002 2003\nyear\nm\nill\nio\nn\nSource: www.CNNIC.com\n25\nFigure 2. Concerns of eShopping\n0.0%\n10.0%\n20.0%\n30.0%\n40.0%\n50.0%\n60.0%\nInconenient\nPayment Mode\nQuality, After\nService,\nTrustworthy\nSecurity Slow Delivery\n1998\n1999\n2000\n2001\n2002\n2003\nSource: Adapted from CNNIC (1999, 2000, 2001, 2002, 2003 & 2004)\n26\nFigure 3. Composition of Respondents: Household Monthly Income\n¥4001-¥8000\n(US$482-\nUS$963)\n<¥4000\n(US$481)\n¥12001+\n(US$1446 +)\n¥8001-¥12000\n(US$964-\nUS$1445)\n38.47%\n26.14%18.18%\n17.21%\nNotes: Converted at US$1 to ¥8.30 RMB\n27\nFigure 4. Composition of Respondents: Area of Residence\nBeijing\n& Tianjin\n46%\nYangtze\nRiver\nDelta\n30%\nPearl\nRiver\nDelta\n14%\nOther\n10%\n28\nTable 1. Variable Inventory: Attributes\nCustomer Domain-Specific Innovativeness\nDSI1: I am among the first in my circle of friends to visit a new travel-related website.\nDSI2: If I heard that a new travel website was available on the Internet, I would be interested\nenough to shop from it.\nDSI3: Compared to my friends, I seek out relatively more information over the Web.\nDSI4: I am the first in my circle of friends to know of any new travel websites.\nDSI5: I will visit a new tourism company’s website even if I have not heard of it before.\nSelf Efficacy\nEFF1: I am proficient in using the Internet for shopping travel product\/services.\nEFF2: I feel confident that I can use the Internet for shopping travel product\/services.\nGuanxi\nRQG: Sometimes, I have to purchase tour package from the person\/party whom I have owed\nRenqing to even though the same tour or a similar one can be bought from a travel website.\nGQG: When I intent to purchase a product presented on a travel website, I would ask a friend\nof mine who may be able to get a discounted rate to book it for me.\nPerceptions of the Internet\nPRA1: I don’t feel safe to use credit card on-line.\nPRA2: Generally travel websites offer tourism products at cheap prices.\nPRA3: I would buy discounted travel products on-line.\nPRA4: I would book travel on-line more often if incentives, such as frequent flyer miles or\npoints, are provided.\nPCX1: I feel I am not clear with on-line reservation procedure.\nPCX2: I feel it is not easy to book travel on-line.\nCMP1: Using the Internet to shop travel product\/services is compatible with the way I like to\nshop.\nCMP2: Using the Internet to shop travel product\/services fits with my lifestyle.\nCMP3: I am used to travel agents or toll-free numbers.\nCMP4: I intent to book travel on-line more often.\nCMM1: I have heard about people booking travel on-line many times.\nCMM2: Many friends have booked travel on-line.\n29\nTable 2. The Modified Perception of the Internet Scale: Factor Analysis\nFactor Loading Communalities\nCMP2 0.899 0.847Factor 1 Compatibility CMP1 0.872 0.809\nPCX1 0.898 0.808Factor 2 Complexity PCX2 0.898 0.815\nCMM2 0.916 0.878Factor 3\nCommunicability CMM1 0.898 0.871\nPRA1 0.660 0.519\nPRA3 0.634 0.621\nPRA2 0.630 0.474\nFactor 4 Financial\nAdvantage\nPRA4 0.623 0.612\nEigenvalue 2.473 1.905 1.898 1.883\n% of variance explained 20.61 15.87 15.82 15.69 67.99 *\nNote: Extraction Method - Principal Component Analysis; Rotation Method - Varimax with\nKaiser Normalization; Items loadings less than 0.5 were omitted; Rotation converged in 5\niterations.\n* cumulative % of variance explained\n30\nTable 3. Socio-Demographics Comparison: Gender, Marital Status and Education\n% of total respondentsVariables Research Sample CNNIC (2004)\nMale 50.17% 60.40%Gender\nFemale 49.83% 39.60%\nSingle 55.79% 56.80%Marital status\nMarried 44.21% 43.20%\nHigh school & below 5.14% 42.80%\nJunior college 29.10% 27.40%\nBachelor degree 48.39% 27.10%\nMaster degree 15.59% 2.20%\nHighest educational\nattainment\nDoctor degree 1.77% 0.50%\n31\nTable 4. Chi-Square Test Results: Age, Area of Residence\nAge * Have you ever booked travel service on-line? No Yes Total\n20 and less % within Age 22.2% 77.8% 100.0%\n21-30 % within Age 11.3% 88.7% 100.0%\n31-40 % within Age 9.8% 90.2% 100.0%\n41-50 % within Age 12.8% 87.2% 100.0%\n51 and above % within Age 53.8% 46.2% 100.0%\nArea of residence * Have you ever booked travel service\non-line?\nNo Yes Total\nBeijing & Tianjin % within Area of residence 10.7% 89.3% 100.0%\nYangtze River Delta % within Area of residence 8.4% 91.6% 100.0%\nPearl River Delta % within Area of residence 4.7% 95.3% 100.0%\nOther % within Area of residence 34.4% 65.6% 100.0%\n32\nTable 5. Internet Usage\nWeekly Internet\nUsage\n% of total\nrespondents\nLength of Time\nUsing the Internet\n% of total\nrespondents\n1-10 hours 17.48% < 1 year 1.28%\n11-20 hours 17.31% 1-3 years 16.00%\n21-30 hours 16.34% 4-6 years 58.24%\n31 hours + 48.87% 7 years + 24.48%\n33\nTable 6. Chi-Square Test Results: Length of Time Using the Internet\nLength of time using the Internet * Have you ever booked\ntravel service on-line?\nNo Yes Total\nless than 1 year % within Length of time using the Internet 37.5% 62.5% 100.0%\n1-3 years % within Length of time using the Internet 10.0% 90.0% 100.0%\n4-6 years % within Length of time using the Internet 12.4% 87.6% 100.0%\n7 years and more % within Length of time using the Internet 7.8% 92.2% 100.0%\n34\nTable 7. Chi-Square Results: Commercial Travel Website Visited Most\nCommercial travel website visited most often * Have you\never booked travel service online?\nNo Yes Total\nof airlines\/hotels\/other\ntravel suppliers\n% within Commercial travel\nwebsite visited most often 7.6% 92.4% 100.0%\nof online travel\nagencies\n% within Commercial travel\nwebsite visited most often 11.0% 89.0% 100.0%\nother % within Commercial travel\nwebsite visited most often 16.6% 83.4% 100.0%\n35\nTable 8. Descriptive Statistics\nVariables Mean Std.Deviation Variance\nDomain-Specific\nInnovativeness 4.22\nDSI1 3.91 1.35 1.83\nDSI2 3.92 1.21 1.46\nDSI3 4.97 1.16 1.35\nDSI4 3.85 1.34 1.79\nDSI5 4.47 1.40 1.97\nSelf Efficacy 5.39\nEFF1 5.31 1.23 1.52\nEFF2 5.46 1.16 1.36\nGuanxi\nGQG 4.36 1.32 1.75\nRQG 3.20 1.46 2.13\nCompatibility 4.51\nCMP1 4.47 1.19 1.43\nCMP2 4.55 1.13 1.28\nFinancial Advantage 4.60\nPRA1 4.45 1.44 2.09\nPRA2 4.00 1.24 1.53\nPRA3 4.83 1.14 1.30\nPRA4 5.11 1.14 1.31\nCommunicability 4.52\nCMM1 4.67 1.28 1.64\nCMM2 4.36 1.36 1.84\nComplexity 2.81\nPCX1 2.71 1.39 1.94\nPCX2 2.91 1.37 1.88\n36\nTable 9. T-Test Results: Mean Comparison\nVariable Bookers Lookers-\nonly\nI am among the first in my circle of friends to visit a new travel-\nrelated website. (DSI1) 4.02 3.46\nIf I heard that a new travel website was available on the Internet, I\nwould be interested enough to shop from it. (DSI2) 4.05 3.35\nI am proficient in using the Internet for shopping travel products.\n(EFF1) 5.35 4.57\nI feel I am not clear with on-line reservation procedure. (PCX1) 2.62 3.23\nI feel it is not easy to book travel on-line. (PCX2) 2.65 3.40\nUsing the Internet to shop travel product is compatible with the way I\nlike to shop. (CMP1) 4.51 3.69\nUsing the Internet to shop travel product fits with my lifestyle.\n(CMP2) 4.59 3.80\n37\nTable 10. Identified Influential Factors of eShopping Travel\nInfluential Factors Explained by\nSocio-\ndemographics\nAge group, area of residence\nWired lifestyle Type of travel website visited most often, length of time using the\nInternet\nDomain-specific\ninnovativeness\n“I am among the first in my circle of friends to visit a new travel-\nrelated website.”; “If I heard that a new travel website was available on\nthe Internet, I would be interested enough to shop from it.”\nSelf-efficacy “I am proficient in using the Internet for shopping travel products.”\nCompatibility “Using the Internet to shop travel product is compatible with the way I\nlike to shop.”; “Using the Internet to shop travel product fits with my\nlifestyle.”\nComplexity “I feel I am not clear with on-line reservation procedure.”; “I feel it is\nnot easy to book travel on-line.”\n38\nReference\n1. I. Ajzen & T.J. Madden, Prediction of Goal-Directed Behavior: Attitudes, Intentions and\nPerceived Behavioral Control. Journal of Experimental Social Psychology, 22, 4 (1986), 453-\n474.\n2. B. Anckar & P. Walden, Destination Maui? An Exploratory Assessment of the Efficacy of\nSelf-Booking in Travel. Electronic Markets, 10, 2 (2000), 110-119.\n3. Asia Source, Special Report: E-commerce in China. www.asiasource.org\/news (2000)\n[Accessed on 2-7-2004]\n4. A. Bandura, Self-efficacy: toward a unifying theory of behavioral change. Psychological\nReview, 84, 2 (1977), 191-215.\n5. V. Bath, E-Commerce In China – Is China Ready To Do E-Business?.\nwww.chinaonline.com (2000) [Accessed on 2-7-2004]\n6. BBC, Citigroup's deal for credit cards in China. www.news.bbc.co.uk (2003) [Accessed on\n2-7-2004]\n7. D. Buhalis, eTourism: Information Technology for Strategic Tourism Management. UK:\nPearson Education Ltd.\n8. P.Y.K. Chau, M. Cole, A.P. Massey, M. Montoya-Weiss & R.M. O'Keefe, Cultural\nDifferences in the Online Behavior of Consumers, Communications of the ACM, 45, 10\n(2002), 138-143.\n9. China Internet Network Information Centre (CNNIC), Survey Report in 2001.\nwww.cnnic.net.cn (2002) [Accessed on 11-7-2004]\n10. China Internet Network Information Centre (CNNIC), The 11th Survey Report.\nwww.cnnic.net.cn (2003) [Accessed on 11-7-2004]\n11. China Internet Network Information Centre (CNNIC), Analysis Report on the 13th\nSurvey Report. www.cnnic.net.cn (2004) [Accessed on 11-7-2004]\n12. E. Christou & P. Kassianidis, Consumer's Perceptions and Adoption of Online Buying for\nTravel Products. Journal of Travel & Tourism Marketing, 12, 4 (2002), 93-107.\n13. A.V. Citrin, D.E. Sprott, S.N. Silverman & D.E..Jr. Stem, Adoption of Internet Shopping:\nthe Role of Consumer Innovativeness. Industrial Management & Data Systems, 100, 7 (2000),\n294-300.\n14. C. Cooper & J. Lewis, Transformation and trends in the tourism industry: implications for\ndistribution channels, In Buhalis, D. & Laws, E. (eds.) Tourism Distribution Channels:\npractices, issues and transformations, London: Continuum, (2001), pp.315-331.\n15. F.D. Davis, A Technology Acceptance Model for Empirical Testing New End-User\nInformation Systems: Theory and Results, Doctoral Dissertation, Sloan School of\nManagement, Massachusetts Institute of Technology (1986). \n16. eBusiness Forum, Doing eBusiness in China: E-commerce. www.ebusinessforum.com\n(2000) [Accessed on 2-7-2004]\n17. eBusiness Forum, Doing eBusiness in China. www.ebusinessforum.com (2001)\n[Accessed on 2-7-2004]\n39\n18. A.M. Efendioglu & V.F. Yip, Chinese culture and e-commerce: an exploratory study.\nInteracting with Computers, 16, 1 (2004), 45-62.\n19. D. Ernst & J.C. He, The Future of E-Commerce in China. Analysis from the East-West\nCenter, 46 (2000).\n20. M. Fishbein & I. Ajzen, Belief, Attitude, Intention, and Behavior. London: Addison-\nWesley (1975).\n21. H.L. Furr, M.A. Bonn & A. Hausman, A generational and geographical analysis of\nInternet travel-service usage. Tourism Analysis, 6, (2002), 139-147.\n22. G.T. Haley, E-commerce in China: changing business as we know it. Industrial\nMarketing Management, 31, 2 (2002), 119-124.\n23. M. Hennock, China's baby steps in e-commerce. http:\/\/news.bbc.co.uk (2002) [Accessed\non 2-7-2004]\n24. D.L. Hoffman & T.P. Novak, How to acquire customers on the web. Harvard Business\nReview, 78, 3 (2000), 179-188.\n25. Internet World Stats (IWS), Internet Usage and Population in Asia.\nwww.internetworldstats.com (2004) [Accessed on 4-7-2004].\n26. T.P. Liang & C.P. Wei, Introduction to the special issue: mobile commerce applications.\nInternational Journal of Electronic Commerce, 8, 3 (2004), 7-17.\n27. D.X. Liu, The Analysis and Forecast of China's Domestic Tourism Development. In:\nZhang, G. R., Wei, X. A. & Liu, D.Q. (eds.) Green Book of China's Tourism 2001-2003,\nBeijing: Social Sciences Documentation Publishing House. (2002) pp.96-110. (in Chinese).\n28. P. Louvieris, J. Driver & J. Powell-Perry, Managing customer behaviour dynamics in the\nmulti-channel e-business environment: Enhancing customer relationship capital in the global\nhotel industry. Journal of Vacation Marketing, 9, 2 (2003), 164-173.\n29. T.J. Lu, H.F. Xu, X.Y. Chen & Y. Liu, Chinese Electronic Commerce Strategy.\nwww.infodev.org\/projects\/telecommunications\/514china\/ecstrategy.pdf (2001) [Accessed on\n15-7-2004]\n30. S.T.K. Luk, L. Fullgrabe & S.C.U. Li, Managing Direct Selling Activities in China: A\nCultural Explanation. Journal of Business Research, 45, 3 (1999), 257-266.\n31. X.J. Ma, D. Buhalis & H. Song, ICTs and Internet adoption in China's tourism industry.\nInternational Journal of Information Management, 23, 6 (2003), 451-467.\n32. M.G. Martinsons, Electronic commerce in China: emerging success stories. Information\n& Management, 39, 7 (2002), 571-579\n33. K. Mathieson, Predicting User Intentions: Comparing the Technology Acceptance Model\nwith the Theory of Planned Behavior. Information Systems Research, 2, 3 (1991), 173-191.\n34. B. Merrilees & D. Miller, Direct Selling in the West and East: The Relative Roles of\nProduct and Relationship (Guanxi) Drivers. Journal of Business Research, 45, 3 (1999), 267-\n272.\n35. A.M. Morrison, S. Jing, J. O'Leary & L.A. Cai, Predicting Usage of the Internet for\nTravel Bookings: An Exploratory Study. Information Technology and Tourism, 4, (2001), 15-\n30.\n40\n36. National Bureau of Statistics of the People's Republic of China (NBS), Statistical\nCommuniqué of the People's Republic of China on the 2003 National Economic and Social\nDevelopment. www.stats.gov.cn (2004) [Accessed on 20-4-2004]\n37. Out-law.com, EBay enters into Chinese market. www.out-law.com (2002) [Accessed on\n15-7-2004]\n38. Overseas Young Chinese Forum (OYCF), China's E-Commerce Development.\nwww.oycf.org (2000) [Accessed on 2-7-2004]\n39. J. Pallant, SPSS Survival manual: a step-by-step guide to data analysis using SPSS for\nWindows, Crows Nest: Allen & Unwin (2001).\n40. C. Park & J.K. Jun, A cross-cultural comparison of Internet buying behavior: Effects of\nInternet usage, perceived risks, and innovativeness. International Marketing Review, 20, 5\n(2003), 534-553.\n41. F.F. Reichheld & P. Schefter, E-LOYALTY. Harvard Business Review, 78, 4 (2000),\n105-118.\n42. E.M. Rogers, Diffusion of Innovations, 5edn, New York: The Free Press (1995).\n43. R.S. Sexton, R.A. Johnson & M.A. Hignite, Predicting Internet\/e-commerce use. Internet\nResearch: Electronic Networking Applications & Policy, 112, 5 (2002), 402-410.\n44. Scandinavian Tourism Board (STB), China Outbound Travel Market Report: research\nreport. Scandinavian Tourist Board (2002). \n45. B. Szajna, Empirical evaluation of the Revised Technology Acceptance Model.\nManagement Science, 42, 1 (1996), 85-92.\n46. TravelSky, TravelSky Annual Report 2003. www.travelsky.com (2004) [Accessed on 4-\n5-2004]\n47. L.R. Vijayasarathy, Predicting consumer intentions to use on-line shopping: the case for\nan augmented technology acceptance model. Information & Management, 41, 6 (2004), 747-\n762.\n48. S. Wang & J. Ap, Tourism Marketing in the People's Republic of China. In: Lew, A.A.,\nYu, L., Ap, J. & Zhang, G. (eds.), Tourism in China. New York: Haworth Hospitality Press\n(2003), pp.217-235.\n49. K.N.L. Wee & R. Ramachandra, Cyberbuying in China, Hong Kong and Singapore:\ntracking the who, where, why and what of online buying. International Journal of Retail &\nDistribution Management, 28, 6\/7 (2000), 307-317.\n50. Y.H. Wong, The Dynamics of Guanxi in China. Singapore Management Review, 20, 2\n(1998), 25-42.\n51. Y. Wong & J. Tam, Mapping relationships in China: Guanxi dynamic approach. Journal\nof Business and Industrial Marketing, 15, 1 (2000), 57-70.\n52. World IT Report, China's e-commerce forecasts $23 billion in 3 years.\nwww.worlditreport.com (2003) [Accessed on 2-7-2004]\n53. H.G. Xiao, Leisure in China. In: Tourism in China, Lew, A.A., Yu, L., Ap, J. & Zhang,\nG. (eds.) New York: Haworth Hospitality Press, (2003), pp.263-275.\n41\n54. L.Y. Zhang, China Tourism Internet: An analysis of survival & future trends. In: Zhang,\nG. R., Wei, X. A. & Liu, D. Q. (eds.) Green Book of China's Tourism 2001-2003. Beijing:\nSocial Sciences Documentation Publishing House, (2002), pp.249-265. (in Chinese)\n55. G.R. Zhang, X.A. Wei & D.Q. Liu (eds) Green Book of China’s Tourism: 2001-2003.\nBeijing: Social Sciences Documentation Publishing House, (2002). (in Chinese)\n56. J.J. Zhu, A Reality Check of E-commerce Development in China.\nhttp:\/\/unpan1.un.org\/intradoc\/groups\/public\/documents\/un\/unpan01185.pdf (2004) [Accessed\non 2-7-2004]\n"}