{"doi":"10.1080\/09687760108656771","coreId":"14096","oai":"oai:generic.eprints.org:755\/core5","identifiers":["oai:generic.eprints.org:755\/core5","10.1080\/09687760108656771"],"title":"Editorial","authors":["Jacobs, Gabriel"],"enrichments":{"references":[{"id":194842,"title":"The Changing Face of Learning Technology,","authors":[],"date":"2000","doi":"10.3402\/rlt.v7i2.11244","raw":"Squires, D., Conole, G. and Jacobs, G. (2000),  The Changing Face of Learning Technology, Cardiff: University of Wales Press.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2001","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14096.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/755\/1\/ALT_J%2DVol09_No1_2001_Editorial.pdf","pdfHashValue":"b6ad21fb01dcb27f0905a45998236cdd58f9c844","publisher":"Taylor and Francis Ltd","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:755<\/identifier><datestamp>\n      2011-04-04T08:54:10Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/755\/<\/dc:relation><dc:title>\n        Editorial<\/dc:title><dc:creator>\n        Jacobs, Gabriel<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:publisher>\n        Taylor and Francis Ltd<\/dc:publisher><dc:date>\n        2001<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/755\/1\/ALT_J-Vol09_No1_2001_Editorial.pdf<\/dc:identifier><dc:identifier>\n          Jacobs, Gabriel  (2001) Editorial.  Association for Learning Technology Journal, 9 (1).  pp. 2-16.  ISSN 0968-7769 (print)\/1741-1629 (online)     <\/dc:identifier><dc:relation>\n        10.1080\/09687760108656771<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/755\/","10.1080\/09687760108656771"],"year":2001,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Editorial- the changing face of ALT-J \nIntroduction \nThe ALr-J conference special issue is usually introduced by an editorial by the organizers \nof the conference. This year, we are breaking with tradition by including an article which \ndiscusses the way in which the conference has changed over the last seven years. \nEncouragingly it suggests that there is evidence that learning technology ismaturing as a \nresearch area, and becoming more firmly embedded into tertiary institutions. \nThis year's conference was held at UMIST in Manchester. It was the largest conference to\ndate - a credit to Peter Hicks, Clive Young, Ben Plumpton and the other conference \norganizers. The papers selected for this issue reflect the conference theme of policy, \npractice and partnership and range from discussions of the development of strategic \nalliances and organizational issues (Crock et al., McMurray) through to specific \ninstitutional studies (Boyle and Cook, Bhalerao and Ward, Slaouti, and French et al.). The \nissue begins with an example of best practice from one of this year's keynote speakers, \nBetty Collis, a paper which reflects much of the findings described in Gabriel Jacobs's \neditorial piece below, by providing an illustration of one institution's large-scale \nimplementation f innovative uses Of learning technology. \nGr~inne Conole \nEditorial reflection- the changing face of ALT-C \nIn selecting past papers from ALr-J for The Changing Face of Learning Technology \n(Squires, Conole and Jacobs, 2000), my co-editors and I recognized that journal papers \nalone, and from a single source, would unavoidably present a skewed perspective. Here is a \nAIt-j Volume 9 Number I \ndifferent, if equally imperfect but (if I may say so) equally interesting, picture: a survey of \nthe published abstracts (papers, workshops and so forth) from each ALT conference from \nthe first, ALT-C 94, to ALT-C 2000, to which this issue of ALT-J is devoted. \nClass.ification method \nAn analysis of conference abstracts involves ameasure of subjectivity. The ALT-C abstracts \noffer a number of different potential divisions, a distinctive one being the focal point of \nthis editorial, namely that between discipline-specific contributions and those of a general \nnature. Yet contributions which demand to be classified as being of universal interest may \nwell have a subject-specific content. Conversely, many contributions which should clearly \nbe classified as specific to a discipline deal with issues which are applicable well beyond \nthe confines of that discipline. In examining each abstract for discipline-specific content \n(often belied by the title of the presentation), I had to make a judgement in several \ndoubtful cases. \nA large number of abstracts patently fell into the general category, there being little or no \nmention of any specific academic discipline (typically, contributions concerned with \ntransferable skills, evaluation, computer-aided assessment, learning theory, learning \nresources, institutional viewpoints, lifelong learning, staff development, support for \ndisabled students, and so on). I also classified a contribution as general if examples were \ntaken from more than two disciplines, unless there were compelling reasons not to do so (as \nin direct comparisons). If examples were taken from only one or two disciplines (in the vast \nmajority of cases, one), I again made a judgement with respect o the importance of the \ndiscipline(s) treated as against hat of the 'universality' of the abstract. \nNext, I divided the presentations into discipline categories, as follows: \n• Art and Design (including Architecture); \n• Business Management and Economics; \n• Engineering (including Civil, Mechanical, Chemical, Materials); \n• Mathematics and Statistics; \n• Computer Science (including Information Science if not aimed merely at providing \ntransferable IT skills); \nPhysical Sciences (including Meteorology, Environmental Sciences); \nEarth Sciences (including Geography, Geology, Energy Studies); \nLife Sciences; \nHealth Sciences (including Medicine, Nursing and Midwifery, Pharmacology, \nDentistry, Veterinary Studies); \nSocial Sciences (including Psychology); \nHumanities (including History, Textual Studies, Music); \nModern Languages; \nEditorial \n• Miscellaneous (incorporating, for example, Teacher Education, Library Studies, \nGeneral Science, Law). \nThe decision to categorize disciplines in this way was based on the major patterns revealed \nin the data. For example, Textual Studies and Music did not warrant separate categories \nsince such categories would have contained very few abstracts; these two disciplines were \ntherefore included in the Humanities category. On the other hand, the number of \npresentations specifically dealing with Modern Languages justified a category separate \nfrom Humanities. With one exception (Teacher Education, discussed in the conclusion \nbelow), disciplines which yielded for all years fewer than five presentations in total, and \nwhich did not naturally fall into another category, were classed as Miscellaneous discipline- \nspecific. However, Architecture, Environmental Sciences, Energy Studies and Psychology- \nnone of which quite produced sufficient numbers of presentations to warrant separate \ncategories - for the most part were included respectively in Art and Design, Physical \nSciences, Earth Sciences and Social Sciences. Where two distinct disciplines were treated in \nthe same presentation, and where their importance justified a discipline-specific \ncategorization, each discipline was added to the appropriate category total. \nAll the above, and the fact that the fragmentation into categories has inevitably entailed \nworking with comparatively small numbers, has to be borne in mind when it comes to \nassessing both the value of the results and the conclusions I have tentatively drawn. I\nbelieve, nevertheless, that the results are revealing, and the conclusions broadly valid. \nResults of the analysis \nThe total numbers of presentations for each year are shown in Figure 1. It can be seen that \nduring the first three years, ALT conferences encompassed a rising number of \ncontributions, a number which fell away in 1997 and 1998, gradually to rise again for the \nlast two years. Many factors affect he number of presentations given at a conference. The \napparent dwindling of interest in 1997 and 1998 may owe much to the approach of \n200 \n150 \n100 \n58 \n1994 1995 1996 1997 1998 1999 2000 \nFigure I: Total number of presentations. \nALr-] Volume 9 Number I \norganizing committees. I am assured by ALT that feedback from every conference criticizes \nthe degree of parallelism adopted, and that organizers have reacted in different ways, either \nignoring the feedback, or shortening the presentation slots, or lengthening the conference, \nor combining presentations into single sessions, or accepting fewer proposals. I am also \nassured that there has been a year-on-year increase in the number of proposals received. \nWhatever the case may be, I would speculate that the rising shape of the curve at the right- \nhand side of Figure 1 is partly related to the effect of the Dearing Report's emphasis on \nC&IT (an acronym first seen in its pages). \n1994 1995 1996 1997 1998 t999 2000 \nFigure 2: Percentage of discipline-specific presentations. \nFigure 2 depicts, for each year, discipline-specific presentations a a percentage of the total \nof presentations. The bars show that for the first three years about half the presentations \nwere discipline-specific. Then a drop once again distinguishes the years 1997 and 1998, to \nreturn to around the 50 per cent mark in 1999, while the year 2000 sees a striking fall to less \nthan a quarter of the total. These results are particularly indicative when one takes into \naccount hat the figure for 1999 is a blip. In that year, given the particular affiliations of the \nconference organizers, there was strong encouragement for CTI centres to run discipline \nstrands. If one takes out this exceptional year, the trend is clear: a steady move towards \nfewer discipline-specific presentations. When ACT began, most presenters at the \nconferences were academics dabbling in learning technology, whereas the last few years \nhave seen a dramatic increase in staff employed explicitly to promote and support it within \ntheir institutions; by and large, these people do not have a discipline affiliation. It would \nappear that ALa'-C has seen a consequent change in the professional status of presenters (it \nis not possible to quantify such a statement from the evidence of conference abstracts, but \nI am told by AcT officials that this is indeed their impression). A reasonable conclusion \nwould be that the move away from discipline-based presentations is, at least to some \ndegree, a reflection of the increasing professionalization f learning technology, discipline- \nspecific presentations being, on the whole, the natural domain of the enthusiastic amateur, \nand widely applicable presentations thatof the professional. \nEditorial \nAgain leaving aside the unusual ALT-C 1999, the fall in discipline-specific presentations \nbetween 1997 and 2000 was also no doubt accelerated by the relatively sudden all- \npervasiveness of the Internet. The Web has played a more important role than any other \nfactor in helping learning technology to gain general acceptance. And it was in 1998 and \n1999 that the Web truly began to influence strategic thinking throughout tertiary and \nhigher education, ot just among certain enthusiastic institutions as it had done until then. \nWhy should the enveloping nature of the Internet have affected the number of discipline- \nspecific presentations at a learning-technology conference? Perhaps because here was (and \nstill is) a new field with as yet few general ground rules. Of the 195 presentations at ALT-C \n2000, well over half dealt directly with online learning, and the abstracts of many of the \nremaining presentations a sume delivery via the Web. This contrasts with the first three \nyears of ALT conferences, during which period the main delivery media were the CD-ROM \nand the diskette, both of which had been firmly established for some time (by 1996, CD- \nROM drives were supplied as standard with most desktop computers). On average for \nthose first three years, fewer than 20 per cent of presentations were directly linked toonline \nor networked learning, and for the first ALT conference the figure was a mere 11 per cent. It \nwould seem that the rapid penetration of the Internet into academic onsciousness \nprovoked a flurry of contributions focusing on guidelines for its use. \nResults for individual discipline categories \no~ ~ ~ \"0 \"0 \" \"0 \"~ \n• ~ ~ ,~ , -  o \n. -  ,\"  o ~ E o_ ~ u~ \n\"T\" r\" \"~ \"l- \ntU ~\" \nFigure 3:  Overall totals of discipline-specific presentations. \nFigure 3 shows the total number of presentations in each category over the seven-year \nperiod. It can be seen that Health Sciences overshadows all other categories, generating \nover twice as many presentations a each of Computer Science, Modern Languages and \nALT-] Volume 9 Number I \nHumanities, coming close to three times as many as Physical Sciences and Life Sciences, \nand more than three times as many as Art and Design, Earth Sciences and Social Sciences. \nThe fact that, in the hierarchy below Computer Science, there is a mix of discipline \ncategories in which one might expect computer expertise or otherwise, indicates that such \nexpected expertise or the lack of it has not had an obvious overall effect. However, there \nmay be a correlation here between funding bands and disciplines. Where the cost of \nteaching is particularly high, there is a significant amount o be saved from not carrying \nout a traditional activity, for example by substituting dry labs for wet labs, although this \npotential saving does not explain the comparatively poor showing of, say, Earth Sciences \n(see below). \n20 \n15 \n10 \n• N umber of presentations [] Percentage ot disci pl ine-speciti c \n1 994 1 995 1996 1997 1 998 1 999 2000 \nFigure 4: Dato for Art and Design. \nOther possible reasons for this situation are mentioned in relation to Figures 4 to 15 which \ndepict he results for the discipline categories for each year. For each category, a set of bars \nare graphed for the number of presentations in the category in question, with an adjacent \nset to their right for that number calculated as a percentage of all discipline-specific \npresentations (for convenience and purposes of comparison, in each case the Y axis in this \nway acts as a measure of both absolute numbers and percentages). \nArt and Design \nAfter a slow start in 1994, the curve representing the number of presentations for Art and \nDesign (Figure 4) follows the general pattern of a fall in 1997 and 1998, but reveals a more \nor less steady rise in percentage t rms throughout the seven-year period, with a noticeable \nrise in 2000. I would imagine that this is in part related to the escalating raphics \ncapabilities of desktop computers. As the processing power, physical storage, random- \naccess memory and graphics ub-systems of commonly available hardware have continued \nto catch up with the potential of graphics oftware, display control has seen considerable \nadvances, and design, painting and drawing programs have become far more usable for \nnon-technical people. In addition, for the last few years students taking Art and Design \nEditorial \n0' \n5 '  \n0' \n5 '  \n0' \n1 994 1 995 1 996 1 997 1 998 1 999 2000 \nFigure 5: Data for Business Management and Economics. \nand related subjects have been expected to make increasing use of computers, omething \nwhich must have had a knock-on effect for the potential of learning technology in this \ndiscipline category. \nBusiness Management and Economics \nAs can be seen from Figure 5, Business Management and Economics saw a substantial \nboost in 1995. This was mostly due to he large number of presentations in those years \nfocused on WinEcon, one of the most successful products to emerge from the TLTP \nprogramme of the time (even marketed commercially). The high figures for 1994 and 1995 \nmay once again be due to the growing importance of graphic displays in business \ncomputing, and especially the graphing capabilities of Excel, which by this time had all but \nousted its direct competition. The figure for 1998 follows the fall in the total of presenta- \ntions, but somewhat exaggeratedly so.Perhaps by 1997\/8 there was little more that could be \nsaid about WinEcon: the package was commercially moribund and (though my evidence is\nanecdotal) conceivably represented a failure which had a general depressing effect on \nlearning-technology activity in Economics. The apparent return to 'normal' activity in \n1999 indicates a revival of interest, although it is worth mentioning that in this particular \nyear Business Management is more responsible than Economics for the resulting figures. \nThe fact of only two presentations in this category in 2000 is disappointing, but it may be \nthat it should be taken together with the strong interest shown at AI.T-C 2000 in training \nfor small businesses ( ee the conclusion below) across various subject-areas not necessarily \ndirectly related to Business Management as a discipline. The decline is nevertheless \nsurprising, especially given the dominance of the online education market by MBA \ncourses. \nEngineering \nWith Engineering (Figure 6), after three good years 1997 sees something of a decline (even \ntaking into account he general fall in the number of presentations in that year and 1998). It \nALT-J Volume 9 Number I \n20 \n15 \n10 \n1 994 1 995 1'996 1 997 1998 1999 2000 \nFigure 6: Data for Engineering. \n20.  \n15 .  \n10-  \n5 • \n0 - \n1994 1995 1996 1997 1998 1999 2000 \nFigure 7: Data for Mathematics and Statistics. \nlooks as if, pro rata, 2000 might represent the beginning of a reversal of Engineering \nfortunes. Is this related, once more, to ever-increasing availability of graphics power? \nWhatever the answer to that question, Jonathan Darby, who at one time headed up the CTI \nsupport network, is convinced that in disciplines where the use of computers i pervasive in \nresearch, academics are less inclined to recognize that they could benefit from discussion \nabout their use in teaching. As a result, innovative CAL applications in the 'computerate' \ndisciplines may have been less forthcoming than the nature of those disciplines would imply. \nMathematics and Statistics \nA picture comparable with that of Engineering emerges for Mathematics and Statistics \n(Figure 7). Here, however, there may be a less tentative xplanation, that of the growing \nEditorial \n20 \n15 \n10 \n1 994 1 995 1 996 1 997 1 998 1 999 2000 \nFigure 8: Data for Computer Science. \nimportance of Mathwise - the most lavishly funded TLTP project after Modern Languages - \nwhich reached its peak in 1996. While not all presentations i  that year were concerned with \nit, it probably had an effect outside its own confines. The sudden fall in 1997, with interest \nplummeting inMathwise, could be another example of the 'WinEcon effect' discussed above. \nSince 1997, inany event, the discipline category appears to be on the road to recovery. \nComputer Science \nComputer Science presents a different but equally remarkable set of results (Figure 8), \nstarting excellently in 1994, declining between then and 1996\/7, then rising again (in terms \nof numbers) until the fall in 2000. The early strong showing no doubt reflects the \nperception at the time of the frontiers of learning technology being primarily technical (for \nwhich computer scientists, of course, had the answers). Then, as attention shifted to \npedagogy and social aspects, it could be that there was less to engage the Computer Science \ncommunity. The content of the abstracts published between 1998 and 1999 confirms, \nhowever, that networking, not surprisingly (and once again) first focused on by computer \nscientists, was responsible for the subsequent recovery. Does the 2000 figure indicate \nhistory repeating itself, as Internet technology becomes everyone's bread and butter? \nPhysical Sciences \nFigure 9 shows Physical Sciences having maintained a fairly steady pace, if a slightly \ndiscouraging one, given that by rights they should lend themselves well to learning \ntechnology; simulations, for example, would appear perfectly to fit the bill. But if there is \nsome weight in the comment made above with respect to Engineering - that there seems to \nbe less innovation in CAL in the disciplines where computers are extensively used in \nresearch - the same probably applies here. \nEarth Sciences \nSince there are so few presentations in the Earth Sciences category, the results hown in \nFigure 10 may be due mostly to chance or extraneous factors. Even so, the results are \n10 \nALT-] Volume 9 Number I \n20 \nmNumDer of presentations n Percentage Of dJ~lplJne-specjfJc \n15 \nlO \n1994 1995 1996 1997 1998 1999 2000 \nFigure 9: Data for Physical Sciences. \n~o \nIINumber or pre~ntations D Percentage ot discipline-specitic \n5 \n0 \n1994 1995 1996 1997 1998 1999 2000 \nFigure I O: Data for Forth Sciences. \ngloomy: Earth Sciences have been very poorly represented atALT conferences. I can offer \nno evident explanation for this state of affairs. \nLife Sciences \nLife Sciences (once more, for me, inexplicably, given the nature of the category and the \nlarge numbers of students attracted to subjects uch as Biology), can hardly be said to \npresent amuch rosier picture (Figure 11). The two curves fluctuate somewhat, but the most \npromising year (1996) is followed two years later by a significant fall, and with hardly a\nstartling recovery in 1999 and 2000. \nEdkonaf \n2 \n• Number ot presentations n Percentage ~ di~ipline-speciflc \n1 \n1 994 1 995 1996 1 997 1 998 1 99g 2000 \nFigure I h Data for Life Sciences. \nHealth Sciences \n1994 1995 1996 1997 1998 1999 2000 \nFigure 12: Data for Health Sciences. \nIn contrast, as can be seen from Figure 12, each year with the exception of 1998 the Health \nSciences category has attracted a significant number of presentations. Even at its lowest \npoint in 1998, it still accounted for about 12 per cent of discipline-specific presentations. \nHigh points were 1997, where the figure rose to almost a quarter, and 2000 where it \ncompletely dominated the picture. One cannot readily account for such a high proportion \n12 \nALT-] Volume 9 Number I \nof Health Science presentations in terms of the increasing power and usability of desktop \ncomputers, ince, disregarding the fallin 1998, the intensity in this case remains remarkably \nconstant hroughout the seven-year period. It could be that the very large numbers of \nstudents characteristically to be found on medical-related courses, and the comparative \nscarcity of teaching staff, have together played important roles in the maintenance of a \nhigh level of interest in learning technology within this category. Equally possible is the \ncloseness of health-science education to practice (there is more on-the-job training than in \nmost other fields). But there again, the same principles might broadly apply to other \ncategories, including Teacher Training which did not even justify its own category if one \ndiscounts the year 2000 (see the conclusion, below). Part of the reason may lie in the high \ndependency on technology in medicine, and perhaps in particular on the fact that \ncomputers make it possible to carry out and demonstrate experiments that would \notherwise be costly and\/or difficult o do, and even ethically suspect. \nThe fact remains that Health Sciences have been unquestionably the healthiest discipline \ncomponent at ALT conferences, and, if there is a correlation between the demonstrated \ninterest of those teachers in the field involved in using learning technology and its uptake \nin institutions (as there surely is), this is something which ought o be investigated in order \nto determine whether or not there are lessons to be learned in other disciplines. \n20 \n15 \n10 \n• N umber of presentations [] Percentage or discipline-~pecitic \n1 994 1 995 1 996 1 997 1 998 1 999 2000 \nFigure 13: Data for Social Sciences. \nSocial Sciences \nConversely, Social Sciences perform poorly (Figure 13), coming bottom in the league table \n(Figure 3). Why the Social Sciences (including Psychology, so popular with students) \nshould show results weaker than, say, the Humanities (see immediately below), is \nsomething of a mystery, although part of the explanation certainly lies in the thriving \nComputers in Psychology annual conference: it undoubtedly attracts proposals which \nmight otherwise be submitted to ALT-C. \n13 \nEditorial \n20 \n• N um her of presentations [] Percentage of disci ptine-~pecifi c \n15 \n10 \n1994 1 995 1 996 1 997 1 998 1 999 2000 \nFigure 14: Data for Humanities. \nHumanities \nWhen ALT was founded in 1993, it was thought by many that the sciences would dictate the \ndevelopment of learning technology because of the scientific nature of technology itself. \nYet, since then, many within the Humanities have adopted it as a teaching (and research) \nfacility, and this is evidenced by the data in Figure 14. After a weak start in 1994, the \nnumbers are more than respectable (nearly 15 per cent of discipline-specific presentations \nin the meagre year 1998). The year 2000, however, has seen a fall which is disquieting if it is \nnot due to some exceptional factor; disquieting if only because, if learning technology is to \nbecome generally accepted, it must solidly encompass those disciplines in which academic \nstaff are not traditionally technologically orientated. \nModern Languages \nMuch the same could be said of Modern Languages (Figure 15), though with that \nsignificant peak in 1996, surely the result of efforts put in by the relevant CTI Centre and \nby a number of conference organizers at about hat time in promoting CALL (Computer \nAssisted Language Learning). The low figure for the following year, even taking into \naccount i s relatively overall paucity, may be in part the consequence of a reaction to what \nI think must be seen as the over-enthusiasm of the previous year. The zeal for CALL \nproducts was to be tempered with the realization that user-expectations did not fully match \nwhat the available software could offer, natural anguage being notoriously difficult to \ncomputerize inwhatever way one cares to mention. CALL has continued to attract interest \n(Figure 15 is evidence nough of that), but it has never regained the exhilarating \nmomentum of four to five years ago. Let us hope that the minimal showing at ALT-C 2000 \nis not ominous. \n14 \nALT-] Volume 9 Number I \n20 \n15  \n10-  \n5 - \n0 - \n[ ]  N umber of presentations \n[ ]  Percentacle of di~J pl ine-specJfi c \n1994 1995 1990 1997 1998 1999 2000 \nFigure 15: Data for Modem Languages. \nConc lus ion  \nOne could point to a number of differences between years with respect to the presentations \ngiven at ALT conferences. To take ALT-C 2000 (since it provides the most up-to-date \npicture), there was an abrupt rise in papers concerned with Teacher Training. For the years \npreceding 2000, this discipline did not warrant a separate category, but ALT-C 2000 saw \nfour presentations concerned specifically with it. This sudden increase may be the \nconsequence of a number of coincidental factors, but I suspect hat it is related to some \nextent to recent government initiatives to promote ICT literacy among schoolteachers. \nAgain at ALT-C 2000, there was a notable turn towards the provision of ICT training for \nsmall businesses. Whereas previous years had seen hardly a mention of them, six \npresentations at ALT-C 2000 dealt directly with their requirements or their relationship \nwith the education sector. I presume that this change is linked to the increased availability \nof appropriate European funding, combined with the recent move within ALT fully to \nembrace further ducation, and thus vocational training. ALT-C thus appears to be \nresponding rapidly to developments, an encouraging sign even if certain major disciplines \nare still disappointingly absent or nearly absent (Law is a prime example). \nBut ALT-C does not exist in a vacuum. Ideally, in order properly to gauge developments in \nthe field of learning technology - and thus to avoid the numerous caveats and hesitations I \nhave been obliged to incorporate in an effort to forestall the criticism of those who would \nlike to see a fully contextualized survey (I include myself) - it would be necessary to \ncompare the results presented here not only with those of other general learning- \ntechnology conferences but also with discipline-specific conferences and a wide range of \nbooks and journal papers, something which would represent an undertaking well beyond \nmy intended scope of an unpretentious overview of ALT-C. Nevertheless, ALT-C is certainly \none of the UK's leading learning-technology conferences, indeed probably the leader. So I \nwould contend that the results I have presented may justifiably be considered at least \nindicative. I hope that they will be taken in that light. \n15 \nEditorial \nAcknowledgements \nI am grateful to Jonathan Darby, until last year President of ALT, and to my colleague in \nthe University of Wales Swansea, Dr Catherine Rodgers, both of whom kindly agreed to \nread a draft of this editorial. Many of their comments and suggestions have been \nincorporated. \nGabriel Jacobs \nReference \nSquires, D., Conole, G. and Jacobs, G. (2000), The Changing Face of Learning Technology, \nCardiff: University of Wales Press. \n16 \n"}