{"doi":"10.1080\/0968776980060304","coreId":"14290","oai":"oai:generic.eprints.org:280\/core5","identifiers":["oai:generic.eprints.org:280\/core5","10.1080\/0968776980060304"],"title":"Cost‐effective support for university students learning via the Web?","authors":["Hawkridge, David"],"enrichments":{"references":[{"id":199693,"title":"Developing interactive educational engineering software for the World Wide Web with Java',","authors":[],"date":"1998","doi":"10.1016\/s0360-1315(97)00062-6","raw":"Reed, J.A. and Afjeh, A.A. (1998), 'Developing interactive educational engineering software for the World Wide Web with Java', Computers and Education, 30 (3\/4), 183-94.","cites":null},{"id":199692,"title":"Efficiency and effectiveness in computer-supported peer-peer learning',","authors":[],"date":"1998","doi":null,"raw":"Rada, R. (1998), 'Efficiency and effectiveness in computer-supported peer-peer learning', Computers and Education, 30 (3\/4), 137-46.","cites":null},{"id":199690,"title":"Embedding computer conferencing into university teaching',","authors":[],"date":"1998","doi":"10.1016\/s0360-1315(97)00068-7","raw":"Mason, R. and Bacsich, P. (1998), 'Embedding computer conferencing into university teaching', Computers and Education, 30 (3\/4), 249-58.","cites":null},{"id":199691,"title":"Evaluating the impact of Internet provision on students' information-gathering strategies',","authors":[],"date":"1998","doi":"10.1080\/0968776980060109","raw":"Meek, J., Garnett, M. and Grattan, J. (1998), 'Evaluating the impact of Internet provision on students' information-gathering strategies', ALT-J, 6 (1), 57-63.","cites":null},{"id":434466,"title":"GoFigure Inc: a hypermedia Web-based case',","authors":[],"date":"1998","doi":null,"raw":"Yaverbaum, G.J. and Liebowitz, J. (1998) 'GoFigure Inc: a hypermedia Web-based case', Computers and Education, 30 (3\/4), 147-56.","cites":null},{"id":199689,"title":"H801 students' and tutors' use of the electronic workbook and electronic mail',","authors":[],"date":"1997","doi":null,"raw":"Hawkridge, D., Morgan, A. and Jelfs, A. (1997), 'H801 students' and tutors' use of the electronic workbook and electronic mail', Milton Keynes: Institute of Educational Technology, The Open University.","cites":null},{"id":434465,"title":"Is it sustainable? A comparison of student and tutor online time across three distance-learning courses',","authors":[],"date":"1998","doi":"10.3402\/rlt.v6i1.10979","raw":"Wilson, T. and Whitelock, D. (1998b), 'Is it sustainable? A comparison of student and tutor online time across three distance-learning courses', ALT-J, 6 (1), 25-31.","cites":null},{"id":199694,"title":"The virtual campus: Trends for higher education and training'.","authors":[],"date":"1998","doi":"10.1007\/978-0-387-35352-4","raw":"Verdejo, F. and Davies, G. (1998), 'The virtual campus: Trends for higher education and training'. Papers from IFIP TC3\/WG3.3 & WG3.6 Joint Working Conference, 27-29 November 1997, Madrid.","cites":null},{"id":199695,"title":"Using CMC: Guidelines for Course Teams, Milton Keynes: Programme on Learner Use of","authors":[],"date":"1998","doi":null,"raw":"Walker, M. (1998), Using CMC: Guidelines for Course Teams, Milton Keynes: Programme on Learner Use of Media, Institute of Educational Technology, The Open University.","cites":null},{"id":434464,"title":"What are the perceived benefits of participating in a computer-mediated communication (CMC) environment for distance learning computer science students?',","authors":[],"date":"1998","doi":"10.1016\/s0360-1315(97)00069-9","raw":"Wilson, T. and Whitelock, D. (1998a ), 'What are the perceived benefits of participating in a computer-mediated communication (CMC) environment for distance learning computer science students?', Computers and Education, 30 (3\/4), 259-69.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1998","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14290.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/280\/1\/ALT_J_Vol6_No3_1998_Cost%E2%80%90effective_support_for_uni.pdf","pdfHashValue":"c258cabf311211c2a26dd53672774072effbb0f6","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:280<\/identifier><datestamp>\n      2011-04-04T08:50:10Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/280\/<\/dc:relation><dc:title>\n        Cost‐effective support for university students learning via the Web?<\/dc:title><dc:creator>\n        Hawkridge, David<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        1998<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/280\/1\/ALT_J_Vol6_No3_1998_Cost%E2%80%90effective_support_for_uni.pdf<\/dc:identifier><dc:identifier>\n          Hawkridge, David  (1998) Cost‐effective support for university students learning via the Web?  Association for Learning Technology Journal, 6 (3).  pp. 24-29.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776980060304<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/280\/","10.1080\/0968776980060304"],"year":1998,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Cost-effective support for university students\nlearning via the Web?\nDavid Hawkridge\nInstitute of Educational Technology, The Open University, Milton Keynes\nAcademics and other knowledge-owners are creating millions of Webpages that\nstudents can use. Universities are teaching more students off-campus because the costs\nof on-campus provision cannot be met. Offering courses via the Web seems an attractive\nalternative. Academics (and students) want the courses to be high quality. Yet quality is\noften lacking. À course outline gets approval, then aims, objectives and content change\nrapidly during the teaching. Students' and tutors' inputs are seldom monitored.\nStudents join conferences only to discover that few classmates participate actively and\nthe tutors' advice is hard to get. Web courses risk acquiring a poor reputation.\nTo improve quality, academics create teaching Webpages, from which they refer students\nto printed texts and other Webpages. This is not like writing lecture notes or a journal\npaper. Pages for students are more like a private conversation: they have to evoke\nintellectual responses during months of study.\nTo improve quality, academics set up computer conferences, offering guidance and\nbringing students together to exchange views and information. Academics find the\ntutoring experience overwhelming. The quality and quantity of input start high, but\ndecline rapidly. Rewarding students for participation helps, though judging their input is\ndifficult. Supporting students' critical thinking through conferences is a challenge to any\nacademic.\nTo improve quality, academics expect students to. submit assignments electronically,\nwith the advantages of fast turnaround and tutorial comment inserted into each\nassignment. This work resembles on-campus grading\/commenting, but as Web-based\nsystems develop with audio and video, designing and assessing new assignment types is\ndifficult.\nSupporting Web-based student learning requires a substantial input of expensive.\nacademic time. Is this type of learning more expensive per student than on-campus\nlearning? Can ways be found to make students more independent of their tutors? With\nquality and costs in mind, can academics provide cost-effective support for students\nlearning via the Web? In this paper Open University examples are used to provide some\nsuggestions.\n24\nALT-J Volume 6 Number 3\nThe proliferation ofWeb-based courses\nAcademics and other owners of. knowledge are making millions of Webpages that students\ncan use. One Web source aioné, Lexis-Nexis Universe (Tittp:\/\/web.lexis-nexis.com\/universe)\nclaims to offer already moré than a billion pages to its,registered users, many of them\nstudents. Another, Eureka (http:\/\/eureka.rlg.org), is a catalogue of everything from books\nand serials to manuscripts, amps, music scores, sound archives, films and photographs,\nwith over 30 million titles. ,' , , ' . ' . . . . . • • . . . , . '\nUniversities and colleges are teaching more students off-campus because'the costs of\nexpanding on-campus provision cannot be met. The Vice-Chancellor of the Open\nUniversity (OU) said recently (http:\/\/www.open.aç.ùk\/pù\/i>jews.html):\n' The Government is committed to providing an extra half million places in further and\nhigher education by 2002. Such expansion is a challenge. But it is a challenge faced by\nmany other countries of the worid in even starker terms. Today many countries have\npopulations whose mediah age is'below 25. In some it is below twenty. In the coming\nyears a tidal Wave of young people will engulf existing universities. A large new\nuniversity needs to open every week, somewhere in the world,' just to keep the\nparticipation • raté in post-compulsory education constant. In most countries, as in\nBritain, governments want to improve the participation fate, so even one néw campus a\nweek will not do the trick.\nÖffering.courses via the Wei», in some sort of virtual university, appears to be an attractive\nand potentially, costr-effective alternative (Verdejo and Davies, 1998, cover various models).\nThe,costs of developing and distributing such courses appear low, particularly when\ncompared with the costs of building new campuses, or even with the costs of developing\ndistance-taught courses of the type used successfully by the OU. '\nIndividual académies are leading the way, but'for their own reaspris. For example, Greek,\nat Florida State University (FSÚ), teaches a 'paperless' undergraduate course about\ncriminology (http:\/\/www.fsi.edu\/~crimdo\/greek.html). Its features include email\nconnections, chat sessions, Web searches and conferences. Also at FSU, Krantz teaches a\nWeb-based course on, child development (http:\/\/cpd-online.fsu.edu\/cpd3220\/), described in\nthe next section. ^ ... . . . . . ,\nThe OU offers a range of high-quality Web-based courses to students within the European\nUnion (http:\/\/www.open.ac.uk). The Master's in Open and Distance Education\n(http^\/www-iet.open.ac.uk\/IET\/ODLBrochure\/VCampus.html) is available worldwide,\nexcept in Australia. Unlike the FSU examples, the MA courses include print, video and\naudio materials, but all have a strong online component.\nAcademics (and their students) want the courses to be of high quality. Yet quality is often\nlacking. The worst cases are in some of the so-called 'virtual universities' that spring up -\nso 'virtual' that they have nothing but a mailbox intended to take gullible students' money\n- and vanish overnight..\nEven* in the better virtual universities a course outline gets approval, but aims, objectives\nand content may change rapidly during the teaching as new Web sources appear. Many\nolder distance education courses have been through quality assurance procedures during the\n25\nDavid Hawkridge Cost-effective support for university students learning via the Web?\nlong gestation of their design and manufacture. Editors, course teams and external\nacademic assessors have all played important parts. But similar procedures are difficult to\napply during the just-in-time processes that create new Webpages. A new textbook is edited\nmany months before it is sent to students; a new Webpage can be created mere hours, even\nminutes, before they read it. New procedures for quality assurance are still being developed.\nOwnership of the intellectual property in Web-based courses is a highly contentious issue\n(Guernsey and Young, 1998), yet ownership is one of the chief factors that influences\nquality. Why bother about maintaining high standards if the course doesn't 'belong' to you\nin some positive sense as a teacher?\nStudents' and tutors' inputs to Web-based conferences are seldom monitored, although\nthey are encouraged (see Meek et al., 1998, for an example in earth science). In this respect\nthe conferences are like many seminars on campus: usually only those present know what\nhappens. Evaluation is perhaps limited to general feedback at the end of term or semester.\nMeantime, students on Web-based courses join conferences, expecting to get help, only to\ndiscover that few classmates participate actively and tutors' personal advice is hard to get.\nMy own research (Hawkridge et al., 1997) confirms findings quoted elsewhere (e.g. Walker,\n1998): about one-third of the class contributes frequently, one-third reads but contributes\nrather seldom and one-third reads or contributes scarcely at all. Tutors may be friendly and\nwise but they fall into the same three groupings unless they are monitored or even\ndragooned.\nThe Canadian TeleCampus Online Course Database lists over 7,000 courses available\nonline anywhere in the world (http:\/\/database.telecampus.com). Many, however, are really\nno more than correspondence courses with email links between students and their tutors.\nVery few take more than 150 hours to study. Transferable academic credit from such cases\nis more or less impossible.\nWeb-based courses risk acquiring a poor reputation. Worse, it seems as though they may\nnot even be cost-effective, even for distance learning. On-campus, they are almost always\nan add-on to a campus course, at an add-on cost (see Collis, in press, for European\nexamples). For off-campus use or distance learning, they appear to have low development\ncosts compared with the older materials-based ones, but they incur higher presentation\ncosts per student because the tutors are much more involved, with a large demand for\ntutoring online. It seems doubtful whether a single Web-based course can serve large\nnumbers of students: such courses may not be able to provide economies of scale like the\nolder print-based courses do.\nImproving the quality of Web-based courses\nTo improve quality, academics often create teaching pages to which they refer students to\nprinted texts, videos, CD-ROMs and other Web pages. This is not like writing lecture notes\nor ajournai paper (see Yaverbaum and Liebowitz, 1998, for an example from management\neducation; Reed and Afjeh, 1998, for an engineering example). Ideally, pages for students\nare more like a private conversation: they should evoke intellectual responses during\nmonths of study. A good US example is a course on child development (http:\/\/cpd-\nonline.fsu.edu\/ chd3220\/), accessible only to registered students at Florida State University.\nKrantz took his textbook, digitized during word-processing, and created with it a\n26\nALT-J Volume 6 Number 3\n'cybertext' by building in more than 300 clickable links. Many are to Web resources\nbelonging to specialist child agencies. Others are to pages containing definitions,\nclarifications and amplifications of particular terms and concepts, as well as assignment\ndetails. He added colour graphics and photographs, even some short movie clips. Along-\nside the cybertext is a forum for discussion of course topics. However, he teaches only a\nhandful of students online each year, the rest being face-to-face on campus. The latter can\nalso access the online version.\nTo improve quality, academics set up computer conferences for students. They offer\nguidance and bring students together to exchange views and information. Essentially, the\nonline interactions need to be structured well. Academics can find this tutoring experience\noverwhelming. The quality and number of inputs often start high, but can dwindle rapidly,\nsometimes alarmingly so. Awarding students for participation helps, though judging their\ninput is difficult. Supporting students' critical thinking through conferences is a challenge\nto any academic.\nTo improve quality, academics expect students to submit assignments via the Web. For\nstudents, there are the advantages of fast turnaround and detailed tutorial comment\ninserted into each .assignment. For academics, this work closely resembles on-campus\ngrading and commenting, but as improved Web-based systems develop, with audio and\nvideo, designing and assessing new types of assignment is becoming difficult.\nSupporting student learning via the Web\nSupporting student learning via the Web requires at present substantial inputs of expensive\nacademic time. Even when the Web is used only to provide tutorial support via email, a\nbulletin board system and conferencing, exceptionally high input is often needed to\nstructure online work by students. Although the level of input can sometimes be attributed\nmore to a tutor's great enthusiasm than to students' needs, low levels of input seem to be\nassociated with much less student activity. Tutors come back to the conferences after a few\ndays away and find 20-30 messages to read: they have to decide which ones they should\nrespond to.\nCreating a social environment on the Web, especially at the start of a course, is an\nimportant task for the tutors as they try to support student learning. A café (completé with\nnewspapers!), chat and gossip areas, digitized photos and student-only conferences all\nmake sense, but must be provided for. Tutors need to help, so far as they can, those\nstudents who feel awkward in this unfamiliar setting. Personal emails are more likely to be\nappropriate for this purpose than public pages on a bulletin board or conference, yet up to\n40 per cent of conference messages may be social in nature (Wilson and Whitelock, 1998b).\nIs it likely that this online type of learning may be even more expensive per student than\non-campus learning? There is evidence that it may be: in the OU's online courses students'\nexpectations are raised and they ask for substantial support, which they get (Hawkridge et\nal., 1997; Wilson and Whitelock, 1998b). If professors and other senior staff act as tutors,\nit certainly is more expensive, since few economies of scale are possible. Reducing the cost\nmay be a matter of division of labour. Professors and others may create the courses, but\n'adjunct staff', as the Americans say, should do the tutoring, as part-timers probably, on\npiecework.\n27\nDavid Hawkridge Cost-effective support for university students learning via the Web?\nCan ways be found to make the students more independent of their tutors? If academics\nset out to structure the students' use of the Web, this may require more investment before\nthe course starts, but cost less in tutors' time once it is being taught. Rada (1998) reports\nexperience at Washington State.\nFrom recent OU experience (see Hawkridge et al, 1997; Mason and Bacsich, 1998; Walker,\n1998; Wilson and Whitelock, 1998a and 1998b), five strategies seem useful:\n• Schedule the work, thus making clear to students exactly what is expected of them and\nwhen. While this introduces some rigidity into the system, it does increase the chances of\nstudents working together on the same content. They should be able then to help one\nanother.\n• Establish small groups to carry out defined tasks on their own. Within each group,\nstudents can choose or be assigned roles: moderator, researcher, reporter, summarizer\nand so on. Tutors can be reached during the work, but do not actively guide it. The\ngroup discusses outcomes and possibly asks the opinion of another group, as well as\nthe tutor.,. , .\n• Organize 'Àsk an Expert' or 'Master Class' conference sessions to take the strain off the\ntutor. An expert is invited (and should normally be paid) to fmeet the students' for up\nto a week during the course. They question the expert and discuss his or her answers.\n• Expect the students to draw on their own experience, where relevant, as much as\npossible. Tutors still have to guide the discussion, however, as they evaluate the\nexperience and its relevance to the work in hand.\n• After the first presentation of the course, ensure that subsequent presentations draw as\nappropriate on the best work done by previous students on the Web. In other words,\nmake the course experience accumulate.\nWilson and Whitelock (1998b) also suggest that the answers to frequently-asked questions\nshould be posted on the Web, and that in the second year of presentation tutors are likely\nto spend rather less time online, perhaps as a result of their experience of overload in the\nfirst year!\nWith quality and costs in mind* can we academics provide cost-effective support for\nuniversity students learning via the Web? Can we move beyond the present 'cottage\nindustry' stage, in which individual academics create and tutor their own Web courses? The\nanswer must be yes, because most of the indicators point to massive Web-based learning\nbefore long. ' • ' • •\nConclusion\nRumble (1997) outlines the problems inherent in assessing the cost-effectiveness of\nsupporting students learning at a distance via the Web. Collis (in press), in writing about\nthe cost-effectiveness of telematics applications in campus universities, points out that\ncosts are hard to determine in networks. It does seemunlikely that universities will be able\nto compare, except at some global level, the costs and effectiveness of using the new\ntechnologies to support student learning. Should anyone be concerned? Not if the average\ncost per student continues to be acceptable politically and to those who pay, including the\n28\nALT-J Volume 6 Number 3\nstudents themselves, I would say. The technologies have entered university teaching and\nlearning. They will not leave. They must be exploited for the benefit of all in universities.\nReferences\nCollis, B. (in press), 'Telematics-supported education for traditional universities in\nEurope', Performance Improvement Quarterly.\nHawkridge, D., Morgan, A. and Jelfs, A. (1997), 'H801 students' and tutors' use of the\nelectronic workbook and electronic mail', Milton Keynes: Institute of Educational\nTechnology, The Open University.\nMason, R. and Bacsich, P. (1998), 'Embedding computer conferencing into university\nteaching', Computers and Education, 30 (3\/4), 249-58.\nMeek, J., Garnett, M. and Grattan, J. (1998), 'Evaluating the impact of Internet provision\non students' information-gathering strategies', ALT-J, 6 (1), 57-63.\nRada, R. (1998), 'Efficiency and effectiveness in computer-supported peer-peer learning',\nComputers and Education, 30 (3\/4), 137-46.\nReed, J.A. and Afjeh, A.A. (1998), 'Developing interactive educational engineering\nsoftware for the World Wide Web with Java', Computers and Education, 30 (3\/4), 183-94.\nRumble, G. (1997), The Costs and Economics of Open and Distance Learning, London:\nKogan Page.\nVerdejo, F. and Davies, G. (1998), 'The virtual campus: Trends for higher education and\ntraining'. Papers from IFIP TC3\/WG3.3 & WG3.6 Joint Working Conference, 27-29\nNovember 1997, Madrid.\nWalker, M. (1998), Using CMC: Guidelines for Course Teams, Milton Keynes: Programme\non Learner Use of Media, Institute of Educational Technology, The Open University.\nWilson, T. and Whitelock, D. (1998a ), 'What are the perceived benefits of participating in\na computer-mediated communication (CMC) environment for distance learning computer\nscience students?', Computers and Education, 30 (3\/4), 259-69.\nWilson, T. and Whitelock, D. (1998b), 'Is it sustainable? A comparison of student and\ntutor online time across three distance-learning courses', ALT-J, 6 (1), 25-31.\nYaverbaum, G.J. and Liebowitz, J. (1998) 'GoFigure Inc: a hypermedia Web-based case',\nComputers and Education, 30 (3\/4), 147-56.\n29\n"}