{"doi":"10.1111\/j.1475-4959.2006.00178.x","coreId":"65427","oai":"oai:dro.dur.ac.uk.OAI2:5912","identifiers":["oai:dro.dur.ac.uk.OAI2:5912","10.1111\/j.1475-4959.2006.00178.x"],"title":"Transnational development networks : bringing development and postcolonial approaches into dialogue.","authors":["McFarlane,  C."],"enrichments":{"references":[],"documentType":{"type":0.5555555556}},"contributors":[],"datePublished":"2006-03-01","abstract":"This paper explores some of the ways in which a dialogue between development and\\ud\npostcolonial scholarship might contribute to the theorizing of transnational networks in contemporary development. It does so through consideration of three inter-related\\ud\nthemes: epistemologies, spatialities and ethico-politics. The discussion of epistemologies points to the potential benefit in reworking the analysis of the relationship between structure and agency in networks, whereas the discussion of spatialities focuses attention on the interface between the global and the local. Dialogue between development and postcolonial approaches also creates space for considering the politics and ethics of transnational development networks. In particular, this discussion prompts challenges\\ud\naround how to ethically research subaltern knowledge in transnational development networks, including how to trace the translation and redeployment of subaltern knowledge through\\ud\nnetworks. Consideration of these themes highlights not just overlaps and disjunctures between development and postcolonial approaches, but opportunities for further dialogue\\ud\nand future research on transnational development networks. To illustrate the points made in the paper, examples are drawn from Slum\/Shack Dwellers International (SDI), a transnational network of civil society organizations working with urban poverty","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65427.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/5912\/1\/5912.pdf","pdfHashValue":"25c62444e18c40810b6130f9092e10a62e1a62d7","publisher":"Blackwell","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:5912<\/identifier><datestamp>\n      2011-11-17T15:27:18Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Transnational development networks : bringing development and postcolonial approaches into dialogue.<\/dc:title><dc:creator>\n        McFarlane,  C.<\/dc:creator><dc:description>\n        This paper explores some of the ways in which a dialogue between development and\\ud\npostcolonial scholarship might contribute to the theorizing of transnational networks in contemporary development. It does so through consideration of three inter-related\\ud\nthemes: epistemologies, spatialities and ethico-politics. The discussion of epistemologies points to the potential benefit in reworking the analysis of the relationship between structure and agency in networks, whereas the discussion of spatialities focuses attention on the interface between the global and the local. Dialogue between development and postcolonial approaches also creates space for considering the politics and ethics of transnational development networks. In particular, this discussion prompts challenges\\ud\naround how to ethically research subaltern knowledge in transnational development networks, including how to trace the translation and redeployment of subaltern knowledge through\\ud\nnetworks. Consideration of these themes highlights not just overlaps and disjunctures between development and postcolonial approaches, but opportunities for further dialogue\\ud\nand future research on transnational development networks. To illustrate the points made in the paper, examples are drawn from Slum\/Shack Dwellers International (SDI), a transnational network of civil society organizations working with urban poverty.<\/dc:description><dc:subject>\n        Development<\/dc:subject><dc:subject>\n         Postcolonialism<\/dc:subject><dc:subject>\n         Epistemologies<\/dc:subject><dc:subject>\n         Spatialities<\/dc:subject><dc:subject>\n         Ethico-politics.<\/dc:subject><dc:publisher>\n        Blackwell<\/dc:publisher><dc:source>\n        The geographical journal, 2006, Vol.172(1), pp.35-49 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2006-03-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:5912<\/dc:identifier><dc:identifier>\n        issn:0016-7398<\/dc:identifier><dc:identifier>\n        issn: 1475-4959<\/dc:identifier><dc:identifier>\n        doi:10.1111\/j.1475-4959.2006.00178.x<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5912\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1111\/j.1475-4959.2006.00178.x<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5912\/1\/5912.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1475-4959","0016-7398"," 1475-4959","issn:0016-7398"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":["Development","Postcolonialism","Epistemologies","Spatialities","Ethico-politics."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n07 August 2009\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nMcFarlane, C. (2006) ’Transnational development networks : bringing development and postcolonial\napproaches into dialogue.’, The geographical journal., 172 (1). pp. 35-49.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1111\/j.1475-4959.2006.00178.x\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \nDurham Research Online \n \nDeposited in DRO: \n07 August 2009 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status of attached file: \nAccepted for publication version \n \nCitation for published item: \nMcFarlane, C. (2006) 'Transnational development networks : bringing development and \npostcolonial approaches into dialogue.', The geographical journal., 172 (1). pp. 35-49. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1111\/j.1475-4959.2006.00178.x \n \nCopyright statement: \nThe definitive version is available at www.blackwell-synergy.com. \n \n \n \n \n \n \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \n  \n \n \nTransnational development networks: \n bringing development and postcolonial approaches into dialogue \n \n \nColin McFarlane \nDepartment of Geography \nThe Open University \nMilton Keynes \nMK7 6AA \n \nTel: 01908-654-505 \nFax: 01908-654-488 \nEmail: c.mcfarlane@open.ac.uk \n \n \n \n \n \n 2 \nAcknowledgements \n \nI am grateful for comments from Jenny Robinson and two anonymous reviewers on \nan earlier version of this paper.  My thanks also to the organisers and participants of \nthe „Postcolonialism and development: new dialogues?‟ session at the annual \nconference of the Association of American Geographers, Denver, in April 2005. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 3 \nAbstract \n \nThis paper explores some of the ways in which a dialogue between development \nand postcolonial scholarship might contribute to the theorising of transnational \nnetworks in contemporary development.  It does so through consideration of \nthree inter-related themes: epistemologies, spatialities and ethico-politics.  The \ndiscussion of epistemologies points to the potential benefit in reworking the \nanalysis of the relationship between structure and agency in networks, whereas \nthe discussion of spatialities focuses attention on the interface between the global \nand the local. Dialogue between development and postcolonial approaches also \ncreates space for considering the politics and ethics of transnational development \nnetworks.  In particular, this discussion prompts challenges around how to \nethically research subaltern knowledge in transnational development networks, \nincluding how to trace the translation and redeployment of subaltern knowledge \nthrough networks.  Consideration of theses themes highlights not just overlaps \nand disjunctures between development and postcolonial approaches, but \nopportunities for further dialogue and future research on transnational \ndevelopment networks.  To illustrate the points made in the paper, examples are \ndrawn from Slum \/ Shack Dwellers International (SDI), a transnational network \nof civil society organisations working with urban poverty.   \n \nKeywords: development, postcolonialism, epistemologies, spatialities, ethico-\npolitics, Slum \/ Shack Dwellers International. \n \n \n 4 \nIntroduction \n \nThis paper will explore how dialogue between development and postcolonial \nscholarship might contribute to the theorising of transnational networks in \ncontemporary development.  It does so both in the context of the increasingly \nimportant role that transnational networks are playing in development, and in the \ncontext of an awareness among development geographers of the need to engage \nwith the nature and role of these networks.  The paper is organised around three \nthemes through which dialogue might take place: epistemologies, spatialities, and \nethico-politics.  These three inter-related themes are not exhaustive of the \npossibilities for dialogue; the aim is that the conversation highlighted here will \npoint to just some of the ways in which development and postcolonial \ngeographers might more effectively theorise the role of transnational \ndevelopment networks.   \n \nI choose these three themes because of their centrality to the study of \ntransnational development networks.  Epistemology refers to the objects and \nmethods of analysis deployed in development or postcolonial research on \ntransnational networks.  I will argue that at a general level development \napproaches could benefit from the more expansive notion of agency and power in \npostcolonial scholarship, and that postcolonial approaches could benefit from the \ngreater alertness in development scholarship of the structuring role of resources \nand institutions in the creation and maintenance of networks.  A concern with \nspatialities is important because it speaks to some of the central dilemmas in \ndevelopment geography today, and in particular to the relationship between the \n 5 \n„global‟ and the „local‟.  Development geography‟s approach to transnational \nnetworks has generally been to deploy a scalar vocabulary of local through to \nglobal.  There is often a concern with how people or organisations „jump‟ scales \nin order to further their objectives.  There is room here to develop new spatial \nvocabularies of transnational development networks, and one route for doing so \ninvolves dialogue with postcolonial approaches.  In particular, the postcolonial \nfocus on tracing the geographies of circulation and translation of practices, \nobjects (such as documents), knowledges, and representations, could reveal more \nabout how transnational development networks are made and structured.   \n \nFinally, the consideration of ethical and political issues is designed to show that \nneither transnational development networks nor the ways in which we research \nthem are neutral; there are important political and ethical considerations at stake \nand consequences to engage with.  Often, accounts of the politics of knowledge \nin development studies fail to adequately address how subaltern knowledge is \ntranslated and used in development strategies, and it is here that perhaps the most \ncentral contribution of postcolonial scholarship to the ethico-politics of \ntransnational development networks is found.  This dialogue, then, hopes to \ncontribute to recent attempts to develop a critical approach to theorising \ntransnational development networks, which are often conceived in mainstream \ndevelopment literature as technical and apolitical (Henry et al, 2004).  Following \nan introduction to transnational development networks, the paper will be \nstructured around treating these three themes in sequential order.   \n \n 6 \nThere is a growing body of work in geography and elsewhere highlighting the \nproductive possibilities of dialogue between development and postcolonial \nscholarship (see, for example, Blunt and McEwan, 2002; McEwan, 2001; \nSylvester, 1999).  The impetus for this wide-ranging dialogue has been prompted \nby the growing recognition that these two sets of perspectives and approaches \nhave something to offer one another.  While there are certainly overlaps between \ndevelopment and postcolonial scholarship – perhaps particularly in the concern \nwith the material influences of knowledge, discourses and ideas – many have \nreferred to a divide characterised by postcolonialism‟s concern with the \nhistorical, textual and cultural, against development‟s concern with global \ninequalities and political economy.  I hope to show in this paper that bringing \ninto dialogue the particular epistemological, spatial and ethico-political \ninflections that circulate development and postcolonial scholarship on \ntransnational networks, can contribute to the theorising of these networks in a \nvariety of ways.        \n \nIn order to illustrate the points made in the paper, I will draw on the case study of \nSlum \/ Shack Dwellers International (SDI).  SDI is a network of civil society \norganisations working with urban poverty and spanning 12 countries throughout \nAsia and Africa.  It is a learning network based around a structure of „horizontal \nexchanges‟.  These exchanges involve small groups of the urban poor travelling \nfrom one urban settlement to another to share knowledge in what amounts to an \ninformal learning process.  SDI espouses a range of techniques that its leaders \ndescribe as indispensable to a development process driven by the urban poor.  \nThese include daily savings schemes, exhibitions of model house and toilet \n 7 \nblocks, the enumeration of poor people's settlements, training programmes of \nexchanges, and a variety of other tactics, some of which will be expanded on in \nthe paper.  I will use the experience of researching SDI as a basis to reflect on \ndevelopment and postcolonial approaches to transnational networks.  Moreover, I \nwould suggest that researching networks like SDI, and the transnational \ndevelopment networks that SDI members become involved in, demands that \ndevelopment and postcolonial perspectives be brought together.  For example, if \nwe are to understand the political impacts locally or internationally of SDI as a \nnetwork organised around the exchange of knowledge, discourses and ideas, then \nthere is a need to consider how subaltern knowledge circulates and is translated \nwithin and outwith the network.  This requires an understanding of the terms \nthrough which subaltern knowledge is produced, and to not consider well \nestablished debates in postcolonial studies in this area would undermine such a \ntask. \n \nTransnational development networks \n \nThere is a long-standing and varied research agenda considering the role of the \ntransnational in development, from work on colonialism or studies of \nmultinational corporations and transnational media (for example, Blaikie, 1985), \nto calls for the ethnographic study of the networks of relationship through which \nplace and development interventions are constituted (Gupta and Ferguson, 1997).  \nMore recently there have been concerns with migration flows, alternative trade \nnetworks (Carr, et al, 2000), the circulation of knowledge and ideas (Perreault, \n2001; Stone, 2003), and transnational development networks.  This emerging \n 8 \nliterature can also be distinguished by a concern not just with how actors are \ninfluenced by networks, but how they make use of networks to further their own \nobjectives and strategies, whether in advocacy, livelihoods, or local negotiations \n(Patel and Mitlin, 2001).  There is a growing recognition among development \ngeographers that transnational networks play an increasingly important role in \ncontemporary development (Bebbington, 2003; Kearney, 2000; Power, 2003; \nSimon, 2003), and are part of “the more general case of place reconstitution \nthrough various forms of transnational network” (Bebbington and Batterbury, \n2001: 375).  Following Bebbington (2003), transnational development networks \nare flows of ideas, resources and activities that play a role in development \ninitiatives and projects.  These are networks in which “people, ideas and \nresources circulate and in which material interventions in particular locations are \nconceptualised and executed” (Bebbington, 2003: 300).  They are constituted by \nthe relationship between institutions, practices, and knowledge; different forms \nand alignments of these create different kinds of networks and development \ninterventions.  Bebbington (2001), for instance, is concerned with how livelihood \ntransitions in highland Ecuador and Bolivia are understood in terms of links \nbetween families, peasant organisations and transnational corporate, non-\ngovernmental and solidarity trade networks.  The constitution of transnational \ndevelopment networks, then, can be wide-ranging, although the presence of \ncertain kinds of organisations in these networks, such as NGOs, has become \nincreasingly prominent.  For instance, the number of funds channelled and \nrechannelled though NGOs in the 1980s and 1990s was enormous, and now \nexceeds the total annual disbursements through the International Monetary Fund \nand World Bank (Pieterse, 1998: 346). \n 9 \n \nThere is a wide-ranging literature in the social sciences around networks, both as \na metaphor used to describe political, economic and social formations, and as \nform of organisation (for overviews, see Barry, 2001; Thompson, 2003). \nNetworks can be single-purpose, as in a particular development project or policy \nnegotiation, or multipurpose, perhaps involving a wide collection of government \nagencies or campaigning objectives.  Networks may be formed and maintained \nexplicitly as networks, as in the World Bank‟s Global Development Network \n(Stone, 2003), or may be formed through new encounters and associations \naround particular actors, whether they are people, organisations, or documents \n(such as the policy statement of an international or state institution).  In a recent \npaper on networks, Henry, Mohan and Yanacoplous point out that there is little \ntheoretical work on networks in development literature despite their becoming \nsomething of a \"hallmark of the development industry\" (2004: 839)\ni\n.  They \nexplain the attraction of the network form for development actors:  \n \nNetworks are a strategic response to the challenges and opportunities facilitated by the \nglobalisation of capital and by technological changes, particularly the expansion of information \nand communication technologies (ICTs). In comparison to other relationships between \norganisations they have the potential to provide a more flexible, flat and non-hierarchical means \nof exchange and interaction which promises to be more innovative, responsive and dynamic, \nwhile overcoming spatial separation and providing scale economies. \n \nHowever, they point out that there is little critical reflection on the notion of \nnetwork among its proponents in development.  In particular, they are concerned \nwith the ability of networks to democratise development by „empowering‟ the \n 10 \nmarginalized.  Examining networks as both structures and actors, they critically \nexplore “how networks as developmental actors shape structures and the context \nof development” (2004: 841).  Henry et al (2004: 246) go on to argue that there \nis a need for future research to \"critically examine the effectiveness of networks \nas development actors and how effectiveness is defined in these networks and by \nwhom\".  Their paper contests the notion that networks are non-hierarchical, and \npoints to the need to take the role of power as it functions in networks seriously.  \nThis may include attention to, for instance, actor-network theory (Law and \nHassard, 1999) or governmentality.  Michael Merlingen (2002: 370), for \nexample, argues that the conception of power emerging from debates around \ngovernmentality can reveal the often forgotten ways in which power operates in \ntransnational networks.  Governmentality is an approach that conceives power \nneither as “a property or capacity of IGOs [International Governmental \nOrganisations] (material power) nor as a property of the social structures in \nwhich IGOs are embedded (normative power)”.  Rather, power is diffuse, \nmicrophysical, circulatory, and productive (of particular notions of how states, \ncivil societies, and individuals should behave).   \n \nHenry et al (2004) also contest the notion that networks are based on shared \nvalues or straightforward consensus, drawing attention to the production of \nparticular discursive agendas in networks (see, for instance, Hajer, 1995).  We \nmight, for example, point to the role of documents like the World Bank‟s World \nDevelopment Reports as important actors in the production of influential \ndiscourses in networks.  As a metaphor and as a technology, networks are never \nneutral.  Assessing their utility involves examining what they do and do not \n 11 \nreveal, as well as what they do and do not do.  Particular ideas, values, or \nsolidarities – often inflected with particular patterns of funding (Bebbington, \n2004) - can come to structure the nature of networks and any development \nintervention that results from them.  This paper will seek to develop some of \nthese issues by highlighting potential areas of dialogue between development and \npostcolonial approaches to transnational networks.  It will build on Henry et al’s \n2004) critical approach to networks by exploring particular areas where dialogue \nmight take place in ways that can lead to a stronger understanding of the nature \nand implications of networks.  At stake here are the implications of the often \nuncritical ways in which network as a technology of intervention is deployed by \nmainstream development agents, including most notably the World Bank (Stone, \n2003).  In each section, the example of SDI is used to illustrate the claims made.  \nIn the next section – epistemologies – the paper considers the kinds of objects \nand methods of analysis that development and postcolonial approaches provoke \nin relation to transnational networks.   \n \nEpistemologies: reworking structure and agency \n \nResearch on transnational networks in development geography has focussed on \nthe relationship between donors, states, NGOs, and communities, and is often \nconcerned with the distribution of resources in these networks and the influences \nof these networks both in terms of policy and practice.  This has involved \nattention to a variety of issues, including transnational funding agendas, such as \nthose concerned with „participation‟, „gender‟, or „social capital‟ (Harriss, 2002; \nBoas and McNeill, 2004), the disputes between different sectors and scales in the \n 12 \nconception and implementation of development initiatives and interventions, the \nstrategies of different actors, and the forms of policy and practice that result.  \nMuch of this work has explored, for instance, state-led development programmes \nthat have involved local organisations and international donors (Jenkins, 2002; \nSanyal and Mukhija, 2001), the relationship between donors or states and NGOs \n(Bebbington et al, 2002; Mawdsley et al, 2002), the politics of transnational \nsocial movements and globalised resistance (Parnwell and Rigg, 2001; \nRoutledge, 2001), global policy convergences and divergences (Desai and Imrie, \n1998), the development implications of global commodity chains (Hughes, 2001; \nGwynne, 2003), and networks produced through and for ICTs (Unwin, 2004; \nMercer, 2004).  Other work has explored local resistance and livelihood \nstrategies (for example, see entries in Peet and Watts, 1996), including \n„transnational livelihood‟ strategies that span areas in the „North‟ and „South‟ \n(Batterbury, 2001).  The objects of analysis in these various research threads tend \nto be split between an analytic focus on agencies and institutions on the one \nhand, and smaller scale individual and collective development strategies on the \nother (Bebbington, 2003).  The methods deployed often involve ethnographic \nresearch, and in particular interviews, as well as, for example, analysis of claims \nmade by states or international agencies (Robson and Willis, 1997).  More \nrecently, methods have been extended to, for example, the use of Participatory \nRural Appraisal (PRA) (more later).   \n \nTransnational networks, then, are explored in relation to questions of structure \n(for instance, through the influence of state policy or donor resources) and \nagency (for instance, the abilities of local civil society organisations to influence \n 13 \nchange).  The emphasis is generally laid on structural influences, such as the role \nof state or donor agencies in creating and controlling networks around particular \nissues.  In terms of SDI, this broad epistemological framing of the objects and \nmethods of analysis encourages a focus on the relationship between donors, \nstates, NGOs and communities in the network.  It raises questions around, for \nexample, the ability of local communities in SDI to influence state policy or \npractice around housing or sanitation (Mohapatra, 2003), or around whether \ndonors – such as Homeless International, the UK government‟s Department for \nInternational Development (DFID), or the World Bank - are setting the agenda of \nthe various SDI members.   \n \nBy contrast, postcolonial work on transnational networks has tended to focus on, \nfor instance, colonial policy and practices, slavery, diasporas, migration, or \nidentity (see, for instance, Chatterjee, 1993; Bhabha, 1990).  This reflects \npostcolonialism‟s epistemological focus on cultural and historical geographies, \nand on tracing the cultural legacies of colonialism in particular (Blunt and \nMcEwan, 2002).  In this broad-ranging work, the objects of analysis have \nincluded, for example, the circulation of documents and representations, or the \nproduction and circulation of ideas, knowledge and values, such as colonial \nmetropolitan senses of moral responsibility (Lester, 2002).  The objects of \nanalysis have also extended to, for instance, attempts to uncover the lived \nexperiences of actors within colonial or postcolonial networks (Kothari, \nforthcoming), and the different forms of consciousness and agency that are \nproduced in part through networks and that can, in turn, refigure networks \n(Power, 2003).  A variety of methods have been used in analysing networks, \n 14 \nfrom reading archives against the grain to uncover agency or resistance \n(McEwan, 2001), or exploring personal testimony (Kothari, forthcoming), to \nmore general efforts to situate knowledge and remain alert to difference within \nnetworks without descent into an ostensibly „neutral‟ cultural relativism or a \ndisconnected or romanticised localism (McEwan, 2003; Briggs and Sharp, 2004).  \nAs I will go on to discuss below, this approach encourages a pluralisation of \nagency that is alert to the role of organisations of individuals but also to the \ncomplex relation of human and non-human actors.  Bringing into dialogue the \nepistemological approaches of development and postcolonial scholarship to \ntransnational networks, then, discloses new ways of considering how „structure‟ \nand „agency‟ are produced and interact in networks like SDI. \n \nSDI and enumeration: disclosing agency \n \nThis broad epistemological foci of postcolonial approaches to transnational \nnetworks casts new light on the constitution and reproduction of SDI as a \nnetwork, encouraging a consideration, of, for example, the role of \nrepresentations, documents, values, agency, or lived experience.  To take the \nexample of agency and SDI, we might consider the role of enumeration strategies \nin the constitution of SDI networks.  Enumeration is a strategy of knowledge \ncreation in SDI, creating populations and creating territories.  In enumerations, \ngroups of the urban poor organise slum populations into clusters, map the \nclusters, and collect data about these clusters based on household information \nranging from number of occupants and the presence of ration cards, to migration \npatterns and costs of transport to work.  Documents are produced around \n 15 \nstatistics, charts, tables and graphs that help create a basis for authority to certain \nclaims, in particular through its status as quantitative knowledge that speaks the \nlanguage of the state.  The data is aimed at influencing negotiations with \nauthorities, who often cite, for instance, a lack of data on the number of people in \nsettlements, length of stay in settlements, health care and education provision, \nemployment, and so on, as information difficult to get to through state censuses.  \nThese data gaps often inform prejudices about the poor - such as the notion that \nthey do not work, or that they are highly transitory - that often help justify slum \ndemolition or political inaction.   \n \nEnumeration documents, then, are particular representations of the poor that seek \nto tackle more dominant conceptions of slum dwellers in SDI member cities like \nMumbai, India (McFarlane, 2004).  This speaks to the interest in postcolonial \nwork in disclosing the material and immaterial effects of representations (Blunt \nand McEwan, 2002).  There has been a general impetus in this line of inquiry in \ndestabilising epistemological assumptions, including processes of 'worlding' \n(Spivak, 1990: 114), which involves investigation of how representations and the \npower relations within which they are embedded are not esoteric, but rather enter \ninto the constitution of the world.  Enumerations are also attempts in SDI to \nreposition the urban poor as skilled and capable of taking part in their own \ndevelopment, reflecting a frustration in SDI with the role of the state in poverty \nreduction and a commitment to self-organising local co-operatives.  As Bell \n(2002) has pointed out, drawing on the work of Said (1978, 1984, 1993) in this \nfield, postcolonial work has revealed the role of power in transnational networks, \nfor instance in the ways in which particular representations take precedence over \n 16 \nothers.  One question, then, is around the extent to which representations \nproduced through enumerations play both a constitutive role in SDI networks and \ninfluence local mainstream imaginative geographies and conceptions of the poor \nin the various cities in which SDI work (Gregory, 1995).  Aside from the wide-\nranging postcolonial work on the census as a feature of colonial governmentality \n(Appaduarai, 1996; Prakash, 1999; Joyce, 2003), a postcolonial approach would \nbe alert to the agency of documents themselves in the constitution of SDI \nnetworks (see, for example, Blunt, 2000, on the diaries of British women in \ncolonial India).   \n \nThrough international exchanges in SDI, enumeration strategies have travelled, \ncreating the potential for SDI groups to learn from one another‟s experiences in \nconducting enumerations.  Documents often travel with people in these \nexchanges, representing tangible evidence of what can be achieved and acting as \na motivation to groups embarking on the strategy.  In addition, SDI groups learn \nabout conducting enumerations by joining in on an enumeration being \nimplemented by the host group.  The example of enumeration reveals the \nconstitutive role of agency in SDI networks, a notion of agency that is alert to the \nrole not just of organisations or particular individuals, but to a complex \nrelationship of people, documents, representations, lived experiences and values. \nWhat emerges is a conception of agency in postcolonial scholarship that is more \nnuanced than is often the case in the work of development geography‟s \nconsideration of transnational networks.   \n \n 17 \nFrom this discussion of the epistemological focus of development and \npostcolonial approaches to transnational networks, two central questions emerge \nfor further research.  First, emerging mainly from development scholarship, how \ndoes the distribution of resources structure networks?  For example, how \nimportant is the relationship between the World Bank and SDI for structuring the \nnetwork‟s activities?  Second, emerging mainly from postcolonial scholarship, \nwhat is the role of material and human agency in network constitution?  For \nexample, what is the role of SDI‟s enumeration strategy in local, national, and \nglobal fora?  Reconciling these two questions would be useful for broadening the \nepistemological range of the objects and methods of analysis used in research on \ntransnational development networks.  Development approaches could benefit \nfrom a more expansive notion of agency and power, and postcolonial approaches \ncould benefit from a greater alertness to the structuring role of resources and \ninstitutions in the creation and maintenance of networks.  A greater \nunderstanding of the creation, constitution, maintenance and consequences of \ntransnational development networks, then, can result from a dialogue between \ndevelopment and postcolonial approaches around the relationship between \nstructure and agency. \n \nSpatialities: relational development networks \n \nWriting the spatiality of transnational development networks has presented a \nnumber of dilemmas for development geographers. As Anthony Bebbington \n(2003) has argued, there has been a tendency in development geography, with \nsome notable exceptions (for example, Mawdsley, et al, 2001; Mohan and \n 18 \nStokke, 2000), to speak on the one hand of the abstract global processes of \ncapitalism, and on the other hand of the local stories of development \ninterventions, with generally little connection between the two.  This raises a \nseries of challenges.  For instance, what is the relationship between transnational \nnetworks and development interventions or local livelihoods, and how can we \naccount for that relationship (Bebbington, 2003)?  Writing more about the \npossibilities of networking, Marcus Power has asked (2003: 135): to what extent \ncan „grounded‟ local interventions be informed by a global praxis?  On a similar \nregister, David Simon (2003: 16) has argued that one of the central dilemmas in \ndevelopment geography today is to account for the „global-local dialectic‟, \nnamely: “[H]ow to secure locally appropriate and participatory development at \nthe same time as all countries and interest groups are being compelled to engage \nwith the global agendas of trade liberalization, trade-related intellectual property \nrights (TRIPS), supposedly sustainable development and many others”. \n \nTo take the example of livelihoods, recent work in development geography has \nsought to rethink livelihoods in light of transnational influences (see the special \nissue of Ecumene, 2001, 8:4).  Livelihoods research in development has been \nconcerned with how households make a living formally and informally, with \nhouseholds interaction with local resources, and with their social and economic \nnetworks (Murray, 2002; Bagchi et al, 1998).  Arguing that livelihoods have \n“changed profoundly” in light of the increasing influence and manipulation of \ntransnational processes (Bebbington and Batterbury, 2001: 369), the Ecumene \ncollection explores, for example, the transnational circulation of ideas on \nindigeneity and related flows of resources in Amazonian Ecuador (Perreault, \n 19 \n2001), and the ways in which people „jump‟ scales in livelihood strategies \n(Rocheleau, et al, 2001).  Developing an earlier concern in livelihoods studies \nwith the role of extra-local institutions and organisations in mediating resources \nin livelihoods, this collection argues that given that livelihoods are increasingly a \npart of transnational networks, there is an “analytical challenge to explain \nlivelihoods in terms of their relationships with these and other transnational \nsocial spaces” (Bebbington and Batterbury, 2001: 374).  In particular, \nBebbington and Batterbury (2001) argue, there is a need to investigate the ways \nin which transnational networks extend or block access to material and \nideological resources.   \n \nDevelopment geography‟s approach to transnational networks has generally been \nto deploy a scalar vocabulary of local through to global.  There is often a concern \nwith how people or organisations „jump‟ scales in order to further their \nobjectives.  There is room here to develop new spatial vocabularies of \ntransnational development networks, and one route for doing so involves \ndialogue with postcolonial approaches.  Development approaches often reinstate \nthe distinction between scales and sectors (international agencies, states, civil \nsocieties, livelihoods), creating an image of different organisations operating in \ndifferent spheres and trying to influence one another (Ferguson and Gupta, \n2002).  There is a challenge for development geographers in blurring these \ndistinctions and developing new vocabularies for conceiving the spatialities of \ntransnational networks.   \n \n 20 \nA postcolonial reading, by contrast, tends to emphasise a more relational \nvocabulary of transnational networks.  This is an approach that emphasises the \nco-constitution of space, for example, in relation to metropole and colony (King, \n2004; Lester, 2002), homeland and diasporic spaces (Bhabha, 1990), and the \ntransnational constitution of livelihoods (Gupta, 1998).  Culture, identity and \nhistory are understood as translocal spatial formations, analysed through notions \nsuch as location, mobility, borderlands and exile (McEwan, 2003).  Rather than \nreading transnational development space through a simple North-South \ntrajectory, postcolonial approaches emphasise a spatial genealogy that highlights \nthe multiple sites and heterogeneity of knowledge, space and politics (Bell, \n2002).  For Gupta (1998: 156), for instance, the livelihoods of Indian farmers are \nin part a product of “a condition in which disparate epistemologies and practices \ncoexist and interpenetrate”, resulting in an hybridity of „indigenous‟ and \n„scientific‟ that is central to the “mistranslation” of postcolonial modernity in \nrural India (1998: 232).  He found that farmers often switched between advice \nand terminology used by development officials and more „indigenous‟ \nunderstandings of soils, growth, plants, etc., and seemed to do so with ease.  This \nled Gupta to question notions like „indigenous knowledge‟.  Gupta‟s work has \nimplications for development geographers working on translocal livelihoods, for \nexample in the deployment of relational concepts such as „mistranslation‟ in \naddition to scalar vocabularies.  Here, the distinctions between scales are blurred.  \nThe spatialities that result emphasise the role of circulations in constituting \nnetworks and bringing some sites and forms of knowledge together while \ndistancing others. This circulation is generally not one of seamless travel, but of \ncontested travelling discourses and knowledges.   \n 21 \n \nLester (2002), for instance, traces the circulation of conflicting representations in \nBritish colonial discourses, mainly among middle-class men.  He shows how \ndiscourses of race and class difference, at home and in the colonies, came to \ndominate over discourses of humanitarian liberalism among privileged and \ninfluential men across colonial networks.  For example, in 1840s Britain, \nbourgeois anxieties of, for instance, the Chartist movement, were tied up with a \nbroader fear of a proletariat revolution that would turn Britain into a socialist \nstate.  There was an emerging fear on the political right that further reform would \nserve to encourage the proletariat.  Alliances around the propertied classes \nhardened in view of economic crisis, the Irish famine, and the revolutionary \nturmoil in Europe in 1848.  These bourgeois reactions were intimately tied to \nstruggles that settlers were waging against humanitarian liberalism in colonies \nsuch as, in Lester‟s case, the Cape.  Lester‟s conception of discursive networks \ndisrupts the division between metropole and colony, centre and periphery, or \nglobal and local.  His work shows how the constitution of place, knowledge and \npolitics is relational, and points to the broader point that local histories and \ncultures have always been mixed, a recognition that can be redeployed to think \nmore creatively and progressively about the relation between place and politics \n(Massey, 1991, 2005; Clifford, 1997).  His approach also points to a broader \neffort in postcolonialism to explore the vocabularies, imaginaries and practices \nthrough which different actors within networks conceive of networks and their \nroles within them, rather than solely relying on academic concepts for network \nanalysis. \n \n 22 \nKnowledge, ideas, discourses, politics, and practices in transnational networks \nare constituted through conditions of equal power.  For example, relations of \npower structure the kinds of knowledge that take precedence in networks.  On a \nsimilar register, knowledge changes as it travels to different sites.  There is now a \nbroad-ranging postcolonial literature exploring how this process of translation \noccurs, inspired by, for instance, Said‟s (1983) notion of travelling theory.  Said \nargues that theory must change as it deployed in a new context, and that this has \nbeen “part of a historical transfer of ideas and theories from one setting to \nanother” (Said, 1983: 237).  He argues that 'misreadings' are an essential part of \nlearning and creativity.  Similarly, tracing the practices of translation is an \nessential part of making sense of how transnational networks are co-constituted, \nrevealing the geographies through which certain forms of discourses, knowledge, \nideas, or practices become dominant.  This focuses attention on practices over the \ninteraction of scales and institutions per se.  While development geographers \nhave drawn attention to linkages between organisations such as donors, states and \nNGOs across space, there has been little attention to the geographies of practice \nthat constitute or are constituted by these networks, as Bebbington (2003: 300) \nsuggests: “Consideration, for instance, of where, how and why economic \ndecisions are made and structured, by whom, and with what geographical \nconsequences is too often absent or underdeveloped in these analyses”.   \n \nConcepts such as „misreading‟ focus attention on how knowledge and learning \nare translated in transnational networks, while retaining a central concern with \nrelations of power and difference.  There is a challenge here in tracing not just \nthe increasing frequency with which people engage with various kinds of \n 23 \ntransnational networks, but the unevenness of engagements as “new ideas, \nresources and desires get worked into the landscape and the ways in which \npeople think about its future” (Bebbington and Batterbury, 2001: 376).  These \nengagements have implications for how development, alternatives and resistance \nare thought about by people involved in development (ibid).  The postcolonial \nfocus on transnational spatialities as produced through the circulation and \ntranslation of practices, objects, knowledges, and representations, could \ncontribute new approaches and vocabularies to development accounts of the \nspatialities of transnational networks.  Tracing the geographies of circulation and \ntranslation would reveal more about how transnational development networks are \nmade and structured. \n \nDeveloping a relational topology of SDI \n \nTo elaborate on what a relational topology of SDI networks might involve, I will \nhighlight the example of exhibitions. Exhibitions of model houses and sanitation \nblocks have become critical events in SDI‟s work.  These are full-size model \nhouses that are designed and built by organisations of the poor.  Exhibitions are \nan attempt to illustrate the potential of the poor and to attract media and political \nattention.  Often, they are associated with exchanges of poor people from across \nthe city, country, or world, and they generally last three or four days.  They often \ninvolve informal discussions ranging from concerns over land tenure to \nconstruction or local organising.  Occasionally, exhibitions are combined with \nother events such as enumerations.  \n \n 24 \nA development geography perspective encourages a focus on how exhibitions \nincrease housing options and opportunities for the urban poor in SDI.  It would \nexplore the ways in which model house construction contributes to a sense of \nindividual and collective empowerment, and how exhibitions help create \nopportunities for negotiation with local states.  A postcolonial approach would \nplace greater emphasis on the relationship between exhibitions, identity and \nculture.  For example, exhibitions in SDI are inflected with a particular \nconstruction of the poor and of social change.  In particular, exhibitions put the \ncapacities and skills of the poor on demonstration.  This is an image of social \nchange with the poor at the centre, casting the poor as entrepreneurial and \ncapable of managing their own development.  While a development emphasis \nmight focus on the way funds are spent, how the management of the construction \nproject operates, and how this compares with more „top down‟ housing and \nsanitation initiatives, a postcolonial emphasis might explore the involvement of \nthe poor in these constructions as a kind of ambivalent modernity.  On the one \nhand, this involvement is pulling the poor into discourses of urbanisation, \nimprovement, and the march of progress that are associated with the ways in \nwhich the nationalist project constructed views of the city in, for instance, a \nmodern India (Prakash, 2002); and on the other hand, the experience of urban life \nfor the poor has often been marked by the denial of these very features of \nmodernity – access to reliable infrastructure like sanitation or water, services like \nhousing, and so on.  Exploring the disjunctive relationship between discourse and \nexperience is another instance of „mistranslation‟, in this case of a particular \nmode of urban postcolonial modernity wherein the city inhabits a space of \ncollapse and failure in the context of narratives of progress and development.   \n 25 \n \nOne set of questions for the analysis of SDI relates to the relationship between \nlocal exhibitions and the transnational circulation of exhibition as a strategy.  \nStories about how to conduct exhibitions, and how to construct model houses and \nsanitation blocks, circulate SDI through exchanges.  In exchanges, visiting \ngroups often join-in on constructions and exhibitions as they are going on.  \nStrategies of measurement, or particular construction techniques, travel between \nsites during and after exchanges.  For example, one strategy for people unfamiliar \nwith tape measurers is to use clothes such as a sari as a measurement device.  In \naddition, small-scale models, write the Asian Coalition for Housing Rights, an \nSDI partner, are often deployed as “a three-dimensional imagining tool for \npeople unfamiliar with the abstraction of scale drawings” (ACHR, 2001: 13).  \nThey go on to describe one exhibition in Thailand: “As the model went up, the \npeople pulled out boards, nailed things up differently, changed this, argued about \nthat.  Measurements altered, ceiling heights were raised then lowered, window \npositions shifted, bathrooms and kitchens swelled then shrunk” (ibid).  Models \nbecome the basis for negotiations around what kind of houses people want to live \nin, a process in which the collective will must be weighed against individual \npreferences, and which says as much about how people live and think as it does \nabout their material well-being.  In the process, codified technical knowledge \nabout construction is often converted into more informal forms of technical \nknowledge. For instance, Amita Mbaye, part of a Senegalese Savings and Loan \nNetwork, said:  \n \nWhen I asked the technician (who works with us in Dakar) to show us how layout plans are \ndesigned, he used such sophisticated jargon that I barely understood a word he said.  In Protea \n 26 \nSouth (Gauteng, South Africa) during our last evening, we asked a woman to draw us a plan.  \nWhen she explained house modelling, I understood and felt that I too could do it (Patel and \nMitlin, 2002: 132). \n \nAs a result of these travelling encounters between cities as different as Cape \nTown, Phnom Penh and Mumbai, knowledge, space and development in SDI‟s \nnetworks are co-constituted, relational products that combine the „near‟ and „far‟.  \nDisparate knowledges and forms of identification, from construction techniques \nto particular notions of the poor and social change, circulate exchanges and \npotentially bring into dialogue development‟s concern with urban poverty with \npostcolonialism‟s concern with identity and culture.  This is a conception of \nnetwork space, following Amin (2002: 389), as “folded together, produced \nthrough practices, situated, multiple and mobile\", and as marked by: \n \n[F]irst, the intensification of mixture and connectivity as more and more things become \ninterdependent (in associative links and exclusions); second, the combination of multiple \nspatialities of organisation and praxis as action and belonging at a distance become possible; and \nthird, the erosion of the ontological distinction between place and space as 'placement' in multiple \ngeographies of belonging becomes possible.  Therefore, places are more than what they contain, \nand what happens in them is more than the sum of localised practices and powers, and actions at \nother 'spatial scales' (2002: 395).  \n \nA dialogue between development and postcolonial approaches to transnational \nnetworks would be concerned with writing spatialities that connect local \ndevelopment interventions with transnational processes.  This would involve \ntracing the geographies of circulation and translation in order to reveal more \nabout how transnational development networks are made and structured.  For \n 27 \nexample, in terms of livelihoods, development geography could gain from \npostcolonialism‟s concern with livelihood as it relates to questions of indigeneity, \nmodernity, culture and transnational flows.  Postcolonial approaches, in turn, \ncould benefit from development‟s concern with livelihood as a relationship \nbetween households, environment, and organisations and institutions locally and \nbeyond, as well as its consideration of livelihoods in relation to poverty and \ninequality.  Such an approach would build on emerging work in development \naround transnational livelihoods to consider livelihoods both as multi-faceted \nways of making a living, and as produced in part through transnational \ndevelopment networks.  In terms of SDI, this involves a focus both on how the \ntravelling of knowledge (exhibitions) influences agency and identities, and on \nhow that relates to how slum dwellers get by on a long-term and daily basis \n(through, for instance, increasing housing options).  Developing this approach \ncould usefully involve a topological reading of network space in order to capture \nthe relationalities of knowledge, space and politics, developed in postcolonial \nscholarship and elsewhere.  The postcolonial focus on transnational spatialities as \nproduced through the circulation and translation of practices, objects, \nknowledges, and representations, could contribute to development accounts of \nthe spatialities of transnational networks in ways that reveal more of the \ngeographies of networks that connect scales of local, national and global.  This \napproach would necessarily remain alert to how actors within networks construct \ntheir own spatial vocabularies of those networks, an issue that raises some of the \nethical and political dimensions that the next section will explore.    \n \n \n 28 \nEthico-politics: policy, practice and subaltern knowledge \n \nThere is a wide-ranging engagement in development scholarship with the politics \nof transnational development networks.  This has tended to focus on, for \nexample, the influence of networks on policy and practice, the influences of \nglobal forms of capitalism and neoliberalism, or the ways in which the political \neconomy of development in national states relates to global trade or donor \nagendas and local development policy and practice.  Central concerns include, \nfor instance, the role of aid in structuring the policies of states or the practices of \ncivil society organisations, often as part of a more general concern with the \nstructuring influence of the geopolitics of „North‟ and „South‟.  The relative \ninfluence of donors, states, and civil society organisations in transnational \ndevelopment networks is often framed around which sorts of politics come to \ndominate and which sorts of politics are marginalised.  Often, there is a critical \ninterrogation in this research of the intended objectives of donor or state \nagencies.  Pieterse (2001: 166), for instance, has argued that development is a \n“large-scale spin-doctoring operation,” and highlights Woost (1997: 229): “We \nare still riding in a top-down vehicle of development whose wheels are greased \nwith a vocabulary of bottom-up discourse.”  Joshi and Moore (2000: 26) argue \nthat mainstream discourses are little more than “fashionable jargon” used to gloss \nover political and institutional issues.  Further, they argue that the proliferation of \nNGOs since the 1980s has co-opted alternative voices through the funding of and \nthe „pulling-in‟ of radical groups to „accommodative‟ discourses with \nconservative agendas. \n \n 29 \nThese rubrics have become important debates around the politics of transnational \nnetworks, often throwing into refrain the relationship between „mainstream‟ and \n„alternative‟ development. Pieterse (1998: 359), for instance, encourages \nattention to how the entire field of development is changing through shifting \nalignments between mainstream and alternative.  In transnational development \nnetworks, states, civil society organisations, and international agencies engage \nwith one another in ways that involve a variety of relationships, occasionally \nsimultaneously (Bryant, 2002), from what may be tightly controlled conditions \ninvolving incorporation, to conditions that allow space for alternatives.  The \ncontention here is that transnational development networks are reworking the \nrelationship between mainstream and alternative development.  On a different \nregister, development approaches to transnational networks have raised questions \nabout accountability, including both the accountability of donors and NGOs to \nlocal communities (Edwards and Gaventa, 2001).   \n \nA related and no less controversial strand of development is concerned with how \nto locate and draw-upon local knowledge in local, national and global \ndevelopment policy and practice, with much deployment in recent years of \nRobert Chambers‟ (1997) influential work on Participatory Rural Appraisal \n(PRA).  PRA uses oral and visual techniques to generate knowledge because it is \nthought that the written word marginalises those that are less accustomed to it.  \nMapping, ranking of preferences and oral histories are all noted parts of the PRA \ntoolkit.  Chambers (1997: 103, cited in Mohan, 2002: 52) has conceptualised \nPRA in the following way: \n \n 30 \nThe essence of PRA is change and reversals – of role, behaviour, relationship and learning.  \nOutsiders do not dominate and lecture; they facilitate, sit down, listen and learn.  Outsiders do not \ntransfer technology; they share methods which local people can use for their own appraisal, \nanalysis, planning, action, monitoring and evaluation.  Outsiders do not impose their reality; they \nencourage and enable local people to express it. \n \nPRA has the strength of being locally oriented, but its impacts have been mixed \nin practice.   Despite some real successes in democratising development, PRA is \noften rigidly tied to the agendas of donors, and can be implemented in a \ntokenistic fashion, routinised and „parcelled-in‟ to development initiatives \n(Mohan, 2002).  In addition, while more successful PRA has picked-up on, for \ninstance, gender imbalances (Mosse, 1994), local elites have sometimes come to \nstand for „the community‟.  Others have argued that the very focus on the „local‟ \nhas been a shortcoming of PRA, suggesting that it marginalises some of the \ncauses of poverty by bypassing national and international concerns such as trade, \nor strengthening states in order to make them more accountable (Mohan, 2002; \nMohan and Stokke, 2000).  Often, accounts of the politics of knowledge in \ndevelopment studies fail to adequately address how subaltern knowledge is \ntranslated and used in development strategies, and it is here that perhaps the most \ncentral contribution of postcolonial scholarship to the ethico-politics of \ntransnational development networks is found.   \n \nPostcolonial work on the politics of transnational networks has tended to \nmanifest itself in a decolonising imperative of both past and present colonial \ndiscourses, including of the geographical knowledges in the academy (Robinson, \n2003; Driver, 1992).  This reflects postcolonialism‟s epistemological focus on \n 31 \ncultural and historical geographies, although there has been postcolonial work \nconducted by geographers around, for example, geopolitics (Gregory, 2004; \nSidaway, 2000) and development (Corbridge, 1993; Bell, 2002).  The concern \nhere has been to trace the material effects of discourses and representations, but \nwith far less examination of the relationship between postcolonialism, \ndevelopment and global capitalism than with cultural and textual representations.  \nThis gap, though, can be over-stated.  As Blunt and McEwan (2002: 6) have \nargued, postcolonial scholarship has shown \"how the production of Western \nknowledge is inseparable from the exercise of Western power\", and there has \nbeen an attempt in this work to situate that knowledge, interrogate its power, and \nreassert the value of alternative experiences and ways of knowing.  In addition, \nSpivak (1999), for example, has shown the connections between the \nmarginalising of „Other‟ women and their peripheral position within global \neconomies (McEwan, 2003).   \n \nA postcolonial approach to transnational networks focuses attention on the terms \nthrough which subaltern knowledge is constructed, and this focus offers an \nimportant contribution to work on transnational networks by development \nscholars.  An important issue of concern in this area of postcolonial work has \nrelated to the appropriation of subaltern knowledge.  As Briggs and Sharp (2004: \n664) have written in relation to indigenous knowledge: \"A central tenet of \npostcolonial theory is its concern with the ontological and epistemological status \nof the voices of subaltern peoples in Western knowledge systems, and a \npostcolonial interrogation of the inclusion of indigenous knowledges in \ndevelopment suggests caution\".  Spivak (1988) argues that the subaltern cannot \n 32 \nspeak, so imbued must s\/he be with the words and phrases of 'Western thought' in \norder to be heard.  This is to say that the subaltern cannot be heard as a \nconsequence of the privileged position that, for example, academic researchers or \ndevelopment consultants occupy.  This often leads to 'epistemic violence': ways \nof knowing the world outside of the language of Western science, philosophy and \ndevelopment are invalidated or trivialised.  Thus, \"the subaltern must always be \ncaught in translation, never truly expressing herself, but always already \ninterpreted\" (Briggs and Sharp, 2004: 664).   \n \nSpivak's  (1993) notions of unlearning and learning outline a formulation of \nethics in this regard.  „Unlearning‟ involves “working hard to gain knowledge of \nothers who occupy those spaces most closed to our privileged view and \nattempting to speak to those others in a way that they might take us seriously and \nbe able to answer back” (McEwan, 2003: 384).  For Spivak, learning from one \nanother is an ethical imperative.  For the academic researcher, learning in this \nsense is not about speaking for an individual or group, but developing new \npositions through interactions between researchers and people in disparate \nlocations (Spivak, 2005).  This is an imperative that points to transformation: to \npostcolonialism as, following McEwan (2003: 349), an ethico-politics of \nbecoming, emphasising the processual and anticipatory - \"recognising a \ncondition that does not yet exist, but working nevertheless to bring that about\". \nWhat emerges is an image of a postcolonial geography whose politics are \n\"provisional and constantly under review\" (ibid).  Crucially, responding to these \nchallenges means avoiding creating postcolonialisms in scholarship that become \nanother colonising discourse, \"yet another subjection to foreign formations and \n 33 \nepistemologies\", and this requires a \"greater sensitivity to the relationship \nbetween power, authority, positionality and knowledge\" (McEwan, 2003: 351; \nRose, 1997).  One method for framing this ethico-politics lies in Briggs and \nSharp‟s (2004) distinction between liberal and radical politics. They argue that \nthere must be a radical attempt to engage indigenous people and indigenous \nknowledge, rather than a liberal attempt that integrates views into pre-given \npositions and stops short of the many different kinds of indigenous knowledge \nand ways of knowing. \n \nIn terms of SDI, attention to the terms through which subaltern knowledge is \nconstructed would involve a critical reflection on, for example, how subaltern \nknowledge is used in housing construction.  For instance, does technical \nknowledge around measurement and design come to displace more qualitative \nand experiential knowledges about what people want from a home?  In addition, \ndoes the focus on collective agreement on housing forms amount to a consensus \npolitics that displaces individual subaltern voice and knowledge?  A postcolonial \napproach encourages an interrogation of the ways in which subaltern knowledge \nis translated as it travels through networks, whether through documentation and \nnegotiations within and between civil society organisations, states, or \ninternational agencies, or within and between SDI groups themselves.  In \naddition, Spivak‟s notions of learning and unlearning throw SDI‟s strategy of \nhorizontal exchange into sharp relief.  In SDI networks, learning in exchanges \nbetween subaltern groups in different cities is generative of new politics and \npractices, whether through travelling strategies such as enumeration, exhibition, \nor daily savings, through the disclosure and exploration of new tactics of \n 34 \nengagement and negotiation with authorities, or through modes of solidarity and \nsupport.  The challenge for the researcher is to listen to these formations and to \ndevelop writing styles that allow subalterns to speak in ways that don‟t speak for \nthem.   \n \nA dialogue between development and postcolonial approaches around the politics \nand ethics of transnational development networks would involve, for example, \nreconciling the role of transnational networks in local political economies of \ndevelopment, with attention to the ways in which subaltern knowledge is \ndeployed in local political economies.  In terms of SDI, for example, this \ninvolves asking how SDI‟s travelling subaltern knowledges, such as those drawn \non through exhibitions, are deployed and translated in local political economies.  \nAt stake here are the ways in which subaltern knowledge is translated and used in \ndevelopment, and the postcolonial focus on these mediations could be a useful \ncontribution to development scholarship on transnational development networks.  \nDevelopment geography would gain from attention to ethical considerations \naround learning, which involves an attempt to listen and to (un)learn, and to \ndevelop new positions through interactions with subalterns.  This requires a \ncritical approach to the ways in which subaltern knowledge is mediated as it \ntravels and is reshaped, extending to how learning occurs between actors in \ntransnational networks and what kinds of politics and practices emerge through \nthe exchanges of people and information.  Such an approach goes beyond a \nconcern with whether NGOs or donors are accountable to subaltern groups to \nalso consider the extent to which such agents can and do listen to subaltern \nindividuals and groups, as well as what they do with what they are listening to.  \n 35 \nThere is scope in this dialogue for considering in a potentially new light how \nknowledge gained through strategies such as PRA is used by, for instance, \nagencies like the World Bank.   \n \nIn addition, development‟s concern with the relationship between transnational \nnetworks and local political economies, with the policy influences of networks \nwith local, national and global fora, or with debates around mainstream and \nalternative development and their relationship with transnational development \nnetworks, are instructive for postcolonial scholarship seeking to engage with the \npolitics of the relationship between global capitalism, transnationalism and \npoverty.  Such a dialogue might provide a basis for developing political \nalternatives beyond the concept of the „hybrid‟ in postcolonial research, which \noften becomes the privileged space of political correction in work on diasporas or \nmigration, as if highlighting the very existence of hybridity undoes the violence \nof various discourses of purity (McEwan, 2003; Loomba and Kaul, 1994).  As \nMcEwan (2003: 345) points out, celebrating „hybrid‟ ethnic cultures may also \nserve to exclude the “harsh realities facing immigrants all over the world”, and \ndevelopment‟s concern with inequality and political economy disclose other \npossibilities for political change that are too often marginalised in postcolonial \naccounts.   \n \nTowards a postcolonial geography of trasnational development networks \n \nThis paper has explored some of the ways in which a dialogue between \ndevelopment and postcolonial approaches to transnational networks might inform \n 36 \nthe study of transnational development networks.  It has done so through three \ninter-related themes: epistemologies, spatialities, and ethico-politics, and by \nillustrating some of the issues pertaining to each theme through examples from \nSDI.  Each of these themes marks out ground for future research on transnational \ndevelopment networks.  In terms of epistemologies - the objects and methods of \nanalysis - dialogue between development and postcolonial approaches points to \nthe potential benefits of reworking the analysis of the relationship between \nstructure and agency in networks, and in particular for rethinking the ways in \nwhich agency is constituted.  This might involve, for example, tracing the role of \ndocuments, representations or values, as well as aid, in the constitution of \ntransnational development networks.  This dialogue is useful for broadening the \nepistemological range of the objects and methods of analysis used in research on \ntransnational development networks.  Research on the spatialities of transnational \ndevelopment networks involves attention to the interface between the global and \nthe local.  I have argued that a relational conception of network space is useful \nfor understanding this interface.  This is a conception of networks as co-\nconstituted through a variety of „near‟ and „far‟ actors and practices.  The \npostcolonial focus on transnational spatialities as produced through the \ncirculation and translation could contribute to development accounts of the \nspatialities of transnational networks in ways that reveal more of the geographies \nof networks that connect scales of local, national and global.  Such a conception \nwould trace the relative power of different forms of knowledge, discourse, and \nmaterialities in the production of network space.  \n \n 37 \nCritically, this requires alertness to the different kinds of knowledge and \nspatialities produced by different actors, and the ways in which some of these \nbecome dominant while others are marginalised or abandoned.  Concepts such as \n„mistranslation‟ (Gupta, 1998) or „misreading‟ (Said, 1983) are useful for tracing \nthe production of these relational spaces.  Dialogue between development and \npostcolonial approaches here might also, for instance, seek to trace the role of \ntransnational networks in local livelihoods, contributing to an emerging research \nagenda in development geography.  In addition, postcolonialism could benefit \nfrom development‟s consideration of livelihoods through the lens of material \npoverty and inequality.  Finally, dialogue between development and postcolonial \napproaches opens space for considering the politics and ethics of transnational \ndevelopment networks.  The possibilities of this dialogue stand in contrast to the \noften uncritical ways in which network as a technology of intervention is \ndeployed, for example by mainstream development agents such as World Bank \n(Stone, 2003; Henry et al, 2004).  In this particular dialogue between \ndevelopment and postcolonial scholarship, there is the possibility of a \ntheorisation of transnational development networks that is more alert to a range \nof overlapping ethical and political considerations.  Dialogue here presents \nchallenges around how to ethically research subaltern knowledge in transnational \nnetworks, including how to trace the translation and redeployment of subaltern \nknowledge in networks like SDI.  One challenge is to trace the terms through \nwhich subaltern knowledge is translated in transnational networks and through \nlocal political economies.  \n \n 38 \nResearching networks like SDI, and the transnational development networks that \nSDI members become involved in, demands that development and postcolonial \nperspectives be brought together.  This is the case when we consider the \ndevelopment impacts of subaltern knowledge: we are required to ask both what \nthe political effects of subaltern knowledge are on the development of policy or \nnew development interventions, and to ask how subaltern knowledge is \ntranslated and used.  For example, if a postcolonial approach to SDI were to \nconsider how states and development agents respond to or use subaltern \nknowledges, then it would be required to explore not just, for example, the \nrelationship between travelling subaltern knowledges and individual identity, but \nalso the development literature on these different development agents.  On a \ndifferent register, given that researching transnational development networks can \ninvolve constantly shifting positionalities, from speaking with the urban poor to \nspeaking with development professionals, exploring the power relations and \nmodes of representation that occur between „researcher‟ and „researched‟ in these \ndifferent contexts requires a commitment to an (un)learning that seeks a more \nequitable dialogue.  Again, these debates have been explored in postcolonial \nstudies to the extent that it would surely be a mistake not to consider them. \n \nTaken together, the three inter-related themes discussed in this paper mark out \nnot just overlaps and disjunctures between development and postcolonial \napproaches, but space for further dialogue and research around transnational \ndevelopment networks.  Further research may lead to new ways of \nconceptualising „structure‟ and „agency‟, and their interactions, in transnational \ndevelopment networks.  It may also lead to new ways of describing and methods \n 39 \nfor exploring the links between the „global‟ and the „local‟, in ways that \nproblematise that distinction by tracing the actual geographies through which \nnetworks are made, maintained, manipulated, etc.  This may involve a variety of \nways of writing relational topologies not explored in this paper (see, for instance, \nMassey, 2005).  These research approaches and methods – like the networks \nthemselves – cannot be viewed as neutral, but must be understood as \ninterventions that face political and ethical dimensions in their planning and \nexecution, as well as in the outputs that result.  Further dialogue could take place \nbetween development and postcolonial scholars working through these \nchallenges as they research transnational development networks, and this too \nmay develop new vocabularies and conceptions of, for example, the ways in \nwhich subaltern knowledge circulates and is translated.  More generally, this \ndialogue contains the promise of a more postcolonial geography of transnational \ndevelopment networks that would improve understanding of these increasingly \nimportant forms of intervention. \n \n \n \n \n \n \n \n \n \n \n 40 \nReferences \n \nAmin A 2002 Spatialities of globalisation.  Environment and Planning A 34 385-\n399 \n \nAppadurai A 1996 Modernity at Large: Cultural Dimensions of Globalisation \nUniversity of Minnesota Press, London \n \nAsian Coalition for Housing Rights 2001 Housing by people: newsletter of the \nAsian Coalition for Housing Rights 13, June \n \nBagchi D, Blaikie P, Cameron J, Chattopadhyay M, Gywali N and Seddon D \n1998 Conceptual and Methodological Challenges in the Study of Livelihood \nTrajectories: Case Studies in Easter India and Western Nepal Journal of \nInternational Development 10, 453-468 \n \nBarry A 2001 Political Machines: governing a technological society  Athlone, \nLondon \n \nBatterbury S P J 2001 Landscapes of Diversity: A Local Political Ecology of \nLivelihood Diversification in South-Western Niger Ecumene 8:4 437-464 \n \nBebbington A J 2001 Globalized Andes? Livelihoods, Landscapes and \nDevelopment Ecumene 8:4 414-436 \n \n 41 \nBebbington A J 2003 Global Networks and Local Developments: Agendas for \nDevelopment Geography Tijdschrift voor Economische en Sociale Geografie \n94:3 297-309 \n \nBebbington A J 2004 NGOs and uneven development: geographies of \ndevelopment intervention Progress in Human Geography 28:6 725-745 \n \nBebbington A J and Batterbury S P J 2001 Transnational Livelihoods and \nLandscapes: Political Ecologies of Globalization Ecumene 8:4 369-380 \n \nBebbington A J, Rojas R, Hinojosa L, Munoz D, Guerrero E and Martinez \nE 2002 The Contributions of the Dutch Cofinancing Programme to Rural \nDevelopment and Rural Livelihoods in the Highlands of Peru and Bolivia Ede: \nStuurgroep \n \nBell M 2002 Inquiries as Postcolonial Devices: The Carnegie Corporation and \nPoverty in South Africa in Blunt A and McEwan C Postcolonial Geographies \neds Continuum, London 64-82 \n \nBhabha H 1990 Nation and Narration Routledge, London. \n \nBlaikie P 1985 The political economy of soil erosion in developing countries \nHarlow, Longman \n \n 42 \nBlunt A 2000 Spatial Stories Under Siege: British Women Writing from \nLucknow in 1857 Gender, Place and Culture 7, 3 229-246 \n \nBlunt A and McEwan C eds 2002 Postcolonial geographies Continuum, \nLondon \n \nBoas M and McNeill D 2004 Global Institutions and Development: Framing the \nWorld? Routledge: London \n \nBriggs J and Sharp J 2004 Indigenous knowledge and development: a \npostcolonial caution Third World Quarterly 25, 4 661-676 \n \nBryant R L 2002 Non-governmental Organizations and Governmentality: \n„Consuming‟ Biodiversity and Indigenous People in the Philippines Political \nStudies 50, 268-29 \n \nCarr M, Chen M A and Tate J 2000 Globalization and Home-Based Workers \nFeminist Economics 6:3 123-141 \n \nChambers R 1997 Whose Reality Counts? Putting the First Last IT \nPublications, London \n \nChatterjee P 1993 The Nation and its Fragments: Colonial and Postcolonial \nHistories Princeton University Press, Princeton, New Jersey \n \n 43 \nClifford J 1997 Routes: Travel and Translation in the Late Twentieth Century.  \nHarvard University Press, Massachusetts. \n \nCorbridge S 1993 Colonialism, postcolonialism and the political geography of \nthe Third World in Taylor P J ed Political Geography of the Twentieth Century \nBelhaven Press, London. \n \nDesai V and Imrie R 1998 The new managerialism in local governance: North-\nSouth dimension Third World Quarterly  19:4 635-650 \n \nDriver F 1992 Geography's Empire: Histories of Geographical Knowledge \nEnvironment and Planning D: Society and Space 10, 23-40 \n \nEdwards M and Gaventa J eds 2001 Global Citizen Action Earthscan, London \n \nFerguson J and Gupta A 2002 Spatializing states: towards an ethnography of \nneoliberal governmentality American Ethnologist 29, 4 981-1002 \n \nGregory D 1995 Imaginative geographies.  Progress in Human Geography 19, 4 \n447-485. \n \nGregory D 2004 The Colonial Present: Afghanistan, Palestine, Iraq Blackwell, \nOxford \n \nGupta A 1998 Postcolonial Developments Duke University Press, Durham \n 44 \n \nGupta A and Ferguson J eds 1997 Anthropological locations: boundaries and \nlocations of a field science University of California Press, Berkeley \n \nGwynne R 2003 Transnational Capitalism and Local Transformation in Chile \nTijdschrift voor Economische en Sociale Geografie 94:3 310-321 \n \nHaas P M 1992 Introduction: Epistemic communities and International Policy \nCoordination International Organization  46, 1 1-35 \n \nHajer M 1995 The politics of environmental discourse: ecological \nmodernization and the policy process  Claredon Press: Oxford \n \nHarriss J 2002 Depoliticizing Development: the World Bank and Social Capital  \nAnthem: London \n \nHenry L, Mohan G and Yanacoplous H (2004) Networks as transnational \nagents of development Third World Quarterly 25:5 839-855 \n \nHughes A 2001 Global commodity networks, ethical trade and governmentality: \norganizing business responsibility in the Kenyan cut flower industry \nTransactions of the Institute of British Geographers 26:4 390-406 \n \n 45 \nJenkins R 2002 The emergence of the governance agenda: sovereignty, neo-\nliberal bias and the politics of international development in Desai V and Potter \nR eds The Companion to Development Studies  Arnold, London 485-489 \n \nJoshi A and Moore M 2000 Enabling Environments: Do Anti-Poverty \nProgrammes Mobilise the Poor?  The Journal of Development Studies 37, 1 25-\n56 \n \nJoyce P 2003 The rule of freedom: liberalism and the modern city Verso, \nLondon \n \nKaldor M 2003 Global Civil Society: An Answer to War.  Polity Press: \nCambridge. \n \nKearney M 2000 Transnational Oaxacan indigenous identity: the case of the \nMixtecs and Zapotecs Identities 7 173-95 \n \nKeck M E and Sikkink K 1998 Activists beyond borders: advocacy networks in \ninternational politics.  Ithaca, NY: Cornell University Press \n \nKing A 2004 Spaces of Global Cultures: Architecture, Urbanism, Identity \nRoutledge, London \n \nKothari U forthcoming From colonialism to development: continuities and \ndivergences Journal of Commonwealth and Comparative Politics \n 46 \n \nLaw J and Hassard J eds 1999 Actor Network Theory and After.  Blackwell, \nOxford. \n \nLester A 2002 Constructing Colonial Discourse: Britain, South Africa and \nEmpire in the Nineteenth Century in Blunt A and McEwan C eds Postcolonial \nGeographies Continuum, London 29-45 \n \nLoomba A and Kaul S 1994 Location, culture, postcoloniality Oxford Literary \nReview 16, 3-30. \n \nMassey D 1991 A global sense of place in Daniels S and Lee R eds Exploring \nHuman Geography: A Reader.  Arnold, London 237-245 \n \nMassey D  2005  For Space.  Routledge, London \n \nMawdsley E, Townsend J G, Porter G and Oakley P (2002) Knowledge, \nPower and Development Agendas: NGOs North and South INTRAC, Oxford \n \nMcEwan C 2001 Postcolonialism, feminism and development: intersections and \ndilemmas Progress in Development Studies 1, 2 93-111 \n \nMcEwan C 2003 Material Geographies and Postcolonialism Singapore Journal \nof Tropical Geography 24, 3 340-355 \n \n 47 \nMcFarlane C 2004 Geographical imaginations and spaces of political \nengagement: examples from the Indian Alliance.  Antipode 36, 5 890-916 \n \nMercer C 2004 Engineering civil society: ICT in Tanzania Review of African \npolitical economy 31, 99 49-64 \n \nMerlingen M 2003 Governmentality: Towards a Foucauldian Framework for the \nStudy of IGOs Cooperation and Conflict: Journal of the Nordic International \nStudies Association 38:4 361-384 \n \nMohan G 2002 Participatory development in Desai V and Potter R The \nCompanion to Development Studies. Arnold, London 49-53. \n \nMohan G and Stokke K 2000 Participatory development and empowerment: the \nconvergence around civil society and the dangers of localism.  Third World \nQuarterly, 21, 2 247-268 \n \nMohapatra B N 2003 Civil society and governance: from the vantage point of \nthe pavement dwellers of Mumbai In Tandon R and Mohanty R eds Does Civil \nSociety Matter?  Governance in Contemporary India  285-314.  Sage: London. \n \nMurray C 2002 Rural Livelihoods in Desai V and Potter R eds The Companion \nto Development Studies  Arnold, London 151-154 \n \n 48 \nParnwell M and Rigg J 2001 Global dissatisfactions: globalisation, resistance \nand compliance in Southeast Asia Singapore Journal of Tropical Geography \n22:3 205-11 \n \nPatel S and Mitlin D 2001 The work of SPARC, the National Slum Dwellers \nFederation and Mahila Milan.  International Institute for Environment and \nDevelopment (IIED): Poverty Reduction in Urban Areas Series, Working Paper \n5.  IIED: London. \n \nPatel S and Mitlin D 2002 Sharing experiences and changing lives.  Community \nDevelopment Journal  37, 2 125-136. \n \nPeet R and Watts M.W eds 1996 Liberation Ecologies: Environment, \nDevelopment, Social Movements Routledge, London \n \nPerreault T 2001 Developing identities: indigenous mobilization, rural \nlivelihoods, and resource access in Ecuadorian Amazonia Ecumene 8, 4 381-413 \n \nPieterse J N 1998 My paradigm or yours? Alternative development, post-\ndevelopment, reflexive development.  Development and Change 29: 2 343-373 \n \nPieterse J N 2001 Development Theory: Deconstructions\/Reconstructions.  \nSage, London. \n \nPower M 2003 Rethinking Development Geographies.  Routledge, London \n 49 \n \nPrakash G 1999 Another reason: science and the imagination of modern India \nPrinceton University Press, Princeton \n \nPrakash G 2002 Rough Transcript of ‘The Urban Turn’: Panel Discussion at \nthe Bombay Paperie.  PUKAR, Mumbai. \n \nRisse-Kappen T ed 1995 Bringing Transnational Relations Back-In: Non-State \nActors, Domestic Structures and International Institutions.  Cambridge \nUniversity Press, Cambridge \n \nRobinson J 2003 Postcolonialising geography: tactics and pitfalls Singapore \nJournal of Tropical Geography 24, 3 272-289 \n \nRocheleau D, Ross L, Morrobel J, Malaret L, Hernandez R, and Kominiak \nT 2001 Complex communities and emergent ecologies in the regional agroforest \nof Zambrana-Chacuey, Dominican Republic Ecumene 8, 4 465-492 \n \nRoutledge P 2001 'Our resistance will be as transnational as capital': \nConvergence space and strategy in globalising resistance  Geojournal.  52:1 37-\n44. \n \nSabatier P 1998 The Advocacy Coalition Framework: Revisions and Relevance \nfor Europe.  Journal of European Public Policy, 5, 98-130. \n \n 50 \nSaid E 1978 Orientalism: Western Conceptions of the Orient Penguin, London \n \nSaid E 1984 The world, the text and the critic.  Faber and Faber, London \n \nSaid E 1993 Culture and Imperialism.  Chatto and Windus, London \n \nSanyal B and Mukhija V 2001 Institutional pluralism and housing delivery: a \ncase of unforeseen conflicts in Mumbai, India.  World Development, 29:12 2043-\n2058 \n \nSidaway J D 2000 Postcolonial geographies: an exploratory essay Progress in \nHuman Geography 24, 4 591-612 \n \nSimon D 2003 Dilemmas of development and the environment in a globalizing \nworld: theory, policy and praxis Progress in Development Studies 3:1 5-41 \n \nSpivak G C 1988 Can the subaltern speak? in Nelson C and Grossberg L eds \nMarxism and the Interpretation of Culture 271-313 \n \nSpivak G C 1990 The Postcolonial Critic: Interviews, Strategies, Dialogue \nRoutledge, London \n \nSpivak G C 1993 Outside in the Teaching Machine Routledge, London \n \n 51 \nSpivak G C 1999 A critique of postcolonial reason Harvard University Press, \nCambridge, Mass. \n \nSpivak G C 2005 Death of a Discipline  Columbia University Press: New York. \n \nStone D 2003 The „Knowledge Bank‟ and the Global Development Network \nGlobal Governance 9 43-61 \n \nThompson G F 2004 Between hierarchies and markets: the logic and limits of \nnetwork forms of organization. \n \nUnwin T 2004 ICT and education in Africa: partnership, practice and knowledge \nReview of African political economy 31, 99 150-160  \n \nWoost M 1997 Alternative vocabularies of development? „Community‟ and \n„participation‟ in development discourse in Sri Lanka in Grillo R D and Stirrat \nR L eds Discourses of Development. Berg, Oxford \n \n \n \n                                                          \ni\n  Notable exceptions include Keck and Sikkink's (1998) study of transnational advocacy networks, an \nattempt to show how counter-hegemonic networks can be useful in bringing different groups together, \nand Bebbington and Batterbury‟s (2001) and Mawdsley's et al's (2001) work on transnational funding \nnetworks, to highlight just a few.  Rather than exploring the different theoretical approaches to \nnetworks, such as transnational governmental networks (Risse-Kappen, 1995), epistemic communities \n(Haas, 1992), advocacy coalitions (Sabatier, 1998), discourse coalitions (Hajer, 1998), transnational \nadvocacy networks (Keck and Sikkink, 1998), global civil society networks (Kaldor, 2003), actor-\nnetwork theory (Law and Hassard, 1999), transnational governmentality (Ferguson and Gupta, 1998), \netc., my focus here is to explore the possible dialogue between development and postcolonial \napproaches to transnational development networks.    \n"}