{"doi":"10.1136\/bmj.b3532","coreId":"217830","oai":"oai:eprints.lse.ac.uk:32714","identifiers":["oai:eprints.lse.ac.uk:32714","10.1136\/bmj.b3532"],"title":"Economic evaluation of arthritis self management in primary care","authors":["Patel, Anita","Buszewicz, Marta","Beecham, Jennifer","Griffin, Mark","Rait, Greta","Nazareth, Irwin","Atkinson, Angela","Barlow, Julie","Haines, Andy"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-09-22","abstract":"Objective To assess the cost effectiveness of a self management programme plus education booklet for arthritis in primary care. \\ud\n\\ud\nDesign Cost effectiveness and cost utility analysis from health and social care and societal perspectives alongside a randomised controlled trial. \\ud\n\\ud\nSetting 74 general practices in the United Kingdom. \\ud\n\\ud\nParticipants 812 patients aged 50 or more with osteoarthritis of the hips or knees, or both, and pain or disability, or both. \\ud\n\\ud\nInterventions Randomisation to either six sessions of an arthritis self management programme plus an education booklet (intervention group) or the education booklet alone (standard care control group). \\ud\n\\ud\nMain outcome measures Total health and social care costs and total societal costs at 12 months; cost effectiveness (incremental cost effectiveness ratios and cost effectiveness acceptability curves) on basis of quality of life (SF-36, primary outcome measure), EuroQol visual analogue scale, and quality adjusted life years (QALYs). \\ud\n\\ud\nResults At 12 months health and social care costs in the intervention group were £101 higher (95% confidence interval £3 to £176) than those in the control group because the additional costs of the arthritis self management programme did not seem to be fully offset by savings elsewhere. There were no significant differences in societal costs (which were up to 13 times the size of health and social care costs) or any of the outcomes. From the health and social care perspective the intervention was dominated by the control on the basis of QALYs (which were non-significantly lower in the intervention group) and had incremental cost effectiveness ratios between £279 and £13 473 for the other outcomes. From the societal perspective the intervention seemed superior to the control owing to non-significantly lower costs and non-significantly better outcomes on all measures except QALYs. Probabilities of the arthritis self management programme’s cost effectiveness ranged between 12% and 97% (for thresholds ranging £0 to £1000) based on one point improvements in SF-36 outcomes, but the clinical significance of this is debatable. Probabilities of cost effectiveness on the basis of the visual analogue scale and QALYs were low. \\ud\n\\ud\nConclusions Cost effectiveness of an arthritis self management programme is not suggested on the basis of current National Institute for Health and Clinical Excellence cost perspectives and QALY thresholds. The probability of cost effectiveness is greater when broader costs and other quality of life outcomes are considered. These results suggest that the cost effectiveness of the Department of Health’s expert patients programme cannot be assumed across all clinical conditions and that further rigorous evaluations for other conditions may be needed","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/217830.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/32714\/1\/Economic%20evaluation%20of%20arthritis%20self%20management%20in%20primary%20%28lsero%29.pdf","pdfHashValue":"f73c9657d1c5efcbd7d05a01155cd13e15509d39","publisher":"BMJ Publishing Group","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:32714<\/identifier><datestamp>\n      2012-08-14T10:24:41Z<\/datestamp><setSpec>\n      74797065733D43454E54524553:4C53455F52435F3536<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/32714\/<\/dc:relation><dc:title>\n        Economic evaluation of arthritis self management in primary care<\/dc:title><dc:creator>\n        Patel, Anita<\/dc:creator><dc:creator>\n        Buszewicz, Marta<\/dc:creator><dc:creator>\n        Beecham, Jennifer<\/dc:creator><dc:creator>\n        Griffin, Mark<\/dc:creator><dc:creator>\n        Rait, Greta<\/dc:creator><dc:creator>\n        Nazareth, Irwin<\/dc:creator><dc:creator>\n        Atkinson, Angela<\/dc:creator><dc:creator>\n        Barlow, Julie<\/dc:creator><dc:creator>\n        Haines, Andy<\/dc:creator><dc:subject>\n        RA Public aspects of medicine<\/dc:subject><dc:description>\n        Objective To assess the cost effectiveness of a self management programme plus education booklet for arthritis in primary care. \\ud\n\\ud\nDesign Cost effectiveness and cost utility analysis from health and social care and societal perspectives alongside a randomised controlled trial. \\ud\n\\ud\nSetting 74 general practices in the United Kingdom. \\ud\n\\ud\nParticipants 812 patients aged 50 or more with osteoarthritis of the hips or knees, or both, and pain or disability, or both. \\ud\n\\ud\nInterventions Randomisation to either six sessions of an arthritis self management programme plus an education booklet (intervention group) or the education booklet alone (standard care control group). \\ud\n\\ud\nMain outcome measures Total health and social care costs and total societal costs at 12 months; cost effectiveness (incremental cost effectiveness ratios and cost effectiveness acceptability curves) on basis of quality of life (SF-36, primary outcome measure), EuroQol visual analogue scale, and quality adjusted life years (QALYs). \\ud\n\\ud\nResults At 12 months health and social care costs in the intervention group were £101 higher (95% confidence interval £3 to £176) than those in the control group because the additional costs of the arthritis self management programme did not seem to be fully offset by savings elsewhere. There were no significant differences in societal costs (which were up to 13 times the size of health and social care costs) or any of the outcomes. From the health and social care perspective the intervention was dominated by the control on the basis of QALYs (which were non-significantly lower in the intervention group) and had incremental cost effectiveness ratios between £279 and £13 473 for the other outcomes. From the societal perspective the intervention seemed superior to the control owing to non-significantly lower costs and non-significantly better outcomes on all measures except QALYs. Probabilities of the arthritis self management programme’s cost effectiveness ranged between 12% and 97% (for thresholds ranging £0 to £1000) based on one point improvements in SF-36 outcomes, but the clinical significance of this is debatable. Probabilities of cost effectiveness on the basis of the visual analogue scale and QALYs were low. \\ud\n\\ud\nConclusions Cost effectiveness of an arthritis self management programme is not suggested on the basis of current National Institute for Health and Clinical Excellence cost perspectives and QALY thresholds. The probability of cost effectiveness is greater when broader costs and other quality of life outcomes are considered. These results suggest that the cost effectiveness of the Department of Health’s expert patients programme cannot be assumed across all clinical conditions and that further rigorous evaluations for other conditions may be needed.<\/dc:description><dc:publisher>\n        BMJ Publishing Group<\/dc:publisher><dc:date>\n        2009-09-22<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/32714\/1\/Economic%20evaluation%20of%20arthritis%20self%20management%20in%20primary%20%28lsero%29.pdf<\/dc:identifier><dc:identifier>\n          Patel, Anita and Buszewicz, Marta and Beecham, Jennifer and Griffin, Mark and Rait, Greta and Nazareth, Irwin and Atkinson, Angela and Barlow, Julie and Haines, Andy  (2009) Economic evaluation of arthritis self management in primary care.  British Medical Journal, 339.  b3532.  ISSN 0959-8138     <\/dc:identifier><dc:relation>\n        http:\/\/www.bmj.com\/<\/dc:relation><dc:relation>\n        10.1136\/bmj.b3532<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/32714\/","http:\/\/www.bmj.com\/","10.1136\/bmj.b3532"],"year":2009,"topics":["RA Public aspects of medicine"],"subject":["Article","PeerReviewed"],"fullText":"  \nAnita Patel, Marta Buszewicz, Jennifer Beecham, Mark \nGriffin, Greta Rait, Irwin Nazareth, Angela Atkinson, Julie \nBarlow and Andy Haines \nEconomic evaluation of arthritis self \nmanagement in primary care \n \nArticle (Published version) \n(Refereed) \n \nOriginal citation: \nPatel, Anita and Buszewicz, Marta and Beecham, Jennifer and Griffin, Mark and Rait, Greta and \nNazareth, Irwin and Atkinson, Angela and Barlow, Julie and Haines, Andy (2009) Economic \nevaluation of arthritis self management in primary care. British medical journal, 339. b3532. \nDOI: 10.1136\/bmj.b3532 \n \n© © 2009 BMJ Publishing Group Ltd. \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/32714\/ \nAvailable in LSE Research Online: August 2012 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \nRESEARCH\nEconomic evaluation of arthritis selfmanagement in primary\ncare\nAnita Patel, senior lecturer,1 Marta Buszewicz, senior lecturer,2 Jennifer Beecham, principal research fellow,3\nprofessor of health and social care economics,4 Mark Griffin, lecturer,2 Greta Rait, senior clinical lecturer,2,5\nIrwin Nazareth, professor,2,5 Angela Atkinson, clinical trial officer,6 Julie Barlow, professor of health\npsychology, research director,7 Andy Haines, director, professor of public health and primary care8\nABSTRACT\nObjective To assess the cost effectiveness of a self\nmanagement programme plus education booklet for\narthritis in primary care.\nDesign Cost effectiveness and cost utility analysis from\nhealth and social care and societal perspectives\nalongside a randomised controlled trial.\nSetting 74 general practices in the United Kingdom.\nParticipants 812 patients aged 50 or more with\nosteoarthritis of the hips or knees, or both, and pain or\ndisability, or both.\nInterventions Randomisation to either six sessions of an\narthritis self management programme plus an education\nbooklet (intervention group) or the education booklet\nalone (standard care control group).\nMain outcome measures Total health and social care\ncosts and total societal costs at 12 months; cost\neffectiveness (incremental cost effectiveness ratios and\ncost effectiveness acceptability curves) on basis of\nquality of life (SF-36, primary outcomemeasure), EuroQol\nvisual analogue scale, and quality adjusted life years\n(QALYs).\nResults At 12 months health and social care costs in the\nintervention group were £101 higher (95% confidence\ninterval £3 to £176) than those in the control group\nbecause the additional costs of the arthritis self\nmanagement programme did not seem to be fully offset\nby savings elsewhere. There were no significant\ndifferences in societal costs (which were up to 13 times\nthe size of health and social care costs) or any of the\noutcomes. From the health and social care perspective\nthe intervention was dominated by the control on the\nbasis of QALYs (which were non-significantly lower in the\nintervention group) and had incremental cost\neffectiveness ratios between £279 and £13473 for the\nother outcomes. From the societal perspective the\nintervention seemed superior to the control owing to non-\nsignificantly lower costs and non-significantly better\noutcomes on all measures except QALYs. Probabilities of\nthe arthritis self management programme’s cost\neffectiveness ranged between 12% and 97% (for\nthresholds ranging £0 to £1000) based on one point\nimprovements in SF-36 outcomes, but the clinical\nsignificance of this is debatable. Probabilities of cost\neffectiveness on the basis of the visual analogue scale\nand QALYs were low.\nConclusions Cost effectiveness of an arthritis self\nmanagement programme is not suggested on the basis of\ncurrent National Institute for Health and Clinical\nExcellence cost perspectives and QALY thresholds. The\nprobability of cost effectiveness is greater when broader\ncosts and other quality of life outcomes are considered.\nThese results suggest that the cost effectiveness of the\nDepartment of Health’s expert patients programme\ncannot be assumed across all clinical conditions and that\nfurther rigorous evaluations for other conditions may be\nneeded.\nTrial registration Current Controlled Trials\nISRCTN79115352.\nINTRODUCTION\nOsteoarthritis is one of the most common forms of\narthritis, with at least 4.4 million people in the United\nKingdom experiencing moderate or severe disease.1\nArthritis is one of the biggest causes of disability, cost-\ning the National Health Service and social services\naround £5.5bn ($9.1bn; €6.2bn) per annum and lead-\ning to 206 million lost working days in 1999-2000.2\nThe condition is the second most common cause for\ndays off work. An ageing population and longer work-\ning lives are likely to lead to increases in these societal\nimpacts.\nEvaluations of arthritis self management pro-\ngrammes in the United States suggest that these rela-\ntively inexpensive interventions can lead to a range of\npatient centred benefits and reductions in healthcare\nuse. Although such studies provided the initial evi-\ndence base for England’s expert patients programme,\nthey provided limited evidence of cost effectiveness\nand had important methodological weaknesses.3 4\nWe assessed the cost effectiveness of a self manage-\nment programme for arthritis compared with usual\ncare within a large randomised trial based in UK pri-\nmary care, using high quality and rigorous methodol-\nogies that would give meaningful results for both\nclinicians and health policy planners.\n1Centre for the Economics of\nMental Health, Institute of\nPsychiatry, King’s College London,\nLondon SE5 8AF\n2Research Department of Primary\nCare and Population Health,\nUniversity College London School\nof Life and Medical Sciences\n3Personal Social Services\nResearch Unit, London School of\nEconomics and Political Science\n4Personal Social Services\nResearch Unit, University of Kent,\nCanterbury, Kent\n5MRC General Practice Research\nFramework, London\n6North East Stroke Research\nNetwork, James Cook University\nHospital, Middlesbrough\n7Self-management Programme,\nApplied Research Centre in Health\nand Lifestyle Interventions,\nFaculty of Health and Life\nSciences, Coventry University\n8London School of Hygiene and\nTropical Medicine\nCorrespondence to: A Patel\nanita.patel@iop.kcl.ac.uk\nCite this as: BMJ 2009;339:b3532\ndoi:10.1136\/bmj.b3532\nBMJ | ONLINE FIRST | bmj.com page 1 of 9\nMETHODS\nFull details of the study have been described\nelsewhere.5 Briefly, 812 patients aged 50 or more and\nwith osteoarthritis of the hips, knees, or both, and pain\nor disability, or both, were recruited from 74 primary\ncare practices across the UK. The patients were rando-\nmised to receive either six sessions of an arthritis self\nmanagement programme plus an education booklet\n(intervention group) or the education booklet alone\n(control group). The self management programme\nwas based on an existing course (ChallengingArthritis)\nprovided by the voluntary organisationArthritis Care.\nThe booklet was designed for the study and incorpo-\nrated information available to the public fromArthritis\nCare and the Arthritis Research Campaign. This\nreflects standard primary care, where giving written\ninformation is common practice.\nThe economic evaluation was undertaken from two\nperspectives: health and social care and societal. It\nfocused on longer term cost effectiveness at the\n12 month follow-up, although mean costs and out-\ncomes at four months are also reported. Although the\narthritis self management programme in this trial was\nprovided outside the health and social care sector, we\nincluded it as a healthcare cost because theNHS is cur-\nrently funding the implementation of such inter\nventions.6\nData collection\nAn adapted version of the client service receipt inven-\ntory was used to collect economic data at individual\nlevel,7 8 administered as a self completion question-\nnaire alongside the other outcome measures at the\nbaseline assessment before randomisation (in the gen-\neral practice) and at the four month and 12 month fol-\nlow-up (both by post). It focused on arthritis related\nresource use for the previous three months and, along-\nside personal characteristics, covered income and\nemployment status; use of health and social care\nresources (drugs and hospital and community based\nhealth and social care); costs borne by participants,\ntheir family, and friends (out of pocket expenses, lost\npay, and informal care); indirect impacts (time offwork\nfor participants and carers); and receipt of social secur-\nity benefits.\nUnit costs\nTo obtain three month costs for each participant at\neach assessment point we applied unit costs (see web\nextra on bmj.com) to data on resource use at individual\nlevel as recorded on the client service receipt inven-\ntory.Weused estimates for national unit costs to reflect\nthe fact that the study samplewas drawn frompractices\naround the UK and to facilitate generalisation of the\nfindings.\nWeestimated theunit cost of the arthritis selfmanage-\nment programme as an average cost per patient using a\ntop-down approach in the absence of detailed informa-\ntion on the resources and costs absorbed by the pro-\ngramme. This estimate was based on rates paid by the\ntrial to Arthritis Care for running the courses. Of 406\nparticipants in the intervention group, seven could not\nbe found places on a course in their area. For the 399\noffered a place, £65 780 was paid to Arthritis Care; an\naverage cost of £164.86 per participant. This cost cov-\nered the course of six sessions, regardless of how many\nsessionswere attended.Wedescribe sensitivity analyses\nto explore the potential implications of this costing\napproach.The educationbooklet reflects standardprac-\ntice in primary care and we assumed its costs to be\nincluded within our cost estimates for primary care.\nCosts are reported in pounds sterling and are standar-\ndised to 2002-3 rates (the most recent available set of\nunit costs after the study ended) using, as appropriate,\nthe NHS Executive’s hospital and community health\nservices inflation index or the personal social services\ninflation index.9 Approximations of 2007-8 rates can\nbe made by multiplying costs by 1.2 (the inflation rate\nfor hospital and community health services pay and\nprices9). It was not necessary to discount costs or out-\ncomes as the evaluation covered only one year.\nOutcomes\nThe primary outcomes were the summary scores for\nthe physical and mental health components of the\nshort form health survey (SF-36).10 For the economic\nevaluation we also included the visual analogue scale\nand the five dimensional health state description of the\nEuroQol, the EQ-5D.11 All outcome measures were\nadministered as self completion questionnaires during\nattendance for the baseline assessment and by post at\nthe four and 12 month follow-ups. We applied utility\nweights from a UK general population survey12 to the\nEQ-5Dhealth states to calculate utility values andqual-\nity adjusted life years (QALYs). QALYs were calcu-\nlated using the total area under the curve approach,\nwith linear interpolation between assessment points\nand baseline adjustment for comparisons.13 To calcu-\nlate total QALYs for the one year follow-up period we\nsummed the QALYs at four months (representing the\nperiod between the baseline and four month assess-\nment) and at 12 months (representing the period\nbetween the four month and 12 month assessment).\nAnalyses\nData were double entered and analysed using SPSS for\nWindows Release 11.0.1 and Stata 8.2 for Windows.\nData on resource use from the client service receipt\ninventory formed the basis of the total cost calculation\nfor each participant. If no report existed on the use of a\nparticular resource on returned inventories, we\nassumed that it was not used. If participants reported\non a resource but not the quantity used, we imputed\nthis from within group means for participants with\ndata for that item at the same assessment point. After\nthis imputation for specific missing items we carried\nout inventory related analyses on available cases—\nthat is, we excluded those with completely missing\ninventory data. Similarly, all five components of the\nEQ-5D are required to compute utilities and QALYs\nRESEARCH\npage 2 of 9 BMJ | ONLINE FIRST | bmj.com\nused in the economic evaluation. We imputed missing\nEQ-5D components (where up to four of the five pos-\nsible dimensions were missing) for seven of 630 (1.1%)\ncases at four months and seven of 599 (1.2%) cases at\n12months using the last value carried forwardmethod\nbecause integers are needed in the application of utility\nweights. We then carried out EQ-5D related analyses\non available cases after this imputation.\nHealth and social care costs included the costs of\nhealth care, social care, and drugs. Societal costs were\ncalculated as these health and social care costs plus the\ncosts of informal care, social security benefit receipts,\nand out of pocket expenses of participants and their\nfamilies and friends, lost pay, and time off work.\nCosts and outcomes are reported as mean values\nwith standard deviations. Mean differences between\ngroups and 95% confidence intervals were obtained\nby bootstrap regressions (5000 replications). The base-\nline value of the relevant itemwas added as a covariate\nfor all comparisons of costs and outcomes at four and\n12 months.\nWeassessed cost effectiveness using cost effectiveness\nacceptability curves. For each participant we calculated\nthe netmonetary benefit for a range ofmonetary values\nand presented the bootstrapped data graphically.14 The\nresulting curves show theprobability of the intervention\nbeing cost effective comparedwith standard care for the\nselected range of monetary values. We calculated cost\neffectiveness acceptability curves for each of the four\noutcome measures from both cost perspectives. Incre-\nmental cost effectiveness ratios are also reported where\nboth costs and outcomes were higher for either group.\nFor both approaches to assess cost effectiveness, we\nextrapolated costs at the 12month follow-up (represent-\ning a retrospective three month period) to a one year\nperiod (that is, multiplied by four) to match the period\nreflected by the QALY data, under the assumption that\nthese economic impacts were constant over the assess-\nment period.\nSensitivity analyses\nAs the base case evaluation excluded cases without\noutcome data for the relevant analysis we assessed\nthe impact of missing outcomes at four months and\n12 months by imputing full samples. We did this by\nusing the same hot decking and multiple imputation\nprocedure (SOLAS ForMissingData Analysis version\n3.2; Statistical Solutions) used elsewhere for the analy-\nsis of main study outcomes.5\nWe also undertook eight one way sensitivity ana-\nlyses to assess the impact of various cost assumptions\non the total health and social care and societal costs at\n12 months. Firstly, we examined the impact of cost\ndata being missing by imputing total costs using the\nhot decking procedure andmultiple imputation proce-\ndure. We compared alternative cost effectiveness\nratios on the basis of these imputed full sample costs\nand outcomes with the base case ratios.\nSecondly, within the intervention group the base\ncase evaluation includes 129 (32%) participants who\nfailed to attend any session of the arthritis self manage-\nment programme and a further 58 (14%) who attended\nonly 1-3 sessions. Thus, nearly half did not receive a\nclinically significant “dose,” defined as attending four\nTable 1 | Resource use at four months (for previous three month period) by patients assigned to an arthritis self management programme plus education\nbooklet or the education booklet only (usual care, control)\nResource Unit\nIntervention group Control group\nValid No Mean (SD) Valid No Mean (SD)\nHospital based services:\nAdmissions Nights 286 0.04 (0.5) 314 0.20 (1.5)\nOutpatients Appointments 286 0.17 (0.6) 312 0.21 (0.6)\nAccident and emergency Visits 286 0.02 (0.2) 314 0.03 (0.2)\nPhysiotherapy Visits 284 0.26 (1.0) 304 0.19 (1.0)\nOccupational therapy Visits 288 0.07 (0.4) 319 0.03 (0.2)\nCommunity based services:\nGeneral practitioner Surgery visits 278 0.90 (1.4) 292 0.94 (1.3)\nGeneral practitioner Home visits 289 0.02 (0.1) 323 0.04 (0.4)\nGeneral practitioner Telephone calls 288 0.08 (0.5) 319 0.10 (0.5)\nPractice nurse Surgery visits 282 0.21 (0.7) 313 0.27 (0.9)\nPractice nurse Telephone calls 293 0.03 (0.2) 321 0.01 (0.1)\nRepeat prescription without general practitioner contact Requests 236 1.36 (1.8) 251 1.43 (1.5)\nMeals on wheels Meals 292 0 324 0.28 (5.0)\nHome help Visits 292 0.29 (3.6) 319 0.53 (5.2)\nSocial worker Visits 293 0.02 (0.2) 322 0.02 (0.2)\nSocial worker Telephone calls 292 0.01 (0.1) 323 0.07 (0.6)\nPhysiotherapist Home visits 293 0.03 (0.4) 319 0.04 (0.7)\nPhysiotherapist Surgery or clinic visits 281 0.29 (1.2) 297 0.26 (1.0)\nOccupational therapist Home visits 290 0.01 (0.1) 321 0.02 (0.2)\nInformal care:\nTotal care per average week Hours 294 5.80 (11.4) 327 7.1 (14.5)\nRESEARCH\nBMJ | ONLINE FIRST | bmj.com page 3 of 9\nor more sessions.15 Therefore the second sensitivity\nanalysis was a per protocol analysis of costs based on\nthose who attended four or more sessions.\nThe final six sensitivity analyses dealt with the aver-\nage price charged to the trial by Arthritis Care as the\nunit cost of the arthritis self management programme.\nThis price may not reflect the true economic cost per\npatient. For example, many of the activities of Arthritis\nCare are carried out by volunteers and the cost of their\ntime is not included in the price. Moreover, the unit\ncost did not account for the number of sessions\nattended by each participant or the number present at\neach session. To deal with the various factors that\nwould lead to an under-estimation or over-estimation,\nwe varied the cost of the self management programme\nby 20%, 35%, and 50% both upwards and downwards.\nRESULTS\nResponse rates for the client service receipt inventory\nwere 94% (n=765) at baseline, 77% (n=622) at four\nmonths, and 73% (n=595) at 12 months and were\nbalanced between the intervention and control groups.\nCorresponding response rates for the EQ-5D were\n94% (n=766), 78% (n=630), and 74% (n=599), which\nwere also balanced between the groups.\nResource use\nEvidence from the US on the purported economic\nadvantages of self management interventions is com-\nmonly restricted to general practitioner visits, outpati-\nent visits, and inpatient days.3 16 Utilisation rates for\nthese services did not differ between the groups at\nbaseline. At four months, general practitioner visits\nand outpatient visits remained similar (table 1), but\nfewer people in the intervention group (1.4% v 2.9%)\nhad an inpatient stay, resulting in lower average inpa-\ntient days (table 1). A similar pattern was seen at\n12 months (table 2). However, in both groups the\ntrend was towards a reduction in general practitioner\nvisits and an increase in outpatient visits compared\nwith baseline. Hours spent on informal care were simi-\nlar at all assessment points.\nCosts\nAtbaseline, health and social care costs or societal costs\ndid not differ between the groups (table 3). At four\nmonths the intervention group had significantly higher\ncosts frombothperspectives. This is likely tobe adirect\nconsequence of the arthritis self management pro-\ngramme because when the costs of the programme\nwere excluded a cost saving occurred in health and\nsocial care costs but no difference in societal costs.\nHealth and social care costs in the intervention\ngroup at 12months were £101 higher (95% confidence\ninterval £3 to £176) than those in the control group.\nWhen the cost of the self management programme\nwas reduced by between 20% and 50% in sensitivity\nanalyses this difference became non-significant. Socie-\ntal costs at 12 months were numerically, but not statis-\ntically, lower in the intervention group. This\nconclusion remained unchanged in all sensitivity ana-\nlyses.\nAlthough previous economic evaluations of self\nmanagement interventions have focused on healthcare\nTable 2 | Resource use at 12 months (for previous three month period) by patients assigned to an arthritis self management programme plus education\nbooklet or the education booklet only (usual care, control)\nResource Unit\nIntervention group Control group\nValid No Mean (SD) Valid No Mean (SD)\nHospital based services:\nAdmissions Nights 275 0.11 (1.1) 301 0.52 (4.3)\nOutpatients Appointments 273 0.28 (0.7) 300 0.26 (0.9)\nAccident and emergency Visits 274 0.02 (0.2) 301 0.04 (0.2)\nPhysiotherapy Visits 263 0.29 (1.1) 283 0.18 (0.7)\nOccupational therapy Visits 272 0.08 (0.6) 297 0.06 (0.5)\nCommunity based services:\nGeneral practitioner Surgery visits 255 0.85 (1.2) 280 0.90 (1.5)\nGeneral practitioner Home visits 279 0.01 (0.1) 298 0.02 (0.2)\nGeneral practitioner Telephone calls 276 0.08 (0.4) 296 0.11 (0.5)\nPractice nurse Surgery visits 268 0.19 (0.9) 290 0.20 (0.9)\nPractice nurse Telephone calls 277 0.01 (0.1) 299 0.02 (0.2)\nRepeat prescription without general practitioner contact Requests 223 1.46 (1.7) 245 1.62 (1.8)\nMeals on wheels Meals 278 0.01 (0.2) 298 0\nHome help Visits 277 0.85 (11.0) 295 0.57 (5.8)\nSocial worker Visits 278 0.03 (0.3) 297 0.05 (0.3)\nSocial worker Telephone calls 278 0.06 (0.5) 296 0.06 (0.5)\nPhysiotherapist Home visits 277 0.01 (0.1) 299 0.05 (0.5)\nPhysiotherapist Surgery or clinic visits 258 0.30 (1.4) 281 0.21 (0.9)\nOccupational therapist Home visits 277 0.01 (0.1) 298 0.06 (0.5)\nInformal care:\nTotal care per average week Hours 285 7.15 (12.9) 310 9.53 (19.5)\nRESEARCH\npage 4 of 9 BMJ | ONLINE FIRST | bmj.com\ncosts, and often for a limited range of services, health-\ncare costs formed a small proportion of societal costs\n(7% at baseline). The largest single cost was social\nsecurity benefits, at 44% of societal costs at baseline.\nAlthough benefits are often seen as a transfer cost,\nthey represent high costs to the state. Costs borne by\nparticipants and their family and friends absorbed 37-\n46% of societal costs at each assessment point; mostly\ninformal care. Costs for lost productivity were mini-\nmal, as most participants were not employed.\nTable 3 | Costs (£, 2002-3, three month periods), in base case and sensitivity analysis scenarios\nVariables\nIntervention Control Intervention−control; mean\ndifference* (95% CI)Valid No Mean (SD) Valid No Mean (SD)\nArthritis self management programme 406 162 (21) 406 0 162 (−160 to −164)\nHealth and social care costs excluding self management programme:\nBaseline 384 82 (136) 381 84 (138) −1 (−21 to 18)\n4 months 295 84 (144) 327 115 (282) −33 (−69 to −0.1)\n12 months 285 112 (240) 310 172 (717) −61 (−159 to 14)\nCosts to patient, family, and friends:\nBaseline 384 510 (1472) 381 537(1075) −26 (−199 to 171)\n4 months 294 479 (1073) 327 453 (845) 22 (−119 to 163)\n12 months 285 452 (731) 310 581(1094) −129 (−270 to 25)\nIndirect costs†:\nBaseline 384 13 (113) 381 43 (361) −30 (−70 to 2)\n4 months 295 15 (148) 327 20 (228) 2 (−22 to 27)\n12 months 285 48 (469) 310 35 (318) 22 (−45 to 95)\nSocial security benefits:\nBaseline 384 490 (614) 381 510 (633) −19 (−108 to 66)\n4 months 295 620 (690) 327 545(628) 74 (−17 to 160)\n12 months 285 668 (609) 310 699 (783) −28 (−133 to 76)\nTotal costs, health and social care perspective:\nBaseline 384 82 (136) 381 84 (138) −1 (−21 to 18)\n4 months‡ 295 246 (146) 327 115 (282) 129 (93 to 162)\n12 months‡ 285 274 (241) 310 172 (717) 101 (3 to 176)\nTotal costs, societal perspective:\nBaseline 384 1096 (1648) 381 1173 (1509) −77 (−295 to 153)\n4 months‡ 294 1360 (1459) 327 1133 (1291) 238 (55 to 434)\n12 months‡ 285 1442 (1322) 310 1487 (1918) −26 (−277 to 229)\nSensitivity analyses on total health and social care cost at 12months‡:\nImputed full sample§ 406 259 (363) 406 183 (683) 77 (−2 to 155)\nPer protocol analysis 185 272 (234) 310 172 (717) 101 (−1 to 178)\n20% increase in ASMP cost 285 307 (242) 310 172 (717) 133 (35 to 208)\n35% increase in ASMP cost 285 331 (242) 310 172 (717) 158 (59 to 233)\n50% increase in ASMP cost 285 355 (243) 310 172 (717) 182 (84 to 257)\n20% decrease in ASMP cost 285 242 (241) 310 172 (717) 69 (−30 to 144)\n35% decrease in ASMP cost 285 218 (241) 310 172 (717) 44 (−54 to 119)\n50% decrease in ASMP cost 285 193 (240) 310 172 (717) 20 (−78 to 95)\nSensitivity analyses on total societal cost at 12 months‡:\nImputed full sample§ 406 1456 (1398) 406 1494 (1851) −34 (−270 to 202)\nPer protocol analysis 185 1421 (1319) 310 1487 (1918) −10 (−286 to 256)\n20% increase in ASMP cost 285 1475 (1322) 310 1487 (1918) 6 (−244 to 261)\n35% increase in ASMP cost 285 1499 (1322) 310 1487 (1918) 31 (−220 to 286)\n50% increase in ASMP cost 285 1523 (1322) 310 1487 (1918) 55 (−195 to 310)\n20% decrease in ASMP cost 285 1410 (1322) 310 1487 (1918) −58 (−309 to 197)\n35% decrease in ASMP cost 285 1386 (1322) 310 1487 (1918) −83 (−333 to 173)\n50% decrease in ASMP cost 285 1361 (1322) 310 1487 (1918) −107 (−358 to 149)\nASMP=arthritis self management programme.\n*Except for imputed full sample data, mean differences and confidence intervals were calculated using bootstrap regressions (5000 replications) with baseline scores as covariates for all\nvalues at four and 12 months.\n†Time off work (participants and carers).\n‡Includes cost of ASMP.\n§Missing data imputed using hot decking and multiple imputation procedures. Differences in means are adjusted for any baseline differences in costs between groups using analysis of\ncovariance, with baseline cost as covariate. Confidence intervals were calculated using standard parametric techniques.\nRESEARCH\nBMJ | ONLINE FIRST | bmj.com page 5 of 9\nOutcomes\nAt 12months no significant differenceswere shown for\nthe SF-36 summary scores, visual analogue scale, and\nQALYs (table 4). Confidence intervals suggested that\nthe intervention group had marginally lower EQ-5D\nscores at four months; this difference did not remain\nin the imputed full sample analysis. Although there\nwere some variations in mean differences for other\noutcomes computed using the available case and the\nimputed full sample approaches, the overall inter-\npretation of results did not differ.\nCost effectiveness\nThe highest probabilities of cost effectiveness were for\nthe two SF-36 outcomes from the societal perspective,\nforwhichprobabilitieswere high even at low thresholds\nof willingness to pay for extra point gains (fig 1). From\nthe health and social care perspective, however, prob-\nabilities of cost effectiveness on the basis of the mental\nhealth component exceeded 50% (that is, the inter-\nvention was more likely to the cost effective option)\nonly at willingness to pay levels of £300 or more per\npoint gain and did not exceed 50% for the physical\nhealth component for the threshold range examined.\nProbabilities of cost effectiveness on the basis of the\nvisual analogue scale did not exceed 41% from either\nperspective for the threshold range examined. Probabil-\nities of cost effectivenessbasedonQALYswere low,not\nexceeding 2% from the health and social care perspec-\ntive even at thresholds of £30000 per QALY gain and\npeaking at 20% from the societal perspective for the\nthreshold range examined (fig 2).\nThe meaningfulness of incremental cost effective-\nness ratios is unclear given the lack of statistically sig-\nnificant differences for most combinations of costs and\noutcomes. Incremental cost effectiveness ratios from\nthe health and social care perspective at 12 months\nwere £279 for the SF-36 mental health component,\nTable 4 | Outcomes, in base case and sensitivity analysis scenarios\nScenarios\nIntervention Control Adjusted difference in means (intervention−control)\nValid No Mean (SD) Valid No Mean (SD) Mean difference* (95% CI)\nImputed full sample†: mean\ndifference (95% CI)\nSF-36 physical health summary score:\nBaseline 316 25.59 (11) 317 25.35 (12) 0.24 (−1.56 to 2.03)\n4 months 234 25.98 (12) 268 25.66 (13) 0.12 (−1.48 to 1.49) 0.22 (−1.50 to 1.94)\n12 months 231 25.62 (12) 252 25.18 (12) 0.34 (−1.35 to 2.00) 0.33 (−1.31 to 1.98)\nSF-36 mental health summary score:\nBaseline 316 51.79 (11) 317 50.53 (10) 1.26 (−0.38 to 2.89)\n4 months 234 51.40 (11) 268 50.14 (11) 0.34 (−1.25 to 1.92) 0.11 (−1.18 to 1.40)\n12 months 231 52.28 (11) 252 50.32 (10) 1.45 (−0.17 to 3.04) 1.35 (−0.03 to 2.74)\nEuroQol visual analogue scale:\nBaseline 347 63.15 (17) 359 63.43 (17) −0.28 (−2.73 to 2.27)\n4 months 269 64.41 (17) 303 63.16 (18) 1.32 (−1.01 to 3.66) 1.72 (−0.32 to 3.76)\n12 months 242 63.62 (18) 273 62.36 (17) 0.03 (−2.34 to 2.40) 0.73 (−1.38 to 2.85)\nEQ-5D utility score:\nBaseline 381 0.570 (0.25) 375 0.535 (0.28) 0.03 (−0.00 to 0.07)\n4 months 299 0.552 (0.28) 331 0.556 (0.27) −0.04 (−0.07 to −0.00) −0.03 (−0.06 to 0.01)\n12 months 285 0.578 (0.25) 312 0.559 (0.27) −0.005 (−0.04 to 0.03) −0.006 (−0.04 to 0.03)\nQALYs:\nBaseline to 4 months 290 0.191 (0.08) 316 0.183 (0.08) −0.006 (−0.01 to −0.00) −0.003 (−0.01 to 0.00)\n4-12 months 256 0.383 (0.15) 291 0.373 (0.16) −0.01 (−0.03 to 0.01) −0.007 (−0.03 to 0.01)\nTotal for 1 year 248 0.580 (0.22) 278 0.558 (0.23) −0.01 (−0.04 to 0.01) −0.01 (−0.04 to 0.01)\nQALYs=quality adjusted life years.\n*Based on available data, with no imputation for missing cases. Mean differences and confidence intervals were calculated using bootstrap regressions (5000 replications) with baseline\nscores as covariates for all values at four and 12 months.\n†Missing data imputed using hot decking and multiple imputation procedures. Differences in means are adjusted for any baseline differences in outcomes between groups using analysis of\ncovariance, with baseline score as covariate. Confidence intervals were calculated using standard parametric techniques.\nPr\nob\nab\nil\nit\ny \nof\n A\nS\nM\nP \n+\nbo\nok\nle\nt b\nei\nng\n c\nos\nt e\nff\nec\nti\nve\n0 100 200 300 400 500 600 700 800 900 1000\n0\n0.2\n0.4\n0.6\n0.8\n1.0\nWillingness to pay for point gain on SF-36 and VAS (£)\nSF-36 mental health - societal perspective\nSF-36 mental health - health and social care perspective\nSF-36 physical health - societal perspective\nSF-36 physical health - health and social care perspective\nVAS - societal perspective\nVAS - health and social care perspective\nFig 1 | Cost effectiveness acceptability curve of an arthritis self\nmanagement programme (ASMP) on SF-36 and visual\nanalogue scale (VAS) outcomes\nRESEARCH\npage 6 of 9 BMJ | ONLINE FIRST | bmj.com\n£1189 for the SF-36 physical health component, and\n£13 473 for the visual analogue scale. On the basis of\nthese three outcomes, the intervention group domi-\nnated the control group from the societal perspective\nbecause of lower costs and better outcomes.\nThe QALY disadvantage to the intervention group,\ncombinedwith higher health and social care costs, sug-\ngests that from the health and social care perspective\nthe standard care approach was superior to the inter-\nvention. From the societal perspective, cost savings in\nthe intervention group would need to be traded off\nagainst modest QALY losses, which would be a con-\ntentious policy decision. Thus neither the cost effec-\ntiveness acceptability curve nor incremental cost\neffectiveness ratio approach suggests that the inter-\nvention is cost effective compared with standard care\non the basis of QALYs.\nThe broad conclusions of the approach on the basis\nof the incremental cost effectiveness ratio did not\nchangewith the use of imputed full sample data. Ratios\nremained similar except that the additional cost per\npoint gain on the visual analogue scale from the health\nand social care perspective fell from £13 473 to £419 as\na result of a notable increase in mean difference in\nvisual analogue scale score (0.03 v 0.73; see table 4).\nDISCUSSION\nA self management programme for arthritis plus an\neducation booklet in primary care led to a statistically\nsignificant increase in health and social care costs but\nno difference in societal costs or any of the measured\noutcomes at 12 months.\nAlthough the lack of statistical significance for some\ndifferences in costs and outcomes could be deemed to\nweaken the cost effectiveness evidence, the inference\napproach has limitations.17 So it is nevertheless relevant\nto explore the implications for cost effectiveness. Some\nsmall advantages on the SF-36 outcomes translated into\nlow incremental cost effectiveness ratios from the health\nand social care perspective and dominance from the\nsocietal perspective, as well as reasonably good prob-\nabilities of cost effectiveness for the intervention under\nthe cost effectiveness acceptability curve approach.\nFindings on the basis of QALYs were less favourable,\nhowever: the intervention was dominated by the con-\ntrol from the health and social care perspective and\ninvolved a trade-off between slightly reduced QALYs\nand cost savings from the societal perspective. The cost\neffectiveness acceptability curve approach showed low\nprobabilities of cost effectiveness evenwhenhighvalues\nwere placed on QALY gains.\nAn important finding was the small proportion of\nsupport costs falling to theNHSand social care sectors.\nThree month costs for health and social care services\nwere around £80 at baseline. Other societal costs were\nalmost 13 times that, illustrating the breadth of the eco-\nnomic impacts of arthritis outside of these sectors.\nFurthermore, the probabilities of cost effectiveness\nwere generally higher from a societal perspective, indi-\ncating that economic benefits of this intervention are\nlikely to be borne more by participants, their families,\nand friends and other government sectors. To join up\nwith wider policy considerations, such as the role of\ncarers in the long term management of people with\nchronic conditions,18 broad perspectives are needed\nin economic evaluations of interventions such as self\nmanagement programmes for arthritis to assess their\nimpact on all stakeholders, despite the additional\nmethodological challenges that this brings.19\nStrengths and limitations of the study\nThis comprehensive economic evaluation, set within a\nrandomised controlled trial, was based on individual\npatient data and therefore deals with many of the lim-\nitations associated with previous evidence. Further-\nmore, it fills an important evidence gap; its findings\nare likely to have a wider application because the sam-\nple was recruited from across the UK and among\npatients who routinely attend primary care rather\nthan participants who had specifically volunteered to\ntake part in the intervention.\nThe inclusion of social security benefits in the eva-\nluation from a societal perspective may be contentious\nbecause such costs are generally considered to be trans-\nfer payments. However, social security benefits are an\nimportant consideration in certain patient groups and\nwhen the economic criterion of equity is to be consid-\nered alongside that of efficiency in resource\nallocation.20 21 We thought that examining an inter-\nvention for a condition mainly endured by older peo-\nple without accounting for such costs would miss an\nimportant dimension to public sector financing and\ndecision making.\nSome data from the client service receipt inventory\nwere incomplete. Missing responses in self completed\nquestionnaires are to be expected, and given the size\nand geographical spread of the sample and the breadth\nof the analytical perspective taken it would not have\nbeen feasible to collect these data from alternative\nsources. To make efficient use of the data provided,\nhowever, we imputed missing components.\nThemain limitationwas that wewere unable tomea-\nsure accurately the costs of the arthritis self manage-\nment programme. A bottom-up cost estimation,\nbased in the setting where the programme is most\nPr\nob\nab\nil\nit\ny \nof\n A\nS\nM\nP \n+\nbo\nok\nle\nt b\nei\nng\n c\nos\nt e\nff\nec\nti\nve\n0\n25\n00\n50\n00\n75\n00\n10\n 00\n0\n12\n 50\n0\n15\n 00\n0\n17\n 50\n0\n20\n 00\n0\n22\n 50\n0\n27\n 50\n0\n30\n 00\n0\n25\n 00\n0\n0\n0.2\n0.4\n0.6\n0.8\n1.0\nWillingness to pay for QALY gain (£)\nHealth and social care perspective\nSocietal perspective\nFig 2 |Cost effectiveness acceptability curve of an arthritis\nself management programme (ASMP) on QALY gains\nRESEARCH\nBMJ | ONLINE FIRST | bmj.com page 7 of 9\nlikely to be delivered, especially if funded by health\nservices, is necessary to examine the true cost effective-\nness of the course. Ideally, costs under different set-up\nscenarios and from different perspectives of funders\nwould also be examined.Wewere informed byArthri-\ntis Care that the charge to primary care trusts in Eng-\nland at the time of the study was £2500 per course,\noccasionally discounted to £1850, and that the cost\ndid not include any profit element. Group sizes of 10-\n12 were reported, suggesting costs between £154 and\n£250 per participant. Our unit cost falls into the lower\nend of this range and is likely to be an underestimate\nbecause it did not cover factors such as failed courses\nand development costs. Furthermore, it is likely that\nimplementation in the NHS would incur additional\nresources to coordinate the courses. Indeed, the\nDepartment of Health estimated the cost of its expert\npatients programme to be £250 per patient.6 However,\na lower unit cost of £123 per participant has been\nreported elsewhere.4 What all estimates have in com-\nmon is that they are basedon throughput,which in turn\nmay affect costs and cost effectiveness, as suggested by\nthe finding from our sensitivity analyses that total\nhealth and social care costs would be equivalent to,\nrather than higher than, costs under a standard care\napproach if the unit cost of the arthritis self manage-\nment programme fell by 20-50%.\nAside from inflationary increases in prices, it is pos-\nsible that costs and outcomes have changed since the\ncompletion of the trial owing to a range of other factors\n—for example, policy changes related to health care,\nsocial care, social security, and carers. However, as we\ncarried out a controlled evaluation with balanced\ngroups at baseline, we have no reason to believe that\nany such changes would have had a differential impact\non the two groups. The findings should therefore con-\ntinue to be relevant, particularly as osteoarthritis is a\nprevalent long termcondition and there remains a gov-\nernment policy to include and expand the expert\npatients programme through the NHS.\nComparison with previous studies\nAlthough a US study based on a primary care popula-\ntion reported no differences in clinical outcomes or use\nof healthcare resources at four months when compar-\ning an arthritis self management programme with an\narthritis self management programme book,22 the cost\neffectiveness of arthritis self management programmes\nagainst usual care was unproved. For example, a study\nthat found cost savings and improvements in pain was\nbased on decision modelling rather than individual\npatient data.23 Poor methodologies leading to a lack\nof good quality evidence were highlighted in a review\nof 10 studies offering education on arthritis self\nmanagement.24 The review found that only three stu-\ndies reported fewer physician visits and lower health-\ncare costs, whereas the remainder did not measure\nservice use or costs.\nStudies in other populations, however, have sug-\ngested that self management programmes can be cost\neffective. A well designed economic evaluation of the\nEnglish NHS expert patients programme, a self care\nprogramme for people with a range of self defined\nlong term conditions, found small advantages in costs\n(mean difference −£27) and QALYs (mean difference\n0.02) compared with a waiting list control.6 25 It is\nunclear why our study did not reach similar conclu-\nsions, particularly as our intervention cost was lower\n(£165 v £250), but differences in study design may\nhave been contributing factors. For example, the eva-\nluation of the expert patients programme covered a\nbroader range of clinical conditions, recruited volun-\nteers, and had no specific inclusion or exclusion cri-\nteria, and so may have included participants with\ngreater capacity for benefit.\nA longitudinal study in people with heart disease,\nlung disease, stroke, or arthritis examined a self man-\nagement programmebasedon the generic principles of\narthritis self management programmes and reported\nimprovements in health status and reductions in\nhealthcare costs at one and two years.16 Several factors\nshould be considered in interpreting this finding.\nFirstly, the cost implications of the intervention were\nnot considered within the framework of a formal eco-\nnomic evaluation on the basis of costs at individual\nlevel but were instead based on extrapolations of aver-\nage costs for particular services (for example, changes\nin visits to the emergency room or doctor). Secondly,\nsome extrapolations were based on non-significant\nchanges in costs over time. Finally, total costs per\npatient were not estimated, making it difficult to\ngauge the intervention’s overall cost effectiveness.\nTwo other non-randomised studies of self manage-\nment programmes reported cost offsets, but again the\nfindings were based on extrapolations of study group\nmeans for a selection of services used, and cost effec-\ntiveness was not assessed.26 27 Similar concerns were\nexpressed in a recent review of evidence for self man-\nagement across different diseases.3\nImplications for policy\nThe outcome analysis showed statistically significant\nimprovements for anxiety and perceived self efficacy\nto manage symptoms.5 This economic evaluation did\nnot show such advantages for quality of life outcomes\nor costs. Following the current policymaking stance of\nfocusing on QALYs and health and social care costs,\nthe findings reported here suggest that the arthritis self\nmanagement programme intervention has a low prob-\nability of being cost effective. The intervention is more\nlikely to be cost effective if a societal perspective is\ntaken—one that includes the financial effects on\npatients and their families and friends—or greater\nvalue is placed on SF-36 outcomes than on QALYs.\nHowever, it must be borne inmind that the advantages\nto the intervention group on the SF-36 outcomes were\nsmall and the cost effectiveness acceptability curves are\nbased on willingness to pay for one point advantages\non the SF-36. The clinical significance of such small\nchanges on the SF-36 is debatable.\nRESEARCH\npage 8 of 9 BMJ | ONLINE FIRST | bmj.com\nConclusions and needs for future research\nThe conclusions from this study depend on perceptions\nof the relative importance of health and social care and\nsocietal costs and the appropriate outcomes for this\npatient group. The study does not suggest cost effective-\nness based on the health and social care cost perspective\nor implicit cost per QALY threshold currently used by\nthe National Institute for Health and Clinical Excel-\nlence. However arthritis has broad impacts and we\nfound that there may be modest cost effectiveness\nadvantages for the arthritis self management pro-\ngramme when other major impacts such as informal\ncare and social security benefits are taken into account\nalongside small gains of doubtful clinical relevance on\nthe SF-36. Further rigorous appraisal of the cost effec-\ntiveness of the Department of Health’s expert patients\nprogramme is warranted for other meaningful health\noutcomes and other clinical conditions.\nWe thank Angela Coulter and Melissa Pickering for their help in carrying\nout this trial; Lisa Cotterill, Gill Dorer, Nicky Fasey, Jeannett Martin, Claire\nNewland, Gloria Randall, and Tom Sensky for being on the trial steering\ncommittee; the Medical Research Council general practice framework\nnurses and general practices who were involved; and the participants.\nContributors:MB, GR, MG, AP, JBm, JBw, and AH conceived, designed, and\nran the trial. IN and AA were involved in the ongoing management of the\ntrial. AA supervised the data collection. MG carried out the multiple\nimputation analyses. AP carried out the economic evaluation and takes\nresponsibility for the integrity of the data and the accuracy of the data\nanalysis. All authors were responsible for drafting the paper, revising it\ncritically for important intellectual content, and approving the final\nversion. MB is guarantor.\nFunding: This trial was funded by the UK Medical Research Council (grant\nNo G9900306). The trial was initially funded to run for three years, from 1\nJune 2000 to 31 May 2003. A supplement and extension extended the\ntrial completion date to 31 May 2004. The UK Medical Research Council\nfunded the trial, peer reviewed the protocol, and was represented on the\ntrial steering committee. The funders had no role in the study design or\nmanagement, data collection, analysis and interpretation, writing of the\nreport, or preparation of the manuscript.\nCompeting interests: None declared.\nEthical approval: This study was approved by the multicentre research ethics\ncommittee of the London office before the trial started in 2000 (reference\nMREC\/99\/2\/87). Approval was also obtained from the local research ethics\ncommittees of areas where patients were recruited to the trial.\n1 Arthritis Research Campaign. Arthritis: the big picture. Chesterfield:\narc, 2002.\n2 Arthritis Care. Arthritis care fact sheet. London: Arthritis Care,\n2007. www.arthritiscare.org.uk\/PublicationsandResources\/\nListedbytype\/Factsheets (accessed June 2008).\n3 Richardson G, Gravelle H, Weatherly H, Ritchie G. Cost-effectiveness\nof interventions to support self-care: a systematic review. Int J\nTechnol Assess Health Care 2005;21:423-32.\n4 Griffiths C, Foster G, Ramsey J, Eldridge S, Taylor S. How effective are\nexpert patient (lay led) education programmes for chronic disease?\nBMJ 2007;334:1254-7.\n5 Buszewicz M, Rait G, Griffin M, Nazareth I, Patel A, Atkinson A, et al.\nSelf management of arthritis in primary care: randomised controlled\ntrial. BMJ 2006;333:879-82.\n6 Kennedy A, Reeves D, Bower P, Lee V, Middleton E, Richardson G,\net al. The effectiveness and cost effectiveness of a national lay-led\nself care support programme for patients with long-term conditions:\na pragmatic randomised controlled trial. J Epidemiol Community\nHealth 2007;61:254-61.\n7 Beecham J, Knapp M. Costing psychiatric interventions. In:\nThornicroft G, Brewin C,Wing J, eds.Measuringmental health needs.\nOxford: Oxford University Press, 1992.\n8 Beecham J, Knapp M. Costing psychiatric interventions. In:\nThornicroft G, Brewin C,Wing J, eds.MeasuringMental health needs,\n2nd ed. Oxford: Oxford University Press, 2002.\n9 Netten A, Curtis L. Unit costs of health and social care. Canterbury:\nPSSRU, University of Kent, 2003.\n10 Ware J, Sherbourn C. TheMOS, 36 item short-form health survey (SF-\n36). I: conceptual framework and item selection.Med Care\n1992;30:473-83.\n11 EuroQol Group. EuroQol: a facility for the measurement of health-\nrelated quality of life. Health Policy 1990;16:199-208.\n12 Dolan P, Gudex C, Kind P, Williams A. A social tariff for EuroQol:\nresults from a UK population survey. Discussion paper 138. York:\nUniversity of York, 1995.\n13 Manca A, Hawkins N, Sculpher MJ. Estimating mean QALYs in trial-\nbased cost-effectiveness analysis: the importance of controlling for\nbaseline utility. Health Econ 2005;14:487-96.\n14 Fenwick E, Claxton K, Sculpher M. Representing uncertainty: the role\nof cost-effectiveness acceptability curves. Health Econ\n2001;10:779-87.\n15 Lorig KR, Holman HR. Arthritis self-management studies: a twelve\nyear review. Health Educ Q 1993;20:17-28.\n16 Lorig KR, Ritter P, Stewart AL, Sobel DS, William Brown B, Bandura A,\net al. Chronic disease self-management program. 2-year health\nstatus and health care utilization outcomes.Med Care\n2001;39:1217-23.\n17 Claxton K. The irrelevance of inference: a decision-making approach\nto the stochastic evaluation of health care technologies. J Health\nEcon 1999;18:341-64.\n18 Department of Health. Caring about carers. A national strategy for\ncarers. London: DoH, 1999.\n19 Drummond M, Weatherly H, Ferguson B. Economic evaluations of\nhealth interventions. Abroader perspective should include costs and\nbenefits for all stakeholders. BMJ 2008;337:770-1.\n20 Raftery J. Have “lunatics taken over the asylums?” The rising cost of\npsychiatric services in England andWales, 1860-1986. In: KnappM,\ned. The economic evaluation ofmental health care. Aldershot: Arena,\n1995.\n21 Richardson J.Why economic costsmay not be of interest in a national\nhealth scheme; or, costs fairness and reverse order analysis. Centre\nfor Health Program Evaluation, working paper 126. Melbourne:\nMonash University, 2001.\n22 Solomon DH, Warsi A, Brown-Stevenson T, Farrell M, Gauthier S,\nMikels D, et al. Does self-management education benefit all\npopulations with arthritis? A randomised controlled trial in a primary\ncare physician network. J Rheumatol 2002;29:362-8.\n23 Kruger JMS, Helmick CG, Callahan LF, Haddix AC. Cost-effectiveness\nof the arthritis self-help course. Arch Intern Med 1998;158:1245-9.\n24 Bodenheimer T, Lorig K, Holman H, Grumbach K. Patient self-\nmanagement of chronic disease in primary care. JAMA\n2002;288:2469-75.\n25 Richardson G, Kennedy A, Reeves D, Bower P, Lee V, Middleton E,\net al. Cost effectiveness of the Expert Patients Programme (EPP) for\npatients with chronic conditions. J Epidemiol Community Health\n2008;62:361-7.\n26 Lorig KR, Sobel DS, Ritter PL, Laurent D, Hobbs M. Effect of a self-\nmanagement program on patients with chronic disease. Effect Clin\nPract 2001;4:256-62.\n27 Lorig KR, Sobel DS, Stewart AL, Brown BW, Bandura A, Ritter P, et al.\nEvidence suggesting that a chronic disease self-management\nprogram can improve health status while reducing hospitalisation: a\nrandomized trial.Med Care 1999;37:5-14.\nAccepted: 11 March 2009\nWHAT IS ALREADY KNOWN ON THIS TOPIC\nEvaluations of arthritis self management programmes in the United States suggested that\nthese relatively inexpensive interventions can lead to a range of patient centred benefits and\nreductions in healthcare use\nAlthough such studies provided the initial evidence base for England’s expert patients\nprogramme, they had narrow perspectives, methodological flaws, and uncertain applicability\nto the UK\nWHAT THIS STUDY ADDS\nCost effectiveness of arthritis self management programmes is not suggested on the basis of\ncurrent cost perspectives and QALY thresholds from the National Institute for Health and\nClinical Excellence\nThe probability of cost effectiveness is greater when broader costs and other quality of life\noutcomes are considered\nAt 7% of societal costs, costs for health and social care constitute a small proportion of total\neconomic costs in this patient group\nRESEARCH\nBMJ | ONLINE FIRST | bmj.com page 9 of 9\n"}