{"doi":"10.1016\/S0893-9659(96)00101-2","coreId":"96876","oai":"oai:generic.eprints.org:453\/core69","identifiers":["oai:generic.eprints.org:453\/core69","10.1016\/S0893-9659(96)00101-2"],"title":"Boundary-driven instability","authors":["Maini, P. K.","Myerscough, M. R."],"enrichments":{"references":[{"id":789697,"title":"Bifurcating spatially heterogeneous solutions in a chemotaxis model for biological pattern formation,","authors":[],"date":"1991","doi":null,"raw":null,"cites":null},{"id":790235,"title":"Diffusion driven instability in an inhomogeneous domain,","authors":[],"date":"1993","doi":null,"raw":null,"cites":null},{"id":789464,"title":"Dissipative structure: An explanation and an ecological example,","authors":[],"date":"1972","doi":null,"raw":null,"cites":null},{"id":788270,"title":"Mathematical Aspects of Reacting and Diffusing Systems,","authors":[],"date":"1979","doi":null,"raw":null,"cites":null},{"id":788944,"title":"Mathematical Biology,","authors":[],"date":"1989","doi":null,"raw":null,"cites":null},{"id":788735,"title":"Mathematical Models in Biology,","authors":[],"date":"1988","doi":null,"raw":null,"cites":null},{"id":790667,"title":"Pattern formation in chemotactic models: Application to chondrogenesis in the developing limb,","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":789178,"title":"Pattern formation in generalised Turing systems: I. Steady-state patterns in systems with mixed boundary conditions,","authors":[],"date":"1994","doi":null,"raw":null,"cites":null},{"id":790403,"title":"Pattern formation in reaction diffusion models with spatially inhomogeneous diffusion coefficients,","authors":[],"date":"1992","doi":"10.1093\/imammb\/9.3.197","raw":null,"cites":null},{"id":788511,"title":"Reaction-Diffusion Equations and Their Applications to Biology,","authors":[],"date":"1986","doi":null,"raw":null,"cites":null},{"id":788050,"title":"The chemical basis of morphogenesis,","authors":[],"date":"1952","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1997","abstract":"We analyse a reaction-diffusion system and show that complex spatial patterns can be generated by imposing Dirichlet boundary conditions on one or more of the reactant concentrations. This pattern persists even when the homogeneous steady state with Neumann conditions is stable","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/96876.pdf","fullTextIdentifier":"http:\/\/eprints.maths.ox.ac.uk\/453\/1\/83.pdf","pdfHashValue":"627961037e4b22257888a97b4524e4c1a9d8ddda","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:453<\/identifier><datestamp>\n      2015-05-29T18:22:29Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4143:4D3932<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.maths.ox.ac.uk\/453\/<\/dc:relation><dc:title>\n        Boundary-driven instability<\/dc:title><dc:creator>\n        Maini, P. K.<\/dc:creator><dc:creator>\n        Myerscough, M. R.<\/dc:creator><dc:subject>\n        Biology and other natural sciences<\/dc:subject><dc:description>\n        We analyse a reaction-diffusion system and show that complex spatial patterns can be generated by imposing Dirichlet boundary conditions on one or more of the reactant concentrations. This pattern persists even when the homogeneous steady state with Neumann conditions is stable.<\/dc:description><dc:date>\n        1997<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.maths.ox.ac.uk\/453\/1\/83.pdf<\/dc:identifier><dc:identifier>\n          Maini, P. K. and Myerscough, M. R.  (1997) Boundary-driven instability.  Applied Mathematics Letters, 10  (1).   pp. 1-4.      <\/dc:identifier><dc:relation>\n        10.1016\/S0893-9659(96)00101-2<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.maths.ox.ac.uk\/453\/","10.1016\/S0893-9659(96)00101-2"],"year":1997,"topics":["Biology and other natural sciences"],"subject":["Article","PeerReviewed"],"fullText":"Pergamon \nAppl. Math. Lett. Vol. 10, No. 1, pp. 1-4, 1997 \nCopyright@1997 Elsevier Science Ltd \nPrinted in Great Britain. All rights reserved \n0893-9659\/97 $17.00 + 0.00 \nPII: S0893-9659(96)00101-2 \nBoundary-Driven Instability \nP.  K .  MAINI  t \nCentre for Mathematical Biology, Mathematical Institute \n24-29 St. Giles', Oxford, OX1 3LB, United Kingdom \nM. R. MYERSCOUGH* \nSchool of Mathematics and Statistics, F07 \nUniversity of Sydney, N.S.W. 2006, Australia \n(Received March 1996; accepted June 1996) \nAbst rac t - -We analyse a reaction-diffusion system and show that complex spatial patterns can be \ngenerated by imposing Dirichlet boundary conditions on one or more of the reactant concentrations. \nThis pattern persists even when the homogeneous steady state with Neumann conditions is stable. \nKeywords - -Tur ing  systems, Pattern formation, Environmental instability, Asymmetry. \n1. STABIL ITY ,  INSTABIL ITY  AND PATTERN \nIn 1952, Turing [1] considered a mathematical model for two interacting chemicals of the fbrm: \nc~u \n-- V .  (D~Vu) + f(u,v), (1) \n0t \nOv \n- V .  (DvVv) + ,q(u, v), (2) \nOt \nwhere u( r , t ) ,v ( r , t )  are chemical concentrations at position r and time t, and D~, and D, are \ndiffusion coefficients which are usually assumed constant. The functions f and g model the \nchemical kinetics and are usually polynomials or rational functions (although Turing considered \nthe simple case in which these functions were linear in the chemical concentrations). Using \nperiodic boundary conditions, Turing showed that a steady state of the system, stable in the \nabsence of diffusion, could be driven unstable by the presence of diffusion, resulting in the system \nevolving to a spatially-varying solution in u and v, that is, to a spatial pattern. This phenomenon \nis now known as Turing- or diffusion-driven-instability and, for the case where f and g are \nnonlinear, the growing spatial patterns predicted by linear stability analysis can evolve into \nbounded, spatially-varying, stable steady state solutions. \nSubsequent to Turing, reaction-diffusion equations have been extensively studied for the case \nof Neumann, or zero flux, boundary conditions, and applied to many patterning phenomena \nin biology, where u and v are concentrations of chemicals or morphogens, and ecology, where \nu and v are species densities (see, for example, [2-5]). Most studies focus on how either tile \nchemical kinetics\/species interactions, or diffusion, can destabilize the uniform stead}\" state. In \nsuch studies, the boundary behaves as a passive, impermeable membrane. Recently, it, was \n*P.K.M. would like to thank the School of Mathematms and Statistics, University of Sydney, for its hospitality \nand support. \n*This work was supported by an Australian Research Council small grant (to M.R.M.). \nTypeset by .AA,,~S-~X \n2 P .K .  MAINI AND M. R. MYERSCOUGH \nshown that using mixed boundary conditions, for example, zero flux for one chemical and fixed \nconditions for the other, results in significant changes in the pattern properties exhibited by a \nreaction-diffusion system [6]. For example, under certain mixed boundary conditions, a stable, \nspatially-nonuniform solution existed for arbitrarily small domain size, when, with zero flux \nboundary conditions, the uniform steady state was the only stable solution. In this note, we \nshow how Dirichlet boundary conditions are able to destabilise the uniform steady state and \ngenerate complex patterns in a reaction-diffusion system when the uniform steady state is stable \nwith Neumann boundary conditions. \n2. BOUNDARY-DRIVEN INSTABILITY: AN EXAMPLE \nIn this section we consider, in one spatial dimension, the following equations, originally pro- \nposed in [7] as a predator-prey model: \nOu _ 02u  \n-~  = D=-~-fix 2 + (a + j3u)u - 7uv, (3) \nOv _ 02v \nO--i = J3v-g-fiz2 + 6uv  - pv 2, (4) \nwhere a, 13, 3', 5, and p are positive parameters, and u and v depend on x and t. For Neumann \nboundary conditions, this system has the nontrivial uniform steady state \npa 6a \nus 3\"6 - p\/~' vs 3'5 - p\/~\" (5) \nFor parameter values a = 1, t3 = 0.5, 3' = 1, 6 = 1, p = 1, the uniform steady state is u = v = 2. \nWe set Du -- 1 and use D,  as the bifurcation parameter. With Neumann boundary conditions \nthe uniform steady state becomes unstable at Dv = D~ = 11.68. For higher values of Dv the \nsystem evolves to give spatial pattern (Figure 1). For D,  < D~ the uniform steady state is stable. \nFigure 2 shows the effect of imposing a Dirichlet boundary condition on u at x = 0. Figure 2a \nshows the steady state solution for Dv = 12. As expected, away from the left-hand boundary, \nit is similar to the pattern shown in Figure 1. The leftmost, highest peak in both u and v at \nsmall x is an effect of the boundary condition on u. When D,  = 11.5, that is, below the critical \nvalue 11.68, the Dirichlet boundary condition destabilises the uniform steady state and a pattern \nis generated. The amplitude of this pattern is increasingly damped as x becomes larger. As we \ncontinue to decrease D,,  the damping becomes tronger and the number of peaks becomes fewer \n(Figure 2c). Finally only the leftmost peak remains (Figure 2d). This disappears for Dv < 1. \nI I I I I \n3 \n! \no \nI I , I , I , I , I \n0 20 40 60 80 100 \nx \nFigure 1. Pattern generated by equations (3) and (4) with Neumann boundary \nconditions. Parameter values: c~ ---- 1,\/3 -- 0.5, and Du - 1. Here D, ---- 12; for these \nparameter values Dv c ----- 11.68. The solid line represents u; the dotted line v. \nBoundary-Driven Instability 3 \nI I I I I I \nI , I , I , I \n20 40 60 80 \nI \n100 \nI I I I I I \nI , I \n0 2O \nI , I , I , I \n40 60 80 I00 \nI \nI \n0 \nX \n(a) Dv = 12. \nI I I I \n2.0 \n1.5  ~-  \nr \n1.0 *- \n.5  - -  \n0 \nI \nI , I , I , I , I t , I \n20 40 60 80 100 0 20 \nX \n(b) Dv = 11.5. \nI I I t \nI , F , I , I \n40 60 80 100 \nx x \n(c) Dv = 10. (d) Dv = \"2. \nFigure 2. Solutions to equations (3) and (4) with u set to zero on the left-hand \nboundary (at x = 0) and Neumann boundary conditions for v at x = 0, and for \nboth u and v at x -- 100. Values for a, \/3, and Du are the same as Figure 1. As in \nFigure 1, the solid line represents u; the dotted line v. \n3. D ISCUSSION \nIn this note, we have shown that  boundary conditions can play an active role in driving a \nuniform steady state of a reaction diffusion system unstable, leading to a stable, spatial pattern. \nWe have observed similar effects in the modified glycolysis ystem analysed in [6] and also in the \nchemotaxis model studied in [8] (results not shown). A crucial difference between the patterns \nobserved here, and those observed in [6], is their complexity. The patterns obtained in [6] with \nmixed boundary  conditions, for the case where the uniform steady state was stable for Neumann \nboundary  conditions, were simple in the sense that they had only one turn ing point. In our \ncase, by extending the domain length, we have found solutions that  have several turn ing points \nand the effect of the boundary condition is felt far into the domain. This is another example of \nenv i ronmenta l  ins tab i l i ty  discussed in [9]. There, it was shown that a spatial ly-varying diffusion \n4 P .K .  MAINI AND M. R. MYERSCOUGH \ncoefficient could induce the model  (3),(4) to form a spat ia l  pat tern  which encroached into the \ndomain in which the uniform steady state was stable. \nThe pat terns  we observe here are spat ia l ly  asymmetr ic .  Maini  et al. [10] considered a react ion \ndiffusion model  for skeletal pat tern ing in the chick l imb, and showed how a spat ia l ly-varying \ndiffusion coefficient led to asymmetr ic  patterns  in a Turing model which were consistent with the \nresults of biological exper iments which contradicted the s tandard  Turing model  with constant \ndiffusion coefficients. Here, we have presented an alternat ive way to produce spat ia l ly -asymmetr ic  \npatterns.  In this note, we have considered only the final, s teady state to which solutions evolve. \nHowever, the pat terns  produced here exhibit  an interesting spat io - tempora l  dynamics which will \nbe examined in a subsequent publ icat ion [11]. \nREFERENCES \n1. A. Turing, The chemical basis of morphogenesis, Phil. 7hzns. R. Soc. Lond. B237, 37-72 (1952). \n2. P.C. Fife, Mathematical Aspects of Reacting and Diffusing Systems, Springer-Verlag, (1979). \n3. N.F. Britton, Reaction-Diffusion Equations and Their Applications to Biology, Academic Press, (1986). \n4. L. Edelstein-Keshet, Mathematical Models in Biology, McGraw-Hill, (1988). \n5. J.D. Murray, Mathematical Biology, Springer-Verlag, (1989). \n6. R. Dillon, P.K. Maini and H.G. Othmer, Pattern formation in generalised Turing systems: I. Steady-state \npatterns in systems with mixed boundary conditions, J. Math. Biol. 32, 345-393 (1994). \n7. L.A. Segel and J.L. Jackson, Dissipative structure: An explanation and an ecological example, J. Theor. \nBiol. 37 (1972). \n8. P.K. Maini, M.R. Myerscough, J.D. Murray and K.H. Winters, Bifurcating spatially heterogeneous solutions \nin a chemotaxis model for biological pattern formation, Bull. Math. Biol. 53, 701-719 (1991). \n9. D.L. Benson, J.A. Sherratt and P.K. Maini, Diffusion driven instability in an inhomogeneous domain, Bull. \nMath. Biol. 55, 365-384 (1993). \n10. P.K. Maini, D.L. Benson and J.A. Sherratt, Pattern formation in reaction diffusion models with spatially \ninhomogeneous diffusion coefficients, IMA J. Math. Appl. Med. ~ Biol. 9, 197-213 (1992). \n11. M.R. Myerscough and P.K. Maini, Pattern formation in chemotactic models: Application to chondrogenesis \nin the developing limb, (preprint). \n"}