{"doi":"10.3390\/molecules15020804","coreId":"136838","oai":"oai:bradscholars.brad.ac.uk:10454\/4539","identifiers":["oai:bradscholars.brad.ac.uk:10454\/4539","10.3390\/molecules15020804"],"title":"Ancient Chinese methods are remarkably effective for the preparation of artemisinin-rich extracts of Qing Hao with potent antimalarial activity.","authors":["Wright, Colin W.","Linley, Peter A.","Brun, Reto","Wittlin, Sergio","Hsu, Elisabeth"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"yesAncient Chinese herbal texts as far back as the 4th Century Zhou hou bei ji fang\\ud\ndescribe methods for the use of Qing Hao (Artemisia annua) for the treatment of\\ud\nintermittent fevers. Today, the A. annua constituent artemisinin is an important\\ud\nantimalarial drug and the herb itself is being grown and used locally for malaria treatment\\ud\nalthough this practice is controversial. Here we show that the ancient Chinese methods that\\ud\ninvolved either soaking, (followed by wringing) or pounding, (followed by squeezing) the\\ud\nfresh herb are more effective in producing artemisinin-rich extracts than the usual current\\ud\nmethod of preparing herbal teas from the dried herb. The concentrations of artemisinin in\\ud\nthe extracts was up to 20-fold higher than that in a herbal tea prepared from the dried herb,\\ud\nbut the amount of total artemisinin extracted by the Chinese methods was much less than\\ud\nthat removed in the herbal tea. While both extracts exhibited potent in vitro activities\\ud\nagainst Plasmodium falciparum, only the pounded juice contained sufficient artemisinin to\\ud\nsuppress parasitaemia in P. berghei infected mice. The implications of these results are\\ud\ndiscussed in the context of malaria treatment using A. annua infusions","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/136838.pdf","fullTextIdentifier":"https:\/\/bradscholars.brad.ac.uk\/bitstream\/10454\/4539\/2\/Molecules.pdf","pdfHashValue":"9c72143e886be0bf4e4d028d150ec97b6b8c3425","publisher":"MDPI Publishing","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:bradscholars.brad.ac.uk:10454\/4539<\/identifier><datestamp>\n                2014-05-19T14:57:00Z<\/datestamp><setSpec>\n                com_10454_152<\/setSpec><setSpec>\n                col_10454_6342<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nAncient Chinese methods are remarkably effective for the preparation of artemisinin-rich extracts of Qing Hao with potent antimalarial activity.<\/dc:title><dc:creator>\nWright, Colin W.<\/dc:creator><dc:creator>\nLinley, Peter A.<\/dc:creator><dc:creator>\nBrun, Reto<\/dc:creator><dc:creator>\nWittlin, Sergio<\/dc:creator><dc:creator>\nHsu, Elisabeth<\/dc:creator><dc:subject>\nArtemisia annua (Qing Hao)<\/dc:subject><dc:subject>\nTraditional medicines<\/dc:subject><dc:subject>\nAntimalarial<\/dc:subject><dc:subject>\nArtemisinin<\/dc:subject><dc:description>\nyes<\/dc:description><dc:description>\nAncient Chinese herbal texts as far back as the 4th Century Zhou hou bei ji fang\\ud\ndescribe methods for the use of Qing Hao (Artemisia annua) for the treatment of\\ud\nintermittent fevers. Today, the A. annua constituent artemisinin is an important\\ud\nantimalarial drug and the herb itself is being grown and used locally for malaria treatment\\ud\nalthough this practice is controversial. Here we show that the ancient Chinese methods that\\ud\ninvolved either soaking, (followed by wringing) or pounding, (followed by squeezing) the\\ud\nfresh herb are more effective in producing artemisinin-rich extracts than the usual current\\ud\nmethod of preparing herbal teas from the dried herb. The concentrations of artemisinin in\\ud\nthe extracts was up to 20-fold higher than that in a herbal tea prepared from the dried herb,\\ud\nbut the amount of total artemisinin extracted by the Chinese methods was much less than\\ud\nthat removed in the herbal tea. While both extracts exhibited potent in vitro activities\\ud\nagainst Plasmodium falciparum, only the pounded juice contained sufficient artemisinin to\\ud\nsuppress parasitaemia in P. berghei infected mice. The implications of these results are\\ud\ndiscussed in the context of malaria treatment using A. annua infusions.<\/dc:description><dc:date>\n2010-12-07T14:49:59Z<\/dc:date><dc:date>\n2010-12-07T14:49:59Z<\/dc:date><dc:date>\n2010<\/dc:date><dc:type>\nArticle<\/dc:type><dc:type>\npublished version paper<\/dc:type><dc:identifier>\nWright, C. W., Linley, P. A., Brun, R., Wittlin, S. and Hsu, E. (2010). Ancient Chinese methods are remarkably effective for the preparation of artemisinin-rich extracts of Qing Hao with potent antimalarial activity. Molecules, Vol. 15, pp. 804-812.<\/dc:identifier><dc:identifier>\n90010329<\/dc:identifier><dc:identifier>\n90011301<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/10454\/4539<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nhttp:\/\/dx.doi.org\/10.3390\/molecules15020804<\/dc:relation><dc:rights>\n© 2010 MDPI. This work is licensed under a Creative Commons Attribution-Non-Commercial-Share-Alike License (http:\/\/creativecommons.org\/licenses\/by-nc-nd\/2.0\/uk).<\/dc:rights><dc:publisher>\nMDPI Publishing<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.3390\/molecules15020804"],"year":2010,"topics":["Artemisia annua (Qing Hao)","Traditional medicines","Antimalarial","Artemisinin"],"subject":["Article","published version paper"],"fullText":"Molecules 2010, 15, 804-812; doi:10.3390\/molecules15020804 \n \nmolecules \nISSN 1420-3049 \nwww.mdpi.com\/journal\/molecules \nArticle \nAncient Chinese Methods Are Remarkably Effective for the \nPreparation of Artemisinin-Rich Extracts of Qing Hao with \nPotent Antimalarial Activity \nColin W. Wright 1,*, Peter A. Linley 1, Reto Brun 2, Sergio Wittlin 2 and Elisabeth Hsu 3  \n1 Bradford School of Pharmacy, University of Bradford, West Yorkshire, BD7 1DP, UK; \nE-Mail: p.a.linley@bradford.ac.uk (P.A.L.) \n2 Swiss Tropical Institute, Socinstrasse 57, PO Box, CH-4002, Basel, Switzerland;  \nE-Mails: Reto.Brun@unibas.ch (R.B.); Sergio.Wittlin@unibas.ch (S.W.) \n3  Institute of Social and Cultural Anthropology, University of Oxford, 51 Banbury Road, Oxford, \nOX2 6PE, UK; E-Mail: Elisabeth.hsu@anthro.ox.ac.uk (E.H.) \n∗ Author to whom correspondence should be addressed; E-Mail: c.w.wright@bradford.ac.uk. \nReceived: 11 January 2010; in revised form: 29 January 2010 \/ Accepted: 3 February 2010 \/ \nPublished: 4 February 2010  \n \nAbstract: Ancient Chinese herbal texts as far back as the 4th Century Zhou hou bei ji fang \ndescribe methods for the use of Qing Hao (Artemisia annua) for the treatment of \nintermittent fevers. Today, the A. annua constituent artemisinin is an important \nantimalarial drug and the herb itself is being grown and used locally for malaria treatment \nalthough this practice is controversial. Here we show that the ancient Chinese methods that \ninvolved either soaking, (followed by wringing) or pounding, (followed by squeezing) the \nfresh herb are more effective in producing artemisinin-rich extracts than the usual current \nmethod of preparing herbal teas from the dried herb. The concentrations of artemisinin in \nthe extracts was up to 20-fold higher than that in a herbal tea prepared from the dried herb, \nbut the amount of total artemisinin extracted by the Chinese methods was much less than \nthat removed in the herbal tea. While both extracts exhibited potent in vitro activities \nagainst Plasmodium falciparum, only the pounded juice contained sufficient artemisinin to \nsuppress parasitaemia in P. berghei infected mice. The implications of these results are \ndiscussed in the context of malaria treatment using A. annua infusions. \nKeywords: chinese herbal texts; Artemisia annua; artemisinin; malaria \n \nOPEN ACCESS\nMolecules 2010, 15              \n \n \n805\n1. Introduction  \nIn the early 1970s, Chinese scientists screening traditional Chinese medicinal herbs in the search for \nnew antimalarials isolated artemisinin from the herb known as Qing Hao (generally identified as \nArtemisia annua L. but may have originally referred to A. apiacea) [1]. Artemisinin is an unusual \nsesquiterpene lactone incorporating an endoperoxide group. It has potent antiplasmodial activity and \nwas shown in clinical trials to be highly effective against malaria, including patients with cerebral \nmalaria and patients with malaria parasites resistant to chloroquine [2]. In contrast to other \nantimalarials such as quinine, (used for treating chloroquine-resistant malaria), artemisinin was found \nto be remarkably non-toxic and the importance of its discovery against the background of a rising \nincidence of multidrug-resistant malaria parasites cannot be underestimated. Several semi-synthetic \nartemisinin derivatives including artemether, arteether and sodium artesunate are now in clinical use \nworldwide for the treatment of malaria [3]. However, antimalarial drugs such as the artemisinin \nderivatives are expensive and are not accessible to the majority of people who are at risk of malaria, \nespecially in Africa with the result that approximately 1 million people, mostly children, die from \nmalaria each year [4].  \nThe desperate need for affordable medicines for the treatment of malaria has stimulated the search \nfor alternative treatments and in particular the use of A. annua as a locally grown herbal treatment for \nmalaria [5]. For this purpose the dried herb is usually used in the form of an infusion prepared by \nadding boiling water to the herb, allowing to stand and then drinking the strained liquor. In China, \nQing Hao was documented more than 1,600 years ago for the treatment of ‘intermittent fevers’ by the \nfamous physician Ge Hong (284-363 A.D.) in the Zhou hou bei ji fang which may be translated as \n‘Emergency prescriptions kept up one’s sleeve’. Interestingly, in this text specific instructions are \ngiven: ‘Qing Hao, one bunch, take two sheng (2 × 0.2 L) of water for soaking it, wring it out, take the \njuice, ingest it in its entirety [6]. Other methods in later references involve soaking the plant in urine \nrather than water and pounding the fresh herb to produce a juice [7]. In view of these interesting \ninstructions, here we report experiments designed to simulate the methods described in the ancient \nChinese texts and evaluate their potential to provide locally accessible malaria treatment. \n2. Results and Discussion  \n2.1. Extraction of artemisinin by traditional methods \nA. annua herb was harvested from 4-month old high-artemisinin yielding plants (Anamed) grown in \nthe UK. Leaves and small stems were soaked in water and briefly drained before ‘wringing by hand’ \nand collecting the juice expressed. No juice could be obtained from the herb by wringing before \nsoaking in water. The ‘wrung juice’ was kept separate from the water used to soak the herb and the \nartemisinin concentration of each was determined using gas-liquid chromatography. The results  \n(Table 1) showed that the ‘wrung juice’ method was surprisingly effective in extracting artemisinin \nfrom fresh A. annua herb. Herb soaked in water (sufficient to cover the herb), for 12 h before wringing \nyielded wrung juice containing more artemisinin (72.6 mg\/L) than that soaked for only 2 h  \n(45.9 mg\/L). The artemisinin concentrations achieved were nearly five and three times higher, \nrespectively, than that achieved by preparing an infusion from dried herb prepared from the same \nMolecules 2010, 15              \n \n \n806\nplants (14.5 mg\/L). The solubility of artemisinin in water is poor on account of its non-polar nature \nand a concentration of only 10.6 mg\/L was reported when boiling water was added to pure artemisinin \n[8]. In the plant, artemisinin is stored in 10-celled biseriate glandular trichomes present on the \nepidermis of the aerial parts [9]. The effectiveness of the ‘wrung’ method may be due, in part, to \n‘mechanical’ effects resulting in the crushing and\/or removal of the glandular trichomes. Another \nfactor may be the presence of essential oil in the glandular trichomes that is composed of a mixture of \nmonoterpenes and sesquiterpenes [10] and these may possibly aid solubilisation. Herb soaked for 12 h \nbefore wringing as compared to 2 h produced wrung juice containing almost 50% more artemisinin, an \neffect that may be related to the absorption of water by the herb during soaking, perhaps resulting in \nswollen and more fragile glandular trichomes. It is possible that 12 h is not the optimal time for \nsoaking and further experiments to determine this would be worthwhile. Unfortunately, the Chinese \ntexts do not give any details in this respect. Although the ‘wrung’ method provides a product with \ngreater artemisinin concentration, the efficiency of the process in terms of the proportion of the total \namount of artemisinin present in the plant material is relatively poor (4.51 and 7.27% for the 2 h and \n12 h ‘wrung’ juice respectively) compared to the dried leaf infusion (53.8%). However, in addition to \nthe artemisinin present in the ‘wrung’ juice, an amount is also present in the water in which the herb \nwas soaked (6.55 and 13.2 mg\/L for the 2 h and 12 h samples respectively) resulting in total \nefficiencies of 9.08 and 14.1% respectively. It is likely that traditionally, the liquid remaining after \nsoaking as well as the wrung juice would have been consumed, thus obtaining maximum benefit from \nthe preparation.  \nPounded juice (prepared by pounding the herb with a mortar and pestle followed by squeezing the \nresulting pulp by hand) was found to have the highest artemisinin concentration (293 mg\/L), and this \nwas more than 20-fold that of the dried herb infusion and 4-fold higher than that in the 12 h wrung \njuice. Again, the extraction efficiency was relatively low (14.9%) but it is likely that this could be \nimproved considerably by mechanically squeezing the pulp after pounding as with hand-squeezing the \nyield of juice was only 0.18 mL\/g fresh herb. However, it was not possible to produce juice by \nmechanically crushing the non-pounded herb in a mangle. The ‘pounding’ method thus provides a \nproduct with a remarkably high artemisinin content compared to the other methods but the effort \nrequired to produce it is high by comparison and as the resulting juice is dark green and viscous it may \nnot be as palatable as the almost colourless ‘wrung’ juice.  \nThese results clearly demonstrate that the wrung juice and the pounded juice methods described in \nancient Chinese medical texts are effective in extracting artemisinin from the herb. However, the \nresults described here were obtained using a selected variety of A. annua (Anamed) with a relatively \nhigh artemisinin content (0.033% in the fresh herb) that is not representative of wild-type A. annua. In \norder to compare the latter with a non-selected variety, wrung juice (2 h) was prepared from fresh herb \ncontaining 0.009% artemisinin (Chiltern Seeds). This juice contained 24.6 mg\/L artemisinin which, \nalthough half that of the 2 h Anamed plant wrung juice is similar to that of the Anamed dried leaf \ninfusion (Table 1). The dried herb (Chiltern Seeds) was found to contain 0.072% artemisinin (data not \nshown) which is within the range of 0.02–1.07% reported in the literature for non-hybrid samples \ngrown in different parts of the world [11] while the dried herb from the Anamed plants contained \n0.273%. The above results show that, as might be expected, herb containing higher amounts of \nartemisinin yields juices with higher artemisinin content although the efficiency of extraction with the \nMolecules 2010, 15              \n \n \n807\nlower-yielding (Chiltern Seeds) herb was slightly higher (6.24%) for the 2 h wrung juice compared to \nthat for the 2 h Anamed wrung juice (4.51%). Despite the lower artemisinin content of the Chiltern \nherb, the artemisinin content of the 2 h wrung juice was comparable to the Anamed dried herb infusion \nclearly demonstrating that the ancient Chinese method of soaking and then hand wringing the herb has \nthe potential to yield juice with a surprisingly high artemisinin content even from plants containing a \nmodest content of artemisinin that occur in the wild. In this study, 12 h wrung juice or pounded juice \nfrom the Chiltern herb were not prepared but by analogy with the Anamed herb, these may be expected \nto yield juices containing higher artemisinin levels compared to the 2 h wrung juice. It should also be \nnoted that young (4 month old) plants were used for this study but maximum artemisinin yields are \nobtained at or near the flowering stage so that there may be potential for even higher yields of \nartemisinin.  \n2.2. Antimalarial activity \nIn vitro evaluation of the wrung and pounded juices prepared from the Anamed plants against P. \nfalciparum [12], showed that the pounded leaf juice was the most potent as a 1:500,000 dilution of the \njuice inhibited parasite growth by 50% while the 2 h and 12 h wrung juices were about half as potent \n(Table 1). In each case, the antiplasmodial activities correlated well with the artemisinin content. \nHowever, the IC50 values in terms of artemisinin content were 6–18x lower compared to that for the \ncontrol artemisinin (IC50 = 3.8 ng\/mL) indicating that the activity of the juices could not be entirely \naccounted for by their artemisinin content. The pounded, 2 h and 12 h wrung juices from the Anamed \nherb and the 2 h wrung juice from the Chiltern herb were tested orally in mice infected with \nPlasmodium berghei [12]. Only the pounded juice was found to suppress parasitaemia in the mice \n(Table 2). One, two and three volumes of 500 μL (each with an artemisinin content corresponding to a \ndose of 9 mg\/kg) given at 12 h intervals (to avoid administering excessive volumes) were found to \nsuppress parasitaemia by 52, 95, and 96% respectively, compared to untreated infected control mice. \nThe two and three-volume doses used corresponding to 18 and 27 mg\/kg artemisinin respectively \nresulted in a suppression of parasitaemia, (95 and 96% respectively) that was comparable to that seen \nwith a control dose of pure artemisinin (30 mg\/kg single oral dose) which suppressed parasitaemia by \n88%. Interestingly, the suppression of parasitaemia seen with the two-volume dose (18 mg\/kg), was \ncomparable to the suppression seen with a single dose of 30 mg\/kg artemisinin. This effect is higher \nthan expected and may be due to giving the treatment in two divided doses 12 h apart as artemisinin \nhas a short elimination half life. Another possibility is that other constituents of A. annua have \ncontributed to the antimalarial efficacy. Treatment of infected mice with the wrung juices had no effect \non parasitaemia, (data not shown) but this is explicable in terms of their artemisinin concentrations and \nthe dose volume limitation of 3 × 500 μL - the artemisinin content of 1.5 mL of the 12 h wrung juice is \nequivalent to less than 5 mg\/kg bodyweight. The results of both the in vivo experiments as well as the \nin vitro antiplasmodial assay are consistent with the artemisinin contents of the juices.  \n \n \n \nMolecules 2010, 15              \n \n \n808\nTable 1. Artemisinin content, efficiency of artemisinin extraction and in vitro \nantiplasmodial activities of preparations made from A. annua herb grown from Anamed \n(high artemisinin) and Chiltern (low artemisinin) seeds. \na Artemisinin content of herb samples was determined by extracting with hexane several times and analysing the extract \nusing gas-liquid chromatography; values obtained were taken to represent 100%. b Wrung juices were prepared by \nsoaking 150 g fresh herb in sufficient water to cover the herb for either 2 or 12 h; after removing the herb excess water \nwas allowed to drain before wringing out the juice by hand. Pounded juice was prepared by pounding fresh herb in a \nmortar and then squeezing the resulting pulp by hand; the yield of juice was 0.18 mL\/g. The infusion was prepared \nby adding 1000 mL boiling water to the dried herb and allowing to stand until cool; 10 g dried herb is equivalent to  \n34.3 g fresh herb. c Artemisinin content of extracts was determined by extracting several times with hexane and analysing \nthe extracts as for the herb samples above. NT, not tested. \nTable 2. In vivo evaluation of orally administered fresh pounded juice (Anamed) against P. \nberghei in mice. \nExtract\/drug Dose Parasitaemia (%) Suppression of \nParasitaemia (%) \nPounded juice (Anamed) 500 μL a × 1 16 52 \n 500 μL × 2 1.6 95 \n 500 μL × 3 1.4 96 \nArtemisinin 30 mg\/kg × 1 3.9 88 \nUntreated control  34 0 \na 500 μL correspond to doses of 9 mg\/kg artemisinin. \n \nType of A. annua \n(artemisinin % \nw\/w)a  \nMethodb \nTotal \nartemisinin \n in sample;  \nAmount of \nartemisinin \nextracted, volume \nof juice and \nartemisinin \nconcentration in \njuice  \nProportion of \ntotal \nartemisinin \nextracted \n(Extraction \nefficiency), \n(%) \nIn vitro activity vs. P. \nfalciparum as IC50  \n(Dilution of juice giving \nIC50 and artemisinin \nconcentration at this \ndilution) \nAnamed, fresh herb \n(artemisinin 0.033%,  \nn = 5) \nWrung \n (2 h)  \n49.5 mg in 150g \n2.23 mg, 48.6 mL,  \n≡ 45.9 mg\/L \n4.51 \n1:222,222 ≡ 0.21 ng\/mL \nartemisinin \nas above \nWrung  \n(12 h) \nas above \n3.60 mg, 49.3 mL,  \n≡ 72.6 mg\/L \n7.27 \n1:222,222 ≡ 0.33 ng\/mL \nartemisinin \nAnamed, dried herb \n(artemisinin 0.27%,  \nn = 4) \nDried herb \ninfusion \n(10 g\/L) \n27 mg in 10 g -, -, 14.5 mg \/L 53.8 NT \nAnamed, fresh herb \n (artemisinin 0.033%,  \nn = 5) \nPounded 43.2 mg in 131 g \n6.44 mg, 22.0 mL,  \n≡ 293 mg\/L \n14.9 \n1:500,000 ≡ 0.59 ng\/mL \nartemisinin \nChiltern, fresh herb \n(artemisinin 0.009%,  \nn = 4) \nWrung  \n(2 h) \n13.5 mg in 150 g \n0.843 mg, 34.3 mL, \n≡ 24.6 mg\/L \n6.24 \n1:48.780 ≡ 0.50 ng\/mL \nartemisinin \nArtemisinin     3.8 ng\/mL \nMolecules 2010, 15              \n \n \n809\n2.3. Implications for malaria treatment \nCurrently, the treatment of malaria with infusions made from the dried herb of locally grown A. \nannua especially using high-artemisinin yielding varieties is being promoted by some organisations. \nThis is a very attractive option where people do not have access to, or cannot afford, effective drugs \nfor the treatment of malaria caused by P. falciparum. Clinical evidence regarding the efficacy of A. \nannua infusions is limited to a few small studies carried out in adult patients with uncomplicated \nmalaria [13]. The results suggest that symptoms and parasitaemia are rapidly cleared and it has been \nshown that plasma levels of artemisinin well in excess of that considered necessary to inhibit the \ngrowth of P. falciparum in vitro (10 ng\/mL) are achieved [14]. On the other hand, in studies where \npatients were followed up [15,16], high rates of recrudescence occurred because not all of the parasites \nhad been killed; this may be related to the short half-life of artemisinin and to other factors that are not \nfully understood [17]. Paradoxically, although artemisinin is a highly effective antimalarial, it is \ndifficult to achieve a high cure rate (i.e. without recurrence of the infection due to recrudescence), with \ndaily doses of 500 mg, far higher than the amount provided by infusions. Another important limitation \nof the studies is that they were carried out in adult patients who were likely to have some immunity to \nmalaria so that the results cannot be extrapolated to children and non-immune adults who are the \ngroups most at risk of severe disease and death due to malaria. A further problem is the concern that \nthe use of A. annua infusions may encourage the development of malaria parasites resistant to \nartemisinin. There is evidence that artemisinin-based antimalarials are becoming less effective [18] \nand the World Health Organisation has called for a halt to the marketing and sale of malaria medicines \nthat contain only artemisinin or its derivatives – a second antimalarial drug must be given in order to \nprevent recrudescence and minimise the risk of resistance development [19].  \nIt is often argued that the use of herbal teas is not likely to lead to the development of malaria \nparasite resistance because other plant constituents such as flavonoids may act synergistically with \nartemisinin. The antiplasmodial action of artemisinin has been reported to be enhanced by the \nmethoxylated flavones artemetin and casticin which are constituents of A. annua but this has only been \nobserved in vitro [20]. In the clinical studies cited above, recrudescence was a major problem \nsuggesting that even if artemisinin does act synergistically with other plant constituents, this \ninteraction is insufficient to prevent this phenomenon.  \n3. Experimental  \n3.1. Plant material and sample preparation \nA high-artemisinin yielding cultivar of A. annua (seeds obtained from Anamed International, \nSchafweide 77, 71364 Winnenden, Germany) together with an unspecified variety for comparison \n(Chiltern Seeds, Ulverston, UK) were grown at Hailey House, Oxfordshire UK from seed germinated \nin an unheated greenhouse and seedlings were transplanted outdoors when they were large enough to \nhandle. Four months-old plants of each variety were harvested and used for experiments on the same \nday. Leaves and small stems (150 g) from five plants of each were soaked separately in beakers \ncontaining sufficient water to cover the herb for 2 or 12 h, removed, allowed to drain briefly and then \nwrung by hand. The juices expressed were each extracted three times with hexane and then the \nMolecules 2010, 15              \n \n \n810\ncombined hexane extract was dried over anhydrous sodium sulphate and concentrated using a rotary \nevaporator at 40 °C. Dried extracts were stored at −20 °C until analysed using gas-liquid \nchromatography. Pounded juice was prepared by ‘bruising’ the fresh herb using a mortar and pestle \nuntil a ‘pulp’ was produced; the juice was squeezed out by hand and then extracted three times with \nhexane as above. Samples of the fresh and dried herbs were similarly extracted with hexane in order to \ndetermine their total artemisinin contents.  \n3.2. Artemisinin analysis and determination of antiplasmodial activity \nThe artemisinin content of the hexane extracts was determined using a Perkin Elmer 8600 or Clarus \n400 gas liquid chromatograph (Perkin Elmer, UK) using a previously reported method [21]. A \nminimum of 3 separate analyses was carried out for each sample and the mean value determined. \nSamples of wrung and pounded juice were assessed for in vitro activities against Plasmodium \nfalciparum (NF54) using the method described previously [12]. Samples of the wrung and pounded \njuice were also tested orally in mice infected with P. berghei [12]. These tests were commenced within \n24–48 h of preparing the extracts in order to minimize possible loss of artemisinin. \n4. Conclusions \nThis study has shown that following the instructions for the use of Qing Hao given in ancient \nChinese medical texts produces extracts that have markedly higher artemisinin concentrations than the \ncurrent method of preparing aqueous infusions. For the treatment of a 50 Kg adult patient with malaria, \nit has been estimated that a daily dose of 100 mg artemisinin would be required [22]. Using the \npounded juice described above would require the patient to consume 0.34 L per day whereas ~7 L of \nthe dried herb infusion would be needed to provide the same dose of artemisinin. Adopting these \nmethods for the preparation of herbal medicines from A. annua herb for the treatment of malaria could \nresult in higher artemisinin concentrations. However, unfortunately, this is not likely to reduce the rate \nof recrudescence seen when artemisinin or A. annua teas are used for malaria treatment. In order for \nmalaria treatment with A. annua herbal preparations to be effective and acceptable, ways need to be \nfound to eliminate the problem of recrudescence and also to minimise the potential for the \ndevelopment of artemisinin-resistant parasites. This could possibly be achieved by combining Qing \nHao with other herbs. Clinical studies are also needed to show whether severe disease can be treated \nand deaths prevented, especially in children and other non-immune malaria patients. For the time \nbeing, due to the reasons discussed above, malaria treatment with preparations made with A. annua \nherb cannot be recommended. Instead, we recommend that further research on herbal A. annua \ntreatments be undertaken that address these problems, as the ethical dilemma remains acute for those \nseeking to help malaria victims who do not have access to effective antimalarial drugs. \nAcknowledgements \nThe cultivation of A. annua was kindly carried out by Clair Beardson, Hailey House, Ipsden, Oxon. \nUK. We are indebted to Peter O’Neil and Graeme Dean for gas-liquid chromatography analyses and to \nD.C. Warhurst for helpful advice and suggestions on the manuscript. \nMolecules 2010, 15              \n \n \n811\nReferences and Notes \n1. Hsu, E. The history of qing hao in the Chinese materia medica. Trans. Roy. Soc. Trop. Med. Hyg. \n2006, 100, 505–508. \n2. Klayman, D.L. Qinghaosu (artemisinin): An antimalarial drug from China. Science 1985, 228, \n1049–1055. \n3. Olumnese, P. WHO Guidelines for the Treatment of Malaria; WHO: Geneva, Switzerland, 2006. \n4. Kokwaro, G. Ongoing challenges in the management of malaria. Malaria J. 2009, 8 (Suppl. 1), S2. \n5. Willcox, M.; Bodeker, G.; Bourdy, G.; Dhingra, V.; Falquet, J. Ferreira, J.F.S.; Graz, B.; Hirt, H-\nM.; Hsu, E.; de Magalhaes, P.M.; Provendier, D.; Wright, C.W. Artemisia annua as a traditional \nherbal antimalarial. In Traditional Medicinal Plants and Malaria; Willcox, M., Bodeker, G., \nRasoanaivo, P., Eds.; CRC Press: Boca Raton, FL, USA, 2004; pp. 43–59. \n6. Ge, H. Zhou Hou Bei Ji Fang, Jin, 4th C (340 A.D.) (Emergency Prescriptions Kept Up One’s \nSleeve). In Si Ku Quan Shu (Collection of The Works From The Four Storehouses); Shangwu \nyinshuguan: Taibei, Taiwan, 1983. \n7. Tang, S. Zheng Lei Ben Cao, Song Ca. 1082 (Materia Medica Corrected and Arranged In \nCategories); Shanghai guji chubanshe: Shanghai, China, 1991. \n8. Mueller, M.S.; Karhagomba, I.B.; Hirt, H.M.; Wemakor, E. The potential of Artemisia annua L. \nas a locally produced remedy for malaria in the tropics: agricultural, chemical and clinical aspects. \nJ. Ethnopharm. 2000, 73, 487–493. \n9. Duke, S.O.; Paul, R.N. Development and fine structure of the glandular trichomes of Artemisia \nannua. Int. J. Plant Sci. 1993, 154, 107–118. \n10. Woerdenbag, H.J.; bos, R.; Salomons, M.C., Hendriks, H., Pras, N.; Malingre, Th.M. Volatile \nconstituents of Artemisia annua L. (Asteraceae). Flavour Fragr. J. 1993, 8, 131–137. \n11. Delabays, N.; Darbellay, C.; Galland, N. Variation and heritability of artemisinin content of \nArtemisia annua L. In Artemisia; Wright, C.W., Eds.; Taylor and Francis: London, UK, 2002; pp. \n197–209. \n12. Vennerstrom, J.L.; Arbe-Barnes, S.; Brun, R.; Charman, S.A.; Chiu, F.C.; Chollet, J.; Dong, Y.; \nHunziker, D. McIntosh, K.; Padmanilayam, M.; Santo Tomas, J.; Scheurer, C.; Scorneaux, B.; \nTang, Y.; Urwyler, H.; Wittlin, S.; Charman, W.N. Identification of an antimalarial synthetic \ntrioxolane drug development candidate. Nature 2004, 430, 900–904. \n13. de Ridder, S.; van der Kooy, F.; Verpoorte, R. Artemisia annua as a self-reliant treatment for \nmalaria in developing countries. J. Ethnopharm. 2008, 120, 302–314. \n14. Rath, K.; Taxis, K.; Walz, G.; Gleiter, C.H.; Li, S-M.; Heide, L. Pharmacokinetic study of \nartemisinin after oral intake of a traditional preparation of Artemisia annua L. (Annual worm-\nwood). Am. J. Trop. Med. Hyg. 2004, 70, 128–132. \n15. Blanke, C.H.; Naisabha, G.B.; Balema, M.B.; Mbaruku, G.M.; Heide, L.; Muller, M.S. Herba \nArtemisia annuae tea preparation compared to sulfadoxine-pyrimethamine in the treatment of \nuncomplicated falciparum malaria in adults : a randomized double-blind clinical trial. Trop. \nDoctor 2008, 38, 113–116. \nMolecules 2010, 15              \n \n \n812\n16. Mueller, M.S.; Runyambo, N.; Wagner, I.; Borrman, S.; Dietz, K.; Heide, L. Randomized \ncontrolled trial of a traditional preparation of Artemisia annua L. (Annual Wormwood) in the \ntreatment of malaria. Trans. Roy. Soc. Trop. Med. Hyg. 2004, 98, 318–321. \n17. White, N.J. Why is it that antimalarial drug treatments do not always work? Annal. Trop. Med. \nParasit. 1998, 92, 449–458. \n18. Dondorp, A.M.; Nosten, F.; Yi, P.; Das, D.; Phyo, A.P.; Tarning J.; Lwin K.M.; Ariey, F.; \nHanphithakpong, W.; Lee, S.J.; Ringwald, P.; Silamut, K.; Imwong, M.; Chotivanich, K.; Lim, P.; \nHerdman, T.; An, S.S.; Yeung, S. Artemisinin resistance in Plasmodium falciparum malaria. New \nEng. J. Med. 2009, 361, 455–467.  \n19. World Health Organisation. News Release WHO\/2 on 19 January 2006. \n20. Elford, B.C.; Roberts, M.F.; Phillipson, J.D.; Wilson, R.J.M. Potentiation of the antimalarial \nactivity of Quinghaosu by methoxylated flavones. Trans. Roy. Soc. Trop. Med. Hyg. 1987, 81, \n434–436. \n21. Peng, C.A.; Ferreira, J.F.S.; Wood, A.J. Direct analysis of artemisinin from Artremisia annua L. \nusing high-performance liquid chromatography with evaporative light scattering detector, and gas \nchromatography with flame ionization detector. J. Chromatog. A 2006, 1133, 254–258. \n22. Angus, B.J.; Thiaaporn, I.; Chanthapadith, K.; Suputtamongkol, K.; White, N.J. Oral artesunate \ndose-response relationship in acute falciparum malaria. Antimicrob. Agents Chemother. 2002, \n778–782. \nSample Availability: Not available. \n© 2010 by the authors; licensee Molecular Diversity Preservation International, Basel, Switzerland. \nThis article is an open-access article distributed under the terms and conditions of the Creative \nCommons Attribution license (http:\/\/creativecommons.org\/licenses\/by\/3.0\/). \n"}