{"doi":"10.1017\/S0954102010000222","coreId":"55597","oai":"oai:nora.nerc.ac.uk:11214","identifiers":["oai:nora.nerc.ac.uk:11214","10.1017\/S0954102010000222"],"title":"Climate change and the Antarctic marine ecosystem: an essay on management implications","authors":["Trathan, Phil N.","Agnew, D."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"In this paper we review evidence for, and anticipated consequences of, climate change in Antarctic marine communities, examining the potential impacts on invertebrates and vertebrates alike and exploring plausible outcomes for species, with examples principally from the Antarctic literature. We suggest that industries with the greatest potential to aggravate climate change impacts on marine communities are marine capture fisheries. In the Southern Ocean, harvesting is governed under the Convention for the Conservation of Antarctic Marine Living Resources (CCAMLR). CCAMLR espouses an ecological management framework and so has the capacity to mitigate harvesting impacts such that they do not worsen impacts from climate change. We discuss some of the implications of climate change and advocate that CCAMLR address certain key issues if it is to fulfil its international obligations. It will be essential for CCAMLR to determine relative risks (uncertainties), impacts and timescales, of various processes consequent on climate change. Such risk assessments should be feasible with current knowledge and should provide a focus for future work. We believe it will be important to prioritize issues that reduce impacts and uncertainties by the greatest degree, and propose that future plans should involve shared responsibility (e.g. with SCAR etc.) for each of the risks described","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/55597.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/11214\/1\/-ANS-ANS22_04-S0954102010000222a.pdf","pdfHashValue":"6d35f60a5c87c041c0a0e4902f568b4cd444fa23","publisher":"Cambridge University Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:11214<\/identifier><datestamp>\n      2013-11-14T11:49:56Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533139<\/setSpec><setSpec>\n      7375626A656374733D533230<\/setSpec><setSpec>\n      7375626A656374733D533233<\/setSpec><setSpec>\n      7375626A656374733D533131<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/11214\/<\/dc:relation><dc:title>\n        Climate change and the Antarctic marine ecosystem: an essay on management implications<\/dc:title><dc:creator>\n        Trathan, Phil N.<\/dc:creator><dc:creator>\n        Agnew, D.<\/dc:creator><dc:subject>\n        Management<\/dc:subject><dc:subject>\n        Marine Sciences<\/dc:subject><dc:subject>\n        Meteorology and Climatology<\/dc:subject><dc:subject>\n        Ecology and Environment<\/dc:subject><dc:description>\n        In this paper we review evidence for, and anticipated consequences of, climate change in Antarctic marine communities, examining the potential impacts on invertebrates and vertebrates alike and exploring plausible outcomes for species, with examples principally from the Antarctic literature. We suggest that industries with the greatest potential to aggravate climate change impacts on marine communities are marine capture fisheries. In the Southern Ocean, harvesting is governed under the Convention for the Conservation of Antarctic Marine Living Resources (CCAMLR). CCAMLR espouses an ecological management framework and so has the capacity to mitigate harvesting impacts such that they do not worsen impacts from climate change. We discuss some of the implications of climate change and advocate that CCAMLR address certain key issues if it is to fulfil its international obligations. It will be essential for CCAMLR to determine relative risks (uncertainties), impacts and timescales, of various processes consequent on climate change. Such risk assessments should be feasible with current knowledge and should provide a focus for future work. We believe it will be important to prioritize issues that reduce impacts and uncertainties by the greatest degree, and propose that future plans should involve shared responsibility (e.g. with SCAR etc.) for each of the risks described.<\/dc:description><dc:publisher>\n        Cambridge University Press<\/dc:publisher><dc:date>\n        2010<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/11214\/1\/-ANS-ANS22_04-S0954102010000222a.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Trathan, Phil N.; Agnew, D..  2010  Climate change and the Antarctic marine ecosystem: an essay on management implications.   Antarctic Science, 22 (4). 387-398.  https:\/\/doi.org\/10.1017\/S0954102010000222 <https:\/\/doi.org\/10.1017\/S0954102010000222>     \n <\/dc:identifier><dc:relation>\n        10.1017\/S0954102010000222<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/11214\/","10.1017\/S0954102010000222"],"year":2010,"topics":["Management","Marine Sciences","Meteorology and Climatology","Ecology and Environment"],"subject":["Publication - Article","PeerReviewed"],"fullText":"http:\/\/journals.cambridge.org Downloaded: 14 Nov 2013 IP address: 194.66.0.114\nAntarctic Science 22(4), 387–398 (2010) & Antarctic Science Ltd 2010 doi:10.1017\/S0954102010000222\nClimate change and the Antarctic marine ecosystem: an essay\non management implications\nP.N. TRATHAN1 and D. AGNEW2\n1British Antarctic Survey, NERC, High Cross, Madingley Road, Cambridge CB3 0ET, UK\n2Marine Resource Assessment Group Ltd, 18 Queen Street, London W1J 5PN, UK\npnt@bas.ac.uk\nAbstract: In this paper we review evidence for, and anticipated consequences of, climate change in\nAntarctic marine communities, examining the potential impacts on invertebrates and vertebrates alike and\nexploring plausible outcomes for species, with examples principally from the Antarctic literature. We\nsuggest that industries with the greatest potential to aggravate climate change impacts on marine\ncommunities are marine capture fisheries. In the Southern Ocean, harvesting is governed under the\nConvention for the Conservation of Antarctic Marine Living Resources (CCAMLR). CCAMLR espouses\nan ecological management framework and so has the capacity to mitigate harvesting impacts such that\nthey do not worsen impacts from climate change. We discuss some of the implications of climate change\nand advocate that CCAMLR address certain key issues if it is to fulfil its international obligations. It will be\nessential for CCAMLR to determine relative risks (uncertainties), impacts and timescales, of various\nprocesses consequent on climate change. Such risk assessments should be feasible with current knowledge\nand should provide a focus for future work. We believe it will be important to prioritize issues that reduce\nimpacts and uncertainties by the greatest degree, and propose that future plans should involve shared\nresponsibility (e.g. with SCAR etc.) for each of the risks described.\nReceived 25 July 2009, accepted 2 March 2010\nKey words: CCAMLR, fishing, harvesting, monitoring, Southern Ocean, variability and change\nIntroduction\nAt present, direct human activities in the Southern Ocean\nprincipally include fishing, science and tourism, each of\nwhich is subject to varying degrees of supervision and\nmanagement (Clarke & Harris 2003). Compared to many\nother parts of the World Ocean, the consequential impacts\nof these activities on ecosystem processes are relatively\nminor (Halpern et al. 2008), though they have been much\ngreater in the past (Bonner 1980, 1984, Kock 1992). In\ncontrast, indirect human impacts, particularly those arising\nas a consequence of greenhouse gas emissions originating\nfrom beyond the Southern Ocean, are likely to be very\nmuch more considerable and very much more likely to\nimpact upon ecosystem processes and structure. Thus,\nClarke & Harris (2003) ranked climate change as one of the\nmost important threats to the future of Antarctic marine\necosystems, second only to that of Illegal, Unregulated or\nUnreported (IUU) fishing.\nThe Antarctic is a major component of the Earth’s climate\nsystem, linked through global atmospheric and oceanic\ncirculations (Solomon et al. 2007). Such links mean that the\nconsequences of global greenhouse gas emissions are likely to\nbe evident at a variety of scales, both temporally and spatially\n(Parry et al. 2007). Furthermore, in the Antarctic, changes in\nstratospheric ozone are now also thought to have contributed\nto observed climate change effects (Thompson & Solomon\n2002), with the interaction effects of ozone and CO2\nincreasingly recognized as important (Mayewski et al. 2009).\nAll marine ecosystems in the Antarctic may be influenced\nby climate change. For example, the progressive warming\nin the Southern Ocean (Gille 2002) has been associated\nwith a decline in Antarctic krill (Euphausia superba Dana)\n(Atkinson et al. 2004) and an associated decline in the\npopulation size of various seabirds and seals (Weimerskirch\net al. 2003). Other observations also suggest that alterations\nto habitat via changes in sea ice characteristics caused by\nregional climate warming have had a detrimental impact on\nthe prey of seabird and seal populations (Trathan & Murphy\n2002, Trathan et al. 2003, 2006, 2007, Forcada et al. 2005,\n2006, Murphy et al. 2007). Indeed, it is perhaps not surprising\nthat marine systems close to the Antarctic Peninsula, the\nSouth Orkney Islands and across the Scotia Sea have been\namongst the first affected given the recent, regional, rapid rise\nin temperatures close to the Peninsula (Vaughan et al. 2003).\nThe most significant warming trends across the Peninsula\noccur for the western and northern parts. Here Faraday\/\nVernadsky Station has experienced the greatest statistically\nsignificant (,5% level) trend with temperature increases over\nthe period 1951–2001 of 15.6 ± 4.38C per century (Vaughan\net al. 2001). Rothera Station, 300 km to the south of Faraday,\nhas experienced an even greater warming trend for the period\n1978–2001 with increases of 111.0 ± 13.08C per century\n(Vaughan et al. 2001), but the duration of the data record\n387\nhttp:\/\/journals.cambridge.org Downloaded: 14 Nov 2013 IP address: 194.66.0.114\nand the large interannual variability in the recorded\ntemperatures means that this trend is not statistically\nsignificant.\nThe region of warming extends from the southern part\nof the western Antarctic Peninsula north to the South\nOrkney Islands. The rate of warming decreases away from\nFaraday\/Vernadsky Station with the long record from Signy\nIsland, South Orkney Islands, showing only a warming of\n10.258C per decade (Quayle et al. 2002), and a different\nannual pattern (Signy has warmed mostly in the summer,\nwhile Faraday\/Vernadsky has warmed more in the winter).\nFurther north at the more northerly sub-Antarctic islands,\nchanges are also apparent, particularly in ocean temperature\n(Whitehouse et al. 2008) and glacier retreat (Cook et al.\n2010) though clear terrestrial trends are not yet well\ndescribed (Convey 2006, 2007).\nElsewhere in the Antarctic, beyond the Antarctic Peninsula\nand the Scotia Sea, warming and the loss of sea ice are less\npronounced, and there may even be a slight cooling across\nmuch of the continent (Vaughan et al. 2003, Turner et al.\n2009b). Nevertheless, some recent studies suggest that\nwarming may be more extensive than previously thought\n(Steig et al. 2009).\nGlobal and even regional climate change will bring with it\na number of potential risk factors for the World Ocean,\nincluding: increasing sea temperatures, increasing sea height,\nchanges to global ocean thermohaline circulation, increasing\nocean acidification, and changes to the freshwater content\nfollowing glacial melt (Parry et al. 2007, Nellemann et al.\n2008). For the Polar Regions where changes in sea ice\npatterns are also likely to occur, other consequential impacts\nwill potentially include increasing accessibility for fishing,\nscience and tourism, changes to commercial transport and\nshipping movements, increased pollution, and the introduction\nof alien species - all of which carry significant risks to marine\necosystems. Indeed, some of these risks (such as the\nintroduction of alien species in combination with altered\necosystem properties) remain poorly understood for marine\necosystems, despite the fact that similar risks have been\nexamined over a number of years and are now considered to\nbe key issues for terrestrial Antarctic systems (cf. Frenot et al.\n2005).\nThe consequences of climate change are potentially\nprofound. In this review we examine some of the potential\noutcomes of climate change and suggest possible approaches\nfor effective management of the Antarctic marine ecosystem.\nFirst we look at some of the taxa-specific threats, in order to\nunderstand the range of possible outcomes for a variety of\nspecies within the food web, and then consider some of the\nmanagement related issues and how these might be addressed\nif future management decisions are to be successful.\nUltimately, as the drivers of climate change originate\noutside the Antarctic, options within the Antarctic to restrict\nimpacts are limited. Nevertheless, exacerbation of climate\nchange impacts should not be allowed to occur through\ninappropriate management practices. Thus, as climate change\npotentially introduces a greater level of ecosystem uncertainty,\nsuccessful ecosystem outcomes potentially mean that\nmanagement practices may need to be more conservative.\nA recent synthesis of Antarctic climate change (Turner\net al. 2009a) summarizes some of the most important\nphysical effects and produces limits on the anticipated\ntemperature increase. This summary highlights i) how the\nozone hole has delayed the impact of greenhouse gas increases\non the climate of the continent (Turner et al. 2009b), ii) how\nthe Antarctic Circumpolar Current has warmed faster than the\nglobal ocean as a whole (Gille 2002), iii) how regional\nwarming caused by intensification of the westerly winds (due\nto the ozone hole) is melting ice shelves along the eastern\nAntarctic Peninsula (Turner et al. 2009b), how since 1980\nthere has been a 10% increase in Antarctic sea ice extent,\nparticularly in the Ross Sea region, as a result of the stronger\nwinds around the continent (due to the ozone hole), while\nregional sea ice has decreased west of the Antarctic Peninsula\ndue to changes in local atmospheric circulation and this has\nalso been linked with the very rapid warming seen over land\non the west coast of the Peninsula (Turner et al. 2009b), and\nhow over this century the ozone hole is expected to heal,\nallowing the full effects of greenhouse gas increases to be felt\nacross the Antarctic, with a predicted warming of about 38C\nacross the continent (Turner et al. 2009b).\nPotential impacts on invertebrates\nAntarctic marine invertebrates are typically considered to be\nstenothermal, that is only capable of living or growing within\na limited range of temperatures (e.g. Peck & Conway 2000).\nIf this proves to be the case, then they should be highly\nsensitive to predicted climate change. Experiments have\nshown that most species, including a wide range of (adult)\ninvertebrates, have upper lethal temperatures below or near to\n108C (Peck et al. 2004). Some can survive just a 78C\ntemperature window (Peck 2005, Peck et al. 2006, Po¨rtner\net al. 2007). However, even in the most severe warming\nscenarios a temperature rise of this magnitude in the Southern\nOcean is unlikely by 2100. Nevertheless, organisms can be\ncritically affected (e.g. chronic effects on feeding and\nreproduction) at lower temperatures long before lethal levels\narise (Peck et al. 2006). Key life-history stages might be\nparticularly sensitive to temperature. Nonetheless, whether\npopulations or species can survive future temperature rises\nmay actually be dictated by the sensitivity of all their life\nhistory stages to chronic as well as to lethal effects.\nOcean acidification associated with increased CO2 levels\nis also predicted to have a significant impact on calcium\ncarbonate skeletal maintenance of invertebrates (Royal\nSociety 2005). Aragonite based corals are most at risk,\nbut octocorals that use primarily calcite for their skeletons\nmay also be vulnerable. Whether species are positively\nor negatively impacted by increased temperatures, CO2\n388 P.N. TRATHAN & D. AGNEW\nhttp:\/\/journals.cambridge.org Downloaded: 14 Nov 2013 IP address: 194.66.0.114\nlevels or acidity levels, entire planktonic assemblages or\ncommunities may change and consequently potentially affect\nentire food web systems. However, it is still unclear how the\nrich invertebrate biodiversity of the Southern Ocean will\nrespond to medium\/long-term warming. Changes have been\nfound in some pelagic and benthic populations of some\nspecies over the past few decades, but as yet none have been\ndefinitively linked to climate change. Most of the evidence\ncurrently being discussed for how invertebrate organisms\nmight cope with temperature rises (or pH changes) is\nexperimental (Peck et al. 2006, Po¨rtner et al. 2007).\nHowever, it is clear that experimental approaches cannot yet\nreveal all of the evolutionary processes involved (Peck et al.\n2009). For example, there are a number of species of marine\ninvertebrates that exist both at the Antarctic Peninsula and at\nthe sub-Antarctic island of South Georgia; at this latter more\nnortherly site, the prevailing temperature regime is above the\nexperimental limits determined for some of the species used\nfrom the Peninsula. Indeed, a species’ ability to acclimate is\ncritical and rates of warming are crucial (Peck et al. 2009).\nMost of the impacts of climate change on invertebrate\nspecies are likely to affect benthic communities though some\nimpacts are also likely to affect pelagic communities. The\nchronic impacts on invertebrates currently considered to be\nimportant are (Turner et al. 2009a, Royal Society 2005):\na) Loss of habitat. The effects of direct warming might\nlead to reduced seasonal sea ice habitat, critical for\nsome species. This is likely to be a significant factor\nfor those euphausiid species that currently utilize sea\nice in their juvenile phases, such as krill (Nicol 2006,\nStammerjohn et al. 2008).\nb) Changes in medium-term and long-term physical\ndisturbance. This will be mainly due to: increases in\ncoastal sedimentation associated with ice melt;\nincreases in ice-loading and coastal concentrations\nof large icebergs from collapsing ice-shelves, and\nfreshening of surface waters leading to other changes\nsuch as altered stratification (Smale & Barnes 2008).\nc) Physiological effects. The effects of direct warming\nmight lead to reduced performance in critical activities\nand thus geographic and bathymetric migrations.\nIncreased metabolism with temperature may impact\non growth or feeding requirements (Peck et al. 2006).\nMajor stresses will also include ocean acidification and\nfreshening of the ocean, both of which will probably\nimpact upon the physiology of species (Royal Society\n2005). Many effects, however, are still essentially\nunknown.\nd) Increased ocean acidification. Increased CO2 levels will\nresult in increased ocean acidification, leading to skeletal\nsynthesis and maintenance problems, particularly for\ndeep water corals in the Antarctic, but also for other\ninvertebrates with aragonite skeletons such as pteropod\nmolluscs (Royal Society 2005). Carbonate de-saturation\nis predicted to occur first in deep high latitude waters,\nand therefore may significantly affect coral-based\nvulnerable marine ecosystems on Antarctic shelf\nslopes within the next 100 years (Royal Society 2005).\ne) Deoxygenation of the oceans. Warmer water holds less\ngas and therefore less O2, which may lead to a slight\ndeoxygenation of surface waters (Aoki et al. 2005).\nHowever, the disruption of currents and down-welling\ncould ultimately lead to more serious deoxygenation of\ndeeper layers. Such effects are difficult to predict\nhowever, as increased wind stress (Chan & Liu 2004,\nHogg et al. 2008) would lead to increased overturning.\nf) Competition with invasive species. Competition may arise\nfollowing natural range extensions of cold temperate\nspecies, or following human-induced range changes.\nHowever, compared with the terrestrial domain (Frenot\net al. 2005, Chown & Convey 2007), such competitive\ninteractions in the Antarctic marine environment are not\nwell understood. Throughout much of the Antarctic, the\nPolar Frontal Zone acts as a barrier to larval and juvenile\ndistribution. However, the barrier is not full depth and not\nalways effective (Barnes et al. 2006); for example, in the\nSouth Atlantic sector of the Southern Ocean a number of\nbenthic organisms already occur both on the Patagonian\nShelf and around the sub-Antarctic and Antarctic islands.\nThus, the likelihood of invasion following ocean\nwarming is high (Aronson et al. 2007). The narrow\nphysiological tolerance ranges of many Antarctic\norganisms may also make them poor competitors in an\naltered environment, compared with immigrants from\nmore northerly areas (Peck et al. 2006).\nPotential impacts on higher trophic levels\nThe impacts of climate change may cascade to higher trophic\nlevels (Castini et al. 2008). Such cascades may occur through\nmultiple pathways along which climatic and anthropogenic\npressures can propagate through food webs; these pressures\nmay act synergistically to cause and stabilize regime changes\nand are often mediated through zooplankton, which have a\ncrucial role in Antarctic ecosystem processes (Mollmann et al.\n2008). Consequently, species of direct interest to fisheries\nmanagers and tourist operators may be affected. For fish,\nseabirds and marine mammals impacts may be manifest in a\nvariety of ways, with most responses evident as changes in\nbehaviour, phenotypic expression or in genotype that result in\none or more of the following (Chambers et al. 2005, Trathan\net al. 2007):\na) Changes in distribution. It has been suggested that\nwarming will make the sub-Antarctic (and Antarctic)\nmore habitable to some more northerly ranging groups\nthat are currently poorly represented, for instance sharks\n(www.sciencecentric.com\/news\/080216313.htm 2008),\nCLIMATE CHANGE AND ECOSYSTEM MANAGEMENT IMPLICATIONS 389\nhttp:\/\/journals.cambridge.org Downloaded: 14 Nov 2013 IP address: 194.66.0.114\nand southern blue whiting (Micromesistius australis\nNorman) which is suspected of having undertaken\nfeeding migrations from the Patagonian shelf to the\nSouth Shetland and South Orkneys (Shust 1978, Agnew\net al. 2003). Thus, at its simplest, changes in distribution\nmay be evident as a pole-ward shift in range. However,\ngiven the complexity of landforms and ocean circulation\nin some regions, changes in distribution may be more\ncomplex, limited by both circulation and primary\nproductivity. Landmasses (and continental shelves) in\nthe Southern Ocean are essentially a set of island\nsystems, such that the smooth latitudinal shifts\ncurrently seen and expected in oceans bordering\ncontinents that run north–south (for instance in the\nNorth Sea; Perry et al. (2005); and modelled by\nCheung et al. (2009)) cannot simply be translated to\nthe Southern Ocean. Hence, it is not safe to assume\nthat there is a simple relationship between latitude\nand environmental conditions, and it is the latter\nrather than the former that limits ecological ranges. In\nthe high latitudes adjacent to the continent, pole-ward\nshifts are not feasible for some species; for example,\nemperor penguins (Jenouvrier et al. 2009) cannot\nmove further south, given their dependence on both\nfast sea ice and access to foraging grounds. In contrast\nat lower latitudes, chinstrap penguins (Pygoscelis\nantarctica Forster), which breed mainly on the\nAntarctic Peninsula and islands of the Scotia Arc,\nhave increased in numbers over the latter part of the\n20th century (Laws 1985, Rootes 1988). At the same\ntime, they have expanded their range southward along\nthe western side of the Antarctic Peninsula (Parmelee &\nParmelee 1987, Poncet & Poncet 1987) into areas\nhistorically dominated by the closely related Ade´lie\npenguin (P. adeliae Hombron & Jacquinot). Fraser\net al. (1992) suggested that the reason that chinstrap\npopulations were able to expand their range was that a\nlong-term decrease in the frequency of cold years with\nextensive sea ice cover induced by environmental\nwarming changed the relative availability of critical\nchinstrap and Ade´lie wintering habitats. Subsequently,\nTrathan et al. (1996) identified that it was the sea ice\nconditions outside the breeding season that played an\nimportant role in penguin population processes.\nb) Match-mismatch changes. Matching the timing of\nreproductive effort to prey availability is critical for\nsuccessful breeding in many higher trophic level\ntaxa. Many areas outside the Antarctic are already\nexperiencing the impacts of such effects. For instance,\nchanges in the availability of key copepod species\nat the time of cod egg hatching times appears to have\nbeen the most significant environmental factor\nimpacting the reduction of cod recruitment in the\nNorth Sea in the early 1990s (Beaugrand et al. 2003,\nBrander 2005). Match-mismatch also potentially explains\nhighly variable recruitment in some fish species, such as\nPatagonian toothfish (Dissostichus eleginoides Smitt)\nthat rely as juveniles on key prey species (Collins et al.\n2007), and which appear to experience only episodic\nrecruitment (Belchier & Collins 2008). Match-mismatch\nalso explains highly variable recruitment for some\npenguin colonies on the Antarctic Peninsula (Fraser &\nHoffmann 2003) and at South Georgia, where penguin\nbreeding performance is reduced when inputs of krill\nappear late in the season (BAS unpublished data). These\nmatch-mismatch events are likely to increase as warming\noceans and changing oceanographic structures alter the\ndistribution of pelagic ecosystems with respect to island-\nbased ecosystems. Indeed, Gille (2008) has recently\nhighlighted the poleward migration of the Antarctic\nCircumpolar Current, possibly driven by long-term\npoleward shifts in the winds of the region, as\nrepresented by the Southern Annular Mode. This\nwill potentially have profound consequences for\nmany island ecosystems.\nc) Changed patterns of movement. If the distribution of\nimportant prey species is altered by changes in the\nclimate, then regular predator commuting between\nbreeding sites and foraging grounds may be affected.\nSimilarly, migration routes between summer and\nwinter foraging grounds may also be altered. For\nexample, Fraser & Hofmann (2003) suggested that\nthere is a direct, causal relationship between climate\ndriven variability in sea ice cover, krill recruitment,\nprey availability and predator foraging ecology.\nFraser & Hofmann (2003) reported that in the West\nAntarctic Peninsula region, krill abundance tends to\ndecrease following years of poor krill recruitment\n(after years of anomalously low sea ice extent), and to\nincrease following years of good krill recruitment\n(after years of anomalously high sea ice extent); they\ngo on to suggest that penguin foraging trip duration is\nthen affected when krill abundance falls below a\ncritical threshold density. Above the density threshold\nof krill, penguin foraging trip duration remains more\nor less constant, while below it, foraging trip duration\nincreases with decreasing krill abundance. However,\nFraser & Hofmann (2003) noted that changes in krill\nabundance alone are probably not the only factors\naffecting foraging interactions.\nd) Changes in population density. Population sizes and\ndensities may change due to the direct effects of\nextreme environments, through impacts on vital rates,\nsuch as survival, fertility, or breeding success (Forcada\net al. 2008). Populations may then fragment, and genetic\ndiversity may be reduced. Recently, Forcada et al.\n(2008) examined the consequences of warming for a\n390 P.N. TRATHAN & D. AGNEW\nhttp:\/\/journals.cambridge.org Downloaded: 14 Nov 2013 IP address: 194.66.0.114\nvariety of Antarctic upper trophic level taxa and looked\nat their ability to survive changing patterns of climate\nand environmental variation. Forcada et al. (2008)\nfound strong statistical support for selection of life\nhistory traits that reduced interannual variation in\nfitness, including for species as diverse as emperor\npenguins, snow petrels, southern fulmars, Antarctic fur\nseals and Weddell seals. These authors suggested that all\nof these species maximized their fitness by maintaining\nlow interannual variance in the survival of adults and in\ntheir propensity to breed annually, properties that\nstrongly influence population growth rates. All of the\nspecies were able to buffer their vital rates against the\neffects of recent climate-driven habitat changes, apart\nfrom Antarctic fur seals breeding in the southwest\nAtlantic. In this area of the Atlantic, the rapid increases\nin ecosystem fluctuation, associated with increasing\nclimate variability, has affected fur seal food supplies,\nprincipally Antarctic krill; krill are now more limited\nand less predictable than in previous decades (Atkinson\net al. 2004). This has increased the costs of breeding for\nfemale fur seals, causing significant short-term changes\nin population structure through mortality and low\nbreeding output. Forcada et al. (2008) suggest that\nchanges occur now with a higher frequency than the\nmean female fur seal generation time, and consequently\nlimit their adaptive response. Also that fur seals are\nmore likely to rely on phenotypic plasticity to cope with\nshort-term changes in order to maximize individual\nfitness. Forcada et al. (2008) conclude that species\nwith less flexible life histories that are more\nconstrained by fluctuation in their critical habitats,\nsuch as sea ice, may experience demographic changes,\npopulation compensation and changes in distribution.\nSuch changes have already been observed for penguin\nspecies living in the Antarctic Peninsula and adjacent\nsub-Antarctic islands. More recently, Jenouvrier et al.\n(2009) have also suggested that emperor penguin\ncolonies may also suffer similar population declines\ndue to climate change.\ne) Changes in phenology. As a consequence of changed\nenvironmental conditions, a wide variety of processes\ncould alter in their absolute timing over the course of a\nyear, including, for example, dates of arrival at a\nspawning\/breeding site, dates of spawning in fish, dates\nof egg laying and of fledging in birds, or dates of pupping\nand weaning in marine mammals (e.g. Barbraud &\nWeimerskirch 2006a, 2006b). If temperature is a direct\ncue and if the degree of regional warming varies between\nregions, then some processes may also change in their\nrelative timing and in their relationship to each other and\nthis could then have further ecological implications.\nThe timing of egg laying for gentoo penguins breeding at\nBird Island, South Georgia has changed in recent years.\nThe appearance of the first egg at two monitored study\ncolonies is now some ten days earlier, on average, than it\nwas 18 years ago; also, the date by which 75% of eggs\nhave been laid, is also similarly much earlier (BAS\nunpublished data). In contrast, Barbraud & Weimerskirch\n(2006a, 2006b) have shown that the date of first arrival\nand the date of first egg laying have advanced\nsignificantly for a range of Antarctic seabirds breeding\nin East Antarctica, where the sea ice season duration has\nincreased in recent years.\nf) Changes in behaviour. Diurnal patterns of activity and\nbehaviour may also change as a consequence of altered\nenvironmental conditions. For example, net foraging\neffort may increase for gentoo penguins if environmental\ncascades result in altered ecosystem properties and\ndifferences in preferred prey abundance (BAS\nunpublished data). Similarly, other behaviours may\nalso alter as a result of changed environmental conditions.\nFor instance, in warm years that are also years of low krill\navailability, macaroni penguins may switch prey from\nAntarctic krill to Themisto gaudichaudii Guerin (BAS\nunpublished data). Equally, shivering responses by young\nseabirds may also increase if they are exposed to elevated\nlevels of rain, rather than snow (Hooper 2007).\ng) Change in community interactions. If climate change\nimpacts upon a number of trophic levels, then\nwholesale community changes may become evident.\nThis may be apparent as a ‘regime shift’ (Rodionov\n2004) or as changes in the foodweb as new species\ninteractions or predator-prey interactions develop.\nClimate variability is known to have important effects\non marine ecosystems (Trathan & Murphy 2002,\nTrathan et al. 2003, 2006, 2007, Forcada et al. 2005,\n2006, 2008, Leaper et al. 2006, Murphy et al. 2007),\nwith repercussions that range in scale from those that\nimpact upon individuals to those that impact the\nentire food web. Climate-induced changes in the\nabundance of species in lower trophic levels can\ncascade upwards to apex predators by depressing their\nvital rates (Murphy et al. 2007, Forcada et al. 2008).\nFor example, climate warming and associated sea ice\nreductions in the Antarctic have modified habitat\nconditions for some penguin species (Forcada et al.\n2006). These include Ade´lie, chinstrap and gentoo\npenguins, which now demonstrate remarkable\npopulation responses to regional warming. However,\nunderstanding the causal processes is complex, given\nthe inconsistencies in the direction of population\nchanges between species at different study sites. The\nnumbers of gentoo penguins breeding on the South\nOrkney Islands have increased significantly over the\npast three decades, whereas the numbers of chinstrap\nand Ade´lie penguins have both declined. These trends\nCLIMATE CHANGE AND ECOSYSTEM MANAGEMENT IMPLICATIONS 391\nhttp:\/\/journals.cambridge.org Downloaded: 14 Nov 2013 IP address: 194.66.0.114\nhave occurred in parallel with regional long-term\nwarming and significant reduction in sea ice extent.\nPeriodical warm events have led to cycles in sea ice\nleading to reductions in prey biomass, and simultaneous\ninterannual population changes in the three penguin\nspecies. Ade´lie penguins have been poorly buffered\nagainst reductions in sea ice; their population response\nhas been negative and linear. Conversely, though gentoo\npenguins have also been negatively affected in years\nwith extensive sea ice, their populations have increased,\npotentially due to increases in their available niche.\nFinally, though chinstrap penguins have also been\nnegatively affected in years of increased sea ice cover,\ntheir responses have been variable and nonlinear.\nThus, the consequences of global climate perturbations\nhave affected the regional marine ecosystem, with\nrepercussions for penguin food supply and competition\nfor resources. Ultimately, variability in penguin\npopulations reflects the local balance between penguin\nadaptation to ice conditions and trophic-mediated\nchanges cascading from global climate forcing.\nh) Changes in morphology or physiology. As environmental\nconditions alter, animal populations may respond by\nchanges in morphology, such as changes in body mass\nor breeding performance, either as a result of energetic\nconstraints, or because of altered physiological\nefficiencies. Indeed, the overall conclusion of\nCheung et al. (2009), was that the physiological\nspecialization of high latitude marine organisms will\nmake them particularly vulnerable to extinction,\nand that the maximum potential for species turnover\nand invasions will be in the 408–608S region, if\noceanography permits this. Changes in morphology\nand physiology potentially lead to sub-speciation and\neventually effective speciation. For example, using\nBayesian inference of ancestral areas Baker et al.\n(2006) showed that an Antarctic origin is highly likely\nfor extant taxa of penguins, but that more derived\ntaxa occur in lower latitudes. Baker et al. (2006)\nfurther suggest that, as Antarctica cooled in the Eocene\n(40 m.y.a.), modern penguins expanded via the\ncircumpolar current to the oceanic islands within the\nAntarctic Polar Frontal Zone, and later to the southern\ncontinents. Thus, global cooling has had a major impact\non penguin evolution. Penguins only reached cooler\ntropical waters in the Galapagos Islands about 4m.y.a.,\nand have not yet crossed the equatorial thermal barrier.\nThough some penguin species have evolved into\nsubspecies (Williams 1995), no subspecies differences\nhave been attributed to recent environmental change.\nMany of the biological impacts described above may be\nplausibly attributed to climate change; however, evidence\nof unambiguous, causal mechanisms, remains elusive and\nrigorous and comprehensive examination of the underlying\nprocesses is still required (Croxall et al. 2002), particularly\nfor those species that spend much of their lives outside the\nSouthern Ocean in neighbouring ecosystems.\nEcosystem considerations\nThe Southern Ocean is a site of rapid regional climate change\n(Parkinson 2002, 2004, Vaughan et al. 2003). However,\npredictions concerning the possible impacts of climate change\nare subject to a high degree of uncertainty, with differing but\nplausible outcomes. In addition to such uncertainty, there is\nuncertainty about the pre-exploited state, whether it was\nstable, oscillating stable or whether there were apparent\ntrends. Today it is a highly dynamic system with considerable\ninterannual variability superimposed upon apparent trends in\nboth physical and biological components. Such dynamic\nsystems are by their very nature difficult to predict with any\ndegree of certainty (e.g. Trathan et al. 2006, Murphy et al.\n2007). Consequently, understanding ecosystem change in the\nSouthern Ocean is complex, requiring information over many\nspatial and temporal scales.\nElsewhere in the World Ocean, anthropogenic disturbances\ncoupled with climatic changes have been demonstrated to\nhave a large impact on marine ecosystems, which may then\ncascade throughout the entire food web (Castini et al. 2008).\nThis makes it essential to understand the mechanisms and\npathways by which ecosystems respond. Climate change and\noverfishing are likely to cause rapid restructuring of highly\nproductive marine ecosystems with effects on taxa throughout\nthe pelagos and the benthos (Kirby et al. 2009). Unchecked,\ntrophic cascades favouring lower trophic level groups may\nresult in a proliferation of algal blooms (Castini et al. 2008) or\njellyfish (Kirby et al. 2009). Such results suggest that efforts\nshould be directed to preserve structure and functioning for\nthe higher trophic levels (Castini et al. 2008).\nIn the short-term, we are unlikely to reverse current\nclimate and human-induced effects via ecosystem resource\nmanagement (Kirby et al. 2009). Instead, we must\nunderstand and adapt to new ecological regimes. This\nimplies that ecosystem and fisheries management in the\nAntarctic must be fully integrated with an understanding of\nthe ecological consequences of climate change. There will\nbe a clear benefit from encouraging the development of\nscience that predicts and assesses the uncertainty of effects\nand improves our predictive ability to estimate the timing\nand magnitude of resulting impacts.\nRe-examination of CCAMLR’s precautionary\napproach\nThe Convention for the Conservation of Antarctic Marine\nLiving Resources (CCAMLR) is responsible for the\nmanagement of sustainable and rational harvesting of all\nliving resources in the Southern Ocean, with the exception\nof seals (Convention for the Conservation of Antarctic\n392 P.N. TRATHAN & D. AGNEW\nhttp:\/\/journals.cambridge.org Downloaded: 14 Nov 2013 IP address: 194.66.0.114\nSeals) and whales (International Whaling Commission).\nCCAMLR manages within an ecosystem framework, taking\ninto account ecosystem components other than targeted\nspecies. CCAMLR’s responsibilities therefore extend beyond\nthe management of harvesting, encompassing ecosystem\nand species conservation and related issues. CCAMLR is\ntherefore at the forefront of the management debate when\nit comes to understanding how climate change affects\nspecies, and also, how its management practices may interact\nwith these effects.\nCCAMLR operates using the precautionary approach.\nArticle II of the Convention states that, taking into account\nthe state of available knowledge, harvesting should be\nconducted in such a manner that it prevents changes or\nminimizes the risk of changes to the marine ecosystem that\nare not potentially reversible over two or three decades.\nCCAMLR has responded to this uncertainty (of different\ntypes - observation uncertainty, process uncertainty,\nimplementation uncertainty) by operationalizing the\nprecautionary approach - for instance through the use\nof a network of precautionary closed areas, precautionary\ntarget and limit reference points within decision rules and\nclose monitoring for effects. However, the uncertainties\nconsidered thus far have largely been uncertainties\nassociated with ‘‘status quo’’ environmental effects.\nTo move away from status quo considerations, recent\necosystem models used by CCAMLR’s Working Group\non Ecosystem Monitoring and Management have been\nconstructed to take into account trends in the populations of\nAntarctic predators and prey, and to interpret change in\nrelation to the changes that might be expected in the absence\nof fishing (SC-CCAMLR 2008\/Annex 4, paragraph 2.65).\nTo fulfil its international obligation, CCAMLR will need to\nre-examine its approach to precaution in the light of the\npotential for major ‘‘natural’’ climate induced changes that we\noutline above. Where there is evidence of a regime shift in an\necosystem, or where there are apparent trends in a marine\nsystem such as may result from increasing temperatures, a\nnumber of ecosystem components may become vulnerable to\n(local) extinction. Under such scenarios, even moderate levels\nof harvesting may exacerbate any declines and populations\nmay not be able to recover within two to three decades in\nthe absence of fishing. Areas of particular concern may be\nthe increased vulnerability of benthic Vulnerable Marine\nEcosystems (VMEs) to damage when they are additionally\nstressed with increasing seawater temperatures and acidity,\nwhich is projected to be particularly severe for those at the\nlimits of current aragonite\/calcite solubility thresholds in\nAntarctic and deep waters (Royal Society 2005). Also of\nconcern are the effects on bycatch species, particularly species\ndependent on fixed locations for their distribution or breeding,\nas they may be additionally stressed by changes to their\nenvironment.\nCCAMLR may also need to consider whether and how\necosystems are likely to recover from perturbations in the\nface of climate change and how harvesting strategies may\nneed to be modified to accommodate the objectives of\nArticle II.\nPotential impacts associated with increased\naccessibility of the Antarctic\nAlthough all ecosystems can be expected to respond to\nclimate change in the ways outlined above, high latitude\nocean areas will experience a very fundamental change as\nthey lose permanent sea ice cover. Currently high latitude\nembayed systems experience near year-round ice cover,\nwhich acts to dampen wind induced oceanographic features\n(surface drift, upwelling etc.), provides habitat and refuge\nfor planktonic animals and habitat for higher predators. It\ncan therefore be argued that these areas (Ross Sea, Weddell\nSea, and smaller areas of ice retention around the continent)\nare likely to experience more significant ecosystem change\nthan lower latitudes. Unfortunately, information about the\nmarine foodweb in areas covered by seasonal sea ice is\ngenerally sparse, due in large part to the enormous logistic\ndifficulties of undertaking science in these remote and\nchallenging environments.\nThe threats to these areas come from their increasing\naccessibility - for example, from both legitimate and IUU\nfishing, from science and from tourism. There is therefore a\ncontinuing need for CCAMLR to engage to ensure that\nfishing in these previously ice-covered areas does not\ndevelop to the detriment of the marine ecosystem.\nHigh latitude fisheries are currently either closed or\nmanaged under CCAMLR’s new and exploratory fishery\nconservation measures. This precautionary approach has\nbeen adopted in order to ensure that adequate management\ninformation is available and so that risks to the ecosystem\ncan be minimized. However, the only factors currently\nprotecting toothfish populations in East Antarctica (FAO\nStatistical Areas 58.4.1 and 58.4.2) from increased IUU\nfishing are the low catch rates in these areas (and, hence,\nmarginal economic benefits) and the relatively short access\nwindow (generally three to four months in the summer).\nIncreased accessibility under conditions of reduced ice\ncover will inevitably increase risks from IUU fishing to\nthese areas.\nCCAMLR’s application of the precautionary approach to\nfisheries development, exemplified in the CCAMLR new\nand exploratory fisheries conservation measures requires\nthat fisheries should not expand faster than the acquisition\nof data required to manage them. Therefore, it might be\nexpected that considering the poor state of our knowledge\nabout currently ice-covered areas and the increased levels\nof uncertainty about ecosystem changes when ice cover\nreduces, that additional precaution should attend the\ndevelopment of exploratory fisheries in these areas.\nCCAMLR will therefore need to consider the extended\nCLIMATE CHANGE AND ECOSYSTEM MANAGEMENT IMPLICATIONS 393\nhttp:\/\/journals.cambridge.org Downloaded: 14 Nov 2013 IP address: 194.66.0.114\nuse of Marine Protected Area (MPA) networks, additional\nrequirements for data collection and research, additional\nrestrictions on fishery development and activities (e.g.\ntranshipment), and increased action against IUU vessels in\npreviously ice-covered areas.\nPotential impacts on CCAMLR managed fisheries\nThe impacts of climate change are likely to affect marine\ncapture fisheries in a number of ways. Many impacts will\nbe non-linear and some changes could be rapid and\nunpredictable. However, to safeguard against some of these\npotential changes, CCAMLR should examine various aspects\nof its stock assessment work, thereby making its work as\nrobust as possible to future climate change scenarios.\nThere are three major fishing areas in the Antarctic: the\nSouth Atlantic basin, which holds the highest diversity of\nfisheries, comprising Antarctic krill (Euphausia superba),\nmackerel icefish (Champsocephalus gunnari Lo¨nnberg)\nand Patagonian toothfish (Dissostichus eleginoides Smitt)\naround high latitude and sub-Antarctic island systems; the\nSouthern Indian Ocean which has significant sub-Antarctic\nisland fisheries for toothfish and icefish and small, perhaps\nmarginal, continental fisheries; and the Ross Sea, which has\na significant Antarctic toothfish fishery (Dissostichus mawsoni\nNorman). The potential for additional finfish fisheries is\nprobably small, but the prospect for new large krill fisheries\nmay be significant, particularly in the southern Indian Ocean\nsector.\nCurrently CCAMLR does not take into account\nenvironmental\/recruitment relationships in any of its\nstock assessment models, although there is the potential\nto do so (Francis 2006, SC-CCAMLR 2007\/Annex 4, para\n2.51, SC-CCAMLR 2008\/Annex 4, para 2.30). Furthermore,\nstock-recruit relationships are assumed to be known and\nstable. Should these change, for instance with a change in\ncarrying capacity arising from climate change, it would be\nnecessary to change the assumed stock-recruit relationship,\nwhich would require changing the stock reference points as\nwell. Although the CCAMLR decision rule would probably\nbe robust to this in the long-term, it is not clear how robust it\nwould be in the short-term to rapid changes in recruitment\ndynamics; this requires additional investigation through\nmodelling and management strategy evaluation.\nA number of pieces of evidence suggest that recruitment\nin Patagonian toothfish, mackerel icefish and Antarctic\nkrill, are all likely to be affected by changing ocean\ntemperatures (Hill et al. 2005, Murphy et al. 2007, Belchier\n& Collins 2008). Analyses of recruitment indices show that\nrecruitment is correlated with sea surface temperature with\na lag time equal to the age of the cohort. In such analyses,\nsea surface temperatures may not necessarily be acting\ndirectly on recruitment (though they could be); rather, they\nshould be considered as a convenient proxy for a range of\nother environmental variables. For all three species,\ndifferent environmental variables could be acting on the\npopulations. Though the precise nature of these interactions\nis as yet unclear, there is evidence for strong ecosystem\nconcordance that allows ocean temperature to act as a proxy\nfor other variables. Unfortunately much of this evidence is\nindirect and correlative, and since it is likely that if sea surface\ntemperature is only a proxy for successful conditions\n(oceanographic flow and direction, productivity and ideal\nmatching between prey and the occurrence of larval fish) it\nmay not hold under future changed conditions.\nAssessments of Antarctic krill currently rely upon a\nsingle synoptic survey undertaken in 2000 (Hewitt et al.\n2004). Perversely, despite the fact that krill have been\nstudied more extensively than icefish and toothfish since\nthe 1960s, our knowledge of krill population dynamics,\nrecruitment and ecosystem interactions remains relatively\npoor (Atkinson et al. 2004, 2008). Current surveys are not\nsufficient for understanding changing dynamics of\nrecruitment in krill, and there is as yet no accepted\nmethod for using commercial data to understand real-time\nkrill recruitment variability.\nLong-term predictions of recruitment strength based on\nan understanding of oceanographic influences (Belchier &\nCollins 2008) could be beneficial to stock assessments\nof toothfish. Relationships between stock recruitment\nand ocean temperatures may allow CCAMLR to manage\nkrill fisheries in a more structured ecosystem framework\n(Murphy et al. 2007). Knowledge about recruitment and\ncohort strength would potentially allow CCAMLR to develop\nmore realistic predictive models of stock abundance and cohort\npersistence, and to adjust harvesting regimes accordingly.\nHowever, these relationships may not be expected to hold\nunder changing environmental conditions, because most such\nrelationships are only valid for as long as the environmental\nregime remains relatively unchanged (Myers 1998).\nConsequently, and in the face of climate change, there is\na pressing need for more regular monitoring of recruitment\nand population dynamics in all stocks. Potentially the most\nurgent need is to understand krill population dynamics in\nmore detail and in real time as the fishery expands, and to\ndevelop a feedback management approach for this stock,\nparticularly as the recruitment and availability of krill\nappears to influence the dynamics of other fishery systems.\nManagement of all stocks would also benefit from a deeper\nunderstanding of the ecological and oceanographic causes\nof recruitment variability (Nicol 2006).\nEcosystem monitoring\nCCAMLR developed the CCAMLR Ecosystem Monitoring\nProgramme (CEMP) to indicate the short term response of\nkey ecosystem components to localized environmental\nconditions. The primary objective of CEMP was to monitor\nair breathing predators in order to distinguish between the\n394 P.N. TRATHAN & D. AGNEW\nhttp:\/\/journals.cambridge.org Downloaded: 14 Nov 2013 IP address: 194.66.0.114\neffects of natural variability and the potential impacts of\ncommercial harvesting for krill. The harvesting of other\nspecies, or variability in other aspects of both krill-centric\nand non krill-centric ecosystems was not an objective of the\nprogramme, and CEMP is poorly equipped to detect\nchanges in these components. Furthermore, under various\nclimate change scenarios it is also likely that it will become\nincreasingly difficult even to distinguish between natural\nand fishing-induced impacts on the narrow range of krill-\ncentric predators considered by the programme. This is\nbecause the programme has not been designed optimally to\ndetect these changes against a background of large, and\nunpredictable, natural fluctuations such as those likely to be\nseen during significant climate change. For example, even\nin the absence of any potential impacts from harvesting, it\nis likely that populations of dependent species will alter\nunder a variety of climate change scenarios (SC-CCAMLR\n2009\/Annex 4, para 3.99–3.102, 7.11). This is already\nevident in the well-documented example of population\nmovements of Ade´lie and chinstrap penguins in the\nAntarctic Peninsula region (Fraser et al. 1992, Trathan\net al. 1996, Fraser & Hofmann 2003, Forcada et al. 2006).\nConsequently, CCAMLR now needs to give consideration\nto how such factors might be distinguished in the future.\nCEMP data do not directly indicate population size,\nwhich is the parameter that many conservation objectives\nattempt to control. Furthermore, CEMP data cannot be used\nin a standard environmental impact assessment framework\nas they lack control sites. Although CCAMLR has\nidentified 17 Small Scale Management Units for the krill\nfishery in the south-west Atlantic, comprehensive suites of\nCEMP parameters are regularly collected for krill predators\nfrom only six of these, and by only three Members\n(Argentina, the UK and the USA). CCAMLR has also\nrecently reported (SC-CCAMLR 2008) a gradual decline in\nthe number of parameters regularly monitored and reported\nto the CCAMLR Secretariat, from a high point around 2000\nback to levels last seen in the early 1990s. Four of the\nSSMUs have no coastal areas, thus they require quite a\ndifferent monitoring approach to that adopted for coastal\nareas, but they may contain significant proportions of\nthe krill population (Atkinson et al. 2008). Amongst the\ncoastal monitoring sites, monitoring is almost exclusively\nundertaken during the summer breeding season, with little\nknown about the behaviour and survivorship of animals in\nthe winter. Finally, the placement of CEMP sites has been\nopportunistic (usually dependent upon existing national\nmonitoring programmes) and is not appropriate for the\nbroader scale monitoring required to detect impacts from\nfisheries and to separate these from those impacts that may\narise from environmental forcing.\nIdentifying how CEMP data could be used in an\necosystem management strategy that goes beyond the\nnarrow requirements of understanding the impacts of the\nkrill fishery is an important challenge. Even a system that\nmight be able to distinguish between fishery- and non-\nfishery relative effects on krill distribution is not yet proven\n(SC-CCAMLR 2003\/Annex 4, para 2.7), and as we have\nearlier shown even this rather narrow task has been made\nmuch more difficult by the overlaying of the unpredictable\neffects of climate change onto an already highly variable\necosystem. Potential strategies for making the CEMP system\nmore robust should, in our opinion, include consideration of\nthe designation of true control SSMUs (i.e. those with no\nfishing, but with very similar ecosystem properties and\npredator population dynamics to other areas where fishing is\nallowed, and with the requirement that a comprehensive and\ncoordinated suite of parameters are monitored in each area);\nthe development of methods for inferring impacts between\ndifferent CEMP sites and SSMUs; and the extension of the\nsuite of monitored parameters to include other aspects of the\necosystem (especially the non-krill centric system) that are of\ninterest in the context of climate change (see also Constable &\nDoust 2009).\nThe expected ecosystem state is likely to shift as a\nconsequence of climate change (and other influences\non long-term dynamics). Comparisons with historical\nbaselines are therefore likely to be misleading. It will\ntherefore become increasingly difficult to determine\nwhether CCAMLR is meeting its obligations under the\nConvention; and indeed, what those obligations mean,\nparticularly Article II (3) (iii), the avoidance of impacts\nthat are not potentially reversible in two or three decades.\nThus, CCAMLR needs to revisit these objectives in terms\nof its management approaches, not only for harvested\nstocks, but also for other ecosystem components. For\nexample, CCAMLR needs to evaluate ecosystem status in\ncomparison with an assumed no-fishing state, rather than in\ncomparison with a recent or past historical baseline\n(indeed, CCAMLR needs to recognize that actual or real\nhistorical baselines are no longer accessible, due to the\nmajor disturbance associated with two centuries of\nhistorical exploitation e.g. Bonner 1984, Kock 1992). This\napproach is similar to that taken by some Regional Fisheries\nManagement Organisations already, such as the Western and\nCentral Pacific Fisheries Commission which calculates\ncurrent target (tuna) stock biomass with respect to the state\nthat they would be without fishing, and does not compare\nthese to historical baselines, which are not considered to be\nappropriate (Sibert et al. 2006). CCAMLR will then need to\nrecognize the uncertainty inherent in such predictions of the\nno-fishing state and to devise approaches that can function\neffectively despite this uncertainty.\nTo improve our understanding of shifting baselines,\nCCAMLR must encourage a greater scientific research\neffort that encompasses the complete annual cycle allied\nwith more frequent sampling. CCAMLR also needs to\nconsider how best to utilize information from tourist\/fishing\nvessels and the need to conduct designed research\nprogrammes that utilize such vessels (i.e. not just scientific\nCLIMATE CHANGE AND ECOSYSTEM MANAGEMENT IMPLICATIONS 395\nhttp:\/\/journals.cambridge.org Downloaded: 14 Nov 2013 IP address: 194.66.0.114\nobservations). Such research should not be constrained\n(either spatially or temporally) to the operation of individual\nnational programmes. Thus, CCAMLR needs to consider\nship-based monitoring from tourist\/fishing vessels on an\nannual scale comparable to that from CEMP predator\nmonitoring.\nConcluding remarks\nWe are moving towards a situation where we can begin to\nmake reasonable, broad estimates of how variables such as\ntemperature, precipitation and even ocean acidity and sea ice\nextent might change under a range of climate scenarios, and to\nconsider possible impacts upon marine biota. Though such\nimpacts need to be considered in the context of natural\nvariability and in the context of other anthropogenic impacts,\nsuch as historical harvesting, signals from climate change are\nlikely to become increasingly important within the Southern\nOcean management framework.\nCCAMLR is already at the forefront of the management\ndebate when it comes to understanding how climate change\naffects species and also how its monitoring approach and\nmanagement practices may interact with these effects. The\nbackground to these discussions is well documented in the\nCCAMLR Scientific Reports (available at www.ccamlr.org\/\npu\/e\/e-pubs\/sr\/drt.htm). However, to maintain this impetus we\nsuggest that in order for CCAMLR to fulfil its international\nobligations, it will be essential for it to determine the relative\nrisks (uncertainties), impacts and timescales, of the various\nprocesses consequent on climate change.\nWith current levels of understanding, such a risk\nassessment should be feasible and should provide a focus\nfor future work. As part of this process, we consider that it\nwill be important to focus effort on those issues that have the\nbiggest impact and where it is feasible to reduce uncertainty\nby the greatest amount. All of the risks described in this essay\nprobably vary with latitude and longitude, with regional\nclimate change, with local intensity of fishing, and with local\nfoodweb structure, etc. Therefore, a plan for the future should\ninvolve shared responsibility (e.g. with SCAR) for each of the\nrisks described.\nAcknowledgements\nThis essay was developed from a review originally submitted\nto the CCAMLR Scientific Committee, Hobart, Australia,\n27–31 October 2008 and revised for the CEP\/CCAMLR\nWorkshop, Baltimore, USA, 3–4 April 2009 and the meeting\non the CCAMLR Working Group on Ecosystem Monitoring\nand Management, Bergen, Norway, 6–17 July, 2009. We are\nextremely grateful to the numerous colleagues, particularly\nfrom the CCAMLR community, who have given us the\nbenefit of their constructive comments and criticisms, in\nparticular Beth Fulton and Andrew Constable who reviewed\nan earlier version of this manuscript.\nReferences\nAGNEW, D.J., MARLOW, T.R., LORENZEN, K., POMPERT, J., WAKEFORD, R.C. &\nTINGLEY, G.A. 2003. Influence of Drake Passage oceanography on the\nparasitic infection of individual year-classes of southern blue whiting\nMicromesistius australis. Marine Ecology Progress Series, 254, 281–291.\nAOKI, S., BINDOFF, N.L. & CHURCH, J.A. 2005. Interdecadal water mass\nchanges in the Southern Ocean between 308E and 1608E. Geophysical\nResearch Letters, 32, 10.1029\/2004GL022220.\nARONSON, R.B., THATJE, S., CLARKE, A., PECK, L.S., BLAKE, D.B., WILGA,\nC.D. & SEIBEL, B.A. 2007. Climate change and invasibility of the\nAntarctic benthos. Annual Review of Ecology, Evolution, and\nSystematics, 38, 129–154.\nATKINSON, A., SIEGEL, V., PAKHOMOV, E. & ROTHERY, P. 2004. Long-term\ndecline in krill stock and increase in salps within the Southern Ocean.\nNature, 432, 100–103.\nATKINSON, A., SIEGEL, V., PAKHOMOV, E.A., ROTHERY, P., LOEB, V., ROSS, R.M.,\nQUETIN, L.B., SCHMIDT, K., FRETWELL, P., MURPHY, E.J., TARLING, G.A. &\nFLEMING, A.H. 2008. Oceanic circumpolar habitats of Antarctic krill.\nMarine Ecology Progress Series, 362, 1–23.\nBAKER, A.J., PEREIRA, S.L., HADDRATH, O.P. & EDGE, K.A. 2006. Multiple\ngene evidence for expansion of extant penguins out of Antarctica due to\nglobal cooling. Philosophical Transactions of the Royal Society of\nLondon, B273, 11–17.\nBARBRAUD, C. & WEIMERSKIRCH, H. 2006a. Antarctic avian phenology and\nclimate change. Journal of Ornithology, 147, 52–52.\nBARBRAUD, C. & WEIMERSKIRCH, H. 2006b. Antarctic birds breed later in\nresponse to climate change. Proceedings of the National Academy of\nSciences, 103, 6248–6251.\nBARNES, D.K.A., HODGSON, D.A., CONVEY, P., ALLEN, C.S. & CLARKE, A.\n2006. Incursion and excursion of Antarctic biota: past, present and\nfuture. Global Ecology and Biogeography, 15, 121–142.\nBEAUGRAND, G., BRANDER, K.M., LINDLEY, J.A., SOUISSI, S. & REID, P.C.\n2003. Plankton effect on cod recruitment in the North Sea. Nature, 426,\n661–664.\nBELCHIER, M. & COLLINS, M.A. 2008. Recruitment and body size in relation\nto temperature in juvenile Patagonian toothfish (Dissostichus\neleginoides) at South Georgia. Marine Biology, 155, 493–503.\nBRANDER, K.M. 2005. Cod recruitment is strongly affected by climate when\nstock biomass is low. ICES Journal of Marine Science, 62, 339–343.\nBONNER, W.N. 1980. Whales. Poole: Blandford Press, 278 pp.\nBONNER, W.N. 1984. Conservation in the Antarctic. In LAWS, R.M., ed.\nAntarctic ecology, vol. II. London: Academic Press, 821–850.\nCASTINI, M., LOVGREN, J., HJELM, J., CARDINALE, M., MOLINERO, J.C. &\nKORNILOVS, G. 2008. Multi-level trophic cascades in a heavily exploited\nopen marine ecosystem. Philosophical Transactions of the Royal\nSociety of London, B275, 1793–1801.\nCHAMBERS, L.E., HUGHES, L. & WESTON, M.A. 2005. Climate change and its\nimpact on Australia’s avifauna. Emu, 105, 1–20.\nCHAN, J.C.L. & LIU, K.S. 2004. Typhoon intensity in a warming world.\nBulletin American Meteorological Society, 85, 660–661.\nCHEUNG, W.W.L., LAM, V.W.Y., SARMIENTO, J.L., KEARNEY, K., WATSON,\nR. & PAULY, D. 2009. Projecting global marine biodiversity impacts\nunder climate change scenarios. Fish and Fisheries, 10, 235–251.\nCHOWN, S.L. & CONVEY, P. 2007. Spatial and temporal variability across\nlife’s hierarchies in the terrestrial Antarctic. Philosophical Transactions\nof the Royal Society of London, B362, 2307–2331.\nCLARKE, A. & HARRIS, C.M. 2003. Polar marine ecosystems: major threats\nand future change. Environmental Conservation, 30, 1–25.\nCOLLINS, M.A., ROSS, K.A., BELCHIER, M. & REID, K. 2007. Distribution\nand diet of juvenile patagonian toothfish on the South Georgia and Shag\nRocks shelves (Southern Ocean). Marine Biology, 152, 135–147.\nCONSTABLE, A.J. & DOUST, S. 2009. Southern Ocean sentinel – an\ninternational program to assess climate change impacts on marine\necosystems. Hobart, TAS: ACE CRC, Commonwealth of Australia, and\nWWF-Australia, 82 pp.\n396 P.N. TRATHAN & D. AGNEW\nhttp:\/\/journals.cambridge.org Downloaded: 14 Nov 2013 IP address: 194.66.0.114\nCONVEY, P. 2006. Antarctic climate change and its influences on terrestrial\necosystems. In BERGSTROM, D.M., CONVEY, P. & HUISKES, A.H.L., eds.\nTrends in Antarctic terrestrial and limnetic ecosystems: Antarctica as a\nglobal indicator. Dordrecht: Springer, 253–272.\nCONVEY, P. 2007. Influences on and origins of terrestrial biodiversity of the\nsub-Antarctic islands. Papers and Proceedings of the Royal Society of\nTasmania, 141, 83–93.\nCOOK, A.J., PONCET, S., COOPER, A.P.R., HERBERT, D.J. & CHRISTIE, D.\n2010. Glacier retreat on South Georgia and implications for the spread\nof rats. Antarctic Science, 22, 10.1017\/S0954102010000064.\nCROXALL, J.P., TRATHAN, P.N. & MURPHY, E.J. 2002. Environmental change\nand Antarctic seabird populations. Science, 297, 1510–1514.\nFORCADA, J., TRATHAN, P.N. & MURPHY, E.J. 2008. Life history buffering\nin Antarctic mammals and birds against changing patterns of\nclimate and environmental variation. Global Change Biology, 14,\n2473–2488.\nFORCADA, J., TRATHAN, P.N., REID, K. & MURPHY, E.J. 2005. The effects of\nglobal climate variability in pup production of Antarctic fur seals.\nEcology, 86, 2408–2417.\nFORCADA, J., TRATHAN, P.N., REID, K., MURPHY, E.J. & CROXALL, J.P. 2006.\nContrasting population changes in sympatric penguin species in\nassociation with climate warming. Global Change Biology, 12,\n411–423.\nFRANCIS, R.I.C.C. 2006. Measuring the strength of environment–recruitment\nrelationships: the importance of including predictor screening within cross-\nvalidations. ICES Journal of Marine Science, 63, 594–599.\nFRASER, W.R. & HOFMANN, E.E. 2003. A predator’s perspective on causal\nlinks between climate change, physical forcing and ecosystem response.\nMarine Ecology Progress Series, 265, 1–15.\nFRASER, W.R., TRIVELPIECE, W.Z., AINLEY, D.G. & TRIVELPIECE, S. 1992.\nIncreases in Antarctic penguin populations - reduced competition with\nwhales or a loss of sea ice due to environmental warming. Polar\nBiology, 11, 525–531.\nFRENOT, Y., CHOWN, S.L., WHINAM, J., SELKIRK, P.M., CONVEY, P.,\nSKOTNICKI, M. & BERGSTROM, D.M. 2005. Biological invasions in the\nAntarctic: extent, impacts and implications. Biological Reviews, 80,\n45–72.\nGILLE, S.T. 2002. Warming of the Southern Ocean since the 1950s.\nScience, 295, 1275–1277.\nGILLE, S.T. 2008. Decadal-scale temperature trends in the Southern\nHemisphere Ocean. Journal of Climate, 21, 4749–4765.\nHALPERN, B.S., WALBRIDGE, S., SELKOE, K.A., KAPPEL, C.V., MICHELI, F.,\nD’AGROSA, C., BRUNO, J.F., CASEY, K.S., EBERT, C., FOX, H.E., FUJITA, R.,\nHEINEMANN, D., LENIHAN, H.S., MADIN, E.M.P., PERRY, M.T., SELIG, E.R.,\nSPALDING, M., STENECK, R. & WATSON, R. 2008. A global map of human\nimpact on marine ecosystems. Science, 319, 948–952.\nHEWITT, R.P., WATKINS, J.L., NAGANOBU, M., SUSHIN, V., BRIERLEY, A.S.,\nDEMER, D., KASATKINA, S., TAKAO, Y., GOSS, C., MALYSHKO, A.,\nBRANDON, M., KAWAGUCHI, S., SIEGEL, V., TRATHAN, P.N., EMERY, J.,\nEVERSON, I. & MILLER, D. 2004. Biomass of Antarctic krill in the Scotia\nSea in January\/February 2000 and its use in revising an estimate of\nprecautionary yield. Deep-Sea Research II, 51, 1215–1236.\nHILL, S.L., REID, K. & NORTH, A.W. 2005. Recruitment of mackerel icefish\n(Champsocephalus gunnari) at South Georgia indicated by predator\ndiets and its relationship with sea surface temperature. Canadian\nJournal of Fisheries and Aquatic Sciences, 62, 2530–2537.\nHOGG, A.M., MEREDITH, M.P., BLUNDELL, J.R. & WILSON, C. 2008. Eddy\nheat flux in the Southern Ocean: response to variable wind forcing.\nJournal of Climate, 21, 608–620.\nHOOPER, M. 2007. The ferocious summer: Palmer’s penguins and the\nwarming of Antarctica. London: Profile Books, 320 pp.\nJENOUVRIER, S., CASWELL, H., BARBRAUD, C., HOLLAND, M., STROEVE, J. &\nWEIMERSKIRCH, H. 2009. Demographic models and IPCC climate\nprojections predict the decline of an emperor penguin population.\nProceedings of the National Academy of Sciences, 27, 1844–1847.\nKIRBY, R.R., BEAUGRAND, G. & LINDLEY, J.A. 2009. Synergistic\neffects of climate and fishing in a marine ecosystem. Ecosystems, 12,\n548–561.\nKOCK, K.-H. 1992. Antarctic fish and fisheries. Cambridge: Cambridge\nUniversity Press, 359 pp.\nLAWS, R.M. 1985. The ecology of the Southern Ocean. American Scientist,\n73, 26–40.\nLEAPER, R., COOKE, J., TRATHAN, P.N., REID, K., ROWNTREE, V. & PAYNE,\nR. 2006. Global climate drives southern right whale (Eubalaena australis)\npopulation dynamics. Biology Letters, 2, 289–292.\nMAYEWSKI, P.A., MEREDITH, M.P., SUMMERHAYES, C.P., TURNER, J., WORBY, A.,\nBARRETT, P.J., CASASSA, G., BERTLER, N.A.N., BRACEGIRDLE, T., GARABATO,\nA.C.N., BROMWICH, D., CAMPBELL, H., HAMILTON, G.S., LYONS, W.B.,\nMAASCH, K.A., AOKI, S., XIAO, C. & VAN OMMEN, T. 2009. State of\nthe Antarctic and Southern Ocean climate system. Reviews of Geophyics,\n47, RG1003.\nMOLLMANN, C., MULLER-KARULIS, B., KORNILOVS, G. & ST JOHN, M.A. 2008.\nEffects of climate and overfishing on zooplankton dynamics and\necosystem structure: regime shifts, trophic cascade, and feedback loops\nin a simple ecosystem. ICES Journal of Marine Science, 65, 302–310.\nMURPHY, E.J., TRATHAN, P.N., WATKINS, J.L., REID, K., MEREDITH, M.P.,\nFORCADA, J., THORPE, S.E., JOHNSTON, N.M. & ROTHERY, P. 2007.\nClimatically driven fluctuations in Southern Ocean ecosystems.\nPhilosophical Transactions of the Royal Society of London, B274,\n3057–3067.\nMYERS, R.A. 1998. When do environment-recruitment correlations work?\nReviews in Fish Biology and Fisheries, 8, 283–305.\nNELLEMANN, C., HAIN, S. & ALDER, J., eds. 2008. In Dead Water - merging\nof climate change with pollution, over-harvest, and infestations in the\nworld’s fishing grounds. GRID-Arendal, Norway: United Nations\nEnvironment Programme, 64 pp.\nNICOL, S. 2006. Krill, currents, and sea ice: Euphausia superba and its\nchanging environment. BioScience, 56, 111–120.\nPARKINSON, C.L. 2002. Trends in the length of the Southern Ocean sea-ice\nseason, 1979–99. Annals of Glaciology, 34, 435–440.\nPARKINSON, C.L. 2004. Southern Ocean sea ice and its wider linkages:\ninsights revealed from models and observations. Antarctic Science, 16,\n387–400.\nPARMELEE, D.F. & PARMELEE, J.M. 1987. Updated penguin distribution for\nAnvers Island, Antarctica. British Antarctic Survey Bulletin, No. 76,\n65–73.\nPARRY, L., CANZIANI, O.F., PALUTIKOF, J.P., VAN DER LINDEN, P.J. &\nHANSON, C.E., eds. 2007. Climate change 2007: impacts, adaptation\nand vulnerability. Contribution of Working Group II to the Fourth\nAssessment Report of the Intergovernmental Panel on Climate Change.\nCambridge: Cambridge University Press, 976 pp.\nPECK, L.S. 2005. Prospects for surviving climate change in Antarctic\naquatic species. Frontiers in Zoology, 2, 10.1186\/1742-9994-2-9.\nPECK, L.S. & CONWAY, L.Z. 2000. The myth of metabolic cold adaptation:\noxygen consumption in stenothermal Antarctic bivalves. Evolutionary\nBiology Bivalvia, 177, 441–450.\nPECK, L.S., CONVEY, P. & BARNES, D.K.A. 2006. Environmental constraints\non life histories in Antarctic ecosystems: tempos, timings and\npredictability. Biological Reviews, 81, 75–109.\nPECK, L.S., WEBB, K.E. & BAILEY, D.M. 2004. Extreme sensitivity of\nbiological function to temperature in Antarctic marine species.\nFunctional Ecology, 18, 625–630.\nPECK, L.S., CLARK, M.S., MORLEY, S.A., MASSEY, A. & ROSSETTI, H. 2009.\nAnimal temperature limits and ecological relevance: effects of size,\nactivity and rates of change. Functional Ecology, 23, 248–256.\nPERRY, A.L., LOW, P.J., ELLIS, J.R. & REYNOLDS, J.D. 2005. Climate change\nand distribution shifts in marine fishes. Science, 308, 1912–1915.\nPONCET, S. & PONCET, J. 1987. Censuses of penguin populations of the\nAntarctic Peninsula, 1983–87. British Antarctic Survey Bulletin, No. 77,\n109–129.\nCLIMATE CHANGE AND ECOSYSTEM MANAGEMENT IMPLICATIONS 397\nhttp:\/\/journals.cambridge.org Downloaded: 14 Nov 2013 IP address: 194.66.0.114\nPO¨RTNER, H.O., PECK, L. & SOMERO, G. 2007. Thermal limits and\nadaptation in marine Antarctic ectotherms: an integrative view.\nPhilosophical Transactions of the Royal Society of London, B362,\n2233–2258.\nQUAYLE, W.C., PECK, L.S., PEAT, H., ELLIS-EVANS, J.C. & HARRIGAN, P.R.\n2002. Extreme responses to climate change in Antarctic lakes. Science,\n295, 645–645.\nRODIONOV, S.N. 2004. A sequential algorithm for testing climate regime\nshifts. Geophysical Research Letters, 31, 10.1029\/2004GL019448.\nROOTES, D.M. 1988. The status of birds at Signy Island, South Orkney\nIslands. British Antarctic Survey Bulletin, No. 80, 87–119.\nROYAL SOCIETY. 2005. Ocean acidification due to increasing atmospheric\ncarbon dioxide. Policy document 12\/05, June 2005. London: Royal\nSociety, 60 pp.\nSC-CCAMLR. 2003. Report of the Scientific Committee of the Commission\nfor the Conservation of Antarctic Marine Living Resources, SC-CAMLR-\nXXII\/Annex 4. Hobart: CCAMLR.\nSC-CCAMLR. 2007. Report of the Scientific Committee of the Commission\nfor the Conservation of Antarctic Marine Living Resources, SC-CAMLR-\nXXVI\/Annex 4. Hobart: CCAMLR.\nSC-CCAMLR. 2008. Report of the Scientific Committee of the\nCommission for the Conservation of Antarctic Marine Living\nResources, SC-CAMLR-XXVII\/Annex 4. Hobart: CCAMLR.\nSC-CCAMLR. 2009. Report of the Scientific Committee of the Commission\nfor the Conservation of Antarctic Marine Living Resources, SC-CAMLR-\nXXVIII\/Annex 4. Hobart: CCAMLR.\nSIBERT, J., HAMPTON, J., KLEIBER, P. & MAUNDER, M. 2006. Biomass, size,\nand trophic status of top predators in the Pacific Ocean. Science, 314,\n1773–1776.\nSHUST, K.V. 1978. On the distribution and biology of members of the\ngenus Micromesistius (Gadidae). Journal of Ichthyology, 18, 490–493.\nSMALE, D.A. & BARNES, D.K.A. 2008. Likely responses of the Antarctic\nbenthos to climate-related changes in physical disturbance during the\n21st century, based primarily on evidence from the West Antarctic\nPeninsula region. Ecography, 31, 289–305.\nSOLOMON, S., QIN, D., MANNING, M., MARQUIS, M., AVERYT, K.B., TIGNOR,\nM., MILLER, H.L. & CHEN, Z., eds. 2007. Climate change 2007: the\nphysical science basis. Contribution of Working Group I to the Fourth\nAssessment Report of the Intergovernmental Panel on Climate Change.\nCambridge: Cambridge University Press, 996 pp.\nSTAMMERJOHN, S.E., MARTINSON, D.G., SMITH, R.C. & IANNUZZI, R.A. 2008.\nSea ice in the western Antarctic Peninsula region: spatio-temporal\nvariability from ecological and climate change perspectives. Deep-Sea\nResearch II, 55, 2041–2058.\nSTEIG, E.J., SCHNEIDER, D.P., RUTHERFORD, S.D., MANN, M.E., COMISO, J.C.\n& SHINDELL, D.T. 2009. Warming of the Antarctic ice-sheet surface\nsince the 1957 International Geophysical Year. Nature, 457, 459-U4.\nTHOMPSON, D.W.J. & SOLOMON, S. 2002. Interpretation of recent Southern\nHemisphere climate change. Science, 296, 895–899.\nTRATHAN, P.N. & MURPHY, E.J. 2002. Sea surface temperature anomalies\nnear South Georgia: relationships with the Pacific El Nin˜o regions.\nJournal of Geophysical Research, 108, 8075–8078.\nTRATHAN, P.N., CROXALL, J.P. & MURPHY, E.J. 1996. Dynamics of Antarctic\npenguin populations in relation to the inter-annual variability in sea-ice\ndistribution. Polar Biology, 16, 321–330.\nTRATHAN, P.N., FORCADA, J. & MURPHY, E.J. 2007. Environmental forcing\nand Southern Ocean marine predator populations: effects of climate\nchange and variability. Philosophical Transactions of the Royal Society\nof London, B362, 2351–2365.\nTRATHAN, P.N., MURPHY, E.J., FORCADA, J., CROXALL, J.P., REID, K. &\nTHORPE, S.E. 2006. Physical forcing in the southwest Atlantic:\necosystem control. In BOYD, I.L., WANLESS, S. & CAMPHUYSEN, C.J.,\neds. Top predators in marine ecosystems. Cambridge: Cambridge\nUniversity Press, 28–45.\nTRATHAN, P.N., BRIERLEY, A.S., BRANDON, M.A., BONE, D.G., GOSS, C.,\nGRANT, S.A., MURPHY, E.J. & WATKINS, J.L. 2003. Oceanographic\nvariability and changes in Antarctic krill (Euphausia superba)\nabundance at South Georgia. Fisheries Oceanography, 12, 569–583.\nTURNER, J., BINDSCHADLER, R., CONVEY, P., DI PRISCO, G., FAHRBACH, E.,\nGUTT, J., HODGSON, D., MAYEWSKI, P. & SUMMERHAYES, C., eds. 2009a.\nAntarctic change and the environment. Cambridge: Scientific\nCommittee for Antarctic Research, 526 pp.\nTURNER, J., COMISO, J.C., MARSHALL, G.J., LACHLAN-COPE, T.A.,\nBRACEGIRDLE, T., MAKSYM, T., MEREDITH, M.P., WANG, Z.M. & ORR, A.\n2009b. Non-annular atmospheric circulation change induced by\nstratospheric ozone depletion and its role in the recent increase of\nAntarctic sea ice extent. Geophysical Research Letters, 36, L08502.\nVAUGHAN, D.G., MARSHALL, G.J., CONNOLLEY, W.M., KING, J.C. &\nMULVANEY, R. 2001. Climate change - devil in the detail. Science,\n293, 1777–1779.\nVAUGHAN, D.G., MARSHALL, G.J., CONNOLLEY, W.M., PARKINSON, C.,\nMULVANEY, R., HODGSON, D.A., KING, J.C., PUDSEY, C.J. & TURNER, J.\n2003. Recent rapid regional climate warming on the Antarctic\nPeninsula. Climate Change, 60, 243–274.\nWEIMERSKIRCH, H., INCHAUSTI, P., GUINET, C. & BARBRAUD, C. 2003. Trends\nin bird and seal populations as indicators of a system shift in the\nSouthern Ocean. Antarctic Science, 15, 249–256.\nWHITEHOUSE, M.J., MEREDITH, M.P., ROTHERY, P., ATKINSON, A., WARD, P.\n& KORB, R.E. 2008. Rapid warming of the ocean around South Georgia,\nSouthern Ocean, during the 20th century: forcings, characteristics and\nimplications for lower trophic levels. Deep-Sea Research I, 55,\n1218–1228.\nWILLIAMS, T.D. 1995. The penguins. New York: Oxford University Press,\n295 pp.\n398 P.N. TRATHAN & D. AGNEW\n"}