{"doi":"10.1063\/1.116530","coreId":"102827","oai":"oai:epubs.surrey.ac.uk:2372","identifiers":["oai:epubs.surrey.ac.uk:2372","10.1063\/1.116530"],"title":"Hardness, elastic modulus, and structure of very hard carbon films produced by cathodic-arc deposition with substrate pulse biasing","authors":["Pharr, GM","Callahan, DL","McAdams, SD","Tsui, TY","Anders, S","Anders, A","Ager, JW","Brown, IG","Bhatia, CS","Silva, SRP","Robertson, J"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"1996-02-05","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"AMER INST PHYSICS","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2372<\/identifier><datestamp>\n      2017-10-31T14:05:20Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:6E616E6F656C656374726F6E696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2372\/<\/dc:relation><dc:title>\n        Hardness, elastic modulus, and structure of very hard carbon films produced by cathodic-arc deposition with substrate pulse biasing<\/dc:title><dc:creator>\n        Pharr, GM<\/dc:creator><dc:creator>\n        Callahan, DL<\/dc:creator><dc:creator>\n        McAdams, SD<\/dc:creator><dc:creator>\n        Tsui, TY<\/dc:creator><dc:creator>\n        Anders, S<\/dc:creator><dc:creator>\n        Anders, A<\/dc:creator><dc:creator>\n        Ager, JW<\/dc:creator><dc:creator>\n        Brown, IG<\/dc:creator><dc:creator>\n        Bhatia, CS<\/dc:creator><dc:creator>\n        Silva, SRP<\/dc:creator><dc:creator>\n        Robertson, J<\/dc:creator><dc:publisher>\n        AMER INST PHYSICS<\/dc:publisher><dc:date>\n        1996-02-05<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2372\/1\/hardness_Pharr_96.pdf<\/dc:identifier><dc:identifier>\n          Pharr, GM, Callahan, DL, McAdams, SD, Tsui, TY, Anders, S, Anders, A, Ager, JW, Brown, IG, Bhatia, CS, Silva, SRP and Robertson, J  (1996) Hardness, elastic modulus, and structure of very hard carbon films produced by cathodic-arc deposition with substrate pulse biasing   APPLIED PHYSICS LETTERS, 68 (6).  pp. 779-781.      <\/dc:identifier><dc:relation>\n        http:\/\/apl.aip.org\/resource\/1\/applab\/v68\/i6\/p779_s1<\/dc:relation><dc:relation>\n        10.1063\/1.116530<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2372\/","http:\/\/apl.aip.org\/resource\/1\/applab\/v68\/i6\/p779_s1","10.1063\/1.116530"],"year":1996,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"DownloaHardness, elastic modulus, and structure of very hard carbon films\nproduced by cathodic-arc deposition with substrate pulse biasing\nGeorge M. Pharr, Daniel L. Callahan, Shaun D. McAdams, and Ting Y. Tsui\nDepartment of Materials Science, Rice University, Houston, Texas 77251-1892\nSimone Anders,a) Andre´ Anders, Joel W. Ager III, and Ian G. Brown\nLawrence Berkeley Laboratory, Berkeley, California 94720\nC. Singh Bhatia\nIBM Corporation, San Jose, California 95193\nS. R. P. Silva and John Robertson\nDepartment of Engineering, University of Cambridge, Cambridge CB2 1PZ, United Kingdom\n~received 23 March 1995; accepted for publication 16 November 1995!\nThe hardness, elastic modulus, and structure of several amorphous carbon films on silicon prepared\nby cathodic-arc deposition with substrate pulse biasing have been examined using nanoindentation,\nenergy loss spectroscopy ~EELS!, and cross-sectional transmission electron microscopy. EELS\nanalysis shows that the highest sp3 contents ~85%! and densities ~3.00 g\/cm3! are achieved at\nincident ion energies of around 120 eV. The hardness and elastic modulus of the films with the\nhighest sp3 contents are at least 59 and 400 GPa, respectively. These values are conservative lower\nestimates due to substrate influences on the nanoindentation measurements. The films are\npredominantly amorphous with a ;20 nm surface layer which is structurally different and softer\nthan the bulk. © 1996 American Institute of Physics. @S0003-6951~96!01105-6#A cathodic-arc plasma source equipped with a magnetic\nmacroparticle filter is an efficient tool for depositing high-\nquality thin films of metals, alloys, and compounds. To date,\nthe technique has been employed primarily in laboratory set-\ntings, but recent advances have led to large units capable of\nfull-scale commercial production.1 One material which has\nreceived a great deal of attention in cathodic-arc processing\nis amorphous carbon ~a-C!. In addition to being chemically\ninert, electrically insulating, transparent, and having a low\ncoefficient of friction, cathodic-arc carbon is of interest be-\ncause of its potential as thin coating material with very high\nhardness. Amorphous carbon has been deposited from a ca-\nthodic arc by various groups.2–8 Hardness values ranging\nfrom 26 GPa to over 60 GPa have been measured by nanoin-\ndentation methods. The difficulties of deriving hardness val-\nues for such hard, thin films on softer substrates are well\nrecognized.9 Nevertheless, the high values reported suggest\nthat a-C with very high hardness can be achieved by\ncathodic-arc deposition.\nThe key to producing high hardness in amorphous car-\nbon films appears to be in promoting high sp3 bond content\nthrough careful control of the energy of incident ions during\ndeposition.6,10–14 For cathodic-arc deposition, one way to\nachieve this is by substrate pulse biasing.15 Pulse biasing has\nan important advantage compared to dc bias in that, whereas\nwith dc bias electrical breakdown can result with pulsed bi-\nasing the applied voltage can be arbitrarily high ~the voltage\nis switched off before the high voltage plasma sheath ex-\npands to dangerous distances!.\nWe have investigated the properties of cathodic-arc car-\nbon as a function of biasing conditions and have found a set\na!Electronic mail: sanders@lbl.govAppl. Phys. Lett. 68 (6), 5 February 1996 0003-6951\/96\/68(6)\/7\nded¬20¬Sep¬2010¬to¬131.227.178.118.¬Redistribution¬subject¬to¬AIPof conditions which produces very hard films. Here, we re-\nport the hardness and elastic modulus of these films mea-\nsured by nanoindentation methods and the structure of the\nfilms determined by transmission electron microscopy\n~TEM! and electron energy loss spectroscopy ~EELS!.\nThe carbon films were deposited on silicon substrates\nusing a cathodic-arc plasma source combined with a 90° bent\nmagnetic macroparticle filter. The source and filter are de-\nscribed in detail elsewhere.16 The plasma source was oper-\nated in a repetitively pulsed mode with a pulse duration of 5\nms and a pulse repetition rate of 2 Hz. A cathodic-arc dis-\ncharge at a current of 300 A was used to create a fully ion-\nized carbon plasma which streamed out of the source at a\nvelocity of about 23106 cm\/s, corresponding to an ion en-\nergy of about 20 eV. The substrates were immersed in this\nhigh-density carbon plasma ~a density of about 1013 cm23!\nand repetitively pulse biased during the longer plasma pulse\nat a negative voltage and pulse duration of 2 ms. Bias volt-\nages of up to 22 kV and duty cycles of 25% were employed\n~i.e., pulse-off times of 6 ms!. The silicon substrates were\nmounted on a water-cooled sample holder which could be\nbiased at the desired voltage. Some properties of the result-\ning films, such as mass density, coefficient of friction, and\nresidual stress as a function of pulse bias voltage and duty\ncycle, have been described elsewhere.17,18\nEELS was performed to determine the sp3 bond con-\ntents of films deposited at substrate biases of 0, 2100, 2500,\nand 22000 V. The films were 200 nm thick and were pre-\npared for analysis by dissolving the silicon substrate in a\nsolution of HF, HNO3, and deionized ~DI! water. The films\nwere analyzed on a Phillips CM30 TEM operated at 100 kV\nwith the EELS collected on a Gatan 666 parallel spectrom-\neter at a collection angle of 10 mrad. The valence plasmon77979\/3\/$10.00 © 1996 American Institute of Physics\n¬license¬or¬copyright;¬see¬http:\/\/apl.aip.org\/about\/rights_and_permissions\nDownloand carbon K-edge losses were both collected under the same\nconditions. The valence plasmon gives the valence electron\ndensity and, hence, the mass density. The K edge gives the\nfraction of p* states in the conduction band and, hence, the\nfraction of sp2 sites. The fraction of p* states was deter-\nmined by fitting a Gaussian to the first peak around 285 eV,\nincluding a small Gaussian around 287 eV and a broad\nGaussian to the 290 eV edge. The fraction of sp2 sites ~with\nan accuracy of 65%! was found by comparing the ratio of\nthe area of the 285 eV peak to the 290 eV peak to that in\npolycrystalline graphite, which is 100% sp2, and the densi-\nties ~with an accuracy of 60.05 g\/ cm3! by scaling to the\nplasmon of graphite.6,19\nThe EELS results are summarized in Table I. The sp3\ncontent and mass density are greatest for the film deposited\nat 2100 V, equivalent to an incident ion energy of 120 eV.\nAs reported previously,17,18 this bias also produces a mini-\nmum for the friction coefficient, a maximum for the mass\ndensity, and a maximum for the residual compressive stress\nand agrees well with the results of Fallon et al.,6 who found\nmaxima in the intrinsic stress, resistivity, and percentage of\nsp3 bonding for cathodic-arc films deposited at ion energies\naround 140 eV. It is also in reasonable agreement with ion\nenergies used to achieve maximum sp3 content using other\ndeposition methods. For example, Weiler et al. have recently\nused a novel plasma beam source to prepare amorphous\nhydrogenated-carbon films from acetylene and found dis-\ncrete maxima in the sp3 content ~75%! and the nanoinden-\ntation hardness ~61 GPa! at an ion energy of 92 eV per inci-\ndent carbon atom.11\nThe hardness and elastic modulus of several films pro-\nduced at a bias of 2100 V were measured using nanoinden-\ntation techniques. A method similar to that outlined by Oliver\nand Pharr was used to carefully establish the tip geometry of\nthe Berkovich diamond indenter to allow for measurements\nat depths as small as 20 nm.20 Films of three different thick-\nness, 100, 200, and 320 nm, were tested to examine possible\ninfluence of the substrate on the measured properties. The\nfilms were produced using a two-step process in which a thin\nlayer, approximately 5 nm, was first deposited at the rela-\ntively high substrate bias of 22000 V followed by growth of\nthe majority of the film at 2100 V. The broad interfacial\nlayer produced in this way serves to improve film adhesion\nand reduce stress at the interface.\nThe results of the nanoindentation measurements are\nsummarized in Figs. 1 and 2, where the hardness, H, and\nYoung’s modulus, E, are plotted as a function of the inden-\ntation contact depth. For the sake of comparison, the figures\nalso include the results for a 300 nm a-C:H film prepared by\nTABLE I. EELS results.\nBias voltage\n~V!\nValence plasmon\n~eV!\nMass density\n~g\/ cm3!\nsp3 content\n~%!\nno bias 29.8 2.91 81\n2100 30.3 3.00 85\n2500 25.8 2.18 47\n22000 25.6 2.14 39780 Appl. Phys. Lett., Vol. 68, No. 6, 5 February 1996\naded¬20¬Sep¬2010¬to¬131.227.178.118.¬Redistribution¬subject¬to¬Asputter deposition on silicon in a hydrogen\/argon\natmosphere.21 The a-C:H film was 300 nm thick and con-\ntained about 20 at. % hydrogen, as determined by Rutherford\nbackscattering spectroscopy ~RBS! techniques.21 The a-C:H\nfilm is a useful reference, since it was tested at the same time\nas the cathodic-arc films, was deposited on the same sub-\nstrate material and has a comparable thickness to the thickest\ncathodic-arc film.\nExamination of Figs. 1 and 2 shows that the hardness\nand modulus of all four films tend toward those of the silicon\nsubstrate at large indenter depths. At small depths, e.g., about\n50 nm, properties more representative of the films are ob-\ntained. For the sputtered film, the small-depth hardness and\nelastic modulus are comparable to those of the silicon sub-\nstrate. In sharp contrast, however, the hardness and modulus\nof all three cathodic-arc films increase significantly for small\ndepths. The increase is the greatest for the thickest film,\nwhose peak hardness of 59 GPa is approximately four times\nthat of the sputtered film and nearly two thirds of the 90 GPa\nvalue commonly quoted for bulk crystalline diamond.22 The\n59 GPa hardness is approximately a factor of 2 greater than\nthat reported by Falabella et al.5 and is similar to the 61 GPa\nhardness observed by Weiler et al. for hydrogenated carbon\nfilms prepared by plasma beam techniques at the optimum\nion energy of 92 eV.11 The fact that there are no clear pla-\nteaus in the small-depth hardness and modulus indicates that\nthe measured values for the cathodic-arc films are not sub-\nstrate independent. The increase in peak hardness with film\nFIG. 1. Nanoindentation measurements of hardness for cathodic-arc and\nsputter-deposited carbon films on silicon as a function of indentation contact\ndepth.\nFIG. 2. Nanoindentation measurements of elastic modulus for cathodic-arc\nand sputter-deposited carbon films on silicon as a function of indentation\ncontact depth.Pharr et al.\nIP¬license¬or¬copyright;¬see¬http:\/\/apl.aip.org\/about\/rights_and_permissions\nDownloathickness is also consistent with this notion. Thus the true\nfilm hardness is probably higher than the measurements sug-\ngest and may approach that of diamond. Likewise, the elastic\nmodulus of the 320 nm cathodic-arc film, approximately 400\nGPa, also represents a lower limit. For comparison purposes,\nYoung’s modulus of polycrystalline diamond is 1140 GPa.22\nThe structure of the cathodic-arc films was examined in\ncross section by transmission electron microscopy. A bright\nfield image of a film approximately 300 nm thick is given in\nFig. 3.\nThe film has both surface and interface structure. At the\nsurface, a distinctly lighter layer, on the order of 20 nm thick,\nis observed in the bright field image. The contrast from this\nlayer is consistent with a lower density material and thus\nwhat would probably be a softer form of carbon. A similar,\nlower density surface layer was observed by Davis et al.23\nand may arise from the subsurface growth process of films\ndeposited from energetic ions leaving a less dense outer\nlayer. A gradual decrease in brightness is observed at the\ninterface between the surface layer and the bulk of the film.\nThis may arise from a thickness gradient ~due to slower bulk\nmilling rates!, a density gradient, or a combination of the two\neffects.\nTwo distinct layers are observed between the bulk of the\nfilm and the silicon substrate, each approximately 10 nm\nthick. Immediately adjacent to the silicon substrate is a dark\nlayer corresponding to a Si–C reaction layer. This layer is\nproduced by implantation of carbon into the substrate during\nthe 22000 V high bias applied during the initial portion of\nthe deposition process. Between the reaction layer and the\nbulk of the film lies a lighter phase which is consistent with\nlower density carbon codeposited during the high bias depo-\nsition. The interfacial structure is similar to that recently re-\nported by Gerstner et al.8\nIn conclusion, cathodic-arc deposition in conjunction\nwith substrate pulse biasing can be used to produce uniform\ncarbon films with hardnesses of at least 59 GPa. The 59 GPa\nvalue is a conservative estimate, due to substrate influences\nFIG. 3. A bright field TEM image showing a cathodic-arc film in cross\nsection.Appl. Phys. Lett., Vol. 68, No. 6, 5 February 1996\nded¬20¬Sep¬2010¬to¬131.227.178.118.¬Redistribution¬subject¬to¬AIPon the nanoindentation measurements, and it is conceivable\nthat the hardness approaches that of polycrystalline diamond\n~;90 GPa!. The substrate bias producing the films with the\nhighest sp3 content of 85% is near 2100 V, consistent with\nother studies. The films are predominantly amorphous with a\nthin, soft surface layer approximately 20 nm thick which is\nstructurally different from the bulk.\nThis work was supported by the U.S. Department of En-\nergy, Division of Advanced Energy Projects, under Contract\nNo. DE-AC03-76SF00098; by the Advanced Research\nProjects Agency as part of the National Storage Industry\nConsortium program in Ultra High Density Recording; and\nby the Division of Materials Sciences, U. S. Department of\nEnergy, under Contract DE-AC05-84OR21400 with Lock-\nhead Martin Energy Systems, Inc., and through the SHaRE\nprogram under Contract DE-AC05-76OR00033 with the Oak\nRidge Institute for Science and Education.\n1D. A. Baldwin and S. Falabella, 38th Society of Vacuum Coaters Technical\nConference Proceedings ~Society of Vacuum Coaters, Albuquerque, NM,\n1995!, pp. 309–316.\n2P. J. Martin, S. W. Filipczuk, R. P. Netterfield, J. S. Field, D. W. Whitnall,\nand D. R. McKenzie, J. Mater. Sci. Lett. 7, 410 ~1988!.\n3D. R. McKenzie, D. Muller, and B. A. Pailthorpe, Phys. Rev. Lett. 67, 773\n~1991!.\n4R. Lossy D. L. Pappas, R. A. Roy, J. J. Cuomo, and V. M. Sura, Appl.\nPhys. Lett. 61, 171 ~1992!.\n5S. Falabella, D. B. Boercker, and D. M. Sanders, Thin Solid Films 236, 82\n~1993!.\n6P. J. Fallon, V. S. Veerasamy, C. A. Davis, J. Robertson, G. A. J. Amara-\ntunga, W. I. Milne, and J. Koskinen, Phys. Rev. B 48, 4777 ~1993!.\n7H. J. Scheibe and B. Schultrich, Thin Solid Films 246, 92 ~1994!.\n8E. G. Gerstner, D. P. McKenzie, M. K. Puchert, and P. Y. Trimbell, J. Vac.\nSci. Technol. A 13, 406 ~1995!.\n9G. M. Pharr and W. C. Oliver, Mater. Res. Soc. Bull. 17, 28 ~1992!.\n10 J. J. Cuomo, D. L. Pappas, J. Bruley, J. P. Doyle, and K. L. Saenger, J.\nAppl. Phys. 70, 1706 ~1991!.\n11M. Weiler, S. Sattel, K. Jung, H. Ehrhardt, V. S. Veerasamy, and J. Rob-\nertson, Appl. Phys. Lett. 64, 2797 ~1994!.\n12Y. Lifshitz, S. R. Kasi, and J. W. Rabalais, Phys. Rev. Lett. 62, 1290\n~1989!.\n13Y. Lifshitz, G. D. Lempert, and E. Grossman, Phys. Rev. Lett. 72, 2753\n~1994!.\n14N. Savvides and T. J. Bell, J. Appl. Phys. 72, 2791 ~1992!.\n15A. Anders, S. Anders, I. G. Brown, M. R. Dickinson, and R. A. MacGill,\nJ. Vac. Sci. Technol. B 12, 815 ~1994!.\n16A. Anders, S. Anders, and I. G. Brown, Plasma Sources Sci. Technol. 4, 1\n~1995!.\n17S. Anders, A. Anders, I. G. Brown, B. Wei, K. Komvopoulos, J. W.\nAgerIII, and K. M. Yu, Surf. Coat. Technol. 68\/69, 388 ~1994!.\n18 J. W. Ager, S. Anders, A. Anders, and I. G. Brown, Appl. Phys. Lett. 66,\n3444 ~1995!.\n19S. D. Berger, D. R. McKenzie, and P. J. Martin, Philos. Mag. Lett. 57, 285\n~1988!.\n20W. C. Oliver and G. M. Pharr, J. Mater. Res. 7, 1564 ~1992!.\n21T. Y. Tsui, G. M. Pharr, W. C. Oliver, Y. W. Chung, E. C. Cutiongco, C. S.\nBhatia, R. L. White, R. L. Rhoades, and S. M. Gorbatkin, Mater. Res. Soc.\nSymp. Proc. 356, 767 ~1995!.\n22C. A. Brookes, in Properties of Diamond, edited by J. E. Field ~Academic,\nNew York, 383, 1979!.\n23C. A. Davis, G. A. J. Amaratunga, and K. M. Knowles, Surf. Coat. Tech-\nnol. ~to be published!.781Pharr et al.\n¬license¬or¬copyright;¬see¬http:\/\/apl.aip.org\/about\/rights_and_permissions\n"}