{"doi":"10.1111\/j.1365-3180.2008.00678.x","coreId":"140551","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/3251","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/3251","10.1111\/j.1365-3180.2008.00678.x"],"title":"Using stochastic dynamic programming to support weed management decisions over a\nrotation","authors":["Benjamin, L. R.","Milne, A. E.","Lutman, P. J. W.","Parsons, David J.","Cussans, J.","Storkey, J."],"enrichments":{"references":[{"id":37942952,"title":"A model of the economics of controlling Alopecurus myosuroides Huds. in winter wheat.","authors":[],"date":"1986","doi":"10.1016\/0261-2194(86)90096-7","raw":"DOYLE CJ, COUSENS R & MOSS SR (1986) A model of the economics of controlling Alopecurus myosuroides Huds. in winter wheat. Crop Protection 5, 143-150.","cites":null},{"id":37942951,"title":"A model of the effects of cultivation on the verticaldistribution of weed seeds within the soil.","authors":[],"date":"1990","doi":"10.1111\/j.1365-3180.1990.tb01688.x","raw":"COUSENS R & MOSS SR (1990) A model of the effects of cultivation on the verticaldistribution of weed seeds within the soil. Weed Research 30, 61-70.","cites":null},{"id":37942943,"title":"A model to simulate the growth, development and competitive effect of weeds in a winter wheat crop for use in a weed management decision support system.","authors":[],"date":"2009","doi":"10.1016\/j.cropro.2010.07.015","raw":"BENJAMIN LR, LUTMAN PJW & MILNE AE (2009) A model to simulate the growth, development and competitive effect of weeds in a winter wheat crop for use in a weed management decision support system. Weed Research (submitted).","cites":null},{"id":37942949,"title":"A simple model relating yield loss to weed density.","authors":[],"date":"1985","doi":"10.1111\/j.1744-7348.1985.tb01567.x","raw":"COUSENS R (1985) A simple model relating yield loss to weed density. Annals of Applied Biology 107, 239-252.","cites":null},{"id":37942945,"title":"Application of decision-support software for postemergence weed control.","authors":[],"date":"2003","doi":"10.1614\/0043-1745(2003)051[0618:aodsfp]2.0.co;2","raw":"BERTI A, BRAVIN F, & ZANIN G (2003) Application of decision-support software for postemergence weed control. Weed Science 51, 618-627.","cites":null},{"id":37942953,"title":"Arable Crops in Great Britain 2002. Pesticide Usage Survey Report 187, 108pp DEFRA,","authors":[],"date":"2002","doi":null,"raw":"GARTHWAITE DG, THOMAS MR, DAWSON A & STODDART H (2002) Arable Crops in Great Britain 2002. Pesticide Usage Survey Report 187, 108pp DEFRA, UKPage 20 of 29 HOLST N, RASMUSSEN IA & BASTIAANS L (2007) Field weed population dynamics: a review of model approaches and applications. Weed Research 47, 1-14.","cites":null},{"id":37942963,"title":"Biological flora of the British Isles.","authors":[],"date":"1981","doi":null,"raw":"SOBEY DG (1981) Biological flora of the British Isles. No. 150. Stellaria media (L.) Vill. Journal of Ecology 69, 311-335.","cites":null},{"id":37942964,"title":"Development and validation of Weed Management Support System (Weed Manager). HGCA project report 388, pp127,","authors":[],"date":"2006","doi":null,"raw":"TATNELL LV, CLARKE JH, GINSBURG D, LUTMAN PJW, MAYES A, BENJAMIN L, PARSONS DJ, MILNE AE, WILKINSON DJ & DAVIES DHK (2006) Development and validation of Weed Management Support System (Weed Manager). HGCA project report 388, pp127, HGCA, London.","cites":null},{"id":37942954,"title":"Dynamic programming and Markov processes.","authors":[],"date":"1960","doi":null,"raw":"HOWARDAJ (1960) Dynamic programming and Markov processes. Wiley, London.","cites":null},{"id":37942946,"title":"Effects on weed and invertebrate abundance and diversity of herbicide management in genetically modified herbicide-tolerant winter-sown oilseed rape.","authors":[],"date":"2005","doi":"10.1098\/rspb.2004.3049","raw":"BOHANDA, BOFFEYWHC, BROOKS DR, CLARKSJ et al., (2005) Effects on weed and invertebrate abundance and diversity of herbicide management in genetically modified herbicide-tolerant winter-sown oilseed rape. Philosophical Transactions of the Royal Society B 272, 463-474.","cites":null},{"id":37942955,"title":"Einfluss der grundbodenarbeitung auf die verunkrautung – ein beitrag zur prognose der verunkrautung","authors":[],"date":"1986","doi":null,"raw":"KNAB W & HURLE K (1986) Einfluss der grundbodenarbeitung auf die verunkrautung – ein beitrag zur prognose der verunkrautung Proceedings EWRS Symposium 1986, Economic Weed Control, Stuttgart, Germany, 309-316 MILLER ACE, LUTMAN PJW, WRIGHT KJ & WRIGHT GM (1998) A preliminary report on patterns of seedbank decline and the relationship between seedbank and seedling emergence for seven arable weed species in winter wheat. Aspects of Applied Biology 51, Weed seedbanks, determination and manipulation,,59-67.","cites":null},{"id":37942944,"title":"HADSSTM, Pocket HERBTM and WebHADSSTM: decision aids for field crops.","authors":[],"date":"2003","doi":null,"raw":"BENNETT AC, PRICE AJ, STURGILL MC, BUOL GS & WILKERSON GG (2003) HADSSTM, Pocket HERBTM and WebHADSSTM: decision aids for field crops. Weed Technology 17, 412-420.","cites":null},{"id":37942966,"title":"Long term studies of weed populations in winter wheat as affected by straw disposal, tillage and herbicide use.","authors":[],"date":"1989","doi":null,"raw":"WILSON BJ, MOSS SR & WRIGHT KJ (1989) Long term studies of weed populations in winter wheat as affected by straw disposal, tillage and herbicide use. Proceedings of the Brighton Crop Protection Conference, Weeds. BCPC, Farnham, UK, 131-136.","cites":null},{"id":37942958,"title":"Long-term modelling of weed control strategies: analysis of threshold-based options for weed species with contrasted competitive abilities.","authors":[],"date":"2002","doi":"10.1046\/j.1365-3180.2002.00267.x","raw":"MUNIER-JOLAIN NM, CHAUVEL B & GASQUEZ J (2002) Long-term modelling of weed control strategies: analysis of threshold-based options for weed species with contrasted competitive abilities. Weed Research 42, 107-122.","cites":null},{"id":37942950,"title":"Modelling the economics of controlling Avena fatua in winter wheat.","authors":[],"date":"1986","doi":"10.1002\/ps.2780170102","raw":"COUSENS R, DOYLE CJ, WILSON BJ & CUSSANS GW (1986) Modelling the economics of controlling Avena fatua in winter wheat. Pesticide Science 17, 1-12.","cites":null},{"id":37942961,"title":"Optimising weed management using stochastic dynamic programming to take account of uncertain herbicide performance.","authors":[],"date":"1995","doi":"10.1016\/0308-521x(94)00016-k","raw":"SELLS JE (1995) Optimising weed management using stochastic dynamic programming to take account of uncertain herbicide performance. Agricultural Systems 48, 271-296.","cites":null},{"id":37942965,"title":"Predicting yield loss due to interference from two weed species using early observations of relative weed leaf area.","authors":[],"date":"1997","doi":"10.1046\/j.1365-3180.1997.d01-52.x","raw":"VAN ACKER RC, LUTMAN PJW & FROUD-WILLIAMS RJ (1997) Predicting yield loss due to interference from two weed species using early observations of relative weed leaf area. Weed Research 37, 287-299.","cites":null},{"id":37942947,"title":"Seed viability and dormancy of 17 weed species after 9.7 years of burial in Alaska.","authors":[],"date":"1995","doi":"10.1614\/ws-05-161r.1","raw":"CONN JS & DECK RE (1995) Seed viability and dormancy of 17 weed species after 9.7 years of burial in Alaska. Weed Science 43, 583-585.","cites":null},{"id":37942956,"title":"The biology of weeds. Weed control handbook: principles.","authors":[],"date":"1990","doi":null,"raw":"MORTIMER AM (1990) The biology of weeds. Weed control handbook: principles. (eds Hance RJ & Holly K) Blackwell Scientific Publications, Oxford, UK: 1-42.","cites":null},{"id":37942962,"title":"The population dynamics of Anisantha sterilis in winter wheat: comparative demography and the role of management.","authors":[],"date":"1999","doi":"10.1046\/j.1365-2664.1999.00420.x","raw":"SMITH GL, FRECKLETON RP, FIRBANK LB & WATKINSON AR. (1999) The population dynamics of Anisantha sterilis in winter wheat: comparative demography and the role of management. Journal of Applied Ecology 36, 455-471.","cites":null},{"id":37942957,"title":"The seed cycle of Alopecurus myosuroides in winter cereals: a quantitative analysis. Symposium on integrated weed management in cereals.","authors":[],"date":"1990","doi":null,"raw":"MOSS SR (1990) The seed cycle of Alopecurus myosuroides in winter cereals: a quantitative analysis. Symposium on integrated weed management in cereals. Proceedings of EWRS Symposium, Helsinki, Finland, 4-6 June 1990, 27-35.","cites":null},{"id":37942960,"title":"The theory and application of plant competition models: an agronomic perspective.","authors":[],"date":"2003","doi":null,"raw":"PARK SE, BENJAMIN LR & WATKINSON AR (2003) The theory and application of plant competition models: an agronomic perspective. Annals of Botany 92, 741-748.Page 21 of 29 SELLS JE (1993) Calculating transition probabilities for modelling weed management options using stochastic dynamic programming. Agricultural Systems 41, 41-52.","cites":null},{"id":37942959,"title":"WeedSOFTReg.: a weed management decision support system.","authors":[],"date":"2004","doi":null,"raw":"NEESER C, DILLEJA,KRISHNANG,MORTENSENDA,RAWLINSONJT,MARTINAR &BILLS LB (2004) WeedSOFTReg.: a weed management decision support system. Weed Science 52, 115-122.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-04-01T00:00:00Z","abstract":"This study describes a model that predicts the impact of weed management on the\npopulation dynamics of arable weeds over a rotation and presents the economic\nconsequences. A stochastic dynamic programming optimisation is applied to the\nmodel to identify the management strategy that maximises gross margin over the\nrotation. The model and dynamic programme were developed for the weed management\ndecision support system -'Weed Manager'. Users can investigate the effect of\nmanagement practices (crop, sowing time, weed control and cultivation practices)\non their most important weeds over the rotation or use the dynamic programme to\nevaluate the best theoretical weed management strategy. Examples of the output\nare given in this paper, along with discussion on their validation. Through this\nstudy, we demonstrate how biological models can (i) be integrated into a\ndecision framework and (ii) deliver valuable weed management guidance to users","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140551.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1111\/j.1365-3180.2008.00678.x","pdfHashValue":"6ddfe5345c5af27c204ec9b3e223781ae31fee55","publisher":"Blackwell Publishing Ltd","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/3251<\/identifier><datestamp>2012-02-06T17:31:16Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Using stochastic dynamic programming to support weed management decisions over a\nrotation<\/dc:title><dc:creator>Benjamin, L. R.<\/dc:creator><dc:creator>Milne, A. E.<\/dc:creator><dc:creator>Lutman, P. J. W.<\/dc:creator><dc:creator>Parsons, David J.<\/dc:creator><dc:creator>Cussans, J.<\/dc:creator><dc:creator>Storkey, J.<\/dc:creator><dc:description>This study describes a model that predicts the impact of weed management on the\npopulation dynamics of arable weeds over a rotation and presents the economic\nconsequences. A stochastic dynamic programming optimisation is applied to the\nmodel to identify the management strategy that maximises gross margin over the\nrotation. The model and dynamic programme were developed for the weed management\ndecision support system -'Weed Manager'. Users can investigate the effect of\nmanagement practices (crop, sowing time, weed control and cultivation practices)\non their most important weeds over the rotation or use the dynamic programme to\nevaluate the best theoretical weed management strategy. Examples of the output\nare given in this paper, along with discussion on their validation. Through this\nstudy, we demonstrate how biological models can (i) be integrated into a\ndecision framework and (ii) deliver valuable weed management guidance to users.<\/dc:description><dc:publisher>Blackwell Publishing Ltd<\/dc:publisher><dc:date>2011-09-29T17:03:21Z<\/dc:date><dc:date>2011-09-29T17:03:21Z<\/dc:date><dc:date>2009-04-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>0043-1737<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1111\/j.1365-3180.2008.00678.x<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/3251<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0043-1737","0043-1737"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":[],"subject":["Article"],"fullText":"Page 1 of 29\nWeed Research, (2009) vol. 49, issue 2, page 207-216\nUsing stochastic dynamic programming to support weed\nmanagement decisions over a rotation\nL R BENJAMIN*, A E MILNE*s, D J PARSONS†s, J CUSSANS* & P J W\nLUTMAN*\n*Rothamsted Research, Harpenden, Hertfordshire, AL5 2JQ, UK, and † Cranfield University,\nCranfield, Bedford, MK43 0AL, UK (sFormerly at Silsoe Research Institute, Wrest Park,\nSilsoe, Bedford, MK45 4HS, UK)\nShort title: dynamic programming for rotational weed management\nCorrespondence: L R Benjamin, Rothamsted Research, Harpenden, Hertfordshire, AL5 2JQ,\nUK. Tel: (+44) 1582 763133; Fax: (+44) 1582 760981; Email:\nlaurence.benjamin@bbsrc.ac.uk\nWord count 6612\nPage 2 of 29\nSummary\nThis paper describes a model that predicts the impact of weed management on the population\ndynamics of arable weeds over a rotation, and presents the economic consequences. A\nstochastic dynamic programming optimisation is applied to the model to identify the\nmanagement strategy which maximises gross margin over the rotation. The model and\ndynamic programme were developed for the weed management decision support system –\n‘Weed Manager’. Users can investigate the effect of management practices (crop, sowing\ntime, weed control and cultivation practices) on their most important weeds over the rotation,\nor use the dynamic programme to evaluate the best theoretical weed management strategy.\nExamples of the output are given in this paper, along with discussion on their validation.\nThrough this work, we demonstrate how biological models can; (i) be integrated into a\ndecision framework and (ii) deliver valuable weed management guidance to users.\nKeywords: population dynamics, decision support system\nPage 3 of 29\nIntroduction\nWeed control in UK arable crops is an expensive necessity for farmers. The survey of\npesticide usage in Great Britain in 2002 shows that, on average, 5.3 herbicide active\ningredients were applied to every wheat crop (Garthwaite et al., 2002). Adequate weed\ncontrol can often be achieved by tackling the problem as it occurs in the season of production.\nThis is not necessarily the most cost effective approach and, as species become increasingly\nresistant to herbicides, it may not always be successful. Additionally, weed control in the\ncurrent season may not give immediate financial reward, but could help avert uncontrollably\nhigh weed densities in subsequent years. Hence, a long term approach to weed control is wise.\nSimulation models allow us to explore the complexities of weed management\ndecisions that influence the impact of weeds on gross margins. However, due to the large\nnumber of possible strategies, it is particularly appropriate to use a decision algorithm to find\nthe best theoretical solution. In this paper we describe a model developed to investigate weed\ncontrol strategies over a rotation and an associated dynamic programme developed to\noptimise weed management.\nOur model, which is similar to others (Holst et al., 2007), is based on the life cycle\nmodel developed by Moss (1990) which estimates seed fecundity and survival. The soil is\nconsidered to have a deep and shallow layer, and the model tracks the changes in the\nseedbank in each layer. Seeds migrate between layers when cultivations are applied.\nSeedlings emerge from the shallow soil layer and are killed to variable degrees by weed\ncontrol practices. Surviving plants produce seeds that are returned to the shallow layer. These\ntwo state-variables (shallow and deep seedbank) describe the change in the weed population\nthrough the rotation, as modified by a series of management parameters. Yield loss due to\nweeds is estimated in each season and the associated gross margin calculated. This allows the\neffect of control strategies to be assessed in terms of seedbank density and gross margin over\nPage 4 of 29\nthe rotation. To allow for the large uncertainties present in the system (primarily from the\nestimate of initial seedbank size), the seedbank density is described by a probability\ndistribution.\nPopulation models have been integrated into decision frameworks (Holst et al., 2007;\nPark et al., 2003). Typically the methods used rely on treatment thresholds, and these have\nbeen subject to criticism (Park et al., 2003). We applied the stochastic dynamic programming\n(SDP) method (Howard, 1960) to our model to find the management strategy that maximises\nfuture rewards. Dynamic programming was developed to solve problems that are essentially\nrepeated decisions over time, and therefore is the appropriate method for this application.\nAdditionally, dynamic programming gives optimal decisions in problems with moderately\ncomplex state and decision variables, whereas thresholds are suitable only for single (or very\nlimited) choices. In this problem, the reward is made up of future gross margins, and the\nstrategy considers sowing time, cultivation and herbicide control. Crop rotation could also\nhave been included in the strategy, but as it is driven largely by considerations other than\nweed control, it is specified within the model.\nThe approach used here is based on work of Sells (1993, 1995) who modified the\nMoss (1990), Doyle et al. (1986) and Cousens et al. (1986) models for use in a SDP. Sells\n(1993, 1995) calculates the optimal strategy for controlling Alopecurus myosuroides Huds\n(black-grass) and Avena fatua L. (wild-oats). Because of the SDP memory requirements Sells\nhad to simplify the model to a single soil layer. For the present system, two layers (shallow\nand deep) are needed to model the impact of alternative cultural practices on seed distribution\nin the soil. By using slightly fewer discrete classes to describe seed density than Sells, and\ngiven the increases in computing power available, a two-layer model was solved for up to two\nweed species in an acceptable time. The method used to handle larger numbers of species is\ndiscussed.\nPage 5 of 29\nThe model and SDP were developed as part of the Weed Manager decision support\nsystem (Tatnell et al., 2006), which is designed to run on a personnel computer. Several\nresearch groups have developed decision support systems that advise on within season weed\ncontrol (Berti et al., 2003; Neeser et al., 2004; Bennett et al., 2003) but only recently has\nattention been paid to rotational weed management (see Holst et al., 2007). Weed Manager is\ncurrently parameterised for 12 common annual weed species and was designed so that this\n‘rotational module’ runs alongside a ‘within season module’ (Benjamin et al., 2009) that\nestimates the yield losses caused to winter wheat in one growing season. Details of the model\nand decision processes are described below, along with examples of the output and a\ndiscussion on its validation.\nThe population dynamics model\nModel structure\nThe starting point of the annual life cycle is taken, for convenience, shortly after harvest when\nthe weed population is present only as seeds in the soil. The numbers of seeds (seeds m-2) in\nthe shallow and deep layers at the start of season t are denoted )(tN s and )(tNd respectively.\nThe shallow layer is defined as the top 5 cm and the deep layer as between 5 and 25 cm, the\nlatter being the average depth of ploughing in the UK.\nWhen soil is cultivated, a proportion, d, of the seeds in the shallow layer is buried to\nthe deep layer and a proportion, u, of the seeds in the deep layer is brought up to the shallow\nlayer. A proportion, g, of the seeds in the shallow layer germinate (seedling establishment is\npossible only from shallow layer seeds). Following weed control, a proportion, , of\nseedlings die. The number of mature plants in season t is\n  )1()()1)(()(   gutNdtNtN ds (1)\nPage 6 of 29\nThe number of viable seeds produced by the mature plants is\n)(1\n)1)((\n)(\ntN\nvhtN\ntS\n\n\n\n\n\n (2)\nwhere  is the reciprocal of the plant density which gives the maximum seed production per\nunit area,  is the number of seeds per plant, v is the proportion of seeds that are viable, h is\nthe proportion of seeds lost by herbivory.\nIf m is the proportion of ungerminated seeds that die in the soil per season, then the\nnumber of viable seeds that persist in the shallow layer ( )(tQ ) during season t is\n  )1)(1()()1)(()( mgutNdtNtQ ds  (3)\nTherefore the number of seeds in the shallow layer at the beginning of season 1t is\n)()()1( tQtStN s  (4)\nThere is no direct contribution of seed rain to the deep seed layer at the start of each season.\nHence the number of seeds in the deep layer at the beginning of season 1t is\n  )1()1)(()()1( mutNdtNtN dsd  (5)\nIn the model, the kill of seedlings, , from mechanical and herbicide weed control\nmeasures is augmented by the loss of weed seedlings due to delayed drilling. This\naugmentation is calculated from the seasonal emergence patterns of the weed species\n(Mortimer, 1990). The proportion of kill due to delayed drilling is assumed to be the ratio of\nthe number of seedlings that emerged before drilling to the total number of seedlings to\nemerge.\nThe start of seedling emergence is defined as the earliest possible seedbed preparation\ndate for autumn-sown crops and the 1st August of the previous year for spring-sown crops.\nSeedling emergence ends 60 days after the sowing date.\nPage 7 of 29\nThe crop rotation and weed management strategy\nCrop rotation is defined by the user. In the model, choice of crop affects weed populations\nthrough its planting date, the estimate of the weed free yield, Y0, crop market value, M, and\nvariable costs, V. The crops included are: winter and spring types of wheat (Triticum\naestivum L.), barley (Hordeum vulgare L.), oilseed rape (Brassica napus ssp oleifera (DC)\nMetzg.), and field beans (Vicia faba L.), spring peas (Pisum sativum L.), potatoes (Solanum\ntuberosum L.), sugarbeet (Beta vulgaris L.) and a ryegrass ley (exemplified by Lolium\nmultiflorum Lam.).\nThe weed management strategy defines cultivation, sowing time and herbicide control.\nCultivations affect the migration of seeds between the shallow and deep layers. Therefore the\nparameters d and u in Eqns 1, 3 and 5 are cultivation dependent. For simplicity, instead of\nmodelling each type of seedbed cultivation tool, three classes of cultivation are considered:\nploughing (d = 0.95, u = 0.35), non-inversion cultivation (d = 0.5, u = 0.1) or, in the potato\ncrop only, rotary cultivation (d = 0.833, u = 0.167) (based on Cousens & Moss 1990).\nSowing time affects the expected weed free crop yield, 0Y , and the proportion of\nweed seedlings killed by cultivations during seedbed preparation. Hence, although later sown\ncrops have a reduced expected yield, delaying sowing tends to improve weed control. Three\nsowing times are defined: early, mid and late. These map to crop specific dates – for example\nin winter wheat early = 1 September, mid = 14 October and late = 1 December.\nIt was not possible to fully parameterise  (herbicide control) for all currently\navailable commercial herbicides for all 12 crops. Therefore herbicide control in each crop is\ndefined as low, moderate, moderately-high and high cost. For each crop, expert knowledge\nwas used to estimate the percentage kill of each weed given the costing band of the herbicide\nprogramme. Cheap programmes were assumed to control weeds which are easy to kill,\nwhereas more expensive programmes are needed to kill more resilient weeds.\nPage 8 of 29\nThe initial seedbank density\nPractical estimation of seedbank density is difficult, so users are asked to stipulate the\nexpected plant density of each weed species emerging in the crop during the autumn with the\nselected cultivations, in the absence of herbicides. This assessment is based on four plant\ndensity classes, which were normalised between species to give similar yield losses for each\nweed species. Hence, for a given class the density is lower for competitive weeds than for\nnon-competitive ones.\nRelating plant density to seedbank density present before autumn cultivations involves\ngermination rates and the effect of cultivations. By assuming steady state conditions, we\nrearrange Eqn (5) to give\n))1)(1(1\/()1( mudmNN sd  (6)\nSubstituting Eqn 6 into Eqn 1 and rearranging for sN gives the estimate for shallow seedbank\ndensity. Deep seedbank density is then calculated using Eqn 6. In practice, the seedbank is\nunlikely to be in steady state, but this is an adequate approximation.\nThe stochastic dynamic programme\nThe SDP requires that the state variable (the weed seedbank density) is composed of discrete\nstates. In our model this is made discrete by allocating the density of seeds in each seedbank\nlayer to one of six non-overlapping ranges. For a single density state the model is run twice\nusing the extreme values of the range. The resulting seedbank density values form the\nextreme values of a new interval that usually spreads over more than one of the defined\nranges. Instead of selecting one state as the resulting state, the results are converted to a\nPage 9 of 29\nprobability distribution. Consequently, the transition from one state to another is no longer\ndeterministic. This is described in more detail below.\nFor each layer there are six classes, each with a seed density range from )1( iLl to\n)(iLl where i is the index of the class (1 to 6), l is the layer (s for shallow or d for deep).\n)(iLl are species dependent values. The number of density classes (i.e. six) results from a\ncompromise between model accuracy, which theoretically increases with the number of\nclasses, and model run time, which increases with number of classes. For a single weed\nspecies, the state of the system is described by a pair of index values ),( ds ii . If n weed\nspecies are simultaneously considered, the state of the system is therefore described by 2n\nindex values. Each combination of these index values is a single model state, so the total\nnumber of states is .62n\nThe six seedbank density classes need to relate to the four plant density classes used to\ndefine initial conditions (described above). It would have been simpler to relate six plant\ndensity classes to six seedbank density classes, but system evaluation concluded that users\nfound it difficult to estimate more than four plant classes. The three plant density classes with\nthe largest densities were split into four classes using a geometric progression (reflecting the\nway plant\/seed numbers grow), and the fourth plant density class was split into two (Tatnell et\nal., 2006). These six plant density classes map to the six seedbank density classes using Eqns\n1 and 6, as described above.\nThe classifications were tested to ensure that the predicted number of plants in the first\nseason was approximately the same as that set in the initial conditions.\nThe SDP formulation is\n\n\n\n\n\n  \n\n ))((max)(\n1\n1\nN\nj\nt\nk\nij\nk\nijkt\njfRpif  (7)\nPage 10 of 29\nwhere ft(i) is the optimal expected financial reward for seasons t and beyond, given that the\nsystem state is i at the beginning of season t. Here, the system state describes the seeds in the\nseedbank and so i describes the 2n index pairs, so for example, in the one weed case (n = 1)\n).,( ds iii  The transition probability of going from state i to j given strategy k is denoted kijp .\nThe strategy describes a set of actions under which the system is run. kijR is the financial\nreward associated with going from state i to state j given strategy k, and λ is a discount factor\nwhich scales future expected rewards. The discount factor is\n\n\n1\n1 Iλ (8)\nwhere I is the current rate of inflation, here assumed to be 3%, and Ω is the interest rate, here\nassumed to be 6 %.\nThe solution of Eqn 7 comprises a set of decisions describing the actions that should\nbe followed given the state at the beginning of season t: collectively a strategy for weed\ncontrol throughout the rotation. The equation can be solved either to find a finite horizon\nsolution or the infinite horizon solution (steady state solution). It is not always possible to find\nthe latter, either because the system does not satisfy the necessary conditions for the existence\nof a solution, or because the problem does not converge within a reasonable time.\nCalculating the transition probabilities\nThe SDP requires the probabilities associated with going from state i in season t to each of the\npossible states in season 1t for a defined strategy. Ideally, each of the model parameter\nvalues should be described by a probability distribution reflecting the natural processes\noccurring. However, it is not always practical to assign a distribution to each parameter, either\nbecause of lack of appropriate data, or because the calculations are computationally too time\nconsuming. Here, the uncertainty in seed number arises because the transition from one\nPage 11 of 29\ndiscrete state does not simply map to another single discrete state but onto a union of several\nintervals, as explained below.\nWhen considering only a single weed species, the initial state is defined by ],[ ds ii . To\nestimate the probability of ending up in shallow layer state ,sj first the lowest and highest\nseedbank densities that can occur in season 1t for a given strategy are calculated using\nEqns 1 — 4. Because )1( tN s is an increasing function of both )(tN s and )(tNd , the\nlowest shallow seedbank density in season 1t )( L is given when )1()(  sss iLtN and\n)1()(  ddd iLtN . Similarly, the highest shallow seedbank density in season 1t )( H is\ngiven when )()( sss iLtN  and )()( ddd iLtN  . Further, it is assumed that having started in\ninitial state ],[ ds ii , the shallow seedbank density in season 1t will lie in the range ),( HL \nwith uniform probability. The probability that the shallow seedbank will be in state sj in\nseason 1t is, therefore, given by the proportion of range (ρL, ρH) that overlaps the range\ndefined by state .sj That is\n   \n HL\nssHL\njii\njLjL\np\nsds \n\n,\n)(),1(,\n],,[\n\n (9)\nwhere denotes the length of an interval. This concept is illustrated in Figure 1. A similar\ncalculation is carried out to define the probability of going from state ],[ ds ii in season t to the\ndeep layer state dj in season 1t . In this case the possible range of values that can occur in\nseason 1t is calculated using Eqn 5.\nThe probability of going from state i to state j for more than one species is simply the\nproduct of the probabilities calculated for the single species.\nPage 12 of 29\nCalculating the yield loss due to weed density\nThe total yield loss (YT) from all modelled weeds is assumed to be the sum of the losses from\nthe individual species. Competition between species is low at densities found in most\ncommercial situations in the UK (Bohan et al., 2005), so this is a reasonable approximation.\nThe yield loss attributed to each species is deduced from the change in seedbank density from\none season to the next. This is done by working backwards through the previous calculations.\nThe seed rain is calculated from the change in seedbank density in the shallow layer by re-\narranging Eqn 4\n)()1()( tQtNtS s  (10)\nThe number of seeds produced, )(tS , is determined by letting )(tN s , )(tNd and )1( tN s be\nequal to the midpoints of the ranges specified by states ,si di and js, respectively. The number\nof mature plants )( N is calculated by rearranging Eqn 2\n )()1(\n)(\n)(\ntSvh\ntS\ntN\n\n (11)\nand substituting in the value )(tS from Eqn 10. From the number of mature plants, the yield\nloss, wY , due to weed w is estimated;\n)(1\n)(0\ntN\ntrNY\nYw\n\n\n\n (12)\nwhere 0Y is the expected yield in a weed free crop and r and γ are species specific constants\n(Cousens, 1985). The financial benefit associated with going from state i in season t to state j\nin season 1t for a given weed control strategy, k, is\n  HCVMYYR Tkij  0 (13)\nwhere k indicates the chosen strategy (which defines sowing time, cultivation, and herbicide\ncontrol), 0Y is the expected weed-free yield of the crop, TY is the total yield loss from the\nPage 13 of 29\nweeds, M is the crop market value, V are the variable costs associated with growing the crop,\nC is the cost of the chosen cultivation sequence and H is the herbicide programme cost.\nSolving the dynamic programme\nThe time required to solve a SDP is proportional to the square of the number of states. In this\nproblem there are 36 possible states for each weed (six density classes in the shallow and deep\nsoil layers), so the time increases by a factor of 1296 for each weed added. To keep the run\ntime to an acceptable duration, when the weed list contains more than two species, only the\ntwo most competitive species are considered. If there are two species of equal competitivity\nthen the one with the higher initial density takes precedence. This approach produces a\npractically sound solution but not necessarily the optimum one.\nThe SDP was solved by backward recursion solution iteration (Howard, 1960), to\ndetermine the combination of weed control practices that give the best cost-benefit. In this\nmethod, a starting solution Ff is chosen that represents the final season’s reward. Eqn 7 is\nthen solved iteratively until either the solution reaches a steady state or a maximum number of\niterations have been completed. The SDP with two weeds needed to be solved on a 2.8GHz\npersonnel computer in less than a minute to be acceptable to users. The maximum number of\niterations (seasons) achievable in this time was 10. Because the system is unlikely to have\nreached a steady state in this time, the estimate of Ff suggested by Sells (1995) was used:\n\n\n1\n)( jjF\nR\njf (14)\nwhere jjR is the reward associated with going from state j to state j under an arbitrarily\nchosen strategy, and  is the discount factor (Eqn 8) This terminal reward is a discounted\nresult of staying in the same state and is a sensible choice (as opposed to zero, for example) as\nPage 14 of 29\nit will penalise high weed populations and so discourage strategies that are cheap in the early\nyears but allow problems to build up.\nResults and discussion\nGeneral overview\nAn example of Weed Manager’s rotations module interface is shown in Figure 2 for three\nweed species. The top grid summarises the user defined cropping and cultural practices and\nthe bottom grid summarises the resulting shallow seedbank densities and gross margin for\neach season. On the right hand side of the screen the expected gross margin over the rotation\nis indicated by an arrow on the bar. An estimate of variability is illustrated by the shading.\nInternally, the seedbank density is described by a probability distribution but it was not\nfeasible to display all of this information comprehensibly on the graphical user interface\n(GUI) and so only the most likely seedbank density class is displayed.\nOutputs from the model\nThe population dynamics of three weed species (A. myosuroides, Anisantha sterilis (L.)\nNevski (barren-brome) and Stellaria media (L.) Vill. (chickweed)), in a 5 year continuous\nwinter wheat rotation, were simulated. The model parameter values are given in Table 1. In\nthese illustrative examples, initial seedbank density was a single value, not a range, and so\nresults are deterministic. The simulation used contrasting combinations of cultivations,\ndrilling dates and herbicide efficacies (Table 2) to explore the consequent changes in the\nseedbank. All simulations started with a seedbank of 2500 seeds m-2 distributed 80% in the\nshallow layer and 20% in the deep and a winter-wheat crop sown on 14 October (mid sowing)\nin Year 1 after non-inversion cultivation. Crop sowing date and primary cultivations were\nPage 15 of 29\nchanged in subsequent years. The default herbicide treatment was assumed to achieve 90%\ncontrol of emerged weeds in all years.\nFor A. myosuroides, rotation 1, the continuous non-inversion cultivation (minimal soil\ncultivation) on a mid date drilling, led to a steady increase in population size, despite a 90%\nkill annually from herbicides (Table 2). A plough in season three reduced the population in\nseason five 19 fold in rotation 2 compared with rotation 1. Ploughing continuously from\nseasons two to five caused a 146 fold reduction in plant density in season five compared with\ncontinuous non-inversion (rotation 3 compared with rotation 1). Interestingly, in rotation 3,\nthere was a small increase in plant density from season two to three, because ploughing for\nthe second time brought viable seeds back to the surface. Non-inversion cultivations\ncombined with drilling early in seasons two, three and four, caused a 1.2 fold increase in plant\ndensity in season four compared with a continuous mid drilling date in each season\n(comparing rotations 4 and 1). This effect of drilling date was because of the reduced kill of\nweeds in the early drilling. Correspondingly, drilling late in seasons two, three and four,\ncaused a 2.2 fold decrease in plant density in season four compared with a continuous mid\ndrilling date in each season (comparing rotations 5 and 1). Combining ploughing with early\nseason drilling resulted in a substantial reduction in plant populations compared with\ncontinuous non-inversion cultivations (rotation 6 compared with 1), but the reduction was not\nas great as was achieved with ploughing in mid date drilling (rotation 6 compared with 3).\nCombining ploughing with late season drilling resulted in a further decline in plant\npopulations (rotation 7 compared with 1 & 3). Ploughing was particularly effective in\nreducing populations of this weed.\nThe pattern of results for A. sterilis differed a little from A. myosuroides. The same\ntrends were apparent, as ploughing and late sowing reduced weed survival (Table 2). The\nmain difference was that population increase with non-inversion was faster and decline was\nPage 16 of 29\ngreater with ploughing than they were for A. myosuroides. The latter is due to the absence of\nseed dormancy in this species (Table 1). Ploughing, consequently, achieved very good, but\nnot complete control (rotation 3 compared with 1). Soil tillage and drilling late in the autumn\nresulted in greater kill of the population and thus more rapid decline in the seedbank.\nThe results with S. media were rather different. This species has more seed dormancy\nand so the proportion of seeds that germinate is lower than A. sterilis. It also is at more risk of\ninvertebrate predation. As a consequence, the build up of populations in the non-inversion\ncultivated rotation (rotation 1) was slower and the rate of decline achieved by ploughing was\nmuch lower (Table 2). As with the two grass species, early cultivation and planting resulted\nin more plants emerging in the crop and so higher seedbanks than later cultivations. Again\nthe ability of the second ploughing to return seeds to the soil surface and increase the\nseedbank was noticeable in seasons two and three of rotations 3, 6 and 7.\nModel validation\nThe results of many simulations with all 12 species included in Weed Manager, were\nevaluated by three weed agronomists to assess whether the model conclusions were\nagronomically sensible. After several iterations the agronomists concluded that the results\nwere realistic for UK conditions. More objective validation would have been welcome but the\ncomplexity (species, cropping, cultivation, weed control) and time scale available in the\nproject made this unrealistic. This issue of the lack of independent validation of population\ndynamics models has been highlighted by Holst et al., (2007).\nTwo data sets that were independent of those used to parameterise the models were\nidentified. One described the response of A. myosuroides to non-inversion cultivation or\nploughing over three years in a monoculture of winter wheat in France (Munier-Jolain et al.,\n2002). Ploughing produced a rapid decline in population with in excess of 90% weed control\nPage 17 of 29\nin our model and in the observed data (Table 3). The non-inversion cultivations resulted in a\ndecline in the observed plant density but not in our model, when 95% control was used.\nHowever, increasing the weed control in the model to 99.5% resulted in a decline similar to\nthe observed data.\nThe second data set includes studies of S. media in a continuous wheat rotation in\nGermany, established either after ploughing or non-inversion cultivation (Knab & Hurle,\n1986; Zwerger & Hurle, 2002). The observed weed population was low and after both\ncultivations there was little change, although there was a small decline with ploughing (Table\n4). When using the weed control stated by Knab and Hurle (2002), our model predicted\npoorer weed control than that observed. For non-inversion cultivations with 63% control, our\nmodel predicted an appreciable increase in population. The predicted responses to non-\ninversion cultivations and ploughing were similar to those observed when the weed control\nwas increased to 97 and 90%, respectively.\nNeither data set was ideal for comparison with our model, but we failed to find any\nothers. The model shows ploughing is more effective than non-inversion, which is borne out\nin the data. However, in both cases predictions for non-inversion cultivation showed much\nlarger increases in weed numbers than in the observed data. The ploughing predictions were\ncloser to the field data although weed numbers were still over-predicted. Without more\nexperimental detail, for example on the depth distribution of the seeds in the soil, or the exact\nefficacies of weed control, it is hard to identify reasons for these discrepancies. As Weed\nManager has been designed to suggest control strategies for weed populations it is better that\nit under estimates rather than over estimates expected control. This will make the system err\non the side of caution.\nThe results of running the dynamic programme\nPage 18 of 29\nThe rotation selected by the user can be between two and five seasons (season 1 is the current\nseason, which is fixed). When the SDP is run to optimise long term profits, the selected\nrotation is run for ten seasons. An example is given of continuous winter cropping with\nmainly winter wheat, infested with A. sterilis and A. myosuroides where the cultivation\npractice, the sowing period and the level of weed control has been defined by the user (Table\n5a). High infestation levels for both weeds are predicted throughout the rotation. The\noptimisation of this scenario changes the cultural practices, replacing non-inversion tillage\nwith ploughing, delaying sowing and increasing the expenditure on weed control (and\ntherefore percentage control) (Table 5b). The increased weed control in all years, despite\nextra costs, resulted in higher crop yields and thus greater profits. The margin over the whole\nrotation increased by £94 and the variability is reduced. The preference for late drilling in the\noptimisation is understandable because the reduction in weed competition from late drilling\noften exceeds the drop in yield associated with the delay. However, in practice, farmers\ncannot sow all their fields ‘late’ but the practical message is to sow the badly infested fields\nlast.\nAcknowledgements\nWe thank Defra (through Sustainable Arable LINK) for sponsoring this project, along with\nHGCA, BASF, Bayer CropScience, Dow AgroSciences, DuPont, and Syngenta. We also\nacknowledge the contribution of our research partners ADAS, Glasgow Caledonian and the\nScottish Agricultural College. Rothamsted Research receives grant-aided support from the\nBiotechnology and Biological Sciences Research Council (BBSRC).\nPage 19 of 29\nReferences\nBENJAMIN LR, LUTMAN PJW & MILNE AE (2009) A model to simulate the growth,\ndevelopment and competitive effect of weeds in a winter wheat crop for use in a weed\nmanagement decision support system. Weed Research (submitted).\nBENNETT AC, PRICE AJ, STURGILL MC, BUOL GS & WILKERSON GG (2003) HADSSTM,\nPocket HERBTM and WebHADSSTM: decision aids for field crops. Weed\nTechnology 17, 412-420.\nBERTI A, BRAVIN F, & ZANIN G (2003) Application of decision-support software for\npostemergence weed control. Weed Science 51, 618-627.\nBOHAN DA, BOFFEY WHC, BROOKS DR, CLARK SJ et al., (2005) Effects on weed and\ninvertebrate abundance and diversity of herbicide management in genetically modified\nherbicide-tolerant winter-sown oilseed rape. Philosophical Transactions of the Royal\nSociety B 272, 463-474.\nCONN JS & DECK RE (1995) Seed viability and dormancy of 17 weed species after 9.7 years\nof burial in Alaska. Weed Science 43, 583-585.\nCOUSENS R (1985) A simple model relating yield loss to weed density. Annals of Applied\nBiology 107, 239-252.\nCOUSENS R, DOYLE CJ, WILSON BJ & CUSSANS GW (1986) Modelling the economics of\ncontrolling Avena fatua in winter wheat. Pesticide Science 17, 1-12.\nCOUSENS R & MOSS SR (1990) A model of the effects of cultivation on the vertical-\ndistribution of weed seeds within the soil. Weed Research 30, 61-70.\nDOYLE CJ, COUSENS R & MOSS SR (1986) A model of the economics of controlling\nAlopecurus myosuroides Huds. in winter wheat. Crop Protection 5, 143-150.\nGARTHWAITE DG, THOMAS MR, DAWSON A & STODDART H (2002) Arable Crops in Great\nBritain 2002. Pesticide Usage Survey Report 187, 108pp DEFRA, UK\nPage 20 of 29\nHOLST N, RASMUSSEN IA & BASTIAANS L (2007) Field weed population dynamics: a review\nof model approaches and applications. Weed Research 47, 1-14.\nHOWARD AJ (1960) Dynamic programming and Markov processes. Wiley, London.\nKNAB W & HURLE K (1986) Einfluss der grundbodenarbeitung auf die verunkrautung – ein\nbeitrag zur prognose der verunkrautung Proceedings EWRS Symposium 1986,\nEconomic Weed Control, Stuttgart, Germany, 309-316\nMILLER ACE, LUTMAN PJW, WRIGHT KJ & WRIGHT GM (1998) A preliminary report on\npatterns of seedbank decline and the relationship between seedbank and seedling\nemergence for seven arable weed species in winter wheat. Aspects of Applied Biology\n51, Weed seedbanks, determination and manipulation,,59-67.\nMORTIMER AM (1990) The biology of weeds. Weed control handbook: principles. (eds Hance\nRJ & Holly K) Blackwell Scientific Publications, Oxford, UK: 1-42.\nMOSS SR (1990) The seed cycle of Alopecurus myosuroides in winter cereals: a quantitative\nanalysis. Symposium on integrated weed management in cereals. Proceedings of\nEWRS Symposium, Helsinki, Finland, 4-6 June 1990, 27-35.\nMUNIER-JOLAIN NM, CHAUVEL B & GASQUEZ J (2002) Long-term modelling of weed control\nstrategies: analysis of threshold-based options for weed species with contrasted\ncompetitive abilities. Weed Research 42, 107-122.\nNEESER C, DILLE JA, KRISHNAN G, MORTENSEN DA, RAWLINSON JT, MARTIN AR & BILLS LB\n(2004) WeedSOFTReg.: a weed management decision support system. Weed Science\n52, 115-122.\nPARK SE, BENJAMIN LR & WATKINSON AR (2003) The theory and application of plant\ncompetition models: an agronomic perspective. Annals of Botany 92, 741-748.\nPage 21 of 29\nSELLS JE (1993) Calculating transition probabilities for modelling weed management options\nusing stochastic dynamic programming. Agricultural Systems 41, 41-52.\nSELLS JE (1995) Optimising weed management using stochastic dynamic programming to\ntake account of uncertain herbicide performance. Agricultural Systems 48, 271-296.\nSMITH GL, FRECKLETON RP, FIRBANK LB & WATKINSON AR. (1999) The population\ndynamics of Anisantha sterilis in winter wheat: comparative demography and the role\nof management. Journal of Applied Ecology 36, 455-471.\nSOBEY DG (1981) Biological flora of the British Isles. No. 150. Stellaria media (L.) Vill.\nJournal of Ecology 69, 311-335.\nTATNELL LV, CLARKE JH, GINSBURG D, LUTMAN PJW, MAYES A, BENJAMIN L, PARSONS DJ,\nMILNE AE, WILKINSON DJ & DAVIES DHK (2006) Development and validation of\nWeed Management Support System (Weed Manager). HGCA project report 388,\npp127, HGCA, London.\nVAN ACKER RC, LUTMAN PJW & FROUD-WILLIAMS RJ (1997) Predicting yield loss due to\ninterference from two weed species using early observations of relative weed leaf area.\nWeed Research 37, 287-299.\nWILSON BJ, MOSS SR & WRIGHT KJ (1989) Long term studies of weed populations in winter\nwheat as affected by straw disposal, tillage and herbicide use. Proceedings of the\nBrighton Crop Protection Conference, Weeds. BCPC, Farnham, UK, 131-136.\nZWERGER P & HURLE K (1990) Untersuchungen zur Abbildungsgüte simulierter\nBefallsverlaüfe bei Unkräutern. Zeitschrift fur Pflanzenkrankheiten und\nPflanzenschutz 97, 133-141.\nPage 22 of 29\nTable 1. Model parameter values for A. myosuroides, A. sterilis and S. media\nParameter A. myosuroides A. sterilis S. media\nα weed density parameter 0.00181 0.0023 0.0084\nβ number of seeds\/plant 3881 1203 8404\ng proportion of seedbank germinating 0.302 0.603 0.275\nh proportion of seeds lost to herbivory 0.551 0.583 0.785\nm proportion of seeds that die\/year 0.71 1.03 0.37\nv proportion of seeds that are viable 0.551 1.03 0.956\n1 Doyle et al., 1986; Moss, 1990; 2 Wilson et al., 1989; 3 Smith et al., 1999;\n4 van Acker et al., 1997; 5 Miller et al., 1998; 6 Sobey, 1981; 7 Conn and Deck, 1995\nPage 23 of 29\nTable 2 The number of mature plants (m-2) of the three test species surviving each season under the specified five year continuous wheat rotations.\nA. myosuroides A. sterilis S. mediaRotation\nnumber\nCultivations and\nsowing time in each\nseason 1 2 3 4 5 1 2 3 4 5 1 2 3 4 5\n1 Tm, Tm, Tm, Tm, Tm 42.4 89.0 175 307 467 96.5 353 904 1406 1611 33.2 43.8 51.0 55.5 58.4\n2 Tm, Tm, Pm, Tm, Tm 42.4 89.0 9.1 20.1 43.6 96.5 353 45.2 181 580 33.2 43.8 3.9 10.9 22.8\n3 Tm, Pm, Pm, Pm, Pm 42.4 5.6 9.7 4.1 3.2 96.5 17.7 3.7 0.8 0.2 33.2 4.2 11.6 8.8 9.8\n4 Tm, Te, Te, Te, Tm 42.4 106 240 459 591 96.5 436 1257 1930 1734 33.2 53.2 63.3 69.7 60.4\n5 Tm, Tl, Tl, Tl, Tm 42.4 63.6 96.4 140 268 96.5 194 336 483 1073 33.2 37.1 42.3 45.7 56.3\n6 Tm, Pe, Pe, Pe, Pm 42.4 6.7 11.8 5.4 3.8 96.5 21.8 5.6 1.5 0.3 33.2 5.1 14.1 11.2 10.5\n7 Tm, Pl, Pl, Pl, Pm 42.4 4.0 6.8 2.5 2.4 96.5 9.7 1.1 0.1 0.0 33.2 3.6 9.8 7.1 9.3\nHerbicides are set to kill 90 % of weeds each season.\nCultivations: P = plough, T= non-inversion cultivation\nSowing dates: early (e) = 1 September, mid (m) = 14 October, late (l) = 1 December\nPage 24 of 29\nTable 3 Comparisons of the predictions of the Weed Manager model and the results of Munier-Jolain\net al. (2002) for the response of A. myosuroides populations (plants m-2) to different cultivations in a\nfour- year continuous winter wheat rotation.\nCropping yearsOrigin of data Sowing date % weed\ncontrol\nPrimary\nCultivation Yr 1 Yr 2 Yr 3 Yr4\nWeed Manager 14 October 95 non-inversion 300 261 235 217\nWeed Manager 14 October 99.5 non-inversion 300 83 25 8\nMunier-Jolain mid October 70-90 non-inversion 300 60 25 4\nWeed Manager 14 October 95 Plough 300 21 29 10\nWeed Manager 14 October 99.5 Plough 300 12 10 2\nMunier-Jolain mid October 90-97 Plough 300 30 <1 <1\nPage 25 of 29\nTable 4 Comparisons of the predictions of the Weed Manager model and the results of Knab and\nHurle (2002) for the response of S. media populations (plants m-2) to different cultivations in a three -\nyear continuous winter wheat rotation\nCropping yearsOrigin of data Sowing date % weed\ncontrol\nPrimary\nCultivation Yr 1 Yr 2 Yr 3\nWeed Manager 14 October 63 non-inversion 7 53 137\nWeed Manager 14 October 97 non-inversion 7 7 8\nKnab & Hurle autumn 63 non-inversion 7 7 9\nWeed Manager 14 October 45 Plough 10 6 26\nWeed Manager 14 October 90 Plough 11 2 6\nKnab & Hurle autumn 45 Plough 11 3 6\nPage 26 of 29\nTable 5 Example output from the Weed Manager model for infestations of A. sterilis and A.\nmyosuroides in a rotation of all winter cropping: a) without optimisation b) with optimisation.\na)\nSeason 2005 \/ 2006 2006 \/ 2007 2007 \/ 2008 2008 \/ 2009 2009 \/ 2010 2010 \/ 2011\nCrop Winter wheat Winter wheat Winter oilseed\nrape\nWinter wheat Winter wheat Winter beans\nCultivation Plough Non-inversion Plough Plough Non-inversion Plough\nSown Mid Mid Mid Mid Mid Mid\nCost (£\/ha) 40 - 75 40 - 75 40 - 85 40 - 75 40 - 75 40 - 65\nNumber of seeds in the shallow soil layer at the end of the season\nblack-grass high very high high very high very high very high\nbarren-brome high very high moderate-high moderate-high very high high\nMargin (£\/ha) 259 140 160 190 148 14\nAverage margin over rotation £152\/ha (0-303)\nb)\nSeason 2005 \/ 2006 2006 \/ 2007 2007 \/ 2008 2008 \/ 2009 2009 \/ 2010 2010 \/ 2011\nCrop Winter wheat Winter wheat Winter oilseed\nrape\nWinter wheat Winter wheat Winter beans\nCultivation Plough Plough Plough Plough Plough Plough\nSown Mid Late Late Late Late Late\nCost (£\/ha) 40 - 75 75 - 105 40 - 85 75 - 105 75 - 105 40 - 65\nNumber of seeds in the shallow soil layer at the end of the season\nblack-grass high low-moderate moderate-high low-moderate low-moderate low-moderate\nbarren-brome high low-moderate low very low very low very low\nMargin (£\/ha) 259 307 194 320 322 72\nAverage margin over rotation £246\/ha (209-283)\nPage 27 of 29\nLegend for Figures\nFig 1. An illustration of the span of seed densities in a soil layer in relation to the limits of seed\ndensity for different discrete soil density states. The horizontal lines represent the limits on discrete\nsoil density states. The vertical line represents the maximum possible range of seed densities given\nthe previous year’s seedbank state and husbandry.\nFig. 2 An example of Weed Manager’s rotational module interface, showing six seasons cropping, the\ngross margins each season (and the average rotational margin) and the responses of S. media, Papaver\nrhoeas L. and A. myosuroides seedbanks to different cultivations, sowing dates and herbicides.\nPage 28 of 29\nFig. 1\nN\num\nbe\nro\nf\nSe\ned\ns\n(m\n-2\n)\n0\n5000\n10000\n15000\n20000\nL(0)\nL(2)\nL(1)\nL(4)\nL(3)\nL(5)\nL(6)\n0.14\n0.38\n0.48\nρH\nρL\nPage 29 of 29\nFig. 2\n"}