{"doi":"10.1155\/2010","coreId":"7938","oai":"oai:eprints.brighton.ac.uk:8041","identifiers":["oai:eprints.brighton.ac.uk:8041","10.1155\/2010"],"title":"Nanoporosity of alumina surfaces induces different patterns of activation in adhering monocytes\/ macrophages","authors":["Ferraz, N.","Hoong, J.","Santin, Matteo","Karlsson-Ott, M."],"enrichments":{"references":[{"id":42814236,"title":"A new biologic role for C3a and C3a desArg: regulation of TNF-α and IL-1β synthesis,”","authors":[],"date":"1996","doi":null,"raw":"T. Takabayashi, E. Vannier, B. D. Clark et al., “A new biologic role for C3a and C3a desArg: regulation of TNF-α and IL-1β synthesis,” Journal of Immunology, vol. 156, no. 9, pp. 3455– 3460, 1996.","cites":null},{"id":42814125,"title":"A review on macrophage responses to biomaterials,”","authors":[],"date":"2006","doi":null,"raw":"Z. Xia and J. T. Triffitt, “A review on macrophage responses to biomaterials,” Biomedical Materials, vol. 1, no. 1, article no. R01, pp. R1–R9, 2006.","cites":null},{"id":42814187,"title":"Adsorbed IgG: a potent adhesive substrate for human macrophages,”","authors":[],"date":"2000","doi":null,"raw":"C. R. Jenney and J. M. Anderson, “Adsorbed IgG: a potent adhesive substrate for human macrophages,” Journal of Biomedical Materials Research, vol. 50, no. 3, pp. 281–290, 2000.","cites":null},{"id":42814189,"title":"Adsorbed serum proteins responsible for surface dependent human macrophage behavior,”","authors":[],"date":"2000","doi":null,"raw":"C. R. Jenney and J. M. Anderson, “Adsorbed serum proteins responsible for surface dependent human macrophage behavior,” Journal of Biomedical Materials Research, vol. 49, no. 4, pp. 435–447, 2000.","cites":null},{"id":42814164,"title":"Biocompatibility of poly(e-caprolactone)\/poly(ethylene glycol) diblock copolymers with nanophase separation,”","authors":[],"date":"2004","doi":null,"raw":"S. H. Hsu, C. M. Tang, and C. C. Lin, “Biocompatibility of poly(e-caprolactone)\/poly(ethylene glycol) diblock copolymers with nanophase separation,” Biomaterials, vol. 25, no. 25, pp. 5593–5601, 2004.","cites":null},{"id":42814101,"title":"Biological responses to materials,”","authors":[],"date":"2001","doi":null,"raw":"J. M. Anderson, “Biological responses to materials,” Annual Review of Materials Science, vol. 31, pp. 81–110, 2001.","cites":null},{"id":42814126,"title":"Biomaterials: where we have been and where we are going,”","authors":[],"date":"2004","doi":null,"raw":"B. D. Ratner and S. J. Bryant, “Biomaterials: where we have been and where we are going,” Annual Review of Biomedical Engineering, vol. 6, pp. 41–75, 2004.","cites":null},{"id":42814139,"title":"Cells react to nanoscale order and symmetry in their surroundings,”","authors":[],"date":"2004","doi":null,"raw":"A. S. G. Curtis, N. Gadegaard, M. J. Dalby, M. O. Riehle, C. D. W. Wilkinson, and G. Aitchison, “Cells react to nanoscale order and symmetry in their surroundings,” IEEE Transactions on Nanobioscience, vol. 3, no. 1, pp. 61–65, 2004.","cites":null},{"id":42814141,"title":"Cellular and molecular responses of smooth muscle cells to surface nanotopography,”","authors":[],"date":"2007","doi":null,"raw":"K. T. Nguyen, K. P. Shukla, M. Moctezuma, and T. Liping, “Cellular and molecular responses of smooth muscle cells to surface nanotopography,” Journal of Nanoscience and Nanotechnology, vol. 7, no. 8, pp. 2823–2832, 2007.","cites":null},{"id":42814200,"title":"Complement C3 participation in monocyte adhesion to different surfaces,”","authors":[],"date":"1994","doi":null,"raw":"A. K. Mcnally and J. M. Anderson, “Complement C3 participation in monocyte adhesion to different surfaces,” Proceedings of the National Academy of Sciences of the United States of America, vol. 91, no. 21, pp. 10119–10123, 1994.","cites":null},{"id":42814198,"title":"Cytokine and growth factor production by monocytes\/macrophages on protein preadsorbed polymers,”","authors":[],"date":"1992","doi":null,"raw":"T. L. Bonfield, E. Colton, R. E. Marchant, and J. M. Anderson, “Cytokine and growth factor production by monocytes\/macrophages on protein preadsorbed polymers,” Journal of Biomedical Materials Research, vol. 26, no. 7, pp. 837–850, 1992.","cites":null},{"id":42814159,"title":"Decreased macrophage density on carbon nanotube patterns on polycarbonate urethane,”","authors":[],"date":"2009","doi":null,"raw":"J. Kim, D. Khang, E. L. Jong, and T. J. Webster, “Decreased macrophage density on carbon nanotube patterns on polycarbonate urethane,” Journal of Biomedical Materials Research A, vol. 88, no. 2, pp. 419–426, 2009.","cites":null},{"id":42814162,"title":"Effect of titanium surface topography on macrophage activation and secretion of proinflammatory cytokines and chemokines,”","authors":[],"date":"2004","doi":null,"raw":"A. K. Refai, M. Textor, D. M. Brunette, and J. D. Waterfield, “Effect of titanium surface topography on macrophage activation and secretion of proinflammatory cytokines and chemokines,” Journal of Biomedical Materials Research A, vol. 70, no. 2, pp. 194–205, 2004.","cites":null},{"id":42814190,"title":"Effects of adsorbed proteins and surface chemistry on foreign body giant cell formation, tumor necrosis factor alpha release and procoagulant activity of monocytes,”","authors":[],"date":"2004","doi":null,"raw":"M. Shen, I. Garcia, R. V. Maier, and T. A. Horbett, “Effects of adsorbed proteins and surface chemistry on foreign body giant cell formation, tumor necrosis factor alpha release and procoagulant activity of monocytes,” Journal of Biomedical Materials Research A, vol. 70, no. 4, pp. 533–541, 2004.","cites":null},{"id":42814135,"title":"Effects of synthetic micro- and nanostructured surfaces on cell behavior,”","authors":[],"date":"1999","doi":null,"raw":"R. G. Flemming, C. J. Murphy, G. A. Abrams, S. L. Goodman, and P. F. Nealey, “Effects of synthetic micro- and nanostructured surfaces on cell behavior,” Biomaterials, vol. 20, no. 6, pp. 573–588, 1999.","cites":null},{"id":42814137,"title":"Enhanced functions of osteoblasts on nanostructed surfaces of carbon and alumina,”","authors":[],"date":"2003","doi":null,"raw":"R. L. Price, K. M. Haberstroh, and T. J. Webster, “Enhanced functions of osteoblasts on nanostructed surfaces of carbon and alumina,” Medical and Biological Engineering and Computing, vol. 41, no. 3, pp. 372–375, 2003.","cites":null},{"id":42814172,"title":"Evaluation of protein-modulated macrophage behavior on biomaterials: designing biomimetic materials for cellular engineering,”","authors":[],"date":"1999","doi":null,"raw":"W. J. Kao, “Evaluation of protein-modulated macrophage behavior on biomaterials: designing biomimetic materials for cellular engineering,” Biomaterials, vol. 20, no. 23-24, pp. 2213–2221, 1999.","cites":null},{"id":42814156,"title":"Guidance and activation of murine macrophages by nanometric scale topography,”","authors":[],"date":"1996","doi":null,"raw":"B. Wo´jciak-Stothard, A. Curtis, W. Monaghan, K. Macdonald, and C. Wilkinson, “Guidance and activation of murine macrophages by nanometric scale topography,” Experimental Cell Research, vol. 223, no. 2, pp. 426–435, 1996.","cites":null},{"id":42814202,"title":"Human IgG Fc receptor heterogeneity: molecular aspects and clinical implications,”","authors":[],"date":"1993","doi":null,"raw":"J. G. J. Van De Winkel and P. J. A. Capel, “Human IgG Fc receptor heterogeneity: molecular aspects and clinical implications,” Immunology Today, vol. 14, no. 5, pp. 215–221, 1993.","cites":null},{"id":42814234,"title":"Human monocyte adhesion and activation on crystalline polymers with different morphology and wettability in vitro,”","authors":[],"date":"2000","doi":null,"raw":"T. H. Young, D. T. Lin, and LI. Y. Chen, “Human monocyte adhesion and activation on crystalline polymers with different morphology and wettability in vitro,” Journal of Biomedical Materials Research, vol. 50, no. 4, pp. 490–498, 2000.","cites":null},{"id":42814116,"title":"Implant surfaces and interface processes,”","authors":[],"date":"1999","doi":null,"raw":"B. Kasemo and J. Gold, “Implant surfaces and interface processes,” Advances in Dental Research, vol. 13, pp. 8–20, 1999.","cites":null},{"id":42814102,"title":"Inflammation, wound healing and the foreign body response,” in Biomaterials Science: An Introduction to Materials in","authors":[],"date":"2004","doi":null,"raw":"J. Anderson, “Inflammation, wound healing and the foreign body response,” in Biomaterials Science: An Introduction to Materials in Medicine, B. D. Ratner, A. S. Hoffman, F. J. Schoen, and J. E. Lemons, Eds., Academic Press, San Diego, Calif, USA, 2004.","cites":null},{"id":42814104,"title":"Inflammatory responses to biomaterials,”","authors":[],"date":"1995","doi":null,"raw":"L. Tang and J. W. Eaton, “Inflammatory responses to biomaterials,” American Journal of Clinical Pathology, vol. 103, no. 4, pp. 466–471, 1995.","cites":null},{"id":42814146,"title":"Influence of nanoporesize on platelet adhesion and activation,”","authors":[],"date":"2008","doi":null,"raw":"N. Ferraz, J. Carlsson, J. Hong, and M. K. Ott, “Influence of nanoporesize on platelet adhesion and activation,” Journal of Materials Science, vol. 19, no. 9, pp. 3115–3121, 2008.","cites":null},{"id":42814166,"title":"Influence of nanoscale surface topography and chemistry on the functional behaviour of an adsorbed model macromolecule,”","authors":[],"date":"2001","doi":null,"raw":"D. S. Sutherland, M. Broberg, H. Nygren, and B. Kasemo, “Influence of nanoscale surface topography and chemistry on the functional behaviour of an adsorbed model macromolecule,” Macromolecular Bioscience, vol. 1, no. 6, pp. 270– 273, 2001.","cites":null},{"id":42814170,"title":"Macrophage interactions with modified material surfaces,” Current Opinion","authors":[],"date":"2001","doi":null,"raw":"P. Thomsen and C. Gretzer, “Macrophage interactions with modified material surfaces,” Current Opinion in Solid State and Materials Science, vol. 5, no. 2-3, pp. 163–176, 2001.","cites":null},{"id":42814201,"title":"Macrophage-material surface interactions,","authors":[],"date":"2000","doi":null,"raw":"C. Gretzer, Macrophage-material surface interactions, Ph.D. thesis, Go¨teborg University, Go¨teborg, Sweden, 2000.","cites":null},{"id":42814112,"title":"Mediation of biomaterial-cell interactions by adsorbed proteins: a review,”","authors":[],"date":"2005","doi":null,"raw":"C. J. Wilson, R. E. Clegg, D. I. Leavesley, and M. J. Pearcy, “Mediation of biomaterial-cell interactions by adsorbed proteins: a review,” Tissue Engineering, vol. 11, no. 1-2, pp. 1–18, 2005.","cites":null},{"id":42814199,"title":"Molecular determinants of acute inflammatory responses to biomaterials,”","authors":[],"date":"1996","doi":null,"raw":"L. Tang, T. P. Ugarova, E. F. Plow, and J. W. Eaton, “Molecular determinants of acute inflammatory responses to biomaterials,” Journal of Clinical Investigation, vol. 97, no. 5, pp. 1329– 1334, 1996.","cites":null},{"id":42814111,"title":"My voyage of discovery to proteins in flatland ...and beyond,”","authors":[],"date":"2008","doi":null,"raw":"W. Norde, “My voyage of discovery to proteins in flatland ...and beyond,” Colloids and Surfaces B, vol. 61, no. 1, pp. 1– 9, 2008.","cites":null},{"id":42814150,"title":"Nanoporesize affects complement activation,”","authors":[],"date":"2008","doi":null,"raw":"N. Ferraz, B. O. Nilsson, J. Hong, and M. K. Ott, “Nanoporesize affects complement activation,” Journal of Biomedical Materials Research A, vol. 87, no. 3, pp. 575–581, 2008.","cites":null},{"id":42814143,"title":"Nanoporous aluminum oxide affects neutrophil behaviour,”","authors":[],"date":"2004","doi":null,"raw":"M. Karlsson, A. Johansson, L. Tang, and M. Boman, “Nanoporous aluminum oxide affects neutrophil behaviour,” Microscopy Research and Technique, vol. 63, no. 5, pp. 259–265, 2004.","cites":null},{"id":42814144,"title":"Nanoporous aluminum oxide membranes for filtration and biofunctionalization,”","authors":[],"date":"2007","doi":null,"raw":"A. Thormann, N. Teuscher, M. Pfannmo¨ller, U. Rothe, and A. Heilmann, “Nanoporous aluminum oxide membranes for filtration and biofunctionalization,” Small, vol. 6, no. 6, pp. 1032–1040, 2007.","cites":null},{"id":42814132,"title":"Nanostructured materials for applications in drug delivery and tissue engineering,”","authors":[],"date":"2007","doi":null,"raw":"M. Goldberg, R. Langer, and X. Jia, “Nanostructured materials for applications in drug delivery and tissue engineering,” Journal of Biomaterials Science, vol. 18, no. 3, pp. 241–268, 2007.","cites":null},{"id":42814152,"title":"Nanotopography: cellular responses to nanostructured materials,”","authors":[],"date":"2006","doi":null,"raw":"R. Kriparamanan, P. Aswath, A. Zhou, L. Tang, and K. T. Nguyen, “Nanotopography: cellular responses to nanostructured materials,” Journal of Nanoscience and Nanotechnology, vol. 6, no. 7, pp. 1905–1919, 2006.","cites":null},{"id":42814197,"title":"Plasma protein adsorbed biomedical polymers: activation of human monocytes and induction of interleukin 1,”","authors":[],"date":"1989","doi":null,"raw":"T. L. Bonfield, E. Colton, and J. M. Anderson, “Plasma protein adsorbed biomedical polymers: activation of human monocytes and induction of interleukin 1,” Journal of Biomedical Materials Research, vol. 23, no. 6, pp. 535–548, 1989.","cites":null},{"id":42814145,"title":"Porous anodic alumina: fabrication, characterization and applications,”","authors":[],"date":"1997","doi":null,"raw":"G. E. Thompson, “Porous anodic alumina: fabrication, characterization and applications,” Thin Solid Films, vol. 297, no. 1-2, pp. 192–201, 1997.","cites":null},{"id":42814114,"title":"Principles underlying the role of adsorbed plasma proteins in blood interactions with foreign materials,”","authors":[],"date":"1993","doi":null,"raw":"T. A. Horbett, “Principles underlying the role of adsorbed plasma proteins in blood interactions with foreign materials,” Cardiovascular Pathology, vol. 2, no. 3, pp. 137S–148S, 1993.","cites":null},{"id":42814148,"title":"Procoagulant behavior and platelet microparticle generation on nanoporous alumina,”","authors":[],"date":"2010","doi":null,"raw":"N. Ferraz, J. Hong, and M. Karlsson Ott, “Procoagulant behavior and platelet microparticle generation on nanoporous alumina,” Journal of Biomaterials Applications, vol. 24, no. 8, pp. 675–692, 2010.","cites":null},{"id":42814117,"title":"Protein adsorption to solid surfaces,”","authors":[],"date":"1991","doi":null,"raw":"M. Wahlgren and T. Arnebrant, “Protein adsorption to solid surfaces,” Trends in Biotechnology, vol. 9, no. 6, pp. 201–208, 1991.","cites":null},{"id":42814173,"title":"Proteinmediated macrophage adhesion and activation on biomaterials: a model for modulating cell behavior,”","authors":[],"date":"1999","doi":null,"raw":"W. J. Kao, J. A. Hubbell, and J. M. Anderson, “Proteinmediated macrophage adhesion and activation on biomaterials: a model for modulating cell behavior,” Journal of Materials Science, vol. 10, no. 10-11, pp. 601–605, 1999.","cites":null},{"id":42814157,"title":"Reduced responses of macrophages on nanometer surface features of altered alumina crystalline phases,”","authors":[],"date":"2009","doi":null,"raw":"D. Khang, P. Liu-Snyder, R. Pareta, J. Lu, and T. J. Webster, “Reduced responses of macrophages on nanometer surface features of altered alumina crystalline phases,” Acta Biomaterialia, vol. 5, no. 5, pp. 1425–1432, 2009.","cites":null},{"id":42814127,"title":"Significance of synthetic nanostructures in dictating cellular response,”","authors":[],"date":"2005","doi":null,"raw":"E. K. F. Yim and K. W. Leong, “Significance of synthetic nanostructures in dictating cellular response,” Nanomedicine, vol. 1, no. 1, pp. 10–21, 2005.","cites":null},{"id":42814196,"title":"The effects of surface chemistry and adsorbed proteins on monocyte\/macrophage adhesion to chemically modified polystyrene surfaces,”","authors":[],"date":"2001","doi":null,"raw":"M. Shen and T. A. Horbett, “The effects of surface chemistry and adsorbed proteins on monocyte\/macrophage adhesion to chemically modified polystyrene surfaces,” Journal of Biomedical Materials Research, vol. 57, no. 3, pp. 336–345, 2001.","cites":null},{"id":42814118,"title":"The role of adsorbed proteins in tissue response to biomaterials,” in Biomaterials Science: An Introduction to Materials in","authors":[],"date":"2004","doi":null,"raw":"T. Horbett, “The role of adsorbed proteins in tissue response to biomaterials,” in Biomaterials Science: An Introduction to Materials in Medicine, B. D. Ratner, A. S. Hoffman, F.J. Schoen, and A. S. Lemons, Eds., Academic Press, San Diego, Calif, USA, 2004.","cites":null},{"id":42814235,"title":"The role of complement in biomaterial-induced inflammation,”","authors":[],"date":"2007","doi":null,"raw":"B. Nilsson, K. N. Ekdahl, T. E. Mollnes, and J. D. Lambris, “The role of complement in biomaterial-induced inflammation,” Molecular Immunology, vol. 44, no. 1–3, pp. 82–94, 2007.","cites":null},{"id":42814131,"title":"The role of surface science in bioengineered materials,”","authors":[],"date":"2002","doi":null,"raw":"M. Tirrell, E. Kokkoli, and M. Biesalski, “The role of surface science in bioengineered materials,” Surface Science, vol. 500, no. 1–3, pp. 61–83, 2002.","cites":null},{"id":42814168,"title":"Topographical control of cells,”","authors":[],"date":"1997","doi":null,"raw":"A. Curtis and C. Wilkinson, “Topographical control of cells,” Biomaterials, vol. 18, no. 24, pp. 1573–1583, 1997. 8 International Journal of Biomaterials","cites":null},{"id":42814163,"title":"Topographical control of human macrophages by a regularly microstructured polyvinylidene fluoride surface,”","authors":[],"date":"2008","doi":null,"raw":"N. E. Paul, C. Skazik, M. Harwardt et al., “Topographical control of human macrophages by a regularly microstructured polyvinylidene fluoride surface,” Biomaterials, vol. 29, no. 30, pp. 4056–4064, 2008.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-12","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"Hindawi Publishing Corporation","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.brighton.ac.uk:8041<\/identifier><datestamp>\n      2015-04-15T15:06:06Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D43303030<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.brighton.ac.uk\/8041\/<\/dc:relation><dc:title>\n        Nanoporosity of alumina surfaces induces different patterns of activation in adhering monocytes\/ macrophages<\/dc:title><dc:creator>\n        Ferraz, N.<\/dc:creator><dc:creator>\n        Hoong, J.<\/dc:creator><dc:creator>\n        Santin, Matteo<\/dc:creator><dc:creator>\n        Karlsson-Ott, M.<\/dc:creator><dc:subject>\n        C000 Biological and Biomedical Sciences<\/dc:subject><dc:publisher>\n        Hindawi Publishing Corporation<\/dc:publisher><dc:date>\n        2010-12<\/dc:date><dc:type>\n        Journal article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by<\/dc:rights><dc:identifier>\n        http:\/\/eprints.brighton.ac.uk\/8041\/1\/Nanoporosity_of_Aluminia_Surfaces.pdf<\/dc:identifier><dc:identifier>\n          Ferraz, N., Hoong, J., Santin, Matteo and Karlsson-Ott, M.  (2010) Nanoporosity of alumina surfaces induces different patterns of activation in adhering monocytes\/ macrophages  International Journal of Biomaterials, 2010.   ISSN 1687-8795     <\/dc:identifier><dc:relation>\n        10.1155\/2010\/402715<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.brighton.ac.uk\/8041\/","10.1155\/2010\/402715"],"year":2010,"topics":["C000 Biological and Biomedical Sciences"],"subject":["Journal article","PeerReviewed"],"fullText":"Hindawi Publishing Corporation\nInternational Journal of Biomaterials\nVolume 2010, Article ID 402715, 8 pages\ndoi:10.1155\/2010\/402715\nResearch Article\nNanoporosity of Alumina Surfaces Induces Different Patterns of\nActivation in Adhering Monocytes\/Macrophages\nNatalia Ferraz,1 Jaan Hong,2 Matteo Santin,3 and Marjam Karlsson Ott1\n1 Division of Surface Biotechnology, Department of Physical and Analytical Chemistry,\nBMC, Uppsala University, P.O. Box 577, 751 23 Uppsala, Sweden\n2 Division of Clinical Immunology, Rudbeck Laboratory, Department of Oncology, Radiology and Clinical Immunology,\nUniversity Hospital, Uppsala University, 751 85 Uppsala, Sweden\n3 School of Pharmacy and Biomolecular Sciences, University of Brighton, Brighton BN2 4GJ, UK\nCorrespondence should be addressed to Marjam Karlsson Ott, marjam.ott@angstrom.uu.se\nReceived 14 July 2010; Revised 9 November 2010; Accepted 1 December 2010\nAcademic Editor: Maryam Tabrizian\nCopyright © 2010 Natalia Ferraz et al. This is an open access article distributed under the Creative Commons Attribution License,\nwhich permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited.\nThe present study shows that alumina nanotopography aﬀects monocyte\/macrophage behavior. Human mononuclear cells\ncultured on alumina membranes with pore diameters of 20 and 200 nm were evaluated in terms of cell adhesion, viability,\nmorphology, and release of proinflammatory cytokines. After 24 hours, cell adhesion was assessed by means of light microscopy\nand cell viability by measuring LDH release. The inflammatory response was evaluated by quantifying interleukin-1β and tumour\nnecrosis factor-α. Finally, scanning electron microscopy was used to study cell morphology. Results showed pronounced diﬀerences\nin cell number, morphology, and cytokine release depending on the nanoporosity. Few but highly activated cells were found on the\n200 nm porous alumina, while relatively larger number of cells were found on the 20 nm porous surface. However, despite their\nlarger number, the cells adhering on the 20 nm surface exhibited reduced pro-inflammatory activity. The data of this paper implies\nthat nanotopography could be exploited for controlling the inflammatory response to implants.\n1. Introduction\nMaterials intended for applications in humans, that is,\nbiomaterials in the form of medical devices and pros-\ntheses, trigger biological responses such as inflammation,\ntissue repair, and regeneration when implanted into living\ntissue [1–3]. The initial event after implantation is the\nadsorption of plasma proteins onto the material surface, a\ncomplex procedure involving dynamic interactions between\nthe proteins and material surface, leading to conformational\nchanges of the proteins [4–7]. The subsequent phenomena,\nthat is, activation of the cascade systems of blood and\nrecruitment and adherence and activation of blood cells,\nare governed by the initially adsorbed proteins [8, 9].\nPlatelets, neutrophils, and monocytes adhere to the plasma\nprotein-coated biomaterial surface and become players in the\nactivation of an inflammatory process. In particular, mon-\nocyte-derived macrophages play a key role in this immune\nprocess. Upon activation, macrophages secrete cytokines,\nchemokines, growth factors, and other bioactive agents that\nmodulate the function of both immune-competent and\ntissue cells. Therefore, macrophages have a central role in the\ntissue repair process, mediating the clearance of tissue debris\nand bacteria and promoting wound healing through tissue-\ncell migration and proliferation. In the case of implanted\nmaterials, the presence of a layer of denaturated proteins is\nlikely to alter the activity of these cells leading to chronic\ninflammation and to the development of a fibrotic tissue that\nprevents the integration of the implant with the surrounding\ntissue [1, 10].\nBiologically inspired materials are being developed with\nthe aim of improving the integration of medical implants\nand, as a consequence, their clinical performance [11].\nAmong the various biomimetic approaches, a promising\nstrategy is the design of topographically patterned surfaces\nthat resemble those found in the biological extracellular\nenvironment of the tissues [12–14]. Indeed, a broad range\nof cells (osteoblast, fibroblasts, neutrophils, macrophages,\n2 International Journal of Biomaterials\nendothelial, epithelial, and smooth muscle cells) have been\nshown to react to nanoscale features in terms of cell adhe-\nsion, morphology, orientation, and activity. These features\nincluded grooves, ridges, spikes, islands, wells, nodes, and\npores [12, 15–19].\nNanoporous alumina has been recognized as an impor-\ntant material and as a template for the fabrication of nanos-\ntructures [20]. Anodic oxidation of aluminium in polyprotic\nacids produces a well-ordered structure of nanoporous\nalumina, where pore size can be determined by varying\nthe applied voltage [21]. Previous works have shown that\nnanoporous alumina has a great influence on both com-\nplement activation and platelet adhesion and activation\n[22–24].\nIn this paper, the eﬀect of nanopore size on human\nmonocytes\/macrophages (MM) in terms of cell adhesion,\nmorphology, and release of proinflammatory cytokines is\ndescribed. Alumina membranes with two distinct pore sizes\n(i.e., 20 nm and 200 nm in diameter) were compared for\ntheir ability to activate human MM. Alumina membranes\nwere treated with human plasma to induce the formation\nof an adsorbed protein biofilm and then incubated for 24\nhours with freshly isolated human MM. Scanning electron\nmicroscopy was used to evaluate the morphology of the\nadhering cells. Levels of cell adhesion and viability were\nquantitatively evaluated by means of light microscopy and\nby measuring lactate dehydrogenase (LDH) activity in the\nsupernatants. Finally, cell activation was also assessed by\nquantifying the release of proinflammatory cytokines such as\ninterleukin-1β (IL-1β) and tumour necrosis factor-α (TNF-\nα).\n2. Materials and Methods\n2.1. Nanoporous Alumina. Nanoporous alumina membranes\nwith pore diameters of 20 and 200 nm (Anodisc Whatman\nInternational Ltd, Madison, England) were used in this\nstudy. The membrane discs were 13 mm in diameter and\n60 μm thick with narrow pore size distribution. According\nto Karlsson et al. [19], the membranes have similar surface\nroughness and surface chemical characteristics independent\nof porosity. Readers are referred to the work done by\nKarlsson et al. [19] for detailed chemical compositions\nof the nanoporous alumina membranes. Figure 1 shows\nrepresentative SEM micrographs of the surfaces of 20 and\n200 nm alumina membranes.\n2.2. Isolation and Culture of Mononuclear Cells. Whole\nvenous blood was freshly collected from seven healthy donors\nin heparin-coated 50 mL Falcon tubes (Becton Dickinson,\nUSA) containing soluble heparin (Leo Pharma A\/S, Ballerup,\nDenmark), giving a final concentration of 1 IU heparin\/mL.\nHuman monocyte enrichment cocktail (RosetteSep, Stem-\nCell Technologies, Vancouver, BC, Canada) was added to\nthe heparinized blood according to the manufacturer’s\ninstructions. After 20 min of incubation, mononuclear\ncells were isolated using Ficoll-paque medium (Amersham\nBiosciences AB, Uppsala, Sweden). Briefly, blood samples\ncontaining the enrichment cocktail were layered on to Ficoll-\npaque medium and then centrifuged for 20 min at 1200× g\nat room temperature. The mononuclear cell ring formed\nat the plasma-Ficoll interface was collected and washed\nthree times with Hank’s balanced salt solution (HBSS,\nInvitrogen, UK), containing 2% (v\/v) foetal calf serum\n(FCS). Cells were finally resuspended in RPMI-1640 medium\n(Sigma, UK), supplemented with 5% (v\/v) FCS, 100 IU\npenicillin\/mL, and 100 μg streptomycin\/mL, and counted\nusing a haemocytometer. Cell viability was assessed using\ntrypan blue staining (95% cell viability). The cell isolation\nstep provided a fraction of platelet rich plasma (PRP) which\nwas collected and used for coating the materials. Alumina\nmembranes were placed in 24-well tissue culture plates and\ncoated with 1 mL of PRP for 30 min at 37◦C, followed by 3\nwashing steps with HBSS. Cells were added to the wells (4 ×\n105 cells\/well) and cultured for 24 h at 37◦C, 5% CO2 in a\nhumidified atmosphere. After 3 h of incubation, medium was\nchanged to remove nonadherent lymphocytes. At the end of\neach experiment, supernatants were collected, centrifuged,\naliquoted, and stored at −70◦C for future analyses. The\nnanoporous alumina membranes were fixed with 1.5% (v\/v)\nglutaraldehyde and stored at 4◦C until microscopy analyses.\n2.3. Cell Number: Light Microscopy. Adherent cells were fixed\nwith 1.5% (v\/v) glutaraldehyde, stained with crystal violet,\nand observed under a light microscope (Carl Zeiss, Jena\nGermany). The density of adherent MM was determined\nby counting cells in 9 representative 20x objective fields\n(on duplicate samples) and expressed as number of MM\n(± standard error) per membrane (n = 7).\n2.4. Cell Viability: LDH Release. Nonviable cells were esti-\nmated by analyzing the activity of lactate dehydrogenase\n(LDH) in the culture medium. Duplicate samples of culture\nmedium were analyzed with a LDH activity kit (In vitro\ntoxicology assay kit LDH based, Sigma, Missouri, USA).\nThe assay measures LDH activity via the reduction of NAD.\nThe resulting reduced product (NADH) is used in the\nstoichiometric conversion of a tetrazolium dye, and the\nresulting coloured compound is measured spectrophoto-\nmetrically. The enzyme activity was measured by reading\nthe absorbance at 492 nm and corrected by the values of\nthe blank (RPMI medium supplemented with 5% (v\/v)\nFCS, 100 IU penicillin\/mL, and 100 μg streptomycin\/mL). A\nnegative control was done by measuring LDH activity of\ncells cultured on Thermanox (Thermanox Coverslips, Nalge\nNUNC International, Rochester, USA). Cultured cells lysed\nby Triton-X100 served as positive control. LDH release was\nexpressed as arbitrary units (optical density at 492 nm) and\nnormalized by the number of adherent cells. Values were\ngiven as mean ± standard error of the normalized LDH\nrelease from n = 7.\n2.5. Cytokine Release: IL-1β and TNF-α. Cytokine produc-\ntion was quantified in duplicate samples of supernatant by\nenzymatic immunoassays. TNF-α and IL-1β were assayed\nInternational Journal of Biomaterials 3\n500 μm\n(a)\n500 μm\n(b)\nFigure 1: SEM micrographs showing nanoporous alumina membranes with pore diameters of 200 nm (a) and 20 nm (b).\nby ELISA kits (Human IL-1β\/IL-1F2 and Human TNF-\nα\/TNFSF1A Quantikine HS, R&D systems, UK) following\nthe manufacturer’s protocol. Cytokine values were obtained\nas pg\/mL and then normalized by the number of cells\nadhering on the corresponding membrane. Values were\nexpressed as mean± standard error from n = 7. The number\nof nonadherent cells was negligible, and their production of\ncytokines was assumed to be below the kit sensitivity.\n2.6. Cell Morphology: Scanning Electron Microscopy. After\nculture, the alumina membranes were fixed with 1.5%\n(v\/v) glutaraldehyde, dehydrated through a series of acetone\nconcentrations (25, 50, 70, 80, 90, and 100% by volume),\nand critically point dried and sputtered with gold, finally to\nbe studied using an LEO 1530, Gemini SEM. The degrees of\nplasmalemma roughness and cell spreading were evaluated\nas indicators of cell activation.\n2.7. Statistics. Data were statistically evaluated by the Stu-\ndent’s t-test for unpaired samples, using Statview software for\nMacintosh. Samples were considered statistically diﬀerent at\neither P < .001 or P < .05.\n3. Results\n3.1. Cell Number. Nanoporous alumina membranes dis-\nplayed poresize-dependent monocyte\/macrophage adhesion.\nExamination of the nanoporous surfaces after 24 h under\nlight microscopy showed that MM adhesion on the 20 nm-\npore alumina membranes was significantly higher than on\nthe 200 nm-pore membranes (Figure 2). This increase was\nsignificantly diﬀerent and approximately 100% higher.\n3.2. Cell Viability. Measurement of released LDH normalized\nby the number of adherent cells indicated no significant\ndiﬀerence between the studied materials: 20 nm (4 ± 1)\n10−4 AU\/cell number, 200 nm (10± 2) 10−4 AU\/cell number,\nP > .05. Comparison with the negative control indicated\nsimilar cell viability: Thermanox (3 ± 1)10−4 AU\/cell\nnumber, P > .05. Cells lysed by Triton-X 100 showed 10 times\nhigher values of normalized LDH release (P < .05). Hence,\nthe studied material showed no significant toxicity, and\ncell viability was comparable with a commonly used tissue\nculture substrate (Thermanox).\n3.3. Cytokine Release. Comparison of IL-1β secreted by\ncells attached to the diﬀerent materials showed that mono-\ncytes\/macrophages on the 200 nm alumina surface secreted\nsignificantly higher levels of IL-1β than the cells attached\nto the 20 nm alumina membrane (Figure 3(a)). TNF-α\nsecretion showed the same tendency (Figure 3(b)).\n3.4. Scanning Electron Microscopy. SEM micrographs show\nthat cell morphology is aﬀected by the diﬀerent surfaces\n(Figures 4(a)–4(d)). The 20 nm-pore alumina membranes\ninduced lower degree of cell spreading (Figures 4(a) and\n4(c)) as MM appeared round-shaped and less spread than\nthe cells adhering on the 200 nm-pore membranes (Figures\n4(b) and 4(d)). The 200 nm-pore surface presented cells\nwith rough plasmalemma and extensive filopodia, both\ntypical signs of activation (Figure 4(d)). Cells on the 20 nm-\npore alumina, although showing some degree of membrane\nruﬄing, did not show well-established filipodia extensions,\nthus indicating a lower degree of activation (Figure 4(c)).\nFurthermore, the cells contacting this type of porous alumina\nseem to form clusters and fuse into giant cells (Figure 4(c)).\nConversely, the relatively fewer cells observed on the surface\nof the 200 nm-pore alumina were mostly adhering as single\nand well-spread cells with only a few cell aggregates being\nvisible (Figure 4(d)). SEM studies also confirmed higher cell\nadhesion on 20 nm-pore alumina as compared to the 200 nm\nmembrane (Figures 4(a) and 4(b)).\n4. Discussion\nThe recent advance in engineering nanosize materials has\nshown the potential of controlling cell behavior and tis-\nsue\/implant integration by nanotopography [12, 14, 25].\nPrevious works have demonstrated that nanoporous alumina\ncan have an eﬀect on neutrophil activation, complement\n4 International Journal of Biomaterials\n(a) (b)\n200 nm20 nm\n0\n100\n200\n300\n400\n500\n600\nN\nu\nm\nbe\nr\nof\nM\nM\n\/m\nem\nbr\nan\ne\n(c)\nFigure 2: Representative light microscopy images of crystal violet-stained MM on (a) 20 nm-pore alumina and (b) 200 nm-pore alumina.\n(c) Number of MM on alumina membranes determined by means of light microscopy. Cells were counted in 9 representative 20x objective\nfields on each membrane. Data represents the mean ± SE from experiments using blood from 7 diﬀerent donors. Cell adhesion on the\n20 nm-pore alumina membrane was significantly higher than on the 200 nm-pore alumina (P < .05).\n200 nm20 nm\n0\n10\n20\n30\n40\n50\n60\n70\n80\nIL\n-1\nβ\n(p\ng\/\nm\nL)\n\/(\nM\nM\n\/m\nem\nbr\nan\ne)\n(a)\n200 nm20 nm\n0\n2\n4\n6\n8\n10\n12\n14\n16\nT\nN\nF-\nα\n.(\np\ng\/\nm\nL)\n\/(\nM\nM\n\/m\nem\nbr\nan\ne)\n(b)\nFigure 3: Cytokines released by MM after 24 h of incubation with 20 nm- and 200 nm-pore alumina. Data represents the mean ± SE\nfrom experiments using blood from 7 diﬀerent donors. A significant diﬀerence between the two materials was observed for IL-1β release\n(P < .001), as well as a clear tendency for TNF-α.\nInternational Journal of Biomaterials 5\n20 μm\n(a)\n10 μm\n(b)\n10 μm\n(c)\n2 μm\n(d)\nFigure 4: SEM micrographs of monocytes\/macrophages after 24 h of incubation on nanoporous alumina. MM on the 200 nm-pore\nmembranes ((b) and (d)) show clear signs of activation (rough plasmalemma and extended filipodia), while cells on the 20 nm-pore\nmembranes ((a) and (c)) appear more round shaped with little membrane ruﬄing and no established filipodia extensions. A higher tendency\ntoward cell clustering and fusion was also observed on the 20 nm-pore alumina (c).\nactivation, and platelet adhesion and activation [19, 22–24].\nThe eﬀect of the surface nanotopography of several bio-\nmaterials on MM behavior has been widely described\n[26–31]. Hence, with the intention of getting a more\ncomplete understanding of the eﬀect of nanoporosity on\nthe inflammatory system we have chosen to evaluate the\nresponse of MM to alumina membranes with diﬀerent\nnanoporosities. The results of this work have shown that\nthe nanoporesize of the studied material aﬀects both MM\nadhesion and activation. The diﬀerent activation states were\nreflected by morphological changes and secretion levels of\nproinflammatory cytokines.\nA unique pattern of cell adhesion was observed on the\n20 nm-pore alumina, where the cells seem to prefer the\nformation of clustering rather than spreading on the surface.\nClustering is the typical behavior of cells when in contact\nwith substrates unable to promote cell adhesion. In the\ncase of the 20-nm porous alumina substrates, cells showed\na tendency to form clustering, and they established only\nlimited connection with the substrate thus suggesting that\nthis material can limit monocytes\/macrophages adhesion\nand activation. The mild activation of these adhering MM\nwas confirmed by the analysis of proinflammatory cytokines\nTNF-α and IL-1β. Conversely MM adhering on the 200 nm-\npore alumina membranes were able to establish a relatively\nstrong contact with the surface and were activated at levels\nsignificantly higher than MM adhering on the 20 nm-pore\nmembranes.\nThe cytokine normalized data provides information\nregarding the eﬀect of the diﬀerent nanoporosities on single\ncells and indicates that 200 nm pore size surface promotes\nhigher MM activation.\nFor a more clinically relevant approach, attention should\nbe paid to the total levels of cytokines. When evaluating\ntotal levels of cytokines, higher levels of IL-1β were found\nfor MM culture on 200 nm alumina compared with cells\non 20 nm membranes: 20 nm (10 ± 1.0) 103 pg\/mL, 200 nm\n(13 ± 0.7) 103 pg\/mL, P = .100. Although this diﬀerence\nis not significant, a tendency can be established, indicating\nthat 20 nm alumina most probably will lead to a lower\noverall inflammatory response as compared to the 200 nm\nmembranes.\nLDH activity was measured to determine if cytokine\nrelease was caused by the loss of cell integrity as a con-\nsequence of diﬀerent cytotoxic eﬀects by the biomaterials.\nThe lack of any significant diﬀerence between the LDH\nrelease of the cells adhering on alumina-based surface and on\nThermanox suggested that the release of enzymatic activity\ncan be attributed to the degranulation process that the\ncells are likely to undergo during their relative activation\nby surface contact. Indeed, these levels were ten times\nlower than those found in the positive controls, where cell\nmembrane integrity was deliberately disrupted by surfactant\ntreatment. These diﬀerences suggest lack of cytotoxicity by\nthe materials and corroborate the hypothesis of an active\nrelease of cytokines by the activated cells.\n6 International Journal of Biomaterials\nTwo main mechanisms can be proposed to explain how\nsurface topography may aﬀect MM adhesion and activation.\nFirstly, it is well established that material nanotopography\naﬀects protein adsorption, not only in terms of amount\nbut also in dictating conformational changes, orientation,\nand exposure of cell-binding sites [7, 32]. Secondly, surface\ntopography has been found to aﬀect spreading, proliferation\nand diﬀerentiation of cells [15, 25, 33]. It has been proposed\nthat cells are capable of sensing nanometric structures and\nthereby of responding to these features by changing the\nspatial organization of their cytoskeleton through membrane\nreceptors. These variations are known to have an eﬀect on\ngene expression and, as a consequence, on cell phenotype\nand functions [25].\nFrom the numerous studies thus far published it is\nvery diﬃcult to single out the eﬀects of adsorbed proteins\non MM adhesion and activation [34, 35]. In vitro studies\npresent a wide spectrum of materials, where chemistry and\ntopography have not always been varied in a systematic\nand truly comparable manner. In addition, there is a great\nvariation in the use of proteins as well as their concentrations\nand the conditions for the adsorption processes [36–42].\nThere is a consensus about the role of fibrinogen and C3\nin promoting MM adhesion to biomaterial surfaces [43, 44].\nHowever, the eﬀect of adsorbed proteins on cytokine release\nvaries between diﬀerent studies. For instance, Shen et al.\n[39] describe that fibrinogen adsorbed on several polymers\nsurfaces does not promote TNF-α release. The authors\npropose that monocyte integrin receptors participate mostly\nin cell adhesion, rather than directly activating MM for\ncytokine release. On the contrary, Gretzer [45] describes a\nfibrinogen-mediated proinflammatory eﬀect with increased\nmonocyte secretion of IL-1β and TNF-α and decreased secre-\ntion of IL-10. Interactions of adsorbed IgG with monocyte\nFc receptors are also documented to promote the release of\nIL-1β and TNF-α by adherent monocytes [46, 47]. Jenney\nand Anderson [37] proposed that preadsorbed IgG promotes\nlong-term macrophage adhesion, an eﬀect that is mediated\nby Fab and F(ab ′)2 fragments instead of the Fc fragment.\nA previous work has demonstrated that 200 nm-pore\nalumina adsorbed significantly higher amounts of the\nplasma proteins IgM, IgG, C3, and C1q than the 20 nm-\npore membranes [24]. Thus, the results on MM adhesion\npresented in this paper prove that not only the amount\nof adsorbed protein but also the protein conformation\nand orientation may play an important role for cellular\nadhesion. Furthermore, MM could “sense” the topography\nand as a result might expose diﬀerent membrane receptors\n[25, 26]. Hence, the reduced number of adherent cells on\nthe 200 nm-pore alumina could be related to changes in\nprotein conformation and\/or MM “sensing” the diﬀerent\nnanometric structure, thus leading to a less favorable\nexposure of key binding receptors. Instead, MM seem to\nadopt a configuration favorable for exposure of activation\nreceptor-binding sites (e.g., receptors for Fc), and as a result,\nthey become highly activated, thus producing high levels of\ncytokines.\nConcerning the increased cell attachment on the 20 nm-\npore alumina, it may be speculated that in addition to MM\nexposing adhesion receptor-binding sites, the cells express\nreceptors favouring giant cell formation. However, despite\nthe relatively higher cell number, the cytokine release on\nthis type of membrane is less pronounced than on the\n200 nm-pore membranes. Hence, as proposed by Young el\nal. [47], it can be hypothesized that greater activation energy\nis required to activate the receptors of MM attached to\nthe 20 nm-pore surface as compared to the 200 nm-pore\nalumina.\nC5a and C3a are anaphylatoxins generated when the\ncomplement systems are activated. C5a stimulates the release\nof inflammatory cytokines by MM [48]. C3a has also\nbeen described to enhance TNF-α and IL-1β synthesis by\nadherent monocytes [49]. As blood exposure to 200 nm-\npore alumina leads to much higher complement activation\nthan when exposed to the 20 nm-pore membranes [24], the\nincreased levels of C5a and C3a could also contribute to\nthe diﬀerence observed in cytokine secretion between the\nmembranes. The mechanisms that regulate material-induced\nMM activation are not yet completely understood. However,\nin the case of nanoporous alumina, a direct relationship\nbetween complement activation and MM cytokine release\ncan be postulated.\nThe present work shows that by changing the nanopore\nsize of alumina it is possible to modulate MM behavior. In\naddition, this data opens the possibility of exploiting some\nof the beneficial functions of macrophages in promoting\ntissue repair rather than chronic inflammation. Additional\nstudies to determine the fate of the cells over longer period\nof time as well as the secretion of other growth factors are\nneeded for further understanding of the eﬀect of surface\nnanotopography on MM.\n5. Conclusions\nThe present study shows that alumina nanotopography\naﬀects MM behavior. We found a clear diﬀerence in cell\nadhesion and activation between alumina membranes with\n20 nm pores as compared to membranes with 200 nm\npores. Few but highly activated cells adhered to the 200 nm\nmembrane in contrast to many but less activated MM on the\n20 nm surface. Regardless of the specific clinical applications\nof these types of surfaces, the data of this paper emphasizes\nthe role of material nanotexture in dictating inflammatory\ncell responses and implies that nanotopography can be\nexploited to subtly control the inflammatory potential of\nmedical implants.\nAcknowledgments\nThe authors wish to thank Leif Ljung from the Department\nof Medical Cell Biology for technical assistance with the SEM\nstudies and Olov Svartstro¨m for valuable help with image\nprocessing. They also thank the people that kindly donated\nblood for these experiments. This work was partly funded by\nOllie och Elof Ericssons Stifelse fo¨r vetenskaplig forskning,\nStiftelsen Lars Hiertas Minne, and Signe och Olof Wallenius\nStiftelse.\nInternational Journal of Biomaterials 7\nReferences\n[1] J. M. Anderson, “Biological responses to materials,” Annual\nReview of Materials Science, vol. 31, pp. 81–110, 2001.\n[2] J. Anderson, “Inflammation, wound healing and the foreign\nbody response,” in Biomaterials Science: An Introduction to\nMaterials in Medicine, B. D. Ratner, A. S. Hoﬀman, F. J.\nSchoen, and J. E. Lemons, Eds., Academic Press, San Diego,\nCalif, USA, 2004.\n[3] L. Tang and J. W. Eaton, “Inflammatory responses to bioma-\nterials,” American Journal of Clinical Pathology, vol. 103, no. 4,\npp. 466–471, 1995.\n[4] W. Norde, “My voyage of discovery to proteins in flatland\n...and beyond,” Colloids and Surfaces B, vol. 61, no. 1, pp. 1–\n9, 2008.\n[5] C. J. Wilson, R. E. Clegg, D. I. Leavesley, and M. J. Pearcy,\n“Mediation of biomaterial-cell interactions by adsorbed pro-\nteins: a review,” Tissue Engineering, vol. 11, no. 1-2, pp. 1–18,\n2005.\n[6] T. A. Horbett, “Principles underlying the role of adsorbed\nplasma proteins in blood interactions with foreign materials,”\nCardiovascular Pathology, vol. 2, no. 3, pp. 137S–148S, 1993.\n[7] B. Kasemo and J. Gold, “Implant surfaces and interface\nprocesses,” Advances in Dental Research, vol. 13, pp. 8–20,\n1999.\n[8] M. Wahlgren and T. Arnebrant, “Protein adsorption to solid\nsurfaces,” Trends in Biotechnology, vol. 9, no. 6, pp. 201–208,\n1991.\n[9] T. Horbett, “The role of adsorbed proteins in tissue response\nto biomaterials,” in Biomaterials Science: An Introduction to\nMaterials in Medicine, B. D. Ratner, A. S. Hoﬀman, F.J. Schoen,\nand A. S. Lemons, Eds., Academic Press, San Diego, Calif,\nUSA, 2004.\n[10] Z. Xia and J. T. Triﬃtt, “A review on macrophage responses\nto biomaterials,” Biomedical Materials, vol. 1, no. 1, article no.\nR01, pp. R1–R9, 2006.\n[11] B. D. Ratner and S. J. Bryant, “Biomaterials: where we have\nbeen and where we are going,” Annual Review of Biomedical\nEngineering, vol. 6, pp. 41–75, 2004.\n[12] E. K. F. Yim and K. W. Leong, “Significance of synthetic\nnanostructures in dictating cellular response,” Nanomedicine,\nvol. 1, no. 1, pp. 10–21, 2005.\n[13] M. Tirrell, E. Kokkoli, and M. Biesalski, “The role of surface\nscience in bioengineered materials,” Surface Science, vol. 500,\nno. 1–3, pp. 61–83, 2002.\n[14] M. Goldberg, R. Langer, and X. Jia, “Nanostructured materials\nfor applications in drug delivery and tissue engineering,”\nJournal of Biomaterials Science, vol. 18, no. 3, pp. 241–268,\n2007.\n[15] R. G. Flemming, C. J. Murphy, G. A. Abrams, S. L. Goodman,\nand P. F. Nealey, “Eﬀects of synthetic micro- and nano-\nstructured surfaces on cell behavior,” Biomaterials, vol. 20, no.\n6, pp. 573–588, 1999.\n[16] R. L. Price, K. M. Haberstroh, and T. J. Webster, “Enhanced\nfunctions of osteoblasts on nanostructed surfaces of carbon\nand alumina,” Medical and Biological Engineering and Comput-\ning, vol. 41, no. 3, pp. 372–375, 2003.\n[17] A. S. G. Curtis, N. Gadegaard, M. J. Dalby, M. O. Riehle, C.\nD. W. Wilkinson, and G. Aitchison, “Cells react to nanoscale\norder and symmetry in their surroundings,” IEEE Transactions\non Nanobioscience, vol. 3, no. 1, pp. 61–65, 2004.\n[18] K. T. Nguyen, K. P. Shukla, M. Moctezuma, and T. Liping,\n“Cellular and molecular responses of smooth muscle cells to\nsurface nanotopography,” Journal of Nanoscience and Nan-\notechnology, vol. 7, no. 8, pp. 2823–2832, 2007.\n[19] M. Karlsson, A. Johansson, L. Tang, and M. Boman,\n“Nanoporous aluminum oxide aﬀects neutrophil behaviour,”\nMicroscopy Research and Technique, vol. 63, no. 5, pp. 259–265,\n2004.\n[20] A. Thormann, N. Teuscher, M. Pfannmo¨ller, U. Rothe, and\nA. Heilmann, “Nanoporous aluminum oxide membranes for\nfiltration and biofunctionalization,” Small, vol. 6, no. 6, pp.\n1032–1040, 2007.\n[21] G. E. Thompson, “Porous anodic alumina: fabrication, char-\nacterization and applications,” Thin Solid Films, vol. 297, no.\n1-2, pp. 192–201, 1997.\n[22] N. Ferraz, J. Carlsson, J. Hong, and M. K. Ott, “Influence of\nnanoporesize on platelet adhesion and activation,” Journal of\nMaterials Science, vol. 19, no. 9, pp. 3115–3121, 2008.\n[23] N. Ferraz, J. Hong, and M. Karlsson Ott, “Procoagulant\nbehavior and platelet microparticle generation on nanoporous\nalumina,” Journal of Biomaterials Applications, vol. 24, no. 8,\npp. 675–692, 2010.\n[24] N. Ferraz, B. O. Nilsson, J. Hong, and M. K. Ott, “Nanopore-\nsize aﬀects complement activation,” Journal of Biomedical\nMaterials Research A, vol. 87, no. 3, pp. 575–581, 2008.\n[25] R. Kriparamanan, P. Aswath, A. Zhou, L. Tang, and K. T.\nNguyen, “Nanotopography: cellular responses to nanostruc-\ntured materials,” Journal of Nanoscience and Nanotechnology,\nvol. 6, no. 7, pp. 1905–1919, 2006.\n[26] B. Wo´jciak-Stothard, A. Curtis, W. Monaghan, K. Macdonald,\nand C. Wilkinson, “Guidance and activation of murine\nmacrophages by nanometric scale topography,” Experimental\nCell Research, vol. 223, no. 2, pp. 426–435, 1996.\n[27] D. Khang, P. Liu-Snyder, R. Pareta, J. Lu, and T. J. Webster,\n“Reduced responses of macrophages on nanometer surface\nfeatures of altered alumina crystalline phases,” Acta Biomateri-\nalia, vol. 5, no. 5, pp. 1425–1432, 2009.\n[28] J. Kim, D. Khang, E. L. Jong, and T. J. Webster, “Decreased\nmacrophage density on carbon nanotube patterns on polycar-\nbonate urethane,” Journal of Biomedical Materials Research A,\nvol. 88, no. 2, pp. 419–426, 2009.\n[29] A. K. Refai, M. Textor, D. M. Brunette, and J. D. Water-\nfield, “Eﬀect of titanium surface topography on macrophage\nactivation and secretion of proinflammatory cytokines and\nchemokines,” Journal of Biomedical Materials Research A, vol.\n70, no. 2, pp. 194–205, 2004.\n[30] N. E. Paul, C. Skazik, M. Harwardt et al., “Topographical\ncontrol of human macrophages by a regularly microstructured\npolyvinylidene fluoride surface,” Biomaterials, vol. 29, no. 30,\npp. 4056–4064, 2008.\n[31] S. H. Hsu, C. M. Tang, and C. C. Lin, “Biocompatibility\nof poly(e-caprolactone)\/poly(ethylene glycol) diblock copoly-\nmers with nanophase separation,” Biomaterials, vol. 25, no. 25,\npp. 5593–5601, 2004.\n[32] D. S. Sutherland, M. Broberg, H. Nygren, and B. Kasemo,\n“Influence of nanoscale surface topography and chemistry\non the functional behaviour of an adsorbed model macro-\nmolecule,” Macromolecular Bioscience, vol. 1, no. 6, pp. 270–\n273, 2001.\n[33] A. Curtis and C. Wilkinson, “Topographical control of cells,”\nBiomaterials, vol. 18, no. 24, pp. 1573–1583, 1997.\n8 International Journal of Biomaterials\n[34] P. Thomsen and C. Gretzer, “Macrophage interactions with\nmodified material surfaces,” Current Opinion in Solid State and\nMaterials Science, vol. 5, no. 2-3, pp. 163–176, 2001.\n[35] W. J. Kao, “Evaluation of protein-modulated macrophage\nbehavior on biomaterials: designing biomimetic materials for\ncellular engineering,” Biomaterials, vol. 20, no. 23-24, pp.\n2213–2221, 1999.\n[36] W. J. Kao, J. A. Hubbell, and J. M. Anderson, “Protein-\nmediated macrophage adhesion and activation on biomateri-\nals: a model for modulating cell behavior,” Journal of Materials\nScience, vol. 10, no. 10-11, pp. 601–605, 1999.\n[37] C. R. Jenney and J. M. Anderson, “Adsorbed IgG: a potent\nadhesive substrate for human macrophages,” Journal of\nBiomedical Materials Research, vol. 50, no. 3, pp. 281–290,\n2000.\n[38] C. R. Jenney and J. M. Anderson, “Adsorbed serum proteins\nresponsible for surface dependent human macrophage behav-\nior,” Journal of Biomedical Materials Research, vol. 49, no. 4, pp.\n435–447, 2000.\n[39] M. Shen, I. Garcia, R. V. Maier, and T. A. Horbett, “Eﬀects\nof adsorbed proteins and surface chemistry on foreign body\ngiant cell formation, tumor necrosis factor alpha release and\nprocoagulant activity of monocytes,” Journal of Biomedical\nMaterials Research A, vol. 70, no. 4, pp. 533–541, 2004.\n[40] M. Shen and T. A. Horbett, “The eﬀects of surface chemistry\nand adsorbed proteins on monocyte\/macrophage adhesion to\nchemically modified polystyrene surfaces,” Journal of Biomed-\nical Materials Research, vol. 57, no. 3, pp. 336–345, 2001.\n[41] T. L. Bonfield, E. Colton, and J. M. Anderson, “Plasma protein\nadsorbed biomedical polymers: activation of human mono-\ncytes and induction of interleukin 1,” Journal of Biomedical\nMaterials Research, vol. 23, no. 6, pp. 535–548, 1989.\n[42] T. L. Bonfield, E. Colton, R. E. Marchant, and J. M.\nAnderson, “Cytokine and growth factor production by mono-\ncytes\/macrophages on protein preadsorbed polymers,” Journal\nof Biomedical Materials Research, vol. 26, no. 7, pp. 837–850,\n1992.\n[43] L. Tang, T. P. Ugarova, E. F. Plow, and J. W. Eaton, “Molecular\ndeterminants of acute inflammatory responses to biomateri-\nals,” Journal of Clinical Investigation, vol. 97, no. 5, pp. 1329–\n1334, 1996.\n[44] A. K. Mcnally and J. M. Anderson, “Complement C3\nparticipation in monocyte adhesion to diﬀerent surfaces,”\nProceedings of the National Academy of Sciences of the United\nStates of America, vol. 91, no. 21, pp. 10119–10123, 1994.\n[45] C. Gretzer, Macrophage-material surface interactions, Ph.D.\nthesis, Go¨teborg University, Go¨teborg, Sweden, 2000.\n[46] J. G. J. Van De Winkel and P. J. A. Capel, “Human IgG\nFc receptor heterogeneity: molecular aspects and clinical\nimplications,” Immunology Today, vol. 14, no. 5, pp. 215–221,\n1993.\n[47] T. H. Young, D. T. Lin, and LI. Y. Chen, “Human monocyte\nadhesion and activation on crystalline polymers with diﬀerent\nmorphology and wettability in vitro,” Journal of Biomedical\nMaterials Research, vol. 50, no. 4, pp. 490–498, 2000.\n[48] B. Nilsson, K. N. Ekdahl, T. E. Mollnes, and J. D. Lambris, “The\nrole of complement in biomaterial-induced inflammation,”\nMolecular Immunology, vol. 44, no. 1–3, pp. 82–94, 2007.\n[49] T. Takabayashi, E. Vannier, B. D. Clark et al., “A new biologic\nrole for C3a and C3a desArg: regulation of TNF-α and IL-1β\nsynthesis,” Journal of Immunology, vol. 156, no. 9, pp. 3455–\n3460, 1996.\n"}