{"doi":"10.1086\/496881","coreId":"194855","oai":"oai:lra.le.ac.uk:2381\/790","identifiers":["oai:lra.le.ac.uk:2381\/790","10.1086\/496881"],"title":"Gamma-ray bursts: restarting the engine","authors":["King, Andrew R.","O'Brien, Paul T.","Goad, Michael R.","Osborne, Julian P.","Olsson, E.","Page, Kim L."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-09-10","abstract":"Recent gamma-ray burst observations have revealed late-time, highly energetic events that deviate from the simplest expectations of the standard fireball picture. Instead, they may indicate that the central engine is active or restarted at late times. We suggest that fragmentation and subsequent accretion during the collapse of a rapidly rotating stellar core offers a natural mechanism for this.Peer-reviewedPublisher Versio","downloadUrl":"http:\/\/iopscience.iop.org\/1538-4357\/630\/2\/L113\/","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/790\/1\/10.1086_496881.pdf","pdfHashValue":"4fef6742fba913c541de917ce6dc94e1eb54a52f","publisher":"IOP Publishing Ltd","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/790<\/identifier><datestamp>\n                2013-10-24T01:01:17Z<\/datestamp><setSpec>\n                com_2381_1<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_10633<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nGamma-ray bursts: restarting the engine<\/dc:title><dc:creator>\nKing, Andrew R.<\/dc:creator><dc:creator>\nO'Brien, Paul T.<\/dc:creator><dc:creator>\nGoad, Michael R.<\/dc:creator><dc:creator>\nOsborne, Julian P.<\/dc:creator><dc:creator>\nOlsson, E.<\/dc:creator><dc:creator>\nPage, Kim L.<\/dc:creator><dc:subject>\naccretion<\/dc:subject><dc:subject>\naccretion disks<\/dc:subject><dc:subject>\nblack hole physics<\/dc:subject><dc:subject>\ngamma rays: bursts<\/dc:subject><dc:description>\nRecent gamma-ray burst observations have revealed late-time, highly energetic events that deviate from the simplest expectations of the standard fireball picture. Instead, they may indicate that the central engine is active or restarted at late times. We suggest that fragmentation and subsequent accretion during the collapse of a rapidly rotating stellar core offers a natural mechanism for this.<\/dc:description><dc:description>\nPeer-reviewed<\/dc:description><dc:description>\nPublisher Version<\/dc:description><dc:date>\n2009-12-08T16:25:14Z<\/dc:date><dc:date>\n2009-12-08T16:25:14Z<\/dc:date><dc:date>\n2005-09-10<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nAstrophysical Journal Letters, 2005, 630 (2), pp.113-115<\/dc:identifier><dc:identifier>\n0004-6388<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/790<\/dc:identifier><dc:identifier>\nhttp:\/\/iopscience.iop.org\/1538-4357\/630\/2\/L113\/<\/dc:identifier><dc:identifier>\n10.1086\/496881<\/dc:identifier><dc:identifier>\n2041-8213<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nRAE 2007<\/dc:relation><dc:relation>\nX-ray and Observational Astronomy<\/dc:relation><dc:rights>\nCopyright © 2005, The American Astronomical Society. Deposited with reference to the publisher’s archiving policy available on the SHERPA\/RoMEO website.<\/dc:rights><dc:publisher>\nIOP Publishing Ltd<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:0004-6388","0004-6388","2041-8213","issn:2041-8213"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["RAE 2007","X-ray and Observational Astronomy"],"year":2005,"topics":["accretion","accretion disks","black hole physics","gamma rays: bursts"],"subject":["Article"],"fullText":"L113\nThe Astrophysical Journal, 630:L113–L115, 2005 September 10 \u0001\n\u0001 2005. The American Astronomical Society. All rights reserved. Printed in U.S.A.\nGAMMA-RAY BURSTS: RESTARTING THE ENGINE\nAndrew King, Paul T. O’Brien, Michael R. Goad, Julian Osborne, Emma Olsson, and Kim Page\nDepartment of Physics and Astronomy, University of Leicester, Leicester LE1 7RH, UK\nReceived 2005 June 14; accepted 2005 August 3; published 2005 August 17\nABSTRACT\nRecent gamma-ray burst observations have revealed late-time, highly energetic events that deviate from the\nsimplest expectations of the standard fireball picture. Instead, they may indicate that the central engine is active\nor restarted at late times. We suggest that fragmentation and subsequent accretion during the collapse of a rapidly\nrotating stellar core offers a natural mechanism for this.\nSubject headings: accretion, accretion disks — black hole physics — gamma rays: bursts\nOnline material: color figure\n1. INTRODUCTION\nIt is now widely believed that gamma-ray bursts (GRBs)\nlasting longer than about 1 s are produced by a class of su-\npernovae called “hypernovae” (Paczyn´ski 1998; MacFadyen &\nWoosley 1999). Collapse of a massive, rapidly rotating stellar\ncore is assumed to lead to the formation of a black hole, while\nthe remaining core material has enough angular momentum to\nform a massive accreting neutron torus around it. The infalling\ntorus radiates its gravitational energy as neutrinos or converts\nit directly to a beam by MHD processes. This evacuates the\nrotation axis of the core, allowing both an observable burst of\ngamma rays and the expulsion of a jet of matter at high Lorentz\nfactors. The interaction of this jet with the surroundings pro-\nduces the X-ray afterglow, which has proved so useful in lo-\ncating and studying GRBs.\nIn all cases observed until now, once the initial gamma-ray\nemission has faded away, the energy output is dominated by\nthe afterglow, which has far lower total energy than the GRB.\nHowever, the recent GRB 050502b is quite different (Burrows\net al. 2005). An X-ray flare occurred starting some 400 s after\nthe beginning of the GRB and released at least as much energy\nas the original burst. There have been several efforts to explain\nGRB 050502b by adding elements to the standard picture of\nlong GRBs, such as late internal shocks or synchrotron self-\nCompton emission (Burrows et al. 2005; Kobayashi et al.\n2005). However, there is considerable difficulty in understand-\ning how GRB 050502b can put so much energy into its sur-\nroundings at such late times, and what physical parameter spec-\nifies this very different behavior.\nHere we consider an idea that offers a way out of these\ndifficulties. In effect, it offers a physical model for the late\ninternal shock suggested by Burrows et al. (2005).\n2. OBSERVATIONS\nGRB 050502b was detected by the Burst Alert Telescope\n(BAT) on the Swift satellite (Gehrels et al. 2004) at 09:25:40\nUT on 2005 May 2 (Falcone et al. 2005). The burst lasted\n17.5 s (T90) with a fluence in the 15–350 keV band of\nergs cm\u00012 (Cummings et al. 2005). The\u00017(8\u0002 1)# 10\ngamma-ray spectrum is well fitted by a single power law with\na photon index . Falcone et al. reported thatGp 1.6\u0002 0.1\ninitially the X-ray count rate seen by Swift was too low to\nobtain an on-board centroid position with the Swift X-Ray\nTelescope (XRT) in the 0.3–10 keV band, but subsequent\nground-processing revealed an initially fading X-ray source.\nThis X-ray source brightened dramatically starting some 400 s\nafter the initial burst, rising to a peak that lasted for several\nhundred seconds before fading away (Burrows et al. 2005).\nBoth GRB 050406 (Cummings et al. 2005) and GRB 050607\n(Krimm et al. 2005) show behavior similar to that of GRB\n050502b, in that they have a rebrightening of their X-ray emis-\nsion a few hundred seconds after the initial burst. In both cases,\nhowever, the X-ray flares are much weaker relative both to\ntheir respective bursts and to the bright flare seen in GRB\n050502b. All three of these bursts are relatively low in GRB\nfluence, particularly GRB 050406, but are not unusually faint.\nHere we report on an analysis of all three GRBs but concentrate\non GRB 050502b. As we do not know the redshifts of these\nbursts, all physical parameters are quoted in the observer’s\nframe of reference.\nThe spectrum of the X-ray flare in GRB 050502b can be\nwell fitted by a power law with , but with aGp 2.2\u0002 0.03\ntime-dependent absorbing column. Similar evidence for spec-\ntral variability is seen during the flares for the other GRBs but\ncannot be well constrained. In GRB 050502b the column is\nhighest at the start of the flare ( cm\u00012 above21N ≈ 1# 10H\nGalactic) and then decreases, strongly suggesting ionization\n(Burrows et al. 2005). This material was not ionized by the\nGRB, so presumably it is off the line of sight illuminated by\nthe initial jet. The absorbing column was derived assuming\nzero redshift, so the intrinsic column will be higher. To derive\nthe X-ray fluence we performed time-dependent spectral fits\nfor GRB 050502b. For the other two bursts, we assumed an\nintrinsic absorbing column of cm\u00012 with21N p 1# 10H\nand 2.3 for GRB 050406 and GRB 050607,Gp 2.4\nrespectively.\nIn Table 1 we quote fluences in the original detector bandpass\nand those derived by extrapolating the power-law spectra over\nthe 0.3–350 keV bandpass (all bandpasses quoted are in the\nobserver’s frame). Extending the energy range to lower ener-\ngies (e.g., 0.1 keV) would further enhance the relative strength\nof the X-ray flare in GRB 050502b (e.g., it would be 30%\nbrighter if a low-energy cutoff of 0.1 keV were adopted).\nOur spectral analysis of the X-ray flare in GRB 050502b\nshows that the total fluence of the flare is comparable to or\nhigher than that of the initial GRB (Table 1). This is also\nillustrated in Figure 1, where we show the flux light curve\nderived for the XRT bandpass (0.3–10 keV). For the other\nGRBs the fluence of the X-ray flare is ≤10% of the initial burst.\nL114 KING ET AL. Vol. 630\nTABLE 1\nGRB Fluences for the Initial GRB and the X-Ray Flare\nGRB\nBurst, 15–350 keV\n(10\u00017 ergs cm\u00012)\nFlare, 0.3–10 keV\n(10\u00017 ergs cm\u00012)\nBurst, 0.3–350 keV\n(10\u00017 ergs cm\u00012)\nFlare, 0.3–350 keV\n(10\u00017 ergs cm\u00012) References\n050502b . . . . . . 8.0 8.8 11 14 1, 2\n050406 . . . . . . . 9.0 0.9 57 1.1 1, 3\n050607 . . . . . . . 8.9 1.1 17 1.5 1, 4\nReferences.—(1) This paper; (2) Cummings et al. 2005; (3) Krimm et al. 2005; (4) Retter et al. 2005.\nFig. 1.—Unabsorbed 0.3–10 keV flux light curve for the early phase of\nGRB 050502b. The horizontal bars represent the time intervals over which\nthe fluxes were calculated. The first point is the initial GRB extrapolated to\nthe 0.3–10 keV band. [See the electronic edition of the Journal for a color\nversion of this figure.]\n3. ENERGETICS\nWe now consider how the central engine in a GRB might\nrestart. Our line of argument is straightforward. The original\nGRB in 050502b signaled the formation of a compact object\n(neutron star or black hole) and the accretion of a stellar mass\nonto it on a very short timescale, presumably from a neutron\ntorus. The simplest explanation for the comparable energy of\nthe X-ray flare is that a second, similar mass accreted after a\ndelay td of up to 400 s (allowing for possible light-travel ef-\nfects). Clearly this large mass cannot have already been in the\nfirst torus or it would have been accreted along with it. Thus\na second stellar-mass torus must form and accrete after td.\nIn two-dimensional models of fallback the extra mass is\nalready in a torus, by construction, and the delay between the\nGRB and X-ray flare in GRB 050502b would have to reflect\nsome viscous angular momentum transport timescale before\nthe torus became dynamically unstable and rapidly accreted.\nIn contrast, if we do not assume high symmetry, an obvious\npossibility is that this mass is a second compact “star” (i.e., a\nself-gravitating neutron lump), formed because the collapsing\ncore had enough angular momentum to fragment. Gravitational\nradiation then drags the lump in toward the first compact object,\nwhere tides smash it up into a torus that can be accreted, re-\nleasing an energy comparable to the original GRB. This ef-\nfectively amounts to restarting, or reactivating, the central en-\ngine at late times.\nRestarting the GRB central engine also accounts for the ex-\ntraordinarily rapid rate of increase and decrease in the X-ray\nflare, which goes as greater than t7 if we use the time (t) of\nthe initial burst as the origin, . Such rates are hard totp 0\naccommodate in the standard fireball model of GRB afterglows\nand instead strongly support a reactivated central engine. The\nBAT on Swift did not detect gamma rays from the X-ray flare\nin GRB 050502b, possibly because the flare spectrum was soft\nand the energy was spread over many seconds.\n4. CORE COLLAPSE AND FRAGMENTATION\nThe two-stage collapse described above is almost exactly\nthat envisaged by Davies et al. (2002) to explain why hyper-\nnovae are rare among supernovae, and any possible delays\nbetween supernovae and GRBs. Davies et al. (2002) argued by\ncomparison with theoretical studies of star formation (see Bon-\nnell & Pringle 1995) that the collapse of a rapidly rotating\nstellar core is likely to lead to fragmentation and the initial\nformation of more than one compact object of nuclear density.\nThey considered a case where the collapses producing these\nobjects make a supernova rather than an initial GRB, i.e., where\nnone of them is surrounded by an accreting torus. Depending\non the way fragmentation occurs, cases where the initial col-\nlapse produces a GRB are clearly possible.\nThe compact objects subsequently coalesce under the effect\nof gravitational radiation. Provided that at least one of them is\na neutron star rather than a black hole, Davies et al. show that\nthere must be a stage where a neutron torus accretes onto a\ncentral object, thus releasing an energy comparable to the initial\nburst. Equation (7) of that paper shows that gravitational ra-\ndiation emission drags an orbiting fragment in, to the point\nwhere it disrupts and forms a neutron torus, on a timescale\n4(a \/1000 km)0\nt p 0.18# hr. (1)GR\nm m (m \u0002 m )1 2 1 2\nHere a0 is the initial circular orbit radius and the central black\nhole and orbiting fragment have masses m1 M, and m2 M,,\nrespectively. This gives a gravitational radiation delay timescale\nhr p 640 s if the merging masses are ∼1 M, andt p 0.18GR\ntheir initial separation is km, which in turn requiresa p 10000\na specific angular momentum cm2 s\u00011, exactly what17jp 10\nhypernova models require. This will be true for any required\ngravitational radiation delay (which is also affected by the red-\nshift) since . One can arrange the gravitational1\/2 1\/8j ∝ a ∝ tGR\nradiation delay to be shorter than the observed delay if the X-\nray event corresponds to a second faster outflow overtaking\nthe initial one, although a substantial overtaking delay is rather\ncontrived.\nThe initial orbit of the fragment may be somewhat misa-\nligned from the spin axis of the central black hole. Tidal dis-\nsipation in the orbiting fragment and viscous dissipation in the\nneutron torus cause rapid alignment through the Lense-Thirring\neffect (see King et al. 2005). The second burst (X-ray flare)\nthus has a jet axis close to the first one. This may explain why\nthe flare is spectrally softer and lasts longer than the original\nGRB. In the internal shock picture, the peak spectral energy\nscales as (e.g., Table 2 of Zhang & Me´sza´ros\u00012 \u00011E ∝ G tp v\nNo. 2, 2005 GAMMA-RAY BURSTS: RESTARTING ENGINE L115\n2002), where G is the bulk Lorentz factor and is the variabilitytv\ntimescale of the outflow. The cleaner environment for the sec-\nond jet may reduce its baryon loading and thus increase G. It\nis also possible that tidal effects make the second accretion\nevent smoother than the first (increasing ), although a fulltv\nhydrodynamic calculation is needed to check this.\n5. SMALLER X-RAY FLARES\nSeveral other GRBs have been observed to have significant\nX-ray flares superposed on their fading afterglows (see Table 1\nand Piro et al. 2005), although none are nearly as bright or\nquite as late as seen in GRB 050502b. GRB 050502b itself\nhas another, smaller X-ray event ≈105 s after the burst (Bur-\nrows et al. 2005) with a fluence similar to that of the event\nin GRB 050607 (some 10% of the initial GRB). These smaller\nflares may be evidence of a similar process involving the\naccretion of smaller neutron clumps by the central object: for\na sufficiently complex fragmentation process there may even\nbe several events. A lower limit to the relative luminosity of\nsuch smaller events to the main GRB arises from the result\n(Davies et al. 2002) that the minimum mass of a neutron-rich\nclump is ∼0.2 M, (smaller masses make nuclei in their cen-\nters). The energies of a merger event to the original GRB\nmust be in the ratio , where M1 and M2 arerp h M \/h M2 2 1 1\nthe masses of the first compact object and the subsequent\nmerging object, and h1 and h2 are the efficiencies of the col-\nlapse and merger events. For comparable efficiencies a merger\nmust have (for M,). Ther \u0001 0.2 M \/M \u0001 0.02 M \u0002 10, 1 1\nobserved X-ray\/GRB ratio depends on the spectral index of\nthe emitted flux.\n6. DISCUSSION\nThe observed fluence of the late X-ray flare in GRB 050502b\nis comparable to that of the main GRB and is spectrally softer.\nSmaller but possibly related flares have also been seen in other\nbursts. Whether the unusually bright X-ray flare event in GRB\n050502b is unique or simply an extreme example of a pattern\nof behavior common to GRBs is unclear. For example, the time\nof the late X-ray flare in GRB 050502b is within the known\nrange of GRB durations (e.g., Paciesas et al. 1999), which\nextends to at least 1000 s. Many bursts, but not all, show\nspectral evolution such that they become softer later (e.g., Nor-\nris et al. 1986). It has also been shown that if a GRB engine\nis quiescent for a long time, the subsequent emission outburst\ncould be unusually large (Ramirez-Ruiz & Merloni 2001).\nThe fragmentation picture that we have suggested here may\nbe able to explain these phenomena. Continuing accretion at\na slower rate from a fragment may be the origin of the long,\nfaint X-ray afterglows seen in many Swift GRBs, which prob-\nably require the central engine to remain on for a long time\n(see Zhang & Me´sza´ros 2001). We will investigate this pos-\nsibility in a future paper.\nWe have suggested that X-ray flares may result from the\nfragmentation of the collapsing stellar core and the subsequent\nmerger of a significant fragment with the most massive compact\nobject formed in the collapse. This is a departure from the\ncurrent hypernova picture, in which only one object is assumed\nto form directly in the collapse. However, the rapid rotation\napparently required to make a hypernova is known to lead to\nfragmentation in other situations such as star formation. A sim-\nple test of our idea will come from combining GRB obser-\nvations with gravitational-wave detections by the Laser Inter-\nferometer Gravitational-Wave Observatory. Long GRBs should\nbe significant sources of gravitational radiation, with a chirp\nsignal characteristic of a merging binary system. If this proves\nsuccessful it would also give a clean determination of the\nmasses involved, providing major insight into the process of\ncore collapse in rapidly rotating stars.\nWe thank Evert Rol for useful discussions and the referee\nfor a very helpful report. A. K. acknowledges a Royal Society–\nWolfson Research Merit Award. Emma Olsson is supported by\na European Union Research and Training Network grant. The\nSwift project and theoretical astrophysics research at the Uni-\nversity of Leicester are supported by PPARC.\nREFERENCES\nBonnell, I. A., & Pringle, J. E. 1995, MNRAS, 273, L12\nBurrows, D. N., et al. 2005, Science, submitted\nCummings, J. R., et al. 2005, GCN Circ. 3339, http:\/\/gcn.gsfc.nasa.gov\/gcn\/\ngcn3\/3339.gcn3\nDavies, M. B., King, A. R., Rosswog, S., & Wynn, G. A. 2002, ApJ, 579,\nL63\nFalcone, A., et al. 2005, GCN Circ. 3330, http:\/\/gcn.gsfc.nasa.gov\/gcn\/gcn3\/\n3330.gcn3\nGehrels, N., et al. 2004, ApJ, 611, 1005\nKing, A. R., Lubow, S. L., Ogilvie, G. G., & Pringle, J. E. 2005, MNRAS,\nin press (astro-ph\/0507098)\nKobayashi, S., Zhang, B., Me´sza´ros, P., & Burrows, D. N. 2005, ApJ, submitted\nKrimm, H., et al. 2005, GCN Circ. 3183, http:\/\/gcn.gsfc.nasa.gov\/gcn\/gcn3\/\n3183.gcn3\nMacFadyen, A. L., & Woosley, S. E. 1999, ApJ, 524, 262\nNorris, J. P., et al. 1986, ApJ, 301, 213\nPaciesas, W. S., et al. 1999, ApJS, 122, 465\nPaczyn´ski, B. 1998, ApJ, 494, L45\nPiro, L., et al. 2005, ApJ, 623, 314\nRamirez-Ruiz, E., & Merloni, A. 2001, MNRAS, 320, L25\nRetter, A., et al. 2005, GCN Circ. 3525, http:\/\/gcn.gsfc.nasa.gov\/gcn\/gcn3\/\n3525.gcn3\nZhang, B., & Me´sza´ros, P. 2001, ApJ, 552, L35\n———. 2002, ApJ, 581, 1236\n"}