{"doi":"10.1007\/s10498-008-9040-5","coreId":"62929","oai":"oai:nora.nerc.ac.uk:3211","identifiers":["oai:nora.nerc.ac.uk:3211","10.1007\/s10498-008-9040-5"],"title":"The chemical speciation of Fe(III) in freshwaters","authors":["Lofts, Stephen","Tipping, Edward","Hamilton-Taylor, John"],"enrichments":{"references":[],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2008-08-27","abstract":"Dialysis and chemical speciation modelling have been used to calculate activities of Fe3+ for a range of UK surface waters of varying chemistry (pH 4.3–8.0; dissolved organic carbon 1.7–40.3 mg l-1) at 283K. The resulting activities were regressed against pH to give the empirical model:\\ud\nlog aFe3+ = 2.76(±0.53) – 2.63(±0.08)•pH\\ud\nPredicted Fe3+ activities are consistent with a solid–solution equilibrium with hydrous ferric oxide. However, the apparent solubility of the solid phase decreases as pH decreases, consistent with some previous studies on Fe(III) solubility in the laboratory. The empirical model was used to predict concentrations of Fe in dialysates and ultrafiltrates of globally distributed surface and soil\/ground waters.  The predictions were improved greatly by the incorporation of a temperature correction for aFe3+, consistent with the temperature–dependence of previously reported hydrous ferric oxide solubility. The empirical model, incorporating temperature effects, may be used to make generic predictions of the ratio of free and complexed Fe(III) to dissolved organic matter in freshwaters.  Comparison of such ratios with observed Fe : dissolved organic matter ratios allows an assessment to be made of the amounts of Fe present as Fe(II) or colloidal Fe(III), where no separate measurements have been made.\\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/62929.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/3211\/3\/LoftsAquaGeoPP.pdf","pdfHashValue":"b15cb1f63850de3405d6568d1cd0de468621301d","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:3211<\/identifier><datestamp>\n      2017-01-25T11:54:56Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533131<\/setSpec><setSpec>\n      7375626A656374733D5337<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/3211\/<\/dc:relation><dc:title>\n        The chemical speciation of Fe(III) in freshwaters<\/dc:title><dc:creator>\n        Lofts, Stephen<\/dc:creator><dc:creator>\n        Tipping, Edward<\/dc:creator><dc:creator>\n        Hamilton-Taylor, John<\/dc:creator><dc:subject>\n        Ecology and Environment<\/dc:subject><dc:subject>\n        Chemistry<\/dc:subject><dc:description>\n        Dialysis and chemical speciation modelling have been used to calculate activities of Fe3+ for a range of UK surface waters of varying chemistry (pH 4.3–8.0; dissolved organic carbon 1.7–40.3 mg l-1) at 283K. The resulting activities were regressed against pH to give the empirical model:\\ud\nlog aFe3+ = 2.76(±0.53) – 2.63(±0.08)•pH\\ud\nPredicted Fe3+ activities are consistent with a solid–solution equilibrium with hydrous ferric oxide. However, the apparent solubility of the solid phase decreases as pH decreases, consistent with some previous studies on Fe(III) solubility in the laboratory. The empirical model was used to predict concentrations of Fe in dialysates and ultrafiltrates of globally distributed surface and soil\/ground waters.  The predictions were improved greatly by the incorporation of a temperature correction for aFe3+, consistent with the temperature–dependence of previously reported hydrous ferric oxide solubility. The empirical model, incorporating temperature effects, may be used to make generic predictions of the ratio of free and complexed Fe(III) to dissolved organic matter in freshwaters.  Comparison of such ratios with observed Fe : dissolved organic matter ratios allows an assessment to be made of the amounts of Fe present as Fe(II) or colloidal Fe(III), where no separate measurements have been made.\\ud\n<\/dc:description><dc:publisher>\n        Springer<\/dc:publisher><dc:date>\n        2008-08-27<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/3211\/1\/N003211PP.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Lofts, Stephen; Tipping, Edward; Hamilton-Taylor, John.  2008  The chemical speciation of Fe(III) in freshwaters.   Aquatic Geochemistry, 14 (4). 337-358.  https:\/\/doi.org\/10.1007\/s10498-008-9040-5 <https:\/\/doi.org\/10.1007\/s10498-008-9040-5>     \n <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1007\/s10498-008-9040-5<\/dc:relation><dc:relation>\n        doi:10.1007\/s10498-008-9040-5<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/3211\/","http:\/\/dx.doi.org\/10.1007\/s10498-008-9040-5","doi:10.1007\/s10498-008-9040-5"],"year":2008,"topics":["Ecology and Environment","Chemistry"],"subject":["Publication - Article","PeerReviewed"],"fullText":" \n \n \nArticle (refereed) \n \n \n \nLofts, Stephen; Tipping, Edward; Hamilton-Taylor, John. \n2008 The chemical speciation of Fe(III) in freshwaters. \nAquatic Geochemistry, 14 (4). 337-358. \ndoi:10.1007\/s10498-008-9040-5 \n \n \n \nCopyright:  © Springer \n \nThis version available at http:\/\/nora.nerc.ac.uk\/3211\/  \n \n \nNERC has developed NORA to enable users to access research outputs \nwholly or partially funded by NERC. Copyright and other rights for material \non this site are retained by the authors and\/or other rights owners. Users \nshould read the terms and conditions of use of this material at \nhttp:\/\/nora.nerc.ac.uk\/policies.html#access  \n \n \nThis document is the author’s final manuscript version of the \njournal article, incorporating any revisions agreed during the peer \nreview process. Some differences between this and the publisher’s \nversion remain. You are advised to consult the publisher’s version \nif you wish to cite from this article. \n \nwww.springerlink.com \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nContact CEH NORA team at  \nnora@ceh.ac.uk \n                             Editorial Manager(tm) for Aquatic Geochemistry\n                                  Manuscript Draft\nManuscript Number: AQUA116R1\nTitle: The chemical speciation of Fe(III) in freshwaters\nArticle Type: Original Article\nKeywords: Iron; speciation; solubility; freshwater; dialysis; ultrafiltration\nCorresponding Author: Dr. Stephen Lofts, Ph.D.\nCorresponding Author's Institution: NERC Centre for Ecology and Hydrology\nFirst Author: Stephen Lofts, BSc MSc PhD\nOrder of Authors: Stephen Lofts, BSc MSc PhD; Edward Tipping, BSc MSc PhD DSc; John \nHamilton-Taylor, BSc PhD\nAbstract: Dialysis and chemical speciation modelling have been used to calculate activities of Fe3+ \nfor a range of UK surface waters of varying chemistry (pH 4.3-8.0; dissolved organic carbon 1.7-\n40.3 mg l-1) at 283K. The resulting activities were regressed against pH to give the empirical model:\nlog aFe3+ = 2.93(±0.40) - 2.70(±0.06)*pH\nPredicted Fe3+ activities are consistent with a solid-solution equilibrium with hydrous ferric oxide, \nconsistent with some previous studies on Fe(III) solubility in the laboratory. However, as has also \nsometimes been observed in the laboratory, the slope of the solubility equation is lower than the \ntheoretical value of three. The empirical model was used to predict concentrations of Fe in \ndialysates and ultrafiltrates of globally distributed surface and soil\/ground waters.  The predictions \nwere improved greatly by the incorporation of a temperature correction for aFe3+, consistent with \nthe temperature-dependence of previously reported hydrous ferric oxide solubility. The empirical \nmodel, incorporating temperature effects, may be used to make generic predictions of the ratio of \nfree and complexed Fe(III) to dissolved organic matter in freshwaters.  Comparison of such ratios \nwith observed Fe : dissolved organic matter ratios allows an assessment to be made of the \namounts of Fe present as Fe(II) or colloidal Fe(III), where no separate measurements have been \nmade.\nResponse to Reviewers: Reviewer #1: Review of AQUA116, \"The chemical speciation of Fe(III) in \nfreshwaters\", by Stephen Lofts, Edward Tipping and John Hamilton-Taylor.\nGeneral response to reviewer #1:\nWe are very gratified to read this reviewers' very positive comments. We are happy to amend the \npaper as suggested and agree that further comparison of our results with previous laboratory work \nis appropriate. Responses to specific comments are listed below beneath each comment in turn.\nThe authors of this manuscript have used observations of truly dissolved Fe concentrations in \nfreshwaters (obtained via dialysis procedures in UK surface waters) in conjunction with chemical \nspeciation modeling to determine the activity of Fe(III) as a function of pH over a range of dissolved \norganic carbon concentrations and pH. The results were summarized with a simple empirical model. \nThe empirical model was then used to predict Fe concentrations in dialysates and ultrafiltrates \nreported for globally distributed surface and soil\/ground waters. The authors' model is consistent \nwith previous observations of Fe(III) solubility obtained in the laboratory, and the observed \ncorrespondence between observed and predicted Fe(III), using a global dataset, is consistent with \nlaboratory observations of the influence of temperature on the solubility of hydrous ferric oxide. A \nkey element of the authors' work is their focus on description of truly-dissolved Fe concentrations \nas opposed to operationally defined concentrations. \nThis manuscript is uncommonly well written, and is one of the more interesting manuscripts I have \nencountered in a number of years. I think that this work is destined to be much-cited. It will likely \nserve as a keystone for further quantitative advances toward an understanding of iron \nbiogeochemistry. In their conclusions section the authors indicate that dissolved Fe(II) comprises a \nsubstantial fraction of the truly-dissolved Fe pool. Their associated conclusion - that Fe(II) \nmeasurements in the environment should be given a higher priority - is compelling and important.\nWhile I am happy to recommend publication of this manuscript, I think that it would be significantly \nimproved through additional comparisons with prior work. The authors compare the slope of \nequation (2) with the slopes obtained by Byrne and Luo (2000) and Byrne et al. (2005), but have \nnot compared their solubility product (intercept) with the results obtained in either of those works. I \nrecommend that the authors make such comparisons by (a) estimating the activity coefficients of \nferric ions and hydrogen ions in the previous analyses that were conducted at 0.7 molal ionic \nstrength and (b) considering the effects of ageing on hydrous ferric oxide documented by Liu and \nMillero (1999). Ageing effects will reduce the solubility products that were determined by Byrne and \nLuo (2000) and Byrne et al. (2005) on relatively short time scales. \nResponse: We have inserted additional text and a new figure discussing the issue. This is an \ninteresting issue that we feel is worth including in the paper, particularly as we had already partly \ndiscussed some of the studies concerned.\nInfelicities and errata\nComparison of the authors' abstract and the discussion of ferric ion activities on page 15 suggests \nthat the final draft of the authors' manuscript inadvertently contains some elements of earlier \nversions. The equation highlighted in the abstract should presumably agree with equation 2.\nResponse: This has been corrected.\nOn page 5, fourth line of section 2, for many readers it might be useful to have \"rankers\" defined.\nResponse: A definition has been inserted.\nOn page 7 the first sentence (beginning \"Total Fe and Fe(II).\") is awkward. \nResponse: The sentence has been simplified.\nOn page 10, section 4.4.1, I suggest reordering the structure of a sentence as follows - \"Stream \nwater temperatures were estimated from the available data by.\". \nResponse: Amended.\nOn page 19, six lines from bottom of page, \"103 - 104\" should be given as \"10-3 - 10-4\".\nResponse: Amended.\nFor the final sentence before the Conclusions section I suggest the following - \".would presumably \noccur through precipitation of HFO.\"\nResponse: Amended.\nThe conclusions section is very well written. However, in the final sentence the meaning of \".so \nriverine endmember compositions must reflect 'real' conditions and not simply waters having high \nFe concentrations.\" is somewhat enigmatic. \nResponse: On reflection we have elected to remove the final two sentences of the Conclusions \nsince they detract somewhat from the previous sentence, which itself forms a suitable final point.\nIn Table 1 the stoichiometry of the next-to-last reaction (formation of FeF2+) is incorrect.\nResponse: Amended.\nReviewer #2\nGeneral response to reviewer #2:\nThis reviewer feels that there are some difficulties with our experimental methods and results. Their \nmain concerns appear to be the prediction of truly dissolved Fe in the field data, where they \nconsider that \"the model predicted result do not appear to match literature measurement values \nvery well\". We would take issue with this on two counts: firstly, it is difficult to respond constructively \nto such a vaguely worded statement in a truly meaningful way, and secondly, we would (and \nindeed already have) argued that considering the inherent uncertainties in model and \nmeasurements, the results are in fact reasonably good. The reviewer considers that the 'poor' \npredictions may result from the fact that our modelling approach does not considering specific \nbinding ligands for Fe. We have considered this point in the paper, but not explicitly. In the light of \nthese comments, we have inserted additional text to contrast our and other modelling approaches.\nThe reviewer also considers that there may be difficulties in measuring the truly dissolved Fe in our \nsamples due to our analysis methods. We did in fact take a number of steps to ensure the high \nquality of our results (detailed in the response to point 2a) below). We would also point out that in \nfreshwater systems the use of clean techniques for Fe analysis is not necessarily appropriate as \nthe metal is usually present at above trace amounts (cf. the oceans where Fe is present in trace \namounts).\nWe have responded to the specific points made by this reviewer below. In each case, we have \nrefuted the criticism, and overall we do not consider it warranted to amend the manuscript on the \nbasis of this review.\nSpecific points\nThis manuscript presents an empirical relationship between Fe3+ activity and the solution pH and \ntemperature based on fitting the \"WHAM\/Model VI model\" to the dialysis experiments results for \nfield samples. The experiments appear to have some problems and the model predicted result  do \nnot appear to match literature measurement values very well.  These may result mainly from the \nlack of accurate knowledge of Fe-binding constants of dissolved organic matter (and its variation \ndue to the influence by ionic strength, pH and temperature) and the difficulties in accurate \ndetermining Fe, especially truly dissolved Fe in the sample.  My detailed questions are listed below:\n1. Using DOC concentration in the model would not be appropriate if the relationship between \nDOC concentration and the concentration of organic ligands that bind Fe in the water is not known.  \nResponse: We think that the reviewer is comparing our modelling approach with that used to \nquantify metal-organic binding in seawater. A central hypothesis of our approach is that we \nconsider the portion of DOC that binds metals to be the humic substances (humic acid and fulvic \nacid) present in the water. Since humics typically comprise the majority of freshwater DOC in fluvial \nsystems, we then assume that for modelling purposes their concentration can be estimated from a \nbulk measurement of DOC. In this approach there is no need to quantify concentrations of specific \norganic ligands binding the metal.\nThis approach and its uncertainties are discussed in Section 4.3. In response to the reviewers \ncomment we have inserted additional text explaining the approach in the Introduction and \nDiscussion sections.\n2. The dialysis results may be questionable because of the lack of considering several factors \nthat may influence the concentration of Fe and DOC in the dialysis bag after prolonged incubation:  \na) Trace metal clean techniques are not used in Fe analysis and there is a need to consider \ninfluence by Fe contamination; \nResponse: In addition to the measures outlined in the manuscript (i.e. acid washing of sampling \nvessels), preparation, insertion and removal of dialysis bags was done under clean conditions and \nthe colorimetric analysis of Fe was rigorously quality-controlled using standards kept in clean \nconditions.\nb) Fe3+ and its hydrolysis species may absorb onto the wall of dialysis bag; \nc) Fe2+ may diffuse through the dialysis bag and then converted to Fe3+ during the course of the \nexperiments. \ne) During 7 days incubation, Fe3+ and DOC may absorb on the wall of the container and the\ndialysis bag;\nResponse: These all may indeed occur during the incubation experiments. However, in the \npresence of hydrous ferric oxide, the Fe3+ activity is controlled and thus buffered. Therefore, these \nphenomena should not affect the Fe3+ activity.\nd) The portion of DOC that did not diffuse through the dialysis bag may also bind Fe3+ and thus \nlowering Fe3+ activity;\nResponse: The non-dialysable DOC unquestionably will bind Fe3+. However, whether a portion of \nthe DOC is dialyzable or not will not affect the Fe3+ activity since at equilibrium this will be the \nsame throughout the system (i.e. inside and outside the bag) as the Fe3+ ion and other small ionic \nspecies of Fe can equilibrate across the dialysis membrane.\nf) Since pH changed during dialysis incubation, it is not clear if the resulting speciation modeling \nwould be valid for natural sample pH.\nResponse: The objective of our incubation experiments was to generate data on the speciation of \nFe under conditions as close to natural as possible (particularly with respect to the presence of \nnatural dissolved organic carbon). This is in practice not possible for reasons including pH shifts as \nwe have pointed out in the paper. Our experimental design took account of possible changes in \nchemistry by explicit analysis of the samples after incubation. These data were then used for \nspeciation modelling to generate an FeIII solubility expression which was used to predict speciation \nin other natural waters. Using the chemical composition at the end of incubation in model \ncalibration accounts for any changes that occur during incubation. It was not a part of the work to \napply the speciation modelling results obtained from our incubated samples directly back to the \nnatural conditions in those samples.\ng) Bacteria may influence DOC content and composition in 7 day period.\nResponse: This is a plausible hypothesis – but it should be borne in mind that bacteria exert such \nan influence on DOC under natural conditions anyway. It would have been useful if the reviewer \nhad provided examples in the literature of such an occurrence - we know of no evidence that \nfreshwater DOC composition is significantly altered by bacterial action under similar experimental \nconditions to ours.\n3. What is the explanation for the statement that \"There was a tendency for Fe concentrations \nto be higher at lower pH, although this trend was not especially pronounced. There was also a \ntendency for higher filtered Fe to be associated with higher DOC, although this was not general\"?\nResponse: This is simply a descriptive statement of trends in Fe concentrations observed in our \ndata, which we provide as (hopefully) useful background information for the reader. To attempt to \nexplain such trends, if possible, would likely require a separate manuscript.\n4. \"It is important to realize, however, that ultimately the proportion of the filterable DOM that \nis dialyzable is not important for this work\", why? \nResponse: At equilibrium in the incubated system, the activity of Fe3+ will be the same inside and \noutside the bag, because it can easily pass through the dialysis membrane. Since the activity of \nFe3+ is controlled by a solid oxide phase its activity is independent of the concentration of DOM, or \nby the distribution of DOM inside and outside the dialysis bag.\n5. The model results do not seem to fit the field data in Figure 3 well and the data points have \na large deviation from the 1:1 line.\nResponse: We feel that this is a somewhat inaccurate comment – particularly so since the model \ndescribes some of the field data very well. As we point out in the text, after adjustment for \ntemperature most of the predictions fall within a factor of three of the observations, which we would \nconsider very reasonable, given the levels of uncertainty inherent in making predictions of the \nchemical speciation of field waters. We have attempted to account for at least some of the \nuncertainty in the model predictions, but we should point out that there will also be measurement \nuncertainty in the observations. This is a particularly pertinent point as all the data have been \ngathered using relatively complex methods (e.g. ultrafiltration or dialysis). We would also point out \nthat the observations cover at least two orders of magnitude in truly dissolved Fe and that the \nmodel is reasonably successful in reproducing this variability.\n6. Should Fe solubility increase instead of \"decrease as pH decreases\" as stated in the \nabstract? \nResponse: It is the apparent solubility product of the hydrous ferric oxide that decreases as pH \ndecreases. We have reworded this part of the abstract to discuss the slope of the solubility \nequation, since it is this equation on which we focus in the main text.\n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n1\nThe chemical speciation of Fe(III) in \nfreshwaters\nStephen Lofts\n†\n, Edward Tipping\n†\n, John Hamilton–Taylor\n‡\n†Centre for Ecology and Hydrology, Lancaster Environment Centre, \nLancaster, LA1 4AP, United Kingdom\n‡Department of Environmental Science, Lancaster University, Lancaster \nLA1 4YQ, United Kingdom\nCorresponding author: Stephen Lofts\nPhone: +44-1524-595878\nFax: +44-1524-61536\nEmail: stlo@ceh.ac.uk\nManuscript\nClick here to download Manuscript: Loftsetal_Fe_speciation_REVISION_notrackchanges.docClick here to view linked References\n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n2\nAbstract\nDialysis and chemical speciation modelling have been used to calculate activities of Fe3+\nfor a range of UK surface waters of varying chemistry (pH 4.3–8.0; dissolved organic \ncarbon 1.7–40.3 mg l-1) at 283K. The resulting activities were regressed against pH to \ngive the empirical model:\nlog aFe3+ = 2.93(±0.40) – 2.70(±0.06)·pH\nPredicted Fe3+ activities are consistent with a solid–solution equilibrium with hydrous \nferric oxide, consistent with some previous studies on Fe(III) solubility in the laboratory. \nHowever, as has also sometimes been observed in the laboratory, the slope of the \nsolubility equation is lower than the theoretical value of three. The empirical model was \nused to predict concentrations of Fe in dialysates and ultrafiltrates of globally distributed \nsurface and soil\/ground waters.  The predictions were improved greatly by the \nincorporation of a temperature correction for aFe3+, consistent with the temperature–\ndependence of previously reported hydrous ferric oxide solubility. The empirical model, \nincorporating temperature effects, may be used to make generic predictions of the ratio of \nfree and complexed Fe(III) to dissolved organic matter in freshwaters.  Comparison of \nsuch ratios with observed Fe : dissolved organic matter ratios allows an assessment to \nbe made of the amounts of Fe present as Fe(II) or colloidal Fe(III), where no separate \nmeasurements have been made.\nIron; speciation; solubility; freshwater; dialysis; ultrafiltration\n1 Introduction\nIron is one of the most abundant elements on Earth, and is considered \nessential for living organisms.  It is highly reactive in the freshwater \nenvironment, has an oxidation–reduction chemistry that is an important \naspect of its aquatic cycling behaviour, and has been shown to have a \nnumber of significant roles in the cycling and bioavailability of other \nelements.  In oxic freshwaters the +3 oxidation state is the \nthermodynamically stable form (Davison, 1993).  Iron(III) influences the \nspeciation and bioavailability of phosphorus in lakes (Jones et al., 1993), \npromotes the decomposition of dissolved organic carbon in surface waters \nby photochemical means (Stumm and Morgan, 1996), and forms \nparticulate oxides and hydroxides (hereafter collectively referred to as\nhydrous ferric oxide, HFO) capable of sorbing and transporting trace \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n3\nmetals and anionic species (Dzombak and Morel, 1990) and dissolved\norganic matter (DOM) (Tipping, 1981).  More recently, the importance of \niron in limiting phytoplankton growth in the oceans has increased interest \nin riverine fluxes to the oceans (Turner et al., 2001). Additionally, iron \ninfluences the aquatic speciation and bioavailability of trace metals by \ncompeting for common ligands such as natural organic matter (Tipping et \nal., 2002). Clearly, knowledge of the speciation of Fe(III) is key in \ndeveloping a quantitative understanding of these processes.\nOur knowledge of inorganic Fe(III) chemistry indicates that in the range of \npH (6–9) of the majority of surface waters, the concentration of free and \ncomplexed dissolved Fe(III) concentration should be very low due to \nextensive hydrolysis and precipitation to form HFO.  In practice, measured \nconcentrations of dissolved (i.e. filtered) Fe in such waters tend to be \nlarger, sometimes by several orders of magnitude, than concentrations \npredicted by assuming equilibrium of Fe(III) with an HFO phase.  The \npresence of this additional dissolved Fe has been variously attributed to \ndissolved organic complexes of Fe(III) (e.g. Perdue et al., 1976; Koenings, \n1976) or to the presence of small particles of HFO, perhaps stabilised by \nsurface coatings of natural organic matter (e.g. Shapiro, 1966; Cameron & \nLiss, 1984; Laxen and Chandler, 1983), but evidence for the relative \nimportance of these forms is somewhat lacking.  Recent work on the \nspeciation of iron in natural waters (e.g. Rose et al., 1998; Olivié–Lauquet \net al., 1999; Benedetti et al., 2003; Allard et al., 2004) suggests that iron in \ncolloidal phases (variously defined with a lower nominal cutoff in the range \n5–30 kDa) can exist both as organic complexes and small hydroxide \nparticles.  Lyvén et al. (2003) used flow field–flow fractionation to \ndemonstrate the presence of two distinct iron forms in a surface water – a \nsmall fraction (largely below a nominal molecular weight of 30kDa) \nassociated with organic C, and a larger fraction rich in Fe itself.  These \nresults are strongly suggestive of the presence of Fe(III) as a mixture of \norganic complexes and an HFO phase, and also indicate that a reliable \nsize separation method can differentiate the two forms.  Sophisticated \nmethods such as flow field–flow fractionation can provide invaluable fine \nscale information on physical speciation, but are complex and not \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n4\namenable to high sample throughput.  A simpler separation technique, \namenable to use on large numbers of samples, is needed to investigate \nspatial and temporal trends in Fe(III) speciation in surface waters.  \nUltrafiltration is reasonably well–established yet issues remain regarding \nartefacts, such as the blockage of filter pores by suspended material, and \nthe formation of ‘gel’ layers at the filter surface.  Dialysis, on the other \nhand, is relatively simple and non–invasive, and has previously been used \nto isolate small size fractions of metals (e.g. Beneš and Steinnes, 1974; \nJansen et al., 2001).\nThe ability to quantitatively separate the Fe in the size range below that in \nwhich HFO is encountered would be highly useful in the study of whether \nand how HFO controls the combined concentrations of free and \ncomplexed Fe(III) (hereafter referred to as truly dissolved Fe(III)). \nLaboratory studies on synthetic forms of HFO indicate that for the solubility \nequilibrium\nFe(OH)3 (s) + 3H\n+ ↔ Fe3+ + 3H2O (1)\nvalues for the standard solubility product KSO are in the range 10\n2.5–105.0.\nAllard et al. (2004) showed that the concentrations of colloidal organically–\ncomplexed Fe(III) in waters from the Amazon region were consistent with \nan equilibrium between the Fe3+ ion and an HFO with a single solubility \nproduct within this range. However there has been no extension of this \nwork to other environments, particularly to temperate regions and to \nsoil\/ground waters. Chemical speciation of a small size fraction from which \nHFO has been removed would allow the Fe3+ activity to be estimated and \nthus allow controls on Fe(III) solubility to be assessed. This would in \nprinciple enable a general model of Fe(III) chemistry in freshwaters to be \nconstructed. \nThe modelling of the binding of a metal such as Fe(III) to aquatic dissolved \norganic matter (DOM) is complex, and a clear conceptual picture of the \nbinding properties of the DOM is required. Some workers consider the \nbinding to be to specific organic ligands, while others consider the binding \nto be controlled by binding sites on the bulk of the organic matter, in \ncompetition with protons and other trace metals. In the second hypothesis \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n5\nthe degree of binding may in principle be related to the total concentration \nof DOM whereas in the first hypothesis the concentrations of specific \nligands are not necessarily related to the total DOM concentration. In \nprevious work, Tipping et al. (2002) characterised the binding of Fe(III) to \nisolated humic and fulvic acids using the WHAM\/Model VI model and used \nthe paameterised model to simulate Fe(III) speciation in a limited number \nof field samples, under the assumption that Fe(III) binding to DOC could \nbe related to its binding to fulvic acid.The model was able to describe \nspeciation in the data, if some reasonable variability in model parameters \namong samples was allowed. There is, however, a pressing need to \nfurther assess model performance against field data.\nIn the work reported here, we have sampled and dialysed natural waters, \ngiving a dialysate excluding fine particulates in which the Fe(III) should be \npresent only in truly dissolved form.  We have used WHAM\/Model VI to \ncalculate Fe3+ activities in these samples, and used the results to produce \nan empirical expression for the variation in Fe3+ activity with pH and \ntemperature. We have compared this expression with predictions of Fe3+\nactivity derived from laboratory studies of Fe(III) solubility, and we have \nshown how our results may be incorporated into speciation models either \nempirically or by assuming equilibrium with an HFO–type phase. We then \nmake predictions of truly dissolved Fe(III) in dialysates and ultrafiltrates of \nsurface and soil\/ground waters, reported in the literature. We have also \ninvestigated the use of the Fe:DOM ratio in the truly dissolved fraction as a\nmeans of assessing Fe speciation, and illustrated this using an extensive \ndataset on UK surface waters.\n2 Study sites\nSurface water samples were obtained from 10 sites in the northwest of \nEngland.  Of the sites, seven are situated in the upland areas of the \nPennines and the Forest of Bowland.  These areas are dominated by \nblanket peats and rankers (relatively shallow organic-rich soils usally \ndeveloped directly over the underlying rock). Landscape types include acid \ngrassland, blanket bog and upland heathland. The underlying geology \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n6\ncomprises both acidic and alkaline rock types.  The remaining sites are \nsituated in the lowlands. Two of these (the River Lune and the River \nRibble) drain upland areas and were sampled close to their tidal limits.  \nThe third lowland site, Roudsea Wood, drains a complex of raised lowland \npeat bogs.  Two samples were obtained from seven of the sites.  Of these, \nfour (the Rivers Hodder, Lune and Ribble, and the Whitray Beck tributary) \nwere sampled under high flow conditions in November 2003 and low flow \nconditions in January 2004.\n3 Experimental\nDeionised water (conforming to the ASTM Type 1 standard) was used for \nall dilutions and washings. Sample vessels of 5L or 10L volume were \nused.  All sampling vessels were soaked in 1% v\/v nitric acid (BDH \n‘Aristar’ grade) for 24 hours, followed by deionised water for 24 hours.  On \nreturn to the laboratory, bags of dialysis membrane (SpectraPor 7 \nregenerated cellulose, Spectrum Laboratories Inc., 3.5kDa, 10kDa and \n15kDa molecular weight cutoff) containing deionised water were \nsuspended directly into the solution.  All dialysis membranes were \nthoroughly rinsed with deionised water prior to use.   The solution volume \nwithin each set of dialysis bags was 2% of the sample volume.  Samples \ncontaining dialysis bags were stirred at 10oC in the dark for seven days.  \nThe dialysis bags were removed, rinsed thoroughly with deionised water \nand the dialysate solutions removed.  A portion was acidified with 5M \nhydrochloric acid (BDH ‘Spectrosol’ grade; 200ml per 10ml sample) for \ncolorimetric analysis of total Fe and Fe(II).  The remaining dialysate was \nstored unaltered for analysis of dissolved organic carbon (DOC) and \nmonomeric aluminium.  A portion of the outer sample solution was \nretained for analysis of pH and conductivity.  All solutions were stored in \nthe dark at 4oC until analysis.\nField samples for the analysis of water chemistry were obtained at the \nsame time as experimental samples.  Samples for the measurement of pH \nwere collected in thoroughly rinsed airtight glass vessels and analysed \nwithin 24 hours.  Samples for the analysis of major ions, alkalinity, DOC, \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n7\nmonomeric aluminium and acid–reactive aluminium were taken in single–\nuse polyethylene terephthalate (PETE) bottles.  Unfiltered samples were \nanalysed for alkalinity, monomeric aluminium and acid–reactive \naluminium.  On return to the laboratory a portion of sample was filtered \n(GF\/F filters, Whatman Inc.) for the analysis of major ions, monomeric \naluminium and acid–reactive aluminium.  Samples for the analysis of total \nFe and Fe(II) were taken in PETE bottles previously soaked in 1% (v\/v) \nnitric acid (BDH ‘AnalaR’ grade) and rinsed thoroughly with deionised \nwater.  The samples were filtered (0.45µm cut–off filters, Whatman Inc.) \nimmediately on return to the laboratory and acidified with 5M hydrochloric \nacid (BDH ‘Spectrosol’ grade; 200ml per 10ml sample) prior to storage for \nanalysis of total Fe and Fe(II). All samples were stored in the dark at 4oC \nprior to analysis.  \nTotal Fe and Fe(II) were analysed colorimetrically using Ferrozine®\n(Sigma-Aldrich Chemie GmbH) Gibbs (1979) in an acetic acid\/sodium \nacetate buffer at a wavelength of 562nm. Calibration was done using \nsolutions prepared from stock iron(III) nitrate standards (BDH ‘Aristar’ \ngrade).  For the analysis of total iron, a reducing agent \n(hydroxylammonium chloride) was added to standards and samples to \nreduce Fe(III) to Fe(II), and a contact time of 10 minutes was allowed prior \nto analysis.  For the analysis of Fe(II), reducing agent was not added and \na contact time of 30s was allowed.  Prior to analysis, the recovery of Fe(II) \nfrom mixed Fe(II)\/Fe(III) solutions (1:1 w\/w) was analysed; the mean \nrecovery of 50µg dm-3 (895nM) and 250µg dm-3 (4476nM) Fe(II) from \nmixed solutions was 105.0%. Quality standards were prepared from an \nindependent iron(III) nitrate stock solution (BDH ‘Aristar’ grade).  The \ndetection limit of the method (calculated as twice the standard deviation of \ncontrol samples), for both Fe(II) and total Fe, was 2µg dm-3 (36nM) for a \ncell path length of 4cm (Hitachi U-2000 spectrophotometer).  All \ndeterminations were performed within three days of sampling.\nMonomeric and acid–reactive Al were determined by the method of Seip \net al. (1984). Measurements of pH were made following the procedures \nrecommended by Davison (1990) using a GK2401C combination electrode \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n8\n(Radiometer Inc.).  Major cations (sodium, magnesium, potassium and \ncalcium) were measured by ICP–OES (Perkin Elmer Optima 4300 DV) on \nfiltered samples after acidification.  Major anions (chloride, nitrate, \nsulphate) were measured by ion chromatography (DX 100, Dionex Corp.).  \nAlkalinity was measured by Gran titration, using a 702 SM Titrino \n(Metrohm AG).  Dissolved organic carbon was measured by flame \ncombustion (TOC-V CPH\/CPN analyser, Shimadzu Corp.).\n4 Speciation modelling\n4.1 Nomenclature\nIn presenting and discussing the modelling, we will use the term ‘truly \ndissolved’ Fe(III) to refer to the modelled sum of the free ion, inorganic and \norganic complexes, and ‘colloidal’ to refer to filterable Fe(III) that is \npredicted to be precipitated as HFO or to be complexed to organic matter \nthat is not ultrafiltered or dialysed. Where reference is made to modelling \nin equilibrium with the atmosphere, this refers to the use of a carbon \ndioxide partial pressure of 3.65 × 10-4 atm for the purpose of simulating the \ncarbonate system.\n4.2 WHAM\/Model VI\nSpeciation modelling was done using WHAM\/Model VI (Tipping, 1994; \nTipping, 1998; Tipping et al., 2003).  For the purposes of this work the \nmodel can be considered as combining a standard model of \nthermodynamic equilibria among solution ions, with a model for the \nequilibrium complexation of ions with fulvic acid (Model VI). Model VI \nconsiders complexation of cations to fulvic acid by complexation at \ndiscrete sites and by electrostatic accumulation.  The model contains 80 \nspecific binding site types. The formulation of binding strengths is \nstructured such that the binding of each metal is described by two metal–\nspecific parameters: KMA, which describes binding to relatively weak, \nabundant sites, and ΔLK2, a modifying parameter which accounts for \nbinding to relatively strong, scarce sites.  It is assumed that only the free \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n9\nmetal ion and its first hydrolysis product can bind, with the same \nparameter values, and the model has been parameterised on this basis.  \nTipping (1998) calculated a value of 2.4 for logKMA for Fe(III) by linear \nregression of calculated logKMA values for fulvic acid against those for \nhumic acid. Tipping et al. (2002) calculated a logKMA of 2.8 for the binding \ndata of Langford and Khan (1975) and proposed a new default logKMA of \n2.6 for fulvic acid binding, which we shall use here.\nThermodynamic parameters for Fe(III) solution species are shown in Table \n1.  The formation reactions for the Fe(III) dimer Fe2(OH)2\n4+ and trimer \nFe3(OH)4\n5+ were included to test for the possible importance of these \nspecies in the samples studied.  In practice calculated concentrations of \nthese species were found to be negligible.\n4.3 Model inputs\nDissolved organic matter (DOM) comprises a wide range of classes of \ncompound, of which the most important from the metal binding point of \nview are the humic substances (humic and fulvic acids).  WHAM\/Model VI \nhas previously been shown to provide adequate descriptions of metal \nbinding to uncharacterised DOM samples, by adjustment of the proportion \nof dissolved DOM considered to be chemically ‘active’ with respect to \nbinding (e.g. Bryan et al., 2002; Tipping et al, 2002). Thus, within ranges \nof pH, DOM concentrations and metal concentrations previously studied, \nthe use of humic substances as a surrogate for bulk dissolved NOM has \nbeen shown to be reasonable for the simulation of metal binding.  NOM \nwas assumed throughout to comprise 50% C. It was also assumed \nthroughout that DOM was 65% chemically ‘active’, i.e. that it behaved as \nthough composed of 65% fulvic acid and 35% inert material with no \nbinding properties, after Bryan et al. (2002).  Thus, we make the \nassumption that binding properties of DOM do not vary among samples. \nWe argue that the assumptions are further justified if it can be shown that \nthe resulting chemical modelling successfully provides a coherent picture \nof Fe(III) speciation across a broad range of water types.\n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n10\nIn order to assess the effect that variability in DOM 'activity' might have \nupon model outcomes, model calculations were done using bootstrapping. \nFor each sample 10000 speciation calculations were done each with a \ndifferent 'activity', calculated at random assuming the 'activity' to have a \nstandard deviation of 15%, to give 10000 estimates of the output variable \nof interest (either log aFe3+ or total Fe(III)). The standard deviation is based \non the range of DOM 'activities' found by Bryan (2001), based on copper \nbinding to UK freshwaters. The 10000 estimates of the output variable of \ninterest were used to calculate its standard deviation.\n4.4 Literature data\n4.4.1 USA surface waters (Babiarz et al.)\nBabiarz et al. (2001) filtered 23 surface water samples from the northern \nand southern U.S.A. using conventional filtration (0.4μm) and tangential–\nflow ultrafiltration (10kDa cutoff), and measured organic C, Fe and Al in \nboth filtrates.  Ultrafiltration was done at ambient temperature.  The \nconductivity and pH of bulk samples were also measured.  pH ranged from \n3.8 to 8.2 and DOC from 0.2 to 26.5 mg dm-3. Concentrations of major \nions (Na, Mg, K, Ca, Cl, NO3, SO4, F, and HCO3) were estimated for 20 of \nthe sites from the United States Geological Survey (USGS) via the \nNational Water Information System (2008) to derive relationships between \neach major ion and conductivity, from time series samples for the sites \nclosest to those sampled by Babiarz et al. (2001). Stream water \ntemperatures were estimated from the available data by taking the mean \nof all measured temperatures for the sampling month.  For two samples \ntaken in the Florida Everglades, pH, concentrations of DOC, Na, Mg, K, \nCa, Cl, SO4 and alkalinity were taken from the United States Geological \nSurvey South Florida Information Access Service (2008).  Major ions at \ntwo further Everglades sites were estimated by scaling the available \nconcentrations to the conductivity measurements made at these sites by \nBabiarz et al. (2001).  Surface water temperatures at these four sites were \nestimated from the mean temperature for the sampling month at the \nclosest site on National Water Information System (2008).\n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n11\n4.4.2 Amazon surface waters (Küchler et al.)\nKüchler et al. (1994) filtered samples of two Amazon waters (Rio Negro \nand Rio Solimões) at 1µm and successively ultrafiltered subsamples using \na hollow fibre column with nominal cutoffs of 100, 10 and 3kDa.  \nConcentrations of Mg, Al, K, Ca, Fe and DOC in the 10kDa and 3kDa \nultrafiltrates were given.  Water temperatures were not given; values of \n303K were assumed, based on the mean monitored temperature for the\nRiver Solimões during the months of sampling (GEMStat, 2008). Values of \npH were estimated from the data of Seyler and Boaventura (2001).  These \nauthors listed a pH of 4.90 in the Rio Negro at a location close to that of \nKüchler et al. (1994), which was used here.  The pH at six locations on the \nRiver Solimões was given, ranging from 7.02 to 7.44; the mean of 7.25 \nwas used. Equilibrium with atmospheric CO2 was assumed for modelling. \nBoth 10kDa and 3kDa filtrates were modelled.\n4.4.3 River Awout, Cameroon (Dupré et al.)\nDupré et al. (1999) sampled the Awout River (Cameroon) (pH 4.7) and \nperformed sequential tangential filtration (0.2µm) and ultrafiltration \n(300kDa and 5kDa nominal cutoff). A subsample of the 0.2µm filtrate was \nacidified to pH 3.0 and ultrafiltered (1kDa nominal cutoff).  Concentrations \nof DOC, Mg, Al and Fe were given for both the 5kDa and 1kDa samples. \nConcentrations of Na, K, Ca, Cl and SO4 were also given for the 5kDa \nsample; these concentrations were used for the 1kDa sample in lieu of \nmeasured concentrations. pH was measured only in the 0.2µm frontal \nfiltrate; this value was used for both ultrafiltrates. Equilibrium with \natmospheric CO2 was assumed for modelling.\n4.4.4 Cameroon surface and ground waters (Viers et al.)\nViers et al. (1997) sampled surface waters of the Sanaga (pH 7.4) and \nMengong (pH 4.6) rivers of Cameroon, along with three groundwaters \nwithin the Mengong catchment (pH 4.7–5.5). Samples were filtered \nsuccessively at 0.22µm, 0.025µm or 300kDa, and 5kDa.  Concentrations \nof Na, Mg, Al, K, Ca, Fe, Cl, NO3, SO4, alkalinity and DOC were measured \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n12\nin  5kDa filtrates. The pH was measured in 0.22µm filtrates only. Two of \nthe groundwater samples had DOC concentrations below the detection \nlimit so were not used.\n4.4.5 Brazil surface waters (Eyrolle et al.)\nEyrolle et al. (1996) sampled surface waters from three locations in Brazil \n(pH 4.1–7.1). Samples were filtered successively at 0.2µm, 100kDa, \n20kDa and 5kDa. Samples taken from the Paraná system were not \nmodelled due to the low recoveries of Fe obtained, which the authors \nattributed to the use of old ultrafiltration membranes. Speciation was \nmodelled in the 20kDa and 5kDa fractions. Concentrations of Mg, Al, Ca, \nFe and DOC were measured in the 20kDa and 5kDa size fractions. \nMeasurements of pH and alkalinity were done on unfiltered samples.\n4.4.6 Brazil, Venezuela and Cameroon surface waters (Deberdt et al.)\nDeberdt et al. (2002) sampled surface waters from locations in Brazil, \nVenezuela and Cameroon (pH 5.6–7.7). Samples were filtered \nsuccessively at 0.2µm, 300kDa, 100kDa, 10kDa and 5kDa. Measurements \nof pH, alkalinity and temperature were done in the field. Measurements of \nFe, Al, Na, Mg, K, Ca, Cl, NO3, SO4 and DOC were done on ultrafiltrates. \nBoth 10kDa and 5kDa filtrates were modelled.\n4.4.7 Russia soil waters (Pokrovsky et al.)\nPokrovsky et al. (2005) performed filtrations and ultrafiltrations of soil \nsolutions from four locations near Moscow, Russia.  The solutions were \nacidic (pH 3.9–4.7) and high in DOC (39–58 mg dm-3 in 0.22µm filtrates).  \npH, DOC and major ions including Na, Mg, Al, K, Ca, Fe, Cl, NO3 and SO4\nwere measured.  Data for filtrates of 0.22μm filter pore size, and for \nultrafiltrates of 10kDa and 1kDa pore size were taken.\n4.4.8 Netherlands soil waters (Jansen et al.)\nJansen et al. (2001) dialysed soil solutions, obtained by aqueous \nextraction of a Dutch surface soil horizon, centrifugation and filtration at \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n13\n0.45µm, using membranes of 1kDa nominal cut–off and a background \nionic strength of 0.02M.  Four soil solutions were used, the pH values of \nwhich were adjusted to 4.0, 4.1, 7.0 and 7.1 prior to dialysis.  The ionic \nstrength of each solution was adjusted to 0.01M using KNO3; this was also \ndone for the initial inside bag solutions.  Fe, Al and DOC were measured \non the inside bag solutions after 400 hours equilibration at 20oC.\n4.4.9 France groundwaters (Pourret et al.)\nPourret et al. (2007) sampled four groundwaters (pH 6.2–7.1) from two \nwetlands located in the Kervidy-Naizin and Petit-Hermitage catchments, \nFrance. Samples were filtrated (0.2µm) and ultrafiltered at pore size cut–\noffs of 30kDa, 10kDa and 5kDa. Concentrations of Na, Mg, K, Ca, Cl, NO3, \nSO4, alkalinity and pH were measured in filtrates. Concentrations of Al, Fe \nand DOC were measured in ultrafiltrates.\n4.5 Statistical analysis\nRegression parameters and standard errors were computed in MINITAB \nRelease 14 (Minitab Inc., PA, U.S.A.). Pairwise comparisons of regression \nmodel fits were done in Microsoft Excel (Microsoft Inc., WA, U.S.A.) using \nlikelihood ratio testing.\n5 Results and Discussion\n5.1 Water chemistry\nThe samples exhibited a wide range of pH, alkalinity and concentrations of \ncalcium and magnesium (Table 2 and Data 1).  There are no apparent \ntrends in these variables with location; local geological conditions probably \nexert a significant influence.  Concentrations of DOC showed influences of \nsoil type and flow conditions.  At the five sites sampled under both low and \nhigh flow conditions, DOC was higher under high flow.  The highest \nconcentrations of DOC were seen in the Roudsea Wood stream which \ndrains a lowland peat bog.  The influence of flow on chemistry may be \nseen at some sites; for example, the River Hodder under high flow \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n14\n(November 2003) exhibited significantly lower pH and higher DOC than \nunder low flow (January 2004).  The two larger lowland rivers (the Lune \nand Ribble) showed similar chemical characteristics under both high and \nlow flow.\nTotal and filtered (GF\/F) concentrations of Fe varied by approximately one \norder of magnitude across the samples.  Fe concentrations tended to be \nhigher at lower pH, although this was not a pronounced trend.  There was \nalso a tendency for higher filtered Fe to be associated with higher DOC, \nalthough this was not general; the Roudsea Wood stream showed \nrelatively low Fe:DOC ratios on both sampling dates.\n5.2 Dialysate compositions\nSample pH values measured after dialysis for one week mainly showed \nincreases in pH, of up to 1.2 units, due to CO2 degassing.  Measurements \nof Fe, Al and DOC in the dialysates are given in Data 2, Data 3 and Data \n4. Dialysis equilibrium with respect to major ions was achieved, with \nexcellent agreement between the conductivity of inside and outside bag \nsolutions after one week (Pearson correlation = 1.000, p < 0.001). In \ncontrast, dialysate DOC concentrations were found to be lower than \nfilterable concentrations, with the exception of a small number of samples \nwhere the DOC in the raw sample was low (<2 mg dm-3) (Figure 1).  \nDialysate DOC as a percentage of filtered DOC averaged 37% for \ndialysates of 3.5kDa and 50% for dialysates of 10kDa. Dialysis at 15kDa, \nwhich was not done on all samples, produced DOC concentrations \naveraging 97% of those obtained by dialysis at 10kDa. Why this apparent \nlack of equilibrium with respect to DOC occurs is not clear. Possible \nreasons include slow diffusion of larger organic molecules (Buffle et al. \n1993), retention of NOM on larger particles due to adsorption and\/or \naggregation, or the formation of micellar DOM units too large to pass the \nmembrane (Kerner et al. 2003). It is plausible that some DOM is simply of \ntoo large a size to efficiently pass the dialysis membrane; in this context, it \nis noteworthy that in studies using ultrafiltration to isolate low molecular \nweight fractions of freshwaters, passage of DOM through ultrafiltration \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n15\nmembranes is by no means complete. For example, in the study of \nBabiarz et al. (2001) (DOM 1.6–94.6 mg l-1) between 20% and 73% of \nDOM did not pass a 10kDa pore size cutoff ultrafiltration membrane. It is \nimportant to realise, however, that ultimately the proportion of the filterable \nDOM that is dialyzable is not important for this work: it is more important to \nobtain a sample from which HFO has been removed in order to calculate \naFe3+.\n5.3 Fe3+ activities\nActivities of Fe3+ in the dialysates (Table 3) were calculated using \nWHAM\/Model VI. The relationship between log aFe3+ and dialysate pH was \nmodelled by linear regression.  Where dialysates of multiple pore sizes \nwere obtained from a single sample, calculated log aFe3+ values were \nweighted so that the results from each individual sample were emphasised \nequally in the regression. With bootstrapping, 10000 estimates of the \nregression parameters (slope and intercept) were obtained; the means \nand standard deviations of these estimates were taken as the parameters \nand their standard errors respectively. Activities showed a strong linear \ndependence upon pH, which could be described by the equation\nlog aFe3+ = 2.93(±0.40) – 2.70(±0.06)·pH; p < 0.001, SEpred = 0.58 (2)\nwhere SEpred is the standard error of prediction and the bracketed terms \nare the standard errors of the regression parameters. Addition of a \nquadratic term in pH produced no significant improvement in the fit. This \ncontrasts with the solubility trend for log aAl3+ computed by Tipping (2005),\nwhere a quadratic term was required to adequately fit the data. The linear \ntrend in log aFe3+ with pH is consistent with control of Fe\n3+ activities by an \nHFO type phase.  However, the slope of the line differs significantly from \nthe value expected according from the theoretical solubility equilibrium of \nHFO (Equation 1): none of the 10000 slope values calculated by \nbootstrapping were below the value of -3.0 predicted.\nFig 2 shows the dependence of log aFe3+ on pH and compares modelled \nFe3+ activities with predictions made assuming conventional solubility \nproducts.  Lines are plotted for standard log solubility products for HFO of \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n16\n102.5 and 105.0, considered by Tipping et al. (2002) to represent a \nreasonable range of solubilities for this material based on the literature.\nThe enthalpy value of Liu and Millero (1999) (-100.4 kJ mol-1) was used to \ncorrect standard solubility products to 283K. It can be seen that at higher \npH (> 6.0), mean Fe(III) solubility is characteristic of the upper end of the \nliterature range while at lower pH it tends towards the lower end of the \nrange. Thus the solubilities that we calculate from our observations\ncorrespond well with the literature range. This finding also supports our \nhypothesis that Fe(III)–organic complexation can be reasonably modelled \nas a function of bulk DOC concentration rather than by invoking specific \norganic ligands.\nThe pH dependence of log aFe3+ in Equation (2) is worthy of note, since it \ncan affect the prediction of activities appreciably in comparison with the \nstandard solubility product approach. Slope values significantly below -3.0 \nfor the log aFe3+-pH relationship have been found in laboratory studies of \nFe(III) solubility. Of particular interest are the studies of Byrne and Luo \n(2000) and Byrne et al. (2005), where direct potentiometric measurement \nof Fe3+ concentration variation with pH resulted in slope values of \n-2.86(±0.01) and -2.73(±0.01), respectively, for the solubility of freshly \nprecipitated (15–60 minutes) HFO. Fox (1988) calculated a slope value of \n-2.35 based on speciation modelling of dialysed synthetic solutions, and\nconsidered the slope value to result from the substitution of anionic \ncounterions (e.g. Cl-, NO3\n-) for OH- in the solid phase, while Byrne and Luo \n(2000) proposed as an alternative explanation a pH–dependent variation \nin the activity of the solid phase, possibly via a particle size effect. Such a \ncorrespondence between Equation (2) and such studies is thus intriguing \nand hints at the possibility of a common effect on the magnitude of the \nslope term. It is worth noting that the slope found is unlikely to be due to \nmeasurement error: if WHAM\/Model VI is used to predict the total Fe(III) in \nthe dialysates assuming control by HFO with a standard solubility product \nof 105.0, then in the five dialysates with pH < 5.0 the predicted Fe(III) \nconcentration exceeds that observed by a factor of at least eight. \nConversely, if a standard solubility product of 102.5 were to be assumed, \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n17\ndialysate Fe(III) ought to be undetectable (<2 µg l-1) at circumneutral pH. \nThus, the identified trend in Fe3+ activity appears robust.\nFig 3 compares Fe3+ activities, calculated using Equation (2) and corrected \nto 298K using the enthalpy change of Liu and Millero (1999), with values \ncalculated from the solubility equations presented by Byrne et al. (2005) \nand Byrne and Luo (2000) for the concentration of Fe3+ in 0.7M NaCl and \n0.7M NaClO4, respectively.  Measured Fe\n3+ concentrations in Byrne et al. \n(2005) and Byrne and Luo (2000) were corrected for activity effects using \nSpecific Ion Interaction Theory (Grenthe et al. 1997), using species \ninteraction coefficients of 0.56 and 0.38 for Fe3+–ClO4\n- and Fe3+–Cl-\ninteractions respectively. Activities predicted after Byrne et al. (2005) are \nconsistently higher than those predicted by us, by 0.9–1.1 log units in the \npH range 3 to 9. Within the same pH range the activities predicted after \nByrne and Luo (1999) are within 0.6 log units of our predictions, being \nslightly higher below pH 5 and slightly lower above this pH. As can be \nseen in Fig 3, the solubility line of Byrne and Luo (2000) is entirely within \nthe confidence intervals of our regression line within the pH range 3–9. \nThe solubility line of Byrne et al. (2005) is within the confidence intervals \nabove pH6, but is outside below this pH.\nByrne and co–workers measured Fe(III) solubility very shortly after the \nonset of precipitation (within one hour). In natural systems HFO is likely to \nbe somewhat older than this, which may alter its solubility. For further \ncomparison, we calculated Fe3+ activities from the experiments of Liu and \nMillero (1999) in which Fe(III) solubility was estimated between 3 hours \nand 21 days after HFO precipitation. The hydrolysis equilibrium constants \ncalculated by these authors in the same experiments were used in our \ncalculations. There was excellent agreement (identical to one decimal \nplace) between the predictions of Liu and Millero (1999) and Byrne et al \n(2005) for the solubility of freshly precipitated HFO in NaCl, at pH 4 and \npH 6, although at pH 8 the predicted Fe3+ activities differed by 1.4 log \nunits. Following 21 days of precipitation the Fe3+ activities were between\n0.5 and 0.7 log units lower than those observed for freshly precipitated \nmaterial. At pH 4 and pH 6 the predicted activities were closer to the \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n18\nsolubility predicted from our data, and at all pH values the activities were \nwithin the confidence intervals on our regression line. Thus, there is \nencouraging agreement between the results of laboratory studies and the \nfield data presented here, notwithstanding the differences between the \nresults of the laboratory studies. However, given that natural oxides and \nhydroxides of Fe(III) are chemically and morphologically diverse (e.g. \nDavison and De Vitre 1993) it would be premature to assert a common \nmechanism of solubility control between laboratory and field. It must also \nbe borne in mind that our data are subject to greater uncertainty both in \nmeasurement (due to the large number of input variables to the model) \nand modelling, than well–controlled laboratory studies. Further work on \niron activity controls in freshwaters is required to investigate this \nphenomenon further.\n5.4 Modelling of literature data\nThe literature studies did not involve the quantification of Fe(II) in \nultrafiltrates or dialysates, with the exception of Jansen et al. (2001) where \nthe absence of Fe(II) was established by colorimetry. Thus it was not \nconsidered appropriate to combine the literature data with the data \ngenerated in this study when parameterising Equation (2). Instead we \nused Equation (2) to calculate values of aFe3+ in the literature samples, \nwhich were then input to WHAM\/Model VI along with the major ion, pH \nand DOM concentrations to predict the total dialyzable or ultrafiltrable \nFe(III). The results (Fig 4a and 4c) indicate a good correlation between \nobserved and calculated values, however the latter are on average \noverestimated: on average the predicted aFe3+ was 3.8 times greater than \nthe observed value. Clearly this bias cannot be due to the presence of \nFe(II) since if so we would expect to calculate smaller Fe(III) \nconcentrations than the observed totals, on average. A more likely \nexplanation is the expected effect of temperature on Fe3+ activities if the \nlatter are controlled by HFO solubility. Since the dissolution of HFO\n(Equation 1) is exothermic, we would expect its solubility to decrease with \nincreasing temperature. Thus we would expect the concentration of free \nionic and complexed Fe(III) in equilibrium with HFO to decrease also. \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n19\nSince the mean temperature of the literature samples was 293K, we would \nexpect that on average Equation (2) would overestimate the Fe3+ solubility\nin the literature samples. While it would be possible to extend Equation (2) \nto empirically account for temperature effects by fitting to the literature \ndata, we have chosen not to do so, as this would discount the possibility of \nFe(II) as a confounding factor in the observations. Instead, we a priori\nadjusted the Fe3+ activities calculated with Equation (2) assuming HFO \nsolubility control:\n\n\n\n\n   TR\naa\n1\n283\n1\n3.2\nH\nloglog\no\n,283KFe3T,Fe3 (3)\nwhere Ho is the standard enthalpy change for Equation (1) (after Liu and \nMillero (1999)). The resulting predicted Fe(III) concentrations show \nappreciably better agreement with the observations (Figs 4b and 4d), with \n65 of the 90 predictions falling within a factor of three of the corresponding \nobservation, compared with 53 prior to temperature adjustment. The root \nmean squared difference (RMSD) in log concentrations dropped from 0.53\nto 0.44. The dataset of Babiarz et al. (2001), which contained the largest \nnumber of samples and a wide range of sample temperatures (273K to \n303K), showed a decrease in RMSD from 0.44 to 0.27 and improved \nprediction of total Fe(III) in 17 of the 23 samples.\nFollowing temperature correction, the predicted Fe(III) was on average 1.8\ntimes the observed Fe.  This is the inverse of the effect that would result \nfrom the presence of Fe(II) but does not preclude the possibility that Fe(II) \nis important in some samples.  For example, the discrepancy between \nobservations and calculations in the dataset of Eyrolle et al (1996) could \nbe due to Fe(II).\n5.5 Calculating Fe(III) solubility for speciation modelling\nIt is desirable to incorporate the solubility of Fe(III) into speciation models \nin order to simulate Fe(III) chemistry and thus account for such effects as \nthe competition between Fe(III) and trace metals for binding to humic \nsubstances (Tipping et al. 2002). This could be done in one of two ways. \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n20\nEquations (2) and (3) can be combined to give a temperature–\nindependent expression for log aFe3+:\n\n\n\n\n  TR\na\n1\n283\n1\n3.2\nH\npH70.293.2log\no\nT,Fe3 (4)\nwhich simplifies further if the enthalpy change of Liu and Millero (1999) is \nassumed:\nT\na\n5253\npH70.263.15log T,Fe3  (5)\nThis expression is suitable for the direct calculation of Fe3+ activities if the \npH is fixed for the speciation calculation. For calculations where the pH is \nalso to be calculated, it is necessary to specify the solubility parameters in \nthe form of a solid phase. If the solid is assumed to have the enthalpy \nchange given by Liu and Millero (1999), then from Equation (2), the \nputative standard solubility product has the form\nKso = {Fe\n3+}{H+}-2.70 or pH70.2loglog T,Fe3  aKso (6)\nand after Equation (5):\nT\n5253\n63.15log soK (7)\nAt 298K Kso is 10\n2.00, from Equation (7).\n5.6 Fe:DOM ratios in UK samples\nIn natural systems, Fe(III) binds relatively strongly to DOM (Tipping et al. \n2002) and the major competing species (other than H+) for binding is Al. \nTipping (2005) has shown that the variability of Al3+ activity in surface \nwaters can be reasonably described using a single function of pH. \nAssuming control of Fe3+ activity according to Equation (2) then allows a \ngeneric prediction of the ratio of truly dissolved Fe(III) to DOM to be made \nusing WHAM\/Model VI, for a temperature of 283K. This is a useful quantity \nto predict since it can be compared with measured Fe:DOM ratios: if the \nmeasured ratio exceeds that calculated, this indicates the presence of \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n21\ncolloidal Fe, or Fe(II). In Fig 4a, such a prediction is compared to the \nobserved Fe(III):DOM ratios for the sample filtrates and dialysates\nobtained in this study. Observed ratios in the filtrates were almost all in the \nrange 10-3–10-4 mol g-1 and showed no variability with pH. Observed ratios \nin the dialysates overlapped to a small extent with those in the filtrates, but \nwere generally lower, in the range 10-3.6–10-5.2.  The ratios also showed a \ndownward trend with pH; below pH 5.0, ratios were similar in the filtrates \nand dialysates. Values of the predicted Fe(III):DOM ratio are given for pH \n3.0–9.0 in Data 5.\nIf a water sample contains Fe(III) not in the form of truly dissolved Fe(III), \nthen we would expect its Fe(III):DOM ratio to exceed that calculated by \ntaking Equation (2) as a starting point. This can be seen in Fig 4a for the \nfiltrates of our samples. In Fig 4b, a set of observed Fe(III):DOM ratios is \nshown for long term monthly monitoring data from Pool X and Pool Y, two \nof the sites sampled in this study. The generic prediction of Fe(III):DOM is \nshown for reference. In line with our theory, the observed ratios are \nconsistently greater than the predicted Fe(III):DOM, with the exception of a \nsmall number of outliers. Given the number of samples taken it is not \nsurprising to find outliers with ratios below the predicted Fe(III):DOM, \nparticularly since the prediction relates to a single temperature taken as a \ntypical annual mean for UK waters. Of note is the observation that the \nincrease in Fe(III):DOM with decreasing pH is reflected in the observed \nFe(III):DOM ratios, particularly in the dataset from Pool X (pH 3.9–6.3). \nObserved Fe:DOM ratios are shown in Fig 5 for circumneutral to alkaline \nsurface waters, comprising data for four rivers monitored under the UK \nLand Ocean Interaction Study (LOIS) in 1994-96 (Neal and Robson, \n2000). Here no separate measurements of Fe(II) were made. The \npredicted Fe:DOM ratios were corrected by assuming Fe(II) in the dialysed \nfraction to be 32% of the Fe(III), following the observations in the \ndialysates obtained in this study. This raised the predicted Fe:DOM by \n0.12 log units (a factor of 1.3).  Observed Fe:DOM ratios again largely \nexceeded the generic Fe:DOM. The exception was the River Trent, where \nan appreciable number of observed Fe:DOM ratios clustered around the \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n22\npredicted Fe:DOM. This can be taken as an indication of relatively low \nconcentrations of colloidal Fe(III) in this system.  The correction of the \npredicted Fe:DOM for the presence of Fe(II) does not greatly affect the \noutcome, since the variability in observed ratio at a given pH is much \nlarger than the amount by which the correction increases Fe:DOM.\n5.7 The chemistry of Fe(III) in freshwaters\nThe generic solubility equation can be used to investigate and predict the \neffects of changing solution conditions upon Fe(III) speciation. For \nexample, the truly dissolved Fe(III):DOM ratio is predicted to decrease \nsubstantially with increasing pH. In the UK, acidic discharges are largely \nassociated with upland areas where buffering of precipitation acidity is low \ndue to either slow weathering of the underlying rock and\/or the presence \nof highly organic acid soils, particularly peats and rankers. Such waters \nare represented in our dataset by Pool X, and by the River Hodder sample \nof 13 November 2003 (see Data1 for the full chemical composition). We \ncarried out a series of calculations in order to investigate the predicted \neffect on Fe(III) speciation of the progressive mixing of an acid water with \na circumneutral Ca–rich water more typical of large UK rivers. This was \ndone by taking the composition of the 3.5kDa dialysates of the River \nHodder (pH 4.35; dialyzable DOC 3.9 mg l-1; Ca 0.06 mmol l-1) and making \na series of calculations by progressively increasing the Ca concentration \nand allowing WHAM to calculate the pH by charge balance, at a \ntemperature of 283K.  The speciation of Fe(III) was considered by \ncalculating the activity of Fe3+ from Equation (2). The speciation of Al was \ncalculated by first allowing Al to precipitate as Al(OH)3 (s), and secondly by \npreventing precipitation from occurring. The results (Fig 6) show the \npredicted decrease in the truly dissolved Fe(III) concentration as pH \nincreases. Between the initial pH and pH 6.0 approximately four–fifths of \nthe truly dissolved Fe(III) is predicted to be lost. Above pH 6.0 the loss of \nFe(III) from the truly dissolved pool slows as pH increases further, partly \nbecause Al precipitation reduces competition and allows Fe(III) to remain \nbound to DOM. At pH 8.5 only 7% of the truly dissolved Fe(III) present at \nthe initial pH remains in this form. In the field, losses of Fe(III) from the \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n23\ntruly dissolved pool on neutralisation of acidic waters would occur through\nprecipitation of HFO.\n6 Conclusions\nDialysis is a simple and effective way of separating a sample of 'truly \ndissolved' Fe from colloidal–sized material.  Using this technique, we have \nbeen able to compute Fe3+ activities for a number of UK surface waters \nand to show that the trend in log activities with pH is linear. The solubility \nof Fe3+ is close to that predicted by assuming equilibrium with a 'hydrous \nferric oxide' type phase. The slope of the relationship between log aFe3+\nand pH is lower than that predicted by the theoretical stoichiometry of the \nsolid phase, a finding previously observed in some laboratory studies of \nFe(III) solubility. By the use of a bootstrap method to account for the \npossible variability in DOM binding 'activity', we have shown that this \nfinding is robust to such variability, and thus the assumption of a mean \nDOM binding 'activity' is reasonable. These findings strongly support the \nhypothesis that organic complexation of Fe(III) in freshwaters can be \nmodelled as a function of DOC concentration without the need to invoke \ndistinct organic ligands. The linear relationship between log aFe3+ and pH \ncan be used to predict the total Fe in dialysates and ultrafiltrates sampled \nfrom a wide variety of surface and soil\/ground waters.  The prediction is \nsignificantly improved if it is assumed that solubility has a temperature \ndependence predicted by the temperature dependence of HFO solubility, \nwhich provides strong support for the contention that HFO controls Fe3+\nactivities in the field. Using the Fe3+ activity equation it is possible to make \na generic prediction of the Fe(III):DOM ratio expected at a given pH due to \ninorganic and organic complexation. Higher 'dissolved' Fe:DOM ratios in \nnatural waters may be indicative of the presence of Fe in other forms, \nparticularly colloidal Fe(III) and dissolved or complexed Fe(II).  \nComparison of the computed Fe(III):DOM ratio with observed Fe:DOM \nratios in UK surface waters indicated that in most cases excess Fe, most \nlikely mainly colloidal Fe(III), was indeed present. \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n24\nA notable aspect of the literature data used in this study is the almost \ncomplete absence of Fe(II) measurements. Our data indicate that although \nFe(II) might only comprise a small portion of the total 'dissolved' Fe, it is \nlikely to be a more important component of the 'truly dissolved' Fe (an \naverage of 24% in our samples). Clearly, when considering Fe speciation \nin natural waters the measurement of Fe(II) should have a higher priority.\nThere is currently a growing interest in quantifying the fluxes of riverine Fe \nto the oceans (e.g. Krachler et al. 2005), given the important role of Fe in \ncontrolling oceanic phytoplankton productivity. Knowledge of Fe(III) \nspeciation is likely to offer considerable insight into the processes \ncontrolling such fluxes. While a significant proportion of Fe is lost on \nmixing of riverine and estuarine waters (e.g. Sholkovitz et al. 1978), \nevidence exists that truly dissolved Fe comprises a quasi–conservative Fe \npool with respect to fluxes through the mixing zone (e.g. Dai and Martin \n1996). Thus, predicting the truly dissolved Fe(III) at the tidal limit using our \nsolubility equation may allow better estimation of Fe fluxes through \nestuaries to the ocean.\nAcknowledgements We thank David Abel and Sarah Thacker for help with sampling, \nand Sarah Thacker, Colin Vincent, David Wilson, Gillian Ainsworth and Alan Lawlor for \nchemical analysis. This work was funded by the Natural Environment Research Council \n(Grant reference NER\/B\/S\/2002\/00513). We thank an anonymous reviewer for comments \nthat led to the improvement of this paper.\n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n25\nReferences\nAllard T, Menguy N, Salomon J, Calligaro T, Weber T, Calas G,, Benedetti M F (2004) \nRevealing forms of iron in river–borne material from major tropical rivers of the Amazon \nBasin (Brazil) Geochim Cosmochim Acta 68: 3079–3094.\nBabiarz CL, Hurley JP, Hoffmann SR, Andren AW, Shafer MM, Armstrong DE (2001) \nPartitioning of Total Mercury and Methylmercury to the Colloidal Phase in Freshwaters. \nEnviron Sci Technol 35: 4773–4782.\nBenedetti MF, Ranville JF Allard T, Bednar AJ, Menguy N (2003). The iron status in \ncolloidal matter from the Rio Negro, Brasil. Coll Surf A: 217, 1–9.\nBeneš P, Steinnes E (1974) In situ dialysis for the determination of the state of trace \nelements in natural waters. Wat Res 8: 947–953.\nBryan SE (2001) Testing Models of Chemical Speciation in Freshwaters. Ph.D. thesis, \nUniversity of Manchester.\nBryan SE, Tipping E, Hamilton-Taylor J (2002) Comparison of measured and modelled \ncopper binding by natural organic matter in freshwaters. Comp Biochem Phys C 133: 37–\n49.\nBuffle J, Perret D, Newman M (1993) The use of filtration and ultrafiltration for size \nfractionation of aquatic particles, colloids and macromolecules. In: Environmental \nParticles, Vol. 1, Buffle J, van Leeuwen HP eds., pp.171–230. Lewis Publishers, Boca \nRaton, FL, U.S.A.\nByrne RH, Luo Y–R (2000) Direct observation of nonintegral hydrous ferric oxide \nsolubility products: K*so = [Fe3+][H+]-2.86.  Geochim Cosmochim Acta 64: 1873–1877.\nByrne RH, Yao W, Luo, Y–R, Wang B (2005) The dependence of FeIII hydrolysis on ionic \nstrength in NaCl solutions. Mar Chem: 97, 34–48.\nCameron, AJ, Liss, PS (1984) The stabilization of “dissolved” iron in freshwaters. Wat \nRes 18: 179–185.\nDai MH, Martin JM (1995) First data on Trace-Metal levels and behavior in 2 Major Arctic \nRiver-Estuarine Systems (Ob And Yenisey) and in the adjacent Kara Sea, Russia. Earth \nPlanet Sci Lett 131: 127–141.\nDavison W (1990) A practical guide to pH measurement in freshwaters, Trends Anal \nChem 9: 80–83.\nDavison W (1993) Iron and manganese in lakes. Earth–Sci Rev 34: 119–163.\nDavison W, De Vitre R (1993) Iron Particles in Freshwaters. In: Environmental Particles, \nVol. 1, Buffle J, van Leeuwen HP eds., pp.315–355. Lewis Publishers, Boca Raton, FL, \nU.S.A.\n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n26\nDeberdt S, Viers J, Dupré B (2002) New insights about the rare earth elements (REE) \nmobility in river waters. Bulletin de la Société Géologique de France 173: 147–160.\nDupré B, Viers J, Dandurand JL, Polve M, Benezeth P, Vervier P, Braun JJ (1999) Major \nand trace elements associated with colloids in organic-rich river waters: ultrafiltration of \nnatural and spiked solutions. Chem Geol: 160, 63–80.\nDzombak DA, Morel FMM (1990) Surface Complexation Modeling: Hydrous Ferric Oxide. \nWiley, New York\nEyrolle F, Benedetti MF, Benaim, JY, Février, D (1996) The distributions of dissolved and \ncolloidal organic carbon, major elements, and trace elements in small tropical \ncatchments. Geochim Cosmochim Acta 60: 3643–3656.\nFox LE (1988) The solubility of colloidal ferric hydroxide and its relevance to iron \nconcentrations in river water. Geochim Cosmochim Acta 52: 771–777.\nGEMStat (2008) United Nations Global Environment Monitoring System\/Water \nProgramme, Burlington, Ontario, Canada. http:\/\/www.gemstat.org. Cited 18 Feb 2008.\nGibbs MM (1979) A simple method for the rapid determination of iron in natural waters.  \nWat Res 13: 295–297.\nGrenthe I, Plyasunov AV, Spahiu K (1997) Estimations of Medium Effects on \nThermodynamic Data. In: Grenthe I, Puigdomenech I (eds) Modelling in Aquatic \nChemistry. OECD, Paris, p325.\nJansen B, Kotte MC, van Wijk AJ, Verstraten JM (2001) Comparison of diffusive \ngradients in thin films and equilibrium dialysis for the determination of Al, Fe(III) and Zn \ncomplexed with dissolved organic matter. Sci Total Environ 277: 45-55.\nJones RI, Shaw PJ, De Haan H (1993) Effects of dissolved humic substances on the \nspeciation of iron and phosphate at different pH and ionic strength. Environ Sci Technol \n27: 1052–1059.\nKerner M, Hohenberg H, Ertl S, Reckermann M, Spitzy A (2003) Self-organization of \ndissolved organic matter to micelle-like microparticles in river water. Nature: 422, 150–\n154.\nKoenings JP (1976) In situ experiments on the dissolved and colloidal state of iron in an \nacid bog lake. Limnol Oceanog 21: 674–683.\nKrachler R, Jirsa F, Ayromlou S (2005) Factors influencing the dissolved iron input by \nriver water to the open ocean. Biogeosciences 2: 311–315.\nKüchler IL, Miekeley N, Forsberg BR (1994) Molecular-Mass Distributions of Dissolved \nOrganic-Carbon and Associated Metals in Waters from Rio-Negro and Rio-Solimoes. Sci \nTotal Environ 156: 207-216.\n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n27\nLangford CH, Khan T R (1975) Kinetics and equilibrium binding of Fe3+ by a fulvic acid: a \nstudy by stopped flow methods. Can J Chem 54: 2979–2984.\nLaxen DPH, Chandler IM (1983) Size distribution of Iron and Manganese Species in \nFreshwaters. Geochim Cosmochim Acta 47: 731–741.\nLiu X, Millero FJ (1999) The solubility of iron hydroxide in sodium chloride solutions. \nGeochim Cosmochim Acta 63: 3487–3497.\nLyvén B, Hassellöv M, Turner DR, Haraldsson C, Andersson K (2003) Competition \nbetween iron– and carbon–based colloidal carriers for trace metals in a freshwater \nassessed using flow field–flow fractionation coupled to ICP–MS. Geochim Cosmochim \nActa 67: 3791–3802.\nNational Water Information System (2008) United States Geological Survey, Reston. \nhttp:\/\/waterdata.usgs.gov\/nwis. Cited 14 Jan 2008.\nNeal C, Robson AJ (2000) A summary of river water quality data collected within the \nLand-Ocean Interaction Study: core data for eastern UK rivers draining to the North Sea. \nSci Tot Environ 251: 585–665.\nNordstrom DK, Plummer LN, Langmuir D, Busenberg E, May HM, Jones BF, Parkhurst \nDL (1990) Revised chemical equilibrium data for major water–mineral reactions and their \nlimitations. In  Melchior DC, Bassett RL (eds) Chemical Modeling of Aqueous Systems II. \nAmerican Chemical Society, Washington, DC.\nOlivié–Lauquet G, Allard T, Benedetti M, Muller JP (1999) Chemical distribution of \ntrivalent iron in riverine material from a tropical ecosystem: a quantitative EPR study. Wat \nRes 33: 2726–2734.\nPerdue EM, Beck KC, Reuter JH (1976) Organic complexes of iron and aluminum in \nnatural–waters. Nature 260: 418–420.\nPokrovsky OS, Dupré B, Schott J (2005) Fe–Al–organic colloids Control of Trace \nElements in Peat Soil Solutions: Results of Ultrafiltration and Dialysis. Aquat Geochem \n11: 241–278.\nPourret O, Davranche M, Gruau G, Dia A (2007) Organic complexation of rare earth \nelements in natural waters: Evaluating model calculations from ultrafiltration data. \nGeochim Cosmochim Acta 71: 2718–2735.\nRose J, Vilge A, Olivié–Lauquet G, Masion A, Frechou C, Bottero JY (1998) Iron \nspeciation in natural organic matter colloids. Colloids and Surfaces A - Physicochemical \nand Engineering Aspects 136: 11–19.\nSeip HM, Müller L, Naas, A (1984) Aluminium speciation: comparison of two \nspectrophotometric analytical methods and observed concentrations in some acidic \naquatic systems in Southern Norway. Water Air Soil Pollut 23: 81–95.\n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n28\nSeyler PT, Boaventura, GR (2001) Trace elements in the mainstem Amazon River. In \nMcClain ME, Victoria RL, Richey JE (eds) The biogeochemistry of the Amazon River. \nOxford University Press, New York, NY\nShapiro J (1966) The relation of humic colour to iron in natural waters. Verh Internat \nVerein Limnol 16: 477–484.\nSholkovitz ER, Boyle EA, Price NB (1978) The removal of dissolved humic acids and iron \nduring estuarine mixing. Earth Planet Sci Lett 40: 130–136.\nSmith RM, Martell AE, Motekaitis RJ (2004) NIST Critically Selected Stability Constants \nof Metal Complexes Database. Version 8.0 For Windows. National Institute of Standards \nand Technology, Gaithersburg\nStumm W, Morgan JJ (1996) Aquatic Chemistry: Chemical Equilibria and Rates in Natural \nWaters Wiley, New York\nTipping E (1981) The adsorption of aquatic humic substances by iron oxides. Geochim \nCosmochim Acta 45: 191–199.\nTipping E (1994) WHAM -  a chemical equilibrium model and computer code for waters, \nsediments and soils incorporating a discrete site\/electrostatic model of ion-binding by \nhumic substances. Comp Geosci 20: 973–1023.\nTipping E (1998) Humic Ion-Binding Model VI: An Improved Description of the \nInteractions of Protons and Metal Ions with Humic Substances. Aquat Geochem 4: 3–48.\nTipping E (2005) Modelling Al competition for heavy metal binding by dissolved organic \nmatter in soil and surface waters of acid and neutral pH. Geoderma 127: 293–304. \nTipping E, Rey–Castro C, Bryan SE, Hamilton–Taylor J (2002) Al(III) and Fe(III) binding \nby humic substances in freshwaters, and implications for trace metal speciation. Geochim \nCosmochim Acta 66: 3211–3224.\nTipping E, Rieuwerts J, Pan G, Ashmore MR, Lofts S, Hill MTR, Farago ME, Thornton I \n(2003) The solid-solution partitioning of heavy metals (Cu, Zn, Cd, Pb) in upland soils of \nEngland and Wales. Env Poll 125: 213–225.\nTurner DR, Hunter KA, De Barr HJW (2001) Introduction. In: Turner DR, Hunter KA (eds) \nThe Biogeochemistry of Iron in Seawater. John Wiley & Sons, Chichester, p1.\nUnited States Geological Survey South Florida Information Access – Data Exchange –\nEverglades Water Chemistry Data (2005). \nhttp:\/\/ sofia.usgs.gov\/exchange\/aiken\/aikenchem.html. Cited 14 Jan 2008.\nViers J, Dupre B, Polve M, Schott J, Dandurand JL, Braun JJ (1997) Chemical \nweathering in the drainage basin of a tropical watershed (Nsimi-Zoetele site, Cameroon) : \ncomparison between organic-poor and organic-rich waters. Chem Geol: 140, 181–206.\n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n29\nTable 1 Parameters for the considered solution complexation reactions of Fe(III)\nReaction log Ko Ho (kJ mol-1) Reference\nFe3+ + H2O ↔ FeOH2+ + H+ -2.19 43.4 Nordstrom et al. 1990\nFe3+ + 2H2O ↔ Fe(OH)2+ + 2H+ -5.67 71.4 Nordstrom et al. 1990\nFe3+ + 3H2O ↔ Fe(OH)3 (aq) + 3H+ -12.56 103.5 Nordstrom et al. 1990\nFe3+ + 4H2O ↔ Fe(OH)4- + 4H+ -21.6 133.2 Nordstrom et al. 1990\n2Fe3+ + 2H2O ↔ Fe2(OH)24+ + 2H+ -2.85 57.7 Smith et al. 2004\n3Fe3+ + 4H2O ↔ Fe3(OH)45+ + 4H+ -6.29 65.4 Smith et al. 2004\nFe3+ + Cl- ↔ FeCl2+ 1.48 23.5 Nordstrom et al. 1990\n2Fe3+ + Cl- ↔ FeCl2+ 2.13 – Nordstrom et al. 1990\nFe3+ + F- ↔ FeF2+ 6.2 11.3 Nordstrom et al. 1990\nFe3+ + 2F- ↔ FeF2+ 10.8 20.1 Nordstrom et al. 1990\nFe3+ + SO4\n2- ↔ FeSO4+ 4.04 16.4 Nordstrom et al. 1990\n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n30\nTable 2 Ranges of chemical determinands in sampled waters\nDeterminand Range\npHfield 4.16–8.14\npHfinal 4.28–8.02\nDOC (mg dm-3) 1.7–40.3\n(Na, Mg, K, Ca) (μmolc dm-3) 235–8122\n(Cl, NO3, SO4) (μmolc dm-3) 118–6032\nAlkalinity (μeqc dm-3) 0–2668\nTotal Fe (nM) 1199–16848\nFiltered Fe (nM) 859–12337\nTotal Fe(II) (nM) <36–340\nFiltered Fe(II) (nM) <36–573\nTotal monomeric Al (nM) 148–15826\nTotal acid–reactive Al (nM) 556–15159\n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n31\nTable 3  Fe3+ activities for samples in this study and literature datasets, calculated using WHAM\/Model VI (subscript 'model') and calculated by multiple linear 1\nregression on pH and temperature (subscript 'regression').2\nSample name Pore size cutoff (kDa) pH log aFe3+, model (M) SD log aFe3+, model log aFe3+, regression (M)\nPool Y 3.5 6.9 -16.1 0.7 -15.4\nRoudsea Wood 3.5 7.4 -16.8 0.6 -16.7\nWhitray Beck tributary 3.5 6.2 -13.2 0.4 -13.6\nRiver Hodder 3.5 4.6 -9.5 0.3 -9.4\nGais Gill 3.5 7.2 -17.0 0.6 -16.1\nRiver Eden 3.5 7.6 -16.9 0.5 -17.2\nPool X (2) 3.5 4.6 -9.7 0.4 -9.2\nWhitray Beck tributary (2) 3.5 7.4 -15.8 0.2 -16.6\nRiver Ribble (2) 3.5 8.0 -18.2 0.4 -18.2\nRoudsea Wood (2) 3.5 7.4 -16.1 0.4 -16.7\nWad Hazel Sike (2) 3.5 7.8 -17.1 0.3 -17.6\nPool X 10 4.3 -8.1 0.2 -8.5\nPool Y 10 6.9 -16.7 0.8 -15.4\nRoudsea Wood 10 7.4 -16.9 0.7 -16.8\nWhitray Beck tributary 10 6.4 -13.3 0.4 -14.0\nRiver Hodder 10 4.6 -9.3 0.4 -9.3\nRiver Lune 10 7.6 -16.8 0.3 -17.2\nRiver Ribble 10 7.7 -17.2 0.4 -17.4\nGais Gill 10 7.3 -16.9 0.7 -16.5\nRiver Eden 10 7.6 -16.8 0.5 -17.1\nPool X (2) 10 4.5 -9.4 0.5 -9.0\nPool Y (2) 10 7.3 -16.4 0.6 -16.5\nWhitray Beck tributary (2) 10 7.4 -16.4 0.4 -18.3\nRiver Lune (2) 10 8.0 -18.7 0.3 -16.6\nRiver Ribble (2) 10 8.0 -18.8 0.4 -18.2\nRoudsea Wood (2) 10 7.4 -16.8 0.6 -16.7\nWhitray Beck tributary (2) 15 7.4 -18.7 0.4 -18.3\nRiver Lune (2) 15 8.0 -16.9 0.5 -16.6\nRoudsea Wood (2) 15 7.4 -15.1 0.4 -15.1\nWad Hazel Sike (2) 15 7.8 -16.9 0.6 -16.7\n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n32\nFigure captions\n1\nFig 1 Comparison of filtered (0.7 µm) concentrations of organic carbon and concentrations 2\nobtained following dialysis for one week.  Closed circles: dialysis at 3.5kDa; open circles: 3\n10kDa; closed triangles: 15kDa.  The solid line is the 1:1 relationship.4\nFig 2 Activities of Fe3+ in dialysates calculated using WHAM\/Model VI plotted against pH. 5\nClosed circles: 3.5kDa pore size; open circles, 10kDa pore size; closed squares: 15kDa pore 6\nsize. The solid black line is the best fit regression (Equation (1)). The error bars represent ±1 7\nstandard deviation in log aFe3+ due to uncertainty in the 'active' proportion of DOM. The 8\ndashed lines show the trends in activities predicted using standard solubility products of 105.09\n(upper) and 102.5 (lower). 10\nFig 3 Comparison of predicted Fe3+ activities in this study with literature solubility studies. 11\nThe shaded area encompasses the 95% confidence interval on the prediction of Fe3+ activity 12\nvariation with pH, at 298K, according to Equations (2) and (4). Solid line: prediction of Fe3+13\nactivity variation with pH in the experiments of Byrne et al. (2005), aging time 15–60 minutes: 14\naFe3+ = 3.19(±0.06)−2.73(±0.01)·pH. Dashed line: prediction of Fe3+ activity variation with pH 15\nin the experiments of Byrne and Luo (2000), aging time 15–60 minutes: 16\naFe3+ = 2.97(±0.06)−2.86(±0.01)·pH. Confidence intervals for these two lines are omitted for 17\nclarity. Symbols: prediction of Fe3+ activity in the experiments of Liu and Millero (1999), aging 18\ntime 3 hours (squares) and 21 days (circles).19\nFig 4 Concentrations of Fe in ultrafiltrates and dialysates of literature studies (Section 4.4) 20\ncompared with Fe(III) in truly dissolved form, calculated using Equation (2) and WHAM\/Model 21\nVI. a: surface waters, not correcting aFe3+ for temperature. b: surface waters, correcting aFe3+22\nfor temperature. c: soil\/ground waters, not correcting aFe3+ for temperature. d: soil\/ground 23\nwaters, correcting aFe3+ for temperature. Error bars represent ±1 standard deviation in 24\npredicted log [truly dissolved Fe(III)] due to uncertainty in the 'active' proportion of DOM. The 25\n1:1 correspondence is indicated by a solid line. The dashed lines enclose the region 26\ncorresponding to a factor of three or lower discrepancy between observation and prediction.27\nFig 5 Top (a): observed Fe(III):DOM ratios in filtrates (0.7µm, open symbols) and dialysates 28\n(closed symbols) of UK waters. Error bars represent ±1 standard deviation of dialysate 29\nFe(III):DOM ratios calculated as the mean of multiple experiments. The solid line is a generic 30\nWHAM\/Model VI prediction of the Fe(III):DOM ratio based on predictions of aFe3+ calculated 31\nusing Equation (1). Bottom (b): observed total Fe(III):DOM ratios in filtrates (0.7µm) of 32\nsamples taken during long term monitoring of Pool X (closed squares) and Pool Y (open 33\nsquares) from 1993–2001.34\nFig 6 Filterable (0.45µm) Fe:DOM ratios in surface water samples collected as part of the 35\nLOIS project. a: River Trent; b: River Derwent; c: River Calder; d: River Ouse. The solid line is 36\nthe predicted Fe:DOM ratio, including Fe(II).37\n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n33\nFig 7 The predicted effect of neutralisation of an Fe(III) and DOM–rich water on the 1\nconcentration of 'truly dissolved' Fe(III). Speciation of a water having the composition of the 2\nRiver Hodder of 13 November 2003, at a temperature of 283K, as the pH is increased by 3\nincreasing the total Ca concentration.4\nFigure 1\nClick here to download high resolution image\nFigure 2\nClick here to download high resolution image\nFigure 3\nClick here to download high resolution image\nFigure 4\nClick here to download high resolution image\nFigure 5\nClick here to download high resolution image\nFigure 6\nClick here to download high resolution image\nFigure 7\nClick here to download high resolution image\nConcentrations of Fe, organic C and Al in 3.5kDa dialysates\nSample site Latitude\/Longitude Sample date (dd\/mm\/yy) Fe (ug dm-3) Fe(II) (ug dm-3)\nBlack Burn (BB) 54º47'11\"N 2º27'20\"W 2\/26\/2004 <2 2\nGais Gill (GG) 54º24'17\"N 2º26'15\"W 1\/8\/2004 19 9\nPool X (PX) 54º39'45\"N 2º27'43\"W 9\/25\/2003 174 not measured\nPool X (PX) 54º39'45\"N 2º27'43\"W 1\/22\/2004 49 10\nPool Y (PY) 54º39'45\"N 2º27'43\"W 9\/25\/2003 12 not measured\nRiver Eden (RE) 54º23'13\"N 2º20'14\"W 1\/8\/2004 15 6\nRiver Hodder (RH) 54º 1'34\"N 2º27'12\"W 11\/17\/2003 72 <2\nRiver Hodder (RH) 54º 1'34\"N 2º27'12\"W 1\/29\/2004 5 5\nRiver Lune (RL) 54º 4'34\"N 2º43'50\"W 1\/29\/2004 not measured not measured\nRiver Ribble (RR) 53º45'56\"N 2º38'25\"W 11\/24\/2003 11 <2\nRiver Ribble (RR) 53º45'56\"N 2º38'25\"W 1\/29\/2004 9 5\nRiver Tees (RT) 54º39' 2\"N 2º10'36\"W 2\/26\/2004 3 3\nRoudsea Wood (RW) 51º31' 6\"N 4º24'30\"W 11\/14\/2003 39 <2\nRoudsea Wood (RW) 51º31' 6\"N 4º24'30\"W 2\/18\/2004 40 <2\nWad Hazel Sike (WHS) 54º42'38\"N 2º19'11\"W 2\/26\/2004 13 6\nWhitray Beck tributary (WB) 54º 3'11\"N 2º29'36\"W 11\/17\/2003 17 2\nWhitray Beck tributary (WB) 54º 3'11\"N 2º29'36\"W 1\/29\/2004 20 <2\nConcentrations of Fe, organic C and Al in 3.5kDa dialysates\nClick here to download table: Data 2.xls\nDOC (mg dm-3) monomeric Al (ug dm-3)\n2.12 19\n3.65 3\n8.61 354\n4.1 50\n4.55 13\n2.64 15\n3.93 60\n1.07 8\n1.45 13\n4.32 10\n3.67 16\n2.06 15\n7.61 9\n2.29 11\n1.93 18\n1.19 9\n2.83 12\nConcentrations of Fe, organic C and Al in 10kDa dialysates\nSample site Latitude\/Longitude Sample date (dd\/mm\/yy) Fe (ug dm-3) Fe(II) (ug dm-3)\nBlack Burn (BB) 54º47'11\"N 2º27'20\"W 2\/26\/2004 2 6\nGais Gill (GG) 54º24'17\"N 2º26'15\"W 1\/8\/2004 9 5\nPool X (PX) 54º39'45\"N 2º27'43\"W 9\/25\/2003 299 <2\nPool X (PX) 54º39'45\"N 2º27'43\"W 1\/22\/2004 107 32\nPool Y (PY) 54º39'45\"N 2º27'43\"W 9\/25\/2003 15 <2\nPool Y (PY) 54º39'45\"N 2º27'43\"W 1\/22\/2004 21 <2\nRiver Eden (RE) 54º23'13\"N 2º20'14\"W 1\/8\/2004 16 8\nRiver Hodder (RH) 54º 1'34\"N 2º27'12\"W 11\/17\/2003 128 13\nRiver Hodder (RH) 54º 1'34\"N 2º27'12\"W 1\/29\/2004 4 4\nRiver Lune (RL) 54º 4'34\"N 2º43'50\"W 11\/24\/2003 18 <2\nRiver Lune (RL) 54º 4'34\"N 2º43'50\"W 1\/29\/2004 4 2\nRiver Ribble (RR) 53º45'56\"N 2º38'25\"W 11\/24\/2003 23 <2\nRiver Ribble (RR) 53º45'56\"N 2º38'25\"W 1\/29\/2004 6 <2\nRiver Tees (RT) 54º39' 2\"N 2º10'36\"W 2\/26\/2004 6 9\nRoudsea Wood (RW) 51º31' 6\"N 4º24'30\"W 11\/14\/2003 81 <2\nRoudsea Wood (RW) 51º31' 6\"N 4º24'30\"W 2\/18\/2004 26 <2\nWad Hazel Sike (WHS) 54º42'38\"N 2º19'11\"W 2\/26\/2004 7 7\nWhitray Beck tributary (WB) 54º 3'11\"N 2º29'36\"W 11\/17\/2003 34 <2\nWhitray Beck tributary (WB) 54º 3'11\"N 2º29'36\"W 1\/29\/2004 8 3\nConcentrations of Fe, organic C and Al in 10kDa dialysates\nClick here to download table: Data 3.xls\nDOC (mg dm-3) monomeric Al (ug dm-3)\n2.93 20\n2.21 5\n11.24 381\n6.06 69\n7.77 22\n4.02 13\n2.55 10\n5.97 90\n0.98 8\n3.14 12\n2.12 11\n5.32 14\n4.77 18\n2.94 17\n15.2 10\n5.78 11\n2.91 20\n3.25 34\n1.35 11\nConcentrations of Fe, organic C and Al in 15kDa dialysates\nSample site Latitude\/Longitude Sample date (dd\/mm\/yy) Fe (ug dm-3) Fe(II) (ug dm-3)\nBlack Burn (BB) 54º47'11\"N 2º27'20\"W 2\/26\/2004 4 7\nGais Gill (GG) 54º24'17\"N 2º26'15\"W 1\/8\/2004 not measured not measured\nPool X (PX) 54º39'45\"N 2º27'43\"W 9\/25\/2003 not measured not measured\nPool X (PX) 54º39'45\"N 2º27'43\"W 1\/22\/2004 not measured not measured\nPool Y (PY) 54º39'45\"N 2º27'43\"W 9\/25\/2003 not measured not measured\nPool Y (PY) 54º39'45\"N 2º27'43\"W 1\/22\/2004 not measured not measured\nRiver Eden (RE) 54º23'13\"N 2º20'14\"W 1\/8\/2004 not measured not measured\nRiver Hodder (RH) 54º 1'34\"N 2º27'12\"W 11\/17\/2003 not measured not measured\nRiver Hodder (RH) 54º 1'34\"N 2º27'12\"W 1\/29\/2004 5 3\nRiver Lune (RL) 54º 4'34\"N 2º43'50\"W 11\/24\/2003 not measured not measured\nRiver Lune (RL) 54º 4'34\"N 2º43'50\"W 1\/29\/2004 5 3\nRiver Ribble (RR) 53º45'56\"N 2º38'25\"W 11\/24\/2003 not measured not measured\nRiver Ribble (RR) 53º45'56\"N 2º38'25\"W 1\/29\/2004 no sample no sample\nRiver Tees (RT) 54º39' 2\"N 2º10'36\"W 2\/26\/2004 2 8\nRoudsea Wood (RW) 51º31' 6\"N 4º24'30\"W 11\/14\/2003 not measured not measured\nRoudsea Wood (RW) 51º31' 6\"N 4º24'30\"W 2\/18\/2004 26 <2\nWad Hazel Sike (WHS) 54º42'38\"N 2º19'11\"W 2\/26\/2004 4 6\nWhitray Beck tributary (WB) 54º 3'11\"N 2º29'36\"W 11\/17\/2003 not measured not measured\nWhitray Beck tributary (WB) 54º 3'11\"N 2º29'36\"W 1\/29\/2004 6 <2\nConcentrations of Fe, organic C and Al in 15kDa dialysates\nClick here to download table: Data 4.xls\nDOC (mg dm-3) monomeric Al (ug dm-3)\n2.77 18\nnot measured not measured\nnot measured not measured\nnot measured not measured\nnot measured not measured\nnot measured not measured\nnot measured not measured\nnot measured not measured\n0.9 9\nnot measured not measured\n2.32 4\nnot measured not measured\nno sample no sample\n2.8 17\nnot measured not measured\n6.01 11\n2.92 25\nnot measured not measured\n1.85 11\nData1. Major water chemistry parameters at sampling sites.\nData2. Concentrations of Fe, organic C and Al in 3.5kDa dialysates.\nData3. Concentrations of Fe, organic C and Al in 10Da dialysates.\nData4. Concentrations of Fe, organic C and Al in 15kDa dialysates.\nData5. Generic predicted ratios of Fe(III):Dom for pH 3.0 to 9.0.\nCaptions for Electronic Supplementary Information\nClick here to download table: ESI Captions.txt\nMajor water chemistry parameters at sampling sites\nSample site Latitude\/Longitude Sample date  (dd\/mm\/yy) pHfield\nBlack Burn (BB) 54º47'11\"N 2º27'20\"W 2\/26\/2004 7.94\nGais Gill (GG) 54º24'17\"N 2º26'15\"W 1\/8\/2004 7.24\nPool X (PX) 54º39'45\"N 2º27'43\"W 9\/25\/2003 4.16\nPool X (PX) 54º39'45\"N 2º27'43\"W 1\/22\/2004 4.33\nPool Y (PY) 54º39'45\"N 2º27'43\"W 9\/25\/2003 5.82\nPool Y (PY) 54º39'45\"N 2º27'43\"W 1\/22\/2004 6.16\nRiver Eden (RE) 54º23'13\"N 2º20'14\"W 1\/8\/2004 7.34\nRiver Hodder (RH) 54º 1'34\"N 2º27'12\"W 11\/17\/2003 4.35\nRiver Hodder (RH) 54º 1'34\"N 2º27'12\"W 1\/29\/2004 6.57\nRiver Lune (RL) 54º 4'34\"N 2º43'50\"W 11\/24\/2003 7.79\nRiver Lune (RL) 54º 4'34\"N 2º43'50\"W 1\/29\/2004 7.76\nRiver Ribble (RR) 53º45'56\"N 2º38'25\"W 11\/24\/2003 8.14\nRiver Ribble (RR) 53º45'56\"N 2º38'25\"W 1\/29\/2004 8.03\nRiver Tees (RT) 54º39' 2\"N 2º10'36\"W 2\/26\/2004 8.05\nRoudsea Wood (RW) 51º31' 6\"N 4º24'30\"W 11\/14\/2003 6.57\nRoudsea Wood (RW) 51º31' 6\"N 4º24'30\"W 2\/18\/2004 6.82\nWad Hazel Sike (WHS) 54º42'38\"N 2º19'11\"W 2\/26\/2004 7.61\nWhitray Beck tributary (WB) 54º 3'11\"N 2º29'36\"W 11\/17\/2003 6.37\nWhitray Beck tributary (WB) 54º 3'11\"N 2º29'36\"W 1\/29\/2004 7.18\nMajor water chemistry parameters at sampling sites\nClick here to download table: Data 1.xls\npH final DOC (mg dm-3) Na (ueq dm-3) Mg (ueq dm-3) Ca (ueq dm-3) Cl (ueq dm-3) NO3 (ueq dm-3) SO4 (ueq dm-3)\n8.03 5.8 173 91 590 177 14 73\n7.25 6.9 130 52 97 118 2 33\n4.28 20.6 202 42 148 158 <1 258\n4.51 17.2 105 8 23 99 <1 19\n6.92 19.4 153 24 241 154 <1 137\n7.32 12 119 15 177 101 6 38\n7.56 10.2 145 32 202 127 11 31\n4.62 19.4 188 44 31 197 17 53\n6.8 3.2 208 65 54 189 28 68\n7.6 3.9 322 128 848 338 106 115\n8.02 1.7 700 140 900 676 151 115\n7.74 7.4 943 193 1395 592 197 292\n7.96 5.4 3304 279 1440 3099 265 not measured\n8.03 5.8 176 75 558 192 18 57\n7.41 40.3 1226 172 538 1380 14 135\n7.4 24.6 535 82 440 451 10 58\n7.76 5.8 114 31 348 118 8 32\n6.3 10.9 217 63 59 231 4 54\n7.36 2.8 230 96 91 200 11 58\nalklinity (ueq dm-3) total Fe (ug dm-3) total Fe(II) (ug dm-3) filtered Fe (ug dm-3) filtered Fe(II) (ug dm-3)\n1090 191 5 182 30\n203 108 9 91 <2\n0 642 <2 not measured not measured\n0 441 4 365 6\n148 941 4 not measured not measured\n230 314 5 188 <2\n334 389 19 325 <2\n0 818 <2 596 31\n78 116 <2 102 <2\n1565 83 <2 73 <2\n1599 67 <2 48 <2\n2503 195 <2 128 <2\n2668 199 <2 94 <2\n1024 186 4 173 32\n732 387 5 376 13\n790 298 <2 247 5\n594 435 8 372 26\n61 697 <2 689 21\n240 157 <2 129 <2\ntotal monomeric Al  (ug dm-3) total acid-reactive Al (ug dm-3)\n16 40\n5 26\n427 409\n160 132\n60 181\n55 113\n24 52\n63 257\n33 76\n15 17\n4 15\n27 27\n13 31\n14 24\n82 28\n84 110\n5 56\n39 115\n11 36\nGeneric predicted ratios of Fe(III):Dom for pH 3.0 to 9.0\npH Fe(III):DOM (mol Fe(III) [g DOM]-1 Fe(III):DOM (µg Fe(III) [mg DOM]-1)\n3.0 8.96E-03 1001\n3.1 5.61E-03 627\n3.2 3.61E-03 403\n3.3 2.39E-03 267\n3.4 1.62E-03 181\n3.5 1.13E-03 126\n3.6 8.15E-04 91.1\n3.7 6.06E-04 67.7\n3.8 4.63E-04 51.7\n3.9 3.62E-04 40.4\n4.0 2.90E-04 32.4\n4.1 2.37E-04 26.4\n4.2 1.97E-04 22.0\n4.3 1.66E-04 18.5\n4.4 1.42E-04 15.8\n4.5 1.23E-04 13.7\n4.6 1.07E-04 12.0\n4.7 9.45E-05 10.6\n4.8 8.42E-05 9.4\n4.9 7.59E-05 8.5\n5.0 6.91E-05 7.7\n5.1 6.36E-05 7.1\n5.2 5.88E-05 6.6\n5.3 5.49E-05 6.1\n5.4 5.15E-05 5.7\n5.5 4.84E-05 5.4\n5.6 4.58E-05 5.1\n5.7 4.33E-05 4.8\n5.8 4.10E-05 4.6\n5.9 3.90E-05 4.4\n6.0 3.71E-05 4.1\n6.1 3.54E-05 4.0\n6.2 3.38E-05 3.8\n6.3 3.23E-05 3.6\n6.4 3.10E-05 3.5\n6.5 2.98E-05 3.3\n6.6 2.90E-05 3.2\n6.7 2.83E-05 3.2\n6.8 2.81E-05 3.1\n6.9 2.81E-05 3.1\n7.0 2.81E-05 3.1\n7.1 2.82E-05 3.1\n7.2 2.79E-05 3.1\n7.3 2.73E-05 3.0\n7.4 2.62E-05 2.9\n7.5 2.49E-05 2.8\n7.6 2.33E-05 2.6\n7.7 2.15E-05 2.4\n7.8 1.97E-05 2.2\n7.9 1.77E-05 2.0\n8.0 1.59E-05 1.8\n8.1 1.42E-05 1.6\n8.2 1.26E-05 1.4\n8.3 1.13E-05 1.3\n8.4 1.02E-05 1.1\n8.5 9.36E-06 1.0\n8.6 8.68E-06 1.0\n8.7 8.15E-06 0.91\n8.8 7.75E-06 0.87\n8.9 7.41E-06 0.83\nGeneric predicted ratios of Fe(III) to DOM for pH 3.0 to 9.0\nClick here to download table: Data 5.xls\n9.0 7.12E-06 0.80\n"}