{"doi":"10.1103\/PhysRevLett.94.033201","coreId":"66152","oai":"oai:dro.dur.ac.uk.OAI2:2854","identifiers":["oai:dro.dur.ac.uk.OAI2:2854","10.1103\/PhysRevLett.94.033201"],"title":"Ultracold Li+Li-2 collisions : Bosonic and fermionic cases.","authors":["Cvitas, M. T.","Soldan, P.","Hutson, J. M.","Honvault, P.","Launay, J. M."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-01","abstract":"We have carried out quantum dynamical calculations of vibrational quenching in Li  Li2 collisions for\\ud\nboth bosonic 7Li and fermionic 6Li. These are the first ever such calculations involving fermionic atoms.\\ud\nWe find that for the low initial vibrational states considered here (v  3), the quenching rates are not\\ud\nsuppressed for fermionic atoms. This contrasts with the situation found experimentally for molecules\\ud\nformed via Feshbach resonances in very high vibrational states","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66152.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/2854\/1\/2854.pdf","pdfHashValue":"68782945a44dc7bb489288ed67f35a01a08b270c","publisher":"American Physical Society","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:2854<\/identifier><datestamp>\n      2010-09-20T15:10:45Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Ultracold Li+Li-2 collisions : Bosonic and fermionic cases.<\/dc:title><dc:creator>\n        Cvitas, M. T.<\/dc:creator><dc:creator>\n        Soldan, P.<\/dc:creator><dc:creator>\n        Hutson, J. M.<\/dc:creator><dc:creator>\n        Honvault, P.<\/dc:creator><dc:creator>\n        Launay, J. M.<\/dc:creator><dc:description>\n        We have carried out quantum dynamical calculations of vibrational quenching in Li  Li2 collisions for\\ud\nboth bosonic 7Li and fermionic 6Li. These are the first ever such calculations involving fermionic atoms.\\ud\nWe find that for the low initial vibrational states considered here (v  3), the quenching rates are not\\ud\nsuppressed for fermionic atoms. This contrasts with the situation found experimentally for molecules\\ud\nformed via Feshbach resonances in very high vibrational states.<\/dc:description><dc:publisher>\n        American Physical Society<\/dc:publisher><dc:source>\n        Physical review letters, 2005, Vol.94(3), pp.033201 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2005-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:2854<\/dc:identifier><dc:identifier>\n        issn:0031-9007<\/dc:identifier><dc:identifier>\n        issn: 1079-7114<\/dc:identifier><dc:identifier>\n        doi:10.1103\/PhysRevLett.94.033201<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/2854\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1103\/PhysRevLett.94.033201<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/2854\/1\/2854.pdf<\/dc:identifier><dc:rights>\n        © 2005 by The American Physical Society. All rights reserved.<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0031-9007"," 1079-7114","issn:0031-9007","issn: 1079-7114"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2005,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n20 September 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nCvitas, M. T. and Soldan, P. and Hutson, J. M. and Honvault, P. and Launay, J. M. (2005) ’Ultracold Li+Li-2\ncollisions : Bosonic and fermionic cases.’, Physical review letters., 94 (3). 033201.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1103\/PhysRevLett.94.033201\nPublisher’s copyright statement:\n2005 by The American Physical Society. All rights reserved.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nUltracold Li\u0001Li2 Collisions: Bosonic and Fermionic Cases\nMarko T. Cvitasˇ, Pavel Solda´n, and Jeremy M. Hutson\nDepartment of Chemistry, University of Durham, South Road, Durham DH1 3LE, United Kingdom\nPascal Honvault and Jean-Michel Launay\nUMR 6627 du CNRS, Laboratoire de Physique des Atomes, Lasers, Mole´cules et Surfaces, Universite´ de Rennes, Rennes, France\n(Received 29 September 2004; published 27 January 2005)\nWe have carried out quantum dynamical calculations of vibrational quenching in Li\u0001 Li2 collisions for\nboth bosonic 7Li and fermionic 6Li. These are the first ever such calculations involving fermionic atoms.\nWe find that for the low initial vibrational states considered here (v \u0002 3), the quenching rates are not\nsuppressed for fermionic atoms. This contrasts with the situation found experimentally for molecules\nformed via Feshbach resonances in very high vibrational states.\nDOI: 10.1103\/PhysRevLett.94.033201 PACS numbers: 34.20.Mq, 03.75.Ss, 33.80.Ps, 34.50.Lf\nThere is at present great interest in the properties of\ncold and ultracold molecules. At the end of 2003, three\ngroups [1–3] created long-lived molecular Bose-Einstein\ncondensates from ultracold atomic gases by making use of\nmagnetically tunable Feshbach resonances. The molecules\nare formed in highly excited vibrational states, and any\nvibrational relaxation will result in trap loss. A crucial\nbreakthrough was the use of fermionic isotopes of the\natomic gases (6Li, 40K) tuned to large positive scattering\nlengths; it was found that in this case the atom-molecule\nand molecule-molecule inelastic collisions are strongly\nsuppressed [4–7], and the molecular cloud consisting\nof weakly bound dimers of fermions exhibits a remarkable\nstability against collisional decay. By contrast, for weakly\nbound dimers of bosonic atoms the vibrational relaxation\nis fast, so that the corresponding molecular cloud decays\nquickly and quantum degeneracy can be achieved only\ntransiently [8–12]. Petrov et al. [13] have explained\nthe important difference between molecular gases of\nweakly bound dimers formed from bosonic and fermionic\natoms in terms of different quantum statistics for the\natoms.\nIn this Letter, we carry out the first full quantum dynam-\nics calculations for spin-polarized collisions of ultracold\nhomonuclear molecules for Li\u0001 Li2 in both the bosonic\n(7Li) and fermionic (6Li) cases. We find that for low-lying\nvibrational states there is no systematic suppression of the\nvibrational relaxation (quenching) rates for fermions, even\nwhen the scattering length is large and positive. The analy-\nsis of Petrov et al. [13] applies only when the scattering\nlength is large and positive and the molecules are in their\nhighest-lying vibrational state.\nQuantum scattering calculations require accurate poten-\ntial energy surfaces. We have previously shown that the\ninteraction potential for spin-polarized (quartet) Li\u0001 Li2\nis highly nonadditive [14], with a well depth 4 times that of\nthe sum of Li-Li pair potentials. In the present work, we\nuse a global Li3 potential obtained from all-electron\ncoupled-cluster electronic structure calculations, which\nwill be described in detail elsewhere [15]. In parallel\nwork, Colavecchia et al. [16] have obtained another poten-\ntial surface based on pseudopotential calculations.\nHowever, we chose to use our own surface in the present\nwork because it takes better account of some features of the\npotential. In particular, as pointed out in Ref. [14], there is\na seam of conical intersections at collinear geometries,\nbetween the 4\n surface that is the ground state at long\nrange and a 4\u000b surface that becomes the ground state\ninside r1 \u0003 r2 \u0003 3:1 \rA. The resulting cusp drops to ener-\ngies very close to the atom-diatom threshold, as shown in\nFig. 1, and so may play a significant role in the dynamics.\nFIG. 1 (color online). A cut through Li3 quartet surface at\ncollinear geometries, showing the seam between 4\n and 4\u000b\nstates. Contours are labeled in cm\u00041. The two minima are at\ndepths of 760 and 950 cm\u00041.\nPRL 94, 033201 (2005) P H Y S I C A L R E V I E W L E T T E R S week ending28 JANUARY 2005\n0031-9007=05=94(3)=033201(4)$23.00 033201-1  2005 The American Physical Society\nOur potential takes better account of this seam than that of\nref. [16].\nThe methods we use to carry out quantum dynamics\ncalculations on systems of this type have been described in\nour previous work on Na\u0001 Na2 [17,18] and elsewhere in\nthe context of thermal reactive scattering [19], so a brief\nsummary suffices here. The potential energy surface is\nbarrierless, so that it is essential to take reactive (atom\nexchange) collisions into account. The positions of the\nnuclei are described in hyperspherical democratic coordi-\nnates. The configuration space is divided into inner and\nouter regions, and the boundary between them is placed at\na distance such that couplings due to the residual atom-\ndiatom interaction can be neglected outside the boundary.\nIn the inner region (hyperradius \u0005 \u0002 45a0 in the present\ncase), we obtain the wave function for nuclear motion by\npropagating a set of coupled equations in a diabatic-by-\nsector basis that is obtained by diagonalizing a fixed-\u0005\nreference Hamiltonian in a basis set of pseudohyperspher-\nical harmonics. In the outer region, we use the Arthurs-\nDalgarno formalism [20], which is based on Jacobi coor-\ndinates, and compute by inwards integration regular and\nirregular solutions of a radial Schro¨dinger equation which\nincludes the isotropic (R\u00046) part of the interaction.\nMatching between wave functions in the inner and outer\nregions yields the scattering S matrix.\nThe difference between the 6Li and 7Li cases is imple-\nmented by selecting the pseudohyperspherical harmonic\nbasis functions included in the basis set. For both bosons\nand fermions, we consider spin-stretched states of all three\natoms involved (states with jMFj \u0003 F \u0003 Fmax). For such\nstates the nuclear spin wave function is symmetric with\nrespect to any exchange of nuclei. However, the electronic\nwave function for the quartet state is antisymmetric with\nrespect to exchange of nuclei. Thus, to satisfy the Pauli\nprinciple, the wave function for nuclear motion must be\nantisymmetric with respect to exchange of bosonic nuclei\n(for fermionic alkali metal atoms) and symmetric with\nrespect to exchange of fermionic nuclei (for bosonic alkali\nmetal atoms).\nAsymptotically, the hyperspherical functions correlate\nwith atom-diatom functions; the diatom functions for\nHund’s case (b), which is appropriate for Li2\u00063\n\u0001u \u0007, are\nlabeled with a vibrational quantum number v and a me-\nchanical rotational quantum number n; n couples with the\ndiatomic electron spin s \u0003 1 to give a resultant j, but for\nLi2 the splittings between states of the same n but different\nj are very small and are neglected here. In the 3\n\u0001u state,\nonly even n is allowed for 7Li2 and only odd n for 6Li2. In\nthe outer region, we include rovibrational states with v \u0003\n0; 1; . . . ; 7 with all even rotational levels up to nmax \u0003\n32; 30; 28; 24; 22; 18; 14; 10 for bosonic 7Li2 and rovibra-\ntional states with v \u0003 0; 1; . . . ; 7 with all odd rotational\nlevels up to nmax \u0003 31; 27; 25; 23; 19; 17; 13; 7 for fermi-\nonic 6Li2. In the inner region, the number of coupled\nequations for bosonic atoms varies from 97 for total angu-\nlar momentum J \u0003 0 to 827 for J \u0003 10, and for fermionic\natoms it varies from 85 for J \u0003 0\u0001 to 782 for J \u0003 11\u0004.\nWe have calculated the low-energy elastic and total\nquenching cross sections \u0011\u0006E\u0007 for 7Li2 colliding with 7Li\nand for 6Li2 colliding with 6Li, for bosons and fermions in\nall allowed initial states \u0006v; n\u0007 with v \u0002 3 and n \u0002 11. The\ncross sections for v \u0003 1 (with n \u0003 0 for 7Li2 and n \u0003 1 for\n6Li2) are shown as a function of collision energy E in\nFigs. 2 and 3, together with the contributions from indi-\nvidual partial waves J. The partial wave sums are con-\nverged up to 500 mK for Jmax \u0003 10. For v \u0003 1, both the\nelastic and inelastic cross sections are slightly smaller for\n6Li than for 7Li at energies below 1 mK. However, the\ndifference is only about a factor of 2, and it is not due to the\ndifference between boson and fermion symmetries: for\nother values of v and n the ratio is often reversed.\nAt very low energies (up to about 1 mK), the cross\nsections are dominated by collisions with orbital angular\nmomentum l \u0003 0, for which there are no centrifugal bar-\nriers. A consequence of the symmetry constraints is that\ntotal angular momentum J \u0003 0 has an l \u0003 0 channel for\n7Li\u0001 7Li2 but not for 6Li\u0001 6Li2; in the latter case the\nlowest partial wave containing l \u0003 0 is J \u0003 1\u0004, where the\nsuperscript indicates odd parity. For this reason, low-\nenergy calculations on 6Li are significantly more expensive\nthan those on 7Li.\nFor nearly all initial v and n, and for both bosons and\nfermions, the ratio of inelastic to elastic cross sections is\ngreater than 30 at E \u0003 1 \u0014K and remains greater than 1\nthroughout the Wigner regime (i.e., up to about 1 mK). The\nonly exceptions to this are for rotational quenching of the\n\u0006v; n\u0007 \u0003 \u00060; 2\u0007 state for bosons (ratio 4.3 at 1 \u0014K) and the\n\u00060; 3\u0007 state for fermions (ratio 7.5), for which there is only\none inelastic channel with l \u0003 0.\nScattering calculations for Li\u0001 Li2 are converged up to\nabout 10\u00044 K using just a single partial wave (J \u0003 0 for\n7Li and J \u0003 1\u0004 for 6Li). At higher energies, other partial\nwaves start to contribute significantly. For 7Li the contri-\nbutions decrease monotonically with J at low energies\nbecause of centrifugal barriers corresponding to l \u0003 J for\nn \u0003 0. For 6Li, the situation is slightly different: each\npartial wave is made up of a ‘‘parity favored’’ block\n[with parity \u0006\u00041\u0007J] and a ‘‘parity unfavored’’ block; the\nformer includes an n \u0003 1 channel with l \u0003 J\u0004 1, while\nfor the latter the lowest l is l \u0003 J.\nAt collision energies below the centrifugal barrier, the\npartial cross sections follow Wigner laws, \u0011linel \b El\u00041=2.\nSince kinel\u0006E\u0007 \u0003 vcoll\u0011inel\u0006E\u0007, where vcoll \u0003 \u00062E=\u0014\u00071=2 is\nthe collision velocity and \u0014 is the atom-diatom reduced\nmass, the inelastic rate coefficient is independent of E at\nlimitingly low energies. For initial v \u0003 1, the results in\nFigs. 2 and 3 give calculated limiting values kinel \u0003 5:6\t\n10\u000410 cm3 s\u00041 for bosons and 2:8\t 10\u000410 cm3 s\u00041 for\nfermions.\nPRL 94, 033201 (2005) P H Y S I C A L R E V I E W L E T T E R S week ending28 JANUARY 2005\n033201-2\nAt energies above the barrier height, the inelastic prob-\nabilities saturate at values close to 1 and the energy depen-\ndence in each partial wave is then governed by the\nprefactor E\u00041 that multiplies the S-matrix term in the\nexpression for the cross section. At energies high enough\nthat several partial waves (typically >3) contribute signifi-\ncantly to the overall cross sections, the energy dependence\nis described approximately by classical Langevin capture\ntheory [21],\nkinel\u0006E\u0007 \u0003 3\u0017\u00062E=\u0014\u00071=2\n\u0001\nC6\n4E\n\u0002\n1=3\n; (1)\nwhere C6 \u0003 3086Eha60 is the isotropic atom-diatom dis-\npersion coefficient. The Langevin result is compared with\nthe full quantum results for the quenching rates for v \u0003 1\nand 2 in Fig. 4; it may be seen that the Langevin and full\nquantum results agree semiquantitatively at collision en-\nergies above about 10 mK for both bosons and fermions.\nThe atom-atom part of the potential used in our calcu-\nlations gives triplet scattering lengths that are approxi-\nmately correct for both 7Li (\u000426:35a0) and 6Li\n(\u00041531a0). However, at the magnetic field used in the\nmolecule production experiments [1], the spin states in-\nvolved had a \n \u00013500a0, and it is important to establish\nwhether fermionic suppression of quenching rates occurs\nfor such large positive atom-atom scattering lengths. We\nhave therefore repeated the calculations for energies E \u0003\n1 \u0014K and 1 nK with the short-range part of the two-body\npotential adjusted to reproduce a \n 3500a0. This was done\nby adding a small term A\u0006r\u0004 re\u00072 to each atom-atom\npotential for r < re \u0003 7:8852a0, while keeping the three-\nbody potential (and the long-range part of the two-body\npotential) fixed. Slightly different adjustments were\nneeded for 7Li (A \u0003 \u000427:6 cm\u00041a\u000420 ) and 7Li (A \u0003\n\u00041:782 cm\u00041a\u000420 ). Under these circumstances the calcu-\nlated quenching rates for initial v \u0003 1 at limitingly low\nenergy are 7:7\t 10\u000411 cm3 s\u00041 for 7Li and 2:9\t\n10\u000410 cm3 s\u00041 for 6Li. This confirms that there is no fer-\nmionic suppression for the low-lying states that we\nconsider.\n10−5 10−4 10−3 10−2 10−1\nCollision energy  (K) \n10−15\n10−14\n10−13\n10−12\n10−11\nCr\nos\ns \nse\nct\nio\nn \n (c\nm2\n)\nTOTAL\nJ=1\nJ=2 J=0\nJ=3−10\nELASTIC: 6Li + 6Li2\n10−5 10−4 10−3 10−2 10−1\nCollision energy (K) \n10−17\n10−16\n10−15\n10−14\n10−13\n10−12\n10−11\n10−10\nCr\nos\ns \nse\nct\nio\nn \n(cm\n2 )\nTOTAL\nJ=1J=2\nJ=0\nJ=3\nINELASTIC: 6Li + 6Li2\nJ=4−10\nFIG. 3. Elastic cross sections (upper panel) and inelastic cross\nsections (lower panel) for 6Li\u0001 6Li2 (vi \u0003 1; ni \u0003 1), with\ncontributions from individual partial waves. The vertical lines\nindicate centrifugal barrier heights for l \u000b 1.\n10−5 10−4 10−3 10−2 10−1\nCollision energy (K)\n10−15\n10−14\n10−13\n10−12\n10−11\nCr\nos\ns \nse\nct\nio\nn \n(cm\n2 ) TOTAL\nJ=0\nJ=1\nJ=2−10\nELASTIC: 7Li + 7Li2\n10−5 10−4 10−3 10−2 10−1\nCollision energy (K)\n10−17\n10−16\n10−15\n10−14\n10−13\n10−12\n10−11\n10−10\nCr\nos\ns \nse\nct\nio\nn \n (c\nm2\n) J=1\nJ=3\nJ=0\nJ=4−10\nJ=2\nTOTAL\nINELASTIC: 7Li + 7Li2\nFIG. 2. Elastic cross sections (upper panel) and inelastic cross\nsections (lower panel) for 7Li\u0001 7Li2 (vi \u0003 1; ni \u0003 0), with\ncontributions from individual partial waves. The vertical lines\nindicate centrifugal barrier heights for l \u000b 1.\nPRL 94, 033201 (2005) P H Y S I C A L R E V I E W L E T T E R S week ending28 JANUARY 2005\n033201-3\nThe Langevin result, Eq. (1), may be used to predict\ninelastic rates for other atom-diatom alkali systems in spin-\npolarized states. Outside the Wigner regime, the inelastic\nrate coefficients for different systems will be proportional\nto C1=36 =\u0014\n1=2\n. The resulting inelastic rate coefficients for\n23Na, 40K, 87Rb, and 133Cs are lower than that for lithium\nby factors of 1.81, 1.75, 2.43, and 2.65, respectively, using\nC6 coefficients equal to twice the atomic dispersion coef-\nficients from Ref. [22]. The lower bound of applicability of\nthe model may be estimated from the centrifugal barrier\nheights for l \u0003 3, which are 6.86, 1.89, 0.537, and\n0.235 mK, for Na, K, Rb, Cs, respectively.\nIn conclusion, we have carried out full quantum dynam-\nics calculations of vibrational relaxation (quenching) of\n7Li2 by 7Li and of 6Li2 by 6Li, taking full account of the\nboson and fermion symmetries. We find that for low initial\nvibrational states of the molecules (v \u0002 3), there is no\nsystematic suppression of the quenching rates for mole-\ncules formed from fermionic atoms, even when the atom-\natom scattering length is large and positive. This contrasts\nwith the situation for molecules formed in the highest\nvibrationally excited state [1–3].\nCollisions of molecules involving mixed isotopes offer\nfascinating new possibilities and in some cases allow iden-\ntifiable chemical reactions even between ground-state\nmolecules. For example, the reaction 7Li\u0001 6Li2 \u0006v \u0003\n0\u0007 ! 6Li\u0001 6Li7Li \u0006v \u0003 0\u0007 is exothermic by 2.643 K be-\ncause of the difference in zero-point energy of the two\ndiatomic molecules. Calculations on collisions such as this\nwill be described in future work.\nP. S. and J. M. H. are grateful to EPSRC for support\nunder research Grant No. GR\/R17522\/01. M. T. C. is grate-\nful for sponsorship from the University of Durham.\n[1] S. Jochim et al., Science 302, 2101 (2003).\n[2] M. Greiner, C. A. Regal, and D. S. Jin, Nature (London)\n426, 537 (2003).\n[3] M. W. Zwierlein et al., Phys. Rev. Lett. 91, 250401 (2003).\n[4] K. E. Strecker, G. B. Partridge, and R. G. Hulet, Phys. Rev.\nLett. 91, 080406 (2003).\n[5] J. Cubizolles, T. Bourdel, S. J. J. M. F. Kokkelmans, G. V.\nShlyapnikov, and C. Salomon, Phys. Rev. Lett. 91, 240401\n(2003).\n[6] S. Jochim et al., Phys. Rev. Lett. 91, 240402 (2003).\n[7] C. A. Regal, M. Greiner, and D. S. Jin, Phys. Rev. Lett. 92,\n083201 (2004).\n[8] J. Stenger et al., Phys. Rev. Lett. 82, 2422 (1999).\n[9] E. A. Donley, N. R. Claussen, S. T. Thompson, and C. E.\nWieman, Nature (London) 417, 529 (2002).\n[10] J. Herbig et al., Science 301, 1510 (2003).\n[11] S. Du¨rr, T. Volz, A. Marte, and G. Rempe, Phys. Rev. Lett.\n92, 020406 (2004).\n[12] T. Mukaiyama, J. R. Abo-Shaeer, K. Xu, J. K. Chin, and\nW. Ketterle, Phys. Rev. Lett. 92, 180402 (2004).\n[13] D. S. Petrov, C. Salomon, and G. V. Shlyapnikov, Phys.\nRev. Lett. 93, 090404 (2004).\n[14] P. Solda´n, M. T. Cvitasˇ, and J. M. Hutson, Phys. Rev. A 67,\n054702 (2003).\n[15] M. T. Cvitasˇ, P. Solda´n, and J. M. Hutson (to be pub-\nlished).\n[16] F. D. Colavecchia et al., J. Chem. Phys. 118, 5484 (2003).\n[17] P. Solda´n, M. T. Cvitasˇ, J. M. Hutson, P. Honvault, and\nJ.-M. Launay, Phys. Rev. Lett. 89, 153201 (2002).\n[18] G. Que´me´ner, P. Honvault, and J.-M. Launay, Eur. Phys. J.\nD 30, 201 (2004).\n[19] P. Honvault and J.-M. Launay, in Theory of Chemical\nReaction Dynamics, edited by A. Lagana and\nG. Lendvay, NATO Science Series Vol. 145 (Kluwer,\nDordrecht, Boston, 2004), p. 187.\n[20] A. M. Arthurs and A. Dalgarno, Proc. R. Soc. London A\n256, 540 (1960).\n[21] See, for example, R. D. Levine and R. B. Bernstein,\nMolecular Reaction Dynamics and Chemical Reactivity\n(Oxford University Press, Oxford, 1987).\n[22] A. Derevianko, W. R. Johnson, M. S. Safronova, and J. F.\nBabb, Phys. Rev. Lett. 82, 3589 (1999).\n10−6 10−5 10−4 10−3 10−2 10−1\nCollision energy (K)\n10−10\n10−9\nR\nat\ne \nco\nef\nfic\nie\nnt\n  (c\nm3\n \ns−\n1 )\nBOSONS: vi=1\nBOSONS: vi=2\nFERMIONS: vi=1\nFERMIONS: vi=2\nLangevin model\nFIG. 4 (color online). Total inelastic rate coefficients for colli-\nsions of Li with Li2 (v \u0003 1 and 2, with n \u0003 0 for bosons and\nn \u0003 1 for fermions).\nPRL 94, 033201 (2005) P H Y S I C A L R E V I E W L E T T E R S week ending28 JANUARY 2005\n033201-4\n"}