{"doi":"10.1063\/1.1402968","coreId":"71223","oai":"oai:eprints.lancs.ac.uk:4488","identifiers":["oai:eprints.lancs.ac.uk:4488","10.1063\/1.1402968"],"title":"Interface photoluminescence in type II broken-gap P-Ga0.84In0.16As0.22Sb0.78\/p-InAs single heterostructures. .","authors":["Moiseev, K. D.","Krier, A.","Yakovlev, Y. P."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2001-10-15","abstract":"Mid-infrared photoluminescence has been observed from interface transitions in high quality, abrupt P-Ga0.84In0.16As0.22Sb0.78\/p-InAs heterojunctions grown by liquid phase epitaxy from an In-rich melt. The Ga0.84In0.16As0.22Sb0.78 quaternary epitaxial layer was unintentionally doped and grown lattice matched on to a (100) oriented p-type InAs substrate, resulting in a P-p isotype heterojunction. The photoluminescence emission spectra were investigated and exhibited three pronounced emission bands in the spectral region from 0.30 to 0.68 eV; h nu (1) = 0.317 eV, h nu (2) = 0.380 eV, and h nu (L) = 0.622 eV. The emission band h nu (1) was identified with radiative transitions between electron and hole quantum well subbands in the semimetal channel at the P-GaIn0.03As0.10Sb\/p-InAs interface, while the h nu (2) band originates from radiative transitions involving deep acceptor states in the InAs substrate. The high-energy recombination h nu (L) is characteristic of the Ga0.84In0.16As0.22Sb0.78 bulk quaternary layer. (C) 2001 American Institute of Physics","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71223.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/4488\/1\/moiseev2001a.pdf","pdfHashValue":"e25d9884a2f815a30cde5acfdc4ccdd863330534","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:4488<\/identifier><datestamp>\n      2018-01-24T03:12:58Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Interface photoluminescence in type II broken-gap P-Ga0.84In0.16As0.22Sb0.78\/p-InAs single heterostructures. .<\/dc:title><dc:creator>\n        Moiseev, K. D.<\/dc:creator><dc:creator>\n        Krier, A.<\/dc:creator><dc:creator>\n        Yakovlev, Y. P.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        Mid-infrared photoluminescence has been observed from interface transitions in high quality, abrupt P-Ga0.84In0.16As0.22Sb0.78\/p-InAs heterojunctions grown by liquid phase epitaxy from an In-rich melt. The Ga0.84In0.16As0.22Sb0.78 quaternary epitaxial layer was unintentionally doped and grown lattice matched on to a (100) oriented p-type InAs substrate, resulting in a P-p isotype heterojunction. The photoluminescence emission spectra were investigated and exhibited three pronounced emission bands in the spectral region from 0.30 to 0.68 eV; h nu (1) = 0.317 eV, h nu (2) = 0.380 eV, and h nu (L) = 0.622 eV. The emission band h nu (1) was identified with radiative transitions between electron and hole quantum well subbands in the semimetal channel at the P-GaIn0.03As0.10Sb\/p-InAs interface, while the h nu (2) band originates from radiative transitions involving deep acceptor states in the InAs substrate. The high-energy recombination h nu (L) is characteristic of the Ga0.84In0.16As0.22Sb0.78 bulk quaternary layer. (C) 2001 American Institute of Physics.<\/dc:description><dc:date>\n        2001-10-15<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/4488\/1\/moiseev2001a.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1063\/1.1402968<\/dc:relation><dc:identifier>\n        Moiseev, K. D. and Krier, A. and Yakovlev, Y. P. (2001) Interface photoluminescence in type II broken-gap P-Ga0.84In0.16As0.22Sb0.78\/p-InAs single heterostructures. . Journal of Applied Physics, 90 (8). pp. 3988-3992. ISSN 1089-7550<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/4488\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1063\/1.1402968","http:\/\/eprints.lancs.ac.uk\/4488\/"],"year":2001,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"JOURNAL OF APPLIED PHYSICS VOLUME 90, NUMBER 8 15 OCTOBER 2001Interface photoluminescence in type II broken-gap\nP–Ga0.84In0.16As0.22Sb0.78 Õp-InAs single heterostructures\nK. D. Moiseev,a) A. Krier,b) and Yu. P. Yakovlevc)\nDepartment of Physics, Lancaster University, Lancaster LA1 4YB, United Kingdom\n~Received 19 June 2001; accepted for publication 18 July 2001!\nMid-infrared photoluminescence has been observed from interface transitions in high quality, abrupt\nP–Ga0.84In0.16As0.22Sb0.78 \/p-InAs heterojunctions grown by liquid phase epitaxy from an In-rich\nmelt. The Ga0.84In0.16As0.22Sb0.78 quaternary epitaxial layer was unintentionally doped and grown\nlattice matched on to a ~100! oriented p-type InAs substrate, resulting in a P– p isotype\nheterojunction. The photoluminescence emission spectra were investigated and exhibited three\npronounced emission bands in the spectral region from 0.30 to 0.68 eV; hn150.317 eV, hn2\n50.380 eV, and hnL50.622 eV. The emission band hn1 was identified with radiative transitions\nbetween electron and hole quantum well subbands in the semimetal channel at the\nP–GaIn0.03As0.10Sb\/p-InAs interface, while the hn2 band originates from radiative transitions\ninvolving deep acceptor states in the InAs substrate. The high-energy recombination hnL is\ncharacteristic of the Ga0.84In0.16As0.22Sb0.78 bulk quaternary layer. © 2001 American Institute of\nPhysics. @DOI: 10.1063\/1.1402968#INTRODUCTION\nThere is a growing interest in semiconductor lasers emit-\nting in the mid-infrared spectral region ~3–5 mm! since these\nlasers can be used in the trace gas detection of a variety of\nspecies which have characteristic absorption fingerprints in\nthis range, leading to applications such as remote sensing,\nmolecular spectroscopy, and ecological monitoring. Other\npotential applications include, infrared countermeasures and\nfree space optical communications within the ~3–5 mm! at-\nmospheric transmission window. However, it is necessary\nnot only to achieve the target wavelength, but also to obtain\noperation at room temperature before these devices can be-\ncome widely used in practice. The quaternary solid solutions\nGa12xInxAsySb12y and their heterojunctions formed with\nInAs are promising materials systems for the fabrication of\nefficient optoelectronic devices operating in this spectral\nrange.1,2 The unique type-II band alignment of the broken-\ngap Ga12xInxAsySb12y \/InAs heterojunction offers the pos-\nsibility of a substantial reduction in Auger recombination\nwhich is thought to be the main loss mechanism in narrow-\ngap III–V lasers designed for room temperature operation.\nAdjusting the In content in the quaternary layer enables con-\ntrol of both the energy gap of the solid solution and the band\noffsets at the interface. Due to the nature of the crossed band\nline up the wide-gap Ga12xInxAsySb12y alloy–InAs system\nin the composition range x,0.22, electrons and holes are\nspatially separated and localized in self-consistent quantum\nwells on the InAs and Ga12xInxAsySb12y sides of the het-\nerointerface, respectively.3 This separation should result in\nAuger suppression, which can lead to improvement of laser\na!Visiting research fellow at Lancaster University; electronic mail:\nmkd@iropt2.ioffe.rssi.ru\nb!Author to whom correspondence should be addressed; electronic mail:\na.krier@lancaster.ac.uk\nc!Also with: A. F. Ioffe Physico-Technical Institute, St. Petersburg, Russia.3980021-8979\/2001\/90(8)\/3988\/5\/$18.00temperature characteristics, while the combination of wide\ngap alloy and narrow gap InAs means that intervalence band\nresonances are also avoided.4 Recently, tunnel-injection di-\node lasers based on type II recombination across the broken-\ngap Ga12xInxAsySb12y \/InAs heterojunction exhibited a\ngood performance at low temperatures but laser emission\nwas limited to 196 K in the pulsed regime.5\nIn order to fabricate an effective heterointerface diode\nlaser it is necessary to obtain information about the associ-\nated radiative transitions and their quantum efficiency. So\nfar, only the photoluminescence of bulk Ga12xInxAsySb12y\nsolid solutions in the composition range 0.08,x,0.22 has\nbeen studied over the temperature range T54 – 80 K6,7 and\n~tunnel-assisted! interface electroluminescence in type II\nsingle p-Ga0.84In0.16As0.22Sb0.78 \/p-InAs heterostructures has\nalso been observed at 77 K.8 In this article we report the\nobservation of interface-induced photoluminescence in type\nII broken-gap p-Ga0.84In0.16As0.22Sb0.78 \/p-InAs heterostruc-\ntures.\nEXPERIMENTAL PROCEDURES\nThe GaSb-rich Ga0.84In0.16As0.22Sb0.78 quaternary solid\nsolution was grown lattice matched on ~100! oriented Zn-\ndoped InAs ~P-type! substrates by liquid phase epitaxy\n~LPE!. The growth was performed in a conventional horizon-\ntal graphite slider boat under purified hydrogen atmosphere\nat a temperature of Tgr5600 °C. An In-rich melt was pre-\npared from undoped InAs and GaSb monocrystalline binary\ncompounds with residual carrier concentrations n5231016\ncm23 and p5131017 cm23, respectively. These constituents\nwere dissolved into 7 N of In to make up the growth solu-\ntion. The melt compositions and growth conditions ~liquidus\nand supercooling temperatures! were obtained from thermo-\ndynamic calculation of the phase diagram for the\nGa0.84In0.16As0.22Sb0.78 quaternary solid solution.8 © 2001 American Institute of Physics\n3989J. Appl. Phys., Vol. 90, No. 8, 15 October 2001 Moiseev, Krier, and YakovlevPhotoluminescence ~PL! measurements were carried out\non the resulting epitaxial heterointerfaces with the sample in\nan Oxford Instruments continuous-flow liquid helium cry-\nostat, which enabled temperature selection between 4 and\n300 K. The photoluminescence was excited using the 488 nm\nline from an Ar ion laser. After passing through the sapphire\nwindow of the cryostat, the PL emission was focused into a\nBentham 0.3 m monochromator using CaF2 lenses and de-\ntected using a liquid N2 cooled InSb photodiode and Stanford\nResearch ~SR850! digital phase-sensitive detector. A com-\nputer was used to control the monochromator and record the\nfinal signal using LABVIEW operating software.\nRESULTS AND DISCUSSION\nThe Ga0.84In0.16As0.22Sb0.78 layers obtained here had\nmirror-like surfaces and were of uniform thickness of about\n0.8 mm as observed by cross-sectional SEM. The layers were\nalso examined using double crystal x-ray diffraction and\nfound to be slightly lattice mismatched to the InAs substrate\n~280 ppm! at room temperature. The structures under inves-\ntigation here were isotype single heterostructures since the\nGa0.84In0.16As0.22Sb0.78 layers were unintentionally doped and\nwere p type with a residual hole concentration of ;5\n31016 cm23, whereas the p-type InAs substrate was deliber-\nately compensated with Zn to a hole concentration of p\n;1017 cm23. This was primarily to achieve high resistivity\nat 77 K and prevent parallel leakage as required for associ-\nated magnetotransport measurements. Hall measurements\nperformed on standard ‘‘Hall cross’’ samples made from this\nmaterial revealed the presence of a two-dimensional ~2D!\nelectron channel at the interface with a carrier concentration\nne5331011 cm22 in single p-Ga0.84In0.16As0.22Sb0.78 \/\np-InAs heterostructures at 4.2 K in low magnetic fields ~,10\nT!. The electron Hall mobility was found to be as high as\nmH550 000 cm2\/V s at 77 K. More recently, Quantum Hall\neffect plateaus in a semimetal channel at the type II broken-\ngap p-Ga0.84In0.16As0.22Sb0.78 \/p-InAs heterointerface were\nobserved.9\nPL was observed from the samples at low temperature in\nthe range T55 – 35 K. The 5 K PL spectra for the samples\nunder investigation contained three pronounced emission\nbands, one in the spectral range hn50.56– 0.68 eV and two\nfurther ones in the range hn50.30– 0.45 eV as shown in Fig.\n1. The high-energy part of the PL spectrum corresponds to\nluminescence from the wide-gap Ga0.84In0.16As0.22Sb0.78 solid\nsolution, which has an energy gap of 0.644 eV.7 More pre-\ncisely, the emission band has a peak at hnL50.622 eV and\ncan be associated with radiative transitions involving an ac-\nceptor level with an activation energy EA1522 meV arising\nfrom a native lattice defect. This PL peak was observed to\nshift toward higher energies with increasing laser excitation\nas shown in Fig. 2. The ‘‘blueshift’’ of 6 meV and the asym-\nmetric shape of the emission band with a high-energy tail is\ncharacteristic of Moss–Burstein filling at the bottom of the\nconduction band. The dependence of the emission band\nmaximum and PL peak intensity on the excitation level was\nobserved to be almost linear as shown in the inset of Fig. 2.\nIn addition to the main PL emission band, a second muchweaker emission band could also be deconvoluted from the\nspectrum, with a maximum at hnDA50.600 eV. This emis-\nsion band can be ascribed to radiative recombination involv-\ning a deep acceptor level with an activation energy of EDA\n544 meV.7\nThe temperature dependence of the principle emission\nband (hnL50.622 eV! associated with the bulk\nGa0.84In0.16As0.22Sb0.78 quaternary was also investigated and\nis shown in Fig. 3. However, the PL intensity rapidly\nquenched as the temperature increased from 20 to 35 K and\nonly a small change in the spectral position of the PL peak\nwith temperature was observed. The spectral position of the\nemission band maximum hnL50.621 eV at T535 K is in\ngood accordance with the temperature shift of the forbidden\ngap of the quaternary solid solution, since the energy gap\nbecomes narrower by 3 meV with increasing temperature\nfrom 5 to 35 K.10,11\nThe low-energy part (hn50.30– 0.45 eV! of the PL\nspectrum of Fig. 1 can be ascribed to radiative recombination\noriginating from radiative transitions involving self-\nconsistent quantum wells localized at the interface. The PL\nspectra in this spectral range exhibit two pronounced emis-\nsion bands with peak photon energies at hn150.317 eV and\nhn250.38 eV, and with full width at half maximum\n~FWHM! of 5 and 12 meV, respectively ~see Figs. 4 and 5!.\nAs shown in Fig. 4, the emission band hn2 dominates the PL\nspectra at T55 K. Another emission band hn1 appears at\npowers above 0.4 W. Then, further increasing the excitation\nresults in a monotonous increase of the PL intensity for both\nemission bands until they both saturate at high pumping lev-\nels (P.4 W! as shown in Fig. 6. In addition, a third high-\nenergy emission band with peak energy hn350.416 eV and\nFWHM510 meV was also observed at the highest excitation\nlevels. This latter peak can be associated with band-to-band\nrecombination in the bulk InAs substrate. The value of 0.416\neV is characteristic of interband transitions in InAs at low\ntemperature and is in good agreement with observations ob-\ntained elsewhere.12 The excitation dependence of the PL in-\ntensity at T520 K is slightly different in comparison to its\nbehavior at 5 K ~see Figs. 5 and 6!. A redistribution of total\nFIG. 1. A typical PL spectrum from the type II broken-gap single\nP–Ga0.84In0.16As0.22Sb0.78 \/p-InAs heterostructures measured at 5 K.\n3990 J. Appl. Phys., Vol. 90, No. 8, 15 October 2001 Moiseev, Krier, and YakovlevFIG. 2. PL spectra for undoped Ga0.84In0.16As0.22Sb0.78\nsolid solution at different pumping levels at 5 K. ~Inset!\nThe dependence of PL intensity and peak spectral posi-\ntion on laser excitation power.intensity between hn1 and hn2 emission bands was ob-\nserved. Furthermore, the excitation dependence of the PL\nintensity for the hn1 emission band is linear, while the hn2\nemission band achieves a maximum and then decreases\nabove 2 W.\nA schematic energy diagram of band bending at the het-\nerointerface and the possible radiative transitions is pre-\nsented in Fig. 7. As shown in Fig. 7~a!, when the heterojunc-\ntion is formed, electrons from the Ga0.84In0.16As0.22Sb0.78\nvalence band flow into the empty InAs conduction band due\nto the crossing of the valence and conduction bands at the\ninterface. A 2D electron gas is formed in the\nGa0.84In0.16As0.22Sb0.78 \/InAs heterojunction within the quan-\ntum well on the InAs side, and an equivalent number of\nholes that are left behind reside near the heterointerface on\nthe Ga0.84In0.16As0.22Sb0.78 side, resulting in the formation of\na triangular potential well. The strong intrinsic electric field\nproduced at the interface holds the electrons and holes to-\nFIG. 3. PL spectra for undoped Ga0.84In0.16As0.22Sb0.78 solid solution at the\nsame pumping level at different temperatures. ~Inset! The magnification of\nthe PL spectrum at 35 K.gether in self-consistent quantum wells and determines the\ncarrier population density in the semimetal channel main-\ntained by the common bulk Fermi level EF of the heterojunc-\ntion at thermodynamic equilibrium.\nUnder optical excitation, the photogenerated carriers fill\nthe quantum wells at both sides of the interface, such results\nin increased band bending in the vicinity of the heterointer-\nface @Fig. 7~b!#. We assume the hn1 emission band observed\nin the experiment can be ascribed directly to radiative tran-\nFIG. 4. The low-energy part of the PL spectra for the type II broken-gap\nP–Ga0.84In0.16As0.22Sb0.78 \/p-InAs heterostructure at different pumping lev-\nels measured at 5 K.\n3991J. Appl. Phys., Vol. 90, No. 8, 15 October 2001 Moiseev, Krier, and Yakovlevsitions between electron and hole quantum well subbands in\nthe semimetal channel at the P–Ga0.84In0.16As0.22Sb0.78 \/\np-InAs interface. At low pumping levels, the potential bar-\nrier for holes (DEV;0.48 eV! formed by the valence band\ndiscontinuity at the interface prevents their penetration into\nthe InAs valence band, whereas there is no limit to the move-\nment of electrons into the InAs conduction band. In the case\nof the hn2 emission band, electrons from the conduction\nband of the InAs recombine with holes localized in the deep\nacceptor states of the InAs. Due to the heavy compensation\nof donor levels by shallow Zn acceptors in the InAs sub-\nFIG. 5. The low-energy part of the PL spectra for the type II broken-gap\nP–Ga0.84In0.16As0.22Sb0.78 \/p-InAs heterostructure at different pumping lev-\nels measured at 20 K.\nFIG. 6. Dependence of the PL intensity on the excitation power for hn1\n~317 meV!, hn2 ~380 meV!, and hn3 ~416 meV! emission bands at 5 and\n20 K.strate, radiative recombination involving the deep acceptor\nstates becomes possible, and therefore the hn2 emission band\ncan be observed.\nFurther raising the pumping level increases the concen-\ntration of electrons and holes constrained by the intrinsic\nelectric field of the heterojunction. The increasing carrier ac-\ncumulation in the semimetal channel results in the quantum\nwells becoming deeper, and therefore electron and hole sub-\nbands in the quantum wells can be easily formed. Thus, ra-\ndiative recombination can arise from transitions between\nsubbands localized on opposite sides of the heterointerface.\nThe small blueshift of the hn1 emission band maximum, of\nabout 3 meV, with increasing excitation power is in good\naccordance with the increasing energy separation between\nthese subbands, while the hn2 peak remains at constant en-\nergy.\nAt high excitation, the width of the potential barrier for\nholes becomes sufficiently thin, so that hole tunneling from\nthe quantum well on the Ga0.84In0.16As0.22Sb0.78 side through\nthe barrier into the valence band of the InAs takes place.\nThese holes accumulate at the top of the valence band in the\nshallow potential well adjacent to the electron channel. Con-\nsequently, conduction band–valence band recombination in\nthe InAs @hn3 –transition 3 in Fig. 7~b!# becomes possible,\nwhich in turn leads to quenching of the PL intensity of both\nthe hn1 and hn2 emission bands ~see Fig. 6!.\nCONCLUSIONS\nLow temperature photoluminescence has been observed\nfrom Ga0.84In0.16As0.22Sb0.78 \/InAs single heterojunctions\ngrown by LPE. The spectra exhibit three pronounced emis-\nsion bands in the spectral region from 0.30 to 0.68 eV. The\nlow-energy part of the PL spectrum can be associated with\ninterface-induced radiative transitions involving a semimetal\nchannel produced at the P– p isotype heterointerface. The\nemission band with a peak photon energy at hn150.317 eV\nand FWHM55 meV can be ascribed to radiative transitions\nbetween electron and hole quantum well subbands localized\non opposite sides of the interface. The emission band with a\nmaximum at hn250.380 eV results from radiative transi-\ntions involving the deep acceptor states in the bulk of the\nInAs substrate. The remaining features in the spectra are as-\nsociated with recombination in the quaternary layer (hnL\n50.622 eV! and in the InAs substrate (hn350.416 eV!.\nFIG. 7. A schematic energy diagram of the type II broken-gap\nP–Ga0.84In0.16As0.22Sb0.78 \/p-InAs heterostructure: ~a! at thermodynamic\nequilibrium and ~b! under optical excitation conditions. The arrows indicate\npossible radiative transitions.\n3992 J. Appl. Phys., Vol. 90, No. 8, 15 October 2001 Moiseev, Krier, and YakovlevACKNOWLEDGMENTS\nThe authors would like to thank Dr. E. Hulicius and Dr.\nP. Svoboda from The Institute of Physics, Prague, Czech\nRepublic, for carrying out the related Hall measurements.\nThe authors also wish to thank EPSRC for providing a vis-\niting research fellowship for Dr. K. Moiseev.\n1 G. W. Charache et al., J. Appl. Phys. 85, 2247 ~1999!.\n2 M. P. Mikhailova, K. D. Moiseev, O. G. Ershov, and Yu. P. Yakovlev,\nSemiconductors 30, 223 ~1996!.\n3 T. I. Voronina, T. S. Lagunova, M. P. Mikhailova, K. D. Moiseev, A. E.\nRozov, and Yu. P. Yakovlev, Semiconductors 34, 189 ~2000!.\n4 G. G. Zegrya, M. P. Mikhailova, T. N. Danilova, A. N. Imenkov, K. D.\nMoiseev, V. V. Sherstnev, and Yu. P. Yakovlev, Semiconductors 33, 97\n~1999!.5 K. D. Moiseev, M. P. Mikhailova, O. G. Ershov, and Yu. P. Yakovlev,\nPhys. Tech. Lett. 23, 151 ~1997!.\n6 K. D. Moiseev, A. A. Toropov, Ya. V. Terentiev, M. P. Mikhailova, and Yu.\nP. Yakovlev, Semiconductors 34, 1376 ~2000!.\n7 K. D. Moiseev, M. P. Mikhailova, Yu. P. Yakovlev, T. Sˇ imecˇek, E. Huli-\ncius, and J. Oswald, J. Appl. Phys. ~to be published!.\n8 M. P. Mikhailova, K. D. Moiseev, R. V. Parfeniev, N. L. Bazhenov, V. A.\nSmirnov, and Yu. P. Yakovlev, IEE Proc.: Optoelectron. 145, 268 ~1998!.\n9 K. D. Moiseev, V. A. Berezovets, M. P. Mikhailova, V. I. Nizhankovskii,\nR. V. Parfeniev, and Yu. P. Yakovlev, Surf. Sci. 482–485, 1083 ~2002!.\n10 K. D. Moiseev, M. P. Mikhailova, Yu. P. Yakovlev, T. Sˇ imecˇek, E. Huli-\ncius, and J. Oswald, J. Electron. Mater. ~to be published!.\n11 K. D. Moiseev, A. Krier, and Yu. P. Yakovlev, J. Electron. Mater. ~to be\npublished!.\n12 Y. Lacroix, C. A. Tran, S. P. Watkins, and M. L. W. Thewalt, J. Appl. Phys.\n80, 6416 ~1996!.\n"}