{"doi":"10.1063\/1.2998461","coreId":"113871","oai":"oai:epubs.surrey.ac.uk:2914","identifiers":["oai:epubs.surrey.ac.uk:2914","10.1063\/1.2998461"],"title":"Effective diffusion of scalar fields in a chaotic flow","authors":["Turner, MR","Gilbert, AD","Thuburn, J"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-10-01","abstract":"The advection of a tracer field in a fluid flow can create complex scalar structures and increase the effect of weak diffusion by orders of magnitude. One tool to quantify this is to measure the flux of scalar across contour lines of constant scalar. This gives a diffusionequation in area coordinates with an effective diffusion that depends on the structure of the scalar field and, in particular, takes large values when scalar contours become very extended. The present paper studies the properties of this effective diffusion using a mixture of analytical and numerical tools. First the presence of hyperbolic stationary points, that is, saddles, in the scalar concentration field is investigated analytically, and it is shown that these give rise to singular spikes in the effective diffusion. This is confirmed in numerical simulations in which complex scalar fields are generated using a time-periodic flow. Issues of numerical resolution are discussed and results are given on the dependence of the effective diffusion on grid resolution and discretization in area or scalar values. These simulations show complex dependence of the effective diffusion on time as saddle points appear and disappear in the scalar field. It is found that time averaging (in the presence of an additional scalar source term) removes this dependence to leave robust results for the effective diffusion","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2914<\/identifier><datestamp>\n      2017-10-31T14:07:00Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:6D617468737075626C<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2914\/<\/dc:relation><dc:title>\n        Effective diffusion of scalar fields in a chaotic flow<\/dc:title><dc:creator>\n        Turner, MR<\/dc:creator><dc:creator>\n        Gilbert, AD<\/dc:creator><dc:creator>\n        Thuburn, J<\/dc:creator><dc:description>\n        The advection of a tracer field in a fluid flow can create complex scalar structures and increase the effect of weak diffusion by orders of magnitude. One tool to quantify this is to measure the flux of scalar across contour lines of constant scalar. This gives a diffusionequation in area coordinates with an effective diffusion that depends on the structure of the scalar field and, in particular, takes large values when scalar contours become very extended. The present paper studies the properties of this effective diffusion using a mixture of analytical and numerical tools. First the presence of hyperbolic stationary points, that is, saddles, in the scalar concentration field is investigated analytically, and it is shown that these give rise to singular spikes in the effective diffusion. This is confirmed in numerical simulations in which complex scalar fields are generated using a time-periodic flow. Issues of numerical resolution are discussed and results are given on the dependence of the effective diffusion on grid resolution and discretization in area or scalar values. These simulations show complex dependence of the effective diffusion on time as saddle points appear and disappear in the scalar field. It is found that time averaging (in the presence of an additional scalar source term) removes this dependence to leave robust results for the effective diffusion.<\/dc:description><dc:date>\n        2008-10-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        attached<\/dc:rights><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2914\/2\/effective_diffusion2.2.pdf<\/dc:identifier><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2914\/4\/licence.txt<\/dc:identifier><dc:identifier>\n          Turner, MR, Gilbert, AD and Thuburn, J  (2008) Effective diffusion of scalar fields in a chaotic flow   Phys. Fluids, 20 (10).       <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1063\/1.2998461<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2914\/","http:\/\/dx.doi.org\/10.1063\/1.2998461"],"year":2008,"topics":[],"subject":["Article","NonPeerReviewed"],"fullText":"Effective diffusion of scalar fields\nin a chaotic flow\nM. R. Turner, A. D. Gilbert & J. Thuburn\nMathematics Research Institute,\nSchool of Engineering, Computing and Mathematics,\nUniversity of Exeter,\nExeter EX4 4QF, U.K.\nAbstract\nThe advection of a tracer field in a fluid flow can create complex scalar structures\nand increase the effect of weak diffusion by orders of magnitude. One tool to quantify\nthis is to measure the flux of scalar across contour lines of constant scalar. This gives\na diffusion equation in area coordinates with an effective diffusion that depends on\nthe structure of the scalar field, and in particular takes large values when scalar\ncontours become very extended. The present paper studies the properties of this\neffective diffusion using a mixture of analytical and numerical tools.\nFirst the presence of hyperbolic stationary points, that is saddles, in the scalar\nconcentration field is investigated analytically, and it is shown that these give rise to\nsingular spikes in the effective diffusion. This is confirmed in numerical simulations\nin which complex scalar fields are generated using a time–periodic flow. Issues of\nnumerical resolution are discussed and results are given on the dependence of the\neffective diffusion on grid resolution and discretization in area or scalar values. These\nsimulations show complex dependence of the effective diffusion on time, as saddle\npoints appear and disappear in the scalar field. It is found that time–averaging (in\nthe presence of an additional scalar source term) removes this dependence to leave\nrobust results for the effective diffusion.\n1 Introduction\nWhen a scalar tracer is injected into a fluid flow it is advected with the fluid\nand exposed to molecular diffusion, both of which form key aspects of the\nmixing properties of the flow. Advection stretches and folds the material lines\nof the scalar, and molecular diffusion removes the resulting fine scale struc-\nture in the scalar field. While advection and diffusion are important effects\nin scalar mixing processes, in general it is hard to separate their individual\nPreprint submitted to Elsevier 12 August 2008\neffects from one another. However by defining a quasi–Lagrangian coordinate\nsystem based on the area inside scalar concentration contours the reversible\neffects of advection can be separated from the irreversible effects of diffusion\n(Nakamura, 1996; Winters and D’Asaro, 1996). In this isotracer coordinate\nsystem the effects of advection are incorporated into the coordinate system\nand the advection–diffusion equation becomes a pure diffusion equation in area\ncoordinates with an effective diffusion. This effective diffusion then quantifies\nsolely the irreversible effects.\nThe effective diffusion from the quasi–Lagrangian approach measures the diffu-\nsive flux of the scalar tracer across concentration contours. It depends only on\nthe instantaneous distribution of the scalar field and so can be calculated with-\nout knowledge of the flow field. However when a fluid flow generates complex\nscalar fields, for example by chaotic advection, the effective diffusion indirectly\nreveals information about the transport and mixing properties of the under-\nlying flow. The simple nature of this approach and its ease of implementation\nmake it an attractive tool for studying complicated systems such as the trans-\nport and mixing properties of atmospheric flows (Haynes and Shuckburgh,\n2000a,b). This diagnostic has been tested on a number of idealised flows to\nunderstand its properties. In a scalar field advected by the nonlinear Kelvin–\nHelmholtz instability, Nakamura (1996) finds that regions of high effective\ndiffusion occur in the centre of a shear layer where the tracer (temperature in\nthis case) is well mixed. Outside this well mixed region the effective diffusion\ndrops off and this led Nakamura (1996) to conclude that there is a link between\nregions of high effective diffusion and well mixed regions of the tracer in the\nflow. Shuckburgh and Haynes (2003) made a careful study of effective diffusion\nas a rigorous diagnostic for quantifying flows and they strengthened the link\nbetween regions of high effective diffusion and well mixed regions showing that\nhigh effective diffusion occurs in regions of high material line stretching. This\nwas achieved by studying a simple two–dimensional time–periodic flow with\nthe form of a meandering jet, and comparing the effective diffusion with other\nLagrangian mixing diagnostics such as Poincare´ sections (Drazin, 1992; Wig-\ngins, 1990) and finite–time Lyapunov exponents (Lichtenberg and Lieberman,\n1992; Pierrehumbert and Yang, 1993). In fact it was found that the effective\ndiffusion was better able to distinguish barriers in the flow when compared\nwith finite–time Lyapunov exponents (Shuckburgh and Haynes, 2003).\nAs the effective diffusion is easy to implement and no prior knowledge of the\nvelocity field is required, this method is appealing to experimentalists too.\nThe scalar concentrations can be calculated using grey–scale images and thus\nthe required integrals in the effective diffusion (see §2) can be calculated by\ncounting pixels (e.g., Deese et al., 2002).\nThe purpose of this paper is also to examine the robustness of effective dif-\nfusion as a diagnostic using two–dimensional scalar fields given analytically,\n2\nor from advection–diffusion in idealised flows. Our starting point is to un-\nderstand singular behaviour in the effective diffusion, which arises when the\nscalar field contains stationary points that are saddles, that is have locally\nhyperbolic contour lines. This could be significant because in the evolution of\na complex field such saddles will be continually created and destroyed, leading\nto complex behaviour of the effective diffusion, and opens the question of how\nuseful a diagnostic it really is.\nWe begin by considering an instantaneous snapshot of a saddle point for which\nwe can write down the scalar field analytically. Using numerical methods we\nshow that the effective diffusion along the concentration contour through the\nsaddle point is singular, and we confirm analytically that the singularity is log-\narithmic. We then study scalar advected by an incompressible time–periodic\nflow, with a fixed steady source of scalar so as to produce a strictly time–\nperiodic scalar distribution. We observe that over a period of the flow the\nsaddle points of the scalar field move through the region of high effective\ndiffusion, corresponding to the well mixed region of the flow. We also de-\ntermine the numerical resolution required to obtain robust results, and how\ntime–averaging may be used to obtain a mean eddy diffusion without com-\nplex time–dependence and singularities, that then characterises the mixing\nover one period of the underlying flow. Our motivation for this study is to test\nthe robustness of the effective diffusion diagnostic so that it may be used on\ndynamical vortex problems where the vorticity field may contain saddle points\nin highly nonlinear regimes such as during the formation of cat’s eyes (Turner\nand Gilbert, 2007).\nThe paper is set out as follows. In §2 we state the form of the transformed\nadvection–diffusion equation, define the effective diffusion and give the nu-\nmerical method, following previous work. In §3 we use a two–dimensional\nanalytical scalar field to show that the effective diffusion has a logarithmic\nsingularity at tracer values where contours pass through a saddle point. This\ninformation is then used in the numerical simulations in §3.3 to show that\npeaks in the effective diffusion relate directly to saddle points in the scalar\nfield. In §3.4 we introduce a source of scalar into the simulations so as to\nproduce a time periodic scalar field. By time averaging, we demonstrate that\nhigh values of the time averaged effective diffusion correspond to regions in\nthe scalar field which are well mixed and where the material lines are highly\nstretched. Our concluding remarks and comments are given in §4.\n3\n2 Formulation\nIn an incompressible fluid, the evolution of a scalar tracer with concentration\nc(x, t) is given by the advection–diffusion equation\n∂c\n∂t\n+ u · ∇c = ∇ · (κ∇c) + S, (2.1)\nwhere κ(x, t) is the molecular scalar diffusion, S is a source term and u is a pre-\nscribed incompressible velocity field. By making a transformation to isotracer\ncoordinates (Butchart and Remsberg, 1986), (2.1) reduces to a diffusion–only\nequation for the time evolution of the scalar as a function of area in two\ndimensions (Nakamura, 1996) or volume in three dimensions (Winters and\nD’Asaro, 1996). We define the area or volume of a scalar contour C as the\nregion bounded by this contour or surface, i.e. everywhere where the scalar\nconcentration c(x, t) is less than or equal to C. Therefore we write\nA =\n∫∫\nH(C − c(x, t)) dA, V =\n∫∫∫\nH(C − c(x, t)) dV, (2.2)\nwhere H(X) is the Heaviside function. Thus in two dimensions A = 0 when\nC = Cmin and A = Amax when C = Cmax, using obvious notation. We also\ndefine γ(C, t) to be the bounding contour or surface of the region where A or\nV is less than C at time t.\nUnder this change of coordinates the two–dimensional scalar evolution equa-\ntion becomes\n∂C(A, t)\n∂t\n=\n∂\n∂A\n(\nKeff(A, t)\n∂C(A, t)\n∂A\n)\n+ 〈S〉A, (2.3)\nwith an effective diffusion that can be written as\nKeff =\n∂A\n∂C\n∫\nγ(C,t)\nκ|∇c| ds, (2.4)\nor as\nKeff =\n〈κ|∇c|2〉A\n(∂C\/∂A)2\n, (2.5)\nwhere the weighted contour average of a quantity χ is given by\n〈χ〉A = ∂\n∂A\n∫\nc≤C(A,t)\nχ dA =\n(∫\nγ\nds\n|∇c|\n)−1 ∫\nγ\nχ\nds\n|∇c| , (2.6)\n(Nakamura, 1996; Shuckburgh and Haynes, 2003). A similar equation holds\nin three dimensions, with A replaced by V . Throughout this work we assume\nthat the molecular diffusion κ(x, t) is constant, hence κ can be taken outside\nthe integrals in (2.4) and (2.5).\n4\n2.1 Numerical method for calculating the effective diffusion\nWhen we consider a two–dimensional scalar field that is defined analytically,\nthe effective diffusion may be calculated using (2.4). This can be manipulated\nand evaluated simply as a single integral over the x coordinate (see §3.1 for\nmore details). However when we consider flows where the scalar concentration\nis only known from a full numerical simulation of (2.1), we use (2.5) to calculate\nKeff at a given time value using the following algorithm (Shuckburgh and\nHaynes, 2003). Firstly we define a set of C values from Cmin to Cmax with a\nconstant spacing ∆C, and for each of these values A(C) is calculated via (2.2).\nThe function A(C) is calculated using a box counting technique, where we\nassume that the value of the scalar at the grid point gives the scalar value in the\nentire grid box surrounding that point. Then the square of the scalar gradient,\n|∇c|2, is calculated at each grid point, and this quantity is integrated over\nthe area bounded by the desired tracer contour, to obtain\n∫\nc≤C(A,t) |∇c|2 dA\nusing the same box counting. Taking central finite differences of this integral\nwith respect to the area coordinate then gives 〈|∇c|2〉A, which on dividing\nby (∂C\/∂A)2 and multiplying by κ gives Keff . Like the term 〈|∇c|2〉A, the\nquantity ∂C\/∂A is calculated using a central difference scheme, and so Keff is\nprone to numerical error arising from these terms, as is discussed in more detail\nin §3.2. The effective diffusion in three dimensions is calculated in a similar\nfashion, with volume integrals replacing the area integrals. The accuracy of\nKeff in conjunction with the resolution of numerical simulations is discussed\nin §3.2.\n3 Effective diffusion in two dimensions\n3.1 Effective diffusion in scalar fields with saddle points\nConsider the scalar field in two dimensions given by\nc(x, y) =\n1\n2\n(cosx− cos y) , (3.1)\nin the periodic, Cartesian domain [x, y] ∈ [−pi, pi). A contour plot of this scalar\nfield is given in figure 1, where the dashed contours are negative and the solid\nones are positive. This scalar field has two saddle points, one at (0, 0) and the\nother at (−pi,−pi) both of which lie on the scalar concentration contour C = 0\n(These saddle points are the two distinct saddle points, the others present\nare due to the periodicity of the scalar field). The area A inside the scalar\n5\nypi\n−pi\n−pi x pi\nFig. 1. Contour plot of the scalar field (3.1) showing a saddle point at the origin.\nNegative concentration contours are dashed and positive contours are solid.\nconcentration contour C can thus be calculated from (2.2) as\nA =\n∫ pi\n−pi\n∫ pi\n−pi\nH(2C − cosx+ cos y) dx dy. (3.2)\nThis quantity is evaluated numerically, and ∂A\/∂C is calculated via finite\ndifferences. The function A(C) for this scalar field can be seen as the solid\nline in figure 2(a). Because of the symmetry of the scalar field, A(C) is an odd\nfunction with a rapid increase in area around C = 0. We shall see later that\nthe gradient at C = 0 is in fact infinite and it is this infinite gradient that\nleads to a singularity in Keff .\nTo calculate the effective diffusion we need the quantity\nF (C) =\n∫\nγ(C)\n|∇c| ds, (3.3)\nfrom (2.4), which (apart from a factor κ) is minus the diffusive flux of scalar\nover the contour γ(C). This flux can be transformed for C > 0 to\nF (C) = 8\n∫ ρ\n0\n|∇c|2\n| sin y| dx, (3.4)\nwhere ρ = cos−1(2C − 1). Here we have used the fact that\nds\ndx\n=\n(\n1 +\nsin2 x\nsin2 y\n)1\/2\n=\n2|∇c|\n| sin y| ,\nand that the contour C hits the line y = pi at x = ρ in the upper right\nquadrant. The same expression holds for C < 0 by symmetry. Using (3.1) we\n6\n(a)\n 0\n 10\n 20\n 30\n 40\n-1 -0.5  0  0.5  1\nC\nA\n(b)\n-8\n-4\n 0\n 4\n 8\n-1 -0.5  0  0.5  1\nC\nF\n(c)\n 0\n 100\n 200\n 300\n 400\n 500\n-1 -0.5  0  0.5  1\neff\nC\nK\nFig. 2. Plots of (a) A(C), (b) F (C) and (c) Keff(C) with the numerical results\nplotted as the solid lines and the small–C asymptotic results as the dashed lines for\nthe scalar field (3.1).\ncan write F (C) solely in terms of x by noting that\n| sin y| = (1− cos2 y)1\/2 = (1− cos2 x+ 4C cosx− 4C2)1\/2.\nA numerical integration for F (C) and so Keff(C) for this scalar distribution\nare shown as the solid lines in figures 2(b) and 2(c) respectively, where we\nhave set κ = 1. The plot of Keff(C) appears to have a singularity at C = 0,\nand because F (C) in figure 2(b) appears to be well behaved at C = 0 then\nthe singularity must arise from the term ∂A\/∂C.\nTo check the nature of this singularity we expand (3.2) and (3.4) for small C to\nshow that Keff has a logarithmic singularity along the concentration contour\nC = 0. The calculations are included in appendix A, and we just quote the\nresults:\nA(C) =−8C ln |C|+ 2pi2 + 19.07C +O(C2), (3.5)\nF (C) = 4C2 ln |C|+ 8− 15.1C2 +O(C3), (3.6)\nKeff(C) =−64 ln |C|+ 88.56 +O(C ln |C|). (3.7)\nFrom these expansions we see that in fact F (C) is not well behaved at C = 0,\nbut its singularity is weaker than the one from ∂A\/∂C which is O(ln |C|).\nThese asymptotic expansions are plotted as the dashed lines with their nu-\nmerical equivalents in figure 2. We see that the asymptotic results and the\nnumerical results are in excellent agreement around C = 0, and in fact the\n7\ny−pi\npi\n−pi x pi\nFig. 3. Contour plot of the scalar distribution (3.8) with α = 0.5 showing two saddle\npoints, one at the origin and one at (−pi,−pi). Negative contours are dashed and\npositive contours are solid.\nasymptotic results for A(C) are graphically indistinguishable from the numer-\nical results for −0.5 < C < 0.5.\nThis logarithmic singularity in Keff is not just restricted to the case where two\nsaddle points have the same concentration contour passing through them. As\na further example we consider the scalar field\nc(x, y) =\n1\n2\n(cosx− α cos y) , (3.8)\nwith 0 < α < 1. A contour plot of this scalar field with α = 0.5 is shown\nin figure 3. We examine the numerical integration for Keff(A) with α =\n1.0, 0.75, 0.5 and 0.25, shown in figure 4. As α is reduced from 1 in fig-\nure 4, the single singular point at A = 2pi2 (C = 0) becomes two singular\npoints with a region of lower effective diffusion in between. For α < 1 the sad-\ndle point at (0, 0) now has the scalar concentration value C = (1− α)\/2 > 0\nwhich is different from the saddle point at (−pi,−pi) which has the value\nC = −(1 − α)\/2 < 0. For the case α = 0.5 these correspond to C = ±1\/4\nrespectively, which themselves correspond to the values of A given in figure\n4. The reason we plot these results as a function of A rather than C is be-\ncause varying α changes the upper and lower limits of C, while the upper and\nlower limits of A remain fixed at Amax = 4pi\n2 and Amin = 0 respectively. For\nthis reason, in many figures in this paper we will use A as the independent\nvariable, so as to obtain the same range no matter what the concentration\nfield limits are. As α is reduced towards zero the singularities move towards\nthe limiting area values Amin = 0 and Amax = 4pi\n2, and the region of almost\nconstant diffusion between the singular points extends, until for α = 0 the\n8\n 0\n 100\n 200\n 300\n 400\n 500\n 0  10  20  30  40\nA\neff\n1\n3\n2\n4\nK\nFig. 4. Plot of Keff(A) for the scalar distribution (3.8) with κ = 1 and\nα = 1, 0.75, 0.5 and 0.25 corresponding to lines 1 to 4 respectively.\ndiffusion will be constant everywhere and c(x, y) = 1\n2\ncosx.\nWe note that the logarithmic singularity in Keff in two dimensions is not\npresent in the equivalent three–dimensional calculation, which is given in ap-\npendix B.\n3.2 Parameter optimisation for two–dimensional numerical simulations\nWhen we consider an analytically defined scalar field as in the previous sec-\ntion, we are able to obtain Keff with a high degree of accuracy by increasing\nthe resolution of the integrals in (2.2) and (2.4). However, in numerical simu-\nlations our accuracy is restricted by the resolution of the simulation, so in this\nsection we assess the optimal parameters for the numerical evaluation of Keff\nfor a scalar field generated under advection–diffusion with a given molecular\ndiffusion κ.\nWhen calculating the effective diffusion using the numerical method outlined\nin §2.1, there are two parameters that we can vary. These are the concentration\nstep size ∆C and N , which is the resolution of our simulation computed on an\nN ×N computational grid. (Note that the true level of structure in the scalar\nfield depends on κ and that decreasing κ just requires reducing ∆C to pick out\nthe fine structure of Keff , and so variations in κ can be considered as variations\nof ∆C for optimizing purposes.) Unfortunately the parameters ∆C and N are\nnot independent, because for a given simulation, reducing ∆C requires an\nincrease in N to retain the accuracy of the results: a smaller ∆C introduces\nnumerical oscillations in Keff through the finite difference method. A larger\nvalue of N will overcome this by producing more accurate evaluations of the\nintegral in (2.4) before the finite difference procedure is applied. An increase\nin ∆C on the other hand would allow for a smaller value of N ; however then\n9\n(a)\n 4\n 6\n 8\n 10\n 12\n 1000  1500  2000  2500  3000  3500  4000\n1\n4\n3\n2\nN\nE\n(b)\n 4\n 6\n 8\n 10\n 1000  1500  2000  2500  3000  3500  4000\n123\nN\n4E~\nFig. 5. Plot of (a) the mean square error E and (b) the capped mean square error\nE˜ as a function of the size of the simulation N for ∆C = 0.0025Cmax (line 1),\n0.005Cmax (line 2), 0.0075Cmax (line 3) and 0.01Cmax (line 4). In panel (b) the\ncalculation does not include points where Ktrueeff ≥ 250.\nsome fine scale structure in Keff may be missed. Thus for any value of N there\nis an optimal value of ∆C which minimises the numerical oscillations but also\nmaximises the physical features that are resolved in Keff . To study this issue\nwe use the numerical scheme defined in §2.1 to calculate the effective diffusion\nfor a scalar field which is known analytically so that we also know Keff to a\nhigh degree of accuracy using the form (2.4). For this optimisation study we\nuse the scalar field given by (3.8) with α = 0.5, and we call the highly accurate\nsolution the ‘true solution’.\nTo calculate the error between the effective diffusion calculated using the\nmethod in §2.1 and the true solution we use a mean square error given by\nE =\n1\nM\nM∑\ni=1\n(\nKeff(i)−Ktrueeff (i)\n)2\n, (3.9)\nwhere Ktrueeff is the true form of the effective diffusion, and Keff(i) is the effective\ndiffusion calculated at the M values of C. This error is plotted in figure 5(a) as\na function of the simulation size N for ∆C = (0.0025, 0.005, 0.0075, 0.01)Cmax\nrepresented by lines 1 − 4 respectively. We choose ∆C to be a multiple of\nCmax because then regardless of the value of Cmax, Keff will still have the same\nnumber of points distributed along the A axis, which is the quantity against\nwhich we plot Keff . This is a reasonable choice of ∆C for the simulations\ndiscussed in this paper.\nFor small values of N we see in figure 5(a) that small ∆C values give a poor\nagreement with the true solution, because of the numerical error from the\nfinite difference methods, for both the numerator and denominator of Keff ,\nintroducing large oscillations into Keff . As N is increased, the smallest value\nof ∆C eventually gives the smallest error at around N = 2000. However\nwhen we examine a plot of Keff for this value of N and ∆C (not shown\n10\nhere) we find that the actual agreement with the true solution is good around\nthe peaks in Keff , but over the rest of the function there still exist large\nnumerical oscillations which make the agreement quite poor. The reason for\nthis is because the mean square error is dominated by the singular peaks in\nKeff , so well resolved peaks can mean a small error even if the agreement\nover the rest of the function is visually poor. Thus we remove the peaks from\nthe error calculation by modifying the mean square error in (3.9) to exclude\nany points where Ktrueeff ≥ 250, and we call this E˜. A plot of E˜ as a function\nof N is plotted in figure 5(b) with the same values of ∆C as in panel (a).\nComparing the results in this panel to those in panel (a) we see that where\nthe ∆C = 0.0025Cmax result gave the smallest error for N > 2000, we see\nthat this value now does not give the smallest error until N ≈ 4096. This\nshows that although the small C increments allow for a better approximation\nof the peaks in Keff it does not approximate the rest of the function as well\nas ∆C = 0.005Cmax does.\nFor the numerical simulations in this paper we shall useN = 2048, because this\nis large enough to give a fine grid resolution, but small enough so that it is not\ncomputationally expensive. Hence guided by the results in figure 5(b) we use\nan increment in C of ∆C = 0.005Cmax to produce the best numerical results.\nAlthough we are not able to give a general optimised step size ∆C(N) for all\nproblems, for periodic flows like those considered in this paper, a reasonable\nconcentration step size would be ∆C ≈ 10Cmax\/N .\n3.3 Two–dimensional numerical simulations with no source term\nWe now consider scalar fields generated numerically by advection and diffu-\nsion: specifically we consider a scalar concentration c(x, y, t) whose evolution\nis governed by (2.1) with κ constant and with no source term (S = 0). The\nfluid velocity is taken to have the unsteady form\nu = 2 cos2 t (0, sinx) + 2 sin2 t (sin y, 0) , (3.10)\nand initially c(x, y, 0) = 2 cosx. The numerical scheme for solving (2.1) trans-\nforms the N ×N domain into Fourier space by writing\nc(x, y, t) =\nN∑\nj=−N\nN∑\nk=−N\ncˆjk(t)e\n−i(jx+ky),\nwhere the time integration of the advection is performed via the second order\nAdams–Bashforth method and diffusion is integrated exactly. It is well known\nthat this velocity field generates island regions of recirculation, separated by\nbands of chaotic mixing (Otani, 1993; Childress and Gilbert, 1995). These\nfeatures are reflected in the evolution of the advected scalar field, for example\n11\nx x x−pi\npi\npi\n−pi\npi\ny\ny\nt=0 t=10 t=20\nt=30 t=40 t=50\n−pi\n−pi\npi −pi pi\nFig. 6. Plot of the scalar field c(x, y, t) for the numerical simulations at\nt = 0, 10, 20, 30, 40 and 50, with κ = 0.01. In each figure the maximum scalar\nvalue at each time is coloured red and the lowest value is black.\nthe ‘whorls’ and ‘tendrils’ of Berry and Balazs (1979) or the mirroring of the\nsaddle points and unstable manifold structure of the flow in the advected\nscalar contours of Ghosh et al. (1998). Thus, with mild abuse of language, we\nrefer to islands and chaotic regions of the scalar field, corresponding to these\nregions of the flow.\nWith the initial condition c(x, y, 0) = 2 cosx, the simulations can be thought\nof as starting with a scalar field with constant effective diffusion and allowing\nit to evolve towards a distribution similar to that in (3.1) except with some\ntime dependence included. Panels showing the scalar distribution for κ = 0.01\nat times t = 0, 10, 20, 30, 40 and 50 are shown in figure 6, where for t ≥ 30\nwe can distinguish the two pairs of islands (seen coloured red at the top and\nbottom of the panels and dark blue on the left and right of the panels) which\ntrap scalar, and the region of rapid chaotic mixing in between (see also figure\n10 below). For t = 10 the scalar field has a rather disorganized structure, when\ncompared to the t = 50 panel, with no single region of coherent high and low\nscalar concentrations. However as time increases to t = 50 the scalar becomes\nmore organized with two coherent regions of negative scalar at the left and\nright of the panel and two positive regions of scalar at the top and bottom of\nthe panel. Thus we might expect the scalar for t = 10 to contain more saddle\npoints and Keff to be more complicated, when compared to Keff for the t = 50\ndistribution. We also expect Keff for t = 50 to have its largest values in the\nchaotic mixing region where the filament lines are most stretched.\nFigure 7 plots the effective diffusion Keff(A) at t = 10 for the above simulation\nwith fixed ∆C = 0.005Cmax and N = 512, 1024, 2048 and 4096. The plots are\n12\n 0\n 10\n 20\n 30\n 40\n 50\n 0  10  20  30  40\nA\nK eff\nFig. 7. Plot of Keff(A) for t = 10 from figure 6 with N = 512, 1024, 2048 and\n4096 and ∆C = 0.005Cmax. The results are separated by an additive constant, with\nN = 512 at the bottom and N = 4096 at the top.\n-30\n-20\n-10\n 0\n 10\n 20\n 30\n 0  10  20  30  40\nA\neffK 1\n2\n3\n4\n5\nFig. 8. Plot of Keff(A) for the panels shown in figure 6. The lines 1–5 represent\ntimes t = 10 to t = 50 respectively and are separated by a constant for clarity.\nseparated by an additive constant with the N = 512 result at the bottom and\nthe N = 4096 result at the top of the panel. The lowest resolution simulation,\nN = 512, produces a Keff with fine scale oscillations and many sharp peaks\nthat could be mistaken as features of Keff . These oscillations are clearly visible\nbetween A = 16 and 23. However as N is increased many of these large\noscillations decrease or disappear showing that they are merely numerical error\nfrom the finite difference calculations of the numerator and denominator of\nKeff . For the large–N simulations there are a few clear peaks left in Keff which\ncan be shown to correspond to saddle points in the scalar field distribution:\nsee figure 9 below.\nFigure 8 shows the effective diffusion Keff(A) for the simulations in figure 6\nat the times t = 10, 20, 30, 40 and 50, numbered 1 to 5 respectively. These\nresults are separated by a constant for clarity. We see that at t = 10 (line\n13\n(a)\n 0\n 5\n 10\n 15\n 20\n-0.8 -0.4  0  0.4  0.8\nC\neffK\n(b)\ny x x\npi\n−pi x pi\n−pi\nFig. 9. Plot of (a) Keff(C) for κ = 0.01 at t = 20 and (b) the corresponding contour\nplot from figure 6 with contour levels given at −0.07, −0.079, −0.09, −0.345 and\n−0.355. The two saddle points corresponding to the singular values of C in panel\n(a) are represented by X in panel (b).\n1) the effective diffusion has many small peaks and troughs as discussed in\nthe previous paragraph. This behaviour could be anticipated from the t = 10\npanel in figure 6 which shows a very complicated distribution containing saddle\npoints corresponding to the peaks in Keff . At t = 20 (line 2) the scalar field\nappears more organized than at t = 10. This is reflected in Keff where we\nnow only see four clear peaks close to A = 4, 15, 25 and 36 respectively. As\ntime increases (see lines 3, 4 and 5) the two peaks close to A = 2pi2 move\ntogether and combine into one large peak. The other two peaks move closer to\nA = 5 and A = 35 and persist for long times, although the effective diffusion\nat these points is small compared to the large diffusion across contours close\nto A = 2pi2.\nFigure 9(a) plots Keff as a function of C at t = 20; this is a stretched version of\nline 2 from figure 8 where Keff is depicted as a function of A. We can now read\noff that the peaks occur at C ≈ ±0.08 and C ≈ ±0.35. Thus in figure 9(b) we\nplot the t = 20 panel from figure 6 as a contour plot, with the 5 contour levels\n−0.07, − 0.079, − 0.09, − 0.345 and −0.355. Examining these contours we\ncan clearly see two saddle points situated at the points marked with an X.\nThese points correspond to the peaks in panel (a) at C ≈ −0.08 and −0.35,\nthus confirming that peaks in the effective diffusion in two dimensions are\ndue to logarithmic singularities which occur at concentration contours passing\nthrough saddle points.\n14\n3.4 Two–dimensional numerical simulations with a source term\nWe have seen that the effective diffusion shows quite complex time–dependence\nas saddle points are created, destroyed and move within the scalar field. The\nobvious solution is to perform a time average. However the scalar distribution\nis decaying with time and so the system is not in a stationary state. Further-\nmore if the system is run for a long time, the scalar field will become constant\n(at least to numerical accuracy) in well–mixed regions, while slowly decay-\ning in any islands that are present. These potential problems were indicated\nby Shuckburgh and Haynes (2003), who suggested introducing a source term\nto give a stationary state with non–trivial scalar structure in the well–mixed\nregions.\nIn this section we therefore introduce a source term S = cos x into (2.1) and\ninitially set c(x, y, 0) = 0. This guarantees a strictly periodic scalar field will\nbe established in the asymptotic limit t→∞. However for practical purposes\nthis is still not entirely satisfactory: we find that the effective diffusion rapidly\napproaches an approximately periodic state in the chaotic band region. How-\never scalar slowly builds up in the islands, (i.e. Cmax slowly increases with\ntime), where advection and diffusion operate on long time scales (of the order\nof κ−1) and this scalar slowly leaks into the chaotic region. Although it must\neventually saturate, the time scale for this is beyond that of our simulations.\nOn the other hand even if there is a slow evolution of the island concentra-\ntions over a long time-scale, we may anticipate that the effective diffusion will\nequilibrate quickly, since the effective diffusivity is invariant under rescaling of\nthe scalar field. In any case we take a pragmatic approach and use the scalar\nfields with moderate κ obtained on these time scales to study the evolution of\nthe scalar field over one period of the flow (T, T + pi). We then time–average\nKeff and investigate how this quantity varies with both the period start time\nT and κ.\nThe approximately periodic state that is established in the chaotic region\nfor the scalar (3.10) can be seen in figure 10 which shows |c(x, y, t)|c≤5 (left\npanels) and the corresponding Keff(A) (right panels) for t = 10pi to t = 11pi\nin increments of pi\/4 with κ = 0.01. In the real space panels the scalar field\nis capped at |c| = 5 to eliminate islands and so emphasize the chaotic region\nof the flow where large effective diffusion occurs and the line filaments are\nstretched the most. The center of the chaotic band (red region) is close to\n|c| = 0 and the black regions are regions where |c| > 5.\nBy considering the right–hand panels in figure 10 we see that over one period\nof the flow, the effective diffusion varies a considerable amount for 10 < A < 30\nbut outside of this range the variation is small. At t = 10pi (figure 10(a)) Keff\nhas two spikes of large effective diffusion around A = 2pi2 and two other peaks\n15\n(a)\ny\n−pi\npi\n−pi pix\n 0\n 4\n 8\n 12\n 16\n 0  10  20  30  40\nA\nK eff\n(b)\ny\n−pi\npi\n−pi pix\n 0\n 4\n 8\n 12\n 16\n 0  10  20  30  40\nA\nK eff\n(c)\ny\n−pi\npi\n−pi pix\n 0\n 4\n 8\n 12\n 16\n 0  10  20  30  40\nA\nK eff\n(d)\ny\n−pi\npi\n−pi pix\n 0\n 4\n 8\n 12\n 16\n 0  10  20  30  40\nA\nK eff\n(e)\ny\n−pi\npi\n−pi pix\n 0\n 4\n 8\n 12\n 16\n 0  10  20  30  40\nA\nK eff\nFig. 10. Plot of |c(x, y, t)|c≤5 and the corresponding effective diffusion Keff(A) with\nκ = 0.01 for (a) t = 10pi, (b) t = 10pi + pi\/4, (c) t = 10pi + pi\/2, (d) t = 10pi + 3pi\/4\nand (e) t = 11pi over one period of the flow with a source term S = cosx.\n16\n(a)\n-0.5\n-0.4\n-0.3\n-0.2\n-0.1\n 0\n 0  10  20  30  40\nA\nFd\n1\n2\n3\n4\n(b)\n 0\n 2\n 4\n 6\n 8\n 0  10  20  30  40\nA\n1\n2\n4\n3\nd SF  +F\nFig. 11. Plot of the fluxes (a) Fd(A) and (b) Fd(A) + FS(A) for the scalar field in\nfigure 10 with lines 1 − 4 representing times t = 10pi, 10pi + pi\/4, 10pi + pi\/2 and\n10pi + 3pi\/4 respectively.\naround A = 12 and 28. Considering only A > 2pi2, the peak in Keff closest\nto A = 2pi2 occurs at approximately (pi\/2, 0) in the real space plot, while the\nother peak in Keff corresponds to a saddle point at the origin. At t = 10pi+pi\/4\n(figure 10(b)) the saddle point near (pi\/2, 0) has practically been diffused away\nand this can be seen by the increase in the red coloured region (centre of the\nchaotic band) in this area. The other saddle point on the other hand begins to\nintensify and the effective diffusion peaks grow until at t = 10pi+ 3pi\/4 (figure\n10(d)) it is close to its maximum value. Beyond this time, t = 11pi (figure\n10(e)), the flow returns the scalar approximately to its t = 10pi distribution.\nThe movement of the scalar in time is related to the flux of the scalar which\nitself is related to the rate of change of the concentration contours via\n∂C\n∂t\n+\n∂Fd\n∂A\n= −∂FS\n∂A\n,\nwhere Fd is the diffusive flux and FS is the source flux. These are defined as\nFd =−κ 〈|∇\n2c|〉\n∂C\/∂A\n,\nFS =−\n∫\nC≤c(A,t)\nS dA,\n(Nakamura, 1996) and F = −Fd from (3.3). In figure 11 we plot both (a)\nFd(A) and (b) Fd(A) + FS(A) for the scalar field depicted in figure 10 with\nthe times t = 10pi, 10pi + pi\/4, 10pi + pi\/2 and 10pi + 3pi\/4 denoted by lines\n1–4 respectively. The diffusive flux in figure 11(a) contains some fine scale\nstructure, but this is purely numerical. The diffusive flux has large gradients\nbetween A = 0 and 10 and between A = 30 and 40 for each time value, but\nbetween A = 10 and 30 the diffusive flux increases in value for t = 10pi + pi\/4\nand t = 10pi + pi\/2, and then decreases again as the peaks in Keff(A) reach\n17\n(a)\n 0\n 4\n 8\n 12\n 0  10  20  30  40\nA\nK eff\n(b)\n-15\n-10\n-5\n 0\n 5\n 10\n 15\n 0  10  20  30  40\nA\nC\nFig. 12. Plot of (a) Keff(A) and (b) C(A) for the scalar field in figure 10 at t = 10pi\n(solid line) and t = 11pi (dashed line) showing the scalar distribution is now ap-\nproximately periodic.\ntheir largest values as in figure 10(d). This diffusive flux however is not solely\ndriving the scalar distribution because we have the source term too. If we\ninclude the effect of this source term, then we have the flux which is plotted\nin figure 11(b) and from this figure it is easier to describe how the effective\ndiffusions in figure 10 govern the scalar evolution. In figure 11(b) the turning\npoints of the flux appear to coincide with the peak values of Keff , i.e. the\nsaddle points in the scalar field. At t = 10pi (line 1) the flux gradient is mainly\npositive for A < 2pi2 and negative for A > 2pi2 so the scalar is being diffused\naway from the C = 0 (A = 2pi2) contour. However, by t = 10pi + pi\/2 (line 3)\nthe flux gradient has now changed sign close to A = 2pi2 and the scalar is now\ndiffusing towards the C = 0 contour.\nFigure 12 plots (a) Keff(A) and (b) C(A) at t = 10pi (solid line) and t = 11pi\n(dashed line). Figure 12(a) shows that at the beginning and end of each flow\nperiod the effective diffusion is approximately the same, even though over this\nperiod the scalar and the scalar flux vary considerably, as shown in figures 10\nand 11(b). The variation of scalar concentration with A over one period of the\nflow is given in figure 12(b). During the period this curve becomes modified\nas the scalar is rearranged, but after each period we see that the lines have a\nvery similar appearance. For 13 . A . 27 the two results are indistinguishable\nshowing that the injected scalar from the source term is mixed in this region,\na region which is approximately the same as the region where the diffusion\nvaries greatly over one period, see figure 11(a). For values of A outside this\nregion in figure 12(b) the value of the scalar increases in magnitude as the\nscalar builds up in island regions of low effective diffusion.\nAlthough figure 10 shows how the effective diffusion varies over one period\nof the flow, it is difficult to interpret these figures into one average effective\n18\n(a)\n 0\n 2\n 4\n 6\n 8\n 10\n 12\n 0  5  10  15  20  25  30  35  40\nA\neffK^\n(b)\n 0\n 2\n 4\n 6\n 8\n 0  10  20  30  40\nA\nK eff\n10piT=\nT= 20pi\nT= 40pi\nT= 50pi\n^\nFig. 13. Plot of (a) K̂eff(A) for κ = 10−2, 10−3, 10−4, 10−5 and 10−6 from top to\nbottom and (b) K̂eff(A) for κ = 10−4 with T = 10pi, 20pi, 40pi and 50pi for a scalar\nfield with a source term.\ndiffusion plot. To overcome this we define\nK̂eff = Keff\n∂C\n∂A\n\/\n∂C\n∂A\n, (3.11)\nto be the time–averaged effective diffusion where the bar signifies an average\nover one period of the flow. In figure 13(a) we plot K̂eff(A) for various values\nof κ ranging from κ = 10−2 (top line) through to κ = 10−6 (bottom line).\nEach of these results was time averaged over the period from T = 50pi to\nT + pi. By this time Keff has settled down into an approximate periodic state,\nand hence the time–averaged effective diffusion has appeared to settle down\nas shown in figure 13(b). This figure shows K̂eff(A) for κ = 10\n−4 time averaged\nover one period starting at 10pi, 20pi, 40pi and 50pi, and the difference between\nthe T = 40pi and the T = 50pi results is small showing that Keff is probably\nreaching a steady state. For each value of κ in figure 13(a) the largest effective\ndiffusion values occur close to A = 2pi2 (C = 0) and as κ is reduced the\ntwo maximum peaks in K̂eff(A) move towards this value. For κ = 10\n−4 these\ntwo peaks have become a single maximum in K̂eff . As κ is reduced it takes\nlonger for the scalar in the islands to diffuse, and so Keff takes longer to settle\ndown into a periodic state. The maximum value of K̂eff reduces steadily with\nκ and the difference between successive κ values becomes small by the time\nκ = 10−6. This suggests that K̂eff(A) and hence Keff(A) may approach an\ninviscid limit, however the results in figure 13(a) may not have settled down\nto a steady state, and figure 13(b) shows an extremely slow drift that needs to\nbe examined on an O(κ−1) time scale. The investigation of this is beyond the\nscope of this paper and is left for future study, with the use of simpler flows\nand mappings.\n19\n4 Conclusions and discussion\nIn this paper we have explored the effective diffusion diagnostic for both ide-\nalised, given scalar fields and for advection of a passive scalar in a simple, pe-\nriodic chaotic flow. We studied a two–dimensional scalar field which contains\na saddle point and found that along scalar contours which pass through such\nsaddle points the effective diffusion has a logarithmic singularity. This result\nwas confirmed by two–dimensional incompressible time-periodic simulations of\nthe advection–diffusion equation. The numerical parameters were optimised to\nremove most of the numerical oscillations. These oscillations could be removed\nfurther by using a more accurate method for calculating A(C) from (2.2) than\nthe box counting technique chosen. However the box counting method was\nsufficiently fast and accurate for the purpose of this study. We note that the\npeak in the effective diffusion that arises from saddle points can be considered\na geometrical artefact: it is the fact that ∂A\/∂C diverges at such points that\nmakes Keff diverge. The actual flux at such contours remains finite.\nBy introducing a source of scalar in our numerical simulations we found that\nthe scalar field exhibits an approximate periodic behaviour with the period of\nthe flow, and that in regions of high effective diffusion, the scalar concentration\nfrom the source term is well mixed. By considering a time–average of these\nsimulations we observe that as κ is reduced, the effective diffusion still peaks\naround scalar concentration contours which occur in the chaotic bands of\nthe scalar field. This study shows that the time–averaged effective diffusion\nappears to settle down to a steady state for large times, at least for moderate\nκ. The time–averaging process also removes the singular spikes from Keff and\nmakes K̂eff non–singular; thus it is highly beneficial to time average Keff for\nflows of this type.\nHowever for small κ, the scalar distribution only converges on very long time–\nscales, beyond our simulations, because of the presence of islands. The result-\ning K̂eff initially converges rapidly in the chaotic region and then shows a slow\ndrift with time. The time–averaged results presented in this study suggests the\nexistence of an inviscid limit for K̂eff . However to confirm this (2.1) needs to\nbe integrated to times of O(κ−1) to allow the scalar to reach a steady periodic\nstate, or perhaps smaller values of κ may need to be considered. Both of these\nare beyond our simulations and are left for future study.\nAcknowledgments\nThis work was supported by the EPSRC on grant EP\/D032202\/1. AG is\nalso grateful for the tenure of a Leverhulme Research Fellowship during this\nresearch. The authors would also like to thank the referees for their comments\n20\n0C\nρ x\n=piy\n=pi\nA\n4\nFig. A.1. Plot of the region A\/4 for the scalar field (3.1) with the contour 0 < C \u001c 1.\nwhich have improved the paper.\nA Asymptotics for a two–dimensional scalar field with a saddle\npoint\nHere we consider the two–dimensional scalar field (3.1) with |C| \u001c 1. Hence\nwe are considering a concentration contour close to the saddle points at (0, 0)\nand (−pi,−pi). We assume 0 < C \u001c 1, however a similar expression also holds\nfor −1\u001c C < 0 by symmetry. The region A\/4 given by (2.2) for this contour\nC is given in figure A.1. The value of A for this value of C can be split into\nthree parts\nA(C) = 4\n(∫ pi−ρ\n0\ny dx+\n∫ ρ\npi−ρ\ny dx+\n∫ pi\nρ\npi dx\n)\n= A1(C) + A2(C) + A3(C),\nwhere y = cos−1(cosx− 2C) from (3.1) and ρ = cos−1(2C− 1). Using the fact\nthat C \u001c 1, we can approximate these integrals and calculate the small C\nform of A(C). Clearly A3(C) can be evaluated explicitly as\nA3(C) = 4pi\n2 − 4pi cos−1(2C − 1) = 8pi\n√\nC +\n4\n3\npiC3\/2 +O\n(\nC5\/2\n)\n,\nfor small C.\nTo evaluate the area A2(C) we expand the integrand y = cos\n−1(cosx − 2C)\nfor small C to give\ncos−1(cosx− 2C) = x+ 2\n(1− cos2 x)1\/2C −\n2 cosx\n(1− cos2 x)1\/2C\n2 +O\n(\nC3\n)\n,\n21\nand integrate this with respect to x, which gives\nA2(C) = 4\n[\nx\n2\n]ρ\npi−ρ\n− 8C\n[\n(1− cos2 x)1\/2 tanh−1(cosx)\nsinx\n]ρ\npi−ρ\n+ 8C2\n[\n1\n2 sinx(1− cos2 x)1\/2\n]ρ\npi−ρ\n+O\n(\nC3\n)\n.\nHence we find\nA2(C) = −8C lnC + 2pi2 − 8pi\n√\nC − 4\n3\npiC3\/2 − 8C2 +O\n(\nC5\/2\n)\n.\nA systematic approach to evaluate A1(C) would be to evaluate the integrand\nfor small x, integrate this expression with respect to x and finally expand the\nsolution for small C. However using this method we find that the leading order\nterms in the small C expansion of A1(C) rely greatly on many terms of the\nsmall x expansion of the integrand due to the non–uniformity of the series.\nThus we approximate the leading order term of this integral by using the full\nnumerical solution. We assume A1(C) = A11C + o(C), and we calculate A11\nsimply as\nA11 = lim\nC→0\nA− 2pi2 + 8C lnC\nC\n' 19.07.\nThus the first three terms in the small C expansion for A are\nA(C) = A1 + A2 + A3 = −8C lnC + 2pi2 + 19.07C +O(C2),\nand hence\n∂A\n∂C\n= −8 lnC + 11.07 +O(C).\nThis shows that the effective diffusion has a logarithmic singularity at C = 0,\nunless the integral F (C) has a stronger singularity. Although the numerical\nsolution in figure 2 shows that this is not the case, we calculate the small C\nexpansion for F (C) for completeness, this process is outlined below.\nAs in the above analysis, we split the integral F as\nF (C) = 2\n∫ ρ\n0\nI(x,C)dx = 2\n∫ pi−ρ\n0\nI(x,C)dx+ 2\n∫ ρ\npi−ρ\nI(x,C)dx = F1 + F2,\nwhere\nI(x,C) =\nsin2 x\n(1− cos2 x+ 4C cosx− 4C2)1\/2 + (1− cos\n2 x+ 4C cosx− 4C2)1\/2.\n22\nTo calculate F2(C) we expand the integrand for small C and integrate, which\ngives\nF2(C) = 4C\n2 lnC + 8− 14C +O(C2).\nThis is an interesting result, because the form of F (C) in figure 2 is that of\nan even function, hence we do not expect to have any terms of O(C) in our\nexpansion. We show below that F1(C) is of O(C\n2), so at this point we neglect\nthis O(C) term, as calculations not presented here show it will be removed\nwhen we include more terms in the asymptotic expansion of the integrand.\nWe again use the numerical solution to evaluate F1(C) by assuming F1(C) =\nF11C\n2 + o(C2), and thus\nF11 = lim\nC→0\nF − 8− 4C2 lnC\nC2\n' −15.1.\nTherefore\nF (C) = F1 + F2 = 4C\n2 lnC + 8− 15.1C2 +O(C3),\nwhich when combined with ∂A\/∂C, as in (2.4), gives\nKeff(C) = −64 lnC + 88.56 +O(C lnC).\nB Exact solution of Keff for a three–dimensional scalar field with a\nseparatrix\nIn this appendix we show that Keff is non–singular at three–dimensional hy-\nperbolic points. We consider a cylinder of a scalar tracer, with height 2 and\nradius 1. Inside the cylinder are two cones which meet at the origin as de-\npicted in figure B.1. Inside the cones the scalar is positive, and outside it is\nnegative; hence the origin is a separatrix. The scalar distribution can be given\nanalytically as\nc(r, θ, z) = z2 − r2, (B.1)\nwhere (r, θ, z) are the usual cylindrical polar coordinates. The volume of scalar\ncorresponding to the concentration contour C is given via (2.2) as\nV (C) =\n∫ 1\nr=0\n∫ 2pi\nθ=0\n∫ 1\nz=−1\nH(C − z2 + r2) r dr dθ dz. (B.2)\nThis quantity can be calculated numerically, but by the same argument as in\nappendix A this integral and the corresponding three–dimensional version of\nF (C) can be calculated exactly for this scalar field. Thus for this particular\n23\nFig. B.1. A plot of the three–dimensional scalar field given in (B.1). The inner cones\nrepresent the surface given by C = 0, and inside these cones the scalar is positive\nand outside it is negative.\nscalar field we have a closed form for Keff(C). The triple integral (B.2) can be\nsimplified to\nV (C) =\n∫ 2pi\n0\n∫ 1\n0\nz r dr dθ = 4pi\n∫ (1−C)1\/2\n0\n(\nC + r2\n)1\/2\nr dr + 4pi\n∫ 1\n(1−C)1\/2\nr dr,\nwhich can be integrated to give\nV (C) =\n2pi\n3\n(\n2 + 3C − 2C3\/2\n)\n.\nWhen C < 0 then the volume integral changes to\nV (C) = 4pi\n∫ 1\n(−C)1\/2\nz r dr = 4pi\n∫ 1\n(−C)1\/2\n(\nC + r2\n)1\/2\nr dr =\n4\n3\npi (1 + C)3\/2 .\n(B.3)\nThus\nV (C) =\n\n4\n3\npi (1 + C)3\/2 C < 0,\n2pi\n3\n(\n2 + 3C − 2C3\/2\n)\nC > 0.\n(B.4)\nFor the evaluation of F (C) we can convert the surface integral into an integral\nover r and θ. We again have to consider the cases C > 0 and C < 0 separately,\nbut we can get two exact solutions for this scalar field. When C > 0 we have\n24\n(a)\n 0\n 2\n 4\n 6\n-1 -0.5  0  0.5  1\nC (b)\n 0\n 40\n 80\n 120\n-1 -0.5  0  0.5  1\nC\neffK\nFig. B.2. Plot of (a) V (C) (solid line) and ∂V\/∂C (dashed line) and (b) Keff(C) for\nthe three–dimensional scalar field (B.1).\nF (C) = 2\n∫ (1−C)1\/2\n0\n∫ 2pi\n0\n|∇c|\n(\n1 +\n(\ndz\ndr\n))1\/2\nr dr dθ = 8pi\n∫ (1−C)1\/2\n0\n(\n(2r2 + C)3\nr2 + C\n)1\/2\nr dr,\n=\npi√\n2\n(\n2\n√\n2(2− C)3\/2 − 3\n√\n2C(2− C)1\/2 +\n√\n2C2 + 3C2 ln\n(√\n2 + (2− C)1\/2\n(1 +\n√\n2)C1\/2\n))\n.\nFor the case when C < 0 then the only change to this calculation is the limits\nof integration, thus the integral for F becomes\nF (C) = 8pi\n∫ 1\n(−C)1\/2\n(\n(2r2 + C)3\nr2 + C\n)1\/2\nr dr,\n=\npi√\n2\n(\n2\n√\n2(2 + C)3\/2(1 + C)1\/2 − 3\n√\n2C(2 + C)1\/2(1 + C)1\/2\n+ 3C2 ln\n(\n(2 + C)1\/2 +\n√\n2(1 + C)1\/2\n(−C)1\/2\n))\n.\nThus the effective diffusion for this three–dimensional problem is given as\nKeff(C) =\n\n√\n2pi2(1 + C)1\/2\n(\n2\n√\n2(2 + C)3\/2(1 + C)1\/2\n−3√2C(2 + C)1\/2(1 + C)1\/2 + 3C2 ln\n(\n(2+C)1\/2+\n√\n2(1+C)1\/2\n(−C)1\/2\n))\nC < 0,\n√\n2pi2(1− C1\/2)\n(\n2\n√\n2(2− C)3\/2 − 3√2C(2− C)1\/2\n+\n√\n2C2 + 3C2 ln\n(√\n2+(2−C)1\/2\n(1+\n√\n2)C1\/2\n))\nC > 0.\n(B.5)\nFigure B.2 plots (a) V (C) (solid line) and ∂V\/∂C (dashed line) and (b)Keff(C)\nfor the three–dimensional scalar field given by (B.1). We note that in panel (a)\nboth V (C) and ∂V\/∂C are continuous functions, but V (C) has a discontinuity\nin its second derivative at C = 0. Thus ∂V\/∂C has no singularity at C = 0\nunlike in the two–dimensional case. Also as F (C) has no singularities (see\n25\nappendix B) then Keff(C) in figure B.2(b) has no singularity at C = 0 either.\nAlthough there is no singularity in Keff at C = 0, the maximum effective\ndiffusion still occurs at this point, and so we may expect to see peaks in three–\ndimensional effective diffusion plots, which will be important to the mixing of\nscalar tracers as for the two–dimensional case in §3, but this investigation is\nleft as future study.\nReferences\nBerry, M. V. and Balazs, N. L. (1979). Evolution of semiclassical quantum\nstates in phase space. J. Phys. A, 12(5), 625–642.\nButchart, N. and Remsberg, E. E. (1986). Area of the stratospheric polar\nvortex as a diagnostic for tracer transport on an isentropic surface. J.\nAtmos. Sci., 43, 1319–1339.\nChildress, S. and Gilbert, A. D. (1995). Stretch, Twist, Fold: The Fast Dy-\nnamo. Springer.\nDeese, H. E., Pratt, L. J., and Helfrich, K. R. (2002). A laboratory model\nof exchange and mixing between western boundary layers and subbasin\nrecirculation gyres. J. Phys. Oceanogr, 32, 1870–1889.\nDrazin, P. G. (1992). Nonlinear Systems. Cambridge University Press.\nGhosh, S., Leonard, A., and Wiggins, S. (1998). Diffusion of a passive scalar\nfrom a no-slip boundary into a two-dimensional chaotic advection field. J.\nFluid Mech., 372, 119–163.\nHaynes, P. and Shuckburgh, E. (2000a). Effective diffusion as a diagnostic of\natmospheric transport, 1. stratosphere. J. Geophys. Res, 105, 22777–22794.\nHaynes, P. and Shuckburgh, E. (2000b). Effective diffusion as a diagnostic of\natmospheric transport, 1. troposphere and lower stratosphere. J. Geophys.\nRes, 105, 22795–22810.\nLichtenberg, A. J. and Lieberman, M. A. (1992). Regular and Chaotic Dy-\nnamics, 2nd ed. Springer.\nNakamura, N. (1996). Two–dimensional mixing, edge formation and perme-\nability diagnosed in area coordinate. J. Atmos. Sci., 53(11), 1524–1537.\nOtani, N. F. (1993). A fast kinematic dynamo in two–dimensional time–\ndependent flows. J. Fluid Mech., 253, 327–340.\nPierrehumbert, R. T. and Yang, H. (1993). Global chaotic mixing on isentropic\nsurfaces. J. Atmos. Sci., 50, 2462–2480.\nShuckburgh, D. A. and Haynes, P. H. (2003). Diagnosing transport and mixing\nusing a tracer-based coordinate system. Phys. Fluids, 15, 3342–3357.\nTurner, M. R. and Gilbert, A. D. (2007). Linear and nonlinear decay of cat’s\neyes in two-dimensional vortices, and the link to Landau poles. J. Fluid\nMech., 593, 255–279.\nWiggins, S. (1990). Introduction to Applied Nonlinear Dynamical Systems and\nChaos. Springer.\n26\nWinters, K. B. and D’Asaro, E. A. (1996). Diascalar flux and the rate of fluid\nmixing. J. Fluid Mech., 317, 179–193.\n27\n"}