{"doi":"10.1023\/A:1022942801531","coreId":"66578","oai":"oai:dro.dur.ac.uk.OAI2:1072","identifiers":["oai:dro.dur.ac.uk.OAI2:1072","10.1023\/A:1022942801531"],"title":"A historical record of coastal floods in Britain : frequencies and associated storm tracks.","authors":["Zong, Y.","Tooley, M. J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-05","abstract":"This paper examines flood frequencies in three coastal sectors of Britain and analyses the associated storm tracks and their principal pathways. The results indicate that the east coast of Britain has suffered most floods over the last 200 years. The frequencies of flood incidents in the south and southwest coast of Britain have increased, particularly during the 20th century, whereas on the west coast flood frequencies have declined. Three distinctive pathways of storm track are identified, related to flood incidents in each coastal sector. A southern pathway in a corridor along the 55° N parallel is associated with flood incidents recorded on the south and southwest coast, whilst storms that are associated with floods on the west coast concentrate along the 60° N parallel. The relationship between the frequencies of floods and climatic variations needs to be explored further. However, the development of coastal settlements has certainly increased vulnerability, and hence the risk of flood disasters.\\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66578.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/1072\/1\/1072.pdf","pdfHashValue":"0f8827b3aa7345d8c817df167c3ff4a4a2712e64","publisher":"Kluwer","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:1072<\/identifier><datestamp>\n      2011-07-06T15:34:08Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        A historical record of coastal floods in Britain : frequencies and associated storm tracks.<\/dc:title><dc:creator>\n        Zong, Y.<\/dc:creator><dc:creator>\n        Tooley, M. J.<\/dc:creator><dc:description>\n        This paper examines flood frequencies in three coastal sectors of Britain and analyses the associated storm tracks and their principal pathways. The results indicate that the east coast of Britain has suffered most floods over the last 200 years. The frequencies of flood incidents in the south and southwest coast of Britain have increased, particularly during the 20th century, whereas on the west coast flood frequencies have declined. Three distinctive pathways of storm track are identified, related to flood incidents in each coastal sector. A southern pathway in a corridor along the 55° N parallel is associated with flood incidents recorded on the south and southwest coast, whilst storms that are associated with floods on the west coast concentrate along the 60° N parallel. The relationship between the frequencies of floods and climatic variations needs to be explored further. However, the development of coastal settlements has certainly increased vulnerability, and hence the risk of flood disasters.\\ud\n<\/dc:description><dc:subject>\n        Storm<\/dc:subject><dc:subject>\n         Coastal flood<\/dc:subject><dc:subject>\n         Frequency<\/dc:subject><dc:subject>\n         Storm track<\/dc:subject><dc:subject>\n         Historical records.<\/dc:subject><dc:publisher>\n        Kluwer<\/dc:publisher><dc:source>\n        Natural hazards, 2003, Vol.29(1), pp.13-36 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2003-05<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:1072<\/dc:identifier><dc:identifier>\n        issn:0921-030X<\/dc:identifier><dc:identifier>\n        issn: 1573-0840<\/dc:identifier><dc:identifier>\n        doi:10.1023\/A:1022942801531<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1072\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1023\/A:1022942801531<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1072\/1\/1072.pdf<\/dc:identifier><dc:rights>\n        The original publication is available at www.springerlink.com<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1573-0840"," 1573-0840","issn:0921-030X","0921-030x"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2003,"topics":["Storm","Coastal flood","Frequency","Storm track","Historical records."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n09 April 2008\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nZong, Y. and Tooley, M. J. (2003) ’A historical record of coastal floods in Britain : frequencies and associated\nstorm tracks.’, Natural hazards., 29 (1). pp. 13-36.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1023\/A:1022942801531\nPublisher’s copyright statement:\nThe original publication is available at www.springerlink.com\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n 1\nNatural Hazards \n \n \n \nShortened Title: A Historical Record of Coastal Floods \n \n \n \n \nTitle: A Historical Record of Coastal Floods in Britain: \nFrequencies and Associated Storm Tracks \n \n \n \n \nAuthors: YONGQIANG ZONG1 and MICHAEL J. TOOLEY2 \n \n1 Environmental Research Centre, Department of Geography, University of Durham, Durham, U.K.; \n \n2 School of Geography, Kingston University, Kingston upon Thames, Surrey, U.K. \n \n \n \n \n \n \nCorrespondence: Dr. Yongqiang Zong \n   Department of Geography \n   University of Durham \n   Durham, DH1 3LE \n   The United Kingdom \n \n   Telephone: 0191 3747404 \n   Fax: 0191 3742456 \n   Email: y.q.zong@durham.ac.uk \n \n \n 2\nNatural Hazards 29: 13-36, 2003 \n \nA Historical Record of Coastal Floods in Britain: \nFrequencies and Associated Storm Tracks \n \n \nYONGQIANG ZONG1 and MICHAEL J. TOOLEY2 \n1 Environmental Research Centre, Department of Geography, University of Durham, Durham, U.K.; \n2 School of Geography, Kingston University, Kingston upon Thames, Surrey, U.K. \n \n \nAbstract.  This paper examines flood frequencies in three coastal sectors of Britain and \nanalyses the associated storm tracks and their principal pathways. The results indicate \nthat the east coast of Britain has suffered most floods over the last 200 years. The \nfrequencies of flood incidents in the south and southwest coast of Britain have increased, \nparticularly during the 20th century, whereas on the west coast flood frequencies have \ndeclined. Three distinctive pathways of storm track are identified, related to flood \nincidents in each coastal sector. A southern pathway in a corridor along the 55oN parallel \nis associated with flood incidents recorded on the south and southwest coast, whilst \nstorms that are associated with floods on the west coast concentrate along the 60oN \nparallel. The relationship between the frequencies of floods and climatic variations needs \nto be explored further. However, the development of coastal settlements has certainly \nincreased vulnerability, and hence the risk of flood disasters. \n \nKey words: Storm, coastal flood, frequency, storm track, historical records \n \n \n1. Introduction \n \nOver the last few hundred years, human settlements have flourished in the coastal \nlowlands of the British Isles. Many of these lowlands and their settlements have been \nsubject to sea floods and have relied on the protection of artificial sea defences. \nHowever, storm surges have often exceeded the level of protection, resulting in \nconsiderable losses of property. Among many flood incidents, the 1953 storm surge and \nflood in eastern England resulted in the inundation of 24,000 houses and 200 major \nindustrial premises (Spalding, 1954). On a smaller scale in Towyn in 1990, some 2800 \nhouses were flooded, and repairs to the whole housing stock damaged were estimated to \ncost between £22.4 million and £100.8 million (Tooley, 1992) (approximately $35.8 \nmillion to $161.3 million). Knowledge of the magnitude and frequency of coastal floods \n 3\nis of great value to central and local authorities for land-use planning, environmental \nagencies for coastal management and insurers for evaluating their underwriting \nstrategies.  \n \nCoastal floods are a consequence of a set of factors including storm-induced surge, \nhigh tide (particularly on macro-tidal coasts with tidal ranges of over 4m) and high \nwaves (Townsend, 1981), as well as the condition, nature, strength and height of the \ncoastal and estuarine defences. In many coastal locations, storm-induced surges may \nbe magnified due to the configuration and bathymetry of the shallow seas around the \nBritish Isles, as well as the location and geometry of estuaries. The combination of \nthese factors thus creates a real possibility of continuing and increased coastal flood \nhazard. However, due to climate change such as atmospheric temperature variations \n(e.g. Parker et al., 2000) and oscillations of atmospheric pressure (e.g. North Atlantic \nOscillation (NAO) index , Hurrell, 1995), the possibility of flooding has not been \nconstant. The numbers of storm generated over the North Atlantic are closely related \nto temperature variations (Lamb, 1991), whilst, the NAO index reflects the strength of \nsurface westerlies over Europe especially in the winter (Wilby et al., 1997), and thus \nis related to the pathways of storms or low-pressure cells. Furthermore, a strong high-\npressure system over Scandinavia can block low-pressure cells from moving \neastwards, and divert them towards the Norwegian Sea or south-eastwards into the \nBay of Biscay and English Channel (Knox and Hay, 1985) where the storm surges \nmay be amplified.  \n \nThe objectives of this paper are first to establish the frequencies of flooding in three \ncoastal sectors, and secondly to test whether the floods there are associated with \ndifferent storm track pathways. The three coastal sectors (figure 1) are: (1) the East \nCoast from Aberdeen in Scotland to Ramsgate in Kent, (2) the South and Southwest \ncoast from Dover in Kent to Milford Haven in South Wales, and (3) the West Coast \nfrom southwest Wales to Glasgow in Scotland. These divisions are based on coastal \norientation and a preliminary investigation (e.g. Zong and Tooley, 1995), which \nsuggested that recent flood events on the three coastal sectors are associated with \nstorm tracks that travelled along spatially different pathways. The history of coastal \nfloods for other parts of Scotland can be studied by Hickey (1998). \n \n 4\n \n2. The Study Area \n \nThe British coast is characterised morphologically by a variety of different landscapes. \nThere are estuaries and headlands of solid rock or unconsolidated sediments of glacio-\ngenic origin. Low-lying areas are common adjacent to estuaries, with ground altitudes \nclose to local high-tide level. In England and Wales, alone, there are 750,000 ha of \nground below +5 m Ordnance Datum (OD). Mean High Water is in some places \nrecorded at altitudes higher than +5 m OD and the Highest Astronomical Tide \nsignificantly exceeds this value proportionally. \n \nIn the three coastal sectors, the 18th century saw little progress in urban and industrial \ndevelopments on the coastal lowlands, except for seaports and a few seaside resorts.  \nDuring the early 19th century, a large number of coastal towns emerged owing to the \nadvent of the railways and road networks and people’s desire to visit seaside resorts at \nweekends. These coastal towns expanded constantly in the late 19th century and the \n20th century. While enjoying the coastal amenities, residents had to adapt to flood \nhazards.  Settlements have followed such a development disaster cycle that most of \nthese towns were originally built on relatively higher lands (2m to 3m above the local \nhigh spring tides level). As a consequence of the rapid increase in population since the \nearly 20th century, many towns expanded onto lower lands where protection from \nregular floods by the sea was provided by the construction and strengthening of sea \ndefences. For example, settlements were firstly developed at Benfleet and Southend-\non-Sea, Essex and subsequently from the 1920s extended onto Canvey Island where \nground altitude ranges from 0.5m to 1.9m below local mean high water of spring tides \n(MHWST) (Zong, 1993).  In other areas, coastal lowlands were reclaimed and drained \nfor agricultural production. Consequently, the ground level became lower due to peat \nwastage, de-watering and sediment consolidation. \n \nAs perceived by the general public and even policy makers before the 1980s, the \ngreater the development on these coastal lowlands, the greater benefits that can be \nseen from flood protection.  An increase in the level of protection afforded from \nraised sea embankments has resulted in a rising residential population and urban \nexpansion on the protected lowlands.  However, on many occasions, extreme floods \nhave exceeded the capabilities of the protection system and caused great losses in \n 5\nproperty (Zong et al., 1995). A typical example is Morecambe in Lancashire which \nwas only a village with 2500 residents before the 1850s. It expanded and by the early \n1920s it had a population of over 23,000. The rising population was accommodated \nby housing development extending from higher ground (1.5m to 3.5m above local \nMHWST) to the surrounding areas of lower altitudes (0m to 1.5m above local \nMHWST) (Zong, 1993). After the severe flood in 1907, the first hard sea defence was \nconstructed, and further strengthened in the late 1920s and early 1950s. Such a level \nof protection helped encourage more people to settle, and the population rose to over \n40,000 in the 1980s. Despite the improvement of sea defences, the town was flooded \nin 1977, 1983 and 1990. Similar cases can be seen in Towyn, Wales (Jones, 1992; \nTooley 1992) and Canvey Island, Essex (Cracknell, 1959). Since the 1980s, the \nawareness of environmental issues has increased, and stringent planning policies have \nbeen in place.  \n \n \n3. Data Sources \n \nIn this study, archival flood records were collected and examined for the reconstruction \nof the flood history for the study area. By examining synoptic weather charts, the \nassociated storms were identified, and their tracks were recorded for the analysis of \nstorm pathways. \n \n3.1. Archival flood records \nAccounts of historical sea floods were primarily collected from microfilms of The Times.  \nAn initial search was made in the two series of indexes to The Times, i.e. Palmer's Index \n(from 1785 until 1917) and The Official Index (from 1917 to present).  Cross checking \nwith the microfilms of The Times was undertaken to obtain details of a specific incident. \nBased upon the floods indexed for supplementary information, speculative searches \nwere also conducted at local Public Record Offices where local newspapers, Quarter \nSessions petitions, published and manuscript diaries, school logbooks, family and estate \nletters and papers, and parish registers were examined.  Some church accounts, estate \nletters and diaries proved useful for their detailed descriptions of flood events, \nparticularly prior to Palmer's Index. \n \n 6\nFor the period before the publication of synoptic charts, Palmer's Index and The Official \nIndex are the best source from which to compile at least a preliminary list of storm dates \non which to base further searches.  However in its early days, The Times did not always \nreceive regular news from the northern counties and did not record some smaller storms, \neven though they were locally significant.  The record, therefore, only reflects storms \nthat resulted in major floods and were reported nationally. \n \n3.2. Synoptic and tidal conditions \nDaily, weekly and monthly weather reports published by the Meteorological Office for \nthe period since 1911 were examined. The synoptic condition of storms revealed in the \nhistorical flood records and the tracks of the associated low-pressure cells were analysed. \nThe storm tracks were copied onto a grid map covering an area of 20oW to 20oE and \n65oN to 45oN (Figure 2).  The frequency of these low-pressure cells passing through \neach grid (2.5o Latitude by 5o Longitude) was then counted. Information on wind speeds \nthat are associated with the low-pressure cells was obtained from the ports of Heysham \n(near Morecambe), Lowestoft and Milford Haven, while hourly records of wave-\nsmoothed water level recorded at these seaports were provided by the British \nOceanographic Data Centre, Proudman Oceanographic Laboratory. Both wind speed \nand water level data cover various lengths of time, mostly the last 30 years.  \n \n4. Three Recent Floods \nIn order to understand storm conditions in relation to the floods in the three coastal \nsectors, major flood events (e.g. Lamb, 1991; Zong and Tooley, 1995) were analysed. \nThe spatial relationship between the flooded locations and the associated storm tracks \nsuggests that different pathways of storms (or low-pressure cells) were related to floods \nat different coastal sectors. From the weather reports, 117 storm tracks are retrieved. Out \nof the 117 storms, three typical flood events are selected to demonstrate this relationship. \nThese events prove the legitimacy of dividing the British coast into three sectors for the \nsubsequent analyses. The tracks of the associated low-pressure cells are shown in Figure \n2. \n \nThe 1953 flood in the East Coast: On the 30th January 1953, a low-pressure cell moved \neastwards over the north Atlantic. During the daytime, the central pressure of the cell \ndecreased from 988 mB to 968 mB. It turned south-eastwards into the North Sea on the \n 7\nfollowing day. The tidal surge generated by this low-pressure cell was amplified to 2.3m \nas it was pushed southwards, and met the high tide peak near the southern end of the \nNorth Sea. The strong pressure gradient on the west part of the system helped generate \nstrong winds (sustained surface winds up to 29 m\/s) along the east shore of England. \nSevere waves were deflected towards the coast of East Anglia. This storm caused \nwidespread floods on the East Coast between the River Tees estuary and Dover (Steers, \n1971). \n \nThe 1977 flood in the West Coast: During the 9th to 12th November 1977, a well-\nestablished low-pressure cell moved north-eastwards clipping the north coast of \nScotland. Over this period, the barometric pressure of the low-pressure cell decreased \nfrom 972 mB to 960 mB at its centre. Associated with the low-pressure cell, strong \nwesterly winds (sustained surface winds up to 25 m\/s) were recorded along the English \ncoast of the Irish Sea. These onshore winds generated waves which pounded on the sea \ndefences of Morecambe and many other coastal towns. The low-pressure cell also \ninduced a major tidal surge into the Irish Sea. As recorded at Heysham, the surge was \n1.8 m high and occurred one to two hours earlier than the peak of a high spring tide \n(Zong and Tooley, 1995). The combined effects of high tide, storm surge and waves \ncaused the sea defence in Morecambe to fail and flooding occurred in the early hours of \nthe 12th November with floodwater of c. 0.5m deep in a number of places. \n \nThe 1981 flood in the South and Southwest Coast: After a cold spell in the middle of \nDecember, a couple of low-pressure cells developed over the North Atlantic. One of the \nlow-pressure cells was generated on the 28th December with a central pressure of 960 \nmB. This cell moved eastwards and entered the English Channel during the 30th when a \ntidal surge of 0.9m was generated at Milford Haven, Wales. The water level was raised \nto 3.5m above m.s.l., when the surge met with the high tide. During the 30th when the \nlow-pressure cell travelled through the English Channel, the narrow isobars on the \neastern part of the system generated strong onshore winds (sustained surface winds up to \n22 m\/s). As a result, high waves lashed the seafront of the south coast and caused \nflooding in a number of locations (see Table 2). \n \nThese three coastal floods seem to confirm that the key conditions for major coastal \nflooding include (1) a significantly high tidal surge occurring around a high spring \n 8\ntide at a given coastal locality (Townsend, 1981) and (2) strong onshore (or along-\nshore) winds that generate high waves (Golding, 1981). Thus, it can be hypothesised \nthat such conditions occurring in each coastal sector are associated with a specific \nspatial pathway of low-pressure cells (Figure 2). \n \nThere is a lack of information on waves. Judging by the limited wind fetch within the \nIrish Sea, English Channel and the North Sea, waves may not be very high, but \nsufficiently strong to damage sea defences particularly when sea walls are in poor \ncondition. Based on observations over 18 months from October 1974 to March 1976 \nin the Irish Sea (Hydraulics Research Station, 1976), significant wave heights \noffshore for different return periods were calculated (Table 1). A few years later, the \ninshore significant wave heights for the 1977 event were established based on \nobserved meteorological conditions (Allott & Lomax Consulting Engineers, 1979).  \n \n5. Frequencies \nThe frequencies of coastal flooding for each decade since the 1780s show contrasting \npictures between the three coastal sectors (Figure 3). The decade data were smoothed \nwith a 5-term binomial filter, in which the smoothed value for each decade was a \nweighted average of a window of 5 decades with weights in the ratio 1:4:6:4:1. A 3-\nterm binomial filter and copying of end values were used towards the ends of the \nseries. \n \nIn total, the East Coast has experienced much higher flood frequencies than other \nsectors. Overlying the inter-decadal variability, the flood history of the East Coast can \nbe divided into four phases. Firstly, the 1780s to 1840s saw a steady increase in flood \nfrequency (Figure 3), followed by the second phase, the 1850s to 1900s, when flood \nfrequencies fluctuated. These two phases coincided with the generally cool conditions \nduring the late 18th and early 19th centuries (e.g. Jones and Bradley, 1992). There is a \nmark increase in flood frequency from the 1910s to 1930s. Such an increase seems to \ncorrespond to a rise in atmospheric temperature of the Northern Hemisphere (e.g. Fu \net al., 1999; Parker et al., 2000) and strong positive NAO indexes (e.g. Hurrell, 1995), \ni.e. a warmer climate and stronger westerly airflow over the Northern Atlantic and \nEurope. The final phase, i.e. since the 1940s, saw relatively low numbers of floods \nexcept the 1950s and 1980s. This generally declining trend in flood frequency is \n 9\nassociated with a small decrease in temperature and a negative NAO indexes between \nthe 1940s and 1970s. However, it is noted that the slightly high flood frequency in the \n1980s seem to coincide with the rise in temperature and the positive NAO indexes.  \nBut the low number of floods in the 1990s does not fit with the climate trend. \n \nRelatively lower numbers of floods were recorded for the South and Southwest Coasts \nfor the 19th century. From the 1890s to 1940s, flood frequencies increased steadily, \napparently coincided with the rise of temperature and positive NAO indexes. The \ndeclining flood frequencies during the 1950s and 1960s are associated with the small \ndecrease of temperature and evidently negative NAO indexes. However, the relatively \nhigh number of floods in the 1970s does not correlate well with the relatively low \ntemperature (e.g. Parker et al., 2000). Further decline in flood frequency since the \n1970s contradict with the fact that temperature rose and the NAO indexes appeared \nstrongly positive during this period. \n \nOn the West Coast, the number of flood incidents was relatively consistent for the \nperiod between 1780s and 1860s, after which flood frequency rose to its highest in the \n1890s. Such a trend seems to contradict the changes in temperature and there is no \ncorrelation with the NAO indexes. Since the 1890s, there has been a general decline \nin flood frequency, with the one exception of higher number recorded for the 1920s \nand associated with a rise in temperature. The slight increase in flood frequency in the \nlast three decades seems to coincide with the rising temperature and positive NAO \nindexes. \n \nThe above analyses suggest that the variability of flood frequencies recorded since the \n1780s from the three coastal sectors (Figure 3) seems to a certain extent related to \nclimate change, particularly the temperature of the Northern Hemisphere and the \nNAO index. However, there are also mismatches between flood frequencies and \nclimatic variables. Notable is the fact that the rapid rise in temperature and NAO \nindex since the 1980s has not resulted in a sharp increase in flood incidence. This \nparticular discordance may be explained by the fact that flood defence systems have \nbeen greatly strengthened, and thus the vulnerability to flood hazard has been \nreduced. For example, after the infamous flood of 1953, the Thames Barrier was \nconstructed in the 1980s and the associated sea and estuarine defences further \n 10\nstrengthened and raised. Consequently, flood incidents recorded from the Thames \nestuary reduced substantially (Table 2). On the South Coast the majority of floods \nrecorded between the 1940s and 1980s is from newly extended coastal towns. Such an \nincreased vulnerability has resulted in an increase in the incidents of flood. Since the \n1980s, flood frequencies have declined sharply, which may be attributed to the latest \nimprovement to the sea defences, i.e. a reduction of vulnerability. Therefore, the flood \nrecords in Figure 3 reflect the variability of risk since the 1780s, i.e. the risk of coastal \nfloods is the interaction of the hazard (storms or physical phenomena, see White, \n1974) and vulnerability (exposure of human society to hazard, see Hewitt, 1983).  \n \n6. Storm Tracks \nFor the floods on the East Coast, 51 storm tracks were examined for the period between \n1910 and 1995. The frequencies of these storms passing each grid are shown in Figure 4. \nThis diagram shows high frequencies of storm tracks in the north and central North Sea, \nrepresenting a principal pathway as indicated by the arrow. This pathway, as typified by \nthe 1953 event (Figure 2), implies that storm cells passing over northern Britain and \nturning south-eastwards into the North Sea are most likely to cause flooding on the East \nCoast. This is because storm cells over the North Sea can generate tidal surges and \nwaves that affect the East Coast. Similar to the 1953 event, the strong wind in the west \nsector of storm cells (anti-cyclones) can generate waves along shore of the East Coast.  \n \nFor the South and Southwest Coast, 48 storm tracks were obtained from the synoptic \ncharts. As shown in Figure 5, most storms are concentrated in a corridor along the 55oN \nparallel. Thus, the principal pathway travelled eastwards into the English Channel or the \nBristol Channel, as indicated by the arrow. As suggested by the 1981 event (Figure 2), \nthis pathway is associated with storms that propel tidal surges onto the South and \nSouthwest Coasts and generate strong onshore winds. \n \nThe low number of floods on the West Coast between 1910 and 1950 was probably \nassociated with the fact that only 18 storms were recorded. Their frequencies in each \ngrid are shown in Figure 6. It is noticeable that they are concentrated along the 60oN \nparallel. Thus, the principal pathway can be easily defined, and is indicated by the arrow. \nThe storm track of the 1977 event falls precisely within this pathway. \n \n 11\nAdding all three pathways together, it becomes clear that floods in each coastal sector \nare associated with storms with distinctive pathways. Each pathway has its unique \ncombined affects such as tidal surge and onshore waves on the associated coast, hence \nthe risk of flooding. As mentioned earlier, the blocking effect of the Scandinavian \nhigh-pressure system may play a role in diverting storm cells from travelling \neastwards into or across the North Sea. The NAO indexes constructed by Hurrell \n(1995) reflect the winter surface pressure gradient between Lisbon (Portugal) and \nStykkisholmur (Iceland), which may carry little information of pressure gradient \nbetween Scandinavia and the British Isles. The variability of the Scandinavian high-\npressure system must therefore be established in order statistically verify to the spatial \nmodel of the three storm pathways.  \n \n7. Discussion and Conclusion \nCoastal flood hazard is a complex phenomenon involving a number of variables such \nas climate change, coastal type and evolution, and human activities. Instrumental \nrecords are increasingly accurate but short in time span and discontinuous. \nDocumentary records do not contain numerical details of each flood event, but are \naccurate in terms of occurrence and location of flood hazard. Thus, they provide an \nimportant complement to instrumental records since documentary records cover much \nlonger time spans and are useful as a corollary to studies of regional and global \nclimate change (Cesar 1991, Reading 1990, Subbaramayya and Mohana 1984). Much \nlonger records of flood hazard can be obtained from stratigraphic sequences (Tooley \net al., 1997; Zong and Tooley 1999). \n \nAmong the three coastal sectors, the East Coast has been mostly prone to flood \nhazards (Figures 3 and 4). The vulnerability of the East Coast to flood is also high due \nto the fact that the low-lying coastal lowland has been reclaimed extensively for \nagricultural and industrial production and settlements. Such a combination has made \nthe East Coast at high risk to coastal flood. Similarly, the high number of flood \nincidents on the South and Southwest Coast (Figure 3) and the recent rapid \ndevelopment of coastal settlements have put this coastal sector at high risk. Due to the \nlower frequencies of flood hazard and lower level of development, the risk to the \nWest Coast is less than the other two coastal sectors. \n \n 12\nThe frequencies of flood incidents recorded from the three coastal sectors are to a \ncertain extent related to climate variability. However, in this paper, only storms that \nwere related to flood events have been examined and not the record of all storms. \nFuture research, therefore, may need to examine statistically the changes in storm \nfrequency in relation to climate variables. The increased number of flood incidents on \nthe South Coast suggests that the number of storms travelling along a southern \npathway (Figure 5) may have increased during the 20th century. \n \nMany studies indicate the link between climatic variation and the strength of storms \n(Emmanuel 1987, Lamb 1985, 1991, Raper 1993, Wendland 1977), and show \nsignificant changes in UK climate (Briffa et al., 1990, Coker et al., 1980) and over \nnorth Atlantic ocean (Deser and Blackmon 1993; Kushnir 1994; Rogers 1985). \nStudies also imply the relations of North Atlantic Oscillations to the strength of \nwesterlies, which is indirectly associated with storm pathways (Hurrell 1995; Wilby et \nal. 1997). However, the pressure gradients between Scandinavia and the British Isles \nneed to be understood in order for the proposed model of three storm pathways to be \nverified.  \n \n \nAcknowledgements \n \nThis research is partly funded by the National Radiological Protection Board, Chilton, \nDidcot, Oxon, UK (Contract No. 90290000). The authors are grateful to the referees \nwhose constructive comments have helped improve the paper greatly. Thanks are also \ngiven to Mrs V. Innes for her contributions in collecting the flood records, Dr. N. Cox \nfor the calculations of the flood frequency trends and to the Drawing Office, \nDepartment of Geography, University of Durham for the preparation of diagrams.  \n \nReference \n \nAllott & Lomax Consulting Engineers 1979. Study of Morecambe Sea Defences. \nUnpublished report to Lancaster City Council. \n \n 13\nBriffa, K.R., Jones, P.D. and Kelly, P.M. 1990. 'Principal component analysis of the \nLamb catalogue of daily weather types: part 2, seasonal frequencies and update to 1987', \nInternational Journal of Climatology, 10, 549-563. \n \nCésar,C. 1991. 'Five hundred years of hurricanes in the Caribbean: Their relationship \nwith global climatic variations', GeoJournal, 23(4), 301-310. \n \nCoker, A.M., Thompson, P.M., Smith, D.I. and Penning-Rowsell, E.C. 1989. 'The \nimpacts of climate change on coastal zone management in Britain: a preliminary \nanalysis',  The Publications of the Academy of Finland 9\/89, Conference on Climate and \nWater 2, 148-160. \n \nCracknell, E.B. 1959. Canvey Island: the history of a marshland community. \nDepartment of English Local History Occasional Paper, No. 12, Leicester University \nPress. \n \nDeser, C. and Blackmon, M.L. 1993. Surface climate variations over the north Atlantic \nocean during winter: 1900-1989. Journal of Climate, 6, 1743-1753. \n \nEmmanuel, K.A. 1987. 'The dependence of hurricane intensity on climate', Nature, 326, \n483-485. \n \nFu, C., Diaz, H.F., Dong, D. and Fletcher, J.O. 1999. Changes in atmospheric \ncirculation over Northern Hemisphere oceans associated with the rapid warming of \nthe 1920s. International Journal of Climatology, 19, 581-606. \n \nGolding, B. 1981. The meteorological input to surge and wave prediction. In D.H. \nPeregrine (ed.): Floods due to high winds and tides. Academic Press, London, 1-8. \n \nHewitt, K. (ed.) 1983. Interpretation of calamity from viewpoint of human ecology. \nAllen and Unwin, Boston. \n \nHickey, K.R. 1998. Documentary records of coastal storms in Scotland. Unpublished \nPhD dissertation, Coventry University. \n 14\n \nHurrell, J.W. 1995. Decadal trends in the North Atlantic Oscillation: regional \ntemperature and precipitation. Science, 169, 676-679. \n \nHydraulics Research Station 1976. Lune Foreshore, Morecambe Bay: Wave Statistics. \nUnpublished Report No. EX754. \n \nJones, M. 1992. When the sea came by: the story of a flooded coast. The Workers’ \nEducational Association, North Wales, pp102. \n \nJones, P.D. and Bradley, R.S. 1992. Climatic variations over the last 500 years. In \nBradley, R.S. and Jones, P.D. (eds.) Climate since A.D. 1500. Routledge, London, \npp.649-665. \n \nKnox, J.L. and Hay, J.E. 1985. Blocking signatures in the northern hemisphere: \nfrequency distribution and interpretation. International Journal of Climatology, 5, 1-16. \n \nKushnir, Y. 1994. Interdecadal variations in North Atlantic sea surface temperature and \nassociated atmospheric conditions. Journal of Climate, 7, 141-157. \n \nLamb, H.H. 1985. 'The Little Ice Age period and the great storms within it', in Tooley, \nM.J. and Sheail, G.M. (eds) The Climatic Ssene, George Allen and Unwin, London, 104-\n131. \n \nLamb, H.H. 1991. 'Historical Storms of the North Sea, British Isles and Northwest \nEurope', Cambridge University Press, Cambridge. \n \nParker, D.E., Horton, E.B. and Alexander, L.V. 2000. Global and regional climate in \n1999. Weather, 55, 188-199. \n \nRaper, S.C.B. 1993. 'Observational data on the relationships between climatic change \nand the frequency and magnitude of severe tropical storms', in Warrick, R.A., Barrow, \nE.M. and Wigley, T.M.L. (eds) Climate and sea-level change: observations, projections \nand implications, Cambridge University Press, Cambridge, 192-212. \n 15\n \nReading, A.J. 1990. 'Caribbean tropical storm activity over the past four centuries', \nInternational Journal of Climatology, 10, 365-376. \n \nRogers, J.C. 1985. Atmospheric circulation changes associated with the warming over \nthe northern North Atlantic in the 1920s. Journal of Climatology and Applied \nMeteorology, 24, 1303-1310. \n \nSpalding, J.V. 1954. A general survey of the damage done and action taken. \nConference on the North Sea Floods of 31 January – 1 February 1953. The Institute \nof Civil Engineers, London, 3-15. \n \nStrees, J.A. 1971. The East Coast floods: 31 January – 1 February 1953. In J.A. Strees \n(ed.): Applied Coastal Geomorphology. Macmillan, London, 198-223.  \n \nSubbaramayya, I. and Mohana Rao, S.R. 1984. 'Frequency of Bay of Bengal cyclones in \nthe post-monsoon season', Monthly Weather Review, 112, 1640-1642. \n \nTooley, M.J. 1992. Sea-level changes and the impacts on coastal lowlands. Journal of \nthe Society of Fellows, 7(1), 36-45. \n \nTooley, M.J., Zong, Y. and Innes, J.B. 1997. Holocene storm surge signatures. In: \nJablonski, N.G. (ed.), The Changing Face of East Asia During the Tertiary and \nQuaternary. Centre of Asian Studies, Hong Kong, pp. 138-149. \n \nTownsend, J. 1981. Storm surges and their forecasting. In D.H. Peregrine (ed.): \nFloods due to high winds and tides. Academic Press, London, 1-8. \n \nWendland, W.M. 1977. 'Tropical storm frequencies related to sea surface temperatures', \nJournal of Applied Meteorology, 16, 477-481. \n \nWhite, G.F. 1974. Natural Hazards: local, national, global. Oxforf University Press, \nOxford. \n \n 16\nWilby, R.L., O’Hare, G. and Barnsley, N. 1997. The North Atlantic Oscillation and \nBritish Isles climate variability, 1865-1996. Weather, 0, 266-276. \n \nZong, Y. 1993. Flandrian Sea-level Changes and Impacts of Projected Sea-level Rise \non the Coastal Lowlands of Morecambe Bay and the Thames Estuary, U.K. \nUnpublished PhD thesis, University of Durham, U.K. \n \nZong, Y. and Tooley, M.J. 1995. The Incursion of Marine Sediment Inland During \nSevere Storms. Contract report to the National Radiological Protection Board, pp 175.  \n \nZong, Y. and Tooley, M.J. 1999. Evidence of mid-Holocene storm-surge deposits \nfrom Morecambe Bay, northwest England: A biostratigraphical approach. Quaternary \nInternational, 55, 43-50. \n \nZong, Y., Tooley, M.J. and Donohgue, N.M.D. 1995. Geographical Information \nSystems and sea flooding risk assessment in the Thames lowlands. Journal of the \nSociety of fellows, 9(2), 3-18. \n \n \n \n \n \n \n \nTable 1 Significant wave heights in the Irish Sea \n \n Return periods (years) \n 10 25 50 100 \nOffshore* 6.60 7.00 7.30 8.10 \nInshore** 4.00 4.35 4.60 5.20 \n* from Hydraulics Research Station (1976) \n** from Allott & Lomax Consulting Engineers (1979) \n 17\nTable 2. Coastal Flood Records for England, Wales and part of Scotland \n  (1788-1995 AD) \n \nA. East Coast (Aberdeen to Ramsgate) \n \nYear Month Day Location       \n           \n1788 Jan 25 London         \n1788 Jan 18 Hull         \n1788 Dec 15 London         \n1791 Feb 3 Canvey Island and Foulness      \n1793 Feb 12 London         \n1796 Dec 3 London         \n1800 Nov 28 Scarborough        \n1802 Oct 13 London         \n1804 Sept 23 Reculver        \n1806 Dec 26 London, Ipswich       \n1809 Jan 29 Bedford Levels        \n1811 Nov 1 Leith         \n1811 Nov 8 Edinburgh, Berwick       \n1814 Dec 28 London         \n1821 Dec 25 London and Fenland       \n1822 Jan 4 London         \n1824 Dec 23 Strood, Kent        \n1825 Feb 10 London, Dartford, Stone and Erith     \n1825 Feb 3 Faversham        \n1825 Feb 10 Sheerness and Blue Town       \n1827 Nov 7 Margate and Ramsgate       \n1827 Oct 31 London         \n1833 Nov 2 London         \n1834 Jan 22 London         \n1834 Jan 27 London         \n1835 May 14 London         \n1836 Feb 17 London         \n1836 May 1 Gravesend and Strood, Kent      \n1838 Feb 25 Port Erskine and Bell Rock      \n1841 Dec 1 London         \n1841 Oct 18 London, Southend       \n1841 Dec 1 London         \n1842 Mar 12 London         \n1842 Oct 7 London         \n1843 July 31 London         \n1844 Mar 3 London         \n1844 Aug  18 London         \n1844 Dec 10 London         \n1845 May 22 London         \n1845 Dec 6 London         \n1845 Dec 11 Sheerness        \n1847 Oct 6 Perth         \n1847 Sept 26 London         \n1848 Oct 17 London         \n1848 Dec 12 London         \n1849 Dec 27 Yare, Waveney and Bure river valleys     \n1850 Jan 29 London, Fenland and Hull      \n1852 Jan 6 Ipswich         \n1852 Nov 12 London         \n1857 Sept 24 London and Kent\/Essex coasts      \n1860 Mar 7 London and Essex Marshes      \n1862 Nov 12 London         \n1862 May 13 Fenland         \n 18\n1866 Nov 24 London         \n1874 Mar 4 London         \n1875 Oct 14 Hartlepool        \n1875 Nov 15 London, Kent\/Essex coasts, Berwick, Whitby    \n1876 Dec 20 Dundee         \n1877 Oct 26 London         \n1877 Sept 9 London         \n1877 Oct 8 Sheppy, Milton, Queensborough, Sheerness    \n1877 Jan 2 London, Maldon, Berwick, South Shields, Scarborough   \n1877 Jan 31 London, Sittingbourne, Fenland, Scarborough, Goole, Great Yarmouth \n1877 Oct 8 London         \n1880 Oct 10 Sheerness        \n1880 Oct 27 Hartlepool         \n1880 Nov 16 Sittingbourne and Sheerness      \n1881 Dec 21 London         \n1882 Feb 19 London         \n1882 Aug 30 London         \n1882 Sept 29 London         \n1882 Oct 27 London, Sheerness, Whitby      \n1882 Nov 11 London         \n1883 Sept 19 London         \n1886 Jan 6 London         \n1886 Jan 22 London         \n1897 Nov 29 London         \n1900 Oct 26 North Shields        \n1901 Dec 14 Lowestoft        \n1901 Nov 12 Scarborough, Eyemouth\"       \n1902 Feb 26 Lowestoft        \n1904 Feb 3 London         \n1905 Jan 7 Ramsgate, Lowestoft, Hartlepool, Spalding, Scarborough, Great Yarmouth, \nSheerness        \n1908 Nov 23 Herne Bay, Lowestoft       \n1912 Aug 25 Cromer         \n1914 Mar 14 Southend on Sea        \n1918 Jan 15 Shoreham        \n1919 Feb 17 Grimsby         \n1920 Jan 8 Tayside and Perth       \n1920 May 29 Louth, Lud valley, Grimsby      \n1921 Nov 1 Thames mouth and Midway      \n1921 Dec 17 Hull and Teesside     \n1922 Mar 8 Margate     \n1922 Apr 14 London     \n1922 Oct 27 Skegness     \n1923 Oct 10 Hull, Scarborough     \n1925 Nov 25 Aldborough coastal marshes     \n1927 Feb 5 Thames valley Chiswick     \n1927 Mar 5 Thames valley Eel Pie Island     \n1927 Sept 19 Boston area coast     \n1927 Sept 23 Scarborough     \n1927 Nov 9 London     \n1927 Dec 26 Lowestoft     \n1928 Jan 6 London, Mersea     \n1928 Mar 22 Hull, Berwick     \n1930 Sept 24 Hull and Owston Ferry     \n1930 Nov 8 London, Southend     \n1935 Feb 6 Southend and Benfleet     \n1935 Sept 15 Barton on Humber     \n1936 Feb 23 London, Kirkcaldy, Aberdeen     \n1936 Mar 1 Hull     \n1936 Nov 1 London     \n 19\n1936 Dec 1 London, Lowestoft, Great Yarmouth, Southend, Ramsgate   \n1938 Jan 17 Southend     \n1938 Feb 12 Margate, Cromer, Maldon, London, Felixtowe, Grimsby   \n1938 Apr 3 Horsey, London     \n1943 Apr 6 Southend     \n1946 Dec 8 Lowestoft     \n1948 Aug 8 Jaywick near Clacton on Sea, Sandgate, London    \n1948 Aug 11 Berwick, Eyemouth     \n1949 Mar 1 London, Sheerness, Margate, Southend, Woodbridge, Boston, King's Lynn \n1951 Dec 29 London     \n1953 Jan 31 Kent Coast to Spurn Head Humber including London   \n1954 Sept 1 Richmond on Thames       \n1954 Jan 3 Wells, Norfolk; Alderburgh, Suffolk; Barmston near Bridlington  \n1954 Oct 14 Hull         \n1954 Dec 22 Great Yarmouth        \n1954 Nov 11 Southend, Hull, Strood       \n1955 Jan 11 Putney, Millbank, Tilbury, Southend, Hull, Scarborough, Cleethorpes  \n1955 Feb 24 Cleethorpes, Scarborough, Sandilands     \n1957 Feb 16 Suburbs in Thames valley       \n1958 Oct 15 Putney         \n1959 Dec 30 Hull, Ipswich, Dendee       \n1961 July 4 Southend        \n1963 Nov 19 London         \n1965 Jan 20 Dymchurch, Hull       \n1969 Sept 29 Overstrand, Norfolk       \n1973 July 16 Grimsby and Cleethorpes       \n1975 Mar 20 Lowestoft        \n1976 Jan 3 Towns from Hull to Lowestoft inland to railway \n1980 Mar 19 Grimsby \n1980 Apr 20 Felixstowe \n1983 Feb 1 Lowestoft, Great Yarmouth, Redcar \n1984 Sept 26 Thames at Putney \n1988 Mar 2 Great Yarmouth, Burl and Thurne valleys \n1989 Feb 14 Britlingsea, Wivenhoe and Southwold \n1993 Feb 21 Norfolk to Kent coast, Great Yarmouth, Spurn Head, Scarborough \n1993 Nov 14 Goxhill, Humberston, Ashby cum Fenby, Cayton near Scarborough \n    \nB. South and Southwest Coasts (Dover to Milford Haven) \n \nYear Month Day Location       \n \n1792 Mar 1 Sussex Coast        \n1796 Jan 25 Bristol         \n1808 Nov 18 Coast Folkstone to Isle of Wight      \n1811 Oct 11 Exemouth, Budleigh Salterton      \n1813 Oct 11 Folkstone        \n1821 Dec 25 to 27 Lewes, Plymouth, Cawsand      \n1822 Oct 13 Brighton       \n1822 Dec 5 Brighton       \n1824 Nov 22 Sidmouth        \n1827 July 11 Romney Marsh        \n1841 Oct 18 Dover         \n1843 Oct 10 Dover         \n1845 Jan 27 Dover         \n1846 Jan 28 to 30 Bristol, Clevedon, Portbury, Barnstable & Western Super Mare  \n1846 Aug 8 Bristol         \n1857 Oct 7 Ryde, Isle of Wight & Eastbourne     \n1858 Dec 2 Kemptown, near Brighton      \n1867 Jan 5 to 7 Portland, Weymouth, Penzance & Lands End    \n1875 Oct 19 Dawlish         \n 20\n1875 Nov 11 to 15 Hastings, Eastbourne, Weymouth, Brighton, Worthing, Portsmouth  \n   Southampton, Southsea Castle, Bude & Helston    \n1876 Dec 5 Portsmouth & Southampton      \n1876 Dec 31 Portsmouth        \n1877 Jan 1 to 3 Southampton, Weymouth, Dover      \n1877 Jan 31 Dover         \n1878 Sept 28 Low lying seaports on south coast      \n1883 Sept 17 Brighton, Hove, Worthing      \n1883 Oct 17 Cardiff, Severn Tunnel, Coldcott      \n1902 Feb 28 Southampton        \n1902 Sept 10 Ilfracombe, Weston super Mare, Appledore, Bristol, Watchet, Dover, \nFolkstone        \n1904 Feb 3 Portsmouth, Weymouth, Portland, Bude, Penzance   \n1905 Jan 7 Dover         \n1905 Feb 26 Dover         \n1905 Nov 26 Hastings, St Leonards, Bexhill on Sea, Brighton, Sandgate, Folkstone \n1908 Feb 22 Dover         \n1909 Dec 1 Dover         \n1910 Dec 16 Dover, Worthing, Southsea, Ilfracombe, Avonmouth, Exmouth & Selsey \n1912 Dec 26 Cowes & Southampton       \n1914 Mar 16 Ilfracombe        \n1916 Nov 5 Portsmouth & Bournemouth      \n1917   Hallsands        \n1921 July 29 Folkstone        \n1922 Mar 8 Dover, Folkstone       \n1922 Apr 14 Sharpness        \n1923 Oct 10 to 12 Severn Beach near Bristol, Portsmouth, Hastings, Folkstone, Sandgate, \nDover         \n1924 Dec 27 Portsmouth, Southsea, Folkstone, Sandgate, Deal    \n1925 Nov 8 Folkstone \n1927 Sept 23 Folkstone, Dover \n1927 Dec 21 to 26 Chesil Beach, Portland, Dover, Deal \n1928 Feb 16 Alum Bay, Isle of Wight \n1930 Feb 1 Portland and Chesil Beach \n1930 Mar 16 Winchelsea \n1935 Feb 6 Cowes Isle of Wight \n1936 Jan 9 Newport \n1936 June 18 Portsmouth and Southsea \n1936 Nov 12 \"Portland, Castletown, Chesil Beach \n1936 Dec 18 Cardiff to Newport Road \n1939 Jan 20 Chesil Beach at Portland \n1942 Dec 23 Chesil and Portland \n1942 Feb 13 Portland \n1943 Jan 30 Sussex Coast \n1945 Dec 18 Seaford & Chesil \n1945 Dec 21 Starcross, Dawlish, Teignmouth      \n1945 Dec 24 Seaford and Hastings       \n1946 Dec 8 Hastings, Pevebsey Bay, Seaford, Eastbourne, Sandgate   \n1947 Nov 12 Seaford         \n1947 Dec 27 Hastings, Emsworth, Sandgate      \n1948 Jan 29 Looe, Saltash & Brixham      \n1948 Aug 8 to 11 Felpham near Bognor, Hastings, Folkstone     \n1949 Oct 23 Hastings, Hythe, Folkstone, Sandgate     \n1949 Nov 21 Folkstone, Sandgate       \n1951 Dec 29 Kent and Sussex coasts extensive, St. Leonards & Severn valley  \n1952 Aug 10 Seaford         \n1952 Jan 30 Bude         \n1953 Sept 23 Bristol and Pill on Avon       \n1953 Nov 1 Sandgate        \n1954 Jan 3 Bude         \n 21\n1954 Sept 14 Ashton Gate, Bristol       \n1954 Nov 26 Worthing to Lancing road, Teignmouth & Newhaven to Seaford road \n1955 Jan 14 Weare Gifford, Devon \n1957 Feb 16 Bridgewater, Combwich and Ilfracombe \n1957 Sept 24 Westward Ho!, Bideford, Appledore, Instow, Ilfracombe & Bristol Channel \n1957 Dec 10 Starcross, Saltash, Topsham, Devon & Weymouth to Bournemouth road \n1960 Oct 8 Exmouth, Torquay, Brendon (north Deven) & Southampton \n1963 Nov 19 Hastings, Folkstone \n1965 Jan 20 Bournemouth \n1971 Oct 19 Sandgate \n1974 Jan 11 Amroth, Pembrokeshire & Barnstaple \n1974 Feb 10 to 11 Severn Valley, Dawlish, Uckfield, Hailsham, Lewes, Christchurch, \nFolkstone \n1974 Nov 15 St Ives, Preston to Weymouth & Cuckmere valley \n1976 Sept 14 Polperro \n1976 Oct 14 Torquay \n1978 Jan 4 Torcross and Beesands \n1978 Jan 11 Sandgate \n1978 Feb 8 Severn at Gloucester       \n1978 Dec 13 Portland         \n1979 Feb 13 Portland         \n1979 Dec 13 Portland         \n1981 Mar 9 Bridgend, Cardiff, Swanage, Bridport, Corfe Castle    \n1981 Dec 30 Hayling Island, Cowes, Mudeford Bay, Yarmouth, Weston super Mare, \nBurnham on Sea, Minehead, Clevedon, Porlock, Watchet, Bridgenorth, \nHythe, Sandgate \n1984 Apr 16 Burnham on Sea        \n1985 Apr 7 Portsmouth, Hayling Island, Eastney & Elmer near Bognor Regis  \n1985 Dec 26 Avon Valley        \n1987 Oct 9 Isle of Wight        \n1988 Jan 5 Ryde, Isle of Wight       \n1989 Dec 20 Sidmouth, Dawlish, Budleigh Salterton, Lympstone & Southampton  \n1994 Dec 4 Severn valley at Gloucester     \n            \nC. West Coast (Cardigan Bay to Glasgow) \n        \nYear Month Day Location \n \n1789 Jan  23 Liverpool \n1792 Dec  Beetham \n1794 Nov  Abbey Holme \n1796 Jan  23 to 25 Liverpool \n1796 Dec  Greenock \n1802 Jan  20 to 21 Whitehaven \n1806 Dec  20 to 27 Whitehaven, Ballantrae, Rothersay \n1814 Dec  22 to 23 Lancaster, Greenock \n1814 Dec  16 to 17 Port Glasgow \n1818 Jan  12 to 15 Glasgow \n1819 Aug  31 Whitehaven \n1821 Nov  30 Douglas, Liverpool \n1822 Nov  12 to 13 Liverpool \n1823 Dec  5 Bootle \n1827 Jan  17 Liverpool \n1833 Nov  28 Liverpool \n1841 Oct  18 Liverpool \n1847 Nov  27 Rampside \n1847 Dec 2 Helensburgh \n1848 Dec  16 Glasgow \n1849 Jan  10 Milnthorpe \n1852 Dec  25 to 27 Walney Island, Cartmel, Kirkby Ireleth, Aldingham, Roosebeck, Greenock, \n 22\nMillom & Whichham \n1856 Feb  6 to 7 Renfrew Ferry \n1859 Oct  26 Bagillt \n1863 Jan  19 to 20 Morecambe, Lancaster, Ulverston, Fleetwood, Preston, Lytham, Sandside, \nHammerside\" \n1869 Jan  31 Whitehaven & Harrington \n1869 Jan  1 Maryport \n1870 Sept  9 Blackpool \n1872 Nov  1 to 2 Blackpool \n1873 Jan 3 Port Glasgow & Greenock \n1874 Mar  20 Morecambe & Fleetwood \n1875 Nov  13 Douglas \n1875 Oct  18 Beaumaris \n1875 Sept  26 Liverpool \n1876 Mar 3 Blackpool \n1877 Jan  30 Aberystwyth \n1877 Jan  2 to 3 Douglas \n1881 Oct  13 to 14 Whitehaven, Harrington & Blackpool \n1881 Nov  11 Blackpool \n1882 Nov  25 to 27 Blackpool \n1882 Mar 20 Blackpool \n1884 Jan  26 Blackpool, Whitehaven & Port Glasgow \n1889 Oct  7 Holyhead, Southport, Blackpool \n1890 Oct  16 Blackpool \n1890 Jan  25 Maryport \n1890 Jan  21 Sandylands, Preston, Blackpool & Lytham \n1891 Oct 23 Abbey Holme, Holyhead & Blackpool \n1894 Feb  10 to 11 Cartmel & Kent's Bank \n1894 Dec  22 Skinburness, Kirkby in Furness & Rockliffe \n1896 Mar 16 Blackpool \n1896 Mar 5 Blackpool \n1896 Oct  8 Blackpool \n1897 Nov  29 Morecambe, Southport, Abergele & Rhyl \n1897 Jan  23 to 24 Blackpool \n1902 Oct  10 to 17 Blackpool \n1902 Sept  3 Arnside, Sandside, Grange over Sands, Milnthorpe, Kirkby in Furness, \nCarnforth & Foulshaw \n1903 Feb  27 Arnside & Meathop \n1904 Feb 22 Douglas \n1907 Mar 4 Sandylands, Morecambe, Knott End, Milnthorpe, Pilling, Carnforth, \nBolton le Sands, Sunderland \n1911 Oct  31 Cleveleys, Blackpool, Fleetwood & Lytham \n1911 Nov  5 Roa \n1911 May 2 Blackpool \n1911 Oct  10 Dee esturay \n1924 Dec  27 Blackpool, Fleetwood & Sandylands \n1925 Feb  21 Morecambe, Pilling, Knott End, Bolton le Sands & Cockerham Sands \n1926 Feb  19 Morecambe & Sandylands \n1926 Dec  30 Preston, Heysham & Morecambe \n1926 Nov  5 Broomilaw \n1927 Oct  29 Fleetwood, Blackpool & Sandylands \n1928 Oct  28 Grange over Sands \n1931 Aug  18 Fleetwood \n1931 Mar 6 Rhos-on-Sea \n1935 Oct  18 to 19 Firth of Clyde \n1937 Jan  28 Rhos-on-Sea, Beaumaris \n1939 Mar 9 Fleetwood \n1942 Dec  20 Solway Firth \n1945 Sept  24 Towyn, Rhyl, Penmaenmawy, Llanfairfechan \n1947 Jan  17 Carlisle \n 23\n1977 Nov  12 Morecambe, Pilling, Blackpool, Lytham, Fleetwood \n1977 Nov 14 Morecambe, Pilling \n1983 Feb  1 Morecambe \n1990 Feb 1 Towyn \n1991 Jan  2 Morecambe, Rampside, Barrow in Furness, Holy Head \n \n \n \n \n \n \n \n    \n    \n \n \nFigure 1 The coast of Britain is divided into three sectors for the investigation: \nEast Coast from Aberdeen to Ramsgate, South\/Southwest Coast from \nDover to Milford Haven, West Coast from Milford Haven to Glasgow. \n \n 24\n \n \nFigure 2 Northwest Europe with grids of 2.50 Latitude and 5.00 Longitude, \nshowing the tracks (solid lines) and associated surface wind direction \n(dotted lines) for the three storms recorded in 1953, 1977 and 1981. \n \n \n 25\n \n \nFigure 3 Frequencies of storm floods recorded from the three coastal sectors \nwith details listed in Table 2. The trends are calculated using a 5-term \nfilter.  \n \n \n \n \nFigure 4 Frequencies of storm tracks passing through each grid, based on 51 \nstorm floods on the East Coast. \n 26\n \n \nFigure 5 Frequencies of storm tracks passing through each grid, based on 48 \nstorm floods on the South and Southwest Coast. \n \n \n \nFigure 6 Frequencies of storm tracks passing through each grid, based on 18 \nstorm floods on the West Coast. \n \n"}