{"doi":"10.1192\/apt.bp.107.004382","coreId":"10105","oai":"oai:repository.tavistockandportman.ac.uk:236","identifiers":["oai:repository.tavistockandportman.ac.uk:236","10.1192\/apt.bp.107.004382"],"title":"Psychoanalytic and psychodynamic therapies for depression. The evidence base.","authors":["Taylor, David"],"enrichments":{"references":[{"id":751092,"title":"A meta (re)analysis of the effects of cognitive therapy versus ‘other therapies’ for depression.","authors":[],"date":"2002","doi":"10.1016\/s0165-0327(00)00287-1","raw":"Wampold, B. E., Minami, T., Baskin, T. W., et al (2002) A meta­ (re)analysis of the effects of cognitive therapy versus ‘other therapies’ for depression. Journal of Affective Disorders, 68, 159–165.","cites":null},{"id":751651,"title":"A meta analysis of outcome studies comparing bona fide psycho therapies: empirically, ‘all must have prizes’.","authors":[],"date":"1997","doi":"10.1037\/\/0033-2909.122.3.203","raw":"Wampold, B. E., Mondin, G. W., Moody, M., et al (1997) A meta­ analysis of outcome studies comparing bona fide psycho­ therapies: empirically, ‘all must have prizes’. Psychological Bulletin, 122, 203–215.","cites":null},{"id":727142,"title":"A systematic review of controlled trials of the effectiveness and cost effectiveness of brief psychological treatments for depression.","authors":[],"date":"2001","doi":null,"raw":"Churchill, R., Hunot, V., Corney, R., et al (2001) A systematic review  of  controlled  trials  of  the  effectiveness  and  cost­ effectiveness of brief psychological treatments for depression. Health Technology Assessment, 5, 1–173.","cites":null},{"id":730249,"title":"Advances in Psychiatric Treatment","authors":[],"date":"2008","doi":"10.1192\/apt.bp.107.004382","raw":null,"cites":null},{"id":752195,"title":"Affective disorders.","authors":[],"date":"1991","doi":"10.1017\/S0033291700001975","raw":"Weissman, M. M., Bruce, M. B., Leaf, P. J. et al (1991) Affective disorders. In Psychiatric Disorders in America: The Epidemiologic Catchment Area Study (eds L. N. Robins & D. A. Regier), pp. 53–80. The Free Press.","cites":null},{"id":750520,"title":"Comparative effectiveness of psychotherapies for depressed elders.","authors":[],"date":"1987","doi":"10.1037\/\/0022-006x.55.3.385","raw":"Thompson, L. W., Gallagher, D. & Breckenridge, J. S. (1987) Comparative effectiveness of psychotherapies for depressed elders. Journal of Consulting and Clinical Psychology, 55, 385– 390.","cites":null},{"id":738048,"title":"Comparative effects of shortterm psychodynamic psychotherapy and cognitive–behavioural therapy in depression: a metaanalytic approach.","authors":[],"date":"2001","doi":"10.1016\/s0272-7358(99)00057-4","raw":"Leichsenring,  F.  (2001)  Comparative  effects  of  short­term psychodynamic psychotherapy and cognitive–behavioural therapy  in  depression:  a  meta­analytic  approach.  Clinical Psychology Review, 21, 401–419.","cites":null},{"id":749665,"title":"Comparative effects of shortterm psychodynamic psychotherapy: a metaanalysis.","authors":[],"date":"1991","doi":"10.1037\/0022-006x.59.5.704","raw":"Svartberg,  M.  &  Stiles,  T.  C.  (1991)  Comparative  effects  of short­term psychodynamic psychotherapy: a meta­analysis. Journal of Consulting and Clinical Psychology, 59, 704–714.","cites":null},{"id":739826,"title":"Comparative studies of psychotherapies. Is it true that “everybody has won and all must have prizes”?","authors":[],"date":"1975","doi":"10.1001\/archpsyc.1975.01760260059004","raw":"Luborsky,  L.,  Singer  B.  &  Luborsky,  L.  (1975)  Comparative studies of psychotherapies. Is it true that “everybody has won and all must have prizes”? Archives of General Psychiatry, 32, 995–1008.","cites":null},{"id":727680,"title":"Controlled trial of the short and longterm effect of psychological treatment of postpartum depression. 1: Impact on maternal mood.","authors":[],"date":"2003","doi":"10.1192\/bjp.182.5.412","raw":"Cooper, P. J., Murray, L., Wilson, A., et al (2003) Controlled trial of the short­ and long­term effect of psychological treatment of  post­partum  depression.  1:  Impact  on  maternal  mood. British Journal of Psychiatry, 182, 412–419.","cites":null},{"id":732464,"title":"Depressive illness: diagnostic issues.","authors":[],"date":"1991","doi":null,"raw":"Hirschfeld, R. M. (1991) Depressive illness: diagnostic issues. Bulletin of the Menninger Clinic, 55, 144–155.","cites":null},{"id":748148,"title":"Duration of major depressive episodes in the general population: results from The Netherlands Mental Health Survey and Incidence Study (NEMESIS).","authors":[],"date":"2002","doi":"10.1192\/bjp.181.3.208","raw":"Spijker, J., de Graaf, R., Bijl, R. V., et al (2002) Duration of major depressive episodes in the general population: results from The Netherlands Mental Health Survey and Incidence Study (NEMESIS). British Journal of Psychiatry, 181, 208–213.","cites":null},{"id":747542,"title":"Effects of treatment duration and severity of depression in the maintenance of gains following cognitive\/behavioural and psychodynamic\/interpersonal psychotherapy.","authors":[],"date":"1994","doi":"10.1037\/\/0022-006x.63.3.378","raw":"Shapiro,  D.  A.,  Barkham,  M.,  Rees,  A.,  et  al  (1994)  Effects of  treatment  duration  and  severity  of  depression  in  the maintenance of gains following cognitive\/behavioural and psychodynamic\/interpersonal  psychotherapy.  Journal  of Consulting and Clinical Psychology, 62, 522–534.","cites":null},{"id":746910,"title":"Factors associated with 1year outcome of major depression in the community.","authors":[],"date":"1990","doi":"10.1001\/archpsyc.1990.01810180019004","raw":"Sargeant, J. K., Bruce, M. L., Florio, L. P., et al (1990) Factors associated with 1­year outcome of major depression in the community. Archives of General Psychiatry, 47, 519–526.","cites":null},{"id":749102,"title":"Future imperfect: longterm outcome of depression.","authors":[],"date":"1994","doi":"10.1192\/bjp.164.3.327","raw":"Surtees, P. G. & Barkley, C. (1994) Future imperfect: long­term outcome  of  depression.  British  Journal  of  Psychiatry,  164, 327–341.","cites":null},{"id":743993,"title":"Historical overview of outcome of depression.","authors":[],"date":"1994","doi":null,"raw":"Paykel,  E.  S.  (1994)  Historical  overview  of  outcome  of depression. British Journal of Psychiatry, 165 (suppl. 26), 6–8.","cites":null},{"id":753437,"title":"http:\/\/apt.rcpsych.org\/ 413 Psychotherapies for depression","authors":[],"date":"2008","doi":null,"raw":null,"cites":null},{"id":725595,"title":"Longterm treatments from the perspectives of the former patients.","authors":[],"date":"2002","doi":null,"raw":"Beutel,  M.  &  Rasting,  M.  (2002)  Long­term  treatments  from the perspectives of the former patients. In The Outcomes of Psychoanalytic Treatment (eds M. Leuzinger–Bohleber & M. Target), ch. 11. Whurr.","cites":null},{"id":735656,"title":"Love, Guilt and Reparation and Other Works 1921–1945.","authors":[],"date":null,"doi":null,"raw":"Vol. 1 Love, Guilt and Reparation and Other Works 1921–1945. Hogarth Press.","cites":null},{"id":735010,"title":"Mourning and its relation to manic–depressive states. Reprinted","authors":[],"date":"1940","doi":null,"raw":"Klein, M. (1940) Mourning and its relation to manic–depressive states.  Reprinted  (1975)  in  The  Writings  of  Melanie  Klein.","cites":null},{"id":730656,"title":"Mourning and melancholia. Reprinted","authors":[],"date":"1917","doi":null,"raw":"Freud, S. (1917) Mourning and melancholia. Reprinted (1953– 1974)  in  the  Standard  Edition  of  the  Complete  Psychological Works of Sigmund Freud (trans. & ed. J. Strachey), vol. 14, p. 237. Hogarth Press.","cites":null},{"id":743304,"title":"National Collaborating Centre for Mental Health","authors":[],"date":"2004","doi":"10.1192\/pb.28.5.156","raw":"National  Collaborating  Centre  for  Mental  Health  (2004) Depression:  Management  of  Depression  in  Primary  and Secondary Care. Clinical Guideline 23. NICE (http:\/\/guidance. nice.org.uk\/CG23\/?c=91523).","cites":null},{"id":736889,"title":"Outcome assess ment: from conceptualization to implementation.","authors":[],"date":"1998","doi":"10.1037\/0735-7028.29.1.63","raw":"Lambert, M. J., Okiishi, J. C., Finch, A. E., et al (1998) Outcome assess  ment:  from  conceptualization  to  implementation. Professional Psychology: Research and Practice, 29, 63–70.","cites":null},{"id":726067,"title":"Outcome of patients in longterm psychoanalytical treatments.","authors":[],"date":"2001","doi":null,"raw":"Blomberg, J., Lazar, A. & Sandell, R. (2001) Outcome of patients in long­term psychoanalytical treatments. First findings of the Stockholm Outcome of Psychotherapy and Psychoanalysis (STOPP) study. Psychotherapy Research, 11, 361–382.","cites":null},{"id":736253,"title":"Patterns of symptomatic recovery in psychotherapy.","authors":[],"date":"1994","doi":"10.1037\/\/0022-006x.62.5.1009","raw":"Kopta,  S.,  Howard,  K.,  Lowry,  J.,  et  al  (1994)  Patterns  of symptomatic recovery in psychotherapy. Journal of Consulting and Clinical Psychology, 62, 1009–1016.","cites":null},{"id":744600,"title":"Psychiatric Disorders in America: The Epidemiologic Catchment Area Study.","authors":[],"date":"1991","doi":"10.5860\/choice.28-5931","raw":"Robins, L. N. & Regier, D. A. (eds) (1991) Psychiatric Disorders in America: The Epidemiologic Catchment Area Study. The Free Press.","cites":null},{"id":728956,"title":"Psycho therapy alone and combined with pharmacotherapy in the treatment of depression.","authors":[],"date":"2004","doi":null,"raw":"de Jonghe, F., Hendriksen, M., van Aalst, G., et al (2004) Psycho­ therapy alone and combined with pharmacotherapy in the treatment  of  depression.  British  Journal  of  Psychiatry,  185, 37–45.","cites":null},{"id":745234,"title":"Psycho therapy for the treatment of depression: a comprehensive review of controlled outcome research.","authors":[],"date":"1990","doi":"10.1037\/\/0033-2909.108.1.30","raw":"Robinson, L. A., Berma, J. S. & Neimeyer, R. A. (1990) Psycho­ therapy for the treatment of depression: a comprehensive review of controlled outcome research. Psychological Bulletin, 108, 30–49.","cites":null},{"id":742705,"title":"Psychoanalysis and cognitive behaviour therapy – rival paradigms or common ground?","authors":[],"date":"2001","doi":"10.1516\/dvln-rk5e-c1yv-me4v","raw":"Milton,  J.  (2001)  Psychoanalysis  and  cognitive  behaviour therapy – rival paradigms or common ground? International Journal of Psychoanalysis, 82, 431–447.","cites":null},{"id":729593,"title":"Psychodynamic psychotherapies. Evidencebased practice and clinical wisdom.","authors":[],"date":"2005","doi":"10.1521\/bumc.69.1.1.62267","raw":"Fonagy,  P.,  Roth,  A.  &  Higgitt,  A.  (2005)  Psychodynamic psychotherapies.  Evidence­based  practice  and  clinical wisdom. Bulletin of the Menninger Clinic, 69, 13.Advances in Psychiatric Treatment (2008), vol. 14. http:\/\/apt.rcpsych.org\/ 412 Taylor Freud,  S.  (1905)  Three  essays  on  the  theory  of  sexuality.","cites":null},{"id":726653,"title":"Psychodynamic psychotherapy and clomipramine in the treatment of major depression.","authors":[],"date":"2002","doi":"10.1176\/appi.ps.53.5.585","raw":"Burnand, Y., Andreoli, A., Kolatte, E., et al (2002) Psychodynamic psychotherapy and clomipramine in the treatment of major depression. Psychiatric Services, 53, 585–590.","cites":null},{"id":736326,"title":"Psychotherapy outcome research: implications for integrative and eclectic theories.","authors":[],"date":"1992","doi":null,"raw":"Lambert,  M.  J.  (1992)  Psychotherapy  outcome  research: implications  for  integrative  and  eclectic  theories.  In Handbook of Psychotherapy Integration (eds J. C. Norcross & M. R. Goldfried). Basic Books.","cites":null},{"id":748448,"title":"Random ised controlled trials investigating pharmacological and psychological interventions for treatmentrefractory depression. Systematic review.","authors":[],"date":"2002","doi":"10.1192\/bjp.181.4.284","raw":"Stimpson,  N.,  Agrawal,  N.  &  Lewis,  G.  (2002)  Random­ ised  controlled  trials  investigating  pharmacological  and psychological  interventions  for  treatment­refractory depression. Systematic review. British Journal of Psychiatry, 181, 284–294.","cites":null},{"id":735745,"title":"Random ized trial on the effectiveness of longand shortterm psychodynamic psychotherapy and solutionfocused therapy on psychiatric symptoms during a 3year follow up.","authors":[],"date":"2008","doi":null,"raw":"Knekt, P., Lindfors, O., Harkanaen, T., et al (2008) Random­ ized  trial  on  the  effectiveness  of  long­and  short­term psychodynamic  psychotherapy  and  solution­focused therapy on psychiatric symptoms during a 3­year follow­ up. Psychological Medicine, 38, 689–703.","cites":null},{"id":741572,"title":"Recurrence after recovery from major depressive disorder during 15 years of observational followup.","authors":[],"date":"1999","doi":null,"raw":"Mueller, T. I., Leon, A. C., Keller, M. B., et al (1999) Recurrence after  recovery  from  major  depressive  disorder  during 15  years  of  observational  follow­up.  American  Journal  of Psychiatry, 156, 1000–1006.","cites":null},{"id":723397,"title":"Short term psychodynamic psychotherapies for common mental disorders. Cochrane Database of Systematic Reviews,","authors":[],"date":"2006","doi":"10.1002\/14651858.cd004687.pub2","raw":"Abbass, A. A., Hancock, J. T., Henderson, J., et al (2006) Short­ term psychodynamic psychotherapies for common mental disorders. Cochrane Database of Systematic Reviews, issue 4, CD004687.","cites":null},{"id":723574,"title":"Shortterm dynamically oriented psychotherapy: a review and metaanalysis.","authors":[],"date":"1995","doi":null,"raw":"Anderson, E. M. & Lambert, M. J. (1995) Short­term dynamically oriented psychotherapy: a review and meta­analysis. Clinical Psychology Review, 15, 503–514.","cites":null},{"id":733057,"title":"The clinical course of unipolar major depressive disorders.","authors":[],"date":"1997","doi":"10.1001\/archpsyc.1997.01830230015002","raw":"Judd,  L.  L.  (1997)  The  clinical  course  of  unipolar  major depressive disorders. Archives of General Psychiatry, 54, 989– 991.","cites":null},{"id":742120,"title":"The effectiveness of psychological treatments for treatment resistant depression: a systematic review.","authors":[],"date":"2005","doi":"10.1111\/j.1600-0447.2004.00498.x","raw":"McPherson,  S.,  Cairns,  P.,  Carlyle,  J.,  et  al  (2005)  The effectiveness  of  psychological  treatments  for  treatment resistant depression: a systematic review. Acta Psychiatrica Scandinavica, 111, 331–340.","cites":null},{"id":731864,"title":"The effects of detection and treatment on the outcome of major depression in primary care: a naturalistic study in 15 cities.","authors":[],"date":"1998","doi":null,"raw":"Goldberg, D., Privett, M., Ustun, B., et al (1998) The effects of detection and treatment on the outcome of major depression in  primary  care:  a  naturalistic  study  in  15  cities.  British Journal of General Practice, 48, 1840–1844.","cites":null},{"id":728427,"title":"The efficacy of brief dynamic psycho therapy: a metaanalysis.","authors":[],"date":"1992","doi":null,"raw":"Crits­Christoph, P. (1992) The efficacy of brief dynamic psycho­ therapy: a meta­analysis. American Journal of Psychiatry, 159, 325–333.","cites":null},{"id":739303,"title":"The efficacy of psychological, education, and behavioral treatment: confirmation from metaanalysis.","authors":[],"date":"1993","doi":"10.1037\/\/0003-066x.48.12.1181","raw":"Lipsey, M. W. & Wilson, D. B. (1993) The efficacy of psychological, education,  and  behavioral  treatment:  confirmation  from meta­analysis. American Psychologist, 48, 1181–1209.","cites":null},{"id":738664,"title":"The efficacy of shortterm psychodynamic psychotherapy in specific psychiatric disorders. A metaanalysis.","authors":[],"date":"2004","doi":"10.1001\/archpsyc.61.12.1208","raw":"Leichsenring, F., Rabung, S. & Leibing, E. (2004) The efficacy of  short­term  psychodynamic  psychotherapy  in  specific psychiatric disorders. A meta­analysis. Archives of General Psychiatry, 61, 1208–1216.","cites":null},{"id":752780,"title":"The empirical status of empirically supported psychotherapies: assumptions, findings, and reporting in controlled clinical trials.","authors":[],"date":"2004","doi":"10.1037\/0033-2909.130.4.631","raw":null,"cites":null},{"id":7599841,"title":"The empirical status of empirically supported psychotherapies: assumptions, findings, and reporting in controlled clinical trials. Psychological Bulletin, 130, 631–663.Advances in Psychiatric Treatment","authors":[],"date":"2004","doi":"10.1037\/0033-2909.130.4.631","raw":"Westen, D., Novotny, C. M. & Thompson­Brenner, H. (2004) The empirical status of empirically supported psychotherapies: assumptions, findings, and reporting in controlled clinical trials. Psychological Bulletin, 130, 631–663.Advances in Psychiatric Treatment (2008), vol. 14. http:\/\/apt.rcpsych.org\/ 413 Psychotherapies for depression MCQ answers 1    2    3    4 a  F  a  F  a  F  a  F b  F  b  F  b  F  b  F c  F  c  F  c  F  c  T d  F  d  T  d  T  d  F e  T  e  F  e  F  e  F MCQs In  individuals  presenting  with  major  depressive  1 disorder: there is little likelihood of panic disorder a full recovery is usual and recurrence unlikely b aside from the symptoms of depression the personality  c is usually normal personal loss plays no part d there  may  be  ongoing  difficulties  in  personal  e functioning in periods of recovery. According  to  the  psychoanalytic  theory  of  2 depression: thoughts and feelings outside core awareness play no  a part in the condition difficulties with anger and aggression are not found b the  concept  of  the  ‘object’  refers  to  any  inanimate  c thing emotional ambivalence deriving from early childhood  d relationships and losses is crucial the depressed person’s superego is usually benign  e and forgiving. With  respect  to  the  treatment  of  depression  the  3 evidence indicates that: short­term psychodynamic psychotherapy offers no  a benefit patient preference should not be taken into account b on  average,  c  ≤ 20  sessions  of  psychological  therapy will move patients’ Beck Depression Inventory scores into the normal range longer­term therapies (e.g. 300 sessions) may offer  d benefits not possible with brief treatments the  effects  of  short­term  psychodynamic  psycho­ e therapy are usually evident immediately. The evidence base with respect to the treatment of  4 depression: offers clear indications about the best treatment of  a chronic or recurrent depression is  derived  from  many  good­quality  RCTs  with  b clinically  representative  samples  and  long  follow­ ups is bedevilled by the effects of researcher allegiance  c and publication bias is of no value d is very reassuring. e","cites":null},{"id":734343,"title":"The epidemiology of major depressive disorder: results from the national comorbidity survey replication.","authors":[],"date":"2003","doi":"10.1001\/jama.289.23.3095","raw":"Kessler,  R.  C.,  Bergland,  P.,  Demler,  O.,  et  al  (2003)  The epidemiology  of  major  depressive  disorder:  results  from the  national  comorbidity  survey  replication.  JAMA,  289, 3095–3105.","cites":null},{"id":737470,"title":"The longterm outcome of Maudsley depressives.","authors":[],"date":"1988","doi":"10.1192\/bjp.153.6.741","raw":"Lee, A. S. & Murray, R. M. (1988) The long­term outcome of Maudsley depressives. British Journal of Psychiatry, 153, 741– 751.","cites":null},{"id":731309,"title":"The Origins and Course of Common Mental Disorders.","authors":[],"date":"2005","doi":"10.1017\/s0033291706249420","raw":"Goldberg, D. & Goodyer, I. (2005) The Origins and Course of Common Mental Disorders. Routledge.","cites":null},{"id":740412,"title":"The researcher’s own therapy allegiances: a “wild card” in comparisons of treatment efficacy.","authors":[],"date":"1999","doi":"10.1093\/clipsy\/6.1.95","raw":"Luborsky,  L.,  Diguer,  L.,  Seligman,  D.  A.,  et  al  (1999)  The researcher’s  own  therapy  allegiances:  a  “wild  card”  in comparisons  of  treatment  efficacy.  Clinical  Psychology: Science and Practice, 6, 95–106.","cites":null},{"id":733702,"title":"The role and clinical significance of subsyndromal depressive symptoms (SSD) in unipolar major depressive disorder.","authors":[],"date":"1997","doi":"10.1016\/s0165-0327(97)00055-4","raw":"Judd, L. L., Akiskal, H. S. & Paulus, M. P. (1997) The role and clinical significance of subsyndromal depressive symptoms (SSD)  in  unipolar  major  depressive  disorder.  Journal  of Affective Disorders, 45, 5–17.","cites":null},{"id":728022,"title":"The time course of untreated major depression: uniformity across episodes and samples.","authors":[],"date":"1994","doi":"10.1001\/archpsyc.1994.03950050065007","raw":"Coryell, W., Akiskal, H., Leon, A. C., et al (1994) The time course of untreated major depression: uniformity across episodes and samples. American Journal of Psychiatry, 51, 405–410.","cites":null},{"id":724257,"title":"The Zurich Study II. The continuum from depressive to pathological mood swings.","authors":[],"date":"1984","doi":"10.1007\/bf00432879","raw":"Angst, J. & Dobler­Mikola, A. (1984) The Zurich Study II. The continuum from depressive to pathological mood swings. European Archives of Psychiatry and Neurological Science, 234, 21–29.","cites":null},{"id":725005,"title":"The Zurich Study. VI. A continuum from depression to anxiety disorders?","authors":[],"date":"1985","doi":"10.1007\/bf00380990","raw":"Angst, J. & Dobler­Mikola, A. (1985) The Zurich Study. VI. A continuum from depression to anxiety disorders? European Archives of Psychiatry and Neurological Science, 235, 179–186.","cites":null},{"id":740930,"title":"Toward the Validation of Dynamic Psychotherapy.","authors":[],"date":"1976","doi":"10.1007\/978-1-4615-8753-8","raw":"Malan,  D.  H.  (1976)  Toward  the  Validation  of  Dynamic Psychotherapy. Plenum Press.","cites":null},{"id":750243,"title":"Treatment of major depression with psychotherapy or psychotherapy– pharmacotherapy combinations.","authors":[],"date":"1997","doi":"10.1001\/archpsyc.1997.01830230043006","raw":"Thase, M. E., Greenhouse, J. B., Frank, E., et al (1997) Treatment of major depression with psychotherapy or psychotherapy– pharmacotherapy  combinations.  Archives  of  General Psychiatry, 54, 1009–1015.","cites":null},{"id":746187,"title":"Varieties of long term outcome among patients in psychoanalysis and long term psychotherapy. A review of findings in the Stockholm Outcome of Psychoanalysis Project (STOPP).","authors":[],"date":"2000","doi":"10.1516\/0020757001600291","raw":"Sandell, R., Blomberg, J., Lazar, A., et al (2000) Varieties of long­ term outcome among patients in psychoanalysis and long­ term psychotherapy. A review of findings in the Stockholm Outcome  of  Psychoanalysis  Project  (STOPP).  International Journal of Psychoanalysis, 81, 921–943.","cites":null},{"id":745873,"title":"What Works for Whom? A Critical Review of Psychotherapy Research (2nd edn).","authors":[],"date":"2004","doi":null,"raw":"Roth, A. & Fonagy, P. (2004) What Works for Whom? A Critical Review of Psychotherapy Research (2nd edn). Guilford.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008","abstract":"David Taylor, a consultant psychotherapist at the Tavistock & Portman NHS Foundation Trust (120 Belsize Lane, London NW3 5BA, UK. Email: dtaylor@tavi-port.nhs.uk), is the clinical lead of the Tavistock Adult Depression Study (a randomised controlled trial of 60 sessions of weekly psychoanalytic psychotherapy v. treatment as usual for patients with chronic, refractory depression). He is a training and supervising psychoanalyst at the Institute of Psychoanalysis. \\ud\n\\ud\nThis article argues that the current approach to guideline development for the treatment of depression is not supported by the evidence: clearly depression is not a disease for which treatment efficacy is best determined by short-term randomised controlled trials. As a result, important findings have been marginalised. Different principles of evidence-gathering are described. When a wider range of the available evidence is critically considered the case for dynamic approaches to the treatment of depression can be seen to be stronger than is often thought. Broadly, the benefits of short-term psychodynamic therapies are equivalent in size to the effects of antidepressants and cognitive–behavioural therapy (CBT). The benefits of CBT may occur more quickly, but those of short-term psychodynamic therapies may continue to increase after treatment. There may be a ceiling on the effects of short-term treatments of whatever type. Longer-term psychodynamic treatments may improve associated social, work and personal dysfunctions as well as reductions in depressive symptoms","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"The Royal College of Psychiatrists","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:repository.tavistockandportman.ac.uk:236<\/identifier><datestamp>\n      2016-02-09T10:28:25Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D6469736162696C697479:4634<\/setSpec><setSpec>\n      7375626A656374733D74686572617079:4F32<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.tavistockandportman.ac.uk\/236\/<\/dc:relation><dc:title>\n        Psychoanalytic and psychodynamic therapies for depression. The evidence base.<\/dc:title><dc:creator>\n        Taylor, David<\/dc:creator><dc:subject>\n        Depression<\/dc:subject><dc:subject>\n        Brief Therapies<\/dc:subject><dc:description>\n        David Taylor, a consultant psychotherapist at the Tavistock & Portman NHS Foundation Trust (120 Belsize Lane, London NW3 5BA, UK. Email: dtaylor@tavi-port.nhs.uk), is the clinical lead of the Tavistock Adult Depression Study (a randomised controlled trial of 60 sessions of weekly psychoanalytic psychotherapy v. treatment as usual for patients with chronic, refractory depression). He is a training and supervising psychoanalyst at the Institute of Psychoanalysis. \\ud\n\\ud\nThis article argues that the current approach to guideline development for the treatment of depression is not supported by the evidence: clearly depression is not a disease for which treatment efficacy is best determined by short-term randomised controlled trials. As a result, important findings have been marginalised. Different principles of evidence-gathering are described. When a wider range of the available evidence is critically considered the case for dynamic approaches to the treatment of depression can be seen to be stronger than is often thought. Broadly, the benefits of short-term psychodynamic therapies are equivalent in size to the effects of antidepressants and cognitive–behavioural therapy (CBT). The benefits of CBT may occur more quickly, but those of short-term psychodynamic therapies may continue to increase after treatment. There may be a ceiling on the effects of short-term treatments of whatever type. Longer-term psychodynamic treatments may improve associated social, work and personal dysfunctions as well as reductions in depressive symptoms.<\/dc:description><dc:publisher>\n        The Royal College of Psychiatrists<\/dc:publisher><dc:date>\n        2008<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/repository.tavistockandportman.ac.uk\/236\/1\/Taylor_psychoanalytic....depression.pdf<\/dc:identifier><dc:identifier>\n          Taylor, David  (2008) Psychoanalytic and psychodynamic therapies for depression. The evidence base.  Advances in Psychiatric Treatment, 14  (6).   pp. 410-413.  ISSN Online ISSN: 1472-1481 Print ISSN: 1355-5146      Full text available   <\/dc:identifier><dc:relation>\n        http:\/\/apt.rcpsych.org\/cgi\/content\/abstract\/14\/6\/401<\/dc:relation><dc:relation>\n        10.1192\/apt.bp.107.004382<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.tavistockandportman.ac.uk\/236\/","http:\/\/apt.rcpsych.org\/cgi\/content\/abstract\/14\/6\/401","10.1192\/apt.bp.107.004382"],"year":2008,"topics":["Depression","Brief Therapies"],"subject":["Article","PeerReviewed"],"fullText":"  \n \nTavistock and Portman E-Prints Online \n \n  \n \n \nJOURNAL ARTICLE \n \n \nOriginal citation:Taylor, David (2008) Psychoanalytic and psychodynamic \ntherapies for depression. The evidence base. Advances in Psychiatric \nTreatment, 14 (6). pp. 410-413. ISSN Online ISSN: 1472-1481 Print ISSN: \n1355-5146 \n \n \n \n© 2008  David Taylor \n \nThis version available at: http:\/\/taviporttest.da.ulcc.ac.uk\/\n \nAvailable in Tavistock and Portman E-Prints Online: Oct 2009 \nThe Trust has developed the Repository  so that users may access the clinical, \nacademic  and research work of the Trust. \n \n Copyright © and Moral Rights for the papers on this site are retained by the \nindividual authors and\/or other copyright owners. Users may download and\/or print \none copy of any article(s) in  Tavistock and Portman E-Prints Online to facilitate \ntheir private study or for non-commercial research. You may not engage in further \ndistribution of the material or use it for any profit-making activities or any \ncommercial gain. You may freely distribute the URL \n(http:\/\/taviporttest.da.ulcc.ac.uk\/) of  Tavistock and Portman E-Prints Online. \n \nThis document is the published version of the introduction of ‘‘Psychoanalytic and \npsychodynamic therapies for depression. The evidence base. ‘ It is reproduced here \nwith the kind permission of RCP You are encouraged to consult the remainder of \nthis publication if you wish to cite from it. \n \n \n \n401\nAdvances in Psychiatric Treatment (2008), vol. 14, 401–413 doi: 10.1192\/apt.bp.107.004382\nLatterly, perhaps impelled by the Spirit of the Age \nas well as by the accelerating cost of medical in­\nno vation, governments have increasingly found in \nevidence­based medicine a necessary instru ment, \nas well as a sensible one. In the UK, the National \nInstitute for Health and Clinical Excellence (NICE) \nhas required its mental health guideline develop­\nment groups to use a standard, one­size­fits­all \napproach to evidence pertaining to the various \ntreatments used for specific common mental disor­\nders. When judged by the narrow criterion of the \navailability of sufficient numbers of high­quality \ndouble­blind random allocation controlled trials \nand meta­analyses, it may be fair to conclude that \nthe evidence base for the most used treatments for \ndepression is weak. However, this kind of null ver­\ndict does not take us very far, either in knowledge \nor in the development of practice. In any case, the \nrestrictive definition of evidence­based medicine \nin the mental health field which underpins this \njudgement has some adverse consequences and \nneeds to be heavily qualified. \nFirst, there is a pervasive fallacy that a statement \nabout a ‘strong’ or a ‘weak’ evidence base is a state­\nment about the weakness of the treatment rather \nthan about the limitations of the research methods \nused in the evaluation of that treatment. This \nintro duces damaging confounds. They include the \nconsequences of equating a weak evidence­base \nwith a weak treatment, or a supposedly strong \none with a strong treatment. Weak research or \nflawed guidelines may acquire a status they do \nnot deserve. \nSecond, although there always may be excep­\ntions, the fundamental difficulties of most people \nwith depression do not resolve with brief inter­\nventions of whatever variety. The natural course \nof depression is often prolonged, relapsing or \nrecurrent (Surtees & Barkley, 1994). Although \npatients are significantly helped by any well­\ninformed and responsive professional intervention, \nincluding really good clinical management, the \nresistant core of any significant psychopathology \nis a fact of life. To provide a quality mental health \nservice requires care and support, and specific \ninterventions available when needed in long­term \npackages. The randomised controlled trial (RCT) \nresearch agenda has so far been unable to take this \nfact sufficiently into account.\nThird, by and large, the dysfunctions from which \npatients suffer are not confined to those that can be \ncalled a single diagnosis. Most patients not only \nmeet the criteria for several different symptom­\nbased diagnoses, but have to cope with many \nsub optimal functions of the personality (Westen \net al, 2004). They complain of doubt of love, of \npast and present difficulties in terms of personal \nachievement and work, as well as of existential \nPsychoanalytic and psychodynamic \ntherapies for depression: the evidence base \nDavid Taylor\nAbstract This article argues that the current approach to guideline development for the treatment of depression \nis not supported by the evidence: clearly depression is not a disease for which treatment efficacy is \nbest determined by short­term randomised controlled trials. As a result, important findings have been \nmarginalised. Different principles of evidence­gathering are described. When a wider range of the \navailable evidence is critically considered the case for dynamic approaches to the treatment of depression \ncan be seen to be stronger than is often thought. Broadly, the benefits of short­term psychodynamic \ntherapies are equivalent in size to the effects of antidepressants and cognitive–behavioural therapy \n(CBT). The benefits of CBT may occur more quickly, but those of short­term psychodynamic therapies \nmay continue to increase after treatment. There may be a ceiling on the effects of short­term treatments \nof whatever type. Longer­term psychodynamic treatments may improve associated social, work and \npersonal dysfunctions as well as reductions in depressive symptoms.\nDavid Taylor, a consultant psychotherapist at the Tavistock & Portman NHS Foundation Trust (120 Belsize Lane, London NW3 5BA, \nUK. Email: dtaylor@tavi­port.nhs.uk), is the clinical lead of the Tavistock Adult Depression Study (a randomised controlled trial of 60 \nsessions of weekly psychoanalytic psychotherapy v. treatment as usual for patients with chronic, refractory depression). He is a training \nand supervising psychoanalyst at the Institute of Psychoanalysis. \nAdvances in Psychiatric Treatment (2008), vol. 14. http:\/\/apt.rcpsych.org\/402\nTaylor\nand intimate problems of being, identity and so \non. By being short­term, RCTs and brief treatment \ninterventions avoid difficulties of this sort, whereas \nmental health workers should not, and patients \ncannot, do so.\nThus, for these and other reasons it can be \nargued that the NICE emphasis on RCTs as \nthe gold standard in the research evaluation of \npsychological therapy outcome is as unfounded as \nits evidence base is weak.\nThe position seems to be that different theoretical \napproaches, such as the cognitive, the pharma­\ncological, the psychiatric, or the psychoanalytic, \nthe clinical or the ‘scientistic’, have very different \nideas about the principles that should underpin \nthe methodology of outcome research and of \nevidence­based guidelines. These are serious and \nimportant disagreements about what counts as \nquality in evidence and fact, and about the place \nof clinical knowledge in the discourse. These \ndifferent positions translate into the way questions \nabout efficacy and effectiveness are asked and \nthe way in which they are answered. They give \nrise to serious problems of incommensurability: \nwhen we ask questions about complex issues \nwe must of necessity choose one among several \napproaches to frame our questions and to provide \nthe concepts and terminologies we think are best \nsuited to define, collect, observe and interpret \nwhat we count as empirical data. Empirical data \nare, in truth, empirical only up to a point. Beyond \nthat point they are highly method­dependent. We \ncannot simply examine the facts obtained by one \nmethod with the concepts belonging to another. \nTo cap it all, the factors that determine which of \nthe above approaches is dominant involve deep­\nseated personal preferences that are hard waxed \nagainst discrepant findings or arguments.\nThis article is in three sections. The first outlines \nthe preliminaries necessary to provide a frame of \nreference for the review of evidence that follows. \nThis evidence base is often an inconclusive and \ncontradictory set of findings from treatment out­\ncome studies relevant to depression. Often it seems \nmore like a quagmire than firm ground. I focus \nhere on the evidence pertaining to psychoanalytic\/\npsychodynamic approaches. I hope that it will be \npossible to begin to see how, if we judge by lights \nother than those subscribing to the primacy of \nmethod, the evidence base for psychodynamic ap­\nproaches is not actually that weak. There is, in fact, \na web of evidence supporting their value. Indeed, \nbecause this extends into so many domains it has \nnot been possible to give more than a hint of the \nwide range of different types of evidence that have \na bearing on this issue. In the final section I discuss \nthis evaluation and suggest some conclusions.\nPreliminaries for a frame  \nof reference\nPrevalence, course and nature  \nof depression\nIn high­income countries, over the course of a \nyear about 6% of the adult population will suffer a \nmajor depressive disorder, and 6% will experience \ndysthymia, with the lifetime prevalence of the \ndisorder being about 17% (Weissman et al, 1991). In \nthe community, between 20 and 30% of untreated \ndepressed individuals will still be depressed a year \nlater (Sargeant et al, 1990). Put the other way round, \n70% of people with untreated depression will \nrecover without intervention in the course of a year. \nGenerally, the risk of further episodes over the 10 \nto 15 years after an index episode is more than 85% \n(Mueller et al, 1999). Of those who initially respond \nto medication, 30% will relapse within a year, rising \nto as many as 75% after 5 years (Hirschfeld, 1991). \nEach person with major depressive disorder will \nexperience on average four episodes during their \nlifetime. Each of these episodes will last an average \nof 20 weeks with ongoing symptoms and disability \nduring the periods of ‘remission’ (Judd, 1997; Judd \net al, 1997).\nAs these figures suggest, depression can be a \ncircumscribed, self­limiting condition for some \npeople, but a significant proportion will suffer a \npattern of remission and relapse (Surtees & Barkley, \n1994), and will show a tendency for a deteriorating \noutlook as time goes by (Paykel, 1994) (Box 1). Yet, \nthe majority of RCTs of psychological therapy and \npharmacotherapy involve short­term treatments \nof acute­phase depression, with non­existent or \nbrief follow­ups. These studies therefore do not \nprovide reliable information about efficacy over \nBox 1 The natural course of depression\nFor about 50% of individuals, the duration of ••\nillness is 3 months; thereafter the probability \nof remission diminishes rapidly \n60% of people receiving antidepressant ••\nmedi cation still meet the criteria for major \ndepressive disorder after 1 year of treat­\nment, and 20% after 2 years\nUp to 90% of patients develop new episodes ••\nafter recovery \nOnly 20% of people hospitalised for ••\ndepression remained well over a 15­year \nfollow­up\n(Lee & Murray, 1988; Coryell et al, 1994; \nGoldberg et al, 1998; Spijker et al, 2002) \nAdvances in Psychiatric Treatment (2008), vol. 14. http:\/\/apt.rcpsych.org\/ 403\nPsychotherapies for depression\nthe medium and longer term, especially in relation \nto those who have more chronic or severe forms of \ndepression.\nThe taxonomy of depression \nThe data above were arrived at using diagnostic \nschemes based on the idea that depression, general­\nised anxiety disorder and obsessive–compulsive \ndisorder are distinct entities. If they truly were \nseparate entities, they would be expected to occur \nindependently of each other, to have their own \nparticular aetiology, and each would respond to \nits own specific treatment acting on pathological \nprocesses specific to the disorder. What we find \ndoes not support this idea (Box 2).\nThe psychoanalytic\/psychodynamic \nmodel of therapy\nThe term ‘psychodynamic psychotherapy’ encom­\npasses therapeutic approaches derived origin­\nally from psychoanalysis and depth psychology. \nAlthough psychodynamic psychotherapies are \nvarious, the role of early development, unconscious \nprocesses and the transference significance of \nthe therapeutic relationship are to some extent \ncommon to most. \n In classical psychoanalysis the analyst seeks \nto follow the patient rather than to set or impose \nan agenda. Psychoanalysts try to understand a \nunique process set in motion by the patient’s pre­\noccupations, anxieties, difficulties, character and, \nabove all, by his or her way of relating. Exploring \nsensitive personal areas requires a stable, sympa­\nthetic yet objective discipline. The approach is \nbased on a view that everyone is subject to a flux \nof internal conditions, which to some extent are \nalways going to be difficult for the individual \nto deal with or fully acknowledge. The psycho­\nanalyst’s theoretical knowledge and personal \nanalysis provides a detailed familiarity with the \nnature of these internal states and the powerful \nfeelings associated with primary relationships in \nthe child and the adult. \nIn psychoanalysis, the patient uses the couch, \nhas sessions five times a week, and the treatment \nlasts for some years. Although in some ways it can \nbe likened as much to education as to a form of \ntreat ment, in significant respects it differs from \nboth. Like any significant piece of learning, psycho­\nanalytic change occurs slowly but the emotional \nand cognitive developments that are involved are \nbased on learning by internalisation rather than \nlearning by rote, or memorising. This internalisa­\ntion process involves the patient in a sustained \ncontact with previously under­explored areas of \ntheir personality as they function within the spe­\ncialised relationship between patient and analyst \n(Milton, 2001). Analysts use their knowledge and \ntraining to be able to see into, to challenge, and to \ncontain and to tolerate the areas of difficulty the \npatient brings. As a result, the patient gradually \ntakes in a capacity to feel more comfortable with \nthese and other emotionally difficult areas.\n Psychoanalysis can be engrossing and fascinating. \nBecause of its meaningfulness many patients feel \nmuch supported, partly because of its openness to \nemotionally demanding or turbulent areas. This \nexplains why many people will make considerable \nsacrifices to have an analysis. However, it is not \nto everyone’s taste or liking. Psychoanalysis has \nthe capacity to evoke great hatred and contempt as \nwell as great appreciation and gratitude.\nTo make the value of psychoanalytic thinking \navailable to patients for whom a full analysis is \neither impossible for practical reasons, or not indi­\ncated for clinical ones, many shorter or less inten­\nsive forms of individual and group psycho therapy \nhave been devised. The general psychoanalytic \nmodels that underpin these applications remain \nnon­directive and are offered in short­, medium­ \nand longer­term formats. Centres of psychotherapy \nBox 2 Problems with single-disorder research \nand treatment guidelines \nApparently exact rates of diagnosis ••\nlend pseudo­objectivity to the familiar \ntaxonomy\nResults depend on which of several ••\ndiagnostic schemes is used (Goldberg & \nGoodyer, 2005)\nA minority of patients satisfy the criteria ••\nof only one diagnosis. Patients meeting \ncriteria for major depressive disorder are \nnine times more likely than chance to meet \nthe criteria for other conditions (Angst & \nDobler­Mikola, 1984, 1985)\n57.5% of patients with depression also have ••\nanxiety disorders (Kessler et al, 2003) \n50–90% of patients with Axis I conditions ••\nalso meet the criteria for other Axis I or Axis \nII disorders (Westen et al, 2004)\nIndex presentations commonly change over ••\ntime, with the features of depression, anxiety, \nphobic or obsessive­compulsive disorders \nnow uppermost, now unobtrusive \nPatients complain of problems of functioning ••\nand of life not captured by measures of \nsymptoms or categorical diagnoses\nAdvances in Psychiatric Treatment (2008), vol. 14. http:\/\/apt.rcpsych.org\/404\nTaylor\nin the UK offer a model of once­weekly psycho­\nanalytic psychotherapy over 1 year (45 sessions), \nor occasionally a little longer. The social insurance \nfunded healthcare systems of a number of European \ncountries routinely fund up to 300 sessions of \ntwice­ or thrice­weekly psychoanalytic psycho­\ntherapy sessions. \nOver the years a number of more structured, and \nusually short, forms of psychodynamic therapy \nhave also been developed. Typically, these include \nactively formulating a focus on the particular \nunconscious operations and emotions thought to \nunderlie the patient’s symptoms and complaints. \nThe model of Davanloo (1980), for instance, is \norganised around the idea of a triangle of conflict \n(feelings, anxiety and defence) and a triangle \nof person (past, therapist and current) to frame \ninterventions. The brief psychotherapy model of \nMalan (1976) is similar. However, although these \nstructured approaches are more concerned with \nachieving specific focal aims, patients are still \noffered and still obtain insight. They are not given \nhomework or didactically taught mental skills \nsuch as thought­monitoring and re­framing.\nA brief account of the psychoanalytic \nunderstanding of depression\nPsychoanalysis regards mourning and depression \nas types of bio­psychological reactions to loss (Box \n3). Any significant loss stimulates fear, anxiety \nand anger. The activity of the emotional system \nconnected with fight or flight is triggered and \nemotional systems to do with nurturance are \nenormously disturbed. These powerful emotional \nreactions have to be managed by the organism. \nFreud (1917) com pared the mental processes \ninvolved in mourning with those in depression. \nThe ability to mourn is an adaptive capacity \ninvolving relinquishment. It can lead to mental \ngrowth and the return of the capacity to feel love \nat a new level. Relinquishment is more difficult for \nthose susceptible to depression, because of under­\nlying difficulties with tolerating the fundamental \nseparate ness of the loved object. Such individuals \nare unable to cope with the love and the hate that \narise in connection with absence while at the same \ntime feeling to some degree secure. Their common \norigin in loss means that these two major states of \nmind can coexist and also interact with each other \nin very significant ways.\n Mourning the lost object is one of the ways it is \npossible to recover from depression. This is what \nis happening over the course of the self­limiting \ndepressions that so commonly occur at the turning­\npoints of life. In mourning, individuals remain \nconsciously preoccupied with whom or with \nwhat has been lost, but in deep depression people \noften no longer know why they are depressed. In \nmourning it is the world that is felt to have lost \nmeaning but in depression it is the self that is \nviewed as diminished or bad. The self undergoes \nthis alteration through its becoming identified with \nthe lost object. Identification is an unconscious \nmechanism which involves ‘becoming the same \nas’. In depression, identification occurs on the basis \nof sympathy with the object, sometimes out of guilt \nor sometimes as a way of keeping the relationship \nwith the lost person present­within rather than \nabsent­without. \nThe explanation of these differences between \nmourning and depression rests on the finding \nthat the acceptance of the loss is more difficult \nin depression (Klein, 1940). Although we would \nbe faithless and shallow if we lacked all tenacity \nin our relations with the world, in those with a \nvulnerability to depression the possibility that \nthe tie to the object might be loosened feels not \npossible. There tends to be too much ambivalence \nand insecurity in relation to the love object to allow \nfor this. There is a conflict between feelings of love \nand antagonism. Also, a desperate effort to spare \nthe loved object from aggression lends intense \npainfulness to the internal struggles of the person \nwho is prone to depression. This ‘sparing’ is a sine \nqua non of depression and is its ethical dimension. \nBecause aggression cannot simply be wished out of \nBox 3 Some elements of the psychoanalytic \ntheory of depression \nExcessive neediness, dependence and am­••\nbivalence in love relationships predispose \nto depression after object loss \nEarlier developmental difficulties with ••\nobject loss are continuously re­evoked in \nthe course of later relationships of work and \nlove. Just as ‘every finding of an object is a \nre­finding’, every loss revives an earlier one \n(Freud, 1905; Klein, 1940)\nEarly feeding and affective bond experiences ••\nare central to nurturance and fight­or­flight \nsystems. They are of particular importance \nin a vulnerability to depressive disorders in \nadulthood\nAn excessively severe or envious super••  ego \n(Freud, 1917) influences the various levels \nof severity, chronicity and refractoriness \nthat depression can take\nBoth environmental and constitutional ••\n(genetic) factors play a part\nAdvances in Psychiatric Treatment (2008), vol. 14. http:\/\/apt.rcpsych.org\/ 405\nPsychotherapies for depression\nexistence, the attempt to spare the object inevitably \nmeans that the hostility must be turned inward. \nThis is how people who are depressed come to \nbelieve that they are bad, disliked, hated or hateful. \nMany of the somatic and vegetative symptoms of \ndepression arise from inhibited feelings of arousal, \nhostility and fear operating at the somatic level \nas well as within the more familiar symbolic and \nrepresentational levels of feeling and thought. \nThis turning of aggression and anxiety against the \nself is mediated by an internal structure, the critical \nagency, the superego. The superego is coloured by \nthe individual’s own hostile and envious feelings \nso that, other things being equal, the more an \nindividual controls his or her aggression towards \nothers the more severe their superego becomes. \nAlthough ultimately our dispositions are the \noutcome of gene–environment interactions of \nenormous complexity, the emotional work we are \nable to do with the troubles of our own minds can, \nover the course of time, make a big difference to \nour final outcome.\nThe outcome evidence for \npsychoanalytic\/psychodynamic \ntreatments of depression \nThe observations summarised in Box 2 support \nthe view of many clinicians that the current way \nof classifying and analysing data dismembers \nother wise instructive relationships that exist \nbetween the different types of symptom found \nin patients with a broader category of ‘common \nmental disorder’. However, the idea of distinct, \nhomogeneous mental ‘diseases’ has dominated \nresearch and guideline development (including \nthose of NICE) in the past 25 years, exerting great \ninfluence on the type of study done and the kind of \nresults available. (For a good general review of the \nevidence for psychodynamic therapies see Fonagy \net al, 2005.) What follows will therefore include the \nresults of some meta­analyses and trials that have \nused the concept of common mental disorders as a \nway of describing their study populations. \nShort-term psychodynamic \npsychotherapy\nIn line with general usage, the various shorter­term \nformats, whether structured or non­directive, will \nbe referred to collectively as short­term psycho­\ndynamic psychotherapy (STPP). Most of the RCTs \nexamining the efficacy of psychoanalytic or psycho­\ndynamic approaches have studied forms of STPP. \nUsually this means no more than 20 sessions. \nEfficacy of psychological therapy in the treatment \nof generic disorders\nIn a mother of all meta­analyses, a meta­analysis \nof 45 meta­analyses of the results of a wide variety \nof brief psychological, educational and behavioural \ntreatment trials for an equally wide range of non­\npsychotic disorders, Lipsey & Wilson (1993) came \nup with an estimate of the efficacy of psycho logical \ninterventions as a ‘generic’ type. They found an effect \nsize of +0.76 for all forms of psycho logical therapy \nwhen compared with waiting­list or minimal­\ntreatment control conditions. This indicates that \nthe post­treatment symptoms of those who receive \nany form of brief psychological therapy will be \nabout three­quarters of a standard deviation better \nthan that of those who do not. This is a worthwhile \nbenefit, but under the limited parameters of brief \ntherapy research it has been hard to demonstrate a \nclear magnitude of difference between this size of \neffect and that associated with placebo or ‘treatment \nas usual’ (TAU), especially should the treatment be \nof a good standard. \nThe reader will come to see how, in spite of \nnumerous efforts to pick it apart, a persistent \nthread of non­specificity runs through the findings \nof psy cho logical therapy research trials. This so­\ncalled ‘equivalence paradox’ refers to how difficult \nit has proved for outcome research to demonstrate \nspecific differences, whether according to degree of \neffect, diagnosis or type of psychological therapy. \nFor this reason, experienced psychotherapy re­\nsearchers sum marise the previous decades of \nresearch in their field with conclusions such as, \n‘the generic efficacy of psychotherapy compared \nto no­treatment has been established for a long \ntime … from mildly disturbed persons with \nspecific limited symptoms as well as from severely \nimpaired patients … study after study, meta­\nanalysis after meta­analysis, have empirically \nvalidated psychotherapy as a treat ment’ (Lambert, \n1992: p. 97). Luborsky et al in 1975 applied the term \n‘Dodo bird effect’ to the way every research camp \nin psychological therapy would present data that \nprove that its favourite is the best, while the rival is \nperfidious. The description refers to Lewis Carroll’s \nAlice in Wonderland, in which the Dodo silences the \nbitter squabbles at the end of a race by announcing \nthat ‘everybody has won and all must have prizes’. \nThe stability of Luborsky et al’s conclusion was \nmore recently confirmed by Wampold et al (1997).\nEfficacy of generic psychological therapies in the \ntreatment of depression\nRobinson et al (1990), in their admirably lucid review \nof 58 controlled studies of the use of psychotherapy \nwith patients with a formal diagnosis of depression, \nAdvances in Psychiatric Treatment (2008), vol. 14. http:\/\/apt.rcpsych.org\/406\nTaylor\nfound effect sizes of 0.73 post­treatment and \n0.68 at follow­up. These are of the same order as \nthose quoted above for a much wider group of \ndisorders. Their figures indicated that collectively \nthese differ ent types of psychological therapy offer \na moderate benefit in the treatment of depression \ncompared with no treatment. Although the \nauthors’ initial analysis found the effect sizes for \ncognitive, behavioural and cognitive–behavioural \ntherapy (CBT) to be about twice those of ‘general \nverbal therapies’ (a category that included STPP), \nthey found that this difference disappeared when \nthe treatment allegiance of the researcher and the \nquality of the trial were taken into account. Their \nultimate finding was that there was ‘no reliable \ndifference’ between the efficacies of different forms \nof therapy in the treatment of depression. Each \nform was making roughly equal contributions to \nthe final overall effect.\nEfficacy of STPP compared with no or minimal \ntreatment for diagnosed depression\nThe Cochrane review by Abbass et al (2006) found \nonly two RCTs of sufficient quality giving data on \nthe more exact question of the efficacy of STPP v. \n‘no treatment’ or TAU in patients with a formal \ndiagnosis of depression. This was out of a total \nof 23 RCTs examining STPP in the treatment of \ncommon mental disorders. In an earlier review, \nLeichsenring et al (2004) had found a third study. \nThe three studies were as follows.\nDe Jonghe et al (2004) In the treatment of \nadults with mild to moderate major depressive \ndisorder (75% having an illness of less than 2 \nyears’ duration), the authors compared a form of \nSTPP (maximum of 16 sessions) alone with STPP \nand antidepressant medication. Although there \nwere marked differences in their acceptability to \npatients, the efficacy of both formats in terms of \neffect size, imputed on the basis of the difference \nbetween baseline measures and measures at 24 \nweeks in the two groups, was large (≥ 0.8) and \nmore or less equivalent. Note how similar this is to \nthe value reported by Lipsey & Wilson (1993). This \nstudy is considered further below.\nThompson et al (1987) In the treatment of ma­\njor depressive disorder in the elderly the authors \ncompared 16–20 sessions of STPP with an equiva­\nlent number of CBT and behavioural therapy ses­\nsions and a waiting­list control state. By the end \nof 6 weeks, patients in the treatment conditions \nshowed improvement of the familiar order, where­\nas controls did not. The results of this study also \nhave a bearing on the comparative efficacy of the \ndifferent forms of psychotherapy (see below). \nCooper et al (2003) In the treatment of postnatal \ndepression, the authors investigated the efficacy of \nthree forms of brief intervention, one of which was \n10 sessions of psychodynamic therapy, compared \nwith routine primary care, in post­partum women \nmeeting the criteria for major depressive disorder. \nAt 4½ months, 70% of the psychodynamic cohort \nwere judged to be recovered, compared with 40% \nof the control condition. By the 9­month follow­up, \nhowever, the benefit of treatment over usual care \nwas no longer evident. Moreover, the three forms \nof therapy did not reduce the incidence of further \nepisodes of postnatal depression. Psychodynamic \npsychotherapy did, however, seem to accelerate \nrecovery, which in the majority of cases would \nhave occurred but more slowly. This study had a \nlong 5­year follow­up, unlike most RCTs.\nEfficacy of STPP compared with no or minimal \ntreatment for common mental disorders\nAccording to psychoanalytic theory depression, \nanxiety, obsessional features, personality problems \nand a variety of more subtle manifestations \nare thought to be interconnected in a dynamic \nway. Like an increasing number of psychiatrists, \npsycho analytically informed clinicians and \nresearchers have serious reservations about the \nvalidity of using the single­diagnosis concept of \ndepression in outcome trials. Many have argued \nthat it makes more sense to study the effects of \ntreatment in patient samples that include mixed \nor combined disorders. The search criteria used in \nsingle­disorder guidelines such as those of NICE \nhave tended to exclude the findings of studies of \nthis sort. \nLeichsenring et al (2004) This review found \nseven RCTs of sufficient quality which had \nexamined STPP against no treatment or TAU for \na mixture of common mental disorders. Short­\nterm psychodynamic psychotherapy was found \nto be ‘significantly superior’ to these placebo \nconditions, with effect sizes ranging from 0.59 to \n1.17 depending on the domain measured (target \nproblem, general psychiatric symptoms and social \nfunctioning) and the measure used. ‘No treatment’ \nconditions were found to have ‘before’ and ‘after’ \neffect sizes, which ranged from 0.12 to 0.27, while \nTAU was found to be capable of more substantial \nbenefits, ranging from 0.22 to 0.95, depending \npresumably on the intensity, adequacy and quality \nof the TAU provided. \nAbbass et al (2006) This review of 23 RCTs exam­\nined the efficacy of STPP relative to no treat ment or \nTAU in the category of common mental disorder. \nAdvances in Psychiatric Treatment (2008), vol. 14. http:\/\/apt.rcpsych.org\/ 407\nPsychotherapies for depression\nThey pooled patient samples which had originally \nbeen selected on the basis of several specific com­\nmon disorder diagnoses. In addition to depression, \nthese included somatoform disorders (irritable \nbowel syndrome, chronic pain, etc.), anxiety and \npersonality disorders and the hetero geneous \nmixture of disorders found in a non­responding \nsample of non­psychotic general psychiatric out­\npatients. Some of the studies were of samples of \npatients with chronic, difficult­to­treat disorders \nand co morbid substance misuse. Only 8 overlapped \nwith Leichsenring’s et al’s review. Combined, the \n23 trials involved 1431 patients. Results indicated \nthat STPP (for a mean of 15 sessions) produced \nmodest to moderate gains across a wide range of \nsymptom categories for a wide variety of patients. \nFurthermore, these gains were often sustained or \nhad increased at longer­term follow­up.\nSvartberg & Stiles (1991), Crits­Christoph (1992), \nAnderson & Lambert (1995) For mixed disorders, \nthese three meta­analyses of all found STPP to be \nsuperior to no treatment or minimal treatment at \nboth short­ and longer­term follow­ups.\nEfficacy of STPP compared with no or minimal \ntreatment for depressive symptoms in common \nmental disorders\nThe composite, common mental disorder group \nassembled in the reviews of Leichsenring (2001) \nand Abbass et al (2006) included many patients with \nsignificant depressive symptomatology across the \ndiagnostic categories. Of the 23 studies in Abbass’s \nreview, 14 had employed measures of depression. \nIn terms of relief from depressive symptoms these \nshowed in the short term (≤ 3 months, 11 studies) a \nstandardised mean difference (SMD) of 0.59, in the \nmedium term (3–9 months, 5 studies) an SMD of \n0.41, and in the longer term (≥ 9 months, 6 studies) \nan SMD of 0.98 relative to controls. These amount \nto moderate treatment effects and, in line with \ntrend, the longer­term follow­up finding is more \nsubstantial.\nEfficacy of STPP compared with other forms  \nof psychological therapy\nThe meta­analyses of Crits­Christoph (1992) and \nAnderson & Lambert (1995) similarly found STPP to \nbe equal in efficacy to other forms of psychological \ntherapy, as did the Leichsenring et al (2004) study. \nOnly one meta­analysis, that of Svartberg & Stiles \n(1991) found STPP to be less effective than other \nshort­term treatments such as CBT. However, when \ncontrols for quality were introduced, this putative \nsuperiority evaporated.\nEfficacy of STPP compared with CBT  \nand behavioural therapy for depression\nChurchill’s et al’s (2001) systematic review of \ncontrolled trials of brief psychological treatments \nfor depression, part of the NHS Health Technology \nAssessment programme, found six studies (five \nrandomised controlled and one controlled clinical \ntrial) comparing STPP with CBT in formats of less \nthan 20 sessions.\nPooling dichotomous recovery\/non­recovery \ndata suggested that, by the end of the treatment, the \nodds of recovery for patients receiving CBT were \nat least twice those for patients receiving STPP.\n However, the reviewers noted the possibility of \na bias towards the CBT condition in these trials. \nMore than half the studies were conducted by \nresearchers with a CBT preference; these trials had \nused psychodynamic therapy only as a secondary \ncomparison condition. Again, when ratings for \nthe quality of the trial and the quality of treatment \ndelivery were included, this marked difference \ndisappeared.\n The difference reported between CBT and brief \npsychodynamic treatments also disappeared when \nfollow­up data were reported. In two of the studies \nthis was at 3 months, and in a third at 1 year. The \nremainder did not report follow­up data.\nLeichsenring (2001) came to similar con clusions. \nHe confirmed that STPP was associated with statis­\ntically significant reductions in depressive \nsymptoms before and after treatment. Out of a \ntotal of 60 possible comparisons between STPP and \nCBT he found no difference in 58, and a small effect \nin favour of CBT in 2. He calculated the mean \n‘before and after’ success rates of STPP and CBT as \n46% and 54% respectively – equivalent to a small \neffect size in favour of CBT. Wampold et al (2002) \nreported similar findings.\nEfficacy of psychotherapy compared with \nantidepressants\nAccording to Roth & Fonagy (2004), when psycho­\ntherapy and medication are offered alone they \nseem to be of roughly equivalent efficacy. Most, \nbut not all, of this evidence is from interpersonal \ntherapy and CBT studies. The earlier review of \nRobinson et al (1990) found 15 studies examining \nthis question, including a few looking at the effect \nof com bining psychological therapy with anti­\ndepressants. Eight of these 15 studies were of CBT, \nthree were of behav ioural therapy and four tested \nwhat the authors describe as ‘general verbal’ \ntherapy, which includes dynamic approaches.\nThe studies yielded a small effect size in favour of \npsychological therapy, but this may be an artefact. \nOnce again, when allegiance effects (Luborsky \nAdvances in Psychiatric Treatment (2008), vol. 14. http:\/\/apt.rcpsych.org\/408\nTaylor\net al, 1999) were taken into account no reliable \ndifferences could be found between psycho logical \ntherapy and pharmacotherapy. Publication bias \nand selective reporting are now known to have \ninfluenced findings bearing on this question.\nHowever, there is some evidence (Thase et al, \n1997) that antidepressants are more efficacious for \npeople with more severe depression than for those \nwith depression of mild to moderate severity, or \nthose for whom complex psychosocial factors of \nhistory and personality are significant parts of the \npresentation.\nEfficacy of combined treatments\nAugmenting STPP with antidepressants (v. STPP \nalone) De Jonghe et al (2004) examined the issue \nof whether the addition of antidepressants to 16 \nsessions of STPP would improve on the outcome \nof major depression of mild to moderate severity \ntreated with STPP alone. A sample of about 200 \npsychiatric out­patients with major depressive dis­\norder was treated and followed up over a 6­month \nperiod.\nBoth treatment packages produced broadly \nequivalent positive effects. The success rate in \nthe STPP­alone arm was 73% as against 81% in \nthe combined treatment arm, with pre–post effect \nsizes on the Hamilton Rating Scale for Depression \n(HRSD) of 1.22 and 1.53 respectively. By 24 weeks, \nHRSD ratings had fallen from an initial average \nof 18 to one of 10. The comparison findings \nindicated a small benefit in favour of combining \nanti depressants with STPP, but these reached \nsignificance only in respect of the patient’s self­\nreport measure (with a medium effect size of 0.49). \nBecause there was no drug placebo control in the \ntrial the mechanism of this effect is uncertain.\nOther important findings concerned the strength \nof patients’ attitudes to the two kinds of treatment. \nAlthough 25 % of psychotherapy patients broke off \ntheir treatment, psychotherapy still seemed to be \nmore acceptable. More patients refused to enter the \npharmacotherapy arm in the first place, and by 6 \nmonths a further 35% had withdrawn from it. \nAugmenting antidepressants with STPP (v. anti ­\ndepressants alone) Burnand et al (2002) investi­\ngated the question of combined therapy the other \nway around: augmenting antidepressant medica­\ntion with a 10­session form of STPP, administered \nin this case by well­trained nurses, to enhance \nthe outcomes of patients in an acute­phase major \ndepressive episode. The patients had been referred \nto an out­patient psychiatric service, and had \nmoderate to severe degrees of depression; half \nhad had previous episodes; half had some form \nof personality disorder. They were as a whole \nslightly more ill than the de Jonghe et al (2004) \nsample. The final sample analysed consisted of 74 \npatients randomised to the two conditions – anti­\ndepressants (mainly clomipramine) combined with \nsupportive time with a designated key worker v. \nantidepressants plus 10 sessions of STPP with a \ntrained nurse­therapist.\nAfter the 10­week treatment period the mean \nHRSD scores in both groups had reduced from \nabout 24 to about 9 (P > 0.001) but with little \ndifference between the comparison conditions on \nthis measure.\nHowever, the combination of STPP and anti­\ndepressants was better than antidepressants alone \non several other important indices: patients who \nreceived STPP were significantly less likely to still \nmeet the criteria for major depressive disorder after \n10 weeks (9%) than those who had not (28%).\nThe combination group needed significantly \nfewer days off work (46 v. 57), and they had both \na lower rate and fewer days of hospitalisation. \nCost–benefit comparisons showed that STPP plus \nantidepressants had resulted in savings of $2311 \nper patient over the 10­week period. For patients \nin full employment before they became ill savings \nwere greater ($3394). \nOnce it is recollected that depression can be a \nlong­term relapsing condition, the drawbacks of \nthe trials summarised above are hard to deny in \nrespect of all types of treatment. They are nearly \nall concerned only with the short­term outcome \nof brief treatments. The findings of trials of this \nkind also suggest a ceiling on the effects of brief \ntherapies of whatever type. To go beyond these \nlimitations it is important to look to studies of \nlonger­term treatments of patients with chronic \nor harder­to­treat depression of one kind or \nanother. Furthermore, because the dysfunctions \nassociated with depression extend beyond what \nsymptom measures capture, we need to develop \nour understanding of these and to find ways of \nevaluating change.\nEfficacy of treatments of chronic or treatment­\nrefractory depression\nStimpson et al (2002) found 17 RCTs which exam­\nined various pharmacological approaches to the \ntreatment of patients with unipolar depression \nwho had not responded to a minimum of 4 weeks \nof antidepressant treatment.\nOn the basis of these 17 studies, they concluded \nthat there was little in the way of evidence to guide \nthe treatment of patients who had not responded \nto a first course of antidepressants. Within their \ncriteria, they found no satisfactory trials of \npsychological therapy for chronic or treatment­\nresistant depression.\nAdvances in Psychiatric Treatment (2008), vol. 14. http:\/\/apt.rcpsych.org\/ 409\nPsychotherapies for depression\nBy using more lax inclusion criteria, McPherson \net al (2005) did find a few studies of psychological \ntreatments, including single case studies. These \nmainly used CBT. Although they mostly showed \nreduction in symptoms, they all had short follow­\nup times and very small numbers. Interestingly, \nand presumably in response to the severity of the \npsychopathology, the CBT treatments involved \nseemed to be showing a marked tendency to \nbecome longer than the short 10 or 20 sessions that \nhave been a principle selling point of the method. \nIn one small study the eight participants had 39 \nsessions over 8 months – beginning to approach \nsomething like a medium­length psychodynamic \ntreatment!\nTwo RCTs are currently under way with this \npatient group. The Tavistock Adult Depression \nStudy (Publication ID M0001169680 at http:\/\/\nwww.nihr.ac.uk) is examining the efficacy of \nmedium­term (60 sessions) weekly psychoanalytic \npsychotherapy v. TAU in 90 patients with treatment­\nresistant depression. Eligibility criteria include at \nleast two failed treatments as well as a diagnosis of \nmajor depressive disorder. The average duration \nof illness is 10–15 years and most patients have \nbeen found also to meet the criteria for at least one \nDSM Axis II disorder. The trial is due to report in \n2010. A similar multicentre German RCT combined \nwith a naturalistic arm began last year. The \nLangzeittherapie bei chronischen Depressionen (LAC) \nstudy, led by Professor M. Leuzinger­Bohleber, is \ncomparing a longer psychoanalytic psychotherapy \ntreatment with CBT and has an intended sample \nof 240 (http:\/\/www.sfi­frankfurt.de\/forschung\/\nforschungsfeld­2\/depressionsstudie.html). \nEfficacy of long­term v. short­term \npsychodynamic\/psychoanalytic therapies  \nin depression and common mental disorders\nThe Helsinki Psychotherapy Study Group’s RCT \n(Knekt et al, 2008) has compared the effectiveness \nof two forms of short­term therapy with a long­\nterm psychodynamic psychotherapy. So far follow­\nup data over 3 years have been reported. The study \nalso has an arm for full psychoanalysis, which is \nabout to report along with further follow­up data. \nThe two short­term treatments were a problem­\nsolving solution (solution­focused therapy) (about \n10 sessions, including family work over 8 months; \nLambert et al, 1998) and a form of STPP based \non the Malan model (20 sessions over 6 months). \nThe long­term treatment involved 2–3 sessions \nof psychodynamic therapy a week over 3 years \n(average number of sessions was 232). The 326 \nparticipants, between 20 and 45 years of age, had \nbeen referred and treated as out­patients for mild \nto moderate DSM–IV mood or anxiety disorders \nfor at least 1 year; 68% met the criteria for major \ndepressive disorder, 44% met those for generalised \nanxiety disorder, 18% met those for personality \ndisorder, and 9% had made a suicide attempt.\nAll three interventions were associated with \nsignificant reductions on all symptom measures \n(depression, anxiety and general). Over the 3­year \nperiod the average reduction in Beck Depression \nInventory (BDI) score was 51% (with effect sizes \nranging from 0.87 to 1.52). At entry the mean BDI \nscore was 18; in those given the two short­term \ntreatments this had come down to about 10, and in \nthose who had had long­term therapy it was about \n7. These benefits are comparable to those found in \nstudies involving CBT. \nParticipants who received the short­term treat­\nments typically showed an early response which \nreached an upper limit by 12 months. These gains \nproved lasting over the entire 3­year follow­up.\nIn contrast, the long­term therapy group \ninitially lagged behind, showing significantly less \nimprovement over the first year. However, the \ngains in this group gradually increased so that by \nthe 3­year point on all measures their symptoms \nwere less than those of the short­term treatment \ngroups; with respect to anxiety they were four \ntimes more likely to be recovered, but with respect \nto the depression measures the difference was not \nof the same degree. This pattern has also been \nfound in other studies (Kopta et al, 1994).\n Overall, about 20% of those who initially met \ncriteria for personality disorder no longer did at 7 \nmonths. In the STPP group there was a continued \nreduction in the features of personality disorder, \nso that by 12 months only 9% met the criteria. This \ncontinued improvement in personality function­\ning did not occur in the solution­focused therapy \ngroup.\nEvidence from retrospective and prospective \nlongitudinal effectiveness studies\nPsychological therapies require the patients’ \npersonal choice, voluntary mental work and \nengagement. Especially over the medium and longer \nterm, RCTs, with their analogies to medication \ntrials, do not fit easily with the requirements of \nhuman relatedness. Practically and ethically it \nis not possible to randomly allocate over long \ndurations. It is entirely unrealistic to require RCT \nevidence for the outcome of these longer therapies. \nInstead, the evidence from long­term and, until \nrecently, usually retrospective effectiveness studies \nneeds to be taken more seriously. \nA carefully designed naturalistic long­term \nfollow­up in Germany of 402 patients (of whom \n128 had affective disturbances) who had received \npsych oanalysis and long­term psychoanalytic \nAdvances in Psychiatric Treatment (2008), vol. 14. http:\/\/apt.rcpsych.org\/410\nTaylor\npsychotherapy (Beutel & Rasting, 2002) showed \nthat a clinically representative group of patients \nwith significant depressive symptoms had moved \ninto the normal range of scores. At long­term \nfollow­up, this group was doing better in terms of \ndays off work than the population norm. The study \nincluded in­depth qualitative interviews that made \nit possible to discern distinct and differing pat­\nterns of change in the way that various personality \ntypes managed their thoughts and feelings. These \npatterns included the emergence of reflective \nfunctioning. \nOther studies have confirmed the clinical \nimpression that improvement may continue after \npsycho dynamic or psychoanalytic psychotherapy \nends. The Stockholm Outcome of Psychoanalysis \nProject, for example, has demonstrated that patients \ngained in strength and capacity after treatment had \nended (Sandell et al, 2000; Blomberg et al, 2001). \nDiscussion and conclusions\nDo short-term treatments cure \ndepression?\nRobinson et al (1990) enquired whether the clinical \neffects of short­term psychological and pharmaco­\nlogical treatments amount to a cure of depression. In \ntheir sample of studies the mean pre­treatment BDI \nscore was 21.8 and post­treatment this had fallen \nto 11.8. The corresponding figures for untreated \ncontrols were 20.7 and 18.1. The mean BDI score \nof unselected samples from the general population \nis 7.0. For the fraction of the general population \nthat is contented this comes down to 4.9. Thus, \nthese treatment effects move patients to within \n1 standard deviation of the general population \nmean, and to within 1.5 standard deviations of the \ncontented among us. These are not trivial effects \nbut even by the restricted sensitivity of the BDI \nthey suggest that on a good day the average well­\ntreated recipient of short­term treatments is still \nmore depressed than most of us on a bad day, \nand is even further from the ideal of normative \nfunctioning. The consistency of these estimates \npoints towards there being a ceiling to what can be \nachieved with short­term treatments.\nDoes the evidence base need to remain an \nindustry of small differences?\nIt is still possible to sum up the current state of \nevidence with the following blanket conclusion: \nantidepressant medication and the different \nvarieties of short­term psychological therapy are \ncapable of generating an improvement of about \n12–13 points on the BDI, and there is not much to \nchoose between them. Also, as clearly indicated \nby the findings of the Robins & Regier (1991) \nstudy, the ‘placebo’ effect in trials of treatments for \ndepression can be consistently large, amounting to \nan average of 10 points’ improvement. \nViewed in this way, it is understandable that \nmany clinicians throw up their hands at a research \nbase that seems more like a heap of dust. It does \nseem that in respect of treatment research into \ndepression (and other common mental disorders) \nthe Dodo bird’s judgement, at least, is alive and well. \nIt lives on in an evolutionary backwater maintained \nby three factors: the conviction that short­term \nRCTs are guardians of truth, the continued use \nof instruments that are insensitive to the many \naspects of patients’ dysfunctionality that lie outside \nsymptom frames of reference, and a homoeopathic \nfantasy that brief psychological treatments are \nhighly potent. If these items stay as they are, the \ndifficulty of demonstrating informative differences \nbetween therapies will continue until the wishful \nside has overwhelmed realism, probably through \nsheer weight of numbers. \nWithin the remit of this article it has only been \npossible to present the evidence from outcome \ntrials, and that in a summarised, incomplete way. \nHowever, when we questioned the inclusion and \nexclusion criteria of guidelines, and the effect of \ncontinuing to use specific psychiatric diagnoses \nas an organising principle, we found that relevant \nevidence had got left out. Moreover, when we \nallow clinical experience a little more authority \nover short­term outcome research trials, other \npoints come into view. If we proceed to admit \nevidence from other kinds of science, a yet \nmore interesting range of conclusions becomes \npossible. Epidemiology, observations of natural \ncourse, developmental psychopathology, studies \nof psychosocial factors, life­events, experimental \nstudies and psychoanalytic findings themselves \nknow a great deal about the nature and origins of \ndepression and, in passing, provide supporting \nevidence for psychoanalytic theories about \ndepression. \nAlthough this more sophisticated conception of \nthe evidence base cannot tell us directly which \ntreatments will prove effective, it does enable us to \nknow the parameters of the disorder and the limits \non the plasticity of individuals. These are essen tial \nguides to the potential of different treatment. They \nare scales against which to measure some of the \nwilder claims. Psychiatry could go fur ther and re­\nintroduce other ideas, such as ‘pro found’ v. ‘banal’, \nto counter the narrowness of the sometimes \npseudostatistical significance\/non­significance \nformula. \nAdvances in Psychiatric Treatment (2008), vol. 14. http:\/\/apt.rcpsych.org\/ 411\nPsychotherapies for depression\nConclusions \nThis wider view of evidence is consistent with the \nfollowing. \n•\t Effect\t sizes\t for\t STPP\t similar\t to\t those\t for\t\nother therapies and, like them, superior to \nminimal treatment control conditions. The \nNICE depression guideline’s solitary recom­\nmendation for psychodynamic approaches \nis ‘Psychodynamic psychotherapy may be \nconsidered for the treatment of the complex \ncomorbidities that may be present along with \ndepression’ (National Collaborating Centre \nfor Mental Health, 2004: p. 63). In the light \nof the wider evidence available this seems \nnugatory, especially when it is recollected \nthat comorbidity is more the rule than the \nexception. The guideline is under revision. \n•\t A\ttendency\tfor\tthe\teffect\tof\tCBT\tto\tcome\tinto\t\nplay more quickly than that of STPP, but with \nlonger follow­ups the differential effect that \narises from this delay disappears (Shapiro et \nal, 1994).\n•\t Longer-term\t psychodynamic\t and\t psycho-\nanalytic therapies, by addressing the dys­\nfunctions of persons, may have the potential \nto go above an efficacy ceiling that operates in \nshort­term treatments. There are indications \nthat patients in longer­term psychoanalytic \ntreatments begin to manifest qualitatively \ndifferent types of change, which can move \nthem further into the normal range.\n•\t Although\t results\t from\t studies\t of\t combined\t\ndrug and psychological therapy may be \nmixed, there is evidence of ‘extra value’ \nfrom adding STPP to medication. Also, \nadding medication to STPP, especially where \nvegetative symptoms are pronounced, seems \nentirely sensible. There seem to be no trials \naddressing benefits from sequences of CBT \n→ STPP or STPP → CBT.\n•\t The\treasons\tpatients\thave\tfor\tpreferring\tone\t\ntreatment over another, including one form \nof psychological therapy rather than another, \nhave been under­explored.\n•\t The\t value\t of\t qualitative\t in-depth\t studies\t\nof single or small numbers of cases and of \nmore naturalistic designs has been under­\nestimated. \n•\t We\tshould\tthink\ta\tlot\tmore\tabout\tthe\tplacebo\t\neffect and the disputes over valuable but \nlimited gains. The psychological mechanisms \ninvolved in the placebo response in depression \nhave a role in normal emotional life. The \nbelief in good medicines dispensed by good \npeople who can provide succour is one of \nthe features of normal mental functioning \nthat fails in depression. The restoration of \nthis belief­function may be important for \nrecovery in depression.\nAll of these considerations are pointers towards \noptimal or enhanced services for patients suffering \nfrom the complex range of disorders that goes \nunder the general rubric of depression. \nDeclaration of interest\nD.T. is the clinical lead of the Tavistock Adult \nDepression Study, an RCT evaluating 18 months \nof weekly psychoanalytic psychotherapy in \nthe treatment of chronic, treatment­resistant \ndepression.\nReferences\nAbbass, A. A., Hancock, J. T., Henderson, J., et al (2006) Short­\nterm psychodynamic psychotherapies for common mental \ndisorders. Cochrane Database of Systematic Reviews, issue 4, \nCD004687. \nAnderson, E. M. & Lambert, M. J. (1995) Short­term dynamically \noriented psychotherapy: a review and meta­analysis. Clinical \nPsychology Review, 15, 503–514.\nAngst, J. & Dobler­Mikola, A. (1984) The Zurich Study II. The \ncontinuum from depressive to pathological mood swings. \nEuropean Archives of Psychiatry and Neurological Science, 234, \n21–29. \nAngst, J. & Dobler­Mikola, A. (1985) The Zurich Study. VI. A \ncontinuum from depression to anxiety disorders? European \nArchives of Psychiatry and Neurological Science, 235, 179–186.\nBeutel, M. & Rasting, M. (2002) Long­term treatments from \nthe perspectives of the former patients. In The Outcomes of \nPsychoanalytic Treatment (eds M. Leuzinger–Bohleber & M. \nTarget), ch. 11. Whurr.\nBlomberg, J., Lazar, A. & Sandell, R. (2001) Outcome of patients \nin long­term psychoanalytical treatments. First findings of the \nStockholm Outcome of Psychotherapy and Psychoanalysis \n(STOPP) study. Psychotherapy Research, 11, 361–382.\nBurnand, Y., Andreoli, A., Kolatte, E., et al (2002) Psychodynamic \npsychotherapy and clomipramine in the treatment of major \ndepression. Psychiatric Services, 53, 585–590.\nChurchill, R., Hunot, V., Corney, R., et al (2001) A systematic \nreview of controlled trials of the effectiveness and cost­\neffectiveness of brief psychological treatments for depression. \nHealth Technology Assessment, 5, 1–173.\nCooper, P. J., Murray, L., Wilson, A., et al (2003) Controlled trial \nof the short­ and long­term effect of psychological treatment \nof post­partum depression. 1: Impact on maternal mood. \nBritish Journal of Psychiatry, 182, 412–419.\nCoryell, W., Akiskal, H., Leon, A. C., et al (1994) The time course \nof untreated major depression: uniformity across episodes \nand samples. American Journal of Psychiatry, 51, 405–410.\nCrits­Christoph, P. (1992) The efficacy of brief dynamic psycho­\ntherapy: a meta­analysis. American Journal of Psychiatry, 159, \n325–333.\nDavanloo, H. (ed.) (1980) Basic Principles and Techniques in Short-\nterm Dynamic Psychotherapy. Spectrum.\nde Jonghe, F., Hendriksen, M., van Aalst, G., et al (2004) Psycho­\ntherapy alone and combined with pharmacotherapy in the \ntreatment of depression. British Journal of Psychiatry, 185, \n37–45. \nFonagy, P., Roth, A. & Higgitt, A. (2005) Psychodynamic \npsychotherapies. Evidence­based practice and clinical \nwisdom. Bulletin of the Menninger Clinic, 69, 13.\nAdvances in Psychiatric Treatment (2008), vol. 14. http:\/\/apt.rcpsych.org\/412\nTaylor\nFreud, S. (1905) Three essays on the theory of sexuality. \nReprinted (1953–1974) in the Standard Edition of the Complete \nPsychological Works of Sigmund Freud (trans. and ed. J. \nStrachey), vol. 7, pp. 125–243. Hogarth Press. \nFreud, S. (1917) Mourning and melancholia. Reprinted (1953–\n1974) in the Standard Edition of the Complete Psychological \nWorks of Sigmund Freud (trans. & ed. J. Strachey), vol. 14, p. \n237. Hogarth Press. \nGoldberg, D. & Goodyer, I. (2005) The Origins and Course of \nCommon Mental Disorders. Routledge. \nGoldberg, D., Privett, M., Ustun, B., et al (1998) The effects of \ndetection and treatment on the outcome of major depression \nin primary care: a naturalistic study in 15 cities. British \nJournal of General Practice, 48, 1840–1844.\nHirschfeld, R. M. (1991) Depressive illness: diagnostic issues. \nBulletin of the Menninger Clinic, 55, 144–155.\nJudd, L. L. (1997) The clinical course of unipolar major \ndepressive disorders. Archives of General Psychiatry, 54, 989–\n991. \nJudd, L. L., Akiskal, H. S. & Paulus, M. P. (1997) The role and \nclinical significance of subsyndromal depressive symptoms \n(SSD) in unipolar major depressive disorder. Journal of \nAffective Disorders, 45, 5–17.\nKessler, R. C., Bergland, P., Demler, O., et al (2003) The \nepidemiology of major depressive disorder: results from \nthe national comorbidity survey replication. JAMA, 289, \n3095–3105.\nKlein, M. (1940) Mourning and its relation to manic–depressive \nstates. Reprinted (1975) in The Writings of Melanie Klein. \nVol. 1 Love, Guilt and Reparation and Other Works 1921–1945. \nHogarth Press.\nKnekt, P., Lindfors, O., Harkanaen, T., et al (2008) Random­\nized trial on the effectiveness of long­and short­term \npsychodynamic psychotherapy and solution­focused \ntherapy on psychiatric symptoms during a 3­year follow­\nup. Psychological Medicine, 38, 689–703. \nKopta, S., Howard, K., Lowry, J., et al (1994) Patterns of \nsymptomatic recovery in psychotherapy. Journal of Consulting \nand Clinical Psychology, 62, 1009–1016.\nLambert, M. J. (1992) Psychotherapy outcome research: \nimplications for integrative and eclectic theories. In \nHandbook of Psychotherapy Integration (eds J. C. Norcross & \nM. R. Goldfried). Basic Books.\nLambert, M. J., Okiishi, J. C., Finch, A. E., et al (1998) Outcome \nassess ment: from conceptualization to implementation. \nProfessional Psychology: Research and Practice, 29, 63–70.\nLee, A. S. & Murray, R. M. (1988) The long­term outcome of \nMaudsley depressives. British Journal of Psychiatry, 153, 741–\n751.\nLeichsenring, F. (2001) Comparative effects of short­term \npsychodynamic psychotherapy and cognitive–behavioural \ntherapy in depression: a meta­analytic approach. Clinical \nPsychology Review, 21, 401–419.\nLeichsenring, F., Rabung, S. & Leibing, E. (2004) The efficacy \nof short­term psychodynamic psychotherapy in specific \npsychiatric disorders. A meta­analysis. Archives of General \nPsychiatry, 61, 1208–1216.\nLipsey, M. W. & Wilson, D. B. (1993) The efficacy of psychological, \neducation, and behavioral treatment: confirmation from \nmeta­analysis. American Psychologist, 48, 1181–1209. \nLuborsky, L., Singer B. & Luborsky, L. (1975) Comparative \nstudies of psychotherapies. Is it true that “everybody has \nwon and all must have prizes”? Archives of General Psychiatry, \n32, 995–1008. \nLuborsky, L., Diguer, L., Seligman, D. A., et al (1999) The \nresearcher’s own therapy allegiances: a “wild card” in \ncomparisons of treatment efficacy. Clinical Psychology: \nScience and Practice, 6, 95–106.\nMalan, D. H. (1976) Toward the Validation of Dynamic \nPsychotherapy. Plenum Press.\nMueller, T. I., Leon, A. C., Keller, M. B., et al (1999) Recurrence \nafter recovery from major depressive disorder during \n15 years of observational follow­up. American Journal of \nPsychiatry, 156, 1000–1006.\nMcPherson, S., Cairns, P., Carlyle, J., et al (2005) The \neffectiveness of psychological treatments for treatment \nresistant depression: a systematic review. Acta Psychiatrica \nScandinavica, 111, 331–340.\nMilton, J. (2001) Psychoanalysis and cognitive behaviour \ntherapy – rival paradigms or common ground? International \nJournal of Psychoanalysis, 82, 431–447.\nNational Collaborating Centre for Mental Health (2004) \nDepression: Management of Depression in Primary and \nSecondary Care. Clinical Guideline 23. NICE (http:\/\/guidance.\nnice.org.uk\/CG23\/?c=91523).\nPaykel, E. S. (1994) Historical overview of outcome of \ndepression. British Journal of Psychiatry, 165 (suppl. 26), 6–8.\nRobins, L. N. & Regier, D. A. (eds) (1991) Psychiatric Disorders \nin America: The Epidemiologic Catchment Area Study. The Free \nPress.\nRobinson, L. A., Berma, J. S. & Neimeyer, R. A. (1990) Psycho­\ntherapy for the treatment of depression: a comprehensive \nreview of controlled outcome research. Psychological Bulletin, \n108, 30–49.\nRoth, A. & Fonagy, P. (2004) What Works for Whom? A Critical \nReview of Psychotherapy Research (2nd edn). Guilford.\nSandell, R., Blomberg, J., Lazar, A., et al (2000) Varieties of long­\nterm outcome among patients in psychoanalysis and long­\nterm psychotherapy. A review of findings in the Stockholm \nOutcome of Psychoanalysis Project (STOPP). International \nJournal of Psychoanalysis, 81, 921–943.\nSargeant, J. K., Bruce, M. L., Florio, L. P., et al (1990) Factors \nassociated with 1­year outcome of major depression in the \ncommunity. Archives of General Psychiatry, 47, 519–526.\nShapiro, D. A., Barkham, M., Rees, A., et al (1994) Effects \nof treatment duration and severity of depression in the \nmaintenance of gains following cognitive\/behavioural and \npsychodynamic\/interpersonal psychotherapy. Journal of \nConsulting and Clinical Psychology, 62, 522–534.\nSpijker, J., de Graaf, R., Bijl, R. V., et al (2002) Duration of major \ndepressive episodes in the general population: results from \nThe Netherlands Mental Health Survey and Incidence Study \n(NEMESIS). British Journal of Psychiatry, 181, 208–213.\nStimpson, N., Agrawal, N. & Lewis, G. (2002) Random­\nised controlled trials investigating pharmacological and \npsychological interventions for treatment­refractory \ndepression. Systematic review. British Journal of Psychiatry, \n181, 284–294.\nSurtees, P. G. & Barkley, C. (1994) Future imperfect: long­term \noutcome of depression. British Journal of Psychiatry, 164, \n327–341.\nSvartberg, M. & Stiles, T. C. (1991) Comparative effects of \nshort­term psychodynamic psychotherapy: a meta­analysis. \nJournal of Consulting and Clinical Psychology, 59, 704–714.\nThase, M. E., Greenhouse, J. B., Frank, E., et al (1997) Treatment \nof major depression with psychotherapy or psychotherapy–\npharmacotherapy combinations. Archives of General \nPsychiatry, 54, 1009–1015.\nThompson, L. W., Gallagher, D. & Breckenridge, J. S. (1987)\nComparative effectiveness of psychotherapies for depressed \nelders. Journal of Consulting and Clinical Psychology, 55, 385–\n390.\nWampold, B. E., Minami, T., Baskin, T. W., et al (2002) A meta­\n(re)analysis of the effects of cognitive therapy versus ‘other \ntherapies’ for depression. Journal of Affective Disorders, 68, \n159–165.\nWampold, B. E., Mondin, G. W., Moody, M., et al (1997) A meta­\nanalysis of outcome studies comparing bona fide psycho­\ntherapies: empirically, ‘all must have prizes’. Psychological \nBulletin, 122, 203–215.\nWeissman, M. M., Bruce, M. B., Leaf, P. J. et al (1991) Affective \ndisorders. In Psychiatric Disorders in America: The Epidemiologic \nCatchment Area Study (eds L. N. Robins & D. A. Regier), pp. \n53–80. The Free Press.\nWesten, D., Novotny, C. M. & Thompson­Brenner, H. (2004) The \nempirical status of empirically supported psychotherapies: \nassumptions, findings, and reporting in controlled clinical \ntrials. Psychological Bulletin, 130, 631–663.\nAdvances in Psychiatric Treatment (2008), vol. 14. http:\/\/apt.rcpsych.org\/ 413\nPsychotherapies for depression\nMCQ answers\n1  2  3  4 \na F a F a F a F\nb F b F b F b F\nc F c F c F c T\nd F d T d T d F\ne T e F e F e F\nMCQs\nIn individuals presenting with major depressive 1 \ndisorder:\nthere is little likelihood of panic disordera \nfull recovery is usual and recurrence unlikelyb \naside from the symptoms of depression the personality c \nis usually normal\npersonal loss plays no partd \nthere may be ongoing difficulties in personal e \nfunctioning in periods of recovery.\nAccording to the psychoanalytic theory of 2 \ndepression:\nthoughts and feelings outside core awareness play no a \npart in the condition \ndifficulties with anger and aggression are not foundb \nthe concept of the ‘object’ refers to any inanimate c \nthing\nemotional ambivalence deriving from early childhood d \nrelationships and losses is crucial\nthe depressed person’s superego is usually benign e \nand forgiving.\nWith respect to the treatment of depression the 3 \nevidence indicates that:\nshort­term psychodynamic psychotherapy offers no a \nbenefit\npatient preference should not be taken into accountb \non average, c ≤ 20 sessions of psychological therapy \nwill move patients’ Beck Depression Inventory scores \ninto the normal range\nlonger­term therapies (e.g. 300 sessions) may offer d \nbenefits not possible with brief treatments\nthe effects of short­term psychodynamic psycho­e \ntherapy are usually evident immediately.\nThe evidence base with respect to the treatment of 4 \ndepression: \noffers clear indications about the best treatment of a \nchronic or recurrent depression\nis derived from many good­quality RCTs with b \nclinically representative samples and long follow­\nups\nis bedevilled by the effects of researcher allegiance c \nand publication bias\nis of no valued \nis very reassuring.e \n"}