{"doi":"10.1093\/imammb","coreId":"96929","oai":"oai:generic.eprints.org:509\/core69","identifiers":["oai:generic.eprints.org:509\/core69","10.1093\/imammb"],"title":"Pattern formation in reaction diffusion models with spatially inhomogeneous diffusion coefficients","authors":["Maini, P. K.","Benson, D. L.","Sherratt, J. A."],"enrichments":{"references":[{"id":803332,"title":"A theory of biological pattern formation.","authors":[],"date":"1972","doi":null,"raw":null,"cites":null},{"id":803555,"title":"Bifurcation analysis of nonlinear reaction diffusion equations—II. Steady state solutions and comparison with numerical solutions.","authors":[],"date":"1975","doi":null,"raw":null,"cites":null},{"id":801908,"title":"Bifurcation analysis of nonlinear reaction-diffusion equations—I. Evolution equations and the steady state solutions.","authors":[],"date":"1975","doi":null,"raw":null,"cites":null},{"id":803889,"title":"Bifurcations in Turing systems of the second kind may explain blastula cleavage plane orientation.","authors":[],"date":"1987","doi":null,"raw":null,"cites":null},{"id":805084,"title":"Cellular mechanisms of pattern formation in the developing limb.","authors":[],"date":"1991","doi":null,"raw":null,"cites":null},{"id":807854,"title":"Conversion by retinoic acid of anterior cells into ZPA cells in the chick wing bud.","authors":[],"date":"1991","doi":null,"raw":null,"cites":null},{"id":802425,"title":"Diffusion driven instability in an inhomogeneous domain.","authors":[],"date":"1992","doi":null,"raw":null,"cites":null},{"id":808566,"title":"Double anterior chick limb buds and models for cartilage rudiment specification.","authors":[],"date":"1990","doi":null,"raw":null,"cites":null},{"id":804379,"title":"Drosophila segmentation: Supercomputer simulation of prepattern hierarchy.","authors":[],"date":"1990","doi":null,"raw":null,"cites":null},{"id":802824,"title":"Experimental evidence of a sustained standing Turing-type non-equilibrium chemical pattern.","authors":[],"date":"1990","doi":null,"raw":null,"cites":null},{"id":802146,"title":"How well does Turing's theory of morphogenesis work?","authors":[],"date":"1974","doi":null,"raw":null,"cites":null},{"id":807072,"title":"Identification and spatial distribution of retinoids in the developing chick limb.","authors":[],"date":"1987","doi":null,"raw":null,"cites":null},{"id":805558,"title":"Mathematical Biology.","authors":[],"date":"1989","doi":null,"raw":null,"cites":null},{"id":804855,"title":"Modeling the Drosophila pair-rule pattern by reaction-diffusion: Gap input and pattern control in a 4-morphogen system.","authors":[],"date":"1990","doi":null,"raw":null,"cites":null},{"id":805318,"title":"Models of Biological Pattern Formation.","authors":[],"date":"1982","doi":null,"raw":null,"cites":null},{"id":806763,"title":"Pattern formation along the anteroposterior axis of the chick limb: The increase in width following a polarizing graft and the effect of x-irradiation.","authors":[],"date":"1981","doi":null,"raw":null,"cites":null},{"id":803091,"title":"Pattern formation in generalized Turing systems. I. Steady-state patterns in systems with mixed boundary conditions.","authors":[],"date":"1992","doi":null,"raw":null,"cites":null},{"id":808410,"title":"Positional information and spatial","authors":[],"date":"1981","doi":null,"raw":null,"cites":null},{"id":808236,"title":"Positional information and the spatial pattern of cellular differentiation.","authors":[],"date":"1969","doi":null,"raw":null,"cites":null},{"id":805828,"title":"Retinoic acid induces polarizing activity but is unlikely to be a morphogen in the chick limb bud","authors":[],"date":"1991","doi":null,"raw":null,"cites":null},{"id":802647,"title":"Retinoic acid modulates gap junctional permeability: A comparative study of dye spreading and ionic coupling in cultured cells.","authors":[],"date":"1991","doi":null,"raw":null,"cites":null},{"id":806069,"title":"Scale-invariance in reaction-diffusion models of spatial pattern formation.","authors":[],"date":"1980","doi":null,"raw":null,"cites":null},{"id":806325,"title":"Simple chemical reaction systems with limit cycle behaviour.","authors":[],"date":"1979","doi":null,"raw":null,"cites":null},{"id":804582,"title":"Size adaptation of Turing prepatterns.","authors":[],"date":"1988","doi":null,"raw":null,"cites":null},{"id":807510,"title":"The chemical basis of morphogenesis.","authors":[],"date":"1952","doi":null,"raw":null,"cites":null},{"id":806297,"title":"Transition from a uniform state to hexagonal striped Turing patterns.","authors":[],"date":"1991","doi":null,"raw":null,"cites":null},{"id":804127,"title":"Turing prepatterns of the second kind simulated on supercomputer in three curvilinear coordinates and time. In: Cell to Cell Signalling: From Experiments to Theoretical Models","authors":[],"date":"1989","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1992","abstract":"Reaction-diffusion models for biological pattern formation have been studied extensively in a variety of embryonic and ecological contexts. However, despite experimental evidence pointing to the existence of spatial inhomogeneities in various biological systems, most models have only been considered in a spatially homogeneous environment. The authors consider a two-chemical reaction-diffusion mechanism in one space dimension in which one of the diffusion coefficients depends explicitly on the spatial variable. The model is analysed in the case of a step function diffusion coefficient and the insight gained for this special case is used to discuss pattern generation for smoothly varying diffusion coefficients. The results show that spatial inhomogeneity may be an important biological pattern regulator, and possible applications of the model to chondrogenesis in the vertebrate limb are suggested","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/96929.pdf","fullTextIdentifier":"http:\/\/eprints.maths.ox.ac.uk\/509\/1\/28.pdf","pdfHashValue":"59513c820ce007bec433bbe5db5845784fc6e051","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:509<\/identifier><datestamp>\n      2015-05-29T18:23:31Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4143:4D3932<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.maths.ox.ac.uk\/509\/<\/dc:relation><dc:title>\n        Pattern formation in reaction diffusion models with spatially inhomogeneous diffusion coefficients<\/dc:title><dc:creator>\n        Maini, P. K.<\/dc:creator><dc:creator>\n        Benson, D. L.<\/dc:creator><dc:creator>\n        Sherratt, J. A.<\/dc:creator><dc:subject>\n        Biology and other natural sciences<\/dc:subject><dc:description>\n        Reaction-diffusion models for biological pattern formation have been studied extensively in a variety of embryonic and ecological contexts. However, despite experimental evidence pointing to the existence of spatial inhomogeneities in various biological systems, most models have only been considered in a spatially homogeneous environment. The authors consider a two-chemical reaction-diffusion mechanism in one space dimension in which one of the diffusion coefficients depends explicitly on the spatial variable. The model is analysed in the case of a step function diffusion coefficient and the insight gained for this special case is used to discuss pattern generation for smoothly varying diffusion coefficients. The results show that spatial inhomogeneity may be an important biological pattern regulator, and possible applications of the model to chondrogenesis in the vertebrate limb are suggested.<\/dc:description><dc:date>\n        1992<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.maths.ox.ac.uk\/509\/1\/28.pdf<\/dc:identifier><dc:identifier>\n          Maini, P. K. and Benson, D. L. and Sherratt, J. A.  (1992) Pattern formation in reaction diffusion models with spatially inhomogeneous diffusion coefficients.  IMA Journal of Mathematics Applied in Medicine & Biology, 9  (3).   pp. 197-213.      <\/dc:identifier><dc:relation>\n        10.1093\/imammb\/9.3.197<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.maths.ox.ac.uk\/509\/","10.1093\/imammb\/9.3.197"],"year":1992,"topics":["Biology and other natural sciences"],"subject":["Article","PeerReviewed"],"fullText":"IMA Journal of Mathematics Applied in Medicine & Biology (1992) 9, 197-213\nPattern formation in reaction-diffusion models with spatially\ninhomogeneoos diffusion coefficients\nPHILIP K. MAINI, DEBBIE L. BENSON, AND JONATHAN A. SHERRATT\nCentre for Mathematical Biology, Mathematical Institute, 24-29 St. Giles1,\nOxford 0X1 3LB, UK\n[Received 20 May 1992 and in revised form 10 September 1992]\nReaction-diffusion models for biological pattern formation have been studied\nextensively in a variety of embryonic and ecological contexts. However, despite\nexperimental evidence pointing to the existence of spatial inhomogeneities in various\nbiological systems, most models have only been considered in a spatially homogeneous\nenvironment. The authors consider a two-chemical reaction-diffusion mechanism in\none space dimension in which one of the diffusion coefficients depends explicitly on\nthe spatial variable. The model is analysed in the case of a step function diffusion\ncoefficient and the insight gained for this special case is used to discuss pattern\ngeneration for smoothly varying diffusion coefficients. The results show that spatial\ninhomogeneity may be an important biological pattern regulator, and possible\napplications of the model to chondrogenesis in the vertebrate limb are suggested.\nKeywords: diffusion-driven instability, pattern isolation; inhomogeneous environ-\nment; developmental hierarchy.\n1. Introduction\nReaction-diffusion theory for pattern formation was first proposed by Turing (1952)\nin his seminal work on the chemical basis for morphogenesis. Turing demonstrated\nthat, in certain systems, diffusion could give rise to spatial inhomogeneities (Turing\nstructures) in the concentration of reacting chemicals (termed morphogens). With\nthe hypothesis that cells differentiate according to local morphogen concentration,\nthis prepattern in morphogen concentration would then be translated into a spatial\npattern of cell differentiation. This is the fundamental concept underlying the\napplication of reaction-diffusion models to morphogenesis: for a review see, for\nexample, the books by Meinhardt (1982) and Murray (1989). Although experimental\nevidence for the existence of morphogens in biological systems is, at present, tenuous,\nTuring structures have recently been found in chemical systems (Castets et al., 1990;\nOuyang & Swinney, 1991).\nAn alternative model for pattern formation is the gradient model proposed by\nWolpert (1969, 1981) and applied to skeletal patterning in the vertebrate limb. The\nbasic hypothesis of this model is that a gradient in morphogen concentration is set\nup along the anterior-posterior (AP) axis of the developing limb bud. With the\nfurther hypothesis that there are a series of threshold levels for differentiation, this\nmodel exhibits patterns which are consistent with those observed in chondrogenesis\nin the limb. However, although gradients in the concentration of certain retinoids\n197\n<O Oxford Umrenity Preo 1992\n198 PHILIP K. MAINI ET AL.\nhave been shown to exist in the developing chick limb (Thaller & Eichele, 1987),\ntheir role in pattern formation remains controversial (Wanek et al., 1991; Noji et al^\n1991). Moreover, although positional information in the gradient model is set up by\na simple mechanism, its interpretation is via a complex series of arbitrary thresholds\nfor which detailed mechanisms have not been proposed. In contrast, the mechanism\nof spatial patterning in Turing systems, although much more complex, is well\nunderstood, and its interpretation is via a simple single threshold level.\nTuring models have been proposed as possible pattern generators in a variety of\nbiological situations. However, in the particular application to the developing limb\nbud there are a number of drawbacks to this model (Maini & Solursh, 1991). Firstly,\nit has been shown that solutions of Turing models are sensitive to initial conditions\n(Bard & Lauder, 1974) and that to generate the sequence of bifurcations observed\nin skeletal patterning in the limb requires the parameters of the system to evolve in\na very precise and complex manner (Dillon et al., 1992). These properties are obvious\ndrawbacks of a model for a robust patterning mechanism such as that in the limb.\nRecently, however, it has been shown that the choice of mixed boundary conditions\ncan greatly influence the patterning properties of the Turing model and one can, in\nfact, generate the sequence of bifurcations observed in the limb bud in a robust and\nsimple manner (Dillon et al., 1992).\nAnother criticism of Turing systems is that the patterns produced are scale\ndependent. In the developing chick limb, recent experiments (Wolpert & Hornbruch,\n1990) show that a recombinant limb bud consisting of the anterior halves of two\ndifferent limb buds develops two humeri, yet is the same size as a normal limb bud,\nwhich only produces one humerus. This clearly contradicts the standard Turing\nmodel which predicts an identical number of elements in limbs of the same size.\nA further criticism of Turing models for limb development is that they produce\nspatial patterns which are symmetric along the AP axis of the limb bud. The skeletal\nelements in the limb, however, are not symmetrically situated along this axis (see e.g.\nWalbot & Holder, 1987: Chap. 18). Moreover, the patterns generated by the standard\nTuring model cannot, in general, distinguish between distinct skeletal rudiments such\nas the different types of digit, because the amplitude of oscillations is constant\nthroughout the solution profile.\nThe reason for these inconsistencies with experimental observation may be that\nmost apphcations of Turing systems assume that the background environment is\nspatially homogeneous, that is, all model parameters are assumed constant across\nthe domain. However, there is experimental evidence to suggest that in some\nbiological systems environmental inhomogeneity may be an important regulator of\npattern. This was recognized by Turing himself, who, in his 1952 paper, wrote that\n'most of an organism, most of the time, is developing from one pattern into another,\nrather than from homogeneity into a pattern'. In this paper we consider how an\nunderlying spatial prepattern in diffusion coefficients modifies the pattern forming\nproperties of a reaction-diffusion model. In developmental biology, spatial variation\nin morphogen diffusivity may be controlled by the concentration of a regulatory\nchemical which, for example, affects morphogen transport by binding to the\nmorphogen or by modulating gap junction permeability (Othmer & Pate, 1980,\nHunding & Serenson, 1988; Brummer et al., 1991). Several authors have investigated\nPATTERN FORMATION IN REACTION-DIFFUSION MODELS 199\nnumerically the effects of spatially varying reaction terms in reaction-diffusion\nsystems (Gierer & Meinhardt, 1972; Hunding et al., 1990, Lacalli, 1990) and the\neffects of spatially varying diffusion (Hunding, 1987, 1989). Auchmuty & Nicolis\n(1974) and Herschkowitz-Kaufman (1975) analyse a system in which one of the\nreaction terms depends explicitly on space. However, we are not aware of any\nanalytical studies of the effects of spatially inhomogeneous diffusion coefficients.\nWe present a two-step reaction-diffusion model for pattern formation. The first\nstep establishes a prepattern in diffusion coefficients which then modifies the\npattern-forming properties of the overlying reaction-diffusion mechanism. Such a\nsystem is not mathematically tractable in general, but can be analysed when the\nspatial variation in diffusion coefficients is piecewise constant. In Section 2 we present\na linear analysis for a system in which one of the diffusion coefficients is a step\nfunction in space with only one point of discontinuity, while the other is constant\nacross the domain. In Section 3 we present numerical solutions of the full nonlinear\nmodel and show that the predictions from linear analysis compare well with the\nsolutions of the nonlinear problem. We also show that the model can exhibit highly\nasymmetric and isolated patterns. Although a discontinuity in diffusion coefficient is\nbiologically implausible, this simple case provides an understanding of how spatial\ninhomogeneities can modulate pattern in more realistic systems. In Section 4 we\nconsider a more biologically realistic two-step model in which the spatially hetero-\ngeneous distribution of a regulatory chemical sets up a smooth gradient in one of\nthe diffusion coefficients of the reaction-diffusion model. This composite model\nessentially incorporates the gradient model with the classical Turing model. We\ndiscuss the possible application of our composite model to chondrogenesis in\nSection 5.\n2. Linear analyse\nA reaction-diffusion system is said to exhibit diffusion-driven instability (Turing,\n1952) if a uniform steady state is stable to spatially homogeneous perturbations, but\nunstable to spatially inhomogeneous perturbations. When diffusive instability is\npossible, stable spatially heterogeneous solutions of the model equations may exist\nTherefore, our primary interest is to determine the parameter domain in which\ndiffusion-driven instability may occur, and we begin by summarizing necessary and\nsufficient conditions for the generation of pattern in a homogeneous domain.\nWe consider the standard dimensionless two-species Turing model in one space\ndimension:\n^ Yf(u,v) + ^ (2.1a)\not ox\ndv d2v\n— = yg(u, v) + D —\ndt dx\n—. (2.1b)\nHere y is a scale factor proportional to the length of the domain, and \/ and g are\nthe reaction kinetics for which there exists a positive homogeneous steady state\n(\"o, v0). In this model it is assumed that morphogen diffusivity is constant throughout\n2 0 0 PHILIP K. MATNI ET AL.\nthe domain, so that the ratio D of diffusion coefficients is a positive constant We\nfurther assume that the spatial domain has been nondimensionalized to [0 , 1], and\nwe impose zero-flux boundary conditions. Standard linear analysis shows that\ndiffusion-driven instability may occur in this system for parameters lying in the Turing\nspace denned by\na + d < 0, (2.2a)\nad > be, (2.2b)\nwhere\naJJ-\ndu\na + Dd\n(a + Dd)2\n(-0.00)' d v\n»\n(*o.fo)\n>o,\n>AD{ad\nc =\n ¥u\n-be),\nJ d\n_dg\ndv («o,oo)\n(2.2c)\n(2.2d)\n(2.3)\nFor a detailed derivation of these results, see, for example, the book by Murray\n(1989). The above results hold in higher dimensions but in the rest of this paper we\nrestrict our attention to one dimension. The one-dimensional geometry facilitates\nanalytical investigation and, moreover, for the particular application to the limb bud\ndiscussed below, this is a relevant approximation and is widely used (see, for a review,\nMaini & Solursh, 1991). It follows from (2.2a-c) that both ad and be must be negative,\nso that, to within an arbitrary relabelling of species, there are essentially two kinds\nof reaction-diffusion models capable of exhibiting diffusion-driven instability, having\nkinetic matrices taking one of the following forms:\npure activator-inhibitor model cross activator-inhibitor model\nIn the former case, the steady-state solutions are always in phase, whereas those in\nthe latter are in antiphase, at least in the vicinity of primary bifurcation points (Dillon\net al., 1992). In both cases, along primary bifurcation branches, the model solutions\nare characterized by an approximately equal spaced succession of peaks and troughs\nof constant amplitude spread across the domain (Fig. 1), such that increases in the\nlength of the domain lead, in general, to more complicated patterns with a greater\nnumber of peaks and troughs. An important property of these solutions is the\nsensitivity of pattern polarity to initial conditions. This may be seen analytically for\nthe linearized system, for whenever (rt, 0) = (u — u0, v — v0) is a solution of\nfl, = Lu + fj + *„, 6, = gj + 0j + DC^ (2.4)\nthen (—13, — 6) is also a solution. The solution of the linearized model is therefore\ngiven by either u = uQ + u\\v = v0 + C or u = u0 — u\\v = v0 — 0. The actual solution\nis determined by the initial conditions, so that different sets of initial conditions may\ndetermine solutions with opposite polarity. This multiplicity of solutions is also\nexhibited by the full nonlinear system.\nWe now outline the derivation of the conditions for diffusion-driven instability in\nan inhomogeneous environment in which one of the diffusion coefficients is a step\nPATTERN FORMATION IN REACTION-DIFFUSION MODELS 201\n\"x\"\n3\n1.3\nl.Z\n1.1\n1.0-\nO.fr\nA\n\/ \\\n\/\n\/\n\/\/\\ 1\n0.2 0.4 0.6\nx\n(b)\n1.30\n1.25\n1.20\n1.16\n1.10\n0.8 1.0\nFIG. 1. (a) and (b) show, respectively, typical steady-state solution profiles of a cross activator-inhibitor\nmodel (Gierer & Meinhardt, 1972) and a pure activator-inhibitor model (Schnackenberg, 1979). In (a)\nthe morphogen concentration profiles u and v are approximately in antiphase; in (b) they are in phase. In\nboth cases the horizontal line ( ) shows the position of the homogeneous steady state (u: ; v. ).\nfunction in space with a single point of discontinuity (see Benson et al., 1992, for full\ndetails). In particular, we consider the model equations (2.1) with the diffusion term\nin (2.1b) replaced by (d\/dx)[£>(x) dv\/dx], where\n(2.5)\nD i= £>+, and <J e (0, 1). Clearly, the conditions for the steady state to be stable to\nspatially homogeneous perturbations are the same as in the case of homogeneous\nenvironment (D~ = D+), that is (2.2a) and (2.2b). To derive the analogues of (2.2c)\nand (2.2d) for the inhomogeneous case, we linearize the model about the steady state\nand look for solutions to the linear system of the form u — uo = (exp Xt)Xu(x),\nv — v0 = (exp Xi)Xv(x). Substituting these expressions into the linearized model gives\nrise to a pair of coupled ordinary differential equations in Xu and Xv:\nXnu + (a- X)XU + bXv = 0,\n(D(x)X'u)' + cXM + (d - X)XV = 0,\n(2.6a)\n(2.6b)\nwhere a prime denotes d\/dx.\nSince our model divides the domain into two parts on which the diffusivity of u\nis the same but that of v is different, we initially consider equations (2.6) on the\ninterval [0 , £). On this interval, adding (2.6a) to s,\"\/D~ times (2.6b) for i = 1,2, leads\nto the pair of equations\nD J\\ a - k + cst ID\nwhere sl and s2 are chosen to be the roots of the quadratic\n-x,) = o,\ncs2 - bD~ = 0.\n(2.7)\n(2.8)\n2 0 2 PHILIP K. MAINI ET AL.\nThis reduces (2.7) to two equations in Xu + s^Xc which may be solved subject to\nthe zero-flux boundary conditions at x = 0 to give\nX.(x) = — L - (<r- + * r - > * cos\n gl-x -\n ( r\n\"\n +\n *\nF\n'K cos a2-x\\ (2.9a)\ns2 — st \\ cos £at cos £a2 \/\nXv(x) = — -[——-^-?cosa2x- ——-i^cosajx . (2.9b)\ns2 — sx \\ cos (JaJ cos ia1 )\nHere xe[0,£), a,\" = a — X + cs[\/D~ for i = 1, 2 and the variables rB and \/j,\nrepresent Xu(^) and Xv(£) respectively. Similarly, on the interval (£, 1],\ns2\n+\n - st\n+\n \\cos(l - ^ a ^ cos(l - ( 1 9 d )\nBy design the solutions (2.9) are continuous at x = <!;. In addition, however, they\nmust also satisfy the conditions for continuity of flux at this point, namely\nlim X'u(x) = lim X'u(x) and lim ^ \" ^ ( x ) = lim D + X'c(x). (2.10)\nSubstituting the solutions (2.9) into these limits, we obtain the following simultaneous\nequations for FM and Fo:\n= o, R(X)rH + S(X)rv = o,\nwhere\nP(X) = (sfTT - S;T;)\/(S; - s;) + (Sl+r2+ - S2+T7)\/(S2+ - Sl+),\n(r2- - 7T)\/(s2- - sr) + S ^ ^ T ? - 7?)\/(s2+ - Sl+),\ni - 77)\/(s2- - sf) + i5+(7T - ^)\/(s2 + - «i+),\nr7T - s2-7I)\/(s2- - sf) + D\\s\\TX - s^)\/(si - sf),\nand TJ = aj\" tan &J and J\/\" = aj1\" tan(l — <J)a\/ f°r 7 = U 2. From the solutions\n(2.9), rH = ro = 0 implies A\"u = Xv = 0. Hence, for nontrivial solutions in Xu and Xv,\nwe require\n= P(X)S(X) - Q(X)R(X) = 0. (2.11)\nHere F(X) represents the dispersion relation relating the rate of growth of linear\ninstabilities to a given set of parameter values. The Turing space is therefore described\nby the inequalities (2.2a) and (2.2b) and the conditions that guarantee a solution of\n(2.11) with positive real part. Note that in deriving the dispersion relation (2.11) we\nhave assumed that each of si\" — s^, and cos &J and cos(l — QaJ for j = 1 or 2,\nare nonzero. Under these conditions, for D~ # D+, the solutions for u and v cannot,\nin general, satisfy continuity of flux at x = £. Hence, except in very special\ncircumstances, our assumptions are valid.\nPATTERN FORMATION IN REACTION-DIFFUSION MODELS\n4\nt 1\n1 O\n203\n-3H\n- 4\nI\n\/\n-100\n\\\n1\n100 260\nFIG. 2 A typical functional form of the dispersion relation F(X), defined in (211), for Schnackenberg\nkinetics (3.1), with parameter values X = 1040, A = 0.1, B = 0.9, D~ = 7, D* = 12, { = 0.5. To better\nillustrate the infinities of F(X), we plot sign (F(X)) log(l + |F(A)|) on the vertical axis. For this particular\nset of parameters there are two unstable modes, with approximate linear growth rates X = 34.9 and\nX = 104.4. For all parameter values, a straightforward calculation shows that F(X) = O(X) as X -» 00.\nIn general, solutions of (2.11) will be complex valued. However, for homogeneous\ndiffusion coefficients, all roots of the dispersion relation with positive real part can\nbe shown to be real valued. In the inhomogeneous case, extensive numerical\nsimulations of the full nonlinear system show that the spatially uniform solution\nalways evolves to a steady state rather than a temporally oscillating solution,\nsuggesting that the uniform solution bifurcates through real eigenvalues. Therefore\nwe restrict our investigations to real values of k. In contrast to the homogeneous\ncase, the dispersion relation (2.11) cannot be solved analytically when D~ ^D+.\nHowever, straightforward algebra shows that whenever k is real, F(k) is real valued\nand therefore amenable to simple numerical calculation. Typical forms of the\ndispersion relation are illustrated in Fig. 2.\n3. Numerical solutions of the nonlinear model\nTo apply the analysis of the previous section, we take, as a specific example, the\nsimplest of the family of cross activator-inhibitor models proposed by Schnackenberg\n(1979). When appropriately nondimensionalized in one space dimension with a step\nfunction in the diffusion coefficient of the activator chemical v, the model equations\ntake the form\n(3.1a)\n( 3 1 b )\nfor x e (0, 1). Here D(x) is the step function defined by (2.5), y is the scale factor,\n204 PHILIP K. MAINI ET AL.\nFIG. 3. The parameter space for the reaction-diffusion system (3.1). The diffusion coefficient of the species\nu is constant throughout the domain, while that of v has the constant value D~ on [0, f) and D+ on\n(i, 1]. The region of interest is D~ < D+; the shaded region is therefore ignored. In region I, patterns\nare either type B isolated patterns or (for larger values of Z)*) nonisolated patterns; the division between\nthese types is arbitrary. In region II, D+ < D^u and thus the system does not exhibit diffusion-driven\ninstability. For parameters in region III, diffusion-driven instability grves rise to type A isolated patterns\n(see text for details). Parameter values are y - 1040, ( = 0.5, A = 0.1, B = 0.9. Solutions at the points\nindicated are shown in Fig. 4. To better illustrate the behaviour for D~ small, we use a magnified linear\nhorizontal scale on 0 < D~ < 0.5.\nand A and B are positive constants. We impose zero-flux boundary conditions. This\nsystem has a unique homogeneous steady state, at u = A + B, v = B\/(A + B)2, which\nis stable to homogeneous perturbations provided (A + B)3 > B — A; all numerical\nsimulations we present use values of A and B satisfying these inequalities.\nUsing the dispersion relation (2.11) we can determine numerically the parameter\nspace in which this system exhibits diffusion-driven instability. As expected intuitively,\ndiffusion-driven instability is observed whenever both D~ and D+ exceed Dcril, where\nDcrU is the critical value which D must exceed for diffusion-driven instability in the\nhomogeneous case D+ = D~ = D. Moreover, our results imply that when D~ lies\nbelow £)crll in [0, £), the value of D+ must exceed some critical value D^ t which is\nlarger than D^, in (£, 1]. The variation of Dc+rit w ' t n D~ i s illustrated in Fig. 3. We\nthus define the Turing space by (2.2a, b) and the following conditions:\n(1) D\n(2) D\nD~ > D\ncrit,\na n d D\n+\n > £>c+rlt > Dc\ntii.\nIt is important to note that these conditions depend crucially on the fact that a > 0.\nFor a < 0 the inequalities are essentially reversed so that the Turing space is defined\nby the conditions (2.2a, b), Dcrit >D+ > D',D+ > Dcrll, and Dcrll > D~rit > D~.\nFigure 4 shows that the key qualitative features of the patterns generated by the\nfull nonlinear model (3.1) are generally captured by the solutions of the linearized\nPATTERN FORMATION IN REACTION-DIFFUSION MODELS 205\n| Linear Solution | I PDB Solution |\n02 0.4 0.6 0.8 1 02 0.4 0.6 0.8 1.0\n1.6-\n1.2-\n0.8-\n0.4-\n| Linear Solution\n1\nA '' '\n\/ \\ \/ i\n\/ \\\n^ \/ 1 1\nX A i\nV\n\/\/\/1\nt\nt\ni\ni\nI\ni\n\\\n1.2\n1.0\n(c)\n02 0.4 0.6 0.8 1\nO.8\n0.920\n+0.900 3\nO.880\n02 0A 0.6 0.8 1 0\nFio. 4. Comparison of the steady-state solution profiles of the Schnackenberg system (3.1) with the linear\nsolution (19) in different regions of parameter space for initial conditions of small random perturbations\nabout the uniform steady state: (a) a type-B isolated pattern, with D~ = 7 and D* = 10; (b) a nonisolated\npattern, with D~ = 8.4 and D+ = 8.9; (c) a type-A isolated pattern, with D~ = 0.1 and D* - 92. The\nother parameter values are A = 0.1, B •= 0.9, y = 1040, { = 0.5. The location of these solutions in the\nD'-D+ parameter space is illustrated in Fig. 3. As the morphogen concentrations grow, linear analysis\nis no longer valid. However, in each case the qualitative behaviour of the full nonlinear pattern is captured\nby the linear solution. For sufficiently large D+, the uniform steady state becomes unstable to several\nmodes with similar growth rates, and different initial conditions result in qualitatively different patterns.\nNote that the patterns for u and v are out of phase (u: ; v: ).\n206 PHILIP K. MAINI ET AL.\nsystem described by (2.9). As in the homogeneous case, when more than one solution\nof the linear system has a positive rate of growth, the nonlinear spatial pattern is, in\nmany cases, well approximated by the solution corresponding to the largest real root\nof the dispersion relation (2.11). Moreover, this result is not specific to Schnackenberg\nkinetics, but is, in general, true for any cross or pure activator-inhibitor reaction\ndiffusion model (Benson et al, 1992).\nThe crucial difference between the patterns illustrated in Fig. 4 and those obtained\nfrom reaction-diffusion models in a homogeneous environment is that, in the former\ncase, pattern can be isolated in specific parts of the domain. By appropriately\nsubdividing the domain any spatial pattern can be said to be restricted to a particular\nsubdomain. However, in the inhomogeneous environment case, this restriction is\nindependent of the scale parameter y. This is in marked contrast to the homogeneous\ncase, where varying the scale parameter alters the number and position of concen-\ntration peaks so that, for appropriate values of y, pattern may occur in any\nsubdomain.\nMathematically we can divide the isolated patterns of our model into two\ncategories:\nType A: as the scale parameter y varies (but is large enough for diffusion-driven\ninstability to occur), the steady-state solution profiles are always monotonic in one\npart of the domain, but in general oscillatory in space elsewhere.\nType B: as y varies, the steady-state solution profiles are generally oscillatory in space\nthroughout the domain, but with much greater amplitude in one part of the domain\nthan elsewhere.\nUsing the solutions (2.9) of the linearized model, one can derive conditions for the\nexistence of type A isolated patterns in the Turing space (Benson et al., 1992). In\nparticular, it can be shown that type A solutions, in which the pattern predominates\nin the interval (£ , 1], exist for sufficiently small values of the diffusion coefficient on\n[0, £); specifically, for D~ < Dc~rit, where D~lt is the smaller root of the equation\nD2a2 + 2(2bc - ad)D + d2 = 0.\n4. Smoothly varying diffusion coefficient\nIn the above, we simply imposed a piecewise continuous spatial dependence on the\ndiffusion coefficients in the reaction-diffusion model. This is, of course, a biologically\nunreasonable assumption. In this section, therefore, we consider how a realistic\nspatially varying coefficient could be set up. There are several ways in which this can\nbe done, and here we focus on one possibility.\nThe composite model that we consider is one in which the spatial variation in\ndiffusion coefficients is controlled by a regulatory chemical c. In our model we assume,\nas before, that the diffusion coefficient of u is constant, but we now assume that the\ndiffusion coefficient of v is modulated by c. This could, for example, reflect an increase\nin gap junction permeability for v due to the presence of c (Othmer & Pate, 1980).\nWe consider a mechanism for the production of c, in which c is secreted at one\nend of the domain, diffuses and is degraded throughout the domain, but does not\nPATTERN FORMATION IN REACTION-DIFFUSION MODELS 207\nflow through the other boundary. The appropriate nondimensionalized equation for\nc is\nct = v\n2\nCxx-62c (4.1)\nsubject to the boundary conditions\ncx(0, t) = 0, c(l, t) = c0, (4.2)\nwhere v2 and 02 are, respectively, the nondimensionalized diffusion coefficient and\nthe rate of linear degradation of c.\nIf we assume that this reaction-diffusion equation reaches a stable equilibrium on\na fast timescale during which insignificant changes in morphogen concentration take\nplace, then the equilibrium distribution of c is c0 cosh fo\/cosh <5, where <5 = 0\/v. A\nfurther assumption that the diffusivity of u is independent of the concentration of c,\nwhile that of v is directly proportional to it, implies that the ratio D of diffusion\ncoefficients now takes the form\nD(x) = ac0 cosh fo\/cosh 5,\nwhere a is the constant of proportionality. Our model equations then become\nu, = yf(u, v) + u\nv, = yg(u, v) +\n(4.3)\n(4.4a)\n(4.4b)\nwhere D(x) is given by (4.3). Henceforth we shall refer to D(x) as the diffusion\ncoefficient for v, so that (4.3) represents a smoothly increasing diffusion coefficient\nfor v. As before, we impose zero-flux boundary conditions on u and v.\nAlthough this system cannot be analysed using the method of linear analysis\ndiscussed in Section 2, it can be solved numerically. Figure 5 shows typical solutions\nfor the Schnackenberg reaction kinetics. These simulations suggest that, as in the\nsimple step function diffusion coefficient case, diffusion-driven instability occurs when\neither D(x) exceeds Dcril everywhere in the domain, or D(0) = <xc0\/cosh <5 is less than\nDcrlt and D(l) = ac0 is greater than some critical value D(l)crlt, where £>(l)crit > Dcril\n0.2 0.4 0.6 0.8 1.0\nx\n(a)\n1.0\nFio. 5. (a) and (b): Solutions of (4.1)-(4.4) for Schnackenberg reaction kinetics with parameter values\nA = 0.1 and B •= 0.9. With a = 1, D{x) = c0 cosh <5x\/cosh 6, where 5 and c0 are chosen such that in (a)\nD(0) = 1 and 0(1) = 15 and in (b) D(0) = 6 and D(l) = 15. The values of y are, respectively, 1000 and\n2000 (u: ; v: ).\n208 PHILIP K. MAINI ET AL.\nand depends on D(0), CQ, a, and <5. (Here Dcril is the critical diffusion coefficient that\nD must exceed for pattern generation in the case of spatially homogeneous diffusion\ncoefficients.) Moreover, for appropriate parameter values, the solutions of the model\nequations (4.4) with (4.3) reveal qualitatively similar patterns to those predicted by\nthe simpler model analysed in Section 2. In particular, patterns can be isolated in\nspecific parts of the domain, and where the solution is oscillatory in space, the pattern\ndoes not have a constant amplitude of oscillation. This phenomenon does not depend\ncritically on the steady-state distribution of c; other smoothly varying distributions\nproduce similar results. Our analysis for the simple step function in diffusion\ncoefficient therefore provides a valuable understanding of how spatial inhomogeneities\nin dispersal terms affect pattern generation for a range of more biologically realistic\nsystems.\n5. Biological applications\nWe illustrate the application of the composite model by considering two experimental\nobservations which contradict the predictions of the standard Turing model, namely\nthe AP asymmetry of skeletal elements in the limb and the results of the experiments\non double anterior limbs (Wolpert & Hornbruch, 1990), which show that one can\nproduce more complex skeletal patterns while keeping the domain size constant\nThe results of Sections 2-4 show that reaction-diffusion systems with spatial\nvariation in diffusion coefficients may produce isolated patterns and asymmetric\noscillatory patterns. Moreover, they show that, in the composite model, the position\nand amplitude of peaks in concentration are influenced by the underlying spatial\npattern in control chemical. In limb morphogenesis, therefore, the positional infor-\nmation supplied by the solution profiles could lead, via cell differentiation, to the\nspecification of asymmetrically patterned elements, whose position within the domain\nwould be controlled by the spatial distribution of c. This is in contrast to the standard\nTuring system with spatially uniform parameters, which produces identical and\nequally spaced elements. The patterns produced by (4.1)-(4.4) are therefore more\nconsistent with those observed in certain developmental processes, for example digit\npatterning in the vertebrate limb, than those exhibited by the standard modeL This\nis illustrated in Fig. 6 where, for a suitably chosen parameter set, the composite model\nexhibits a steady-state solution with three peaks in concentration which, in contrast\nto the standard model, have different amplitudes of oscillation. For a suitable choice\nof threshold concentration, our model would therefore specify three skeletal elements\nwhich are intrinsically distinct because of the varying concentrations of morphogen\nto which they are each exposed.\nThe asymmetry in the solution profiles of the composite model is a consequence\nof the spatially inhomogeneous background environment. Clearly, the developing\nchick limb bud is such an environment. At the posterior margin of the developing\nlimb bud, known as the zone of polarizing activity, or ZPA (Saunders & Gasseling,\n1968), there is a group of specialized cells that controls skeletal patterning along the\nAP axis. When a donor ZPA is grafted to different positions along the AP axis of a\nhost chick limb, growth along this axis is stimulated and additional digits are formed\n(Smith & Wolpert, 1981). If we apply our composite model to this duplication\nPATTERN FORMATION IN REACTION-DIFFUSION MODELS 209\n1.0\n~ 0.9\"x\n0.&\no.i-\n0.2 0.4 0.6 0.8 1.0\nx\n(a)\n0.6 1.0\n(b)\n1.6\n1.0-\n0.8-\no.i-\n0.25 0.50 0.75\" 1.00 1.25\nx\n(c)\nFIG. 6. (a) The solution of (4.1H4.4) on the domain [ 0 , 1 ] . (b, c) Solutions on the domain [ 0 , L ]\nwhere L = \\ and }, respectively, with boundary conditions c(0, i) = c(L, t) = c^ In these cases the\ndistribution of chemical concentration in c is mirror symmetric. The corresponding diffusion coefficients\nfor v are, for a = 1, (a) D(x) = c0 cosh fo\/cosh <5, (b) D(x) = c0 cosh 6(x - j)\/cosh J5), and (c) D(x) =\nc0 cosh 5(x — J)\/cosh |5. The values of c0 and i5 are chosen so that, in (a), D(0) = 6 and D(l) = 12; the\nother parameter values are A = 0.1, B = 0.9, and y = 1700. For a fixed threshold concentration ( ),\nthe prepattem in (a) specifies three elements which are intrinsically distinct. With this fixed single threshold\nconcentration, (b) predicts a complete duplication of six elements, two of each kind specified in (a). The\nprepattem in (c), on a smaller domain, specifies only five elements. In both (b) and (c) the distribution\nof the elements is mirror symmetric about x = \\.\nexperiment, and assume that the ZPA is the source of the regulatory chemical, c,\nthen grafting a donor ZPA onto the anterior margin of the limb corresponds to\ncreating a new source of c at x = 0. As this graft stimulates growth, the control\nchemical c satisfies (4.1) with boundary conditions\nc(0, t) = c(0, L) = c0, (5.1)\nwhere L is the new domain length. The distribution of the control chemical, and\nhence the diffusion coefficient of v, is now given by\nD(x) = ac0 cosh 8(x - iL)\/cosh \\bL. (5.2)\n210 PHILIP K. MAINI ET AL.\nFor the case in which the domain increases by 50%, Fig. 6 shows that the system\ncan generate a mirror symmetric pattern which has six concentration peaks of varying\namplitude. Together with the same threshold mechanism as before, the model predicts\nthe formation of a duplicate set of additional digits, which is consistent with\nexperimental results (see Maini & Solursh, 1991, for a review of experimental results).\nOn smaller domains (corresponding to transplanting donor ZPA to a more posterior\nsite) the model predicts the formation of fewer digits (Fig. 6), as is also observed\nexperimentally. Note that the standard Turing model also predicts that additional\ndigits will form if the domain size is increased, but it cannot specify which digits\nare duplicated. In contrast, the composite model exhibits a prepattern in mor-\nphogen concentration which can distinguish between the different types of digit\nformed.\nAnother important property of the composite model is that spatial patterns may\nbe restricted to specific parts of the domain. Figure 7 shows that, for certain parameter\nvalues, solution profiles have a single concentration peak isolated in one-half of the\ndomain. In limb development, our model could therefore predict the formation of a\nsingle skeletal element which is specified asymmetrically along the AP axis. Moreover,\nas the position and number of concentration peaks is influenced by the distribution\nof the regulatory chemical c, spatial patterns specifying two skeletal structures can\nbe produced by imposing symmetric boundary conditions (5.1) for c and keeping\nthe domain fixed in size. In this case, the composite model therefore predicts increases\nin pattern complexity without it being necessary to increase domain size. This is\n£• 0.9\n- ~ \\\n1.1\n1.0\n0.9\n0.8-\no.*\n0.2 0.4 0.6\nx\n(a)\n0.8 1.0 0.2 0.4 0.6\nx\n(b)\n0.6 1.0\nFIG. 7. (a) The solution of the coupled partial differential equation system (4.1)-(4.4) for Schnackenberg\nkinetics with parameter values A = 0.1, B = 0.9, and y = 1040. For simplicity, the constant of propor-\ntionality a is set equal to 1. Thus, the diffusivity function D(x) has the form c0 cosh Sx\/cosh S. Here c0 and\n5 are chosen so that D(0) = 2 and D(l) = 14. (b) Solution of the model equations (4.4) for a prepattern\nin diffusivity which is symmetric about x = $: In this case, the diffusion coefficient D(x) is identical to that\nin (a) in the interval (J, 1]; D(x) is c0 cosh <5(1 — *)\/cosh <5 in [0, i) and c0 cosh 6(1 — x)\/cosh 5 in ( i , 1].\nAll other parameter values are unaltered. For a suitable choice of the threshold concentration ( ) the\nprepattern in (a) may specify a single structure in the interval f j , 1), and the prepattern in (b) may specify\ntwo elements symmetrically placed about x = i. In the two-step model, therefore, one can generate more\ncomplex patterns without changing domain size or parameter values. This is in contrast to the standard\nTuring model wherein patterns are entirely scale dependent.\nPATTERN FORMATION IN REACTION-DIFFUSION MODELS 211\nconsistent with the results of recent experiments (Wolpert & Hornbruch, 1990) which\nshow that double anterior composite limbs give rise to two humeral elements without\nthere being a significant increase in the normal length of the AP axis. Note that in\nthe standard Turing model one would predict, at least for low mode numbers, that\nthe pattern'complexity would remain unchanged for a fixed domain size (Dillon\net al., 1992).\n6. Discussion\nDevelopment of spatial pattern in the early embryo results from the interaction of\nseveral processes in a complex hierarchy of mechanisms. Most models for morpho-\ngenesis to date have, however, focused on a particular mechanism. Although such\nmodels are capable of capturing some aspects of development, they are inconsistent\nwith key experimental observations. In this paper we have analysed a two-step\nhierarchy of patterning mechanisms in which the spatial pattern of a control chemical\nregulates morphogen diffusivity in the overlying reaction-diffusion mechanism. We\nhave shown that such a system can produce isolated asymmetric spatial patterns,\nand that it is capable of producing patterns of increased complexity without a change\nin domain size. These properties are consistent with experimental observations that\ncontradict the standard Turing model.\nIn both our model and the standard Turing model, the polarity of certain solutions\nis determined by the initial conditions. This is, of course, a drawback as most\ndevelopmental processes are robust. Recently, Dillon et al. (1992) have shown that\nimposing the appropriate boundary conditions on a reaction-diffusion system can\nlead to more robust pattern generation. In our framework, this specialized differen-\ntiation of the boundary cells constitutes another level in the developmental hierarchy.\nAcknowledgements\nDLB acknowledges the Wellcome Trust for a Prize Studentship in Mathematical\nBiology. JAS was supported by a Junior Research Fellowship at Merton College,\nOxford.\nThis paper was read at the Sixth IMA Conference on the Mathematical Theory of\nthe Dynamics of Biological Systems, held in Oxford, 1-3 July 1992.\nREFERENCES\nAUCHMUTY, J. F. G., & NICHOLIS, G. 1975 Bifurcation analysis of nonlinear reaction-diffusion\nequations—I. Evolution equations and the steady state solutions. Bull. Math. Biol. 37,\n323-65.\nBARD, J. B. L:, & LAUDER, I. 1974 How well does Turing's theory of morphogenesis work?\nJ. Math. Biol. 45, 503-31.\n2 1 2 PHILIP K. MAINI ET AL.\nBENSON, D. L., SHERRATT, J. A., & MAINI, P. K. 1992 Diffusion driven instability in an\ninhomogeneous domain. Bull. Math. Biol. In press.\nBRUMMER, F., ZEMPEL, G., BUHLE, P., STEIN, J.-C, & HULSER, D. F. 1991 Retinoic acid\nmodulates gap junctional permeability: A comparative study of dye spreading and ionic\ncoupling in cultured cells. Exp. Cell Res. 196, 158-63.\nCASTETS, V., DULOS, E., & DE KEPPER, P. 1990 Experimental evidence of a sustained standing\nTuring-type non-equilibrium chemical pattern. Phys. Rev. Lett. 64, 2953-6.\nDILLON, R., MAINI, P. K., & OTHMER, H. G. 1992 Pattern formation in generalized\nTuring systems. I. Steady-state patterns in systems with mixed boundary conditions.\nSubmitted.\nGIERER, A., & MEINHARDT, H. 1972 A theory of biological pattern formation. Kybernetika 12,\n30-9.\nHERSCHKOWTTZ-KAUFMAN, M. 1975 Bifurcation analysis of nonlinear reaction diffusion\nequations—II. Steady state solutions and comparison with numerical solutions. Bull-\nMath. Biol. 37, 589-636.\nHUNDING, A. 1987 Bifurcations in Turing systems of the second kind may explain blastula\ncleavage plane orientation. J. Math. Biol. 25, 109-21.\nHUNDING, A. 1989 Turing prepatterns of the second kind simulated on supercomputer in\nthree curvilinear coordinates and time. In: Cell to Cell Signalling: From Experiments\nto Theoretical Models (A. Goldbeter, ed.). New York: Academic Press, pp. 229-\n35.\nHUNDING, A., KAUFFMAN, S. A., & GOODWIN, B. C. 1990 Drosophila segmentation: Super-\ncomputer simulation of prepattern hierarchy. J. Theor. Biol. 145, 369-84.\nHUNDING, A., & S0RENSON, P. G. 1988 Size adaptation of Turing prepatterns. J. Math. Biol.\n26, 27-39.\nLACALLI, T. C. 1990 Modeling the Drosophila pair-rule pattern by reaction-diffusion: Gap\ninput and pattern control in a 4-morphogen system. J. Theor. Biol. 144, 171-94.\nMAINI, P. K., & SOLURSH, M. 1991 Cellular mechanisms of pattern formation in the developing\nlimb. Int. Rev. Cytol. 129, 91-133.\nMEINHARDT, H. 1982 Models of Biological Pattern Formation. London: Academic Press.\nMURRAY, J. D. 1989 Mathematical Biology. Heidelberg: Springer.\nNOJI, S., NONHO, T., KOYAMA, E., KOHKI, M., OHYAMA, K.., AOKI, Y., TAMURA, K., OHSUGI,\nK., IDE, H., TANIGUCHI, S., & SAITO, T. 1991 Retinoic acid induces polarizing activity\nbut is unlikely to be a morphogen in the chick limb bud Nature 350, 83-6.\nOTHMER, H. G., & PATE, E. 1980 Scale-invariance in reaction-diffusion models of spatial\npattern formation. Proc. Natl. Acad. Sci. USA 77, 4180-4.\nOUYANG, Q., & SWINNEY, H. L. 1991 Transition from a uniform state to hexagonal striped\nTuring patterns. Nature 352, 610-12\nSAUNDERS, J. W., & GASSEUNG, M. T. 1968 Ectodermal-mesenchymal interactions in the\norigin of limb symmetry. In: Epithelial-Mesenchymal Interactions (P. Fleischmajer & R. E.\nBillingham, eds.). Baltimore, MD: Williams and Wilkins, pp. 78-97.\nSCHNACKENBERG, J. 1979 Simple chemical reaction systems with limit cycle behaviour. J. Theor.\nBiol. 81, 389-400.\nSMITH, J. C, & WOLPERT, L. 1981 Pattern formation along the anteroposterior axis of the\nchick limb: The increase in width following a polarizing graft and the effect of x-irradiation.\nJ. Embryol. Exp. Morph. 63, 127-44.\nTHALLER, C, & EICHELE, G. 1987 Identification and spatial distribution of retinoids in the\ndeveloping chick limb. Nature 327, 625-8.\nTURING, A. M. 1952 The chemical basis of morphogenesis. Phil. Trans. R. Soc. Lond. B 237,\n37-72\nWALBOT, V., & HOLDER, N. 1987 Developmental Biology. New York: Random House.\nWANEK, N., GARDINER, D. M., MUNEOKA, K., & BRYANT, S. V. 1991 Conversion by retinoic\nacid of anterior cells into ZPA cells in the chick wing bud. Nature 350, 81-3.\nWOLPERT, L. 1969 Positional information and the spatial pattern of cellular differentiation.\n\/. Theor. Biol. 25,\nPATTERN FORMATION IN REACTION-DIFFUSION MODELS 213\nWOLPERT, L. 1981 Positional information and spatial patterning. Phil. Trans. R. Soc. Land.\nB 259, 441-50.\nWOLPERT, L., & HORNBRUCH, A. 1990 Double anterior chick limb buds and models for\ncartilage rudiment specification. Development 109, 961-6.\n\n"}