{"doi":"10.1080\/0968776940020206","coreId":"14369","oai":"oai:generic.eprints.org:161\/core5","identifiers":["oai:generic.eprints.org:161\/core5","10.1080\/0968776940020206"],"title":"Visualization of database structures for information retrieval","authors":["Pejtersen, Annelise","Jensen, Grete","Jensen, Henrik","Weber, Steen"],"enrichments":{"references":[{"id":201648,"title":"(eds),","authors":[],"date":"1989","doi":null,"raw":"Borgman, C.L., Chignel, M. and Valdez, F. (1989) (eds), Proceedings of the 52nd Annual Meeting of the American Society for Information Science (Washington, DC), 26, 81-95.","cites":null},{"id":1043442,"title":"A library system for information retrieval based on a cognitive task analysis and supported by an icon based interface'","authors":[],"date":"1989","doi":"10.1145\/75335.75340","raw":"Pejtersen, A.M. (1989), 'A library system for information retrieval based on a cognitive task analysis and supported by an icon based interface' ACM, SIGIR Conference Proceedings, Boston, USA.","cites":null},{"id":456553,"title":"A retrieval aid for browsing strategies in bibliographic databases based on users' associative semantics: a term","authors":[],"date":"1987","doi":null,"raw":"Pejtersen, A.M., Olsen, Sv. E. and Zunde, P. (1987), 'A retrieval aid for browsing strategies in bibliographic databases based on users' associative semantics: a term 66ALTJ VOLUME 2 NUMBER 2 association thesaurus', in Wormell, I. (ed.), Knowledge Engineering: Expert Systems and Information Retrieval. London, Taylor Graham.","cites":null},{"id":1043434,"title":"Change management for school library services'","authors":[],"date":"1992","doi":"10.1108\/01435129210013305","raw":"Kinnel, M. (1992), 'Change management for school library services' Library Management, 13 3, 10-19.","cites":null},{"id":201652,"title":"Children's Selection of Books, Børnebiblioteket Sundbyvester,","authors":[],"date":"1992","doi":null,"raw":null,"cites":null},{"id":456555,"title":"Cognitive Engineering and Information Processing,","authors":[],"date":"1986","doi":null,"raw":"Rasmussen (1986), Cognitive Engineering and Information Processing, Amsterdam, North Holland.","cites":null},{"id":201646,"title":"Combining Libraries: The Canadian and Australian Experience,","authors":[],"date":"1987","doi":null,"raw":"Amy, L. J. (ed.) (1987), Combining Libraries: The Canadian and Australian Experience, Dalhousie University, Canada, School of Library and Information Studies.","cites":null},{"id":201649,"title":"Conceptual Change in Childhood,","authors":[],"date":"1985","doi":null,"raw":"Carey (1985), Conceptual Change in Childhood, Cambridge, MA, USA, MIT Press.","cites":null},{"id":1043439,"title":"Design and test of a database for fiction based on an analysis of children's search behaviour', in","authors":[],"date":"1986","doi":null,"raw":"Pejtersen, A.M. (1986a), 'Design and test of a database for fiction based on an analysis of children's search behaviour', in Ingwersen, P., Kajberg, L., and Pejtersen, A.M. (eds), Information Technology and Information Use. Towards a Unified View of Information and Information Technology, London, Taylor Graham, 125-47.","cites":null},{"id":1043437,"title":"Design of a classification scheme for fiction based on an analysis of actual user-librarian communication, and use of the scheme for control of librarians' search strategies',","authors":[],"date":"1980","doi":null,"raw":"Pejtersen, A.M. (1980), 'Design of a classification scheme for fiction based on an analysis of actual user-librarian communication, and use of the scheme for control of librarians' search strategies', Harbo, O. and Kajberg, L., Theory and Application of Information Research, London, Mansell.","cites":null},{"id":1043438,"title":"Design of a computer-aided user-system dialog based on an analysis of users' search behavior',","authors":[],"date":"1984","doi":"10.1016\/0143-6236(84)90074-7","raw":"Pejtersen, A.M. (1984), 'Design of a computer-aided user-system dialog based on an analysis of users' search behavior', Social Science Information Studies, 4, 167-83.","cites":null},{"id":201647,"title":"Designing an information retrieval interface based on children's categorization of knowledge',","authors":[],"date":"1991","doi":null,"raw":"Borgman, C.L. (1991), 'Designing an information retrieval interface based on children's categorization of knowledge', Proceedings of the 11th International Online Information Conference, London, 1992.","cites":null},{"id":201650,"title":"Evaluating the impact of an on-line public library catalogue on subject searching behavior at the catalog and at the shelves',","authors":[],"date":"1989","doi":"10.1108\/eb026863","raw":"Hancock-Beaulieu, M. (1989), 'Evaluating the impact of an on-line public library catalogue on subject searching behavior at the catalog and at the shelves', Journal of Documentation, 46, 4.","cites":null},{"id":1043436,"title":"Experiences with on-line catalogues in the USA using a classification system as a subject searching tool', Tools for Knowledge Organization and the Human Interface.","authors":[],"date":"1990","doi":null,"raw":"Markey, K. (1990), 'Experiences with on-line catalogues in the USA using a classification system as a subject searching tool', Tools for Knowledge Organization and the Human Interface.","cites":null},{"id":456552,"title":"Fiction retrieval: experimental design and evaluation of a search system based on users' value criteria'","authors":[],"date":"1984","doi":"10.1108\/eb026755","raw":"Pejtersen, A.M., and Austin, J. (1984), 'Fiction retrieval: experimental design and evaluation of a search system based on users' value criteria' (Parts 1 and 2), Journal of Documentation, 39, 4, 230-246 and 40, 1, 25-35.","cites":null},{"id":1043435,"title":"How to Find Books in the Library, Stockholms Stadsbibliotek.","authors":[],"date":"1993","doi":null,"raw":"Lundgren, L. (1993), How to Find Books in the Library, Stockholms Stadsbibliotek.","cites":null},{"id":1043440,"title":"Implications of users' value perception for the design of a bibliographic retrieval system',","authors":[],"date":"1986","doi":"10.1007\/978-1-4613-2521-5_4","raw":"Pejtersen, A.M. (1986b), 'Implications of users' value perception for the design of a bibliographic retrieval system', in Agrawal, J.C. and Zunde, P. (eds), Empirical Foundation of Information and Software Science, New York and London, Plenum Press.","cites":null},{"id":201651,"title":"Intelligent Interfaces and Retrieval Methods for Subject Searching in Bibliographic Retrieval Systems,","authors":[],"date":"1991","doi":null,"raw":"Hildreth, C.R. (1991), Intelligent Interfaces and Retrieval Methods for Subject Searching in Bibliographic Retrieval Systems, Washington, DC, USA, K.G. Saur.","cites":null},{"id":1043443,"title":"Interfaces based on Associative Semantics for Browsing","authors":[],"date":"1990","doi":null,"raw":"Pejtersen, A.M. (1990), Interfaces based on Associative Semantics for Browsing in Information Retrieval, RIS0 National Laboratory, Denmark, RIS0 M-2794.","cites":null},{"id":456556,"title":"Learning in Information Society, report from the NORDINFO conference on the design and use of information-retrieval systems in primary schools and libraries.","authors":[],"date":"1988","doi":null,"raw":"Sandvik, A. (1988), Learning in Information Society, report from the NORDINFO conference on the design and use of information-retrieval systems in primary schools and libraries.","cites":null},{"id":456550,"title":"New model for multimedia interfaces to online public access catalogues',","authors":[],"date":"1992","doi":"10.1108\/eb045194","raw":"Pejtersen, A.M. (1992a), 'New model for multimedia interfaces to online public access catalogues', The Electronic Library, 10, 6.","cites":null},{"id":456559,"title":"Okapi at City: an Evaluation Facility for Interactive IR, London,","authors":[],"date":"1991","doi":null,"raw":"Walker, P. and Hancock- Beaulieu, M. (1991), Okapi at City: an Evaluation Facility for Interactive IR, London, British Library Research Report 6056.","cites":null},{"id":1043441,"title":"Search strategies and data base design' in","authors":[],"date":"1988","doi":null,"raw":"Pejtersen, A.M. (1988), 'Search strategies and data base design' in Goodstein, L.P., Andersen, H.B. and Olsen, S.E. (eds), Tasks, Errors and Models, London, Taylor and Francis.","cites":null},{"id":201655,"title":"Semantic and Conceptual Development: An Ontological Perspective,","authors":[],"date":"1979","doi":"10.2307\/414115","raw":"Keil (1979), Semantic and Conceptual Development: An Ontological Perspective, Cambridge MA, USA, Harvard University Press.","cites":null},{"id":456558,"title":"Sneaky Teaching.","authors":[],"date":"1988","doi":null,"raw":"Valentine, P. and Nelson, B. (1988), Sneaky Teaching. The Role of the School Librarian, London, British Library (LIRR 63).","cites":null},{"id":201653,"title":"Søg og du skalfinde (Search and Find. A program for teaching fiction in schools),","authors":[],"date":"1992","doi":null,"raw":"Jensen, G.L. and Acker, B. (1992a), Søg og du skalfinde (Search and Find. A program for teaching fiction in schools), Bom og Beger, no. 7, pp. 21-4.","cites":null},{"id":456551,"title":"The Book House. An icon based database system for fiction retrieval in public libraries'","authors":[],"date":"1992","doi":null,"raw":"Pejtersen, A.M. (1992b), 'The Book House. An icon based database system for fiction retrieval in public libraries' in Cronin, B. (ed.), The Marketing of Library Information Services, 2, London, ASLIB, 572-91.","cites":null},{"id":456557,"title":"The child as naive user: a study of database use with young children',","authors":[],"date":"1990","doi":"10.1016\/s0020-7373(05)80103-8","raw":"Spavold, J. (1990), 'The child as naive user: a study of database use with young children', International Journal of Man-Machine Studies, 32, 603-25.","cites":null},{"id":456554,"title":"The Growth of Logical Thinking: From Childhood to Adolescence,","authors":[],"date":"1958","doi":"10.1037\/10034-000","raw":"Piaget, J. (1958), The Growth of Logical Thinking: From Childhood to Adolescence, New York, Basic Books.","cites":null},{"id":201654,"title":"Visualization of database structures","authors":[],"date":"1992","doi":null,"raw":"65Annelise Mark Pejtersen et al. Visualization of database structures Jensen, G.L. and Acker, B. (1992c), The Book House in the School Library, Skolebiblioteket, No. 7, pp. 16-20.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1994","abstract":"This paper describes the Book House system, which is designed to support children's information retrieval in libraries as part of their education. It is a shareware program available on CD‐ROM or floppy disks, and comprises functionality for database searching as well as for classifying and storing book information in the database. The system concept is based on an understanding of children's domain structures and their capabilities for categorization of information needs in connection with their activities in schools, in school libraries or in public libraries. These structures are visualized in the interface by using metaphors and multimedia technology. Through the use of text, images and animation, the Book House encourages children ‐ even at a very early age ‐ to learn by doing in an enjoyable way, which plays on their previous experiences with computer games. Both words and pictures can be used for searching; this makes the system suitable for all age groups. Even children who have not yet learned to read properly can, by selecting pictures, search for and find those books they would like to have read aloud. Thus, at the very beginning of their school life, they can learn to search for books on their own. For the library community, such a system will provide an extended service which will increase the number of children's own searches and also improve the relevance, quality and utilization of the book collections in the libraries. A market research report on the need for an annual indexing service for books in the Book House format is in preparation by the Danish Library Centre A\/S","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14369.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/161\/1\/ALT_J_Vol2_No2_1994_Visualization%20of%20database%20stru.pdf","pdfHashValue":"8675e087dd04ae870c3db1df9866b2a5e68fcd50","publisher":"Universit of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:161<\/identifier><datestamp>\n      2011-04-04T09:26:35Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/161\/<\/dc:relation><dc:title>\n        Visualization of database structures for information retrieval<\/dc:title><dc:creator>\n        Pejtersen, Annelise<\/dc:creator><dc:creator>\n        Jensen, Grete<\/dc:creator><dc:creator>\n        Jensen, Henrik<\/dc:creator><dc:creator>\n        Weber, Steen<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        This paper describes the Book House system, which is designed to support children's information retrieval in libraries as part of their education. It is a shareware program available on CD‐ROM or floppy disks, and comprises functionality for database searching as well as for classifying and storing book information in the database. The system concept is based on an understanding of children's domain structures and their capabilities for categorization of information needs in connection with their activities in schools, in school libraries or in public libraries. These structures are visualized in the interface by using metaphors and multimedia technology. Through the use of text, images and animation, the Book House encourages children ‐ even at a very early age ‐ to learn by doing in an enjoyable way, which plays on their previous experiences with computer games. Both words and pictures can be used for searching; this makes the system suitable for all age groups. Even children who have not yet learned to read properly can, by selecting pictures, search for and find those books they would like to have read aloud. Thus, at the very beginning of their school life, they can learn to search for books on their own. For the library community, such a system will provide an extended service which will increase the number of children's own searches and also improve the relevance, quality and utilization of the book collections in the libraries. A market research report on the need for an annual indexing service for books in the Book House format is in preparation by the Danish Library Centre A\/S.<\/dc:description><dc:publisher>\n        Universit of Wales Press<\/dc:publisher><dc:date>\n        1994<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/161\/1\/ALT_J_Vol2_No2_1994_Visualization%20of%20database%20stru.pdf<\/dc:identifier><dc:identifier>\n          Pejtersen, Annelise and Jensen, Grete and Jensen, Henrik and Weber, Steen  (1994) Visualization of database structures for information retrieval.  Association for Learning Technology Journal, 2 (2).  pp. 50-67.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776940020206<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/161\/","10.1080\/0968776940020206"],"year":1994,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Visualization of database structures for\ninformation retrieval\nAnnelise Mark Pejtersen, Grete Lisbjerg Jensen,\nHenrik Jensen and Steen Weber\nRIS0 National Laboratory, Roskilde, Denmark\nAbstract\nThis paper describes the Book House system, which is designed to support children's\ninformation retrieval in libraries as part of their education. It is a shareware program\navailable on CD-ROM or floppy disks, and comprises functionality for database searching\nas well as for classifying and storing book information in the database. The system concept is\nbased on an understanding of children's domain structures and their capabilities for\ncategorization of information needs in connection with their activities in schools, in school\nlibraries or in public libraries. These structures are visualized in the interface by using\nmetaphors and multimedia technology. Through the use of text, images and animation, the\nBook House encourages children - even at a very early age - to learn by doing in an\nenjoyable way, which plays on their previous experiences with computer games. Both words\nand pictures can be used for searching; this makes the system suitable for all age groups.\nEven children who have not yet learned to read properly can, by selecting pictures, search for\nand find those books they would like to have read aloud. Thus, at the very beginning of their\nschool life, they can learn to search for books on their own. For the library community, such\na system will provide an extended service which will increase the number of children's own\nsearches and also improve the relevance, quality and utilization of the book collections in the\nlibraries. A market research report on the need for an annual indexing service for books in\nthe Book House format is in preparation by the Danish Library Centre A\/S.\n1. Introduction\nIt is generally agreed that current information retrieval systems in both public and school\nlibraries present major problems for child users. These difficulties are particularly\nperplexing today when information-retrieval skills play a major role both in education\nand, increasingly, in society as a whole. One of the barriers against providing children\nwith information retrieval skills is the lack of programs for casual and novice users; other\nbarriers exist between public libraries, school libraries and education in schools. The\npurpose of this paper is to describe how a new library system - the Book House - based\n50\nALT J VOLUME 2 NUMBER 2\non a perspective of end users' needs, can provide a major contribution to improving\neducation as well as the utilization of libraries in schools. In this area, many institutional\nborders and professional barriers have given rise to artificial distinctions among what in\nreality are related disciplines - public libraries, school libraries and education in schools,\nthough from an organizational viewpoint, these distinctions are already disappearing. In\nmany countries, no physical distinction can be found between public libraries, school\nlibraries and schools. Public libraries can be placed in schools and school libraries can be\nlocated in public libraries as well as in schools (Amy, 1987; Sandvik, 1988; Valentine and\nNelson, 1988). Currently, in most European countries, widespread co-operation exists\nbetween school libraries and public-library work, and in services for the preparation,\ndistribution and circulation of library materials (Kinnell, 1992). Yet from the viewpoint\nof computerized library systems, a distinction is usually made between system concepts\nfor\n(a) public libraries, the so-called Online Public Access Catalogues;\n(b) school library systems, which are usually quite close to public-library system\nconcepts;\n(c) computer programs used for training students in computer literacy; and\n(d) teaching material for education in the use of libraries.\nFrom the users' point of view, no such distinctions between institutions and systems can\nbe justified, inasmuch as their information needs are motivated from their tasks which, to\nbe solved properly, often require information retrieval across institutional barriers, rigid\nsubject domains and school disciplines. Interviews with children in libraries have shown\nthat their sources and motivations for information retrieval are a mixture of needs and\nideas coming from schools, leisure activities, school libraries, public libraries and mass\nmedia; the expected outcome from the use of material from a search is connected to an\noverlapping mixture of tasks, such as solving school problems, gaining new knowledge\nand satisfying needs for various reading experiences (Pejtersen, 1986 a and b). Hence, the\nBook House system described in this paper is conceived from an understanding of the\nusers' task-oriented perspective, their information needs and queries, and the levels of\nskill needed in information retrieval and computer use. There turns out to be a great\ncommonalty in children's information-retrieval behaviour and skills across school and\nlibrary institutions, which has been taken into account in the design. As a consequence,\nthe Book House system has proven to be efficient as a tool for both education and\nsupport of information-retrieval tasks in all the above mentioned contexts of public\nlibraries, school libraries and classroom work. The system encourages an integrated and\ninterrelated approach.\n2. School library use in education\nDue to the many developments and innovations in teaching methods, the tasks to be\nperformed by the school library, and expectations about its support of pedagogical\nactivities, have gained considerable attention. Project-related teaching, and work in\ngroups around shifting specific themes and subjects, have forced students to change their\nway of working, and the school library has had to do likewise in order to support this\nchange. Projects and theme work are often cross-disciplinary in their subject matter, and\ninvolve several school subjects. In the higher grades and levels, themes are sometimes\n51\nAnnelise Mark Pejtersen et al Visualization of database structures\nchosen by the pupils themselves. Thus information retrieval has become a necessary work\nactivity for students as part of this expanded project and theme work. They must learn to\nuse the school library in the classroom, and gain easy and efficient access to up-to-date\ninformation. In many countries, school libraries have become the central place for pupils'\ninformation-seeking tasks. In keeping with the times, the school library must be able to\nprovide students their own easy access to electronic information-retrieval (IR) systems\nwith comprehensive database coverage. Current emphasis on key phrases, such as self-\naction, teach and use and learn by doing, reflect the approach under development in all\nmodern pedagogical activities having to do with school libraries. Yet despite the\nwidespread introduction of computers in modern education programmes, school libraries\nhave until now lacked a tool which could be used by the students themselves.\n3. Teaching computer use and skills\nRecently, it has become mandatory in many European schools to integrate education in\ncomputing into the curriculum of the different disciplines taught. A shift in emphasis has\ntaken place from teaching computing as a single isolated domain towards teaching how\ncomputers can be used to support problem-solving in different kinds of tasks and settings.\nSeveral implications arise from this shift:\n(a) Integration of teaching the use of computers into traditional subjects, such as reading\nand learning about the mother tongue, social and natural sciences, etc., leads to their\nuse as a natural tool for problem-solving activities related to learning the subject\ncontent of a domain.\n(b) Teaching computing to provide knowledge about the application of computers in\nspecific task-functions and in actual work-domains implies exceeding borderlines\nbetween the subjects taught in the classroom context and actual work places outside\nthe school.\nPrograms are therefore needed which can serve both as the student's own learning tool\nfor solving problems, writing papers and exercises, as well as a professional support\nvehicle in a work-domain familiar to students or closely related to children's' work in the\nclassroom.\n4. Children's problems with catalogues\nSeveral problems are encountered by children in connection with their comprehension\nand full exploitation of a computer system for retrieving information. Such systems were\noriginally developed to meet librarians' needs for keeping records of their book-stock by\nproviding computerized access to automated card catalogues. Today, they are used as a\ncollection of access tools supporting the complete range of disciplines relevant to a\nlibrary, as well as self-service information-seeking support tools for untrained and\ninexperienced casual library users. Despite continuing re-designs, including the\nincorporation of online user-assistance in the form of menus, help displays, informative\nerror messages and browsing facilities, etc., it is generally agreed that there still exist\nmajor problems for users who are not experts in a field or experienced searchers, or are\nnot generally familiar with how libraries work (Hancock-Beaulieu, 1989; Hildreth, 1989;\nMarkey, 1990, Pejtersen, 1992 a and b).\n52\nALT J VOLUME 2 NUMBER 2\nThese problems are mainly related to the large number of mapping processes required of\nthe user during the search process in order to convert and translate his\/her knowledge\nstructures and language in accordance with the constraints imposed by the search\nlanguage and classification schemes used both to classify and to retrieve information in\nIR systems. The only stable structure typically available in IR systems to guide users is\nthe hierarchical structure of a thesaurus and\/or classification scheme, which will give most\nyoungsters problems. Search languages require advanced verbal skills, and classification\nschemes require advanced categorizing skills and\/or domain knowledge obtainable only\nthrough exhaustive training. The use of IR systems requires capabilities for making\nappropriate deductions and inferences about the hierarchical category memberships of\nthe user's own need, as well as formulating and modifying systematic combinatorial\nsearches in generic terms. Although some work indicates that, at the age of four,\nchildren's language capability includes some categorical structures (Borgman et ah, 1989),\nand that, at an early age, they do have some ability to process hierarchically structured\ninformation (Keil, 1979), they do not possess skills for making hypotheses and\npredictions in order to plan a search successfully in conventional information systems.\nPiaget's work (Piaget, 1958) suggests that children's capabilities for structural thinking\nand abstract reasoning can be divided into several developmental stages. Three of these\nhave been of relevance in the design context of the Book House for young users from age\nsix to sixteen:\n(a) the intuitive perceptually based stage at which children from four to seven think in\nterms of analogues, and rely on sometimes systematic trial-and-error approaches;\n(b) the concrete operational stage at which children from seven to eleven possess an\nunderstanding of logical relations and can experiment in a systematic way with some\nof the operational structures needed for classification; and\n(c) the operational stage at which children from eleven to fifteen can think in terms of\nabstract relations and classes, and make exhaustive hypotheses and deductions\ncompletely independently of perceptually based intuitions.\nIndependent of discussions of specific details of Piaget's work (Boden, 1980; Carey, 1985),\nit is obvious that the capability for making appropriate deductive inferences based on\ncategory membership, the understanding of formal logic structures and the use of well-\ndefined categories will not be available skills in young children to the extent needed in\norder to operate within a comprehensive, formal library-classification scheme with its\nassociated artificial and standardized retrieval language. Even for older children who\nhave well-developed abilities for making deductive inferences from hierarchical library\nschemes, operational use of these schemes will require domain knowledge beyond their\nmental capacity.\nIn short, online catalogues require different types of knowledge and skills that children do\nnot yet possess, in spite of their growing experience with personal computers, and\nfamiliarity with other modern media - all of which have contributed to their motivation\nfor using a compatible form for computerized IR. As a result, usable IR systems must not\nonly be competitive with existing, familiar computer programs and systems accepted by\nchildren, but must also minimize the need for excessively demanding mental juggling\namong incompatible languages and categories.\n53\nAnnelise Mark Pejtersen et al Visualization of database structures\n5. Mapping database structures to children's categorization skills\nGiven these user-characteristics, many conversion and mapping problems can be avoided\nby using a classification scheme and a database structure which are compatible with\nchildren's ways of categorizing information. As opposed to hierarchical library\nclassification models, which are too cognitively demanding to be learned and understood\nwell enough by children, such a system will make it possible to make database structures\nand representations of book content correspond directly to children's intuitive ways of\ncategorizing their needs. An analysis of 200 protocols reflecting children's search\nbehaviour and ways of categorizing the domain of books which were recorded in ten\ndifferent types of libraries revealed structures and other aspects different from traditional\nlibrary classification schemes (Pejtersen, 1986 a and b, 1992 a and b). These were used as\nthe basis for the classification scheme and database structure, mentioned in paragraph 7.6\nbelow, in the Book House system.\nSince a great variety of cognitive skills in the categorization of information is likely to be\nfound among children, the Book House system was designed to:\n(a) match children's different developmental stages and problem-solving skills by\nsupporting both young children's trial-and-error and intuitive perception-based\nsearches, and older children's more or less systematic use of abstract relations and\nclasses, in searching in a stable database structure compatible with their ways of\ncategorizing information (this also guides children's learning of domain knowledge);\n(b) extend their categorization skills by several different interface representations of the\nclassification structure used in the database - each placing different requirements on\nusers' intellectual skills and domain knowledge. Each representation needs an\ninterface content of classification categories and book description that is\nunderstandable by children at varying levels of perceptual and cognitive skills and\ntraining and, in addition, an interface form that is familiar enough to children to\nspeed up their learning to search in abstract classification categories across the above-\nmentioned developmental stages.\nIn section 7.3 to 7.6 below, four different interface representations of the same database\ncontent are shown, ranging from a graphical display of the complete classification\nstructure to displays of a structured textual description and unstructured displays of icons.\n6. Visualization of database with icons and metaphors\nThe degree of difficulty involved in problem-solving activities will not only depend on\nsufficiently well-developed innate structures needed for operational thinking in Piaget's\nterms, but also on the characteristics of the task, its requirements to precision, degree of\ndetail and, of course, on the user's familiarity with the task situation. It is well known that\neveryday thinking is more likely to rely on analogies with past examples and rules of\nthumb than on logical abstract reasoning within clear and well-formulated categories\n(Rasmussen, 1986). This implies that interface displays should take advantage of these\nabilities by using icons or pictures with reference to familiar, preferably, concrete objects,\nwhich tap familiar situations and prompt common-sense reasoning.\nFirst, icons used as metaphors can enable the user to transfer intuition and skill from a\nfamiliar situation in another context to the functionality of the IR system. In order fully\n54\nALTJ VOLUME 2 NUMBER 2\nto support users' ability to make analogies to familiar objects and events, icons should\nrepresent both the database system, the system's retrieval functionality including options\nfor user actions, and the database content. Usually, the interface menus of IR systems do\nnot reveal much of the basic semantic structure of the database content Even if they do,\nusers will often still be in trouble since the structure used for organizing the semantics of\nthe database content will most likely not match their own way of structuring the concepts\nused to reflect their reading need. Genuine support is best given by providing a\nvisualization of the structure imposed on the database content through several types of\nicon reflecting the categories and principles actually used intuitively by children. The\nBook House interface is tailored to children's abilities to categorize and understand\nconcepts, as determined from their associative responses to pictures and words in a\ncontrolled, multiple-choice association test (Pejtersen, 1990).\nSecondly, it is well known that pictures are easier and faster to learn than text. They can\nalso be perceived independently of the users' language capabilities. They are faster to\n'read' than text since one icon can communicate very complex messages that would take\nmuch language to explain - a picture can say much more than a thousand words. Pictures\ncan thus efficiently express subject information and conceptual relationships. They are\neasier to remember and to recognize once learned, which is advantageous since\nrecognition of information is easier than recall of information. Visually, we can process a\nfar larger amount of information than in any other form. We can, for instance, recognize\na well-known face in a crowd, while we might have problems in recalling and verbally\ndescribing this face. In the same way, it is easier to use a map of a town than process a\nverbal instruction.\n7. Book House Search: database retrieval\nThere are two entries into the Book House system: Book House Search for searching\ninformation from the database, and Book House Write for indexing and storing new\ninformation in the database.\nBook House Search supports several repetitive decision tasks: formulation of a user's\nproblem and need, choice of search strategy, execution of search, evaluation of relevance\nof retrieved books compared with user-need, revision of search, etc. The Book House\nassists children's accomplishment of retrieval and indexing tasks without assistance from\nadults. Several types of help are available, as well as facilities for experimenting and\ngenerally playing around with the system in a trial-and-error mode.\n7.1 Book House metaphor\nAs they learn, children are likely to try to build a mental model of their problem-space and\nits representation in the database system in order to understand and predict the content and\nfunctionality of the system. Spavold (Spavold, 1990) found that children would\nspontaneously make images of databases during their use in the classroom. Our evaluation\nstudies offer ample evidence that the choice of a Book House metaphor enables children to\nmake easy analogies between their everyday life experiences and corresponding objects and\ntools in a house, and their functionality (Goodstein and Pejtersen, 1989). Even very young\nchildren have been able to use the system and achieve successful results.\nWhen the user explores the screen with the mouse, a text line at the bottom follows the\n55\nAnnelise Mark Pejtersen et ah Visualization of database structures\nFigure 1\nmouse movements and gives two kinds of messages. If the mouse is not in an area with\nselectable objects, the text 'Move the mouse and see what you can do' appears. When the\nmouse points at a selectable object, a square is drawn around the icon to evoke the user's\nattention and to indicate the mouse-sensitive limits of the object. A message appears\ntelling the user to press the mouse button, with information on what will happen next.\nThese help texts support interactive, self-activated 'learning by doing' during the user's\nexploration of information on the screen. They also support first-time users in\nunderstandmg the meaning of each icon: prototype testing with users has shown that not\nall children will be able to interpret the meaning of icons and predict a unique retrieval\naction associated with a particular icon.\n7.2 A room for database choice\nFigure 2\n56\nALTJ VOLUME 2 NUMBER 2\nThe Book House system contains a database with children's fiction, a database with\nchildren's non-fiction, and a database that combines fiction and non-fiction.\n7.3 A room for choice of search strategy\nFigure 3\nThe four strategies are (Figure 3, from the left):\n(a) the associate search by analogy based on prototypes for books similar to the book the\nuser has in mind;\n(b) the intuitive strategy of browsing through icons for recognizing a perhaps unidentified\nneed by means of pictures on a 'flip-over' projector;\n(c) the analytical subject search strategy represented as objects on a work table; and\n(d) browsing shelves, which give access to a browsing through the book stock strategy as a\nmeans for getting inspiration on what to read.\n7.4 Find books similar to a known book\nWhen a search by analogy is chosen from the left side of the strategy room, a model book\nFigure 4\n57\nAnnelise Mark Pejtersen et al. Visualization of database structures\nis displayed with two options on the front cover: Author and Title. Based on the user's\nspecification of his\/her model book, the system uses the corresponding model-book\ndescription on the screen as the basis for finding other similar books in the database by\nmeans of probabilistic techniques.\n7.5 Browse album with Picture Association Thesaurus\nFigures\nChildren often use pictures on the front cover in their searches, as well as in their\nassessment of the relevance and value of content of books. In a significant extension of\nthis, users can browse and search for books in the Picture Association Thesaurus by\nselecting among icons symbolizing the subject content of books. When searching via an\nicon, book meanings normally mediated by many keywords become available. Such a\npictorial representation produces only associatively related concepts displayed at levels\ncorresponding to a broad range of more or less well-defined categorization skills. No\nverbal skills are needed to search by selection of an icon with a mouse.\n7.6 A room with work table for classification subject search\nFigure 6\n58\nALTJ VOLUME 2 NUMBER 2\nRequiring knowledge about the names of fields in database records when formulating a\nprecise search query can be avoided by making the structure of the database visible using\nappropriate icons (Figure 6).\nThe poster on the wall gives access to subject-matter keywords: books about family life,\nquarrels, anorexia nervosa, happiness, etc. The world globe on the table and the clock on\nthe wall give access to keywords on time and geographical places such as books about\nteenagers' life in Los Angeles in the nineties. The view out of the window gives access to\nkeywords about the environment, social and professional settings, for example books\nabout sport among Jewish children living in busy families in big cities. The masks on the\nwall give access to keywords related to emotional experiences, such as curiosity or\nexcitement, evoked in the reader during the reading process. The icon showing the author\nsitting with his typewriter gives access to keywords concerning the author's intention to\nput forward ideas and\/or opinions. The glasses on the table give access to keywords on\nthe accessibility of books, their readability, language level, the age for being read aloud or\nread by the child him\/herself, the size of the typography, etc. The card-catalogue drawers\ngive access to keywords on traditional genres such as war stories or suspense stories.\n7.7 Browse through book descriptions\nFIND SUBJECT; SEEBOOKDESCRI\nPLACE\nSETTING\nTIME\nINFORMATION\nEXPERIENCE\nGENRE\nREADABILITY\nEDITION\nIngemarm, B.S.\nErik Menveds\nThe murder of king Erik\nThe nobleman\nbeing murdered by\nchildhood 231 pages.\n dipping a Finderup Lade.\nPet a Hcsselaad his allegiance to the king, who is\nrebellious noblemen lead by MarskStig.\nUpper cliss. Kings\n1288-**.\nA description of\nExiting.\nNovel Biography.\nDifficult to read.\n1982. SeriiL\ncourt.\na! egiance and patriotism.\nHistorical novel.\nNormal.\nAd It boot\nnoblemen\nFigure 7\nWhen the icon browsing through book shelves is chosen in the right side of the strategy\nroom, the system pops up with randomly chosen book descriptions and information on\nbook content. Each time this strategy is activated, a new set of book descriptions is used\n(see book description immediately below in 7.8).\n7.8 Open book with book description\nBook descriptions are structures according to the classification system to enable the user\nto see the correspondence between his\/her selected category of terms and the contents of\neach book. The user can then browse and turn pages one after the other in both directions\nby clicking on the lower red corners of the book showing one arrow. The user can modify\n59\nAnnelise Mark Pejtersen et at Visualization of database structures\nthe current need by adding search terms through a selection of red keywords from the\nbook description, or removing terms with the eraser icon. When selected with the mouse,\nthey are automatically combined with Boolean operators. The book case shows the\nnumber of retrieved books.\n7.9 Search example\nA realistic search query culled from our user studies illustrates a typical use of the system.\nA child of twelve needs to find books for her Natural Science class; she wants to choose a\ntopic for group work on 'pollution'. She wants to find 'an exciting book with a blue cover\nand with a moon and whales on the front cover*. She does not remember the title or the\nauthor's name, since the source of information about the book is a friend from another\nclass who showed it to her. Her motivation for looking for this particular item is the\nrecommendation by her friend, who had been told by her teacher to read this book on\npollution for a mother-tongue lesson.\nShe selects the door action icon and enters the Book House. She selects the room in the\nmiddle to search in the database with fiction and non-fiction for children. Having a fairly\ngood idea about the characteristics of the desired book, she chooses the work table with\nclassification access. First, she selects the masks on the wall to search for exciting books,\nthen the book on the table to search for colours and pictures on the front cover. She looks\nat the result of the search shown as book descriptions. Having checked the emotional\nexperience 'exciting' to be gamed by reading the books and the cover designs 'blue, moon\nand whales', she realizes that the subject is on 'whales at the point of extinction due to\npollution of the sea'. She decides to take a print-out and uses the printer icon. She\ncontinues to browse retrieved books and uses the book in hand icon to put aside\ninteresting candidates to be printed at the end of the search.\n8. Book House Write: classification and editing the database\nNew books can be added to the database and existing books can be edited. A typical task\nof storing information about a book will involve indexing, i.e. the analysis and\nrepresentation of the book to be searched for and displayed in the Book House Search\nsystem. This activity includes: check whether the book is already in the database; if not,\nselect a card to fill in a book description; skim the book, possible reviews and other\nmaterial; formulate a new description using standard categories; save the book\ndescription in the database, which is then updated.\n8.1 Blank card for a new book\nWhen adding new descriptions to the database, the blue New Book card catalogue is\nchosen, with blank cards and labels for empty categories ready to be filled in. When\nediting existing book descriptions, the yellow Titles catalogue or the green Authors\ncatalogue gives access to a known item. The red All catalogue gives access to browsing\nthrough all the books in the database for examples of book descriptions. This is a useful\noption relevant in unfamiliar situations since it provides inspiration on how to solve a\nclassification problem.\nThe basic principle is that a book description can be made with very little effort; and\n60\nALTJ VOLUME 2 NUMBER 2\nTTBOO\nIktctolbtc\nl*T>*\"*^~-< ** ' ^ * Y ^ S ^\n« *\nFigure 8\npractically no knowledge about classification or indexing is needed. The intention has\nbeen to make children progress gradually in their learning about the storage of\ninformation in the database. As in Book House Search, help is provided by a text line at\nthe bottom of the screen informing the user about what to do by showing an example of a\nbook description typical for the category touched with the mouse. The life belt icon\nactivates help by giving an example of a fully indexed book and, if desired, detailed\ninformation about the purpose and principles that need to be applied when indexing\nwithin varied book categories. Finally, a written folder is available on indexing options.\n8.2 Card with book description from the database\nFigure 9\nChanging descriptions of books already stored in the database will require the user to\nfetch the book from the database by selecting the action icons of Author or Title card\ncatalogues at the top of the screen. A yellow card filled in with book descriptions already\n61\nAnnelise Mark Pejtersen et al. Visualization of database structures\nsaved in the database is then displayed, and the user can now work with this card in\nexactly the same way as with the white card.\n8.3 Classification example\nA school class in the 6th grade (children of about 11 years old) at the Peder Lykke School\nin Copenhagen had a one-month project in which the mother-tongue teacher co-operated\nwith the school librarian. The overall purpose of the project was to teach children to\nreview books and to prepare their reviews by means of a computer for subsequent\ndatabase retrieval. Children chose books from the school library according to their own\ninterests, and their task was to make a book review of their own books for the benefit of\nthe other children in the class. They prepared their review on a paper form corresponding\nto the blank card for new books, and later used the card in the Book House to store their\nreviews. This took about IS minutes. Teaching in advance of and during the project\ninvolved an introduction to literary text analysis by explaining the meaning of the\ncategories in the form. They were also taught about how to prepare data for information\nretrieval through the selection of the keywords necessary to communicate the most\nimportant aspects of a book. The class created a database with 45 books, and enjoyed\nretrieving each others' books as well as accessing another database, which they found,\ncreated by a 9th grade class (children of about 14 years old) (Jensen and Acker, 1992 a, b\nandc).\n9. Integrating IR and computer use in libraries and schools\nRecently, many efforts have been made to integrate the traditional concept of a library as\na place for information retrieval of books with the role of the school in the training of\nyoung people to be skilled and knowledgeable in the use of computers. One approach is\nthe extension of the library concept into a media centre in public and school libraries\nthrough the development of systems comprising all types of media: multimedia\ntechnologies, computer programs, video and tape recordings, etc., and building a\ncollection of programs for loan in the media library.\nSeveral experiments have been carried out to try to integrate school-teaching of\ntraditional subjects with teaching about work in a library, i.e. its book collection and its\nuse. For instance, this has been done by training young people in book-acquisition tasks,\nand having them overtake the actual task of buying books for the library for a couple of\nmonths during mother-tongue classes. Through the review process, they learned to\ngenerate literary-quality assessments, and to formulate their reading experiences.\nChildren actually learned the trade-off involved in carrying out real-life tasks, and they\nenjoyed for once not being encumbered by the usual 'let's pretend' type of project.\nActivating co-operation between school children, teachers and librarians in serious, real-\nlife tasks had positive effects on children's reading habits and their use of the library\n(Weinrich 1991; Hussmann, 1992). Such initiatives can continue throughout life-long\neducational activities, and can carry with them an active contact with the local\ncommunity and its organizations involved in communicating knowledge (Kinnell, 1992).\nWorking with the Book House in integrated activities in both a library and a school\nsetting has given many valuable experiences about the effects of the system on children.\nApart from the obvious purpose of teaching computer skills, there is evidence that the\nsystem has other advantageous effects:\n62\nALT J VOLUME 2 NUMBER 2\n• It encourages children to do their own searches in public and school libraries, and to\ndo them more effectively, in direct response to their daily information needs for the\npreparation of class-work and leisure activities. The system has much in common\nwith computer games and is perceived by children to be as exciting a challenge. It is\neasy to use for the first-time user, but is not tedious or too simple for expert users.\nWith the current database of children's books, it is suitable for many different types\nof subject searches. The browse-through-icons option is particularly useful for\nchildren who do not master the reading of lists of keywords. That this is feasible has\nbeen demonstrated by the Book House evaluation process, where children proved to\nbe more than enthusiastic about doing their own searches on computers in libraries\n(Goodstein and Pejtersen, 1989).\n• It increases the number of books read, and widens reading tastes. Evaluation of the\nBook House system in libraries, and results from the experiments mentioned here,\nclearly indicate that use of the Book House in school libraries and in class work will\nincrease the number of books read and the number of visits to the library, change\nchildren's reading patterns, and widen their taste as they become aware of hitherto\nneglected literature. Special care was devoted to the development of a database for\nfiction subject-retrieval in order to increase the use of the fiction stock in public and\nschool libraries. Indexing of specific subjects in fiction is usually not a service\noffered to libraries, mainly due to the many problems that have been encountered in\nearlier attempts to develop classification schemes for fiction. The retrieval and\npromotion of fiction have become even more difficult because of the high number of\nnew published books each year, since (ideally speaking) these have to be read and\nremembered by the librarians who are the traditional mediators of borrowed fiction.\nNot all books in the library stock can be read, nor remembered when read, during\nactual dialogues with users.\n• It teaches how to formulate and solve an information-retrieval problem, improving the\neducation and training of children in storing and retrieving information via a\nuniform platform, i.e., a system common for both the teaching situation in the\nclassroom and the retrieval situation in the library. Book House Write can be an\nimportant facility for Unking language from text analysis and evaluation to\nlanguage used for database development and information retrieval. Dealing with\nterminology problems between school class-work and database language has been\nreported by Borgman (1991) as an important problem.\nChildren from the 4th grade (nine years old) can make their own database, and search on\ntheir own book descriptions with automatically converted red keywords, without having\nto go through all the categories and fields of a blank card. Only author and title are\nmandatory. Children's subjective experiences and principles adopted for the classification\nof a book can be communicated to other children in a special field for personal\ncomments. Older children can try to develop a controlled vocabulary and begin to\nunderstand the differences between free, natural-language text and a controlled\nvocabulary, as well as the important roles of precision and consistency in handling\nlanguage in connection with database construction. This experience will not only increase\nknowledge about the library; it can be generalized to the use of computers for IR and\nindexing in many other fields than the library. Experiments by Spavold (1990) involving\nthe use of a database in classroom teaching confirmed that children who used it both for\ndata input and for output\/retrieval understood the system's functionality and search\n63\nAnnelise Mark Pejtersen et at Visualization of database structures\nprocedures better, and could formulate more diverse queries, than those children who\nused the database only for searching. It helped in the learning of interrogation and\nformulation of good queries. Most children enjoyed both coding and data entry, as well\nas searching for information. There were no preferences for more problem-solving\nactivity (involved in retrieval) as contrasted with the more repetitive, routine and yet high-\nprecision task involved in the preparation and coding of data. This has been confirmed in\nexperiments with the Book House system.\n• It improves skills for text analysis and evaluation. Two traditional goals which\nteachers and school librarians have in common can control the use of the Book\nHouse: to motivate children to read books of a quality not typical for their age\ngroup, and to teach children literary analysis as a basis for generating book reviews.\nWork then takes on a practical goal, and has the effect that is physically visible and\nuseful for the whole class.\nIn a Book House Search and Write project for the 9th grade (children of about 14 years\nold), the teacher and school librarian chose 20 normally not very popular books, a\nmixture of adult books that might be read by teenagers and books of high quality for\nteenagers. They asked the students to classify these books for the Book House database.\nThe purpose was not only to draw their attention to these books, but also to create a\ndatabase for retrieval in the school library that would draw the attention of the children\nof the same age for these particular types of book. Thus the database serves as a\ncommunication tool which widens children's reading perspectives, and broadens their\nview from purely personal reading experiences to more of a critical-analysis approach. As\na tool for the analysis of books from about the 4th to 10th grade (children from 9 to\nabout 16), the classification categories can be used to prompt a number of questions\nabout a book.\n• It supports cross-disciplinary teaching, and the existing custom in education of\nintegrating fiction and non-fiction in those subject fields where such an integration\nis appropriate - for instance, history, social science, natural science - by allowing\nsimilar and specific subject accesses to both fiction and non-fiction.\n10. Present and future\nThe Book House is now available as two shareware programs. One is for the retrieval and\nindexing of fiction for children and adults in public libraries, with a database content of\n3,500 novels from different countries which have been translated into Danish. The second\nis for school libraries, and covers the retrieval and indexing of both fiction and non-\nfiction with a database containing both children's fiction and non-fiction. It was released\nin the summer of. 1993 by Apple on a CD-ROM, and by RIS0 on floppy disks, and will\nbe distributed to Scandinavian school libraries in the near future. The Danish Library\nCentre A\/S, which provides Danish libraries with bibliographical data, will conduct\nmarket research this Autumn, 1994, on the number of libraries that will subscribe to a\ncentralized indexing service which supplies books with new data in a format that matches\nthe classification of books in the Book House database. If the response from libraries is\nsufficient in number, the delivery of data to the Book House system will become a service\nsimilar to other data deliverables to Danish libraries. The project is currently being\ncontinued by extending the use of multimedia, and by the development of an adaptive,\nmultimedia interface including interactive user-modelling. In addition, the Book House\n64\nALTJ VOLUME 2 NUMBER 2\nproject is being expanded to a Nordic Book House System with participation from the\nother Nordic countries.\nAcknowledgements\nA large number of people from the library community, research institutes and industrial\ncompanies in Denmark are gratefully acknowledged for their important and influential\ncontributions to the Book House system design, software development in C++, indexing,\ngraphics and evaluation: Steen Agger, Len Goodstein, Jutta Austin, Inge Cramer, Finn\nNielsen, Peter Speck, Lena Lundgren, Ringa Sandelin, Steffan Villumsen, Henrik Gren,\nand Bjarne Acker. Institutions and funding: RIS0 National Laboratory, The Royal\nAcademy of Arts, Peder Lykke School, The Royal School of Librarianship, Hjortespring\nPublic Library, Apple Computer A\/S (Tom Jacobsgard), The Educational University\n(Kurt Hartvig, Gunnar Jacobsen), The National Foundation for Public and School\nLibraries, and the Council of Nordic Ministers. A special thanks to L.P. Goodstein for\nmaking the English more readable.\nReferences\nAmy, L. J. (ed.) (1987), Combining Libraries: The Canadian and Australian Experience,\nDalhousie University, Canada, School of Library and Information Studies.\nBoden, M.A. (1980), Jean Piaget, London, Penguin (Modern Masters series).\nBorgman, C.L. (1991), 'Designing an information retrieval interface based on children's\ncategorization of knowledge', Proceedings of the 11th International Online Information\nConference, London, 1992.\nBorgman, C.L., Chignel, M. and Valdez, F. (1989) (eds), Proceedings of the 52nd Annual\nMeeting of the American Society for Information Science (Washington, DC), 26, 81-95.\nCarey (1985), Conceptual Change in Childhood, Cambridge, MA, USA, MIT Press.\nGoodstein L.P. and Pejtersen A.M. (1989), The Book House. System Functionality and\nEvaluation, RIS0 National Laboratory, Denmark (RISO-M-2793).\nHancock-Beaulieu, M. (1989), 'Evaluating the impact of an on-line public library\ncatalogue on subject searching behavior at the catalog and at the shelves', Journal of\nDocumentation, 46, 4.\nHildreth, C.R. (ed.) (1989), The On-line Catalogue: Development and Directions, London,\nLibrary Associations.\nHildreth, C.R. (1991), Intelligent Interfaces and Retrieval Methods for Subject Searching in\nBibliographic Retrieval Systems, Washington, DC, USA, K.G. Saur.\nHussmann, H. (1992), Children's Selection of Books, Børnebiblioteket Sundbyvester,\nDenmark.\nJensen, G.L. and Acker, B. (1992a), Søg og du skalfinde (Search and Find. A program for\nteaching fiction in schools), Bom og Beger, no. 7, pp. 21-4.\nJensen, G.L. and Acker (1992b), The Book House in the School Library, Nyt om Data I\nSkolan, no. 2, pp. 10-13.\n65\nAnnelise Mark Pejtersen et al. Visualization of database structures\nJensen, G.L. and Acker, B. (1992c), The Book House in the School Library,\nSkolebiblioteket, No. 7, pp. 16-20.\nKeil (1979), Semantic and Conceptual Development: An Ontological Perspective,\nCambridge MA, USA, Harvard University Press.\nKinnel, M. (1992), 'Change management for school library services' Library\nManagement, 13 3, 10-19.\nLundgren, L. (1993), How to Find Books in the Library, Stockholms Stadsbibliotek.\nMarkey, K. (1990), 'Experiences with on-line catalogues in the USA using a classification\nsystem as a subject searching tool', Tools for Knowledge Organization and the Human\nInterface.\nPejtersen, A.M. (1980), 'Design of a classification scheme for fiction based on an analysis\nof actual user-librarian communication, and use of the scheme for control of librarians'\nsearch strategies', Harbo, O. and Kajberg, L., Theory and Application of Information\nResearch, London, Mansell.\nPejtersen, A.M. (1984), 'Design of a computer-aided user-system dialog based on an\nanalysis of users' search behavior', Social Science Information Studies, 4, 167-83.\nPejtersen, A.M. (1986a), 'Design and test of a database for fiction based on an analysis of\nchildren's search behaviour', in Ingwersen, P., Kajberg, L., and Pejtersen, A.M. (eds),\nInformation Technology and Information Use. Towards a Unified View of Information and\nInformation Technology, London, Taylor Graham, 125-47.\nPejtersen, A.M. (1986b), 'Implications of users' value perception for the design of a\nbibliographic retrieval system', in Agrawal, J.C. and Zunde, P. (eds), Empirical\nFoundation of Information and Software Science, New York and London, Plenum Press.\nPejtersen, A.M. (1988), 'Search strategies and data base design' in Goodstein, L.P.,\nAndersen, H.B. and Olsen, S.E. (eds), Tasks, Errors and Models, London, Taylor and\nFrancis.\nPejtersen, A.M. (1989), 'A library system for information retrieval based on a cognitive\ntask analysis and supported by an icon based interface' ACM, SIGIR Conference\nProceedings, Boston, USA.\nPejtersen, A.M. (1990), Interfaces based on Associative Semantics for Browsing in\nInformation Retrieval, RIS0 National Laboratory, Denmark, RIS0 M-2794.\nPejtersen, A.M. (1992a), 'New model for multimedia interfaces to online public access\ncatalogues', The Electronic Library, 10, 6.\nPejtersen, A.M. (1992b), 'The Book House. An icon based database system for fiction\nretrieval in public libraries' in Cronin, B. (ed.), The Marketing of Library Information\nServices, 2, London, ASLIB, 572-91.\nPejtersen, A.M., and Austin, J. (1984), 'Fiction retrieval: experimental design and\nevaluation of a search system based on users' value criteria' (Parts 1 and 2), Journal of\nDocumentation, 39, 4, 230-246 and 40, 1, 25-35.\nPejtersen, A.M., Olsen, Sv. E. and Zunde, P. (1987), 'A retrieval aid for browsing\nstrategies in bibliographic databases based on users' associative semantics: a term\n66\nALTJ VOLUME 2 NUMBER 2\nassociation thesaurus', in Wormell, I. (ed.), Knowledge Engineering: Expert Systems and\nInformation Retrieval. London, Taylor Graham.\nPejtersen, A.M., Villumsen, Steffan, Weber, Steen (1992), The Book House in the School\nLibrary, RISO National Laboratory, Denmark, RISO R-632 (in Danish).\nPiaget, J. (1958), The Growth of Logical Thinking: From Childhood to Adolescence, New\nYork, Basic Books.\nRasmussen (1986), Cognitive Engineering and Information Processing, Amsterdam, North\nHolland.\nSandvik, A. (1988), Learning in Information Society, report from the NORDINFO\nconference on the design and use of information-retrieval systems in primary schools and\nlibraries.\nSpavold, J. (1990), 'The child as naive user: a study of database use with young children',\nInternational Journal of Man-Machine Studies, 32, 603-25.\nValentine, P. and Nelson, B. (1988), Sneaky Teaching. The Role of the School Librarian,\nLondon, British Library (LIRR 63).\nWalker, P. and Hancock- Beaulieu, M. (1991), Okapi at City: an Evaluation Facility for\nInteractive IR, London, British Library Research Report 6056.\nWeinrich, T. (1991), Children Buy Books, Denmark, Høby Biblioteksbutik.\n67\n"}