{"doi":"10.1016\/j.indcrop.2010.11.019","coreId":"197758","oai":"oai:lra.le.ac.uk:2381\/10004","identifiers":["oai:lra.le.ac.uk:2381\/10004","10.1016\/j.indcrop.2010.11.019"],"title":"Synthesis of a base-stock for electrical insulating fluid based on palm kernel oil","authors":["Abdelmalik, A. A.","Abbott, A. P.","Fothergill, John C.","Dodd, Stephen J.","Harris, R. C."],"enrichments":{"references":[{"id":43730524,"title":"American Oil Chem.","authors":[],"date":"2006","doi":"10.1007\/s11746-006-1185-z","raw":"B. K. Sharma, A. Adhvaryu, Z. Liu, & S. Erhan, J. American Oil Chem. Society, 2006, 83, 129-136.","cites":null},{"id":43730525,"title":"Bioresource Technology","authors":[],"date":"2006","doi":"10.1016\/j.biortech.2005.07.004","raw":"V. V. Goud, A. V. Patwardhan, & N. C. Pradhan, Bioresource Technology 2006, 97, 1365–1371.","cites":null},{"id":43730522,"title":"Cigre session","authors":[],"date":"2008","doi":null,"raw":"S. Tenbohlen, D. Vukovic, J. Harthun, S. Barker, R. Frotscher, Cigre session 2008, paper A2-102.","cites":null},{"id":43730521,"title":"Fats and oils: formulating and processing for applications,","authors":[],"date":"2004","doi":"10.1201\/9780203483664","raw":"R. D. O’Brien, Fats and oils: formulating and processing for applications, CRC Press, 2004. 75","cites":null},{"id":43730528,"title":"Industrial Crops and Products,","authors":[],"date":"2008","doi":"10.1016\/j.indcrop.2007.06.001","raw":"R. A. Holser, Industrial Crops and Products, 2008, 27, 130–132. 15","cites":null},{"id":43730526,"title":"Macromolecular Rapid Communication,","authors":[],"date":"2004","doi":"10.1002\/marc.200300191","raw":"S. J. Park, F. L. Jin & J. R. Lee, Macromolecular Rapid Communication, 2004, 25, 724–727. 5","cites":null},{"id":43730527,"title":"Oil Chem. Soc.,","authors":[],"date":"2008","doi":"10.1007\/s11746-008-1277-z","raw":"R. Mungroo, N.C. Pradhan, V. V. Goud, A. K. Dalai, J. Am. Oil Chem. Soc., 2008, 85, 887–896.","cites":null},{"id":43730523,"title":"Organic Chemistry,","authors":[],"date":null,"doi":"10.1002\/9780470638859.conrr418","raw":"J. McMurry, Organic Chemistry, Brooks\/Cole, USA.,","cites":null},{"id":43730529,"title":"Spectrometric Identification of organic Compounds,","authors":[],"date":"2005","doi":"10.1021\/acs.jchemed.5b00571","raw":"R. M. Silverstein, F. X. Webster, D. J. Kiemle, Spectrometric Identification of organic Compounds, John Wiley & Sons Inc., 2005.","cites":null},{"id":43730530,"title":"The Lipid Handbook,","authors":[],"date":"2007","doi":"10.1201\/9781420009675.ch7","raw":"Foubert, K. Dewettinck, D. Van de Walle, A. J. Dijkstra and P. J. Quinn. The Lipid Handbook, CRC Press, 2007, 25 471-534.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-12-24","abstract":"NOTICE: this is the author’s version of a work that was accepted for publication in Industrial Crops and Products. Changes resulting from the publishing process, such as editing, corrections, structural formatting, and other quality control mechanisms may not be reflected in this document. Changes may have been made to this work since it was submitted for publication. A definitive version was subsequently published in Industrial Crops and Products, Volume 33, Issue 2, March 2011, Pages 532–536, DOI: http:\/\/dx.doi.org\/10.1016\/j.indcrop.2010.11.019,This report presents a method for synthesizing base-stock for green industrial product from a vegetable oil with a high composition of unsaturated fatty acids. Epoxy methyl ester of palm kernel oil was synthesized from laboratory purified palm kernel oil using a two-step reaction and the products were used as a base-stock for green electrical insulation fluid. Epoxidized palm kernel oil was first prepared through epoxidation reaction involving purified palm kernel oil, acetic acid and hydrogen peroxide in the presence of amberlite as catalyst which lasted for 4 h. It was then followed by transesterification reaction involving the epoxidized product and methanol in the presence of sodium hydroxide as catalyst to synthesize the corresponding epoxy methyl ester. The thermal and electrical breakdown properties of the epoxy methyl ester demonstrated significantly improved properties for its use as raw material for bio-based industrial products such as electrical insulation fluids.Peer-reviewedPost-prin","downloadUrl":"http:\/\/hdl.handle.net\/2381\/10004","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/10004\/5\/Synthesis%20of%20a%20Base%20Stock%20for%20Electrical%20nsulating%20Fluid.pdf","pdfHashValue":"879f5f6516f2c0c35bf695aed19a7863326bffc7","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/10004<\/identifier><datestamp>\n                2015-08-12T10:05:09Z<\/datestamp><setSpec>\n                com_2381_171<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_835<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nSynthesis of a base-stock for electrical insulating fluid based on palm kernel oil<\/dc:title><dc:creator>\nAbdelmalik, A. A.<\/dc:creator><dc:creator>\nAbbott, A. P.<\/dc:creator><dc:creator>\nFothergill, John C.<\/dc:creator><dc:creator>\nDodd, Stephen J.<\/dc:creator><dc:creator>\nHarris, R. C.<\/dc:creator><dc:subject>\nPalm kernel oil<\/dc:subject><dc:subject>\nEpoxy methyl ester<\/dc:subject><dc:subject>\nGreen industrial products<\/dc:subject><dc:subject>\nElectrical insulation fluid<\/dc:subject><dc:subject>\nION-EXCHANGE-RESIN<\/dc:subject><dc:subject>\nEPOXIDIZED SOYBEAN OIL<\/dc:subject><dc:subject>\nIN-SITU EPOXIDATION<\/dc:subject><dc:subject>\nVEGETABLE-OILS<\/dc:subject><dc:subject>\nMETHYL-ESTERS<\/dc:subject><dc:subject>\nHYDROGEN-PEROXIDE<\/dc:subject><dc:subject>\nKinetics<\/dc:subject><dc:subject>\nStability<\/dc:subject><dc:subject>\nAcid<\/dc:subject><dc:description>\nNOTICE: this is the author’s version of a work that was accepted for publication in Industrial Crops and Products. Changes resulting from the publishing process, such as editing, corrections, structural formatting, and other quality control mechanisms may not be reflected in this document. Changes may have been made to this work since it was submitted for publication. A definitive version was subsequently published in Industrial Crops and Products, Volume 33, Issue 2, March 2011, Pages 532–536, DOI: http:\/\/dx.doi.org\/10.1016\/j.indcrop.2010.11.019,<\/dc:description><dc:description>\nThis report presents a method for synthesizing base-stock for green industrial product from a vegetable oil with a high composition of unsaturated fatty acids. Epoxy methyl ester of palm kernel oil was synthesized from laboratory purified palm kernel oil using a two-step reaction and the products were used as a base-stock for green electrical insulation fluid. Epoxidized palm kernel oil was first prepared through epoxidation reaction involving purified palm kernel oil, acetic acid and hydrogen peroxide in the presence of amberlite as catalyst which lasted for 4 h. It was then followed by transesterification reaction involving the epoxidized product and methanol in the presence of sodium hydroxide as catalyst to synthesize the corresponding epoxy methyl ester. The thermal and electrical breakdown properties of the epoxy methyl ester demonstrated significantly improved properties for its use as raw material for bio-based industrial products such as electrical insulation fluids.<\/dc:description><dc:description>\nPeer-reviewed<\/dc:description><dc:description>\nPost-print<\/dc:description><dc:date>\n2012-01-13T15:23:00Z<\/dc:date><dc:date>\n2012-01-13T15:23:00Z<\/dc:date><dc:date>\n2010-12-24<\/dc:date><dc:type>\nJournal Article<\/dc:type><dc:type>\nArticle<\/dc:type><dc:identifier>\nIndustrial Crops and Products, 2011, 33 (2), pp. 532-536.<\/dc:identifier><dc:identifier>\n0926-6690<\/dc:identifier><dc:identifier>\nhttp:\/\/www.sciencedirect.com\/science\/journal\/09266690<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/10004<\/dc:identifier><dc:identifier>\n10.1016\/j.indcrop.2010.11.019<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\nCopyright © 2010 Elsevier B.V. Published by Elsevier B.V. All rights reserved.<\/dc:rights><dc:publisher>\nElsevier<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:0926-6690","0926-6690"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":["Palm kernel oil","Epoxy methyl ester","Green industrial products","Electrical insulation fluid","ION-EXCHANGE-RESIN","EPOXIDIZED SOYBEAN OIL","IN-SITU EPOXIDATION","VEGETABLE-OILS","METHYL-ESTERS","HYDROGEN-PEROXIDE","Kinetics","Stability","Acid"],"subject":["Journal Article","Article"],"fullText":"Synthesis of a Base-Stock for Electrical Insulating Fluid based on Palm Kernel Oil \nAbdelghaffar A. Abdelmalik\n a\n, Andrew P. Abbott\n b\n, John C. Fothergill\n a\n, Steven Dodd\n a\n and Robert C. \nHarris\n b\n \n \nThis report presents a method for synthesizing base-stock for green industrial products from a 5 \nvegetable oil with a high composition of unsaturated fatty acids. Epoxy methyl ester of palm kernel \noil were synthesized from laboratory purified palm kernel oil using a two-step reaction and the \nproducts were used as a base-stock for green electrical insulation fluid. Epoxidized palm kernel oil \nwas first prepared through epoxidation reaction involving purified palm kernel oil, acetic acid and \nhydrogen peroxide in the presence of amberlite as catalyst which lasted for 4 hours. It was then 10 \nfollowed by transesterification reaction involving the epoxidized product and methanol in the \npresence of sodium hydroxide as catalyst to synthesize the corresponding epoxy methyl  ester. The \nthermal and electrical breakdown properties of the epoxy methyl ester demonstrated significantly \nimproved properties for its use as raw material for bio-based industrial products such as electrical \ninsulation fluids. 15 \nIntroduction \nIn a quest for a renewable raw material that is economically \nviable without causing any environmental hazard, chemists \nand engineers have embarked on a search for “Green” \nproducts for industrial applications. Among the targets are 20 \nnatural plant-based oils as an alternative to insulation fluids \nused in high voltage oil-filled electric equipments such as \ntransformers. The basic challenge in using a natural \ntryglyceride as a dielectric fluid is synthesising a fluid with \nlow pour point and and high oxidative stability. The pour 25 \npoint, defined by ASTM D5853, is an index of the lowest \ntemperature at which a liquid may be easily poured or pumped \nunder specific condition. The thermal stability of the oil is a \nfunction of the degree of saturation. It becomes more \nsusceptible to oxidation as the degree of unsaturation 30 \nprogresses from monounsaturation to polyunsaturation. The \nrelative instability of fatty acids to oxidation is roughly \nestimated to be 1:10:100 for saturated, mono-, and poly- \nunsaturated C-18 triglycerides respectively1. Conversely, the \nmelting point of the oil decreases with the percentage of 35 \nunsaturation. The unsaturated fatty acids generally have lower \nmelting point than the saturated fatty acid. The high pour \npoint of saturated fatty acid results from its uniform molecular \nshape which enables the molecules to pack efficiently as it \nsolidifies. Crystal formation is difficult in unsaturated fatty 40 \nacids because of the bends and kinks introduced by the \ncarbon-carbon double bonds. This limits the ability of the \nfatty acids to be closely packed. As a result, the more the \nunsaturation, the harder it becomes for the molecules to \ncrystallize. This will have the consequence of lowering the 45 \npour point of the oil.2 There are two major classes of \nvegetable oils; one has higher concentration of saturated fatty \nacids which is more stable to oxidation but possesses a high \nmelting point. The other has a higher concentration of \nunsaturated fatty acids which is highly unstable to oxidation 50 \nbut possesses a low melting point. Efforts has focused mainly \non vegetable oil with higher concentration of unsaturated fatty \nacids because of its low melting and pour point. The use of \nthe existing commercial natural ester dielectric fluid (with \nhigher ethylenic unsaturation) is restricted to hermetically 55 \nsealed transformers to prevent oxidation3. Oils with higher \nconcentration of saturated fatty acids have always been \nignored, even though they are more resistant to oxidation, \nbecause they solidify at much higher temperatures. \nSolidification of insulation fluids in transformers could result 60 \nin the formation of voids during a cold start leading to partial \ndischarges (PD). PD initiation will weaken the insulation and \nmay eventually lead to electrical breakdown. \nAttaching molecular side chains through the C=C bond of \nvegetable oil could lead to an improvement of the pour point 65 \nof the oil and even the thermal stability. The side chains limit \nthe ability of the fatty acids to be closely packed4,5. \nModification of the chemical structure of vegetable oil is \nbecoming more popular as the modified oil may be used as \nraw material for environmentally friendly products. Vegetable 70 \noils can be modified to add a side chains to alter the low \ntemperature properties and possibly the oxidative stability. \n \nFig. 1 Reaction scheme for epoxidation reaction7 75 \nThis chemical structure modification can be achieved using a \ntwo-step process. The first stage involves reacting the double \nbond with peracid to convert it to epoxide. This is widely \nexploited for the modification of the properties of fatty acid 6. \nEpoxidized vegetable oils are of significant commercial 80 \nimportance as they serve as promising intermediates for \nderiving various bio-based products.6 The reaction scheme is \n shown in figure 1. The second stage involves the grafting of \nmolecular side chains to the epoxy group 7. This approach will \nbe useful in the development of electrical insulation liquid \nfrom vegetable oil where an improvement of the oxidation \nstability and pour point is a challenge. 5 \nSeveral groups8–13 have worked on the epoxidation of various \nvegetable oils to optimize the the product yield. Their report \nshows that the epoxidation reaction can be achieved using \nacidic ion exchange resin (AIER) as a catalyst. Epoxy methyl \nesters of some natural oils, which can equally serve as starting 10 \nmaterials for bio-based products, can be prepared either by the \nepoxidation of fatty acid methyl esters14,15 or the \ntransesterification of epoxidized vegetable oils. The \ntransesterification of epoxidized soybean oil by Holser16 \nconverted the oil to the corresponding methyl ester without 15 \ndegradation of the epoxide functional group. \nA series of derivatives has been synthesized from epoxidized \nsoybean oil by Erhan and co-workers5,6,17,18. They produced \nlubricant based stock from epoxidized soybean oil using acid \nanhydride of various chain lengths. Bio-based lubricant with 20 \nimproved oxidative stability and low temperature properties \nhas been formulated from epoxidized soybean oil. This was \nachieved using an acid-catalyzed ring-opening of the epoxide \ngroups followed by esterification of the dihydroxy derivatives \n(with acid anhydrides) to attach a side branched alkyl group. 25 \nSharma et al7 recently prepared acyl derivatives of soybean \noil of various branch sizes using boron trifluoride etherate as a \ncatalyst to open the epoxy ring and activate the anhydrides \nsimultaneously. Holser19 produced carbonated methyl soyates \nfrom epoxy methyl soyate by reacting carbon dioxide with the 30 \nepoxy ring at atmospheric pressure as a chemical intermediate \nfor the synthesis of functional fluids, fuel additives, and other \nbio-based products. More industrial bio-based products, such \nas insulation fluid with improved properties, could be \ndeveloped from epoxidized methyl esters. 35 \nIn this work, an attempt is made to synthesize base-stock of \nlow freezing point from a vegetable oil with a higher \nconcentration of saturated fatty acids. The epoxy methyl ester \nwas synthesized by epoxidation of laboratory purified palm \nkernel oil. The epoxidized oil was then split into its 40 \ncorresponding fatty acids through transesterification. The \nepoxidation process of Goud et al and the transesterification \nprocess of Holser were used for this synthesis. The viscosity, \nthermal properties and electrical breakdown characteristics of \nthe processed oils were studied. 45 \nExperimental \nMaterials \nCrude palm kernel oil was purchased from Jarmac Ltd. Tonsil \nsupreme 110 FF was obtained from Sud-Chemie Ltd. Trysil \n300 was obtained from Grace Davison. Citric acid, sodium 50 \nhydroxide, acetic acid, hydrogen peroxide, amberlite IR-120, \ndiethyl ether, sodium bicarbonate, sodium chloride, \nmagnesium sulphate, methanol, sodium hydroxide and \nphosphoric acid were purchased from Sigma. \nPurification 55 \nPalm kernel oil (CPKO) (100ml) was heated in a 500 ml \nconical flask to 700C. Aqueous citric acid solution (0.8 vol.% \nof 64%) was added gently and mixed thoroughly with \nmagnetic stirrer for 15 minutes. Aqueous NaOH solution (4 \nvol.% of 8%) was added to the mixture and was mixed 60 \nthoroughly at 700C for 15 minutes. The mixture was dried in \nvacuum at 950C for 30 minutes. Trysil 300 (1 wt%) was added \nto the mixture at 700C and agitated for about 30 minutes to \nprevent the silica settling out. Subsequently, 12 wt% of Tonsil \nsupreme 110 FF was added, stirred well with magnetic stirrer 65 \nand the mixture was bleached in vacuum at 950C for 30 \nminutes. The sample was then filtered. \nEpoxidation \nAcetic acid (7g) was placed in a round bottom flask followed \nby the addition of Amberlite IR-120 (16 wt%). The mixture 70 \nwas stirred continuously and followed by the addition of 1.5 \nmoles of hydrogen peroxide per mole of ethylenic \nunsaturation to the mixture to produce peracetic acid (PAA). \nLaboratory purified palm kernel oil (PPKO) (50g) was placed \nin a three-necked flask and was heated to 70OC followed by 75 \nthe addition of the PAA mixture. This was allowed to react at \n70OC for 7 hours with continuous stirring at 1200 rpm. \nAliquots were taking out every 1 hour for FTIR analysis to \ndetermine the maximum reaction time at 70OC. The sample \nwas then extracted with diethyl ether in separating funnel, 80 \npurified with 5% NaHCO3 three times to neutralize the \nremnant acid present and then a saturated solution of NaCl \nwas added. The sample was dried over anhydrous magnesium \nsulphate, and the solvent then removed under reduced \npressure using a rotary evaporator. 85 \nTransesterification \nThe epoxidized oil sample was placed in a round bottom flask \nand heated to 70OC. 16.5g (33 wt%) of methanol was added \nunder moderated stirring and followed by 1.5 wt% anhydrous \nNaOH as a catalyst. The reaction continued for 2 hours. The 90 \nmixture was transferred into a separating funnel and was \nwashed with dilute H3PO4. The emulsion was kept in an oven \nat 45OC over night for separation. The bottom layer \ncontaining the glycerol was discarded. The top layer \ncontaining epoxy methyl ester (PKOEME) was dried over 95 \nanhydrous magnesium sulphate and was then placed in a \nrotary evaporator under reduced pressure to remove the excess \nmethanol. \nResults and Analysis \nThe samples are shown in fig. 2. CPKO is the crude palm 100 \nkernel oil, PPKO is the purified palm kernel oil and PKOEME \nis the methyl ester of the epoxidized palm kernel oil. The \nmaximum epoxy yield was obtained after 4 hours. Although  \n  \nFig. 2 Samples \nthe maximum yield is obtained within a short time at high \ntemperature, the epoxy ring is highly unstable and \ndecomposes after a certain reaction time, found to be 4 hours 5 \nin this case. The functional groups present in the purified \npalm kernel oil, epoxidized palm kernel oil and the epoxy \nmethyl ester of the palm kernel oil were analyzed using FTIR \nspectroscopy. The thermal analysis was carried out using \ndifferential scanning calorimetry. 10 \nFTIR Analysis \nThe FTIR spectra displayed characteristc peak of some \nfunctional groups common to PPKO, EPKO and PKOEME. \nThe characteristic weak band of PPKO at 3003 cm-1 due to \n=C–H stretching vibration of the carbon–carbon double bond 15 \nwas absent in the spectra of EPKO confirming the absence of \ncarbon–carbon double bonds in the epoxidized palm kernel oil \nsample. The peaks at 844cm-1 and 827 cm-1 are a fingerprint \nof epoxidized ester which is common to both EPKO and \nPKOEME. The peaks at 1197 cm-1 and 1169 cm-1 on the 20 \nspectra of PKOEME are fingerprint of methyl ester of long-\nchain fatty acid20. The existence of the peaks at 844 cm-1 and \n827 cm-1 on the PKOEME spectra shows that the \ntransesterification reaction occurred without degradation of \nthe epoxy ring, which is needed for further modification of the 25 \nepoxy Methyl ester. \nViscosity \nFluids intended for electrical insulation are often expected to \nbe able to flow under extremely cold weather conditions and \nact as an effective coolant at all times. Dielectric fluid may be 30 \nrequired to absorb the heat generated by the electrical unit and \ntransport it either by convection or forced circulation. \nStudying the viscosity-temperature dependence and flow \nproperties of the epoxy methyl ester is essential for its \nconsideration as a potential candidate as a bio-based 35 \ninsulation fluid. A suspended level capillary viscometer and a \nPaar DMA 40 digital density meter were used to determine the \nkinematic viscosity and the density of the epoxy methyl ester \nrespectively. \nFigure 3 shows the Arrhenius plot demonstrating the effect of 40 \ntemperature on the viscosity of the epoxy methyl ester. The \nviscosity-temperature relationship follows an activated \nbehaviour.  PKOEME has an activation energy of 17.31  \n \nFig. 3 Arrhenius plot for the viscosity of epoxy methyl ester of PKO 45 \nkJ.mol-1 (0.18eV) and is slightly lower than the activation \nenergy of PPKO which is 26.92 kJ.mol-1 (0.28eV). The \nkinematic viscosity of the epoxy methyl ester is 6.14 cSt at \n20OC. This is considerably lower than mineral insulating oil \nwhose viscosity is 16 cSt at the same temperature.  Viscosity 50 \noften has an overwhelming effect on the heat transfer \ncapability of a fluid since it is a strong function of \ntemperature. Low viscosity enhances good heat \ntransferability. \nThermal Analysis by Differential Scanning Calorimetry 55 \n(DSC) \nThe melting behaviour of the oil samples were analyzed using \nDSC. This was carried out using Mettler Toledo DSC1 \ninstrument. The samples were measured into the aluminium \ncrucible, sealed with the crucible sealing press. It was then 60 \nplaced in the furnace of the DSC and heated under nitrogen \n(flow rate of 50cm3\/min) from 25OC to 50 OC at a rate of \n50OC\/min. It was held at that temperature for 1 minute, cooled \nto -100OC at a rate -50OC\/min and held there for 2 minutes. It \nwas then heated to 50OC at a rate 50OC\/min and held there for 65 \n4 minutes. It was cooled to -100OC at a rate -10OC\/min and \nheld there for 10 minutes, and then heated to 50OC at a rate \n10OC\/min. The thermogram of PPKO and PKOEME between -\n60OC and 40OC is shown in fig. 4. \n 70 \nFig. 4 DSC Thermogram \nThe characteristic melting temperatures, heats of fusion and \nthe specific heat capacities of the samples are listed in Table \n1. As the sample is heated from -100OC to 50OC, a \ncharacteristic endotherm is observed in the region where 75 \nCPKO PPKO PKOME \n phase transitions from solid to liquid state occur (Figue 4). \nTable 1 Thermal properties \nSample \nMelting \nTemperature \n(OC) \nHeat of \nFusion \n(kJ.kg-1) \nSpecific Heat \nCapacity \n(kJ.kg-1.K-1) \nOnset Peak \nPPKO 14.56 26.19 90.11 2.0188 \nPKOEME -16.52 -6.90 132.42 1.857 \n \nPalm kernel oil contains fatty acids of different chain \nlength,and each fatty acid has its melting point. The broad \npeak of the thermogram is a distribution of the melting point 5 \nof the fatty acids in the oil. Vegetable oil has a melting range \nand not a sharp melting point and the melting point is often \ndefined as the temperature at which the oil is free of \ncrystals21. The peak melting temperature of PKOEME occurs \nat a significantly lower temperature than PPKO. Table 1 10 \nshows that PKOEME has a higher heat of fusion but a lower \nheat capacity than PPKO. This results from the presence of an \nepoxy ring in the chemical structure of some of its fatty acids. \nA comparison of the PKOEME with PKOME thermogram in \nfig. 4 shows the presence of melting peak at -40OC. This can 15 \nbe assigned to the melting peak of the unsaturated fatty acids \nin the methyl ester. The peak is absent in PKOEME \nreaffirming the conversion of the double bonds to epoxy rings. \nThe pour point of samples falls between the onset and peak \nmelting temperatures. The pour point of PKOEME and PPKO 20 \nwere estimated to be -10OC and 22OC respectively. The \nsplitting of the oil into its respective fatty acid reduced its \nmelting temperature. \nElectrical Breakdown properties \nA breakdown liquid test cell was used for the breakdown 25 \nvoltage measurement and consists of two stainless steel \nspheres of diameter 25mm as electrodes attached to brass \nrods. A gap of 1mm was created between the electrodes with a \nPTFE spacer. The cylindrical wall of the cell was made from \nPMMA. 30 \nTable 2 Electrical Breakdown test result \nSamples No. of \nSpecime\nn \nMean \nBDV \n(kV) \nStandard \nDeviation \n(kV) \nMinimum \nBDV(kV) \nASTM D1816 \nMin oil 5 26.44 1.83 20* \nCPKO 5 36.66 1.03 35** \nPPKO 5 40.55 1.79 35** \nPKOEME 5 42.58 0.98 35** \n \n*22 **23 \nThe cell was designed for small sample volume measurement \n(5ml) as compared with the IEC 156:1995 standard designed \ncell with volume of 350 ml to 600 ml. The measured 35 \nbreakdown voltage of the palm kernel oil samples satisfied the \nquoted minimum breakdown voltage in literature measured \nwith ASTM D1816 standard test method (Table 2). Palm \nkernel oil epoxy methyl ester (PKOEME) has significant \nimproved breakdown strength. The average electric field 40 \nstrength of the palm kernel oil ester derivative is about 60% \nhigher compared with conventional mineral insulating oil. The \nmeasurements indicate that breakdown strength of palm \nkernel oil epoxy methyl ester is higher than the minimum \nbreakdown voltage according to IEEE Std C57.147-2008. 45 \nConclusion \nEpoxy methyl ester of palm kernel oil has been synthesized \nfrom laboratory purified palm kernel oil. The synthesized \nproduct has a considerably lower melting point and viscosity \nof about 2.5 times less than that of mineral insulation oil. It 50 \nretained the epoxy functional group which is a path to further \nmodification of the product. The low viscosity value will \nenhance efficient heat transfer since viscosity often has an \noverwhelming effect on the heat transfer capability of a fluid \nsince it is a strong function of temperature. The viscosity and 55 \nspecific heat capacity of the epoxy methyl ester suggest that it \ncould serve as good dielectric coolant. It displayed excellent \nbreakdown strength showing that the processing significantly \nimproves the breakdown strength of the epoxy methyl ester. \nThese preliminary results suggest that the synthesized epoxy 60 \nproduct is a potential material for a sustainable bio-based \nindustrial products for high voltage insulation. A fluid is \nintended to be formulated from the epoxy methyl ester by \nattaching side chain via the epoxide site. This is expected to \nyield a fluid with an even lower pour point, improved 65 \noxidation stability and good dielectric properties for high \nvoltage insulation. \nAcknowledgement \nThis study was supported by Islamic Development Bank under \ntheir Merit Scholarship programme and National Grid, UK. 70 \nReferences \n1. T. V. Oommen, IEEE Electrical Insulation Magazine, \n2002, 18, 6-11. \n2. R. D. O’Brien, Fats and oils: formulating and processing \nfor applications, CRC Press, 2004. 75 \n3. S. Tenbohlen, D. Vukovic, J. Harthun, S. Barker, R. \nFrotscher, Cigre session 2008, paper A2-102. \n4. J. McMurry, Organic Chemistry, Brooks\/Cole, USA., \n2000. \n5. H. S. Hwnag and S. Z. Erhan, JAOCS, 2001, 78, 1179-80 \n1184. \n6. B. K. Sharma, A. Adhvaryu, Z. Liu, & S. Erhan, J. \nAmerican Oil Chem. Society, 2006, 83, 129-136. \n7. B. K. Sharma, Z. Liu, A. Adhvaryu, & S. Z. Erhan, \nJournal of Agricultural and Food Chemistry, 2008, 56, 85 \n3049-3056. \n8. V. V. Goud, A. V. Patwardhan, S. Dinda & N. C. \nPradhan, Eur. J. Lipid Sci. Technol. 2007, 109, 575–584. \n9.  V. V. Goud, A. V. Patwardhan, & N. C. Pradhan, \n Bioresource Technology 2006, 97, 1365–1371. \n10. V. V. Goud, A. V. Patwardhan, & N. C. Pradhan, Ind. \nEng. Chem. Res. 2007, 46, 3078–3085. \n11. S. J. Park, F. L. Jin & J. R. Lee, Macromolecular Rapid \nCommunication, 2004, 25, 724–727. 5 \n12. C. Cai, H. Dai, R. Chen, C. Su, X. Xu, S Zhang, & L. \nYang, Eur. J. Lipid Sci. Technol., 2008, 110, 341–346. \n13.  R. Mungroo, N.C. Pradhan, V. V. Goud, A. K. Dalai, J. \nAm. Oil Chem. Soc., 2008, 85, 887–896. \n14. E. U. Ikhuoria, R. O. Obuleke, & F. E. Okieimen, Part 10 \nA: Pure and Applied Chemistry, 2007, 44, 235–238. \n15. A. Campanella, C. Fontanini & M. A. Baltanas, \nChemical Engineering Journal, 2008, 144, 466–475. \n16. R. A. Holser, Industrial Crops and Products, 2008, 27, \n130–132. 15 \n17. S. Z. Erhan, A. Adhvaryu, Z. Liu, United States Patent \nUS 6,583,302 B1, 2002. \n18. B. R. Moser, B. K. Sharma, K. M. Doll, S. Z. Erhan, J. \nAmer. Oil Chem. Soc. 2007, 84, 675-680. \n19. R. A. Holser, 2007, J. Oleo Sci., 2007, 56, 12, 629-632. 20 \n20. R. M. Silverstein, F. X. Webster, D. J. Kiemle, \nSpectrometric Identification of organic Compounds, \nJohn Wiley & Sons Inc., 2005. \n21. Foubert, K. Dewettinck, D. Van de Walle, A. J. Dijkstra \nand P. J. Quinn. The Lipid Handbook, CRC Press, 2007, 25 \n471-534. \n22. C. T. Dervos, C. D. Paraskevas, P. Skafidas, P. \nVassiliou, IEEE Insulation Magazine, 2005, 21, 11-19. \n23. IEEE Std C57.147-2008, IEEE Guide for Acceptance \nand Maintenance of Natural Ester Fluids in 30 \nTransformers, IEEE, 2008. \nNotes and references \na Engineering Department, University of Leicester, Leicester, UK,  LE1 \n7RH,aaa63@le.ac.uk 35 \nb Chemistry Department, University of Leicester, Leicester, UK,  LE1 \n7RH \n"}