{"doi":"10.1117\/12.489017","coreId":"70849","oai":"oai:eprints.lancs.ac.uk:10105","identifiers":["oai:eprints.lancs.ac.uk:10105","10.1117\/12.489017"],"title":"Solution of the boundary value problem for nonlinear flows and maps","authors":["Beri, Stefano","Luchinsky, Dmitrii G.","Silchenko, Alexander","McClintock, Peter V. E."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-05-07","abstract":"Fluctuational escape via an unstable limit cycle is investigated in stochastic flows and maps. A new topological method is suggested for analysis of the corresponding boundary value problems when the action functional has multiple local minima along the escape trajectories and the search for the global minimum is otherwise impossible. The method is applied to the analysis of the escape problem in the inverted Van der Pol oscillator and in the Henon map. An application of this technique to solution of the escape problem in chaotic maps with fractal boundaries, and in maps with chaotic saddles embedded within the basin of attraction, is discussed","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/70849.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/10105\/1\/spieactionPostPrint.pdf","pdfHashValue":"52e4b141e3d3b8366c2c63785d71c3bd635b9ef6","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:10105<\/identifier><datestamp>\n      2018-01-24T05:23:39Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Solution of the boundary value problem for nonlinear flows and maps<\/dc:title><dc:creator>\n        Beri, Stefano<\/dc:creator><dc:creator>\n        Luchinsky, Dmitrii G.<\/dc:creator><dc:creator>\n        Silchenko, Alexander<\/dc:creator><dc:creator>\n        McClintock, Peter V. E.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        Fluctuational escape via an unstable limit cycle is investigated in stochastic flows and maps. A new topological method is suggested for analysis of the corresponding boundary value problems when the action functional has multiple local minima along the escape trajectories and the search for the global minimum is otherwise impossible. The method is applied to the analysis of the escape problem in the inverted Van der Pol oscillator and in the Henon map. An application of this technique to solution of the escape problem in chaotic maps with fractal boundaries, and in maps with chaotic saddles embedded within the basin of attraction, is discussed.<\/dc:description><dc:date>\n        2003-05-07<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/10105\/1\/spieactionPostPrint.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1117\/12.489017<\/dc:relation><dc:identifier>\n        Beri, Stefano and Luchinsky, Dmitrii G. and Silchenko, Alexander and McClintock, Peter V. E. (2003) Solution of the boundary value problem for nonlinear flows and maps. Proceedings of SPIE, 5114. pp. 372-382. ISSN 0277-786X<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/10105\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1117\/12.489017","http:\/\/eprints.lancs.ac.uk\/10105\/"],"year":2003,"topics":["QC Physics"],"subject":["Journal Article","NonPeerReviewed"],"fullText":"Solution of the boundary value problem\nfor nonlinear flows and maps\n              Stefano Beria, Dmitri G. Luchinskya, Alexander Silchenkoa\nand Peter V.E. McClintocka\na Department of Physics, Lancaster University, Lancaster LA1 4YB, UK\nABSTRACT\nFluctuational escape via an unstable limit cycle is investigated in stochastic flows and maps. A new topological\nmethod is suggested for analysis of the corresponding boundary value problems when the action functional has\nmultiple local minima along the escape trajectories and the search for the global minimum is otherwise impossible.\nThe method is applied to the analysis of the escape problem in the inverted Van der Pol oscillator and in the\nHenon map. An application of this technique to solution of the escape problem in chaotic maps with fractal\nboundaries, and in maps with chaotic saddles embedded within the basin of attraction, is discussed.\nKeywords: Stochastic non linear dynamics, boundary value problem, heteroclinic trajectory, activation prob-\nlem, topology of invariant manifold\n1. INTRODUCTION\nThe motion of a dynamical system subject to noise typically consists of small fluctuation about an attractor\nof some kind. Their amplitude is typically of the order of\n√\n², where ² is the intensity of the noise. On rare\noccasions, however, the system may make a fluctuation whose amplitude is much larger than\n√\n². In this case\nthe system is said to perform a large fluctuation.\nEven though they are rare, large fluctuations are responsible for most of the important events that occur\nin stochastic nonlinear systems. In particular large deviations are involved in stochastic resonance,4 directed\ndiffusion in stochastic ratchets,?, 5, 6 nucleation in electrochemical systems,7 the dynamics of VCSELs9,11,12 and\ngas lasers,19,20 and the passage of currents of ions through open ionic channels? in biological membranes. For\nthis reason, a deeper understanding of fluctuations and activation processes is much to be desired in relation\nboth to continuous flows1–3,8–10 and to maps.13–20 Many promising steps towards a solution have been taken in\nthe limit of zero noise intensity ²→ 0. In this regime, the probability density for the system may be written in\nthe asymptotic form23\n%(x, t) = z(x, t) exp\n(\n−S(x, t)\n²\n)\n, ²→ 0. (1)\nIn this limit, the escape probability is exponentially dominated by an “activation energy”∗ S (x, t). The prefactor\nz (x, t) contains next-to-the-leading order correction in the activation energy which take account of contributions\ndue to a finite value of ².\nIt follows from this asymptotic analysis23,40 that the activation energy satisfies an Hamilton-Jacobi equation\nfor a classical action.\n∂S\n∂t\n+H\n(\n∂S\n∂x\n, x\n)\n= 0. (2)\nThe action S(x, t) can be computed explicitly along the trajectories by solution of the corresponding Hamilton’s\nEquations. In a generic system, more than one trajectory of (2) terminates in the same final point (x, t).\nFor this reason, the activation energy S(x, t) is generally a multivalued function of position in the coordinate\nspace.2,6, 21,25–35 The trajectory reaching the boundary that has the least possible energy is known as the most\n∗For a non equilibrium system, the potential S is not an energy; but, in what follows, the quotation marks will be\nomitted.\nPublished in Proc. Conf: Noise in Complex Systems and Stochastic Dynamics, eds. L. Schimansky \nGeier, D. Abbott, and C. Van den Broeck, SPIE vol. 5114, 2003, pp 372-382.\nprobable escape path (MPEP) and the corresponding value of the energy gives the activation potential. The\nMPEP is an heteroclinic trajectory emanating from the initial state at t → −∞ and reaching the final state at\nt → +∞. For non trivial system, solution of this boundary value problem is in practice very complicated. The\ndifficulties increase with the dimension of the system and a successful application cannot be relied upon in any\ngeneral case. This imposes strong limitations, for example, in applying the method to study of escape from a\nchaotic attractor in the problem of control of chaos.38 A similar asymptotic analysis has been proposed16–18,39\nto investigate activation precesses in stochastic maps of the form\nxn+1 = f(xn) + ξn, (3)\nwhere xn describes the state of the system, f(x) is a nonlinear function and ξn is a set of white Gaussian variables\nsatisfying 〈ξnξm〉 = ²δmn. The asymptotic ² → 0 solution of the escape problem requires minimisation of the\nactivation energy\nE =\n1\n2\n∑\nξ2n (4)\nand the calculation of a MPEP analogous to that for continuous systems. The minimisation is performed using\nthe method of Lagrangian multipliers.17,18 As a result (3) is transformed in an extended area-preserving map,\nand the activation energy can be calculated along the solutions. The structures of the invariant manifolds and\nof the energy surface are again very complex, and the calculation of the MPEP for a generic non linear map is\nvery difficult even for low dimension maps. In particular the determination of the MPEP becomes extremely\nhard in the case of chaotic saddles embedded in the basin of attraction24\nIn this paper we address the problem of activated processes in the limit ² → 0 for both nonlinear flows and\nmaps. In particular we consider noise induced escape for continuous systems exhibiting a saddle cycle, and\nof noise induced escape from a smooth boundary of a domain of attraction in nonlinear maps. We perform a\ntopological investigation of the invariant manifold and we show how such an analysis substantially simplifies\nthe solution of the boundary value problem. We introduce a way of parameterising the escape trajectories on\nthe unstable manifold, and we consider the action (or the activation energy) at the escape instant as a function\nof these parameters. The global minimisation of the action in relation to these parameters gives us the lowest\nenergy solution of the boundary value problem. The multiplicity of solutions of the boundary value problem is\nalso addressed. In particular we show how, in principle, all possible solutions of the boundary value problem (i.e.\nincluding unphysical ones) can be obtained. To show explicitly how the method works, we choose two different\nsystems: the inverted Van der Pol oscillator and the Henon map. The results for the activation energy and for\nthe escape trajectories are shown to agree with the experimental values obtained with numerical simulations.\nThe paper is structured as follow: in Sec. 2 we present the problem of escape for a continuous system.\nThe asymptotic analysis of the Fokker-Planck equation is performed, and the auxiliary Hamiltonian system is\nintroduced for the calculation of the activation energy. The structure of the invariant manifolds in the extended\nphase space is discussed, including their singularities and the kind of trajectories generating them. In Sec. 2.2 we\nintroduce the action plot as a tool to investigate activation problems from the topological viewpoint. In Sec. 3\nwe apply the method to solve the particular problem of escape in the inverted Van der Pol oscillator. Finally in\nSec. 4 we study the Henon map as an example of the application of the method to a non linear map. In both\nSec. 3 and 4, theoretical results obtained using the action plot are shown to be in agreement with experimental\nresults from numerical simulations.\n2. NOISE-INDUCED ESCAPE\nConsider a dissipative dynamical system under the influence of noise, described by a Langevin equation of form\nx˙i = Ki (~x) +\n√\n²σijξj (t) . (5)\nHere ξj (t) are Gaussian, zero-mean, uncorrelated sources of noise. They are linearly mixed by the noise matrix\nσij . The parameter ² is again the intensity of the noise, and it is the small parameter in the theory. We consider\nnoise-induced escape from a planar domain Ω with an attracting fixed point S and a smooth boundary ∂Ω. One\nexample of such a system is provided by the inverted Van der Pol oscillator (IVDP) in the presence of noise, for\nwhich {\nx˙1 = x2\nx˙2 = −2η(1− x21)x2 − x1 +\n√\n4η²ξ2(t)\n(6)\nThe noise matrix for this system is σij =\n√\n4ηδi2δj2. The fixed point has coordinates (0, 0) and the smooth\nboundary is formed by an unstable cycle. The Fokker-Planck equation corresponding to Eq.(5) is\n∂%\n∂t\n=\n∂\n∂xi\n(\n−%Ki + ²2\n∂\n∂xj\nQij%\n)\n, (7)\nwhere Qij is a diffusion matrix defined as\nQij = σikσjk.\nIn the limit of ² → 0, (7) is solved via WKB expansion. Substitution of the approximation (1) into (7), and\nexpansion in powers of ², shows that to order 1² (which is leading when ²→ 0) the function S(x, t) satisfies the\nfollowing partial differential equation23,40\n∂S\n∂t\n+Ki\n∂S\n∂xi\n+\n1\n2\nQij\n∂S\n∂xi\n∂S\n∂xj\n= 0. (8)\nEq.(8) may be expressed as an Hamilton-Jacobi (2) for an auxiliary Hamiltonian dynamical system with the\nHamiltonian\nH(x, p) = Kipi +\n1\n2\nQijpipj , pi ≡ ∂S\n∂xi\n. (9)\nThe system of Hamiltons equations corresponding to (9) is\nx˙i = Ki +Qijpj ,\np˙i = −∂Kj∂xi pj\nS˙ = 12Qijpipj ,\n(10)\nwhere S (~x, t) can be interpreted as an action in the context of classical mechanics.41,42 The matrix Qij is\npositively defined, so that S is nondecreasing along solutions of (10) emanating from the initial stationary state.\nMoreover, S(x, t) is differentiable almost everywhere in the coordinate space. For these reasons S is a Lyapunov\nfunction and can be used as nonequilibrium thermodynamic potential to describe the fluctuating system.25,27,28\nThe trajectory emanating from the initial steady point that reaches a final point with the least action is called\noptimal. Trajectories differing from optimal can reach the same final point with higher action. They correspond to\nother local extrema of the action functional. Their contribution to the probability density %(x, t) is exponentially\nsmall for ² → 0 and the probability distribution is dominated by the global minimum. The concept of optimal\ntrajectories is not just a mathematical abstraction: the prehistory of a large fluctuation is sharply peaked about\nthe optimal path solution of (10). Optimal paths have been observed in both numerical simulations and analogue\nexperiments33,43,44 and in the dynamics of activated escape in a semiconductor laser.45\nIn the case of a noisy map of the form (3), an extended map is obtained in a similar way. Minimising the\nactivation energy (4) with respect to the set {ξn} with the condition (3) is equivalent to minimising the auxiliary\nfunction17,18\nF (xn, ξn, λn) =\n∑(1\n2\nξ2n + λn\n(\nxn+1 − f(xn)− ξn\n))\n(11)\nwith respect to {xn}, {ξn} and {λn}. The auxiliary variable λn is known as a Lagrange multiplier. The\nminimisation leads to an area preserving map for the variables {xn} and {λn} and to the equation for the\nevolution of the activation energy. \nxn+1 = f (xn) + λn\nλn+1 =\n(\n∂f\n∂x\n∣∣\nxn+1\n)−1\nλn\nEn+1 = En + 12λ\n2\nn.\n(12)\nThe two systems (10) and (12) are completely analogous. As in the case of continuous systems, the stable and\nunstable orbits for system (3) become saddle orbits in the extended system (12). In what follows, we will consider\nthe particular case of a map presenting a stable period-one orbit xs and smooth (non-fractal) basin boundaries,\nand we address the problem of noise activated escape from the basin of attraction.\n2.1 Heteroclinic trajectories\nIn the extended phase space x − p, the extreme paths emanating from a fixed point (at t → −∞) of the\ndeterministic flow defined by the Hamiltonian equations (9) span the unstable Lagrangian manifold (LM) of\nthis point.36,40,42,46 In a generic n-dimensional system, the phase state is 2n-dimensional and the manifold is\nn-dimensional. The trajectories solution of (10) form an (n− 1)-parameter family on the unstable manifold, and\nevery point on the LM is completely determined, giving the initial conditions at a given initial time t0 for the\ntrajectory reaching that point at time t. In a small neighbourhood of the fixed point, the action may be written\nin the form\nS(x, t) =\n1\n2\nWijδxiδxj (13)\nwhere δxi is the deviation from the stable point in the xi direction and Wij is the (n× n)Hessian matrix of the\naction calculated for the stable point. The LM in a small neighbourhood of the fixed point is an n-dimensional\nlinear subspace completely defined by the equation\npi =Wijδxj . (14)\nIn a planar system, the 2-dimensional LM can be parameterised using the following procedure: the initial\nconditions in the coordinate space are taken on a small circle of radius r0. Then using Eq. 13 and 14 the\ncorresponding momenta and action are found. In higher dimensional systems, more parameters are required to\nparameterise the manifold, but the same general procedure still applies: parameterising the coordinate space in\na small neighbourhood of the fixed point, and using 13 and 14 to obtain the momenta and the action. Similar\nparameterisations are possible when the steady state is limit cycle and not a stable point. Differentiating Eq. 2\ntwice the following Riccati equation for the coefficients Wij is obtained31\nd\ndt\nWij = − ∂\n2H\n∂xi∂xj\n−Wik ∂\n2H\n∂pk∂xj\n−Wjl ∂\n2H\n∂xi∂pl\n−WjlWik ∂\n2H\n∂pk∂pl\n. (15)\nIn the case of a fixed point this equation reduces to an algebraic equation. In the case of a limit cycle, (15) has\nto be solved along the limit cycle with the additional “periodicity” constraint Wij(l) = Wij(l + L) where l is a\ncoordinate along the cycle and L is the total length of the cycle.\nAnother invariant manifold is the stable manifold spanned by the trajectories converging to the final steady\nstate for t→ +∞.\nThe same picture applies to the case of stochastic maps. This is particularly clear in the case of maps obtained\nas Poincare´ sections from continuous flows. Due to the discreetness of time, trajectories emanating at t → ∞\nfor a n-dimensional map are an n parameter family on the unstable manifold. In a small neighbourhood of the\nsteady state, a linear relationship among the coordinates and “momenta” λ analogous to (14) can be written\nλi = Aijδxj . (16)\nSince no Hamilton-Jacobi equation can be written in the case of maps, the coefficients Aij have to be computed\ndirectly by a linearisation of 12. Consider the case of an n-dimensional map and a base ~v1 . . . ~vn for its unstable\nmanifold. A generic vector on the unstable manifold is then written as a linear combination of the base vectors\n\nx1\n...\nxn\nλx1\n...\nλxn\n\n=\n∑\ni\nαi\n\nvix1\n...\nyixn\nviλx1\n...\nviλxn\n\n(17)\n−3 −1 1 3−3\n−1\n1\n3\n x\n y\n−3 −1 1 3−3\n−1\n1\n3\n x\n y\na\nb\nc\nFigure 1. Left: A heteroclinic trajectory (bold curve) for the inverted van der Pol system and the trajectories (thinner\ncurves) resulting from small perturbations about it. Non-heteroclinic trajectories may cross the cycle and go far away, or\nthey may be reflected back toward the internal regions of the limit cycle and, after that, fluctuate again. The η parameter\nis 0.5. Right: Significant trajectories in the pattern: a the MPEP; b the trajectory corresponding to the top of the first\nhill in the action plot, which touches the cycle and the caustic at the same moment; c another (non-optimal)heteroclinic\npath. Trajectory c passes exactly through the cusp.\nwhere α1 . . . αn are n real parameters. The values of the parameters α1 . . . αn can be obtained from the first\nn equations in (17). Substituting the values of the parameters in the other n equations in (17), the desired\nlinear relation (16) among the coordinates and momenta is obtained. In a 2-dimensional map, the manifold is\nparameterised in a similar way to that used in continuous systems: the initial conditions are chosen between two\ncircles whose radii are chosen so as to include all possible trajectories in the pattern.\nIt is clear that a trajectory emanating from the first steady state and converging to the second one lies on\nthe intersection of these two manifolds; it is a heteroclinic trajectory (HT)47 of (9). Since both the initial and\nfinal state are invariant sets of the original noise-free system (5), the heteroclinic trajectory has zero momentum\nat t → ±∞. In Fig. 1 the heteroclinic trajectory in the inverted van der Pol system, and small perturbations\nabout it, are shown by the thick and thin full lines respectively. The HT converges to the limit cycle, whereas\ntrajectories that are small perturbations of the HT show either of two possible types of behaviour: they may\ncross the cycle and escape to infinity; or they may be reflected back into the internal region. The HT separates\nthese two classes of trajectories (cf. the discussion in32).\nOutside the linear regime, the structure of the Lagrangian manifolds becomes more complicated.28,36,46 In\nparticular, the pattern of escape trajectories in the coordinate space shows multiple intersections. In a continuous\nplanar system with a saddle cycle, the MPEP and its small perturbations move close to the cycle, and necessarily\nintersect the trajectories that are going to infinity (See Fig. 1). The projection of the LM onto the coordinate\nspace contains singularities away from the initial state.25,28,29,36,46 For a two dimensional Lagrangian manifold\n(such as in the Van der Pol system) the only structurally stable types of singularity are the fold and the cusp.42\nIn projection, folds lead to caustics and cusps lead to cusp points.25,28,29\nA cusp point separates a caustic into two different branches that emanate from it: an external one (that\ncrosses the cycle) and an internal one. The external branch is generated by trajectories moving toward the cycle\n(having essentially non-zero momentum p), whereas the internal one is generated by trajectories that have been\nreflected from the cycle and are moving back toward the origin.\nIt is a general result that, in a system with saddle cycles, the internal branch of the caustic converges to\nthe steady state. Indeed, the internal branch is generated by trajectories moving back to the internal region of\nthe cycle after being reflected by the saddle cycle. The momentum on the HT trajectory is asymptotically zero\n(for t → ∞) and the closer the trajectory approaches to the HT the smaller is its momentum. Consequently\ntrajectories that are very weak perturbations of the HT have very small momenta p.31 The smaller the momentum\nof the trajectory, the closer it is to the purely relaxational trajectory (i.e. a trajectory that has p = 0 by definition)\non its way back to the interior of the limit cycle, and the closer this trajectory approaches the steady state before\ntouching the caustic. Thus, the caustic converges to the stationary state. However, trajectories with non-zero\nmomentum belong to the unstable Lagrangian manifold of the steady state. Therefore these trajectories cannot\ntouch the steady state. Instead, they will be reflected by the internal branch of the caustic and then move\nback to the saddle cycle. On the other hand, topological analysis shows31,43,46 that, in regions of folding, the\nLagrangian manifold has three different sheets: two external sheets and one internal. A trajectory emanating\nfrom the steady state stays on one of the external sheets. After being reflected by the caustic it moves to the\ninternal sheet of the LM. Once a trajectory is on the internal sheet of the LM, it stays there forever36 because\nof the Cauchy’s Theorem. Thus trajectories reflected by the internal branch of the caustic, moving back to the\nsaddle cycle, must stay on the internal sheet of the LM. Close to the saddle cycle these trajectories will repeat\nthe same pattern of behaviour as was described above. Some of them will cross the cycle, while the others will\nbe reflected from the cycle, and these two types of behaviour will be separated by a new heteroclinic trajectory\nthat approaches the saddle cycle at t → ∞. Consequently, they will repeat the pattern of intersections related\nto another folding of the LM. In conclusion, the central sheet of the LM will experience multiple stretchings\nand foldings (cf.31,48). An infinite number of heteroclinic trajectories is produced in this way. Corresponding\nto folding in the LM, in the action surface swallow tail singularities appear.36 The middle sheet of the LM\ncorresponds in this case to the top sheet of the action surface. Subsequent multiple folding of the middle sheet\nof the LM induces a complex structure of swallow tail singularities in the action surface.\n2.2 The action plot and its structure\nIn this section we introduce the new technique for solution of the boundary value problem. As discussed above,\nthe optimal trajectories on the LM are an (n − 1)-parameter family (for a continuous flow, or n-parameters\nfor a map), where n is the dimensionality of the system. The space of parameters is diffeomorph to a torus\nS1 × . . .× S1. For example, in the IVDP system, the space of parameters is a simple S1, as it appears explicitly\nfrom the choice of parameterisation discussed in Sec.2; for a 2-dimensional system the space of parameters is a\ntorus S1 × S1. The evolution of the trajectories corresponding to any point in the parameter space is followed\nuntil the escape is realised. The value of the activation energy (action) at the escape is recorded. In this way we\nbuild a function\nS : S1 × . . .× S1 −→ R.\nWe will refer to this result as the action plot. In order to show how the action plot can help to solve the boundary\nvalue problem for activated processes, we consider the simple case of the IVDP system. The action plot is shown\nin Fig. 2. It is immediately evident that the value of the action at the limit cycle is a complex discontinuous\nfunction of the parameter. The plot consists of a set of “hills” of different height separated by discontinuities\nin the action. The two large hills of lowest action are identical on account of the symmetry of the Van der Pol\nequations. The discontinuities in action at the edges of the hills correspond to heteroclinic paths, which can be\nappreciated as follows. As we have discussed above, weak perturbations of the HT are separated into two sets of\ntrajectories: those that cross the cycle and those that are reflected back. The change from one type of behaviour\nto the other occurs abruptly with continuous change of the parameter. On the other hand, it can be seen from Eq.\n(10) that the action is a non-decreasing function along the path and its evolution is determined by the behaviour\nof p2. Consequently, in the vicinity of the limit cycle (where p tends to zero), small perturbations of the HT have\nactions very close to that of the HT itself. Thus the action varies smoothly with the parameter for the first set\nof trajectories that cross the limit cycle as soon as they deviate from the HT. Trajectories that are reflected by\nthe limit cycle, on the other hand, acquire a finite additional value of action before they return to the vicinity of\nthe limit cycle. Consequently, the action plot exhibits a discontinuity every time the parameter passes through\nthe critical value corresponding to the HT: we infer there must be infinitely many discontinuity points in the\naction plot for a system with a limit cycle. This “hill-peak” structure does not depend on the explicit choice of\nparameterisation: it is a property that depends on the topology of the pattern of optimal trajectories. Study of\nthe action plot allows us to determine the initial condition corresponding to heteroclinic trajectories. Moreover,\nchoosing initial conditions corresponding to peaks, it is possible to investigate the trajectories in the central sheet\nof the fold. The value for the activation energy is obtained as the minimum of the action plot. The multiple,\nmutually enclosing, folds of the LM result in an infinite number of heteroclinic trajectories. This structure can\n0 2 4 60.4\n0.8\n1.2\n1.6\n Φ\n S\na\nb\nc\n1\n2\n34\n(a)\n1.55 1.65 1.75\n1.3\n1.4\n1.5\n1.6\n Φ\n S\n6 \n5 \n4 \n3 \n(b) \nFigure 2. (a) The action plot for escape in the IVDP system (η = 0.5). The plot shows a very complex structure made\nup of rounded “hills” and sharp “peaks”. Some of the discontinuity points are numbered (see text). The first peak is\nbounded at Φ1 = 1.73 and Φ2 = 1.55; inside the peak a second hill is visible with edges at Φ3 ∼ 1.70 and Φ4 = 1.60.\n(b) A zoom of the plot around this second hill shows how this structure repeats itself inside the hills: on the sides of the\nsecond hill other hills are visible. Considering for example the left-hand hill, we can observe a third hill with edges at\nΦ5 ∼ 1.56 and Φ6 ∼ 1.59. The same structure also exists in the right-hand peak.\nclearly be seen in the action plot. Thus the hill of low action is surrounded by regions of discontinuity (see\nFig. 2(a)) in the action function. They correspond to the set of trajectories reflected from the limit cycle by the\nHT with the initial condition φ1 (and φ1+pi). This set is bounded by a second HT with initial condition φ2 (and\nφ2 + pi). The same structure repeats itself for the set of initial conditions between φ2 and φ1: a hill bounded by\nheteroclinic trajectories with initial conditions φ3 and φ4 can be seen in Fig.2(b). Significant trajectories in the\nfirst hill are shown in Fig.1 on the right: the two heteroclinic paths a and c correspond to the edges of the first\nhill. Trajectory a provides the global minimum of the action. Trajectory b touches simultaneously the caustic\nand the cycle; it corresponds to the maximum of the first hill. The same structure repeats itself in each of the\nupper hills. We conclude that the action plot reveals a self-similar structure of mutually enclosed multiple folds\nof the LM, and it allows us to identify initial conditions corresponding to significant points of the structure,\nincluding those corresponding to the initial conditions of the heteroclinic trajectories. This enables us, at least\nin principle, to find all the HTs in the system.\nIn higher dimensional parameter spaces, the the picture is more complex. Nevertheless, the following general\nresults hold. Regions of significantly different action (peaks in the 1D case) are well separated from one and\nother by discontinuity surfaces which are connected in the parameter torus. The trajectory corresponding to the\nminimum action is the heteroclinic trajectory which realises the escape.\n3. NOISE-INDUCED ESCAPE IN THE INVERTED VAN DER POL OSCILLATOR\nAs our first application, we study the activation energy for noise-induced escape in the inverted Van der Pol\noscillator (6). The parameter η in (6) regulates both friction (which is related to the noise intensity via the\nfluctuation-dissipation theorem49) and the pumping of energy into the system. As a result, this systems displays\na nontrivial dependence of activation energy on the value of η. As mentioned above in the introduction, noise-\ninduced escape from the basin of attraction of the fixed point is governed by the properties of the most probable\nescape path, which is the heteroclinic trajectory of lowest action. Accordingly, the action plot can be used\nto find the activation energy of systems with limit cycles. The most probable escape path is simply the path\ncorresponding to the discontinuity point of lowest action in the action plot. The value of action at this point\ngives the activation energy. Other heteroclinic paths can also be found easily from the action plot. In Fig. 4\nthe theoretical dependence of S on η (full curve) is compared with Monte Carlo simulations (crosses) in the\nlimit of small noise intensity. The theoretical predictions and results of the simulations agree well over a wide\n0 0.2 0.4 0.6 0.8 1\n0\n0.2\n0.4\n0.6\n0.8\n1\n η\n ∆S\nFigure 3. The activation energy for escape in the inverted van der Pol oscillator as a function of η. The results of Monte\nCarlo simulations (crosses) are compared with the theory (full curve).\nrange of parameter values. The small-η-asymptotic behaviour of the activation energy corresponds to theoretical\npredictions based on adiabatic elimination of the fast variables. The value η = 0, corresponding to deterministic\nmotion of the system, may be approached only as a limit.\n4. NOISE-INDUCED ESCAPE IN THE HENON MAP\nConsider, as our second specific example, the noise-driven Henon map{\nxn+1 = a− x2n + byn + ξn\nyn+1 = xn.\n(18)\nHere xn and yn are the dynamical variables; a and b are parameters of the system and {ξn} is a set of uncorrelated\nwhite Gaussian noises of intensity ². The parameters are tuned for the system to exhibit a stable period-1 orbit\nand an attractor at infinity. The boundary of the basins of attraction is smooth, with a period-1 saddle orbit.\nFor this particular map the extended system (12) is\nxn+1 = a− x2n + byn + λxn\nyn+1 = xn\nλxn+1 = λyn\nλyn+1 =\nλxn+2xn+1λxn\nb\n. (19)\nThe activation process takes place in two parts: noise driven motion from the period-1 cycle to the boundary;\nand noise free motion along the boundary.\n5. CONCLUSIONS\nOur analysis shows how it is possible to use the action plot to simplify the solution of the boundary value\nproblems arising in the framework of non-equilibrium activated processes. In particular, our analysis proved to\nbe a convenient framework within which to study noise induced escape via an unstable limit cycle in planar\nsystems, and through the boundary of the basin of attraction for nonlinear maps. Besides the van der Pol and\nHenon systems described in this paper, we have successfully applied this technique to find the frequency and\namplitude dependence of the activation energy for a periodically driven overdamped Duffing oscillator, and to\nsolve the boundary value problem for the Holmes map in the case of smooth and fractal boundaries. We have\ndemonstrated that both the topological analysis of the global behaviour of the unstable LM of the fixed point,\nand the solution of the boundary value problem, can be substantially simplified by use of this representation. We\napplied the technique to find the heteroclinic trajectories of lowest action in the inverted Van der Pol oscillator as\n−3 −1 1 3−3\n−1\n1\n3\n x\n y\n1 4 7 10−2\n−1\n0\n1\n2\n n\n x\nFigure 4. Comparison of theory and experiments for the escape problem in the Henon map (parameters are a = 1.1 and\nb = −0.3). Theoretical MPEP (dashed) and numerical escape path (full line) are plotted in coordinate domain (left) and\niterations-coordinates domain (right). Theory and simulations perfectly agree. The escape takes place through the saddle\npoint in (−1.88;−1.88)\na function of the damping parameter η. The activation energy found in this way is in a good agreement with the\nresults of Monte Carlo simulations over a wide range of values of the parameter η. The method can in principle\nbe applied to locate all possible heteroclinic trajectories (i.e. including non-optimal ones). A slightly modified\nversion of the technique has been applied to successfully solve the boundary problem for the Henon map.\nThe path that minimises the action is in near perfect agreement with the results of the simulations. The\nsame technique has been applied for a range of maps, including the case of a period 4 initial orbit with fractal\nboundaries, the escape from the basin of attraction of a chaotic attractor50 or escape for the case of a chaotic\nsaddle embedded in the basin of attraction.24\nREFERENCES\n1. R. S. Maier and D. L. Stein, Phys. Rev. Lett. 77, 4860 (1996).\n2. V. N. Smelyanskiy, M. I. Dykman, and B. Golding, Phys. Rev. Lett. 82, 3193 (1999).\n3. J. Lehmann, P. Reimann, and P. Ha¨nggi, Phys. Rev. Lett. 84, 1639 (2000).\n4. M. I. Dykman, D. G. Luchinsky, R. Mannella and P.V.E. McClintock, Nuovo Cimento D 17, 661 (1995).\n5. M. O. Magnasco, Phys. Rev. Lett. 71, 1477 (1993).\n6. M. I. Dykman, H. Rabitz, V. N. Smelyanskiy and B. E. Vugmeister, Phys. Rev. Lett. 79, 1178 (1997).\n7. V. N. Smelyanskiy, M. I. Dykman, H. Rabitz, B. E. Vugmeister, S. L. Bernasek and A. B. Bocarsly, J.\nChem. Phys. 110, 11488 (1999).\n8. R. S. Maier and D. L. Stein, Phys. Rev. Lett. 86, 3942 (2001).\n9. M. B. Willemsen, M. P. van Exter and J. P. Woerdman, Phys.Rev.Lett 84 4337 (2000).\n10. M. B. Willemsen, M. P. van Exter and J. P. Woerdman, Phys.Rev.A 60 4105 (1999).\n11. M. P. van Exter, R. F. M. Hendriks and J. P. Woerdman, Phys. Rev. A. 57, 2028 (1998).\n12. M. P. van Exter, M. B. Willemsen and J. P. Woerdman, Phys. Rev. A. 58, 4191 (1998).\n13. H. P. Herzel and B. Pompe, Phys. Lett. A 122, 121 ((1987).\n14. H. Herzel, W. Ebeling and T. Schulmeister, Z. Naturforsch. 42a, 136 (1987).\n15. G. Meyer-Kress and H. Haken, J.Stat. Phys. 26, 149 (1981).\n16. P. Beale, Phys. Rev. A 40 3998 (1989).\n17. R. Graham, A. Hamm, T. Te´l, Phys. Rev. Lett. 66 3089 (1991).\n18. P. Grassberger, J.Phys. A 22 3283 (1989).\n19. V. A. Gaisyonok, E. V. Grigorieva and S. A. Kashchenko, Opt.Commun. 124 408 (1996).\n20. V. N. Chizhevsky, E. V. Grigorieva and S. A. Kashchenko, Opt.Commun. 133 189 (1997).\n21. V. N. Smelyanskiy et al., J. Chem. Phys. 110, 11488 (1999).\n22. J. Lehmann, P. Reimann, and P. Ha¨nggi, Phys. Rev. E 62, 6282 (2000).\n23. M. Freidlin and A. D. Wentzel, Random Perturbations in Dynamical Systems (Springer, New-York, 1984).\n24. S. Kraut and U. Feudel, Phys. Rev. E 67, 015204 (2003).\n25. R. Graham and T. Tel, Phys. Rev. Lett. 52, 9 (1984).\n26. R. Graham and T. Tel, Phys. Rev. A 31, 1109 (1985).\n27. R. Graham, in Noise in Nonlinear Dynamical Systems, edited by F. Moss and P. V. E. McClintock (Cam-\nbridge University Press, Cambridge, 1989), vol. 1, pp. 225–278.\n28. H. R. Jauslin, Physica A 144, 179 (1987).\n29. M. V. Day, Stochastics 20, 121 (1987).\n30. P. Talkner, Z. Phys. B 68, 201 (1987).\n31. R. S. Maier and D. L. Stein, J. Stat. Phys. 83, 291 (1996).\n32. R. S. Maier and D. L. Stein, SIAM J. Appl. Math. 57, 752 (1997).\n33. M. I. Dykman, D. G. Luchinsky, P. V. E. McClintock, and V. N. Smelyanskiy, Phys. Rev. Lett. 77, 5229\n(1996).\n34. V. N. Smelyanskiy, M. I. Dykman, H. Rabitz, and B. E. Vugmeister, Phys. Rev. Lett. 79, 3113 (1997).\n35. T. Naeh, B. KÃlosek, M. M. Matkovsky, and Z. Schuss, SIAM J. Appl. Math. 50, 595 (1990).\n36. M. I. Dykman, M. M. Millonas, and V. N. Smelyanskiy, Phys. Lett. A 195, 53 (1994).\n37. M. I. Dykman et al., Int. J. of Bifurcation and Chaos 8, 747 (1998).\n38. D. G. Luchinsky et al., Int. J. Bifurcation and Chaos 12, 583 (2002).\n39. P. Grassberger, Phys. Rev. A 38, 2066 (1988).\n40. D. Ludwig, SIAM Rev. 17, 605 (1975).\n41. L. D. Landau and E. Lifshits, Course of Theoretical Physiscs (Pergamon, Oxford, 1976), Vol. 1.\n42. V. Arnold, Mathematical Methods of Classical Mechanics (Springer-Verlag, Berlin, 1978).\n43. M. I. Dykman et al., Phys. Rev. Let. 68, 2718 (1992).\n44. D. G. Luchinsky, P. V. E. McClintock, and M. I. Dykman, Reports on Progress in Physics 61, 889 (1998).\n45. J. Hales, A. Zhukov, R. Roy, and M. I. Dykman, Phys. Rev. Lett. 85, 78 (2000).\n46. V. N. Smelyanskiy and M. I. Dykman, Phys. Rev. E 55, 2516 (1997).\n47. M. A. Lieberman and A. J. Lichtenberg, Regular and Chaotic Dynamics (Springer, New York, 1992).\n48. M. V. Berry, in Wave Propagation and Scattering, edited by B. J. Uscinski (Clarendon, Oxford, 1986), pp.\n11–35.\n49. L. D. Landau and E. M. Lifshits, Theoretical Physics: Statistical Physics (Nauka, Moscow, 1972).\n50. A. Silchenko, S. Beri, D. G. Luchinsky and P. V. E. McClintock, submitted to Phys. Rev. Lett.\n"}