{"doi":"10.1016\/j.cbpa.2007.01.210","coreId":"55542","oai":"oai:eprints.lincoln.ac.uk:1968","identifiers":["oai:eprints.lincoln.ac.uk:1968","10.1016\/j.cbpa.2007.01.210"],"title":"Flexural properties of the equine hoof wall","authors":["Goodman, A. M.","Haggis, Lindsay","Bonney, Heather"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-04","abstract":"The equine hoof wall is a hard keratinous structure which transmits forces generated when the hoof contacts the ground to the skeleton of the horse. During locomotion, the hoof capsule is known to yield under impact resulting in an inward curvature of the dorsal wall and expansion of the heels. However, whilst researchers have studied the tensile and compressive properties of the hoof wall, there is a lack of data on the flexural properties in different locations around the hoof capsule. \\ud\n\\ud\nIn this study the flexural properties and hydration status of the hoof wall was investigated, in two orthogonal directions, in different locations around the hoof capsule. The hoof was divided into three regions: the dorsal-most aspect (toe); the medial and lateral regions (quarters) and the heels caudally. Beams were cut both perpendicular and parallel to the axis of the tubules, termed transverse and longitudinal beams respectively. Differences in the mechanical properties were then investigated using three-point bending tests. \\ud\n\\ud\nThere were considerable differences in the mechanical properties around the hoof capsule; transverse beams from the toe were 81% stiffer and 28% stronger than those from the heels. This corresponded with differences in the hydration of the hoof wall; beams from the toe had a lower water content (24.1±0.25%) than those from the heels (28.3±0.37%). Differences in the flexural properties are thought to be largely a result of variation in the water content. Mechanical data are further discussed in relation to variation in the structure and loading of the hoof wall","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/55542.pdf","fullTextIdentifier":"http:\/\/eprints.lincoln.ac.uk\/1968\/1\/Goodman_AM%2C_Hoof_presentation_SEB_abstract.pdf","pdfHashValue":"e81cd68b3ef9e3ab71c4ad575b1c58b71498238e","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lincoln.ac.uk:1968<\/identifier><datestamp>\n      2013-04-30T08:14:40Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F46:6A6163735F46323030<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F44:6A6163735F44333232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lincoln.ac.uk\/1968\/<\/dc:relation><dc:title>\n        Flexural properties of the equine hoof wall<\/dc:title><dc:creator>\n        Goodman, A. M.<\/dc:creator><dc:creator>\n        Haggis, Lindsay<\/dc:creator><dc:creator>\n        Bonney, Heather<\/dc:creator><dc:subject>\n        F200 Materials Science<\/dc:subject><dc:subject>\n        D322 Animal Physiology<\/dc:subject><dc:description>\n        The equine hoof wall is a hard keratinous structure which transmits forces generated when the hoof contacts the ground to the skeleton of the horse. During locomotion, the hoof capsule is known to yield under impact resulting in an inward curvature of the dorsal wall and expansion of the heels. However, whilst researchers have studied the tensile and compressive properties of the hoof wall, there is a lack of data on the flexural properties in different locations around the hoof capsule. \\ud\n\\ud\nIn this study the flexural properties and hydration status of the hoof wall was investigated, in two orthogonal directions, in different locations around the hoof capsule. The hoof was divided into three regions: the dorsal-most aspect (toe); the medial and lateral regions (quarters) and the heels caudally. Beams were cut both perpendicular and parallel to the axis of the tubules, termed transverse and longitudinal beams respectively. Differences in the mechanical properties were then investigated using three-point bending tests. \\ud\n\\ud\nThere were considerable differences in the mechanical properties around the hoof capsule; transverse beams from the toe were 81% stiffer and 28% stronger than those from the heels. This corresponded with differences in the hydration of the hoof wall; beams from the toe had a lower water content (24.1±0.25%) than those from the heels (28.3±0.37%). Differences in the flexural properties are thought to be largely a result of variation in the water content. Mechanical data are further discussed in relation to variation in the structure and loading of the hoof wall.<\/dc:description><dc:publisher>\n        Elsevier<\/dc:publisher><dc:date>\n        2007-04<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/1968\/1\/Goodman_AM%2C_Hoof_presentation_SEB_abstract.pdf<\/dc:identifier><dc:identifier>\n          Goodman, A. M. and Haggis, Lindsay and Bonney, Heather  (2007) Flexural properties of the equine hoof wall.  Comparative Biochemistry and Physiology Part A: Molecular & Integrative Physiology, 146  (4).   Page S118.  ISSN 1095-6433  <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/j.cbpa.2007.01.210<\/dc:relation><dc:relation>\n        10.1016\/j.cbpa.2007.01.210<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lincoln.ac.uk\/1968\/","http:\/\/dx.doi.org\/10.1016\/j.cbpa.2007.01.210","10.1016\/j.cbpa.2007.01.210"],"year":2007,"topics":["F200 Materials Science","D322 Animal Physiology"],"subject":["Article","PeerReviewed"],"fullText":"S118 Abstracts \/ Comparative Biochemistry and Physiology, Part A 146 (2007) S107–S127the curved radius, and this difference was stronger in the\noutdoor activities vs. treadmill activities. We found greater\nstrain magnitudes and a greater range of strain magnitudes\nduring non-steady activity compared to treadmill activity. We\nalso found a negative correlation between strain magnitude and\nloading variability for any given footfall. This appears to be\nrelated to safety factor: more variability in loading pattern and\nmagnitude may be safe for behaviors with lower strains,\nwhereas the higher strain events are constrained to occur with\nmore predictable orientations to reduce the risk of bone failure.\ndoi:10.1016\/j.cbpa.2007.01.209A6.36\nFlexural properties of the equine hoof wall\nA. Goodman, H. Bonney, (University of Lincoln, United\nKingdom); L Haggis, (Writtle College, United Kingdom)\nThe equine hoof wall is a hard keratinous structure which\ntransmits forces generated when the hoof contacts the ground to\nthe skeleton of the horse. During locomotion, the hoof capsule\nis known to yield under impact resulting in an inward curvature\nof the dorsal wall and expansion of the heels. However, whilst\nresearchers have studied the tensile and compressive properties\nof the hoof wall, there is a lack of data on the flexural properties\nin different locations around the hoof capsule.\nIn this study the flexural properties and hydration status of the\nhoof wall was investigated, in two orthogonal directions, in\ndifferent locations around the hoof capsule. The hoof was\ndivided into three regions: the dorsal-most aspect (toe); the\nmedial and lateral regions (quarters) and the heels caudally.\nBeams were cut both perpendicular and parallel to the axis of\nthe tubules, termed transverse and longitudinal beams respec-\ntively. Differences in the mechanical properties were then\ninvestigated using three-point bending tests.\nThere were considerable differences in the mechanical proper-\nties around the hoof capsule; transverse beams from the toe\nwere 81% stiffer and 28% stronger than those from the heels.\nThis corresponded with differences in the hydration of the\nhoof wall; beams from the toe had a lower water content\n(24.1±0.25%) than those from the heels (28.3±0.37%).\nDifferences in the flexural properties are thought to be largely\na result of variation in the water content. Mechanical data are\nfurther discussed in relation to variation in the structure and\nloading of the hoof wall.\ndoi:10.1016\/j.cbpa.2007.01.210\nA6.37\nThe advantage of being downstream: How fish fins\ninfluence each other\nE. Standen, (Harvard University, United States)Fish oscillate their fins to produce torques that influence body\nposition. Recent kinematic and hydrodynamic studies show that\ndorsal and anal fins in trout appear to produce forces that\nbalance roll torques during swimming. Dorsal and anal fins\noscillate with a large phase lag, yet the lateral jets produced by\nthe fins have a small phase lag. This means fins release their jets\nat a similar time but at different points in their oscillation cycle.\nDifferences in incident flow experienced by each fin may\ncontribute to different jet release timings between fins. Trout\nhave two sets of ventral paired fins located upstream of the anal\nfin. The wake produced by these paired fins may influence flow\nsurrounding the anal fin. To date the kinematic or hydrodynamic\nfunction of the posterior paired pelvic fins has not been\ndescribed. In this study I use particle imaging velocimetry and\nhigh-speed cameras to visualize the wake structures and\nkinematics of the pelvic fins in brook trout (Salvelinus\nfontinalis). I use a horizontal light sheet to visualize the entire\nfish belly and describe how the pelvic fin wake interacts with\nthe anal fin during swimming. Trout oscillate their pelvic fins in\nphase with the tail beat cycle, one fin abducting while the\ncontralateral fin adducts. The contralateral oscillation of the\npelvic fins produces distinct lateral jets that appear to influence\nand contribute to the anal fin wake structure, possibly enhancing\nanal fin hydrodynamic function.\ndoi:10.1016\/j.cbpa.2007.01.211A6.38\nA forward dynamics model of swimming in larval fishJ. van Leeuwen, U. Muller, (Wageningen University, The\nNetherlands)\nThe larval stages of the more than 20000 species of teleost fish\nare remarkably similar. Early larval stages of the zebrafish use\nundulatory body motions to propel themselves through the\nwater. Larval zebrafish can swim at 70 body lengths\/s with a tail\nbeat frequency of about 100 Hz, a remarkable performance that\nrequires highly specialized muscle fibres. To understand the\nswimming mechanism of larval fish, we need to solve the\nmechanical interaction between tissues in the body as well as\nthe interaction between fish and water. A 3D forward dynamics\nmodel of the locomotion system of larval fish will be presented\nthat includes quantified descriptions of the muscular system and\nsimplified external fluid forces on the body (but including the\nessential of skin friction and pressures). The predictions of the\nmodel include the shape deformations of the body and forward\nmotion of the centre of mass during fast starts and cyclical\nswimming. The model was tested against actual motions of\nlarval fish that were recorded by high-speed video (typically\n1 kHz). Several essential features of larval swimming, such as\nturning angle during fast starts, body speed and travelling wave\nalong the body, are predicted remarkable well by the model.\ndoi:10.1016\/j.cbpa.2007.01.212\n"}