{"doi":"10.1016\/j.sna.2006.04.010","coreId":"138243","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/1853","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/1853","10.1016\/j.sna.2006.04.010"],"title":"A new flextensional piezoelectric ultrasonic motor - Design, fabrication and characterisation.","authors":["Leinvuo, Joni T.","Wilson, Stephen A.","Whatmore, Roger W.","Cain, Markys G."],"enrichments":{"references":[{"id":38074801,"title":"An estimation of load characteristics of an ultrasonic motor","authors":[],"date":"1991","doi":"10.1109\/58.84293","raw":"Nakamura, K., Kurosawa, M., Kurebayashi, H., and Ueha, S.,  An estimation of load characteristics of an ultrasonic motor  IEEE Transactions on Ultrasonics, Ferroelectrics and Frequency Control, vol.  38,  no. 5, pp. 481-485,  1991.  0885-3010.","cites":null},{"id":38074811,"title":"Analysis of the dynamics in microactuators using high-speed cine photomicrography","authors":[],"date":"2001","doi":"10.1109\/84.911102","raw":"Rembe, C., Tibken, B., and Hofer, E. P.,  Analysis of the dynamics in microactuators using high-speed cine photomicrography  Journal of microelectromechanical systems, IEEE, vol.  10, pp. 137-145, Mar, 2001.","cites":null},{"id":38074805,"title":"Composite piezoelectric transducer with truncated conical endcaps &quot;Cymbal&quot;","authors":[],"date":"1997","doi":"10.1109\/58.658312","raw":"Dogan, A., Uchino, K., and Newnham, E.,  Composite piezoelectric transducer with truncated conical endcaps &quot;Cymbal&quot;  IEEE Trans. Ultrason., Ferroelect., Freq. Contr., vol.  44,  no. 3, pp. 597-605,  May, 1997.","cites":null},{"id":38074796,"title":"Flextensional piezoelectric motors,","authors":[],"date":"2004","doi":"10.1080\/10584580490459369","raw":"Leinvuo, J.,  Flextensional piezoelectric motors, PhD thesis 2004. Cranfield University.","cites":null},{"id":38074807,"title":"Limited. Signal conditioning.","authors":[],"date":"2002","doi":null,"raw":"PICO Technology Limited. Signal conditioning.  2002.","cites":null},{"id":38074802,"title":"Longitudinal-bending mode micromotor using multilayer piezoelectric actuator Ultrasonics, Ferroelectrics and Frequency Control,","authors":[],"date":"2001","doi":"10.1109\/58.935724","raw":"Yao, K., Koc, B., and Uchino, K.,  Longitudinal-bending mode micromotor using multilayer piezoelectric actuator  Ultrasonics, Ferroelectrics and Frequency Control, IEEE Transactions on, vol.  48, pp. 1066-1071, Jun, 2001.","cites":null},{"id":38074814,"title":"Ltd. - Unilator Division, Piezoelectric ceramic products UK.","authors":[],"date":null,"doi":null,"raw":"Morgan Matroc Ltd. - Unilator Division,  Piezoelectric ceramic products  UK.","cites":null},{"id":38074813,"title":"Ltd. Phantom V4 .0 data sheet.","authors":[],"date":"2003","doi":null,"raw":"Photo-Sonics International Ltd. Phantom V4 .0 data sheet.  2003.","cites":null},{"id":38074812,"title":"Ltd., Imacon 468, User Guide Revision 3.10,","authors":[],"date":null,"doi":null,"raw":"DRS Hadland Ltd.,  Imacon 468, User Guide  Revision 3.10,  DRS Hadland Ltd. Herts, UK.","cites":null},{"id":38074815,"title":"Measurement of electric micromotor dynamics,&quot; Microstructures, Sensors","authors":[],"date":null,"doi":"10.1109\/16.123479","raw":"Bart, S. F., Mehregany, M., Tavrow, L. S., Lang, J. H., and Senturia, S. D., &quot;Measurement of electric micromotor dynamics,&quot; Microstructures, Sensors & Actuators, Dallas, TX, pp. 19-29. 10 Biography Joni Leinvuo was born in Helsinki, Finland, on April 1971. He received his M.S. in M.E. (Mechatronics) from Helsinki University of Technology in 2000 and PhD from Cranfield University, UK in 2005 related to piezoelectric motors and micro-motors. He currently holds a position at VTI Technologies, Finland as a Sensor Design Engineer related to micro electro mechanical pressure sensors. His research interest includes piezoelectric motors, micro-motors and pressure sensors. Stephen Wilson is a Senior Research Fellow in Advanced Materials at Cranfield University. He received a PhD at Cranfield University for his thesis on ‘Electric Field Structuring of Piezoelectric Composites’, which explored the use of moderately high electric-fields during processing to induce anisotropic properties in ferroelectric ceramic\/polymer composite materials. His study of materials processing parameters has been used to optimise the performance of piezoelectric sensor arrays for a real-time 3D ultrasound imaging system and his research interests are in piezoelectric micro-actuators, ultraprecision machining of ceramics and dielectrophoresis. He is module coordinator and lectures on Microsystems Design. Roger Whatmore graduated with his PhD from Cambridge University in 1977 and spent nearly twenty years working with the GEC Marconi (formerly Plessey) research laboratories at Caswell in the UK on the development and exploitation of ferroelectric materials in a wide range of electronic devices, particularly sensors and actuators, for which work he was awarded GEC’s Nelson Gold Medal in 1993.  In October 1994 he took the Royal Academy of Engineering Chair in Engineering Nanotechnology at Cranfield University, where he is developing the use of ferroelectrics in microsystems and nanotechnology, particularly for sensors and actuators integrated onto silicon.  He has published over 200 papers and 30 patents in the field.  He was awarded the degree of Doctor of Science by Cambridge University in 2001.  He is a Fellow of the Royal Academy of Engineering and a Fellow of the Institute of Materials, Minerals and Mining, who in June 2003 awarded him their Griffith Medal and Prize for Distinguished Work in Materials Science.","cites":null},{"id":38074800,"title":"Micro torque measurement based on the cable brake principle,&quot; Sensors,","authors":[],"date":"2002","doi":"10.1109\/icsens.2002.1037235","raw":"Brenner, W., Vujanic, A., Popovic, G., and Del Medico, O., &quot;Micro torque measurement based on the cable brake principle,&quot; Sensors, 2002. Proceedings of IEEE, pp. 936-941 vol.2,  2002.","cites":null},{"id":38074809,"title":"Operation Manual for Ultrasonic Motor (USR-60, USR-45, USR-30) Shinsei Corporation.","authors":[],"date":null,"doi":null,"raw":"Shinsei Corporation,  Operation Manual for Ultrasonic Motor (USR-60, USR-45, USR-30)  Shinsei Corporation. Tokyo, Japan.","cites":null},{"id":38074810,"title":"Operational characteristics of microfabricated electric motors,&quot; Solid-State Sensors and Actuators,","authors":[],"date":"1991","doi":"10.1109\/sensor.1991.149026","raw":"Tavrow, L. S., Bart, S. F., and Lang, J. H., &quot;Operational characteristics of microfabricated electric motors,&quot; Solid-State Sensors and Actuators, 1991. Digest of Technical Papers, TRANSDUCERS '91., 1991 International Conference on, pp. 877-881, 1991.","cites":null},{"id":38074803,"title":"Piezoelectric micromotor using a metal-ceramic composite structure Ultrasonics, Ferroelectrics and Frequency Control,","authors":[],"date":"2000","doi":"10.1109\/58.852065","raw":"Koc, B., Bouchilloux, P., and Uchino, K.,  Piezoelectric micromotor using a metal-ceramic composite structure  Ultrasonics, Ferroelectrics and Frequency Control, IEEE Transactions on, vol.  47, pp. 836-843, Jul, 2000.","cites":null},{"id":38074795,"title":"Piezoelectric ultrasonic motor using flextensional amplification of a disc radial mode with elastic fin drive,&quot;","authors":[],"date":"1999","doi":null,"raw":"Rayner, P. J. and Whatmore, R. W., &quot;Piezoelectric ultrasonic motor using flextensional amplification of a disc radial mode with elastic fin drive,&quot; Proc. 9th USJapan Seminar on Dielectric and Piezoelectric Ceramics, Okinawa, Japan, pp. 151-154, 1999.","cites":null},{"id":38074794,"title":"Piezoelectric ultrasonic motors and micromotors","authors":[],"date":"2000","doi":null,"raw":"Rayner, P.,  Piezoelectric ultrasonic motors and micromotors 2000. PhD Thesis, Cranfield Univ.","cites":null},{"id":38074799,"title":"Principles of torque measurements for rotating microsystems,&quot;","authors":[],"date":"1999","doi":"10.1007\/978-3-7091-2508-3_82","raw":"Brenner, W., Haddad, G., Popovic, A., Vujanic, A., Chatzitheodoridis, E., Duffait, R., and Wurmsdobler, P., &quot;Principles of torque measurements for rotating microsystems,&quot; Advanced Manufacturing Systems and Technology, CISM Cources and Lectures, pp. 721-728,  1999.","cites":null},{"id":38074804,"title":"The &quot;Cymbal&quot; electromechanical actuator,&quot;","authors":[],"date":"1996","doi":"10.1109\/isaf.1996.602737","raw":"Dogan, A., Fernandez, J. F., Uchino, K., and Newnham, R. E., &quot;The &quot;Cymbal&quot; electromechanical actuator,&quot; IEEE Ultrason. Symp. Proc., East Bruswick, NJ, pp. 213-216,  1996.","cites":null},{"id":38074808,"title":"The Measurement and Automation catalog","authors":[],"date":"2001","doi":null,"raw":"National Instruments,  The Measurement and Automation catalog 2001 2001. National Instruments. AUSTIN, TX.","cites":null},{"id":38074798,"title":"The measurement of minimotors and micromotors torque characteristic,&quot;","authors":[],"date":"1997","doi":"10.1109\/icmel.1997.632899","raw":"Brenner, W., Haddad, G., Popovic, G., Vujanic, A., Abraham, G., and Matzner, A., &quot;The measurement of minimotors and micromotors torque characteristic,&quot; Proc. IEEE Microelectronics, NIŠ, Yugoslavia, pp. 535-538,  1997.","cites":null},{"id":38074793,"title":"Uchino Piezoelectric actuators and ultrasonic motors,","authors":[],"date":"1997","doi":"10.1007\/978-1-4613-1463-9_9","raw":"K.  Uchino  Piezoelectric actuators and ultrasonic motors,  MA: Kluwer Academic, 1997","cites":null},{"id":38074806,"title":"Ultrasonic motor utilizing elastic fin rotor Jpn.","authors":[],"date":"1991","doi":"10.1109\/ultsym.1991.234249","raw":"Uchiki, T., Nakazawa, T., Nakamura, K., Kurosawa, M., and Ueha, S.,  Ultrasonic motor utilizing elastic fin rotor  Jpn. J. Appl. Phys., vol.  30, pp. 2289-2291,  Sep, 1991.","cites":null},{"id":38074797,"title":"Whatmore “Flextensional Piezoelectric Motor using the Contour Mode of a Square Piezoelectric Plate”","authors":[],"date":"2004","doi":"10.1109\/tuffc.2004.1324396","raw":"J.T. Leinvuo, S.A. Wilson and R.W. Whatmore “Flextensional Piezoelectric Motor using the Contour Mode of a Square Piezoelectric Plate” IEEE Transactions on Ultrasonics, Ferroelectrics and Frequency Control 51 929-936 (2004)","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-01-08","abstract":"This paper presents the techniques used for the characterisation of a new type of standing-wave piezoelectric ultrasonic motor. The motor uses a metallic flextensional amplifier, or “cymbal”, to convert the radial mode vibrations of a piezoelectric ceramic disc into flexural oscillations, which are further converted to produce rotary actuation by means of an elastic fin friction drive. The motor operates on a single-phase electrical supply. A beryllium copper rotor design with three-fin configuration was adopted. The best stall torque, no load speed, transient time and efficiency for a 25 mm motor were 2 N mm, 680 rpm, 2 ms and 4.8%, respectively. The operational characteristics of the motor were evaluated by using two methods: one based on the pulley–brake principle and one on high-speed imaging. The results obtained from using these two techniques are contrasted and compared","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/138243.pdf","fullTextIdentifier":"http:\/\/hdl.handle.net\/1826\/1853","pdfHashValue":"c12a3f3c6781bdb1a9086dcfa68980cbb00525c0","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/1853<\/identifier><datestamp>2008-03-13T15:23:16Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>A new flextensional piezoelectric ultrasonic motor - Design, fabrication and characterisation.<\/dc:title><dc:creator>Leinvuo, Joni T.<\/dc:creator><dc:creator>Wilson, Stephen A.<\/dc:creator><dc:creator>Whatmore, Roger W.<\/dc:creator><dc:creator>Cain, Markys G.<\/dc:creator><dc:subject>Ultrasonic motor<\/dc:subject><dc:subject>Flextensional amplifier<\/dc:subject><dc:subject>Pulley-brake<\/dc:subject><dc:subject>High-speed imaging<\/dc:subject><dc:subject>Torque measurement<\/dc:subject><dc:description>This paper presents the techniques used for the characterisation of a new type of standing-wave piezoelectric ultrasonic motor. The motor uses a metallic flextensional amplifier, or “cymbal”, to convert the radial mode vibrations of a piezoelectric ceramic disc into flexural oscillations, which are further converted to produce rotary actuation by means of an elastic fin friction drive. The motor operates on a single-phase electrical supply. A beryllium copper rotor design with three-fin configuration was adopted. The best stall torque, no load speed, transient time and efficiency for a 25 mm motor were 2 N mm, 680 rpm, 2 ms and 4.8%, respectively. The operational characteristics of the motor were evaluated by using two methods: one based on the pulley–brake principle and one on high-speed imaging. The results obtained from using these two techniques are contrasted and compared.<\/dc:description><dc:publisher>Elsevier<\/dc:publisher><dc:date>2007-09-03T11:25:02Z<\/dc:date><dc:date>2007-09-03T11:25:02Z<\/dc:date><dc:date>2007-01-08<\/dc:date><dc:type>Postprint<\/dc:type><dc:format>826122 bytes<\/dc:format><dc:format>application\/pdf<\/dc:format><dc:identifier>J.T. Leinvuo, S.A. Wilson, R.W. Whatmore and M.G. Cain, A new flextensional piezoelectric ultrasonic motor - Design, fabrication and characterisation, Sensors and Actuators A: Physical, Volume 133, Issue 1, 8 January 2007, Pages 141-151.<\/dc:identifier><dc:identifier>0924-4247<\/dc:identifier><dc:identifier>http:\/\/hdl.handle.net\/1826\/1853<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.sna.2006.04.010<\/dc:identifier><dc:language>en<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0924-4247","0924-4247"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["Ultrasonic motor","Flextensional amplifier","Pulley-brake","High-speed imaging","Torque measurement"],"subject":["Postprint"],"fullText":" Published in: Sensors & Actuators: A. Physical \n \n \nManuscript Draft \n \n \nManuscript Number:  SNA-D-05-00620R1              \n \nTitle:  A new flextensional piezoelectric ultrasonic motor - design, fabrication and characterisation                           \n \nArticle Type:  Research Paper \n \nKeywords:  Ultrasonic motor, flextensional amplifier, pulley-brake, high-speed imaging, torque measurement \n \nCorresponding Author:  Dr. Joni Tapio Leinvuo, PhD \n \nCorresponding Author's Institution:  VTI Technologies Oy \n \nFirst Author:  Joni T Leinvuo \n \nOrder of Authors:  Joni T Leinvuo; Joni T Leinvuo; Stephen A Wilson; Roger W Whatmore; Markys G Cain \n \nAbstract:  This paper presents the techniques used for the characterization of a new type of standing-wave \npiezoelectric ultrasonic motor. The motor uses a metallic flextensional amplifier, or \"cymbal\", to convert the \nradial mode vibrations of a piezoelectric ceramic disc into flexural oscillations, which are further converted to \nproduce rotary actuation by means of an elastic-fin friction drive. The motor operates on a single-phase \nelectrical supply. A beryllium copper rotor design with three-fin configuration was adopted. The best stall \ntorque, no load speed, transient time and efficiency for a 25 mm motor were 2 Nmm, 680 r\/min, 2 ms and \n4.8 % respectively. The operational characteristics of the motor were evaluated by using two methods: one \nbased on the pulley brake principle and one on high-speed imaging.  The results obtained from using these \ntwo techniques are contrasted and compared. \nFig 13\nClick here to download high resolution image\nRevisions to paper  \n \nA new flextensional piezoelectric ultrasonic motor – design, fabrication and \ncharacterization \n \nPage 11: The definition of time constant modified. \n \nPage 12: Updated value for stall torque. Discussion about the bias force is removed. \n \nFig 13: Updated speed torque characteristics with a better fit \n \nPage 13: (Discussion and Conclusions) Some discussion added for the analysis of the the \ndifference between pulley brake and transient based torque measurement. \n* Revision Notes\/Letter\n \n \n \n1 \nA new flextensional piezoelectric ultrasonic motor – design, fabrication and \ncharacterisation \n \nJ.T. Leinvuo†, S.A. Wilson R.W. Whatmore and M. G. Cain* \nCranfield University, Cranfield, Bedford, MK43 0AL, UK \n \n \n†  Present address:  VTI Technologies Oy, Vantaa, Finland \n*  National Physical Laboratory, Teddington, Middlesex, UK \n \nAbstract \nThis paper presents the techniques used for the characterization of a new type of \nstanding-wave piezoelectric ultrasonic motor. The motor uses a metallic flextensional \namplifier, or “cymbal”, to convert the radial mode vibrations of a piezoelectric ceramic \ndisc into flexural oscillations, which are further converted to produce rotary actuation by \nmeans of an elastic-fin friction drive. The motor operates on a single-phase electrical \nsupply. A beryllium copper rotor design with three-fin configuration was adopted. The \nbest stall torque, no load speed, transient time and efficiency for a 25 mm motor were 2 \nNmm, 680 r\/min, 2 ms and 4.8 % respectively. The operational characteristics of the \nmotor were evaluated by using two methods: one based on the pulley brake principle and \none on high-speed imaging.  The results obtained from using these two techniques are \ncontrasted and compared. \n \nKey words: \nUltrasonic motor, flextensional amplifier, pulley-brake, high-speed imaging, torque \nmeasurement \nManuscript\n \n \n \n2 \n \n1 Introduction \nPiezoelectric ultrasonic motors [1] have a number of potential advantages.  They \nmaintain relatively high torque at relatively low speeds, without a reduction gear, and \nexhibit a self-locking feature when electric power is turned off because the driving \nmechanics use friction between the vibrating stator and the rotor.  They are light \ncompared with electromagnetic motors and their equivalent inertias are low. They neither \ncreate electromagnetic fields nor are they affected by them.  They also have many \nadvantages for applications in micro- electromechanical systems (MEMS) because, in \ncontrast with electromagnetic motors, their simple construction makes them well suited \nfor miniaturization and their overall efficiency is relatively insensitive to size.   \nThis paper is concerned with presenting and comparing two techniques for the \ncharacterisation of such motors, particularly with the assessment of their torque\/speed \ncharacteristics as a function of the bias force acting between the rotor and the stator.  In \nthis particular case, the characterisation techniques are applied to a new type of \npiezoelectric motor which combines a stator consisting of a flextensional amplifier driven \nby a flat piezoelectric plate with a rotor bearing three angled fins [2-6]. \nThe rotational speed of electric motors can be measured by using a rotary encoder to \nconvert pulse frequency to speed. It is important that an encoder does not have a large \ninternal friction, which could prevent the motor from rotating. The torque can be \nmeasured by the reactive force method where the force sensor is mounted to the stator \nand an external load is applied to the rotor. The torque can also be measured by the \npulley-brake principle [7,8,9]. The system consists of one weight \/ force-sensor pair \nwhich are connected together by a thin string. The string is assembled around the rotor \nbearing and is allowed to slide around the smooth bearing surface. In operation, the \nweight generates a frictional load to the rotor and the torque is proportional to the \ndifference between the force-sensor reading and the external weight. The weight can also \nbe replaced by another force-sensor where the load is varied by changing the distance \nbetween the two force-sensors. A dual force-sensor arrangement has been demonstrated \nwith a resolution of 1 µNm between 0-40 µNm [7]. \nIn contrast with the above, a high speed imaging technique can be employed to measure \nthe mechanical transient characteristics of the rotor. Based on a knowledge of the \nmoment of inertia of the rotating parts (the rotor and encoder) the acceleration \ncharacteristics of the torque can be calculated.  Torque evaluation based on the \nmeasurement of transient characteristics using an optical encoder has previously been \nreported in [10,11,12] for rotary type ultrasonic motors. \nIn summary, there are contact based methods to measure torque characteristics and non-\ncontact methods to measure speed (i.e. rotary encoder) of the electric motors. This paper \nis focused on a comparison of these two methods for the operational characterization of a \nflextensional piezoelectric motor using: 1) pulley brake torque measurement and 2) high \nspeed imaging.  \nThe study reported here deals with a standing wave type motor of very simple design, \nwhich is shown in Fig. 1. The resonating structure combines the radial mode vibrations of \na piezoelectric ceramic disc with a metallic flextensional amplifier (i.e. cymbal [13,14]) \nto turn the radial vibrations (in x-y plane) into a “vertical” motion in magnitude of ∆z \n \n \n \n3 \nperpendicular to the plane of the disc. The magnitude of radial vibration is described with \nthe dimensions x(I) in extraction and x(III) in contraction of a piezoelectric ceramic, \nrespectively. A rotor employs an elastic fin. The operational principle of this has been \ndescribed previously in [15].  The combination of these two operational principles into a \nworking motor has been described in detail previously [2-6] and will not be discussed \nfurther here. \n \n \nFig. 1. Schematic diagram of the flextensional motor and the mechanics of the \nelastic fin structure. \n \nThe cymbal operates both as a mode conversion element and displacement amplifier. In \nthis way, the relatively high force generated by the PZT element can be better matched \nfor motor use. A motor of this type that uses a double cymbal arrangement with a circular \ndisc PZT driver has been demonstrated in previous work [2-4]. The motor design \ndescribed here is simpler, since the structure is single sided and better matched to MEMS \nmanufacturing processes.  In previous work [6], we have described the fabrication and \ncharacterisation of a single-sided flextensional-drive motor using a square ceramic driver \nplate.  In this paper we will, by contrast, describe the use of a ceramic disc as a driver. \n \n2 Motor Design and Fabrication \nIn practice, the motor is attached at the plate’s centre point to allow free radial movement \nof the PZT driver. A spring load (bias force) is applied to press the fins into contact with \nthe cymbal, and some wobbling is allowed at the rotor to ensure even three-point contact. \nThe motor operates with a single-phase electrical supply. This gives some advantages of \nsimplicity when compared with the complicated multi-phase drives frequently used with \nthe travelling-wave motors. The motor is unidirectional, although by inverting the fins \nangle (i.e. θ to -θ, see Fig 2), the direction will change. Two-way operation could perhaps \nbe achieved by a double fin configuration where two sets of fins are located in the \ndifferent radii [4]. \nIn operation, the vertical displacement of the cymbal surface is in direct relation to the \nradial displacement of the cymbal’s contact ring. The relevant parameters to the motor \ndesign are defined in Fig 2. In this design, θ is the angle of the fin and rr the rotor\/stator \ncontact radius. l and tr are the length and the thickness of the fin respectively.  \n \n \nFig. 2. Schematic diagram of the disc type of flextensional motor construction (dpzt = \n25 mm, ts = 2 mm, tc = 0.45 mm, α = 38º, θ = 38º, rr = 5 mm, tr = 0.5 mm, l = 1.5 mm, \ndb = 8 mm, dr = 12 mm de = 32 mm, tb = 1 mm). \n \nThe stator was constructed from PC-8 material (Morgan Electroceramics), dpzt = 25 mm \nand tpzt = 2 mm [25].  The amplifier element was made from 0.45 mm thick beryllium \ncopper foil (Cu98\/Be2) using a pressing tool. These two parts were then bonded together \n \n \n \n4 \nwith electrically conductive epoxy (CircuitWorks® CW2400) in order to provide \nelectrical connection between the cymbal and PZT. In practice, the parts were held \ntogether at a temperature of 40ºC for several hours and cooled down before testing. In \naddition, electric wires were bonded to the cymbal and PZT with the same conductive \nepoxy. The top surface of the device mount was bonded with the Loctite® 402 \ncyanoacrylate adhesive to the centre of the PZT disc. The lower part of the device mount \nwas connected to the external test jig. \n \nAll of the rotors were wet chemically etched from the same material as the amplifier. The \noutside diameter of the rotor is 12 mm (dr). Encoder disc diameter of 32 mm (de) was \nbonded onto the rotor. The ball bearing was bonded along the rotor’s centre axis using a \ncentring tool. The bonding work used Loctite® 402 cyanoacrylate. Fins were bent to \nangle θ = 38º under a video microscope using a bending tool with a resolution of ±1º.  \n3 Test set-up \nMotor performance data is collected using a mechanical test rig.  A diagram of this is \nshown Fig 3 while Fig 4 shows a photograph of the complete unit.  This is designed to \nallow continuous measurement of the output torque and speed. The motor is mounted \nbetween the electrically isolated stand and bushing both made of PTFE (i.e. Teflon). The \nadjustment screw sets the bias force.  The torque is monitored using a pulley-brake \nmethod and speed by an integrated rotary encoder. All sensor values are interfaced to a \nPC for data analysis. The motor is controlled from a separate PZT driver. The basic \nschematic of the electrical interfacing is represented in Fig 5 and discussed in detail \nbelow. The measurement data was collected with a program written in Labview®. \n \n \nFig. 3.  Test set-up. \n \n \n \n \n \n \n \n \n \n \n \n \nFig. 4. Speed torque characterization set-up. Torque measurement sensors Force 2 \nand 3 are connected together by a nylon string at both sides of the motor. \n \n \n \n \n \n5 \n \nFig. 5. Electrical interfacing of the PC based speed torque measurement system. (R1 \n= 330.1 kΩ, R2 = 150.3 kΩ, R3 = 12.0 Ω, Riso = 27 Ω). \n \n3.1 Pulley brake torque measurement \nA pulley-brake technique was employed for torque measurements. In this method, the \nload is measured by using a sliding nylon string (Perlon, Bayer, Kamasan Ø0.16 mm) \nwound once around the rotor bearing with both ends attached to force sensors (Force 2 \nand 3) as is shown diagrammatically in Fig. 6 and illustrated in the photograph in Fig. 4. \nThe sensors are from Omega Engineering (LCL-113G [16]). Sensors include strain \ngauges on the top of the beryllium copper flexure. When the rotation commences against \nthe frictional force (Fµ), this adds tension to one side of the line (Force 2) and reduces it \nat the other (Force 3). The torque of the motor can be represented by Tm [Nm] = (Force 2 \n[N] - Force 3 [N]) rb [m] = Fµ rb, where rb is the radius of bearing (rb = db \/ 2, Fig. 2). In \npractice, tension in the string is adjusted by moving the sensor Force 2. The adjusted pre-\ntension is indicated by zero (0). When the rotor rotates as indicated in Fig. 6, the Force 2 \ntends to decrease (-) while the Force 3 increases (+). \n \n \n \nFig. 6. Pulley-brake torque measurement using two flexure force sensors. \n3.2 Bias force measurement \nA similar sensor that was used in torque measurement is used to monitor the bias force \nbetween rotor and stator (LCL-816G). The basic schematic of the sensors is shown in \nFig.7. The other end of the sensor is mounted onto the metal frame of the test set-up and \nthe moving part of the beam to the sliding part made of PTFE (i.e. Teflon). It is important \nto notice that the operation of the bending beam force sensors requires double bending in \nthe beam (this applies also for torque measurement set-up). The first bending from the \nleft has compression on the top surface and second bending tension as in shown in Fig. 7.  \n \nSince the measured voltages from the sensors are relatively small (~20 mV) compared to \nthe actuation voltages (50 Vrms), noise protection for signals was provided. In order to \nincrease signal-to-noise levels, signals were amplified 24 times with CM015 signal \nconditioning modules attached to a signal-conditioning adapter CM001 [17]. Amplified \nsignals were further connected to the interfacing module SCB-68, where signals were \ndirected to the A\/D card (PCI-6023E [18]) using a differential connection.  \n \n \n \nFig. 7. Bias force measurement set-up. \n \n \n \n \n6 \nForce sensors (Force 1, 2 and 3) were calibrated using a spring balance and free weights. \nThe ratio between the load in grams [g] and sensor output [mV] are kForce 1 = 0.4564 \n[mV\/g], kForce 2 = -4.9524 mV\/g and kForce 3 = 4.4714 mV\/g respectively. It should be \nnoted that the reading of Force 2 is negative because of the direction of loading in the \nflexure. Bending in the other direction provides positive readings. \n \n3.3 Speed measurement \nThere are several commercial systems that could potentially be used to measure the \nrotational speed of an electric motor. However, very few were found to be suitable for the \nflextensional piezoelectric motor. One of the most common methods with electro-\nmagnetic motors is to use a ready-made encoder, which provides digital pulse frequency \nas a function of rotational speed. However, one of the most severe problems with this \nmethod is the high starting torque mainly caused by the encoder bearings and sealing. \nBecause of the problems encountered with finding a suitable commercial apparatus, the \nspeed measurement was made by counting pulses from a fibre optic probe mounted on \nthe test set-up, which senses an integrated angular encoder on the shaft. The sensor (FU-\n20, FS-V11P [19]) can detect targets as small as 0.01 mm. Detected pulses (200 pulse \/ \nrevolution) are converted to rotational speed information using the high-speed counter of \nthe A\/D card (PCI-6023E [18]). The fibre optic probe is based on the light emitting diode \nand receiver. When the light barrier is blocked over certain intervals ∆t (as happens with \na rotating encoder disc) the result is a pulse frequency proportional to the rotational speed \n(N [rps] = (∆t [s] nholes)-1, where nholes is a number of features in one revolution). \n3.4 Electrical characterization \nIn order to measure the electrical energy supplied to the motor, it is necessary to measure \nan electric current, voltage and phase difference. The voltage Uin is evaluated by a \nvoltage divider (Fig. 5) since the input voltage range of the PC integrated digital scope \n(PCI-5102 [18]) employed is ± 50V. Measuring the voltage U3 (CHA1) over a resistor R3 \nmonitors the electric current Iin (equation (1)). Since the measured voltage U3 << Uin, it \ncan be ignored when evaluating Uin. The voltage U2 (i.e. CHA0) over the resistor R2 is \nmeasured using an oscilloscope, which measures a current I2. Now, the voltage taken by a \nmotor Uin can be calculated from R1, R2 and I2 (equation (2)).  The electric current can be \nevaluated from the Ohm’s law where U3 is a current measured across the resistor R3.  \n \n3\n3\nR\nU\nIin =  (1)  \n \nThe voltage between the two electrodes of the motor (Uin) can be calculated by an \nequation (2) \n \n2\n2\n2\n21221 )(\nR\nU\nI\nRRIUUU in\n=\n+=+=\n \n(2) \n \n \n \n \n7 \nWhen calculating the flextensional motor’s input power under sinusoidal excitation, it is \nimportant to apply power factor compensation cos(φ) in respect of the phase difference \nφ between the voltage and current to take account of the capacitive and inductive load \ncomponents. The power factor is calculated from the phase difference between the \nsignals at CHA0 and CHA1. Ploss defines the resistive power loss generated by the \nmeasurement electronics (Riso, R3) (see Fig. 5). The electrical power input (Pin – Ploss), \nmechanical power output (Pout) and efficiency (η) are defined with equation (3), where Tm \nis the torque of the motor [Nm] and ω the angular velocity [rad\/s]. Uin and Iin are RMS \nvoltage and current supplied to the motor. \n \n%100\n)()cos(\n[%] 2\n3 inisoinin\nm\nlossin\nout\nIRRIU\nT\nPP\nP\n+−\n=\n−\n= φ\nωη  (3) \n \n3.5 PZT driver \nThe motor is operated by SHINSEI USR-45 drive [20]. This driving unit generates a high \nvoltage (100 Vrms) and current (1.2 A) square wave up to 56 kHz. The frequency can be \ncontrolled manually with a potentiometer. This unit requires a single 12 VDC high \ncurrent power supply. \n \n4 Operational characteristics of the flextensional motor \n(pulley brake torque measurement) \nOperational characteristics of the flextensional motor were logged by varying the torque \non the rotor and by measuring the rotational speed. Current, voltage and phase angle were \nrecorded simultaneously. Columns in the recorded text file present measured data in a 20s \ntime period (rotational speed [rpm], Force 1 [V], Force 2 [V], Force 3 [V], fV [kHz], fI \n[kHz], input voltage across the R2 [Vrms] and input current across the R3 [Vrms]. Once all \ndata were collected to the text file, it was converted, and filtered and the responses \nplotted using MATLAB®. The force, voltage and current measurements were filtered \nusing averaging. The result of the speed measurement was filtered using a median filter \nalgorithm over the measured values.  \n \nFig. 8 represents the operational characteristics of the flextensional motor at 56 kHz. The \ndriving conditions were cos(φ) = 0.3, Uin = 78 Vrms, Iin = 57 mArms and Force 1 = 3600 \nmN. The graph indicates that maximum speed is achieved at close to no load conditions \n(680 rpm) and the stall torque at zero speed (~1.94 Nmm). The variation in power input \nvalues is practically stable with 37 mW variations, only 3 % of the average values. The \nachieved maximum efficiency is 4.8 %. Every point in the graph is a result of the \nmeasurements taken at 20s time intervals. In practice, the phase angle φ was measured \nseparately to the speed-torque measurements, but under the same driving conditions. \n \n \nFig. 8. Operational characteristics of the flextensional motor. \n \n \n \n8 \n \n5 Test set-up in acceleration measurements \nPreviously it has been demonstrated that once acceleration is defined, it is possible to \ncalculate the mechanical torque of the motor when the moment of inertia is known [10]. \nOne of the most common methods to measure acceleration is to use a ready-made \nencoder with a wide enough bandwidth. This method has previously been demonstrated \nfor example in [11] and [12]. Another way to measure transient characteristics is to use \nstroboscopic light in conjunction with a standard CCD camera as demonstrated in [21] \nand [26]. Here an alternative way to measure flextensional motor transient characteristics \nusing a high-speed camera will be described. A similar camera has, for example, been \nused in the analysis of transient characteristics of a microturbine [22].  \n \nThe same flextensional motor and test set-up is employed as presented before but with \nadditional triggering electronics. A basic schematic of the electrical interfacing is shown \nin Fig. 9.  \n \n \nFig. 9. Layout of the electrical interfacing in the acceleration measurements (Rt = \n3.3 Ω).  \n \n5.1 High speed camera (Imacon 468) \nThe high-speed imaging was carried out with an Imacon 468 imager. The camera takes \npictures at rates from 1000 fps (frames per second) up to 100 million fps, but only \ncaptures 8 pictures. The pixel resolution is 576(H) and 385(V), one pixel is 22 µm square \n[23]. Each picture can be individually set so that the exposure of each channel and the \ninter-frame time between each channel can be completely independent of each other. \nImage intensifiers are built into the camera in order to allow gating of framing speeds \nthus the camera is relatively sensitive to light. Triggering is via a TTL signal (50Ω or \n1kΩ, 2V to 25V positive or negative edges). A 266 MHz computer running Windows 95 \ncontrols the system. \n \nThe basic layout of the imaging arrangement is represented in Fig. 10. The zoom lens \n(Leica Monozoom® 7) was attached to the Imacon 468 using a special fitting. The top \nview of the encoder disc was formed via a plastic mirror attached to the test jig tilted at \n45º to the camera’s imaging axis. The ruler was attached to the test jig in order to get a \nreference measurement for the obtained images. The double flashlights were used in \nparallel in both side of the optics. Also, a single halogen light was attached on the side of \nthe optics in order to adjust focus and magnification before the imaging. \n \n \n \n \n \n9 \nFig. 10. Close up of the measurement set-up. The motor is located between the force \nsensor and the height adjustable stand. The image of the encoder’s top surface is \nformed via use of the tilted mirror. The ruler is used as a spatial reference.  \n \n5.2 Electrical interfacing \nThe electrical interfacing is represented in Fig 9. The motor was operated by a SHINSEI \nHV (i.e. high voltage) square wave driver. The supply voltage of the drive was 8.2 VDC, \nwhich estimates Uin = 75 Vrms (i.e. the same as with the pulley-brake method). In \ncomparison, the measured output voltage of the SHINSEI drive was 109 Vrms with 12 \nVDC input (VS). The driving frequency was 56 kHz. Three resistors, each of 10 Ω (Rt = \n10 Ω \/ 3), were connected in parallel as a current trigger. Once the driving unit is turned \non, the current rises in the input stage and this can be monitored via the A\/D card. A \nLabview® based program was set up to trigger the imaging. By adjusting the triggering \nlevel (i.e. voltage amplitude) in software, it was possible to vary the time constant \nbetween motor start and imaging. The triggering was conducted by a digital output \n(DOUT, TTL-level) from the A\/D card. The fibre optic sensor was used to derive a speed \nreference by monitoring a single black dot on the encoder disc. The pulse frequency (i.e. \nrotational speed) was monitored visually from the FLUKE ScopeMeter® 123.  \n \n5.3 Recording the rotor’s transient response \nSeveral sets of images were captured in order to track the rotor’s transient behaviour. A \nsample set of images is represented in Fig. 11. The sequence of images, time delay \nbetween adjacent frames and the exposure times are represented in Table 1, respectively. \nExposure times had to be increased as a function of image numbers because a single flash \nwas generated at the beginning of the imaging.  \n \n \nFig. 11. Images taken from an encoder disc during the acceleration. Numbers 1-8 \nindicate the frame order.  \n \n \n \n \n \n \n \nTable 1. Sequence of images (1-8), time of delay between frames and the time of \nexposure. \n \n \n \n10 \nFrame\nnumber\nTime \ndelay\n[µs]\nExposure \ntime\n[µs]\n1 58 11\n2 637 25\n3 619 16\n4 676 49\n5 759 38\n6 776 50\n7 850 131\n8 895 169  \n \nAfter obtaining a set of images as represented in Fig. 11, the images were separated into \nthe individual files (0-7.jpg) using MSPaint® software. The co-ordinates of the reference \npoint (i.e. a point at a single line in a ruler) and black line in an encoder were recorded \nusing a ready built algorithm in the Phantom® image analysing software [24]. The length \nof the encoder feature (2.8 mm) was used as a calibration reference when converting \npixel values to mm. The effective pixel resolution was defined as 90 µm (7.696 - (-\n26.799) mm \/ (385 pixels)) in the vertical and (40.922 - (-10.772) mm \/ (576 pixels)) in \nthe horizontal directions. The number values in the brackets indicate the dimensions of \nthe imaging window.  \n \nThe collected points were represented in a Cartesian co-ordinate system (X,Y) as a \nfunction of the image numbers and time (Fig. 12). The measurement points in all images \n1-8 are defined in a local reference co-ordinate system (Xr,N,Yr,N, where N = 0...7). The \norigin of the local reference co-ordinate is based on a ruler in the same image. The \nassumption is that the ruler is not moving while imaging, and therefore can be used as a \nreference. Measurement points in a local co-ordinate system are converted to the \ncommon co-ordinates (Xr,Yr), which is equivalent to the Xr,0,Yr,0 (i.e. the local co-\nordinate of the first image). Now the linear approximation of the radial displacement (zN, \nwhere N = 1…7) can be defined. zN is being defined by the distance between two co-\nordinate points as zN = sqrt((Xr,N-Xr,N-1)2+(Yr,N-Yr,N-1)2)), where N=0…7. Since the frame \ndependent time tN is known, the velocity vN can be calculated as shown in equation (4) \n \n7...1,\n1\n=\n−\n=\n−\nN\ntt\nz\nv\nNN\nN\nN  \n(4) \n \nFig. 12. Measurement points in Cartesian co-ordinate system. X0,Y0 stands for the \nrotational centre, X,Y the global zero, Xr,N,Yr,N the local co-ordinate reference per \nframe and Xr,Yr the reference co-ordinate for the first frame.    \n \nWhen the radius of the measurement point is known (r = ~16 mm), the collected points \nare converted to an angular velocity (equation (5)).   \n \n \n \n \n11 \n7...1, == N\nr\nvN\nNω    \n(5) \n \nIt is now possible to evaluate the angular acceleration by taking the derivative of the \nangular speed (equation (6)). \n \n7...2,\n1\n1\n=\n−\n−\n=\n−\n− N\ntt NN\nNN\nN\nωω\nα   (6) \n \nNow the angular displacement θN can be developed from linear displacement zN by using \na cosine rule (equation (7)). \n \n( )\n7...1,\n2\n2\ncos 2\n22\n=\n\n\n\n−\n−= N\nr\nrz\na NNθ  \n(7) \n \nAs a result, the rotational speed can be represented as a function of time and rotational \nangle (Fig. 13).  \n \n5.4 Calculation of the torque based on the acceleration measurements \nThe torque of the piezoelectric motor can be defined using equation (8). \n \n2\n2\ndt\ndJ\ndt\ndJJT zzzzzzm\nθω\nα ===  (8) \n \nOnce the speed decreases from the no-load speed (ωmax) to zero, the torque increases \ntowards the stall torque (Tm, max) (equation (9)).  \n \n)\/1( max,max mm TT−=ωω  (9) \n \nThe solution for the rise curve can be represented with equation (10) after Tm has been \neliminated from the equations (8) and (9). τr represents the time constant and is given in \nequation (11).  \n \n( )]\/exp1[max rt τωω −−=  (10) \n \nmax,max \/ mzzr TJ ωτ =  (11) \n \nThe maximum torque Tm,max can be defined from the time constant τr when the moment \nof inertia (Jzz) is known. In order to define the speed\/torque characteristics, the angular \n \n \n \n12 \nspeed derivative dω\/dt must be calculated at every measurement point on the rise curve \nand substituted into equation (8). \n6 Evaluation of the torque of the flextensional motor \nbased on the acceleration measurements \nThe measured rotational speed is represented in Fig. 13 with fitted speed, acceleration \nand torque data. The rotational speed saturates to 13.5 s-1 after taking an average between \nthe frames F3 and F7. In comparison, the simultaneous fibre optic probe based \nmeasurement gave 12.8 s-1. The rise time and an angular displacement at F3 are 2 ms and \n7.5° respectively.  \n \nFor the practical motor the moment of inertia Jzz can be defined with equation (12), where \nmr = 0.41 g, me = 0.33, mb = 0.94 g, dr = 12 mm, de = 32 mm and db = 8 mm (see Fig. 2). \nThe mass of the bearing shell (i.e. the rotating component) is approximated as mb,shell = \nmb \/ 2. The moment of inertia is then approximately 5.5 * 10-8 kgm2.  \n \n884\n22 2222\n,\n,,,\nrreebb\nshellb\nrotorzzencoderzzbearingzzzz\ndmdmttddm\nJJJJ\n++\n\n\n\n−−\n=++=∑\n \n(12) \n \nThe stall torque can now be evaluated from equation (8), where the angular acceleration \nis a derivative of the equation (10). The best fit to the experimental data was obtained by \na time constant value τr = 0.98. The stall torque is calculated as 4.1 Nmm.  \n \nFig. 13. Flextensional motor’s rotational speed, acceleration and torque \ncharacteristics represented as a function of time. Labels F1 to F7 indicate the frame \nnumbers. \n \n7 Discussion and Conclusions \nThe aim of this paper was to present the mechanical and electrical characterization of the \nflextensional ultrasonic motor. The speed and torque characteristics were evaluated by \npulley-brake and fibre optic probe methods. The acceleration characteristics of the rotor \/ \nencoder combination were captured using a HADLAND Imacon high-speed camera. The \nmaximum torque was derived from the images. Electrical characteristics of the motor \nwere captured under steady state conditions using PC integrated electronics from \nNational Instruments. The fibre optic and high-speed camera based no-load speed \nmeasurements gave practically-equal results of 12.8 and 13.5 1\/s respectively. The torque \nmeasurement show similar results carried out by the acceleration based and pulley-brake \nprinciples. The achieved maximum torque using the pulley-brake principle was 1.94 \nNmm with a measured bias force of 3.6 N. In similar driving conditions the acceleration \nbased torque measurements gave Tstall = 4.1 Nmm. Possible reasons to explain the \ndifference could be the inaccuracy of the acceleration measurement or different loading \n \n \n \n13 \nconfiguration between these two measurement trials. It should be noted that the transient \nbased torque measurement is very sensitive to the fitting parameters. In order to improve \naccuracy of this principle the transient should be recorded multiple times and the result of \nmeasurement points integrated prior to fitting. Alternatively, more measurement points \nper a single transient could be used. Ideally, acceleration and pulley brake results should \nbe recorded simultaneously in order to fully explain the root cause of the different \nreadings. \n \nIn order to compare flextensional motor’s characteristics to other motors it is important to \nscale variables to the volume of PZT and voltage applied. The volume of PZT is \nfollowing: Vpzt = πrpzt2 tpzt = 981 mm3. The maximum stall torque achieved was 24 \nNµm\/Vrms. By scaling it as a respect of volume of PZT it becomes 25 Nnm\/Vrms\/mm3 (see \nFig. 9). In comparison, the previous study of a similar motor but with square plate stator \nshowed 14 Nnm\/Vrms\/mm3 [5]. The stall torque data compares with a thickness mode \nelastic fin motor presented by Uchiki et al, which achieved a maximum torque of 178 \nNµm\/Vrms but with much bigger PZT disc dimensions (dpzt = 30 mm, tpzt = 14 mm) [15]. \nThe Uchiki’s motor generates 18 Nnm\/Vrms\/mm3 whereas the flextensional motor 25 \nNnm\/Vrms\/mm3 indicating that the smaller volume of PZT used in the flextensional \nstructure is much better used in the generation of torque. The difference between the disc \nand square plate stators can partly be explained by the material difference, because the \ndisc was made of the hard PC8 material and the square plate the slightly softer PC4. The \nachieved efficiency of 4.8 % in this work compares well with the 0.6 % achieved in [15].  \n \n \n8 Acknowledgements \nThe authors gratefully acknowledge the partial financial support of the Engineering and \nPhysical Sciences Research Council (EPSRC grant number GR\/N 34017) and \nBAeSystems (Sowerby Research Center) in the development of the piezoelectric motor \nand the National Physical Laboratory in the development of the characterisation system.  \n \n \n \n14 \n9 References \n[1]  K. Uchino Piezoelectric actuators and ultrasonic motors,  MA: Kluwer \nAcademic, 1997 \n[2]  Rayner, P.,  Piezoelectric ultrasonic motors and micromotors 2000. PhD Thesis, \nCranfield Univ. \n[3]  Rayner, P. J. and Whatmore, R. W., \"Piezoelectric ultrasonic motor using \nflextensional amplification of a disc radial mode with elastic fin drive,\" Proc. 9th US-\nJapan Seminar on Dielectric and Piezoelectric Ceramics, Okinawa, Japan, pp. 151-154,  \n1999. \n[4]  Rayner, P. J. and Whatmore, R. W.,  Ultrasonic motor.  UK. Patent No. \n9910483.8 1999. \n[5]  Leinvuo, J.,  Flextensional piezoelectric motors, PhD thesis 2004. Cranfield \nUniversity. \n[6] J.T. Leinvuo, S.A. Wilson and R.W. Whatmore “Flextensional Piezoelectric \nMotor using the Contour Mode of a Square Piezoelectric Plate” IEEE Transactions on \nUltrasonics, Ferroelectrics and Frequency Control 51 929-936 (2004)  \n[7]  Brenner, W., Haddad, G., Popovic, G., Vujanic, A., Abraham, G., and Matzner, \nA., \"The measurement of minimotors and micromotors torque characteristic,\" Proc. IEEE \nMicroelectronics, NIŠ, Yugoslavia, pp. 535-538,  1997. \n[8]  Brenner, W., Haddad, G., Popovic, A., Vujanic, A., Chatzitheodoridis, E., Duffait, \nR., and Wurmsdobler, P., \"Principles of torque measurements for rotating microsystems,\" \nAdvanced Manufacturing Systems and Technology, CISM Cources and Lectures, pp. 721-\n728,  1999. \n[9]  Brenner, W., Vujanic, A., Popovic, G., and Del Medico, O., \"Micro torque \nmeasurement based on the cable brake principle,\" Sensors, 2002. Proceedings of IEEE, \npp. 936-941 vol.2,  2002. \n[10]  Nakamura, K., Kurosawa, M., Kurebayashi, H., and Ueha, S.,  An estimation of \nload characteristics of an ultrasonic motor  IEEE Transactions on Ultrasonics, \nFerroelectrics and Frequency Control, vol.  38,  no. 5, pp. 481-485,  1991.  0885-3010. \n[11]  Yao, K., Koc, B., and Uchino, K.,  Longitudinal-bending mode micromotor using \nmultilayer piezoelectric actuator  Ultrasonics, Ferroelectrics and Frequency Control, \nIEEE Transactions on, vol.  48, pp. 1066-1071, Jun, 2001. \n[12]  Koc, B., Bouchilloux, P., and Uchino, K.,  Piezoelectric micromotor using a \nmetal-ceramic composite structure  Ultrasonics, Ferroelectrics and Frequency Control, \nIEEE Transactions on, vol.  47, pp. 836-843, Jul, 2000. \n[13]  Dogan, A., Fernandez, J. F., Uchino, K., and Newnham, R. E., \"The \"Cymbal\" \nelectromechanical actuator,\" IEEE Ultrason. Symp. Proc., East Bruswick, NJ, pp. 213-\n216,  1996. \n[14]  Dogan, A., Uchino, K., and Newnham, E.,  Composite piezoelectric transducer \nwith truncated conical endcaps \"Cymbal\"  IEEE Trans. Ultrason., Ferroelect., Freq. \nContr., vol.  44,  no. 3, pp. 597-605,  May, 1997. \n[15]  Uchiki, T., Nakazawa, T., Nakamura, K., Kurosawa, M., and Ueha, S.,  Ultrasonic \nmotor utilizing elastic fin rotor  Jpn. J. Appl. Phys., vol.  30, pp. 2289-2291,  Sep, 1991. \n[16]  Omega Engineering Inc.,  OMEGA Complete Pressure, Strain, and Force \nMeasurement Handbook & Encyclopedia 2000. CT, USA. \n \n \n \n15 \n[17]  PICO Technology Limited. Signal conditioning.  2002. \n[18]  National Instruments,  The Measurement and Automation catalog 2001 2001. \nNational Instruments. AUSTIN, TX. \n[19]  Keyence (UK) Limited,  Sensors Vision Systems & Measuring Instruments  2001-\n2002,  no. G2001-UK-2-0700, 2000. Keyence Corporation. Japan. \n[20]  Shinsei Corporation,  Operation Manual for Ultrasonic Motor (USR-60, USR-45, \nUSR-30)  Shinsei Corporation. Tokyo, Japan. \n[21]  Tavrow, L. S., Bart, S. F., and Lang, J. H., \"Operational characteristics of \nmicrofabricated electric motors,\" Solid-State Sensors and Actuators, 1991. Digest of \nTechnical Papers, TRANSDUCERS '91., 1991 International Conference on, pp. 877-881,  \n1991. \n[22]  Rembe, C., Tibken, B., and Hofer, E. P.,  Analysis of the dynamics in \nmicroactuators using high-speed cine photomicrography  Journal of \nmicroelectromechanical systems, IEEE, vol.  10, pp. 137-145, Mar, 2001. \n[23]  DRS Hadland Ltd.,  Imacon 468, User Guide  Revision 3.10,  DRS Hadland Ltd. \nHerts, UK. \n[24]  Photo-Sonics International Ltd. Phantom V4 .0 data sheet.  2003. \n[25]  Morgan Matroc Ltd. - Unilator Division,  Piezoelectric ceramic products  UK. \n[26]  Bart, S. F., Mehregany, M., Tavrow, L. S., Lang, J. H., and Senturia, S. D., \n\"Measurement of electric micromotor dynamics,\" Microstructures, Sensors & Actuators, \nDallas, TX, pp. 19-29. \n \n \n \n \n16 \n10 Biography \n \nJoni Leinvuo was born in Helsinki, Finland, on April 1971. He received his M.S. in M.E. \n(Mechatronics) from Helsinki University of Technology in 2000 and PhD from Cranfield \nUniversity, UK in 2005 related to piezoelectric motors and micro-motors. He currently \nholds a position at VTI Technologies, Finland as a Sensor Design Engineer related to \nmicro electro mechanical pressure sensors. His research interest includes piezoelectric \nmotors, micro-motors and pressure sensors.   \n \n \n \nStephen Wilson is a Senior Research Fellow in Advanced Materials at Cranfield \nUniversity. He received a PhD at Cranfield University for his thesis on ‘Electric Field \nStructuring of Piezoelectric Composites’, which explored the use of moderately high \nelectric-fields during processing to induce anisotropic properties in ferroelectric \nceramic\/polymer composite materials. His study of materials processing parameters has \nbeen used to optimise the performance of piezoelectric sensor arrays for a real-time 3D \nultrasound imaging system and his research interests are in piezoelectric micro-actuators, \nultraprecision machining of ceramics and dielectrophoresis. He is module coordinator \nand lectures on Microsystems Design.  \n \n \n \n \n \n17 \n \nRoger Whatmore graduated with his PhD from Cambridge University in 1977 and spent \nnearly twenty years working with the GEC Marconi (formerly Plessey) research \nlaboratories at Caswell in the UK on the development and exploitation of ferroelectric \nmaterials in a wide range of electronic devices, particularly sensors and actuators, for \nwhich work he was awarded GEC’s Nelson Gold Medal in 1993.  In October 1994 he \ntook the Royal Academy of Engineering Chair in Engineering Nanotechnology at \nCranfield University, where he is developing the use of ferroelectrics in microsystems \nand nanotechnology, particularly for sensors and actuators integrated onto silicon.  He \nhas published over 200 papers and 30 patents in the field.  He was awarded the degree of \nDoctor of Science by Cambridge University in 2001.  He is a Fellow of the Royal \nAcademy of Engineering and a Fellow of the Institute of Materials, Minerals and Mining, \nwho in June 2003 awarded him their Griffith Medal and Prize for Distinguished Work in \nMaterials Science. \n \n \n \n \nFig 1.\nClick here to download high resolution image\nFig 2.\nClick here to download high resolution image\nFig 3.\nClick here to download high resolution image\nFig 4.\nClick here to download high resolution image\nFig 5.\nClick here to download high resolution image\nFig 6.\nClick here to download high resolution image\nFig 7.\nClick here to download high resolution image\nFig 8\nClick here to download high resolution image\nFig 9.\nClick here to download high resolution image\nFig 10.\nClick here to download high resolution image\nFig 11.\nClick here to download high resolution image\nFig 12.\nClick here to download high resolution image\nA new flextensional piezoelectric ultrasonic motor – design, fabrication and \ncharacterisation \n \nJ.T. Leinvuo†, S.A. Wilson R.W. Whatmore and M. G. Cain* \nCranfield University, Cranfield, Bedford, MK43 0AL, UK \n \n \n†  Present address:  VTI Technologies Oy, Vantaa, Finland \n*  National Physical Laboratory, Teddington, Middlesex, UK \n \nAbstract \nThis paper presents the techniques used for the characterization of a new type of \nstanding-wave piezoelectric ultrasonic motor. The motor uses a metallic flextensional \namplifier, or “cymbal”, to convert the radial mode vibrations of a piezoelectric ceramic \ndisc into flexural oscillations, which are further converted to produce rotary actuation by \nmeans of an elastic-fin friction drive. The motor operates on a single-phase electrical \nsupply. A beryllium copper rotor design with three-fin configuration was adopted. The \nbest stall torque, no load speed, transient time and efficiency for a 25 mm motor were 2 \nNmm, 680 r\/min, 2 ms and 4.8 % respectively. The operational characteristics of the \nmotor were evaluated by using two methods: one based on the pulley brake principle and \none on high-speed imaging.  The results obtained from using these two techniques are \ncontrasted and compared. \n \nKey words: \nUltrasonic motor, flextensional amplifier, pulley-brake, high-speed imaging, torque \nmeasurement \n \nCorresponding author: Joni Leinvuo, joni.leinvuo@vti.fi \n \nEditor: Prof. P.J. French \nElectronic Instrumentation Laboratory \nDelft University of Technology \nFaculty of Electrical Engineering, Mathematics and Computer Science \nDept. of Microelectronics \nMekelweg 4 \n2628 CD Delft \nThe Netherlands \n* Cover Letter\nA new flextensional piezoelectric ultrasonic motor – design, fabrication and \ncharacterisation \n \n \nList of figures \n \n \nFig. 1. Schematic diagram of the flextensional motor and the mechanics of the elastic \nfin structure. \n \nFig. 2. Schematic diagram of the disc type of flextensional motor construction (dpzt = \n25 mm, ts = 2 mm, tc = 0.45 mm, α = 38º, θ = 38º, rr = 5 mm, tr = 0.5 mm, l = 1.5 mm, db \n= 8 mm, dr = 12 mm de = 32 mm, tb = 1 mm). \n \nFig. 3.  Test set-up. \n \nFig. 4. Speed torque characterization set-up. Torque measurement sensors Force 2 \nand 3 are connected together by a nylon string at both sides of the motor. \n \nFig. 5. Electrical interfacing of the PC based speed torque measurement system. (R1 = \n330.1 kΩ, R2 = 150.3 kΩ, R3 = 12.0 Ω, Riso = 27 Ω). \n \nFig. 6. Pulley-brake torque measurement using two flexure force sensors. \n \nFig. 7. Bias force measurement set-up. \n \nFig. 8. Operational characteristics of the flextensional motor. \n \nFig. 9. Layout of the electrical interfacing in the acceleration measurements (Rt = 3.3 \nΩ).  \n \nFig. 10. Close up of the measurement set-up. The motor is located between the force \nsensor and the height adjustable stand. The image of the encoder’s top surface is \nformed via use of the tilted mirror. The ruler is used as a spatial reference.  \n \nFig. 11. Images taken from an encoder disc during the acceleration. Numbers 1-8 \nindicate the frame order.  \n \nFig. 12. Measurement points in Cartesian co-ordinate system. X0,Y0 stands for the \nrotational centre, X,Y the global zero, Xr,N,Yr,N the local co-ordinate reference per \nframe and Xr,Yr the reference co-ordinate for the first frame.   \n \nFig. 13. Flextensional motor’s rotational speed, acceleration and torque \ncharacteristics represented as a function of time. Labels F1 to F7 indicate the frame \nnumbers. \n \nList of figures\n \n"}