{"doi":"10.1016\/S0042-207X(00)00392-4","coreId":"113573","oai":"oai:epubs.cclrc.ac.uk:work\/34755","identifiers":["oai:epubs.cclrc.ac.uk:work\/34755","10.1016\/S0042-207X(00)00392-4"],"title":"Magnetic and electric field effect on the photoelectron emission from prototype LHC bean screen material.","authors":["Anashin VV","Collins IR","Dostovalov RV","Fedorov NV","Gröbner O","Krasnov AA","Malyshev OB","Pyata EE"],"enrichments":{"references":[],"documentType":{"type":0}},"contributors":[],"datePublished":"2000","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\noai:epubs.cclrc.ac.uk:work\/34755<\/identifier><datestamp>2006-02-13T11:43:31Z<\/datestamp><setSpec>work<\/setSpec><setSpec>work_fulltext<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:creator>\n    Anashin VV<\/dc:creator><dc:creator>\n    Collins IR<\/dc:creator><dc:creator>\n    Dostovalov RV<\/dc:creator><dc:creator>\n    Fedorov NV<\/dc:creator><dc:creator>\n    Gröbner O<\/dc:creator><dc:creator>\n    Krasnov AA<\/dc:creator><dc:creator>\n    Malyshev OB<\/dc:creator><dc:creator>\n    Pyata EE<\/dc:creator><dc:identifier>\n    http:\/\/purl.org\/net\/epubs\/work\/34755<\/dc:identifier><dc:identifier>\n    oai:epubs.cclrc.ac.uk:work\/34755<\/dc:identifier><dc:title>\n    Magnetic and electric field effect on the photoelectron emission from prototype LHC bean screen material.<\/dc:title><dc:type>\n    Text<\/dc:type><dc:type>\n    Journal Article<\/dc:type><dc:identifier>\n    Vacuum Vol. 60 iss. 1-2 pp.255-260 (2001)<\/dc:identifier><dc:relation>\n    urn:ISSN:0042-207X<\/dc:relation><dc:relation>\n    Vacuum<\/dc:relation><dc:relation>\n    http:\/\/purl.org\/net\/epubs\/series\/1305<\/dc:relation><dc:identifier>\n    doi:10.1016\/S0042-207X(00)00392-4<\/dc:identifier><dc:type>\n    Text<\/dc:type><dc:type>\n    Report<\/dc:type><dc:identifier>\n    LHC Project Report 373, CERN. - 6 p (2000)<\/dc:identifier><dc:relation>\n    <\/dc:relation><dc:identifier>\n    http:\/\/documents.cern.ch\/archive\/electronic\/cern\/preprints\/lhc\/lhc-project-report-373.pdf<\/dc:identifier><dc:relation>\n    Council for the Central Laboratory of the Research Councils (1994-2007)<\/dc:relation><dc:relation>\n    Accelerator Science and Technology Centre (2001- )<\/dc:relation><dc:relation>\n    ASTeC - Vacuum Science<\/dc:relation><dc:date>\n    2000<\/dc:date>\n<\/oai_dc:dc>\n<\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["urn:ISSN:0042-207X","Vacuum","http:\/\/purl.org\/net\/epubs\/series\/1305","","Council for the Central Laboratory of the Research Councils (1994-2007)","Accelerator Science and Technology Centre (2001- )","ASTeC - Vacuum Science"],"year":2000,"topics":[],"subject":["Text","Journal Article","Text","Report"],"fullText":"EUROPEAN ORGANIZATION FOR NUCLEAR RESEARCH\nEuropean Laboratory for Particle Physics\nMagnetic and Electric Field Effects on the Photoelectron\nEmission from Prototype LHC Beam Screen Material\nV.V. Anashin1, I.R. Collins2, R.V. Dostovalov1, N.V. Fedorov1, O. Gröbner2, A.A. Krasnov1,\nO.B. Malyshev1 and E. E. Pyata1\nThis paper describes experimental studies of the effect of a dipole field on the photoelectron emission and\non the photon reflectivities from LHC beam screen material. These studies were performed using\nsynchrotron radiation from the VEPP-2M storage ring at BINP (Novosibirsk). The particular surface\nroughness and geometry of the prototype LHC beam screen material requires dedicated experimental\nmeasurements. The experiments were performed under conditions close to those expected in the LHC. An\nimportant result obtained is that a dipole magnetic field attenuates the photoelectron emission from surface\nby more than two orders of magnitude with the magnetic field aligned parallel to the surface. The\nmeasurements of photon reflectivities, forward scattered and diffuse, and the azimuthal distribution of\nemitted photoelectrons from the same material are reported. These experimental results are important input\nfor the final design of the LHC beam screen.\n1 Members of the CERN-Russia Collaboration for the LHC; Budker Institute of Nuclear Physics, 630090 Novosibirsk, Russia\n2 CERN, LHC Division\n 6th European Vacuum Conference (EVC-6)\n7-12 December 1999, Villeurbanne, France\nGeneva, \nLarge Hadron Collider Project\nAdministrative Secretariat\nLHC Division\nCERN\nCH - 1211 Geneva 23\nSwitzerland\nLHC Project Report 373\nAbstract\n15 March 2000\nMAGNETIC AND ELECTRIC FIELD EFFECTS ON THE PHOTOELECTRON\nEMISSION FROM PROTOTYPE LHC BEAM SCREEN MATERIAL\nV.V. Anashina, I.R. Collinsb, R.V. Dostovalova, N.V. Fedorova, O. Gröbnerb, A.A. Krasnova,\nO.B. Malysheva and E. E. Pyataa.\naBudker Institute of Nuclear Physics, 630090 Novosibirsk, Russia\nbCERN, CH-1211 Geneva 23, Switzerland\nAbstract\nThis paper describes experimental studies of the effect of a dipole field on the photoelectron emission\nand on the photon reflectivities from LHC beam screen material. These studies were performed using\nsynchrotron radiation from the VEPP–2M storage ring at BINP (Novosibirsk). The particular surface\nroughness and geometry of the prototype LHC beam screen material requires dedicated experimental\nmeasurements. The experiments were performed under conditions close to those expected in the LHC.\nAn important result obtained is that a dipole magnetic field attenuates the photoelectron emission from\nsurface by more than two orders of magnitude with the magnetic field aligned parallel to the surface.\nThe measurements of photon reflectivities, forward scattered and diffuse, and the azimuthal\ndistribution of emitted photoelectrons from the same material are reported. These experimental results\nare important input for the final design of the LHC beam screen.\n1 INTRODUCTION\n The high flux of synchrotron radiation (SR) in the arc of the LHC, about 1017 photons\/(s m),\ncauses photoelectron emission from the walls of the beam screen. The emitted low energy electrons are\naccelerated in the field of the proton beam and may gain energies sufficient to create secondary\nelectrons on the subsequent interaction with the beam screen, resulting in the creation of an electron\ncloud. The repeated recurrence of this process can result in beam–induced multipacting [1].\nTheoretical simulations of the electron cloud in the LHC predict significant heat loads on the\ncryogenic system and electron stimulated gas desorption [2], [3], [4]. Experimental data are required as\ninput to such simulations in order to estimate the influence of an electron cloud on the LHC operation.\nA large portion of the LHC beam vacuum system is located inside the dipole magnets. Previous studies\nhave shown that the presence of the dipole field has a strong influence on the electron emission [5],\n[6]. In addition the heat loads in the dipole field are predicted to be strongly dependent on the\nazimuthal distribution of photons, determined by the photon reflectivity [2,3,4]. Experiments were\nperformed to investigate the influence of a dipole field on the electron emission of various samples\n2with different surface roughness [7] and to measure both the photon reflectivities and the effect of a\ndipole field from beam screen material with or without a saw–tooth surface structure [8]. These latter\nexperiments were performed with SR at grazing incidence in order to simulate closely the geometry in\nthe LHC. However, here the strength of the dipole field is significantly smaller than that in the LHC\n(0.3T versus 8.3T) and that the experiment was performed at room temperature and not at cryogenic\ntemperatures. The saw–tooth structure has been proposed as an efficient method of reducing the\nforward scattered photon reflection in the LHC and hence adsorbing most of the photons on the\nequatorial plane of the beam screen.\nThe results on the influence of the dipole field on the photoelectron yield, performed with normal\nincident photons, are presented in section 2. In section 3 the results of the photoelectron yield and\nphoton reflectivities from beam screen material with or without a saw–tooth surface structure,\nperformed with grazing incident photons, are presented. A brief discussion and conclusions are made\nin section 4.\n \n2 Experiments performed with normal incident photons\n2.1 Set-up and sample preparation\nThe experimental set-up shown in Figure 1 was built on the beamline P2 of VEPP-2M to study\nthe dependence of the photoelectron emission for photons at normal incidence as a function of a\ntransverse dipole field (up to 0.6 T). The sample was mounted on a sample holder, electrically isolated\nfrom the surrounding 46 mm diameter stainless steel chamber, and located in the centre of the\nmagnetic field. An all-metal valve was used to isolate the vacuum of the experimental chamber and\nthat of the beamline. The distance from the SR source to the collimator is about 11 m. The sample,\nwith vertical and horizontal dimensions of 44 mmu15 mm, respectively is mounted on the sample\nholder with its surface perpendicular to the incident SR. The photon flux from VEPP–2M is collimated\nresulting in a 35mmu10mm area of the sample to be illuminated, i.e. the edges of the sample are not\nirradiated.\nThe increased vertical size of the photon beam and the sample was chosen to avoid attenuating\nthe lower energy part of the spectrum. The sample was connected via an ammeter to a voltage supply\n(r300 V). Hence, the potential on the sample could be controlled whilst the electron current from, or\nto, the sample could be measured. The magnetic field of 0 to 0.6 T was aligned approximately parallel\nto the sample surface and in the vertical direction. The experimental chamber has a reduced cross-\nsection near the magnet centre to provide a stronger and more uniform magnetic field (see Figure 1).\n3                   \nFigure 1: The layout of the installation.\nSeven different samples were studied: a 316 series stainless steel, four made of copper co–\nlaminated stainless steel (the proposed material for the LHC beam screen), one machined from OFHC\ncopper and a stainless steel electroplated with gold. The samples were degreased and cleaned with\nbenzine and alcohol before installation.\nTable 1: Definition and description of the samples studied.\nSample name Sample description\nSS Stainless steel (316 series) sample made from a rolled sheet\nCu\/SS-1 Copper co–laminated stainless steel with the rolling direction perpendicular to the\nmagnetic field.\nCu\/SS-2 Copper co–laminated stainless steel with the rolling direction parallel to the\nmagnetic field.\nCu\/SS-3 Copper co–laminated stainless steel baked in air at 300• C for 5 mins. with the\nrolling direction parallel to the magnetic field.\nCu\/SS-4 Copper co–laminated stainless steel made with turned-in, long edges, i.e. 5 mm\nwide strips at the long edges were turned to 10–15q towards the SR with the rolling\ndirection parallel to the magnetic field.\nOFHC OFHC copper machined with longitudinal grooves aligned parallel to the magnetic\nfield. The grooves are 1 mm deep and 3 mm wide with a pitch of 3.2 mm.\nAu\/SS Stainless steel electroplated with 6-µm of gold\n42.2 Results\nIn all experiments, the photoelectron yield was a measured parameter. It was estimated as a\nratio of the measured output current Imes (i.e. electron flux from or to the sample) to photon flux *\u0006 .\nNeither the effect of the beamline collimation nor the sample workfunction is taken into account in the\nestimation of the photoelectron yield, contrary to that in other studies [5].\n*\u0098\n \n\u0006e\nmesIphotonelectrons ]\/[N ,\nwhere e is the electron charge.\nThe photoelectron yield was studied as a function of the different parameters:\n1. Potential on the sample (or bias) from –300 V to +300 V at fixed dipole field between 0 and  0.6 T;\n2. Magnetic field from 0 up to 0.6 T at a fixed potential between 0 and –300 V.\n3. Accumulated photon dose.\nTable 2: Measured photoelectron yields, N\u000f of the various samples. The photon spectrum critical\nenergy at which the measurements were made is also indicated.\nDipole field efficiency:\n\u000b \f \u000b \fT0T60 NN .Sample Critical Energy\nEc (eV)\nMeasurements with\nB = 0 T and U = –300 V:\nN (e–\/J) U = 0 U = -300V\nSS 259 0.016 0.023 0.028\nCu\/SS-1 253 0.015 0.010 0.029\nCu\/SS-2 194 0.014 0.021 0.030\nCu\/SS-3 112 0.014 0.018 0.015\nCu\/SS-4 20 0.014 0.020 0.060\nCu\/SS-4 319 0.018 0.010 0.080\nOFHC 102 0.008 0.024 0.013\nAu\/SS 356 0.027 0.028 0.042\nIn general, the photoelectron yield was found to increase rapidly for increasing negative bias,\ncorresponding to electrons leaving the sample, and saturates for a bias greater that 100V. It decreases\nrapidly with the dipole field when the magnetic field changes from 0 to about 0.1 to 0.2 T, then\ndecreases slowly, and is practically constant between 0.4 and 0.6 T. Since this suppression at low\nfields can be attributed to electrons being constrained to move along the field lines and hence return to\nthe strip from which they were emitted it is therefore thought unlikely that the yield will change for\n5higher magnetic fields. The dependence of the photoelectron emission on the photon dose was found in\ncomparing the data without the magnetic field at the beginning of the measurements. After a dose of\n1022 photons the photoelectron emission yield reduces by about a factor of 2. The main results are\nshown in Table 2.\n3 Experiments performed with grazing incident photons\n3.1 Set-up and sample preparation\nThe experimental set-up (shown in Figure 2), installed at the end of a second, short SR beam line,\nwas located at a distance of about 1 m from the SR source point where the effect of the vertical\ncollimation on the photon flux is negligible. Here the dimensions of the SR beam is defined by a set of\nhorizontal (Ch) and vertical (Cv) collimators, 2 mm and 10 mm respectively, on entering the\nexperimental system. The photon flux, through the collimators, was typically 1016 photons\/s.\n \nFigure 2: Set-up for measurements of the photon reflectivity and azimuthal photoelectron\ndistribution in a magnetic field.\n3.2 Results\nThe position of the photon beam with respect to the experimental system could be checked with\ntwo luminescent screens, (LD1) and (LD2). At the exit of the test system, a calorimeter (CAL) was\ninstalled to monitor the SR. This calorimeter was designed in such a way that it could either measure\n6the total SR power or the total photon flux derived from the photoelectron current produced on the\ncalorimeter. For the latter measurement the calorimeter was electrically biased with respect to the test\nchamber. A section of a prototype LHC beam screen, 34 cm in length, was cut into four strips: two\nrounded and two flat (see Figure 3). In a following experiment strip 1 was replaced with a flat strip of\nbeam screen material with a saw–tooth structure on its surface. A dipole magnet with a field of up to\n0.3 T was installed along the whole length of the vacuum chamber containing the strips. Strips 2 and 4\nwere perpendicular to magnetic field. The rounded strip 3 was opposite to strip 1. The whole\nexperimental system could be positioned either aligned straight or inclined at a given grazing angle\nwith respect to the axis of the photon beam. In the straight position, the SR beam traversed the test\nsystem and was incident on the end calorimeter, while in the inclined position, the photon beam was\nincident at an angle of about 10 mrad along strip 1 only reflected photons are able to reach the\ncalorimeter.\nFigure 3: ample configuration for experiments of the photon reflectivity and azimuthal\nphotoelectron distribution in a magnetic field.\nDuring a typical measurement, the SR beam was incident on strip 1. The remaining strips received\nonly reflected photons. Applying a negative bias in turn to each of the four strips while maintaining all\nothers at the common ground potential, the photoelectron current produced by photons on the\ncorresponding strip was measured. Assuming that the average photoelectric yield for the direct\nincident photons and for the reflected photons are not too different, it is possible to derive from the\nmeasured azimuthal distribution of the photoelectron signal the azimuthal distribution of the photons.\nThe measurements were performed for a bias voltage from 0 to 290 V and with the magnetic field of\nB = 0 to 0.3 T.\nA\nStrip 2\nStrip 4\nA\nStrip 1\nStrip 3\n7Forward scattered reflection is defined as a ratio of measured values on the calorimeter, by current\nor power, in the two positions:\n.\/\n;\/\ndirrefW\ndirrefe\nWWR\nIIR\n \n \nDiffuse photon reflectivity is defined as:\nYe\nIIIR 432dif\n\u0098*\u0098\n\u000e\u000e\n \n\u0006\nThe yield is defined per adsorbed photon as:\n\u000b \f\n\u000b \f*\u0010\n \n¦\n \n\u0006\ne\n4\n1i\ni\nR1\neI\nY ,\nwhere the currents Ii from strips were measured at a bias of –300 V.\nThe main results are shown in Table 3. The adsorbed photon flux is that which is not reflected and\nRdif\/(R1+Rdif) gives and indication of the importance of the diffusely reflected SR, with respect to the\ndirect irradiation, as a source of electrons in the vacuum chamber.\nTable 3: A summary of the measured reflectivities and photoelectron yields per absorbed\nphoton. The critical energy at which the measurements were made is also indicated.\nForward Scattered\nReflectionSample\nCritical\nEnergy\nEc (eV)\nRe (by\ncurrent)\nRW (by\npower)\nDiffuse\nReflectivity\nRdif\nPhoton\nAdsorption\nR1 dif1\ndif\nRR\nR\n\u000e\nY\n(electron\/\nphoton)\nSmooth\nsurface\n20 0.67 — 0.04 0.29 0.13 0.03\n49 0.035 — 0.22 0.74 0.23 0.049Saw–tooth\nsurface 246 0.026 0.03 0.185 0.79 0.19 0.063\nThe photoelectron current on strip 1 is attenuated by a factor of about 200 for the strip without\nsaw–tooth in the dipole field above 0.2 T and about a factor of 5 for the strip with saw–tooth. The\ndipole field does not affect the photoelectron current from strips 2 and 4, top and bottom.\n84 Discussion and Conclusions\nThe experiments with SR at normal incidence show that the different materials with the different\nsurfaces have about the same photoelectron yield. It is found that the photoelectron current as a\nfunction of dipole field is attenuated by a factor of 30 to 50 reaching a saturation value at 0.4 T.\nThe experiments performed at grazing incidence in a dipole field demonstrate that the electrons\nare constrained to move along the field lines, resulting in electrons emitted from strip 1 and strip 3 to\nreturn to the same strip from which they were created. In the case of the LHC these electrons interact\nweakly with the proton beam, gaining insufficient energy to cause multipacting or contribute a\nsignificant heat load [9]. On the other hand, photoelectrons from strips 2 and 4 (top and bottom) are\nnot attenuated by the presence of the dipole field and thus they interact with the proton beam and\ncontribute to the electron cloud.\nThe results presented here are important input to predict the behaviour of the electron cloud in the\ndipole fields of the LHC and to estimate electron stimulated gas desorption. The forward scattered\nreflectivity, as measured by the deposited power and by the photon flux, show significantly different\nresults for the smooth surface and for the saw–tooth surface. With respect to the electron-cloud effect\nin the LHC a low reflectivity is desirable since it will limit the photoelectron production to the region\nof the primary impact of the photons in the equitorial plane where electrons are efficiently attenuated\nby the strong vertical dipole field [10]. From this point of view, the saw–tooth surface is attractive for\nthe beam screen of the LHC.\nReferences\n                                               \n[1] Gröbner, O., CERN LHC Project Report 127 (1997).\n[2] Zimmermann, F., CERN LHC Project Report 95 (1997).\n[3] Brüning, O.S., CERN LHC Project Report 158 (1997), Brüning, O.S.,  CERN LHC Project Report\n190 (1997).\n[4] Furman, M.A.,  CERN LHC Project Report 180 (1997).\n[5] Baglin, V., Collins, I.R. and Gröbner, O., CERN LHC Project Report 206 (1998).\n[6] Anashin, V.V., Malyshev, O.B., Fedorov, N.V., Nazmov, V.P., Goldenberg, B.G., Collins, I.R. \nand Gröbner, O., CERN LHC Project Report 266 (1999).\n[7] Anashin, V.V., Dostovalov, R.V., Malyshev, O.B., Krasnov, A.A. and Pyata, E.E., CERN Vacuum\nTechnical Note 99-03 (1999).\n[8] Anashin, V.V., Malyshev, O.B., Fedorov, N.V.  and Krasnov, A.A., CERN Vacuum Technical\nNote 99–06 (1999).\n[9] Baglin, V., Collins, I.R., Gómez–Goñi, J., Gröbner, O., Henrist, B., Hilleret, N., Laurent, J-M.,\n Pivi, M., Cimino, R., Anashin, V.V., Dostovalov, R.V., Fedorov, N.V., Malyshev, O.B., Krasnov,\nA.A. and Pyata, E.E., presented at e+e– Factories’99, KEK in Tsukuba, Japan 21st –24th Sept. 1999.\n[10] Baglin, V., Bruning, O., Calder, R., Caspers, F., Collins, I.R., Gröbner, O., Hilleret, N., Laurent,\nJ-M., Morvillo, M., Pivi, M. and Ruggiero, F., EPAC-98, June 1998.\n"}