{"doi":"10.1152\/ajprenal.90500.2008","coreId":"195610","oai":"oai:lra.le.ac.uk:2381\/7711","identifiers":["oai:lra.le.ac.uk:2381\/7711","10.1152\/ajprenal.90500.2008"],"title":"C-peptide reverses TGF-β1-induced changes in renal proximal tubular cells: implications for treatment of diabetic nephropathy","authors":["Hills, Claire E.","Al-Rasheed, Nawal M.","Al-Rasheed, Nouf","Willars, Gary B.","Brunskill, Nigel J."],"enrichments":{"references":[],"documentType":{"type":null}},"contributors":[],"datePublished":"2009-03","abstract":"This paper was published as American Journal of Physiology - Renal Physiology, 2009, 296 (3), pp. F614-F621.  It is available from http:\/\/ajprenal.physiology.org\/cgi\/content\/abstract\/296\/3\/F614.  Doi: 10.1152\/ajprenal.90500.2008Metadata only entryThe crucial pathology underlying progressive chronic kidney disease in diabetes is tubulointerstitial fibrosis. Central to this process is epithelial-mesenchymal transformation (EMT) of proximal tubular epithelial cells driven by maladaptive transforming growth factor-β1 (TGF-β1) signaling. Novel signaling roles for C-peptide have recently been discovered with evidence emerging that C-peptide may mitigate microvascular complications of diabetes. We studied the potential for C-peptide to interrupt injurious TGF-β1 signaling pathways and thus block development of EMT in HK2 human kidney proximal tubular cells. Cells were incubated with TGF-β1 either alone or with C-peptide in low or high glucose. Changes in cell morphology, TGF-β1 receptor expression, vimentin, E-cadherin, and phosphorylated Smads were assessed. Luciferase reporters were used to assess Smad activity. The cytoskeleton was visualized by TRITC-phalloidin staining. The typical TGF-β1-stimulated, EMT-associated morphological alterations of proximal tubular cells, including increased vimentin expression, decreased E-cadherin expression, and cytoskeletal rearrangements, were prevented by C-peptide treatment. C-peptide also blocked TGF-β1-induced upregulation of expression of both type I and type II TGF-β1 receptors and attenuated TGF-β1-mediated Smad phosphorylation and Smad transcriptional activity. These effects of C-peptide were inhibited by pertussis toxin. The results demonstrate that C-peptide almost completely reversed the morphological changes in PT cells induced by TGF-β1 and suggest a role or C-peptide as a renoprotective agent in diabetic nephropathy","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"American Physiological Society","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/7711<\/identifier><datestamp>\n                2011-06-07T14:58:46Z<\/datestamp><setSpec>\n                com_2381_112<\/setSpec><setSpec>\n                com_2381_9550<\/setSpec><setSpec>\n                col_2381_113<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nC-peptide reverses TGF-β1-induced changes in renal proximal tubular cells: implications for treatment of diabetic nephropathy<\/dc:title><dc:creator>\nHills, Claire E.<\/dc:creator><dc:creator>\nAl-Rasheed, Nawal M.<\/dc:creator><dc:creator>\nAl-Rasheed, Nouf<\/dc:creator><dc:creator>\nWillars, Gary B.<\/dc:creator><dc:creator>\nBrunskill, Nigel J.<\/dc:creator><dc:description>\nThis paper was published as American Journal of Physiology - Renal Physiology, 2009, 296 (3), pp. F614-F621.  It is available from http:\/\/ajprenal.physiology.org\/cgi\/content\/abstract\/296\/3\/F614.  Doi: 10.1152\/ajprenal.90500.2008<\/dc:description><dc:description>\nMetadata only entry<\/dc:description><dc:description>\nThe crucial pathology underlying progressive chronic kidney disease in diabetes is tubulointerstitial fibrosis. Central to this process is epithelial-mesenchymal transformation (EMT) of proximal tubular epithelial cells driven by maladaptive transforming growth factor-β1 (TGF-β1) signaling. Novel signaling roles for C-peptide have recently been discovered with evidence emerging that C-peptide may mitigate microvascular complications of diabetes. We studied the potential for C-peptide to interrupt injurious TGF-β1 signaling pathways and thus block development of EMT in HK2 human kidney proximal tubular cells. Cells were incubated with TGF-β1 either alone or with C-peptide in low or high glucose. Changes in cell morphology, TGF-β1 receptor expression, vimentin, E-cadherin, and phosphorylated Smads were assessed. Luciferase reporters were used to assess Smad activity. The cytoskeleton was visualized by TRITC-phalloidin staining. The typical TGF-β1-stimulated, EMT-associated morphological alterations of proximal tubular cells, including increased vimentin expression, decreased E-cadherin expression, and cytoskeletal rearrangements, were prevented by C-peptide treatment. C-peptide also blocked TGF-β1-induced upregulation of expression of both type I and type II TGF-β1 receptors and attenuated TGF-β1-mediated Smad phosphorylation and Smad transcriptional activity. These effects of C-peptide were inhibited by pertussis toxin. The results demonstrate that C-peptide almost completely reversed the morphological changes in PT cells induced by TGF-β1 and suggest a role or C-peptide as a renoprotective agent in diabetic nephropathy.<\/dc:description><dc:date>\n2010-03-23T16:19:41Z<\/dc:date><dc:date>\n2010-03-23T16:19:41Z<\/dc:date><dc:date>\n2009-03<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nAmerican Journal of Physiology - Renal Physiology, 2009, 296 (3), pp. F614-F621.<\/dc:identifier><dc:identifier>\n0363-6127<\/dc:identifier><dc:identifier>\nhttp:\/\/dx.doi.org\/10.1152\/ajprenal.90500.2008<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/7711<\/dc:identifier><dc:language>\nen<\/dc:language><dc:format>\nMetadata<\/dc:format><dc:publisher>\nAmerican Physiological Society<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["0363-6127","issn:0363-6127"]}],"language":null,"relations":[],"year":2009,"topics":[],"subject":["Article"],"fullText":null}