{"doi":"10.1108\/09574091011042188","coreId":"139957","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/5088","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/5088","10.1108\/09574091011042188"],"title":"Inter-organisational costing approaches: the inhibiting factors","authors":["Bastl, Marko","Grubic, Tonci","Templar, Simon","Harrison, Alan","Fan, Ip-Shing"],"enrichments":{"references":[{"id":37963845,"title":"(2002b), “Strategic Cost Management in the Supply Chain: A Purchasing and Supply Management Perspective”","authors":[],"date":null,"doi":"10.1016\/j.pursup.2008.05.003","raw":"Ellram, L.M. (2002b), “Strategic Cost Management in the Supply Chain: A Purchasing and Supply Management Perspective” (pp. 16-18). CAPS Research.","cites":null},{"id":37963823,"title":"21 st Century Logistics: Making Supply Chain Integration a Reality, Council of Logistics Management,","authors":[],"date":"1999","doi":null,"raw":"Bowersox, D., Closs, D.J., Stank, T.P. (1999), 21 st Century Logistics: Making Supply Chain Integration a Reality, Council of Logistics Management, Oak Brook, IL Braithwaite, A. Samakh, E. (1998), “The Cost-to-Serve Method”, The International Journal of Logistics Management, Vol. 9, No. 1, pp. 66-84.","cites":null},{"id":37963857,"title":"A (2007), “The pervasive human resource picture in interdependent supply relationships”,","authors":[],"date":null,"doi":"10.1108\/01443570710714510","raw":"Koulikoff-Souviron, M., Harrison, A (2007), “The pervasive human resource picture in interdependent supply relationships”, International Journal of Operations & Production Management, Vol. 27 No. 1, pp. 8-27.","cites":null},{"id":37963838,"title":"A Survey of the adoption and use of target costing in Dutch firms”,","authors":[],"date":"2003","doi":"10.1016\/s0925-5273(02)00450-4","raw":"Dekker, H., Smidt, P. (2003), “A Survey of the adoption and use of target costing in Dutch firms”, International Journal of Production Economics, Vol. 84 No. 3, pp. 293-305.","cites":null},{"id":37963842,"title":"A taxonomy of total cost of ownership models”,","authors":[],"date":"1994","doi":"10.1007\/978-3-663-01582-6_34","raw":"Ellram, L.M. (1994), “A taxonomy of total cost of ownership models”, Journal of Business Logistics, Vol. 15 No. 1, pp. 171-191.","cites":null},{"id":37963902,"title":"Activity-based costing for logistics and marketing”,","authors":[],"date":"2004","doi":"10.1108\/14637150410559243","raw":"Stapleton, D., Pati, S., Beach, E., Julmanichoti, P. (2004), “Activity-based costing for logistics and marketing”, Business Process Management Journal, Vol. 10 No. 5, pp. 584-597.","cites":null},{"id":37963914,"title":"After graduating in chemistry at Oxford University, he followed a career in manufacturing industry with","authors":[],"date":"1992","doi":null,"raw":"After graduating in chemistry at Oxford University, he followed a career in manufacturing industry with Procter and Gamble, BL and GEC. Having seen the light & been converted to academic life, he joined Warwick Business School in 1986 as a senior research fellow studying the application of Japanese management methods in UK manufacturing. He completed his doctorate in enablers and inhibitors to material flow at Cranfield School of Management, which he joined in 1996. As Director of Research, he acts as Academic Leader for the School’s Demand Chain Management Community, and was recently appointed Director of the Cranfield Executive Doctorate programme. He is author of Just in Time Manufacturing in Perspective (Prentice Hall, 1992), and joint author of Operations Management, 2nd edition, Pitman (1998) and of Logistics Management and Strategy 3 rd edition, Pearson Education (2008). Alan has led a number of large-scale research projects in several sectors, including automotive, aerospace and grocery. One example is the long-running ECR-Europe ‘Stock Loss’ project, which identified and helped correct sources of loss in the supply chain, involving collaborative work between manufacturers and retailers. Another is his research into customer responsive supply chains, focusing on the development of supply capabilities needed to meet demand variability and uncertainty.","cites":null},{"id":37963908,"title":"Barriers to successful implementation of ABC for continuous improvement: A case study”,","authors":[],"date":"1994","doi":"10.1016\/0925-5273(94)90147-3","raw":"Waeytens, D., Bruggeman, W. (1994), “Barriers to successful implementation of ABC for continuous improvement: A case study”, International Journal of Production Economics, Vol. 36 No. 2, pp. 39-52.","cites":null},{"id":37963889,"title":"Beyond Partnership – Strategies for Innovation and Lean Supply,","authors":[],"date":"1993","doi":"10.1111\/j.1467-9310.1995.tb01353.x","raw":"Lamming, R.C. (1993), Beyond Partnership – Strategies for Innovation and Lean Supply, Prentice Hall, Harlow, UK Lin, B., Collins, J., Du, R.K. (2001), “Supply chain costing: an activity-based perspective”, International Journal of Physical Distribution & Logistics Management, Vol. 31 No. 9\/10, pp. 702-713.","cites":null},{"id":37963894,"title":"Buyer-supplier partnerships and cost data disclosure”,","authors":[],"date":"1992","doi":"10.1016\/s1044-5005(92)70014-6","raw":"Munday, M. (1992), “Buyer-supplier partnerships and cost data disclosure”, Management Accounting, Vol. 70 No. 6, pp. 28-29.Myhr, N., Spekman, R.E. (2005), “Collaborative supply-chain partnerships built upon trust and electronically mediated exchange”, Journal of Business and Industrial Marketing, Vol. 20 No. 4\/5, pp. 179-187.","cites":null},{"id":37963905,"title":"Buyer-Supplier Relationships: Derived Value Over Two Decades”,","authors":[],"date":"2008","doi":"10.1111\/j.1745-493x.2008.00053.x","raw":"Terpend, R., Tyler, B.B., Krause, D.R. Handfield, R.B. (2008), &quot;Buyer-Supplier Relationships: Derived Value Over Two Decades”, Journal of Supply Chain Management, Vol. 44, No. 2; pp. 28-55 Thomson, J., Gurowka, J. (2005), &quot;sorting out the clutter&quot;, Strategic Finance, Vol. 87 No. 2, pp. 27-33.","cites":null},{"id":37963895,"title":"Can Target Costing and Whole Life Costing be Applied in the Construction Industry?: Evidence from Two Case Studies”,","authors":[],"date":"2000","doi":"10.1111\/1467-8551.00175","raw":"Nicolini, D., Tomkins, C., Holti, R., Oldman, A., Smalley, M. (2000), “Can Target Costing and Whole Life Costing be Applied in the Construction Industry?: Evidence from Two Case Studies”, British Journal of Management, Vol. 11 No. 4, pp. 303-324 Norek, C.D., Pohlen, T.L. (2001), “Cost Knowledge: A Foundation for Improving Supply Chain Relationships”, International Journal of Logistics Management, Vol. 12 No. 1, pp. 37-51.","cites":null},{"id":37963898,"title":"Collaborative supply chain planning using electronic marketplaces”,","authors":[],"date":"2002","doi":"10.1108\/09576060210448170","raw":"Rudberg, M., Klingenberg, N., Kronhamn, K. (2002), “Collaborative supply chain planning using electronic marketplaces”, Integrated Manufacturing Systems, Vol. 13 No. 8, pp. 596-610.","cites":null},{"id":37963896,"title":"Determinants of Interorganizational Relationships: Integration and Future Directions”,","authors":[],"date":"1990","doi":"10.5465\/amr.1990.4308156","raw":"Oliver, C. (1990), “Determinants of Interorganizational Relationships: Integration and Future Directions”, Academy of Management Review, Vol. 15, No. 2, pp. 241-265.","cites":null},{"id":37963831,"title":"Develop Profitable New Products with Target Costing”,","authors":[],"date":"1999","doi":null,"raw":"Cooper, R., Slagmulder, R. (1999), “Develop Profitable New Products with Target Costing”, Sloan Management Review, Vol. 40 No. 4, pp. 23-33.","cites":null},{"id":37963858,"title":"Developing cost management in cutomer-supplier relationships: three case studies”,","authors":[],"date":"2004","doi":"10.1016\/j.pursup.2004.02.003","raw":"Kulmala, H. I. (2004), “Developing cost management in cutomer-supplier relationships: three case studies”, Journal of Purchasing & Supply Management, Vol. 10 No. 2, pp. 65-77.","cites":null},{"id":37963822,"title":"Direct product profitability and retail shelfspace allocation models”,","authors":[],"date":"2001","doi":"10.1002\/j.2158-1592.2001.tb00010.x","raw":"Bookbinder, J.H., Zarour, F.H. (2001), “Direct product profitability and retail shelfspace allocation models”, Journal of Business Logistics, Vol. 22 No. 2, pp. 183-208.Borin, N., Farris, P. (1990), “An Empirical Comparison of Direct Product Profit and Existing Measures of SKU Productivity”, Journal of Retailing, Vol. 66 No. 3, pp. 297-314.","cites":null},{"id":37963899,"title":"Disembedding the supply chain: institutionalized reflexivity and inter-firm accounting”,","authors":[],"date":"2004","doi":"10.1016\/s0361-3682(02)00055-7","raw":"Seal, W., Berry, A., Cullen, J. (2004), “Disembedding the supply chain: institutionalized reflexivity and inter-firm accounting”, Accounting, Organizations and Society, Vol. 29 No. 1, pp. 73-92.","cites":null},{"id":37963840,"title":"DPP Decision Support in Retail Merchandising”,","authors":[],"date":"1993","doi":"10.1016\/0305-0483(93)90036-k","raw":"Doherty, C., Maier, J., Simkin, L. (1993), “DPP Decision Support in Retail Merchandising”, OMEGA, International Journal of Management Sciences, Vol. 21 No. 1, pp. 25-33.","cites":null},{"id":37963900,"title":"Enacting a European supply chain: a case study on the role of management accounting”,","authors":[],"date":"1999","doi":"10.1006\/mare.1999.0105","raw":"Seal, W., Cullen, J., Dunlop, A., Berry, T., Ahmet, M. (1999), “Enacting a European supply chain: a case study on the role of management accounting”, Management Accounting Research, Vol. 10 No. 3, pp. 303-322.Shank, J. K., Govindarajan, V. (1988), &quot;The Perils of Cost Allocation Based on Production Volumes&quot;, Accounting Horizons, Vol. 2 No. 4, pp. 71-79.","cites":null},{"id":37963836,"title":"Enterprise systems and ongoing process change”,","authors":[],"date":"2004","doi":"10.1108\/14637150410518301","raw":"Davenport, T. H., Harris, J. G., Cantrell, S. (2004), “Enterprise systems and ongoing process change”, Business Process Management Journal, Vol. 10 No. 1, pp. 16-26.","cites":null},{"id":37963835,"title":"Enterprise systems and the supply chain”,","authors":[],"date":"2004","doi":"10.1108\/09576050410510917","raw":"Davenport, T. H., Brooks, J. D. (2004), “Enterprise systems and the supply chain”, Journal of Enterprise Information Management, Vol. 17 No. 1, pp. 8-19.","cites":null},{"id":37963893,"title":"ERP II: a conceptual framework for next-generation enterprise systems?”,","authors":[],"date":"2005","doi":"10.1108\/17410390510609626","raw":"Möller, C. (2005), “ERP II: a conceptual framework for next-generation enterprise systems?”, Journal of Enterprise Information Management, Vol. 18 No. 4, pp. 483-497.","cites":null},{"id":37963890,"title":"Gaining visibility of supply-chain costs”,","authors":[],"date":"2004","doi":"10.1049\/me:20020505","raw":"Mena, C., Aspinall, R., Bernon, M., Templar, S., Whicker, L. (2004), “Gaining visibility of supply-chain costs”, Logistics and Transport Focus, Vol. 6 No. 7, pp. 54-57.","cites":null},{"id":37963852,"title":"How should companies interact in business networks?&quot;,","authors":[],"date":"2002","doi":"10.1016\/s0148-2963(00)00148-x","raw":"Hakansson, H., Ford, D. (2002), &quot;How should companies interact in business networks?&quot;, Journal of Business Research, Vol. 55, No. 2, pp. 133-139.Hughes, A. (2005), “ABC\/ABM – activity based costing and activity-based management - A Profitability model for SMEs manufacturing clothing and textiles in the UK”, Journal of Fashion Marketing and Management, Vol. 9 No .1, pp. 8-19 Johnson, H.T., Kaplan R.S. (1987), Relevance Lost: The Rise and Fall of Management Accounting, Harvard Business School Press, Boston.","cites":null},{"id":37963819,"title":"Inhibitors of disruptive innovation capability: a conceptual model”,","authors":[],"date":"2006","doi":"10.1108\/14601060610663587","raw":"Assink, M. (2006), “Inhibitors of disruptive innovation capability: a conceptual model”, European Journal of Innovation Management, Vol. 9 No. 2, pp. 215-233.","cites":null},{"id":37963903,"title":"Integrating the Supply Chain&quot;,","authors":[],"date":"1989","doi":"10.1108\/eum0000000000329","raw":"Stevens, G. C. (1989), &quot;Integrating the Supply Chain&quot;, International Journal of Physical Distribution & Materials Management, Vol. 19 No. 8, pp. 3-8.","cites":null},{"id":37963833,"title":"Inter-organizational cost management systems: The case of the Tokyo-Yokohama-Kamakura supplier chain”,","authors":[],"date":"1994","doi":"10.1016\/0925-5273(94)90007-8","raw":"Cooper, R., Yoshikawa, T. (1994), “Inter-organizational cost management systems: The case of the Tokyo-Yokohama-Kamakura supplier chain”, International Journal of Production Economics, Vol. 37 No. 1, pp. 51-62.","cites":null},{"id":37963897,"title":"Interaction between management accounting and supply chain management”, Supply Chain Management:","authors":[],"date":"2004","doi":"10.1108\/13598540410527033","raw":"Ramos, M.M. (2004) “Interaction between management accounting and supply chain management”, Supply Chain Management: An International Journal, Vol 9 No 2, pp. 134-138 Ross, A., Jayaraman, V., Robinsons, P., (2007), “Optimising 3PL service delivery using a cost-to-serve and action research framework”, International Journal of Production Research, Vol. 45, No. 1, pp. 83-101.","cites":null},{"id":37963906,"title":"Interdependencies, trust and information in relationships, alliances and network.”","authors":[],"date":"2001","doi":"10.1016\/s0361-3682(00)00018-0","raw":"Tomkins, C. (2001), “Interdependencies, trust and information in relationships, alliances and network.” Accounting, Organizations and Society, Vol. 26 No. 2, pp. 161-191.","cites":null},{"id":37963834,"title":"Interfirm supply chains: the contribution of management accounting”,","authors":[],"date":"1999","doi":null,"raw":"Cullen, J., Berry, A.J., Seal, W., Dunlop, A., Ahmend, M., Marson, J. (1999), “Interfirm supply chains: the contribution of management accounting”, Management Accounting, Vol. 77 No. 6, p. 30-32.","cites":null},{"id":37963832,"title":"Interorganizational cost management and relational context&quot;,","authors":[],"date":"2004","doi":"10.1016\/s0361-3682(03)00020-5","raw":"Cooper, R., Slagmulder, R. (2004), &quot;Interorganizational cost management and relational context&quot;, Accounting, Organizations and Society, Vol. 29 No. 1, pp. 1-26.","cites":null},{"id":37963887,"title":"Issues in Supply Chain Costing”,","authors":[],"date":"1996","doi":"10.1108\/09574099610805395","raw":"LaLonde, B.J., Pohlen, T.L. (1996), “Issues in Supply Chain Costing”, The International Journal of Logistics Management, Vol. 7 No. 1, pp. 1-11.","cites":null},{"id":37963856,"title":"Leading Change: Why Transformation Efforts Fail”,","authors":[],"date":"1995","doi":"10.1109\/emr.2009.5235501","raw":"Kotter, J.P. (1995), “Leading Change: Why Transformation Efforts Fail”, Harvard Business Review, Vol. 73 No. 2, pp. 59-67.","cites":null},{"id":37963825,"title":"Logistics and Supply Chain Management – Creating ValueAdding Networks, (3rd edition), Financial Times, Prentice Hall,","authors":[],"date":"2005","doi":null,"raw":"Christopher, M. (2005), Logistics and Supply Chain Management – Creating ValueAdding Networks, (3rd edition), Financial Times, Prentice Hall, Great Britain Chopra, S., Meindl, P. (2003), “What will drive the enterprise software shakeout?”, Supply Chain Management Review, Vol. 7 January-February, pp. 50-57.","cites":null},{"id":37963824,"title":"Logistics and Supply Chain Management, Financial Times,","authors":[],"date":"1998","doi":"10.4324\/9780203805862","raw":"Christopher, M. (1998), Logistics and Supply Chain Management, Financial Times, Prentice Hall, Great Britain.","cites":null},{"id":37963848,"title":"Logistics Costing Techniques and their Application to a Singaporean Wholesaler”,","authors":[],"date":"2001","doi":"10.1080\/13675560110038103","raw":"Fernie, J., Freathy, P., Tan, E-L. (2001), “Logistics Costing Techniques and their Application to a Singaporean Wholesaler”, International Journal of Logistics: Research and Applications, Vol. 4 No. 1, pp. 117-131.","cites":null},{"id":37963912,"title":"MA MSc (Oxon) PhD CEng FIET Centre for Logistics and Supply Chain Management, Cranfield School of Management,","authors":[],"date":null,"doi":null,"raw":"Alan Harrison MA MSc (Oxon) PhD CEng FIET Centre for Logistics and Supply Chain Management, Cranfield School of Management, Cranfield, UK E-mail: a.harrison@cranfield.ac.uk, Tel: +44 1234 754839, Fax: +44 1234 751712, Centre for Logistics and Supply Chain Management, Cranfield School of Management, MK43 0AL Bedford, United Kingdom Alan Harrison is professor of operations and logistics at Cranfield School of Management.","cites":null},{"id":37963826,"title":"Management accounting official terminology,","authors":[],"date":"2000","doi":null,"raw":"CIMA (2000), Management accounting official terminology, 2000 edition, CIMA, London Cokins, G. (1998), “Why is Traditional Accounting Failing Managers?”, Hospital Material Management Quarterly, Vol. 20 No. 2, pp. 72-80.","cites":null},{"id":37963850,"title":"Managing customers through costto-serve”,","authors":[],"date":"1996","doi":null,"raw":"Gebert, P., Goldenberg, C. B., Peters, D. (1996), “Managing customers through costto-serve”, CMA, Vol. 70 No. 7, pp. 22-23.","cites":null},{"id":37963827,"title":"Measuring Costs Across the Supply Chain”,","authors":[],"date":"2001","doi":null,"raw":"Cokins, G. (2001), “Measuring Costs Across the Supply Chain”, Cost Engineering, Vol. 43 No. 10, pp. 25-31.","cites":null},{"id":37963830,"title":"Measuring profits and costs across the supply chain for collaboration”,","authors":[],"date":"2003","doi":null,"raw":"Cokins, G. (2003), “Measuring profits and costs across the supply chain for collaboration”, Cost Management, Vol. 17 No. 5, pp. 22-29.Cooper, R., Slagmulder, R. (1998), “Strategic Cost Management”, Management Accounting, Vol. 79 No. 9, pp. 19-20.","cites":null},{"id":37963820,"title":"Modern management accounting for modern purchasing”,","authors":[],"date":"2002","doi":"10.1016\/s0969-7012(01)00017-x","raw":"Axelsson, B., Laage-Hellman, J., Nilsson, U. (2002), “Modern management accounting for modern purchasing”, European Journal of Purchasing & Supply Chain Management, Vol. 8 No. 1, pp. 53-62.","cites":null},{"id":37963853,"title":"Open-book accounting in networks – Potential achievements and reasons for failures”,","authors":[],"date":"2005","doi":"10.1016\/j.mar.2005.01.003","raw":"Kajüter, P., Kulmala, H.I. (2005), “Open-book accounting in networks – Potential achievements and reasons for failures”, Management Accounting Research, Vol. 16 No. 2, pp. 179-204.","cites":null},{"id":37963843,"title":"Purchasing and Supply Management’s Participation in the Target Costing Process”,","authors":[],"date":"2000","doi":"10.1016\/s0969-7012(02)00019-9","raw":"Ellram, L.M. (2000), “Purchasing and Supply Management’s Participation in the Target Costing Process”, Journal of Supply Chain Management, Vol. 36 No. 2, pp. 39-51.","cites":null},{"id":37963892,"title":"Qualitative data analysis: an expanded sourcebook, Sage Publications,","authors":[],"date":"1994","doi":"10.1016\/s1098-2140(99)80125-8","raw":"Miles B. M., Huberman, M. A. (1994), Qualitative data analysis: an expanded sourcebook, Sage Publications, Thousand Oaks, California.","cites":null},{"id":37963916,"title":"School of Applied Sciences, Cranfield University, Cranfield, UK E-mail: i.s.fan@cranfield.ac.uk, Tel +44 (0) 1234 750111 Ext 5651, Fax +44 (0) 1234 752159, Manufacturing Department, School of Applied Sciences,","authors":[],"date":null,"doi":null,"raw":"Ip Shing FAN BSc., PhD., CEng, MIEE, Mem SME Manufacturing Department, School of Applied Sciences, Cranfield University, Cranfield, UK E-mail: i.s.fan@cranfield.ac.uk, Tel +44 (0) 1234 750111 Ext 5651, Fax +44 (0) 1234 752159, Manufacturing Department, School of Applied Sciences, Cranfield University, Cranfield, Bedfordshire, MK43 0AL, UKDr Ip-Shing Fan is currently the Course Director of the MSc in Enterprise System Implementation in Cranfield University, UK. He has interest in the effective design, development, implementation and use of ICT in business and non-business organisations. His work included the use of business process modelling and analysis to help business to improve performance through smarter way of working. The improvement approach integrates the use of organisation and technology introduction with sensitive people change management. He has deliver consultancy to global businesses to help in different stages of ERP, PLM and SCM implementation. Using a socio-technical approach, he developed tools to provide organisation and human factor readiness assessment for enterprise systems; and assist in formulating change management plans to improve the readiness.","cites":null},{"id":37963904,"title":"Supply Chain Costing – A Road Map”,","authors":[],"date":"2004","doi":"10.1049\/me:20020505","raw":"Templar, S. Bernon, M., Mingwei, F. (2004), “Supply Chain Costing – A Road Map”, Proceedings of Logistics Research Network Conference, Dublin, pp. 510-516.","cites":null},{"id":37963837,"title":"Supply Chain Management and Management Accounting: A Case Study of Activity-Based Costing”,","authors":[],"date":"2000","doi":"10.1080\/13675560050006664","raw":"Dekker, H., Van Goor, A. R. (2000), “Supply Chain Management and Management Accounting: A Case Study of Activity-Based Costing”, International Journal of Logistics: Research and Applications, Vol. 3 No. 1, pp. 41-52.Dekker, H.C. (2003), &quot;Value chain analysis in interfirm relationships: a field study&quot;, Management Accounting Research, Vol. 14, No. 1, pp. 1-23.","cites":null},{"id":37963888,"title":"Supply chain management, implementation issues and research opportunities&quot;,","authors":[],"date":"1998","doi":"10.1108\/09574099810805807","raw":"Lambert, D.M., Cooper, M.C. and Pagh, J.D. (1998), &quot;Supply chain management, implementation issues and research opportunities&quot;, International Journal of Logistics Management, Vol. 9, No. 2, pp. 1-19.","cites":null},{"id":37963844,"title":"Supply management’s involvement in the target costing process”,","authors":[],"date":null,"doi":"10.1016\/s0969-7012(02)00019-9","raw":"Ellram, L.M. (2002a), “Supply management’s involvement in the target costing process”, European Journal of Purchasing & Supply Management, Vol. 8 No. 4, pp. 235-244.","cites":null},{"id":37963901,"title":"Target Costing for Supply Chain Management: An Economic Framework&quot;,","authors":[],"date":"2000","doi":"10.1002\/1097-0053(200011\/12)12:1<67::aid-jcaf11>3.0.co;2-0","raw":"Smith, W.I., Lockamy, A. (2000), &quot;Target Costing for Supply Chain Management: An Economic Framework&quot;, The Journal of Corporate Accounting & Finance, Vol. 12 No. 1, pp. 67-77.","cites":null},{"id":37963910,"title":"The adoption of total cost of ownership for sourcing decisions - a structural equations analysis&quot;, Accounting, Organizations and Society,","authors":[],"date":"2005","doi":"10.1016\/j.aos.2004.03.002","raw":"Wouters, M., Anderson, J.C., Wynstra, F. (2005), “The adoption of total cost of ownership for sourcing decisions - a structural equations analysis&quot;, Accounting, Organizations and Society, Vol. 30 No. 2, pp. 167-191.Authors as they appear in order on the paper Marko Bastl Centre for Logistics and Supply Chain Management, Cranfield School of Management, Cranfield, UK E-mail: marko.bastl@cranfield.ac.uk, Tel.: +44 1234 751122, Fax: +44 1234 751712, Centre for Logistics and Supply Chain Management, Cranfield School of Management, MK43 0AL Bedford, United Kingdom Marko Bastl is a research fellow in Supply Chain Research Centre, Cranfield School of Management. His research interests are in business relationships development, supply chain process improvements, marketing-logistics interface and product-service systems. He is currently involved in the multi-disciplinary research on product-service systems; specifically he is a lead researcher on the project focused on supply network strategy for provision of product-service systems. Marko is currently in the last year of his doctorate, exploring the topic on relationship transparency. He authored and co-authored various papers in top international journals and conference proceedings. Prior he joined Cranfield School of Management he worked in manufacturing industry as head of finance, purchasing and as a freelance consultant.","cites":null},{"id":37963818,"title":"The costs of activity-based management”,","authors":[],"date":"2002","doi":"10.1016\/s0361-3682(99)00031-8","raw":"Armstrong, P. (2002), “The costs of activity-based management”, Accounting, Organizations and Society, Vol. 27 No. 1\/2, pp. 99-120.","cites":null},{"id":37963817,"title":"The impact of ERP on supply chain management: Exploratory findings from European Delphi study”,","authors":[],"date":"2003","doi":"10.1016\/s0377-2217(02)00550-7","raw":"Akkermans, H. A., Bogerd, P., Yucesan, E. and van Wassenhove, L.N. (2003), “The impact of ERP on supply chain management: Exploratory findings from European Delphi study”, European Journal of Operational Research, Vol. 146 No. 20, pp. 284-301.","cites":null},{"id":37963846,"title":"The Implementation of Target Costing in the United States: Theory Versus Practice”,","authors":[],"date":"2006","doi":"10.1111\/j.1745-493x.2006.04201003.x","raw":"Ellram, L.M. (2006), “The Implementation of Target Costing in the United States: Theory Versus Practice”, Journal of Supply Chain Management, Vol. 42 No. 1, pp. 13-26.Ellram, L.M., Hendrick, T.E. (1995), “Partnering Characteristics: A Dyadic Perspective”, Journal of Business Logistics, Vol. 16 No. 1, pp. 41-64 Ellram, L.M., Siferd, S.P. (1993), “Purchasing: The cornerstone of the total cost of ownership model”, Journal of Business Logistics, Vol. 14 No.1, pp. 163-184.","cites":null},{"id":37963841,"title":"The Relational View: Cooperative Strategies and Sources of Interorganizational Competitive Advantage,","authors":[],"date":"1998","doi":"10.5465\/amr.1998.1255632","raw":"Dyer, J.H., Singh, H. (1998), “The Relational View: Cooperative Strategies and Sources of Interorganizational Competitive Advantage, Academy of Management Review, Vol. 23, No. 4, pp. 660-679.","cites":null},{"id":37963859,"title":"The role of cost management in network relationships”,","authors":[],"date":"2002","doi":"10.1016\/s0925-5273(00)00061-x","raw":"Kulmala, H.I., Paranko, J., Uusi-Rauva, E. (2002), “The role of cost management in network relationships”, International Journal of Production Economics, Vol. 79 No. 1, pp. 33-43.LaLonde, B. (2003), “Three Problems that Linger”, Supply Chain Management Review, Vol. 7 No. 2, pp. 7-8.","cites":null},{"id":37963855,"title":"Time-Driven Activity-Based Costing”,","authors":[],"date":"2004","doi":"10.2139\/ssrn.485443","raw":"Kaplan, R.S., Anderson, S.R. (2004), “Time-Driven Activity-Based Costing”, Harvard Business Review, Vol. 82 No. 11, pp. 131-138.","cites":null},{"id":37963849,"title":"Total Cost of Ownership Models: An Exploratory Study”,","authors":[],"date":"2002","doi":"10.1111\/j.1745-493x.2002.tb00132.x","raw":"Ferrin, B.G., Plank, R.E. (2002), “Total Cost of Ownership Models: An Exploratory Study”, Journal of Supply Chain Management, Vol. 38 No. 3, pp. 18-29.","cites":null},{"id":37963847,"title":"Total cost of ownership: a key concept in strategic cost management decisions”,","authors":[],"date":"1998","doi":null,"raw":"Ellram, L.M., Siferd, S.P. (1998), “Total cost of ownership: a key concept in strategic cost management decisions”, Journal of Business Logistics, Vol. 19 No. 1, pp. 55-84.","cites":null},{"id":37963907,"title":"Towards a Methodology for Developing Evidence-Informed Management Knowledge by Means of Systematic Review”,","authors":[],"date":"2003","doi":"10.1111\/1467-8551.00375","raw":"Tranfield, D., Denyer, D., Smart, P. (2003), “Towards a Methodology for Developing Evidence-Informed Management Knowledge by Means of Systematic Review”, British Journal of Management, Vol. 14 No. 3, pp. 207-222.Zsidisin, G.A., Ellram, L.A., Ogden, J.A. (2003), “The Relationship between purchasing and supply management’s perceived value and participation in strategic supplier cost management activities”, Journal of Business Logistics, Vol. 24 No. 2, pp. 129-154.","cites":null},{"id":37963851,"title":"Towards the Integrative Supply Chain Model”,","authors":[],"date":"1999","doi":"10.1080\/13675560903268886","raw":"Grubic, T., Bastl, M., Fan, I-S., Harrison, A. (forthcoming), “Towards the Integrative Supply Chain Model”, International Journal of Logistics: Research and Application Gummesson, E. (1999) Total Relationship Marketing, Butterworth-Heinemann, Oxford Gupta, K. M., Gunasekaran, A. (2004) “Costing in new enterprise environment - A challenge for managerial accounting researchers and practitioners”, Managerial Accounting Journal, Vol 20 No 4, pp. 337-357 Gunasekaran, A., Ngai, E.W.T. (2004), “Information Systems in Supply Chain Integration and Management, European Journal of Operational Research, Vol. 159, No. 2, pp. 269-295.","cites":null},{"id":37963891,"title":"Tracking total cost of ownership proves elusive”,","authors":[],"date":"1999","doi":null,"raw":"Milligan, B., (1999), “Tracking total cost of ownership proves elusive”, Purchasing, Vol. 127 No. 3 pp. 22-23.","cites":null},{"id":37963854,"title":"Trends in industrial supply chains and networks”,","authors":[],"date":"2003","doi":"10.1108\/09600030310502885","raw":"Kamppainen, K, Vepsalainen, A.P.J. (2003), “Trends in industrial supply chains and networks”, International Journal of Physical Distribution & Logistics Management, Vol. 33 No. 8, pp. 701-719.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-12-31T00:00:00Z","abstract":"Purpose - The purpose of this paper is to highlight the limitations of current\naccounting practices in an inter-organisational context; introduce contemporary\ncosting approaches used in inter-organisational costing (IOC) programmes; and\nidentify the inhibitors of successful implementation of IOC programmes. Design\/\nmethodology\/approach - The paper uses a structured review of empirical and\ntheoretical literature. Findings - Traditional accounting practices do not\nadequately fulfil their role in the inter-organisational context. Contemporary\naccounting practices overcome only some limitations of traditional accounting\npractices. The paper uncovers part of the complexity surrounding the\nimplementation of IOC programmes and suggests that we are dealing with a broad\ninter-disciplinary phenomenon. Research limitations\/implications - Conclusions\nare drawn on a conceptual level and further empirical investigation is\nencouraged. Practical implications - The paper raises the awareness of the\ncomplexity surrounding the implementation of IOC programmes. The broad set of\ninhibiting factors could be effectively used by managers to assess the readiness\nof organisations involved in implementation of IOC programmes. Originality\/value\n- This research is the first that systematically addresses the problem of\ninhibitors in the implementation of IOC programmes. The broad scope of the paper\nsets the foundations for more focused research into specific inhibiting factors","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/139957.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1108\/09574091011042188","pdfHashValue":"f2cbb4411ee24d3abd8c3d2779b5a1e118e0ceb1","publisher":"Mcb","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/5088<\/identifier><datestamp>2012-05-23T13:27:56Z<\/datestamp><setSpec>hdl_1826_28<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Inter-organisational costing approaches: the inhibiting factors<\/dc:title><dc:creator>Bastl, Marko<\/dc:creator><dc:creator>Grubic, Tonci<\/dc:creator><dc:creator>Templar, Simon<\/dc:creator><dc:creator>Harrison, Alan<\/dc:creator><dc:creator>Fan, Ip-Shing<\/dc:creator><dc:subject>Operating costs Organizational economics Supply chain management supply chain\nmanagement integration information networks adoption systems trust<\/dc:subject><dc:description>Purpose - The purpose of this paper is to highlight the limitations of current\naccounting practices in an inter-organisational context; introduce contemporary\ncosting approaches used in inter-organisational costing (IOC) programmes; and\nidentify the inhibitors of successful implementation of IOC programmes. Design\/\nmethodology\/approach - The paper uses a structured review of empirical and\ntheoretical literature. Findings - Traditional accounting practices do not\nadequately fulfil their role in the inter-organisational context. Contemporary\naccounting practices overcome only some limitations of traditional accounting\npractices. The paper uncovers part of the complexity surrounding the\nimplementation of IOC programmes and suggests that we are dealing with a broad\ninter-disciplinary phenomenon. Research limitations\/implications - Conclusions\nare drawn on a conceptual level and further empirical investigation is\nencouraged. Practical implications - The paper raises the awareness of the\ncomplexity surrounding the implementation of IOC programmes. The broad set of\ninhibiting factors could be effectively used by managers to assess the readiness\nof organisations involved in implementation of IOC programmes. Originality\/value\n- This research is the first that systematically addresses the problem of\ninhibitors in the implementation of IOC programmes. The broad scope of the paper\nsets the foundations for more focused research into specific inhibiting factors.<\/dc:description><dc:publisher>Mcb<\/dc:publisher><dc:date>2012-05-11T23:01:35Z<\/dc:date><dc:date>2012-05-11T23:01:35Z<\/dc:date><dc:date>2010-12-31T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>Marko Bastl, Tonci Grubic, Simon Templar and Alan Harrison, Ip-Shing Fan, (2010), Inter-organisational costing approaches: the inhibiting factors, The International Journal of Logistics Management,Vol. 21 Iss: 1, pp.65-88.<\/dc:identifier><dc:identifier>0957-4093<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1108\/09574091011042188<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/5088<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0957-4093","issn:0957-4093"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":["Operating costs Organizational economics Supply chain management supply chain\nmanagement integration information networks adoption systems trust"],"subject":["Article"],"fullText":"The International Journal of Logistics Management, Volume 21, Number 1, 2010,\nPages 65-88\nThis article is © Emerald Group Publishing and permission has been granted for this\nversion to appear here (https:\/\/dspace.lib.cranfield.ac.uk\/index.jsp). Emerald does not\ngrant permission for this article to be further copied\/distributed or hosted elsewhere\nwithout the express permission from Emerald Group Publishing Limited.\nwww.emeraldinsight.com\nInter-organisational costing approaches – the\ninhibiting factors\nMarko Bastl1, Tonci Grubic2, Simon Templar1, Alan Harrison1, Ip-Shing Fan2\n1Supply Chain Research Centre, Cranfield School of Management, Cranfield, United\nKingdom\n2Manufacturing Department, School of Applied Sciences, Cranfield, United Kingdom\nAbstract\nPurpose – The purpose of this paper is: a). to highlight the limitations of current accounting\npractices in inter-organisational context; b). to introduce contemporary costing approaches used in\ninter-organisational costing (IOC) programmes and c). to identify the inhibitors of successful\nimplementation of IOC programmes.\nMethodology\/Approach – The research uses a structured review of empirical and theoretical\nliterature.\nFindings – Traditional accounting practices do not adequately fulfil their role in the inter-\norganisational context. Contemporary accounting practices overcome only some limitations of\ntraditional accounting practices. The study uncovers part of the complexity surrounding the\nimplementation of IOC programmes and suggests that we are dealing with a broad inter-\ndisciplinary phenomenon.\nResearch limitations – Conclusions are drawn on a conceptual level and further empirical\ninvestigation is encouraged.\nPractical implications – The research raises the awareness of the complexity the surrounds the\nimplementation of IOC programmes. The broad set of inhibiting factors could be effectively used\nby managers to assess the readiness of organisations involved in implementation of inter-\norganisational costing programmes.\nOriginality\/value – This research is the first that systematically addresses the problem of inhibitors\nin the implementation of inter-organisational costing programmes. The broad scope of the paper\nsets the foundations for more focused research into specific inhibiting factors.\nKeywords: Intra- and inter-organisational costing, Supply chain management, Inhibiting factors\nPaper type: Literature review\n1 Introduction\nThe transition from a supply chain made up of individual competing entities to one where\norganisations come together to form an externally integrated supply chain which extends\nboth upstream and downstream was predicted by Stevens (1989). Thus the successful\nmanagement of these inter-organisational relationships is crucial to achieve Christopher’s\n(1998, p. 16) criteria of increased value and overall cost reduction. Cooper and Slagmulder\n(2003a) argue that only by the joint efforts of every partner working together will they\nachieve the common goal of reducing the overall cost of the supply chain operation. Over\nthe last two decades the management of these inter-organisational relationships has\nbecome a research topic of substantial importance (Oliver, 1990; Ellram, 1995; Dyer and\nSingh, 1998; Håkansson and Ford, 2002; Dekker, 2003; Terpend et al., 2008, Koulikoff-\nSouviron and Harrison, 2007). If one of the key measures of this inter-organisational\napproach is cost reduction, then there is a need to develop a management costing approach\nthat can both measure the reduction of total cost throughout the supply chain and then is\nable to act as an enabler to distribute these cost savings amongst the collaborators.\nDekker and Van Goor, (2000) argue that the role of management accounting in inter-\norganisational relationships still lacks clear determination. It is recognised as important\nwhen it comes to, for example; make-or-buy decision making, (Seal et al., 1999) or\ninformation-sharing for development of trust between parties in a relationship (Tomkins,\n2001). Supply chain literature is not short of calls for increased sharing of information in\nsupply chains (Ellram and Hendrick, 1995; Kemppainen and Vepsalainen, 2003; Myhr and\nSpekman, 2005): sharing of costing information is considered as particularly important\n(Kemppainen and Vepsalainen, 2003) to gain benefits such as reduction of total supply\nchain costs, among others.\nThe role of the management accountant as the provider of timely, accurate and relevant\nfinancial information to enable supply chain managers to make and execute effective\ndecision-making is of vital importance to achieving cost. In this context traditional\naccounting practices have been criticised as being unable do deliver an inter-organisational\nfocus and associated costing information. To provide additional focus and relevance to\nexisting practices in an inter-organisational context, various costing approaches have been\nintroduced in past decades such as activity based costing (ABC), direct product\nprofitability (DPP), cost to serve (CS), total cost of ownership (TCO) and target costing\n(TC). According to Kulmala et al., (2002, p.37) these costing approaches can be applied in\nan inter-organisational context to address the objective of “finding lower cost solutions\nthan would be possible if the firm and its buyers and suppliers attempted to reduce costs\nseparately” (p. 37).\nIn this paper we define inter-organisation costing (IOC) programmes as “an approach to\nmanaging costs through joint efforts of the organisation and its customers and suppliers”.\nBy doing so our definition encompasses the following characteristics:\na. The management of costs (La Londe and Pohlen, 1996; Kulmala et al., 2002;\nCooper and Slagmulder, 2003a, 2003b), which essentially employs various costing\napproaches to the supply chain;\nb. Joint-cooperative efforts (Kulmala et al., 2002 and Cooper and Slagmulder, 2003a)\nand;\nc. Involvement of upstream and downstream parties (La Londe and Pohlen, 1996 and\nKulmala et al., 2002)\nScholars as well as practitioners have been reporting that successful implementation of\ninter-organisational costing (IOC) approaches will deliver benefits such as increased\nvisibility of product profitability (LaLonde and Pohlen, 1996), improvements in business\nrelationships (Doherty et al., 1993), better understanding of the true costs of doing\nbusiness (Lin et al., 2001, Zsidisin et al., 2003), transmission of competitive pressures\nupstream of a supply chain (Cooper and Slagmulder, 2003a), increased knowledge of\nfirm’s business processes and process-related costs (Stapleton et al., 2004) and improved\ndecision making (Blocher et al., 2005). In spite of the recognised benefits, a limited\nadoption of IOC programmes among organisations irrespective of industrial sector has\nbeen revealed (Borin and Farris, 1990; Doherty et al., 1993; Ellram, 1994; Ellram and\nSiferd, 1998; Cooper and Slagmulder, 1999; Ferrin and Plank, 2002; LaLonde, 2003).\nThe aim of this paper is to review the relevant empirical and theoretical literature to extract\nthe possible reasons for limited implementation of IOC approaches. We aim to contribute\nto the existing body of knowledge and to inform supply chain practice with regard to the\nimplementation of IOC approaches by addressing the following objectives:\n To highlight the limitations of traditional costing approaches to provide inter-\norganisational supply chain management information;\n To introduce five of the most commonly used approaches to provide IOC\ninformation; ABC, DPP, CS, TCO and TC and;\n To identify the inhibiting factors that might prevent successful implementation of\nIOC approaches in organisations and encourage more detailed investigations on\nhow to overcome them in the future.\nThe paper is structured in line with the objectives; firstly it touches on current accounting\npractices, where it highlights major issues from the supply chain point of view. Then it\nintroduces the five of the most commonly used accounting practices in IOC programmes.\nNext we introduce the methodology on selection and analysis of sources of evidences that\nwe have used for identification of inhibiting factors. We then present and discuss the\nidentified inhibitors, and end with conclusions and research limitations.\n2 Criticism of traditional accounting approaches\nRoles that accounting practices need to fulfil in an inter-organisational context are different\nto the level of a single organisation. Traditional accounting practices, mainly represented\nby standard costing, often do not fulfil inter-organisational roles well enough to be\nconsidered relevant for decision making support. This section highlights these roles and\nunveils the most common areas of criticism of traditional accounting practices.\nFrom a broad perspective the roles of management accounting in both, intra- and inter-\norganisational contexts share some commonalities. For example management accounting\nshould: a). provide decision making information and knowledge at strategic and\noperational level (Axelsson et al., 2002; Kulmala et al., 2002) and b). ensure that this\ninformation is timely and relevant to managerial decision making, both in the long- and\nshort-term. Inter-organisationally management accounting confronts with additional\nrequirements. Provided information needs to support decisions that may affect not only a\nfocal firm but also its parties in an organisation’s relationships. In this new and extended\nrole management accounting would typically support provision of information for: a).\nmake-or-buy decisions that could result in development of a partnering relationship; b). for\nactual management of strategic partnerships; c). for management of performance\nmeasurement systems (Seal et al., 1999) and d). management of tasks to be performed in\nthe relationship and development of trust in business relationships (Tomkins, 2001).\nTraditional accounting practices are weak at addressing inter-organisational roles. This is\nreflected in a growing dissatisfaction and criticism from both scholars and practitioners.\nHughes (2005) for example states that although the information may be accurate, it is often\nlate, irrelevant and misleading. A similar critique exposes financial reporting as being too\nlate, too aggregated (Johnson and Kaplan, 1987) and too distorted (Christopher, 2005) to\nbe relevant for managerial planning and decision making. In a supply chain context, the\nsituation is made worse. Traditional accounting practices are seen as an inappropriate to\nsufficiently address the integrative and process-oriented nature of supply chains. The views\nof why is that come down to the following:\n Information captured using standard costing is insufficient for determining costs\nrelated to supply chain processes (Cokins, 2001).\n Standard costing as a cost assessment tool for identifying inter-organisational cost\nreduction opportunities is not suitable for its limited intra-organisational scope\n(Cooper and Slagmulder, 1998; Kulmala et al., 2002; Mena et al., 2004;\nChristopher, 2005).\n Standard costing does not reflect the burdens in variations in terms of: rate of sale,\ninventory levels, holding costs and obsolescence, changeover times in\nmanufacturing and costs of ordering and administration (Braithwaite and Samakh,\n1998).\n Costs are captured at too high level of aggregation (Christopher, 2005).\n Standard costing does not encourage improvements (Gupta and Gunasekaran,\n2004).\nIn the attempt to overcome some of these shortcomings various different costing\napproaches have been developed in recent decades. The next section is providing the\noverview of the most commonly used costing approaches in IOC programmes.\n3 Contemporary costing approaches\nIOC programmes utilise various different costing approaches. However, these costing\napproaches differ as we move across the supply chain (see Figure 1). On the upstream side\nof a focal firm, approaches like TCO, TC and ABC are normally applied, where on the\ndownstream side are ABC, DPP and CS (LaLonde and Pohlen, 1996; Templar et al.,\n2004). Definitions and characteristics of each of these techniques are outlined in the\ncontinuation of this section.\nFigure 1: Costing approaches within inter-organisational costing programmes\n3.1 Activity Based Costing\nActivity based costing (ABC) is defined in numerous ways. CIMA (2000) defines ABC as:\n“An approach to the costing and monitoring activities, which involves tracing resource\nconsumption and costing final outputs. Resources are assigned to activities and activities\nPerspective\nof a focal\ncompany\n1\n2\nn\n1\n1\n1\nn\nn\n2\nn\n1\nn\n2\n1\n1\n1\nn\nn\n2\nn\nTier one\ncustomers\nTier n \/ end\ncustomers\nTier one\nsuppliers\nTier n \/ initial\nsuppliers\nInter-organisational costing programmes\nABC, DPP, CS\n..;\nABC, DPP, CS\n..;\nTCO, TC, ABC\n..;\nTCO, TC, ABC\n..;\nUpstream Downstream\nto costs objects based on consumption estimates. The latter utilise cost drivers to attach\nactivity costs to outputs”.\nThe origins of ABC can be found as far back as before the Second World War (Lin et al.,\n2001). ABC’s attractiveness has increased with a rising awareness of the shortcomings of\ntraditional accounting systems where indirect costs are allocated to products on a volume-\nrelated base (Lin et al., 2001; Armstrong, 2002), i.e. via indirect labour.\nABC is primarily concerned with the assignment of resource costs to cost objects (Blocher\net al., 2005); such as products, services or customers based on activities performed for the\ncost objects. Direct and indirect costs are assigned to cost objects. Assignment of costs is a\ntwo-stage procedure (Blocher et al., 2005). In the first stage overhead costs are assigned to\nactivity cost centres (or pools) by using appropriate resource consumption cost drivers. In\nthe second stage costs of activities or activity cost pools are assigned to cost objects using\nappropriate activity consumption drivers that measure the demand cost objects place on the\nactivity or pool of activities (Blocher et al., 2005).\nAccording to some, ABC helps to uncover the true costs of business (Lin et al., 2001),\nprovides a better decision making basis and support for cost control, better profitability\nmeasures of products, services or channels, and better provision of controlling capacity\ncosts (Blocher et al., 2005). Nevertheless, we need to be realistic about ABC’s\n“capabilities” as a panacea for overcoming all the shortcomings of traditional accounting\nsystems and achieving goals of inter-organisational costing initiatives. Concerns are\npointed mainly towards ABC’s implementation difficulties (Kaplan and Anderson, 2004),\ninability to identify value and non value added activities in organisations (LaLonde and\nPohlen, 1996), and inability to capture the whole complexity of actual operations in\norganisations (Kaplan and Anderson, 2004).\n3.2 Direct product profitability\nDirect product profitability (DPP) is defined by CIMA (2000) as a technique “used\nprimarily within the retail sector. DPP involves the attribution of costs other than\npurchase price (e.g. distribution, warehousing and retailing) to each product line”.\nDPP first appears in an article by Bookbinder and Zarour (2001) and in this time is no\nlonger used. However in terms of lessons learned from the implementation and use of this\napproach it is appropriate to include it in the review. DPP emerged as a result of growing\nconcerns in the retail sector about the profitability and costs of individual products and\nstock keeping units. DPP was the first serious attempt to determine costs of products\nbeyond the boundaries of a focal firm. Traditionally decision makers in the retail sector\nhad relied on gross profit or gross margin for measuring performance (LaLonde and\nPohlen, 1996). These measures exclude the costs associated with handling, warehousing,\nfreight, discounts, allowances and direct labour, which significantly vary from one product\nto another. DPP takes these costs in the account.\nAccording to Doherty et al. (1993) a major benefit associated with the use of DPP is its\npotential for improvements in supplier-retailer relationships. Through an increased\nvisibility of costs and the provision of more detailed costing data both parties in the\nrelationship have the potential to increase mutual understanding of product and supply\nchain costs. The method cannot be used for encompassing total company costs, as it\nexcludes fixed overhead costs and administrative expenses (LaLonde and Pohlen, 1996).\nDPP is a static measure, which does not reflect the effects of changes in shelf-space, or of\nthe benefits of increased sales of item B caused by item A (Bookbinder and Zarour, 2001).\n3.3 Cost-to-Serve\nCost-to-Serve (CS) is described as a method for capturing external supply chain logistics\ncosts, aiming to identify and analyse drivers of costs associated with different product\nfamilies, different sales channels and different customers (Braithwaite and Samakh, 1998,\nNorek and Pohlen, 2001; Ross et al., 2007).\nSome organisations have realized that sales volumes do not necessarily mean profit. The\nprofit is a difference between the price and the actual cost to serve (Templar et al., 2004).\nThis implies that customers should be managed for profit and not only for sales revenue.\nCS is a method that allows more accurate costing in respect to specific product family,\nsales channel or customer. In its essence CS is a form of ABC applied on the downstream\nside of a supply chain. In order to understand the costs and drivers a method of collecting\ncosts, mapping process activities and analysing the data, similar to ABC is employed.\nBraithwaite and Samakh, (1998), Ross et al., (2007), demonstrated that this method help\norganisations determining costs of product variety, managing customer channels, achieving\ncustomer service objectives and improving distribution network. The main challenges with\nimplementation of this approach are again very similar to challenges described for ABC.\nBraithwaite and Samakh, (1998) however showed that achieving the right level of detail in\ncrucial for CS model to allow on one hand for a meaningful analysis and on the other for\nmaintainability of the whole costing system.\n3.4 Total Cost of Ownership\nTotal Cost of Ownership (TCO) is defined by Ellram and Siferd (1998) as a “purchasing\ntool and philosophy aimed at understanding the relevant costs of buying a particular good\nor service from a particular supplier” (p. 56).\nTCO emerged in the 1980s with the aim of better understanding the total costs associated\nwith the purchase of goods or service from a specific supplier (Zsidisin et al., 2003;\nLaLonde and Pohlen, 1996). The focus of TCO is on a firm’s interfaces with suppliers to\nsupport decisions related to sourcing strategy (Wouters et al., 2005). TCO recognises that\npurchase price does not encompass all costs associated with the purchase and that the total\ncosts of acquiring the product or service from a specific supplier also depends on the\nsupplier’s performance (LaLonde and Pohlen, 1996). Costs affected by a supplier’s\nperformance and thus need to be included in the TCO analysis are, according to LaLonde\nand Pohlen (1996), costs of ordering, expediting, receiving and inspecting. In addition,\nEllram (1994) also recommends costs associated with supplier search and qualification,\ntariffs and duties, warehousing as costs related to the use of specific good or service such\nas; downtime caused by late, defective and incomplete shipments, warranty work, or\ncustomer returns associated with defective\/poor quality material or components. There is\nno general rule about which costs precisely should be included in the TCO analysis. Any\ndecision will largely depend on the relative importance that those costs have for a specific\ngood or service.\nAccording to Zsidisin et al., (2003) TCO helps organisations gain a long-term, system-\noriented understanding of the true cost of doing business but it does not show how a focal\nfirm’s behaviour may affect the upstream organisation’s costs (LaLonde and Pohlen,\n1996).\n3.5 Target Costing\nTarget costing (TC) is according to Cooper and Slagmulder (1999) a technique to\nstrategically manage a company’s future profits. Target costing (TC) is often used as the\nmain tool in inter-organisational cost management (Axelsson et al., 2002) and usually\npracticed in the new product development stage (Cooper and Slagmulder, 1999; Smith and\nLockamy, 2000; Ellram, 2000; Dekker and Smidt, 2003; Ellram, 2006).\nThe selling price is an organisation’s estimation of the market price that can be achieved.\nThe total target cost allowed for the product or service equals estimated sales price less\ndesired profit (Ellram, 2002a, 2006). The first process in TC is the definition of a product’s\nfunctionalities and features, and based on this, an estimation of sales price and profit\ncalculation (Axelsson et al., 2002). The second process is achieving the desired target costs\nat the product level (Cooper and Slagmulder, 1999). The third process is apportionment of\ntarget costs to each important element on bills of materials by combining estimated costs or\nhistoric records of costs and the constraint of the overall target cost (Cooper and\nSlagmulder, 1999; Ellram, 2006).\nThe TC system becomes especially effective when it is linked to form a chain (Cooper and\nSlagmulder, 2003b). The TC system is “chained” when the output of a buyer’s TC system\nbecomes an input to a supplier’s target costing system, which is reflected in the\ntransmission of competitive pressure faced by the firm at the top of the chain to other firms\nin the chain (Cooper and Slagmulder, 2003b).\n4 The inhibiting factors\nThis section addresses the third objective of the paper, which is identifying the inhibiting\nfactors that might prevent the implementation in previous section reviewed costing\napproaches. Firstly is described the method used for the selection and analysis of relevant\nsources and it is then followed by the discussion of identified inhibitors.\n4.1 Methodology\nIn order to identify the inhibitors we have reviewed a number of academic publications\nfocused on inter-organisational relationships, supply chain management and management\naccounting. We approached the review in the systematic way by following the guidelines\nof:\n Evidence-based structured review of the literature (Tranfield et al., 2003) in the\nprocess of formulating search strategy and\n Iterative qualitative evaluation of publications as suggested by Miles and Huberman\n(1994) in the process of literature review and analysis.\nThe formulation of a search strategy consisted of selection of relevant databases, time\nframe and keywords. Databases included Pro-Quest, Ebsco, Emerald and Science Direct.\nThis enabled access to a variety of peer reviewed journals ranging from Accounting,\nOrganizations and Society, Harvard Business Review, Journal of Business Logistics and\nthe Journal of Business and Industrial Marketing. In terms of the time frame we selected\nthe literature published between 1980 and 2007 – the period where the great majority of\npublications on management accounting in inter-organizational relationships and supply\nchain management were published. The selection of the keywords associated with the word\n“inhibitor” was guided by the description of inhibitor by Assink (2006) where it is referred\nto as a “barrier” or something that get in the way of a given development. Words with\nsimilar meaning to inhibitor like inhibiting factors, barriers, impediments, issues and\nproblems were then combined with other IOC related terminology to form search strings.\nTo ensure the relevance of identified literature we have firstly filtered search results on the\nbasis of titles and abstracts. This has allowed filtering out the literature from non-related\nfields and topics that was included in initial search results due to data base and key-word\nsearch shortcomings. The remaining set of literature was subjected to an iterative\nqualitative evaluation (Miles and Huberman, 1994) consisted of three steps.\nIn the first step we determined criteria for inclusion in the research. A publication had a) to\nbe empirical or theoretical b) to address the topic of management accounting in intra or\ninter-organisational context and c) to include debates on inhibitors or related terms, as\ndefined by Assink (2006). On the basis of these criteria two of us evaluated publications to\nselect the appropriate ones. The publication was included for further analysis only if both\nresearchers achieved agreement on inclusion. If consent about inclusion was not achieved,\nthey sought advice from other authors. The final selection comprised 67 papers and five\nbooks.\nThe second step involved reviewing each publication in order to identify inhibitors and\nrelated discussions. The two lead researchers publications identified in step one, searching\nfor evidence of inhibitors or inhibiting events. Fifteen theoretical and eighteen empirical\npapers contained discussions from which it was possible to extract the inhibitors, whereas\nthe rest of the literature helped to substantiate our discussion. Both researchers created a\nsummary report that consisted of description of inhibitors and\/or inhibiting events. The\ncontent of the reports was then discussed between researchers and at the end the lead\nresearchers summarised the findings in a single table.\nWhile conducting the second step an early analysis was carried out. Miles and Huberman\n(1994) recommend early analysis because it helps researcher to “cycle back and forth\nbetween thinking about existing data and generating strategies for collecting new, often\nbetter data” (p. 50). The analysis showed that many inhibitors are intra-organisational in\nthe nature and as such inhibit further inter-organisational costing developments. Thus, a\nsearch for new literature was conducted following the steps already described. That has\nresulted at the end in a total of eighteen theoretical (see Table I) and twenty-four empirical\npapers (see Table II).\nTable I: Phenomenon studied from theoretical sources\nSources of theoretical evidences on IOC approaches and implementation concerns\nPhenomenon studied Author(s)\n Target costing in the context of supply chains\n Target costing in the inter-organisational environment\n ABC as a strategic costing method to manage business operations\n ABC as a tool for determining cost for marketing and logistics activities\n ABC as a tool for measuring supply chain costs, information integration issues\n ABC as a costing method in the supply chain context\n ABC – overview, design and implementation in an intra-organisational context\n ABC\/ABM as an approach to the management of staff activities\n Cost-to-Serve Method and its applicability\n Costing data and information integration in the supply chain context\n Strategic cost management beyond the boundaries of the firm\n Management accounting techniques for supply chain management\n Supply chain costing methods and associated issues\n Challenges for cost management practices in new enterprise environment\n Disclosure of sensitive costing data in business relationships\n Cost measuring and data sharing in supply chain context\n Cost accounting and cost management in the network relationships\n Management accounting and supply chain management\n Smith and Lockamy (2000)\n Cooper and Slagmulder (2003a, 2003b)\n Thomson and Gurowka (2005)\n Stapleton et al. (2004)\n Cokins (2000)\n Lin et al. (2001)\n Cokins (1998)\n Armstrong (2002)\n Braithwaite and Samakh (1998)\n LaLonde (2003)\n Cooper and Slagmulder (1998)\n Ramos (2004) and Axelsson et al. (2002)\n LaLonde and Pohlen (1996)\n Gupta and Gunasekaran (2004)\n Munday (1992)\n Cokins (2003)\n Kulmala et al. (2002)\n Ramos (2004)\nTable II: Phenomenon studied from empirical sources\nSources of empirical evidences on IOC approaches and implementation concerns\nPhenomenon studied Industry \/ Country Methodology Author(s)\nABC  Wholesaler textile \/ Singapore\n Manufacturing equipment sector \/ Belgium\n Cross sectoral: banking services, food industry,\nsteel industry, third party logistics provider\n Case study\n Case study\n Multiple case studies\n Fernie et al. (2001)\n Waeytens and Bruggeman (1994)\n Kaplan and Anderson (2004)\nDPP\n Retail supermarket chain \/ U.S.\n Retail textile \/ UK\n Wholesaler textile \/ Singapore\n Case study\n Case study\n Case study\n Borin and Farris (1990)\n Doherty et al. (1993)\n Fernie et al. (2001)\nCS  3PL service delivery\n Manufacturing industry\n Case study\n Case study\n Ross et al. (2007)\n Gebert et al. (1996)\nTCO  Cross sectoral \/ U.S.: random sample\n Cross sectoral \/ U.S.: public utility, IT\nmanufacturing, hi-tech manufacturing, oil\nproduction, consumer and industrial products\nmanufacturing (industries not randomly selected)\n Cross sectoral \/ U.S\n Cross sectoral \/ U.S.: oil, semiconductor,\nsemiconductor consortium, telecommunication\nequipment and support, transportation,\ndefence\/electronics, diversified\nelectronics\/computer, medical systems,\ndefence\/aviation, process industry\n Manufacturing industry \/ U.S.\n Cross sectoral, U.S.: heavy equipment\nmanufacturing, semiconductors, consumer\nproducts, telecommunications, industrial air\nproducts and chemicals\n Survey\/261 responses\n Nine case studies\n Survey\/sample N\/A\n Eleven case studies\n Survey\/146 responses\n Five case studies\n Zsidisin et al. (2003)\n Ellram (1994)\n Milligan (1999)\n Ellram and Siferd (1998)\n Ferrin and Plank (2002)\n Ellram (2002b)\nTC  Construction sector \/ UK\n Cross sectoral \/ U.S.: random sample\n Cross sectoral \/ U.S.: heavy equipment\nmanufacturing, semiconductors, consumer\nproducts, telecommunications, industrial air\nproducts and chemicals\n Cross sectoral \/ U.S.: computer peripherals,\nsemiconductors, manufacturing equipment,\nconsumer products, electronic equipment,\ntelecommunication service & equipment,\naerospace, transportation service, automotive\n Cross sectoral \/ Netherlands: food, textile,\npublishing\/paper, chemicals\/pharmaceuticals,\nrubber, steel, fabricated metals,\nelectrical\/electronics, transportation equipment,\nprecision equipment\n Two case studies\n Survey\/261 responses\n Five case studies\n Eleven case studies\n Survey\/32 responses\n Nicolini et al. (2000)\n Zsidisin et al. (2003)\n Ellram (2002b)\n Ellram (2002a)\n Dekker and Smidt (2003)\nCost management\ndevelopment projects\n Manufacturing sector \/ Finland  Three case studies  Kulmala (2004)\nValue chain analysis in\ninter-organisational context\n Retailing sector \/ UK  Case study  Dekker (2003)\nInter-organisational cost\nmanagement systems\n Manufacturing sector \/ Japan  Case study  Cooper and Yoshikawa (1994)\nInter-organisational cost\nmanagement practices\n Manufacturing sector \/ Japan  Three case studies  Cooper and Slagmulder (2004)\nInter-firm supply chains\nand cost management\npractices\n Cross sectoral \/ U.S. and UK: manufacturing\nequipment, automotive, construction\n Three case studies  Cullen et al. (1999)\nInter-firm accounting in\nsupply chains\n Manufacturing equipment \/ UK  Case study  Seal et al. (2004)\nCosting knowledge in\nsupply relationships\n Cross sectoral \/ US: manufacturing, merchant\nretailers, third parties providers and services\n 24 case studies followed by\nsurvey (84 responses)\n Norek and Pohlen (2001)\nOpen book accounting in\ncustomer supplier\nrelationships\n Cross sectoral \/ Germany and Finland: automotive\nparts manufacturing, industrial products\nmanufacturing\n Multiple case studies  Kajüter and Kulmala (2005)\nSummary data from the literature were then analysed in the third step. The aim was to\nidentify and extract the inhibiting factors from previously identified inhibiting events.\nResearchers firstly extracted inhibiting factors individually and then compared notes with\nthe others. The aim was to achieve consent among researchers’ interpretations on what is\nthe inhibitor in a given event. If that was not achieved, advice was sought from other team\nmembers. The output of this process was a table with 42 different inhibitors and it is\npresented in the next section.\nInhibitors were then grouped in three overlapping categories. The objective of this paper is\nto identify and describe the inhibitors, rather then to come up with an explicit taxonomy.\nCategories were agreed between us on the basis of the most frequently specified enablers\nof inter-organisational integration initiatives, which are: IT system integration\n(Gunasekaran and Ngai, 2004), process integration (Bowersox et al., 1999) and relational\nintegration (Gummesson, 1999; Lambert et al., 1998). Following the same process as in\nthe previous step, we assigned each inhibitor to one or more proposed groups.\n4.2 The inhibitors\nHere we present results of the literature analysis. In total 42 inhibitors were identified.\nThey are listed in alphabetical order in Table III. These inhibitors are then grouped in\ncategories and presented in Figure 2. Within each group inhibitors the most frequently\nspecified are then explained in terms of how they inhibit implementation of IOC\napproaches.\nTable III: Inhibitors of the implementation of the IOC approaches\n# Inhibitors Author(s)\n1 Absence of cross functional teams Cullen et al. (1999); Ellram (2002a, 2002b), Ramos (2004)\n2 Absence of expert knowledge to cost the activities LaLonde and Pohlen (1996); Seal et al. (2004)\n3 Absence of link between performance measurement systems and costs LaLonde and Pohlen (1996); Thomson and Gurowka (2005)\n4 Absence of management skills by management accountants Cullen et al. (1999), Ramos (2004)\n5 Absence of skills in managing IOC models Cokins (1998)\n6 Absence of supplier involvement Ellram (2002a)\n7 Absence of supply management people involvement Ellram (2006)\n8 Absence of the recognition that costing systems are necessary Kulmala et al. (2002); Gupta and Gunasekaran (2004)\n9 Adversarial character of business relationships Cooper and Yoshikawa (1994); Nicolini et al. (2000)\n10 Complicated tracing of resource costs LaLonde and Pohlen (1996);\n11 Conflict between management incentives and long-term perspective Ferrin and Plank (2002)\n12 Credibility of internal costing data Milligan (1999); Ellram (2002b)\n13 Credibility of reported numbers Ellram (2002b)\n14 Data manipulation and improper use of data Ellram and Siferd (1998)\n15 Disagreements on implementation approach Kajüter and Kulmala (2005)\n16 Idle time reporting in the IOC design phase Cokins (2003)\n17 Inability to determine market prices Nicolini et al. (2000)\n18 Inability of external information integration LaLonde (2003); Ramos (2004)\n19 Inability of internal information integration Cokins (1998); LaLonde (2003)\n20 Inability to change costing data collection \/ analysis for external sharing Munday (1992); Nicolini et al. (2000)\n21 Inconsistent use of costing language Thomson and Gurowka (2005)\n22 Information appropriation\nShank and Govindarajan (1988); Cooper and Yoshikawa (1994);\nEllram and Siferd (1998); Axelsson et al. (2002); Ellram (2002b);\nSeal at al (2004); Kajüter and Kulmala (2005)\n23 Insufficient level of detail in shared financial data Munday (1992)\n24 Lack of differentiation of costing systems based on customers dynamics Smith and Lockamy (2000)\n25 Lack of focus on people Cokins (1998)\n26 Lack of internal interest for change in costing approaches Axelsson et al. (2002)\n27 Lack of internal understanding of costs Cokins (2000); Nicolini et al. (2000); Norek and Pohlen (2001);Kulmala et al. (2002); Cokins (2003)\n28 Lack of management support Ellram (2002a); Ellram (2002b); Seal et al. (2004)\n29 Lack of process oriented accounting systems Ellram (1994); Cullen et al. (1999); Smith and Lockamy (2000);Ellram (2002b); Ramos (2004)\n30 Lack of resources for complex cost tracing and relationship building\nBorin and Farris (1990); LaLonde and Pohlen (1996); Milligan\n(1999); Nicolini et al. (2000); Stapleton et al. (2004); Kajüter and\nKulmala (2005)\n31 Lack of training and education of all costing information users Ellram (2002b); Thomson and Gurowka (2005)\n32 Legacy of functional silo and the absence of process thinking Ellram (1994); Ellram and Siferd (1998); Fernie et al. (2001)\n33 Loss of customer focus Lin et al. (2001)\n34 Low perception for IOC implementation and accountability for results Cokins (2000); Zsidisin et al. (2003)\n35 Need for development of new supply chain leaders Ellram (1994); LaLonde (2003)\n36 Over complex IOC systems Cokins (1998); Kaplan and Anderson (2004)\n37 Poor internal availability of data\nBorin and Farris (1990); LaLonde and Pohlen (1996); Milligan\n(1999); Lin et al. (2001); Kulmala et al. (2002); LaLonde (2003);\nKajüter and Kulmala (2005)\n38 Poor IOC model design Waeytens and Bruggeman (1994); Cokins (1998)\n39 Slow response to change Fernie et al. (2001)\n40 Underestimation of organisational resistance to change Ellram (1994); Cokins (1998); Ellram and Siferd (1998); Lin et al.(2001)\n41 Uneven sharing of benefits Kulmala (2004); Kajüter and Kulmala (2005); Cooper andSlagmulder (1998)\n42 Unwillingness to share information two ways\nShank and Govindarajan (1988); Cooper and Yoshikawa (1994);\nLaLonde and Pohlen (1996); Norek and Pohlen (2001); Kulmala\net al. (2002); Cooper and Slagmulder (2003); Kulmala (2004);\nKajüter and Kulmala (2005)\nFigure 2: Grouping of IOC implementation inhibitors\n4.2.1 People-related inhibitors\nThe adversarial character of business relationships accompanied by the absence of trust\nand imbalance of power between organisations is a well known reality in many\norganizations. Cooper and Yoshikawa, (1994) and Nicolini et al., (2000) argue that this\naspect of inter-organizational relationships makes application of costing approaches\nparticularly difficult. The difficulties arise from organizational reluctance to share sensitive\ncost information and concerns related to information appropriation.\nThe unwillingness of organisations to share cost information has two obvious\nconsequences:\na) It prevents accurate costing of activities outside the organisation (Lalonde and\nPohlen, 1996),\nb) It leads to the loss of costing information transparency which is one of the\nprerequisites for establishing trust in business relationships (Lamming, 1993).\nPeople\n2, 3, 4, 5, 8, 9, 11,\n14, 15, 21, 22, 25,\n26, 27, 28, 31, 32,\n34, 35, 39, 40, 41,\n42\n1, 6, 7, 16,\n17, 24, 30,\n33, 36, 38\n12, 13,\n20, 23\n29 10, 18,\n19, 37\nTechnology Process\nInformation shared in one direction only may affect confidence in the buyer-supplier\nrelationship (Norek and Pohlen, 2001) and result in a conditional openness in the\nrelationship (Kulmala, 2004). The situations where disclosure of sensitive information is\ndemanded and does not happen on a voluntarily basis is likely to be the environment where\nimplementation of IOC programmes will experience problems.\nSuppliers, as usually less powerful parties in business relationships, are somehow\n“expected” to disclose costing information to their buyers (Munday, 1992) and to comply\nwith what the more powerful party is demanding (Norek and Pohlen, 2001). Further,\nsuppliers often feel threatened that costing information will be used against them. Kajüter\nand Kulmala (2005) for example stress in their empirical study that information\nappropriation concerns are manifested in a fear of suppliers “being exploited if they reveal\ntheir cost structure”. Similarly, as corroborated in the study by Dekker (2003), information\nappropriation concerns triggered suppliers’ opportunistic behaviour in order to protect their\nposition in the market.\nOrganisational resistance to change is an issue which is according to Ellram and Siferd\n(1998) grossly underestimated in the IOC implementation initiatives. They pointed out that\nresistance to change in initiatives that span organisational borders, represents a “dual\nchallenge” because the change involves both buying and supplying organisations. Fernie et\nal. (2001) point out that slow response to change from the large and complex organisation\nrepresents a particular problem for successful implementation of costing systems. The\nimplementation of IOC programmes between the focal organisation and its upstream or\ndownstream partners requires a strong emphasis on the social dimension of the project\n(Cokins, 1998). IOC programmes are socio-technical projects which require not only\nsuccessful technical implementation, but also changes in people’s behaviour. Resistance to\nchange is natural: a status quo situation is often preferred (Cokins, 1998). This should not\ncome as a surprise for IOC implementation teams. For instance, Ellram (1994) reports\nresistance to change as one of the main barriers in implementing TCO models in\norganisations. However, the degree of resistance depends in part on organisational culture\nand the complexity of IOC initiatives (Ellram and Siferd (1998) and it will vary from one\norganisation to another.\nLack of managerial support, described in the organisational change literature, is one of the\nmost frequent reasons why transformation efforts in organisations fail (Kotter, 1995).\nFindings from our analysis indicate this issue to be a frequent inhibitor. Seal et al.’s (2004)\nempirical study on inter-firm accounting in supply chains shows that lack of management\nsupport partly hindered the efforts of institutionalization of inter-organisational accounting.\nThe argument from the other perspective presented by Ellram (2002a, 2002b) is that\ninvolvement of management in implementation efforts provides “the knowledge,\ncooperation, and commitment needed to increase the likelihood that target costing will be\nsuccessful within an organisation” (Ellram, 2002a, p.243).\nThe legacy of functional silo and the absence of process thinking in organisations are also\nrecognised as being inhibitors for successful implementation of IOC programmes (Ellram,\n1994; Ellram and Siferd, 1998; Fernie et al., 2001). IOC approaches require a shift in\nthinking from functional silo to seamlessly integrated business processes. Retaining\ninformation about products, services, processes and costs within functions inhibits an\norganisation’s responsiveness. Even organisations with excellent technology that support\nthe process-oriented view find that deeply imbedded functional silo thinking prevents\ncollaboration and sharing information internally – which further prevents the\norganisational responses to collaboration and sharing information externally.\nSeveral inhibitors are grouped around the lack of understanding of costs and\n(non)possession of costing knowledge\/expertise. Internal understanding of costs and\npossession of costing knowledge is seen as a prerequisite for successful implementation of\nIOC approaches (LaLonde and Pohlen, 1996; Cokins 2000, 2003; Norek and Pohlen,\n2001). Cokins (2000) argues that only by having an internal understanding of how\norganisations create costs will they be able to begin discussions about opportunities for\njoint cost reduction.\nThe need for internal understanding of costs requires organisations to form expert, cross-\nfunctional teams from the beginning of a new IOC programme. LaLonde and Pohlen\n(1996) stress that the use of expert knowledge in the process of identifying activities\nperformed by other organisations can help to solve the problems associated with costing\nactivities that span organisational borders. Therefore, related inhibitors include the absence\nof expert knowledge (Seal et al., 2004), the absence of management skills by management\naccountants (Cullen et al., 1999; Ramos, 2004), the absence of skills in managing IOC\nmodels (Cokins, 2000) and the lack of training and education for all cost information users\n(Ellram, 2002b; Thomson and Gurowka, 2004).\nLastly we found conflict between management incentives and a long-term perspective.\nFerrin and Plank (2002) stress that costs in an organisation should be examined from a\nlong-term perspective. The same view should be adopted for weighting between the\npotential benefits and costs associated with the implementation of IOC programmes. The\nresource-intensive nature of IOC programmes could negatively affect an organisation’s\nshort-term financial performance, departmental and organisational efficiency and\/or\nutilisation of assets, among others. This, in spite of potential long term benefits of IOC\nimplementation, represents a threat for the organisation’s management which is often\nmeasured on a short-term basis.\n4.2.2 People-Process related inhibitors\nHere we analyse inhibitors related to “with whom” and “how” organisations approach to\nimplementation of IOC programmes. The degree of difficulty of implementation vary\namong organisations for several reasons - such as differences in complexity of costing\nmodels, complexity of operations, resource availability and an organisation’s cultural\nissues. The dispersion (Ellram, 1994), embedded functional knowledge in organisations\nand knowledge-intensive requirements of IOC implementations, call for the formation of\ncross-functional implementation teams (Cullen et al., 1999; Ellram, 2002a, 2002b; Ramos,\n2004). Formation of such teams should bridge organisational borders (Ramos, 2004).\nBased on the experience with implementation of target costing in U.S. manufacturing\nindustry, Ellram (2002b) stresses that the whole process is most effectively undertaken if it\ninvolves cross-functional teams, including suppliers, from the start.\nFurther findings indicate that poorly designed and over-complex IOC models lead to\nimplementation failure (Waeytens and Bruggeman, 1994; Cokins, 1998; Kaplan and\nAnderson, 2004). The experience in implementing ABC systems captured by Cokins\n(1998) shows that organisations need to be very precise and clear in the early model design\nphase when it comes to requirements for costing data accuracy and costing data details.\nFailure to achieve this will result in an over-complex costing model that contains\nunnecessary data (Cokins 1998), unmaintainable quantity of data (Kaplan and Anderson,\n2004) and data which are likely to be unsuitable for intra- and inter-organisational sharing.\nAnother inhibitor is an organisation’s lack of resources to support the process of\nimplementation of IOC programmes. Lack of resources is manifested in many different\nways. Experience of implementation of TCO (Milligan, 1999), ABC (Stapleton et al.,\n2004) and open book accounting (Kajüter and Kulmala, 2005) shows demanding, labour-\nintensive and costly implementation processes as a serious concern and limitation.\nImplementation efforts are not only constrained by a lack of resources which are internal to\nthe organisation. Kajüter and Kulmala (2005) show in their research that lack of external\nresources can be equally problematic. In their study on adoption of open-book accounting\nin manufacturing industry, one of six key reasons of adoption failures lies in the supplier’s\nlack of resources for supporting the development of accounting systems that can\nreasonably support open-book practices.\n4.2.3 Technology related inhibitors\nAccording to Davenport et al. (2004), in the 1990’s many organisations had started with\nthe introduction of Enterprise Resource Planning (ERP) systems in order to deliver a\ncommon, organisation-wide information infrastructure for their employees. Although the\nadoption of ERP systems delivered substantial benefits for organisations, two major\nlimitations of these systems are still present (Akkermans et al., 2003): insufficient\nextended enterprise functionality and lack of functionality beyond managing transactions.\nEven newer products such as supply chain management systems (SCM), supplier\nrelationship management systems (SRM), and customer relationship management systems\n(CRM) reside on the transactional layer provided by ERP systems although many vendors\nclaim to have business process orientation (Chopra and Meindl, 2003).\nThe findings from the analysis suggest that current IT systems which are in place in\norganisations lack process orientation. In such organisations cannot adequately support the\nprocess-oriented nature of IOC programmes. Ellram (1994) stresses in her research on\nTCO models that a lack of appropriate information systems is the major resource-related\nproblem to support TCO implementation initiatives. Smith and Lockamy (2000) state that\nsuccessful adoption of supply chain management practices together with appropriate\ncosting systems will require the adoption of process and customer oriented information\nsystems. This view is consistent with that of Ramos (2004) who argues that new\naccounting information systems should be specifically concerned with shared processes\nand activities in an inter-organisational context. The successful adoption of SCM practices\ntogether with appropriate costing systems requires the adoption of process- and customer-\noriented information systems, which will enable firstly internal information integration and\nlater external integration with upstream and downstream partners (Davenport et al., 2004).\n4.2.4 Process-Technology related inhibitors\nThe need for internal and external information integration, remains an unresolved issue and\na key inhibiting factor for inter-organisational cost information sharing in many\norganisations (Cokins, 1998; LaLonde, 2003). The management and execution of supply\nchain business processes depends on accurate, forecast, and interchangeable information.\nGrubic et al. (forthcoming) stressed concerns relating to the of understanding of\ninformation flow that must support supply chain processes. In order to achieve inter-\ncompany business process integration, both physical system integration and application\nintegration must be present (Rudberg et al., 2002). Although there are some initiatives in\nresolving this issue, as with the enterprise application integration (EAI) presented in\nMöller (2005), complete IT system inter-operability is measured in years or even decades\naccording to Davenport and Brooks (2004).\nPrior to resolving integration-related issues the problem of availability of internal costing\ndata should be addressed. For an organisation which has poor availability of costing data\ninternally, it is practically impossible to share such data with external parties. Kulmala et\nal. (2002) state that even if there is a will for sharing information externally, “the ability to\nproduce needed information is also necessary”. This particular problem can be observed\nquite early in organisational attempts to adopt IOC programmes. In their study on DPP as a\ndecision support in the retail sector, Doherty et al. (1993) report the difficulties in\nobtaining required costing data or in some occasions its complete non-existence. LaLonde\nand Pohlen (1996) stress that some organisations may not have the capability to relate\nresource costs to a specific activity, and most of them have not even adopted costing\napproaches which would enable them to provide costing information at the activity level.\nThis means that they would be unable to satisfy either internal or external needs for costing\ninformation.\n4.2.5 People-Technology-Process related inhibitors\nOrganisations often do not trust their internal costing data (Milligan, 1999; Ellram, 2002b;\nCokins 2003). Credibility of data is an important factor for the overall success of\nimplementation of IOC approaches (Ellram, 2002b), and if it is overlooked by\norganisations, it can have various negative consequences. Speculation about the validity of\nthe basis for decision making is one example. Milligan (1999) illustrates an example of\npurchasing managers from organisations where TCO systems are in place who state, that\ntheir TCO systems are “vague, inaccurate or otherwise untrustworthy” (p. 22). Many\norganisations operate with “a resigned acceptance” (Cokins, 2003) that their internal\ncosting data are of poor quality and do not reflect a realistic situation. Ellram (2002b)\nargues that low credibility of costing data is certainly not likely to lead to success of IOC\napproaches. Furthermore, management in organisations should keep in mind that costing\ninformation collected through the process of tracing resource costs for internal purposes\nmay not always be suitable for sharing externally. This difference in the form and nature of\ncosting information for internal and external sharing calls for a change in the way\norganisations collect and process costing data (Munday, 1992). Changes to internal cost\ncollection policies should be accompanied by efforts to define a sufficient level of detail in\ncosting data (Munday, 1992) and determination of collaborative costs (Nicolini et al.,\n2000).\n5 Conclusions\nInter-organisational costing is an important topic for logistics and SCM. Both academics\nand practitioners have shown that decision making in a supply chain context is suboptimal\nwithout the relevant costing information. This can become even greater challenge in an\ninter-organisational context. We have demonstrated in our paper that traditional accounting\npractices do not fulfill their role supporting inter-organisational decisions. Contemporary\naccounting approaches overcome some of the shortcomings of traditional accounting\npractices. However, none of them is a panacea for all the problems that traditional\naccounting is facing in an inter-organisational context. An implementation of IOC\nprogrammes can encompass one or more costing approaches, depending on the purpose of\nthe implementation. While managers are facing new challenges in searching for more\nsustainable competitive advantage outside their organisations, they have little guidance on\npotential challenges related to adoption and implementation of IOC programmes.\nOur analysis is the first systematic study that has uncovered the complexity of problems\nthat hinder organisations in the process of implementing IOC programmes. As such it\nprovides some answers for limited adoption of IOC approaches in intra- and inter-\norganisational context. The diversity of inhibiting factors suggests that we are indeed\ndealing with a complex inter-disciplinary phenomenon. This challenges a traditional\npreoccupation with the view that only IT and reduction of operational complexity are\nsolutions for management of supply chain initiatives like implementation of IOC\nprogrammes. Human behaviour both inside and outside of a focal firm is reflected in many\ninhibitors identified in this study. We argue that implementation of IOC initiatives should\nnot be seen as a technical implementation of something like an advanced IT system. It\nshould rather be seen as a complex socio-technical process, which requires a strong\nemphasis on people internally and externally. We support authors like Nicolini et al.\n(2000), Norek and Pohlen (2001) and Rudberg et al. (2002) who argue that successful\nimplementation of IOC programmes heavily depends on development of organisation’s\ninternal capabilities such as; knowledge and understanding of costs, allocation of human\nresources and internal information integration. Overcoming internal barriers is a necessary\nstep prior to investment of efforts and resources in external activities.\nCurrent frameworks for implementing IOC approaches, while they are talking about\nimplementation steps (see for example Ellram, 2002a, Cooper and Slagmulder, 2003b),\nthey are providing limited or no visibility of potential obstacles during the implementation\nprocess. In that sense the identification of inhibitors contribute to reduction of\nimplementation risk, if it is used by managers as an informative document prior and during\nthe implementation process. With some additional work by linking inhibitors identified in\nthis study to a specific implementation step current IOC implementation frameworks can\nbe greatly improved.\nWe set out to review both empirical and theoretical literature to explore inter-\norganisational costing approaches. We remain on the conceptual level and so we are\nlimited by the methodology used for selection and analysis of the literature. It is possible\nthat selection of different sources could have resulted in difference in emphasis. We\nmanaged to reinforce the point made by Dekker (2003) that we need further research on\nobstacles hindering firms from (jointly) executing inter-organisational programmes. We\nhave shown that the scope of the issues that surround the implementation of IOC\napproaches is much greater then it was imagined till now. The paper offers a starting point\nfor more focused research that will address the issues surrounding a specific inhibitor.\nHowever, by taking a broad view of the presence of inhibitors, interdisciplinary empirical\nresearch is required to thoroughly understand the issues and offer a better guidance to\nmanagers.\n6 References\nAkkermans, H. A., Bogerd, P., Yucesan, E. and van Wassenhove, L.N. (2003), “The\nimpact of ERP on supply chain management: Exploratory findings from European\nDelphi study”, European Journal of Operational Research, Vol. 146 No. 20, pp. 284-\n301.\nArmstrong, P. (2002), “The costs of activity-based management”, Accounting,\nOrganizations and Society, Vol. 27 No. 1\/2, pp. 99-120.\nAssink, M. (2006), “Inhibitors of disruptive innovation capability: a conceptual\nmodel”, European Journal of Innovation Management, Vol. 9 No. 2, pp. 215-233.\nAxelsson, B., Laage-Hellman, J., Nilsson, U. (2002), “Modern management accounting\nfor modern purchasing”, European Journal of Purchasing & Supply Chain\nManagement, Vol. 8 No. 1, pp. 53-62.\nBlocher, E.J., Chen, K.H., Cokins, G., Lin, T.W. (2005), Cost Management: A\nStrategic Emphasis (3rd ed.), McGraw-Hill\/Irwin, New York, NY.\nBookbinder, J.H., Zarour, F.H. (2001), “Direct product profitability and retail shelf-\nspace allocation models”, Journal of Business Logistics, Vol. 22 No. 2, pp. 183-208.\nBorin, N., Farris, P. (1990), “An Empirical Comparison of Direct Product Profit and\nExisting Measures of SKU Productivity”, Journal of Retailing, Vol. 66 No. 3, pp. 297-\n314.\nBowersox, D., Closs, D.J., Stank, T.P. (1999), 21st Century Logistics: Making Supply\nChain Integration a Reality, Council of Logistics Management, Oak Brook, IL\nBraithwaite, A. Samakh, E. (1998), “The Cost-to-Serve Method”, The International\nJournal of Logistics Management, Vol. 9, No. 1, pp. 66-84.\nChristopher, M. (1998), Logistics and Supply Chain Management, Financial Times,\nPrentice Hall, Great Britain.\nChristopher, M. (2005), Logistics and Supply Chain Management – Creating Value-\nAdding Networks, (3rd edition), Financial Times, Prentice Hall, Great Britain\nChopra, S., Meindl, P. (2003), “What will drive the enterprise software shakeout?”,\nSupply Chain Management Review, Vol. 7 January-February, pp. 50-57.\nCIMA (2000), Management accounting official terminology, 2000 edition, CIMA,\nLondon\nCokins, G. (1998), “Why is Traditional Accounting Failing Managers?”, Hospital\nMaterial Management Quarterly, Vol. 20 No. 2, pp. 72-80.\nCokins, G. (2000), “Measuring Costs Across the Supply Chain”, AACE International\nTransactions, pp. 1-8.\nCokins, G. (2001), “Measuring Costs Across the Supply Chain”, Cost Engineering,\nVol. 43 No. 10, pp. 25-31.\nCokins, G. (2003), “Measuring profits and costs across the supply chain for\ncollaboration”, Cost Management, Vol. 17 No. 5, pp. 22-29.\nCooper, R., Slagmulder, R. (1998), “Strategic Cost Management”, Management\nAccounting, Vol. 79 No. 9, pp. 19-20.\nCooper, R., Slagmulder, R. (1999), “Develop Profitable New Products with Target\nCosting”, Sloan Management Review, Vol. 40 No. 4, pp. 23-33.\nCooper, R., Slagmulder, R. (2003a), “Interorganizational costing – Part 1”, Cost\nManagement, Vol. 17 No. 5, pp. 14-21.\nCooper, R., Slagmulder, R. (2003b), “Interorganizational costing – Part 2”, Cost\nManagement, Vol. 17 No. 6, pp. 12-24.\nCooper, R., Slagmulder, R. (2004), \"Interorganizational cost management and\nrelational context\", Accounting, Organizations and Society, Vol. 29 No. 1, pp. 1-26.\nCooper, R., Yoshikawa, T. (1994), “Inter-organizational cost management systems:\nThe case of the Tokyo-Yokohama-Kamakura supplier chain”, International Journal of\nProduction Economics, Vol. 37 No. 1, pp. 51-62.\nCullen, J., Berry, A.J., Seal, W., Dunlop, A., Ahmend, M., Marson, J. (1999),\n“Interfirm supply chains: the contribution of management accounting”, Management\nAccounting, Vol. 77 No. 6, p. 30-32.\nDavenport, T. H., Brooks, J. D. (2004), “Enterprise systems and the supply chain”,\nJournal of Enterprise Information Management, Vol. 17 No. 1, pp. 8-19.\nDavenport, T. H., Harris, J. G., Cantrell, S. (2004), “Enterprise systems and ongoing\nprocess change”, Business Process Management Journal, Vol. 10 No. 1, pp. 16-26.\nDekker, H., Van Goor, A. R. (2000), “Supply Chain Management and Management\nAccounting: A Case Study of Activity-Based Costing”, International Journal of\nLogistics: Research and Applications, Vol. 3 No. 1, pp. 41-52.\nDekker, H.C. (2003), \"Value chain analysis in interfirm relationships: a field study\",\nManagement Accounting Research, Vol. 14, No. 1, pp. 1-23.\nDekker, H., Smidt, P. (2003), “A Survey of the adoption and use of target costing in\nDutch firms”, International Journal of Production Economics, Vol. 84 No. 3, pp. 293-\n305.\nDoherty, C., Maier, J., Simkin, L. (1993), “DPP Decision Support in Retail\nMerchandising”, OMEGA, International Journal of Management Sciences, Vol. 21 No.\n1, pp. 25-33.\nDyer, J.H., Singh, H. (1998), “The Relational View: Cooperative Strategies and\nSources of Interorganizational Competitive Advantage, Academy of Management\nReview, Vol. 23, No. 4, pp. 660-679.\nEllram, L.M. (1994), “A taxonomy of total cost of ownership models”, Journal of\nBusiness Logistics, Vol. 15 No. 1, pp. 171-191.\nEllram, L.M. (2000), “Purchasing and Supply Management’s Participation in the\nTarget Costing Process”, Journal of Supply Chain Management, Vol. 36 No. 2, pp. 39-\n51.\nEllram, L.M. (2002a), “Supply management’s involvement in the target costing\nprocess”, European Journal of Purchasing & Supply Management, Vol. 8 No. 4, pp.\n235-244.\nEllram, L.M. (2002b), “Strategic Cost Management in the Supply Chain: A Purchasing\nand Supply Management Perspective” (pp. 16-18). CAPS Research.\nEllram, L.M. (2006), “The Implementation of Target Costing in the United States:\nTheory Versus Practice”, Journal of Supply Chain Management, Vol. 42 No. 1, pp. 13-\n26.\nEllram, L.M., Hendrick, T.E. (1995), “Partnering Characteristics: A Dyadic\nPerspective”, Journal of Business Logistics, Vol. 16 No. 1, pp. 41-64\nEllram, L.M., Siferd, S.P. (1993), “Purchasing: The cornerstone of the total cost of\nownership model”, Journal of Business Logistics, Vol. 14 No.1, pp. 163-184.\nEllram, L.M., Siferd, S.P. (1998), “Total cost of ownership: a key concept in strategic\ncost management decisions”, Journal of Business Logistics, Vol. 19 No. 1, pp. 55-84.\nFernie, J., Freathy, P., Tan, E-L. (2001), “Logistics Costing Techniques and their\nApplication to a Singaporean Wholesaler”, International Journal of Logistics:\nResearch and Applications, Vol. 4 No. 1, pp. 117-131.\nFerrin, B.G., Plank, R.E. (2002), “Total Cost of Ownership Models: An Exploratory\nStudy”, Journal of Supply Chain Management, Vol. 38 No. 3, pp. 18-29.\nGebert, P., Goldenberg, C. B., Peters, D. (1996), “Managing customers through cost-\nto-serve”, CMA, Vol. 70 No. 7, pp. 22-23.\nGrubic, T., Bastl, M., Fan, I-S., Harrison, A. (forthcoming), “Towards the Integrative\nSupply Chain Model”, International Journal of Logistics: Research and Application\nGummesson, E. (1999) Total Relationship Marketing, Butterworth-Heinemann, Oxford\nGupta, K. M., Gunasekaran, A. (2004) “Costing in new enterprise environment - A\nchallenge for managerial accounting researchers and practitioners”, Managerial\nAccounting Journal, Vol 20 No 4, pp. 337-357\nGunasekaran, A., Ngai, E.W.T. (2004), “Information Systems in Supply Chain\nIntegration and Management, European Journal of Operational Research, Vol. 159,\nNo. 2, pp. 269-295.\nHakansson, H., Ford, D. (2002), \"How should companies interact in business\nnetworks?\", Journal of Business Research, Vol. 55, No. 2, pp. 133-139.\nHughes, A. (2005), “ABC\/ABM – activity based costing and activity-based\nmanagement - A Profitability model for SMEs manufacturing clothing and textiles in\nthe UK”, Journal of Fashion Marketing and Management, Vol. 9 No .1, pp. 8-19\nJohnson, H.T., Kaplan R.S. (1987), Relevance Lost: The Rise and Fall of Management\nAccounting, Harvard Business School Press, Boston.\nKajüter, P., Kulmala, H.I. (2005), “Open-book accounting in networks – Potential\nachievements and reasons for failures”, Management Accounting Research, Vol. 16\nNo. 2, pp. 179-204.\nKamppainen, K, Vepsalainen, A.P.J. (2003), “Trends in industrial supply chains and\nnetworks”, International Journal of Physical Distribution & Logistics Management,\nVol. 33 No. 8, pp. 701-719.\nKaplan, R.S., Anderson, S.R. (2004), “Time-Driven Activity-Based Costing”, Harvard\nBusiness Review, Vol. 82 No. 11, pp. 131-138.\nKotter, J.P. (1995), “Leading Change: Why Transformation Efforts Fail”, Harvard\nBusiness Review, Vol. 73 No. 2, pp. 59-67.\nKoulikoff-Souviron, M., Harrison, A (2007), “The pervasive human resource picture in\ninterdependent supply relationships”, International Journal of Operations &\nProduction Management, Vol. 27 No. 1, pp. 8-27.\nKulmala, H. I. (2004), “Developing cost management in cutomer-supplier\nrelationships: three case studies”, Journal of Purchasing & Supply Management, Vol.\n10 No. 2, pp. 65-77.\nKulmala, H.I., Paranko, J., Uusi-Rauva, E. (2002), “The role of cost management in\nnetwork relationships”, International Journal of Production Economics, Vol. 79 No. 1,\npp. 33-43.\nLaLonde, B. (2003), “Three Problems that Linger”, Supply Chain Management\nReview, Vol. 7 No. 2, pp. 7-8.\nLaLonde, B.J., Pohlen, T.L. (1996), “Issues in Supply Chain Costing”, The\nInternational Journal of Logistics Management, Vol. 7 No. 1, pp. 1-11.\nLambert, D.M., Cooper, M.C. and Pagh, J.D. (1998), \"Supply chain management,\nimplementation issues and research opportunities\", International Journal of Logistics\nManagement, Vol. 9, No. 2, pp. 1-19.\nLamming, R.C. (1993), Beyond Partnership – Strategies for Innovation and Lean\nSupply, Prentice Hall, Harlow, UK\nLin, B., Collins, J., Du, R.K. (2001), “Supply chain costing: an activity-based\nperspective”, International Journal of Physical Distribution & Logistics Management,\nVol. 31 No. 9\/10, pp. 702-713.\nMena, C., Aspinall, R., Bernon, M., Templar, S., Whicker, L. (2004), “Gaining\nvisibility of supply-chain costs”, Logistics and Transport Focus, Vol. 6 No. 7, pp. 54-\n57.\nMilligan, B., (1999), “Tracking total cost of ownership proves elusive”, Purchasing,\nVol. 127 No. 3 pp. 22-23.\nMiles B. M., Huberman, M. A. (1994), Qualitative data analysis: an expanded\nsourcebook, Sage Publications, Thousand Oaks, California.\nMöller, C. (2005), “ERP II: a conceptual framework for next-generation enterprise\nsystems?”, Journal of Enterprise Information Management, Vol. 18 No. 4, pp. 483-\n497.\nMunday, M. (1992), “Buyer-supplier partnerships and cost data disclosure”,\nManagement Accounting, Vol. 70 No. 6, pp. 28-29.\nMyhr, N., Spekman, R.E. (2005), “Collaborative supply-chain partnerships built upon\ntrust and electronically mediated exchange”, Journal of Business and Industrial\nMarketing, Vol. 20 No. 4\/5, pp. 179-187.\nNicolini, D., Tomkins, C., Holti, R., Oldman, A., Smalley, M. (2000), “Can Target\nCosting and Whole Life Costing be Applied in the Construction Industry?: Evidence\nfrom Two Case Studies”, British Journal of Management, Vol. 11 No. 4, pp. 303-324\nNorek, C.D., Pohlen, T.L. (2001), “Cost Knowledge: A Foundation for Improving\nSupply Chain Relationships”, International Journal of Logistics Management, Vol. 12\nNo. 1, pp. 37-51.\nOliver, C. (1990), “Determinants of Interorganizational Relationships: Integration and\nFuture Directions”, Academy of Management Review, Vol. 15, No. 2, pp. 241-265.\nRamos, M.M. (2004) “Interaction between management accounting and supply chain\nmanagement”, Supply Chain Management: An International Journal, Vol 9 No 2, pp.\n134-138\nRoss, A., Jayaraman, V., Robinsons, P., (2007), “Optimising 3PL service delivery\nusing a cost-to-serve and action research framework”, International Journal of\nProduction Research, Vol. 45, No. 1, pp. 83-101.\nRudberg, M., Klingenberg, N., Kronhamn, K. (2002), “Collaborative supply chain\nplanning using electronic marketplaces”, Integrated Manufacturing Systems, Vol. 13\nNo. 8, pp. 596-610.\nSeal, W., Berry, A., Cullen, J. (2004), “Disembedding the supply chain:\ninstitutionalized reflexivity and inter-firm accounting”, Accounting, Organizations and\nSociety, Vol. 29 No. 1, pp. 73-92.\nSeal, W., Cullen, J., Dunlop, A., Berry, T., Ahmet, M. (1999), “Enacting a European\nsupply chain: a case study on the role of management accounting”, Management\nAccounting Research, Vol. 10 No. 3, pp. 303-322.\nShank, J. K., Govindarajan, V. (1988), \"The Perils of Cost Allocation Based on\nProduction Volumes\", Accounting Horizons, Vol. 2 No. 4, pp. 71-79.\nSmith, W.I., Lockamy, A. (2000), \"Target Costing for Supply Chain Management: An\nEconomic Framework\", The Journal of Corporate Accounting & Finance, Vol. 12 No.\n1, pp. 67-77.\nStapleton, D., Pati, S., Beach, E., Julmanichoti, P. (2004), “Activity-based costing for\nlogistics and marketing”, Business Process Management Journal, Vol. 10 No. 5, pp.\n584-597.\nStevens, G. C. (1989), \"Integrating the Supply Chain\", International Journal of\nPhysical Distribution & Materials Management, Vol. 19 No. 8, pp. 3-8.\nTemplar, S. Bernon, M., Mingwei, F. (2004), “Supply Chain Costing – A Road Map”,\nProceedings of Logistics Research Network Conference, Dublin, pp. 510-516.\nTerpend, R., Tyler, B.B., Krause, D.R. Handfield, R.B. (2008), \"Buyer-Supplier\nRelationships: Derived Value Over Two Decades”, Journal of Supply Chain\nManagement, Vol. 44, No. 2; pp. 28-55\nThomson, J., Gurowka, J. (2005), \"sorting out the clutter\", Strategic Finance, Vol. 87\nNo. 2, pp. 27-33.\nTomkins, C. (2001), “Interdependencies, trust and information in relationships,\nalliances and network.” Accounting, Organizations and Society, Vol. 26 No. 2, pp.\n161-191.\nTranfield, D., Denyer, D., Smart, P. (2003), “Towards a Methodology for Developing\nEvidence-Informed Management Knowledge by Means of Systematic Review”, British\nJournal of Management, Vol. 14 No. 3, pp. 207-222.\nZsidisin, G.A., Ellram, L.A., Ogden, J.A. (2003), “The Relationship between\npurchasing and supply management’s perceived value and participation in strategic\nsupplier cost management activities”, Journal of Business Logistics, Vol. 24 No. 2, pp.\n129-154.\nWaeytens, D., Bruggeman, W. (1994), “Barriers to successful implementation of ABC\nfor continuous improvement: A case study”, International Journal of Production\nEconomics, Vol. 36 No. 2, pp. 39-52.\nWouters, M., Anderson, J.C., Wynstra, F. (2005), “The adoption of total cost of\nownership for sourcing decisions - a structural equations analysis\", Accounting,\nOrganizations and Society, Vol. 30 No. 2, pp. 167-191.\nAuthors as they appear in order on the paper\nMarko Bastl\nCentre for Logistics and Supply Chain Management, Cranfield School of Management,\nCranfield, UK\nE-mail: marko.bastl@cranfield.ac.uk, Tel.: +44 1234 751122, Fax: +44 1234 751712,\nCentre for Logistics and Supply Chain Management, Cranfield School of Management,\nMK43 0AL Bedford, United Kingdom\nMarko Bastl is a research fellow in Supply Chain Research Centre, Cranfield School of\nManagement. His research interests are in business relationships development, supply\nchain process improvements, marketing-logistics interface and product-service systems. He\nis currently involved in the multi-disciplinary research on product-service systems;\nspecifically he is a lead researcher on the project focused on supply network strategy for\nprovision of product-service systems. Marko is currently in the last year of his doctorate,\nexploring the topic on relationship transparency. He authored and co-authored various\npapers in top international journals and conference proceedings. Prior he joined Cranfield\nSchool of Management he worked in manufacturing industry as head of finance,\npurchasing and as a freelance consultant.\nTonci Grubic\nManufacturing Department, School of Applied Sciences, Cranfield University, Cranfield,\nUK\nE-mail: t.grubic@cranfield.ac.uk, Tel +44 (0) 1234 750111 Ext 5264, Fax +44 (0) 1234\n752159, Manufacturing Department, School of Applied Sciences, Cranfield University,\nCranfield, Bedfordshire, MK43 0AL, UK\nTonci Grubic is a Research Fellow at Cranfield University, UK. He is currently working on\na research project that aims to develop a model which will establish a value of delivering a\nProduct-Service System for a machine tool builder. Before, he worked closely with\nautomotive industry on a 2,5 years long logistics and supply chain management related\nresearch project. Prior to joining Cranfield University he was working at University of\nSplit, Croatia, where he has earned MSc and BSc in Mechanical Engineering. His research\ninterests include: logistics and supply chain management, operations management,\ninformation systems and supply chain modelling. He has authored or co-authored several\npapers in scientific journals and conference proceedings.\nSimon Templar\nCentre for Logistics and Supply Chain Management, Cranfield School of Management,\nCranfield, UK\nE-mail: simon.templar@cranfield.ac.uk, Tel: +44 1234 751122, Fax: +44 1234 751712,\nCentre for Logistics and Supply Chain Management, Cranfield School of Management,\nMK43 0AL Bedford, United Kingdom\nSimon Templar is a qualified accountant and a Teaching Fellow at the Centre for Logistics\n& Supply Chain Management, Currently his research interests are related to Supply Chain\nCosting. His current PhD research explores the impact of transfer pricing on supply chain\nmanagement decisions. His paper ‘Ensuring the Transfer Price is Right’ has been included\nin the International Federation of Accountants Articles of Merit Award Program for\nDistinguished Contribution to Management Accounting in 2005. Simon has over 20 years\nexperience in industry, ranging from 'bananas to telecommunications' in a wide range of\nmanagement roles, including finance, sales and marketing, physical distribution\nmanagement and human resource management.\nAlan Harrison MA MSc (Oxon) PhD CEng FIET\nCentre for Logistics and Supply Chain Management, Cranfield School of Management,\nCranfield, UK\nE-mail: a.harrison@cranfield.ac.uk, Tel: +44 1234 754839, Fax: +44 1234 751712, Centre\nfor Logistics and Supply Chain Management, Cranfield School of Management, MK43\n0AL Bedford, United Kingdom\nAlan Harrison is professor of operations and logistics at Cranfield School of Management.\nAfter graduating in chemistry at Oxford University, he followed a career in manufacturing\nindustry with Procter and Gamble, BL and GEC. Having seen the light & been converted\nto academic life, he joined Warwick Business School in 1986 as a senior research fellow\nstudying the application of Japanese management methods in UK manufacturing. He\ncompleted his doctorate in enablers and inhibitors to material flow at Cranfield School of\nManagement, which he joined in 1996. As Director of Research, he acts as Academic\nLeader for the School’s Demand Chain Management Community, and was recently\nappointed Director of the Cranfield Executive Doctorate programme. He is author of Just\nin Time Manufacturing in Perspective (Prentice Hall, 1992), and joint author of Operations\nManagement, 2nd edition, Pitman (1998) and of Logistics Management and Strategy 3rd\nedition, Pearson Education (2008).\nAlan has led a number of large-scale research projects in several sectors, including\nautomotive, aerospace and grocery. One example is the long-running ECR-Europe ‘Stock\nLoss’ project, which identified and helped correct sources of loss in the supply chain,\ninvolving collaborative work between manufacturers and retailers. Another is his research\ninto customer responsive supply chains, focusing on the development of supply capabilities\nneeded to meet demand variability and uncertainty.\nIp Shing FAN BSc., PhD., CEng, MIEE, Mem SME\nManufacturing Department, School of Applied Sciences, Cranfield University, Cranfield,\nUK\nE-mail: i.s.fan@cranfield.ac.uk, Tel +44 (0) 1234 750111 Ext 5651, Fax +44 (0) 1234\n752159, Manufacturing Department, School of Applied Sciences, Cranfield University,\nCranfield, Bedfordshire, MK43 0AL, UK\nDr Ip-Shing Fan is currently the Course Director of the MSc in Enterprise System\nImplementation in Cranfield University, UK. He has interest in the effective design,\ndevelopment, implementation and use of ICT in business and non-business organisations.\nHis work included the use of business process modelling and analysis to help business to\nimprove performance through smarter way of working. The improvement approach\nintegrates the use of organisation and technology introduction with sensitive people change\nmanagement. He has deliver consultancy to global businesses to help in different stages of\nERP, PLM and SCM implementation. Using a socio-technical approach, he developed\ntools to provide organisation and human factor readiness assessment for enterprise\nsystems; and assist in formulating change management plans to improve the readiness.\n"}