{"doi":"10.1080\/10509580802405684","coreId":"215553","oai":"oai:eprints.lse.ac.uk:29372","identifiers":["oai:eprints.lse.ac.uk:29372","10.1080\/10509580802405684"],"title":"The Shelleys and the Idea of Europe","authors":["Stock, Paul"],"enrichments":{"references":[{"id":17298317,"title":"A Sunday Paper on Politics, Domestic Economy and Theatricals.","authors":[],"date":"1817","doi":null,"raw":"The Examiner, A Sunday Paper on Politics, Domestic Economy and Theatricals.  London:  John Hunt, 1817-1819.","cites":null},{"id":17298343,"title":"and His Circle 1773-1822. 10 vols. to","authors":[],"date":null,"doi":"10.2307\/25600716","raw":"___.  Shelley and His Circle 1773-1822. 10 vols. to date. Ed. K. N. Cameron (vols. I-IV), D. H.","cites":null},{"id":17298320,"title":"British Romantic Writers and the East.","authors":[],"date":"1992","doi":"10.1177\/004724419402400123","raw":"Leask, Nigel.  British Romantic Writers and the East. Cambridge:  C.U.P., 1992. Lew, Joseph W. “The Deceptive Other:  Mary Shelley’s Critique of Orientalism in Frankenstein”.","cites":null},{"id":17298337,"title":"Bysshe. The Letters of Percy Bysshe Shelley.","authors":[],"date":"1964","doi":"10.2307\/3721065","raw":"Shelley, Percy Bysshe. The Letters of Percy Bysshe Shelley. 2 vols. Ed. Frederick L. Jones, Oxford: Clarendon Press, 1964.","cites":null},{"id":17298331,"title":"Discourse on the Love of Our Country.","authors":[],"date":null,"doi":"10.1017\/cbo9781139170239.012","raw":"Price, Richard.  Discourse on the Love of Our Country.  London:  T. Cadell, 1789. Reiman, Donald H. The Romantics Reviewed:  Contemporary Reviews of British Romantic Writers.","cites":null},{"id":17298346,"title":"François de Chassboeuf, Comte de. The Ruins, or A Survey of the Revolutions of Empires, translated from the French. London: Printed by A. Searle,","authors":[],"date":null,"doi":null,"raw":"Volney, Constantin François de Chassboeuf, Comte de. The Ruins, or A Survey of the Revolutions of Empires, translated from the French. London:  Printed by A. Searle, [1795].","cites":null},{"id":17298335,"title":"Frankenstein, or The Modern Prometheus:","authors":[],"date":"1993","doi":"10.1057\/9781137399120.0006","raw":"Shelley, Mary. Frankenstein, or The Modern Prometheus:  The 1818 Text. Ed. Marilyn Butler, Oxford: O.U.P., 1993.","cites":null},{"id":17298344,"title":"Gayatri Chakrovorty. “Three Women’s Texts and a Critique of Imperialism”.","authors":[],"date":"1961","doi":null,"raw":"Reiman (vols. V-VIII), D. H. Reiman and D. D. Fischer (vols. IX-X). Cambridge, Mass.:  Harvard U. P., 1961 – .23 Spivak, Gayatri Chakrovorty. “Three Women’s Texts and a Critique of Imperialism”. Critical Inquiry 12 (1985) 243-61.","cites":null},{"id":17298333,"title":"Keats, and London Radical Writers. 2 vols.","authors":[],"date":"1972","doi":null,"raw":"Part C:  Shelley, Keats, and London Radical Writers. 2 vols. New York and London:  Garland, 1972.","cites":null},{"id":17298322,"title":"Lalla Rookh: An Oriental Romance.","authors":[],"date":"1817","doi":null,"raw":"Moore, Thomas.  Lalla Rookh:  An Oriental Romance. London:  Longman, Hurst, Rees, Orme and Brown, 1817.","cites":null},{"id":17298316,"title":"Leigh Hunt’s Foliage: A Cockney Manifesto.”","authors":[],"date":"2003","doi":"10.7202\/005859ar","raw":"Cox, Jeffrey. “Leigh Hunt’s Foliage:  A Cockney Manifesto.” Leigh Hunt:  Life, Poetics, Politics. Ed. Nicholas Roe.  London:  Routledge, 2003.","cites":null},{"id":17298330,"title":"Louise. Imperial Eyes: Travel Writing and Transculturation.","authors":[],"date":"1992","doi":"10.4324\/9780203163672","raw":"Pratt, Mary Louise. Imperial Eyes:  Travel Writing and Transculturation. New York and London: Routledge, 1992.","cites":null},{"id":17298328,"title":"Melincourt (1817). The Works of Thomas Love Peacock. 10 vols.","authors":[],"date":null,"doi":null,"raw":"Peacock, Thomas.  Melincourt (1817).  The Works of Thomas Love Peacock. 10 vols. Ed. H.F.B. BrettSmith and C.E. Jones.  London:  Constable & Co., 1924-34.","cites":null},{"id":17298319,"title":"Memoirs of Prince Alexey Haimatoff, translated from the Original Latin MSS. Under the immediate supervision of the Prince by John Brown Esq. London:","authors":[],"date":"1943","doi":null,"raw":"London:  Golden Cockerel, 1943.22 ___.  Memoirs of Prince Alexey Haimatoff, translated from the Original Latin MSS. Under the immediate supervision of the Prince by John Brown Esq. London:  T. Hookham, 1813.","cites":null},{"id":17298301,"title":"Orients: Fictions of the East in England 1662-1785.","authors":[],"date":"2005","doi":"10.1215\/00267929-2007-037","raw":"___.  Fabulous Orients:  Fictions of the East in England 1662-1785. Oxford:  O.U.P., 2005.","cites":null},{"id":17298326,"title":"Quarterly Review XXI","authors":[],"date":"1819","doi":null,"raw":"Quarterly Review XXI (April 1819). Reiman, Part C, II, 770-6.","cites":null},{"id":17298327,"title":"Representations of Revolution (1789-1820). London and New Haven: Yale U.P.,","authors":[],"date":"1983","doi":"10.1177\/004724418401405308","raw":"Paulson, Ronald.  Representations of Revolution (1789-1820).  London and New Haven: Yale U.P., 1983.","cites":null},{"id":17298325,"title":"Signs Taken for Wonders: Essays in the Sociology of Literary Forms.","authors":[],"date":"1983","doi":"10.2307\/1772338","raw":"Moretti, Franco. Signs Taken for Wonders:  Essays in the Sociology of Literary Forms.  London: Verso, 1983.","cites":null},{"id":17298323,"title":"Some Reflections on the Persian Letters” (1754), in Persian Letters (1721).","authors":[],"date":"1973","doi":null,"raw":"Montesquieu, Charles de Secondat, Baron de. “Some Reflections on the Persian Letters” (1754), in Persian Letters (1721). Trans. C. B. Betts. Harmondsworth:  Penguin, 1973.","cites":null},{"id":17298353,"title":"Tales of the East, Comprising the Most Popular Romances of Oriental Origin […]. 3 vols.","authors":[],"date":null,"doi":null,"raw":"Weber, Henry.  Tales of the East, Comprising the Most Popular Romances of Oriental Origin […]. 3 vols. Edinburgh: Ballantyne & Co.; Doig and Stirling; London:  Longman, Hurst, Rees, Orme and Brown; Robert Scholey, 1812.","cites":null},{"id":17298345,"title":"The Godwins and The Shelleys: The Biography of a Family.","authors":[],"date":"1989","doi":null,"raw":"St Clair, William. The Godwins and The Shelleys:  The Biography of a Family. London:  Faber, 1989.","cites":null},{"id":17298324,"title":"The Monthly Review, new series, LXXXVIII","authors":[],"date":"1819","doi":null,"raw":"The Monthly Review, new series, LXXXVIII (March 1819).  Reiman, Part C, II, 702-3.","cites":null},{"id":17298339,"title":"The Poems of Shelley. 2 vols. to date.","authors":[],"date":"1989","doi":null,"raw":"___.  The Poems of Shelley. 2 vols. to date. Ed. Kelvin Everest and Geoffrey Matthews, Harlow: Longman, 1989 – .","cites":null},{"id":17298341,"title":"The Prose Works of Percy Bysshe Shelley.","authors":[],"date":"1993","doi":"10.1093\/nq\/43.2.223","raw":"___.  The Prose Works of Percy Bysshe Shelley. 1 vol. to date. Ed. E. B. Murray, Oxford:  Clarendon Press, 1993.","cites":null},{"id":17298318,"title":"The Round Table: A Collection of Essays on Literature, Men and Manners. 2 vols. Edinburgh: Constable and Co.;","authors":[],"date":null,"doi":null,"raw":"Hazlitt, William [and Leigh Hunt]. The Round Table:  A Collection of Essays on Literature, Men and Manners. 2 vols. Edinburgh:  Constable and Co.; London:  Hurst, Orme, Rees and Brown, 1817. Hogg, T.J.  The Athenians:  Being a Correspondence between Thomas Jefferson Hogg and his friends Thomas Love Peacock, Leigh Hunt, Percy Bysshe Shelley, and others. Ed. Walter Sidney Scott.","cites":null},{"id":17298329,"title":"The Unsex’d Females, A Poem. London: Cadell and Davies,","authors":[],"date":null,"doi":null,"raw":"Polwhele, Richard.  The Unsex’d Females, A Poem. London:  Cadell and Davies, 1798.","cites":null},{"id":17298299,"title":"Travels in America. 3 vols. London: Richard Philips, 1808. Ballaster, Ros. Fables of the East: Selected Tales 1662-1785.","authors":[],"date":"2005","doi":null,"raw":"Ashe, Thomas. Travels in America. 3 vols. London:  Richard Philips, 1808. Ballaster, Ros. Fables of the East:  Selected Tales 1662-1785. Oxford:  O.U.P., 2005.","cites":null},{"id":17298315,"title":"Travels in Various Countries of Europe,","authors":[],"date":null,"doi":null,"raw":"Clarke, Edward Daniel. Travels in Various Countries of Europe, Asia, and Africa. 6 vols. Cambridge: C.U.P.; London:  T. Cadell and W. Davies, 1810-23.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-10","abstract":"This article explores how the Shelleys and their circle configure ideas of “Europe” between January 1817 and March 1818. I begin with Frankenstein, discussing how Mary Shelley associates Frankenstein's experiment with the particularly “European” problem of over-reaching - a drive for success leading to conflict or failure. I then turn to Laon and Cythna, a poem which labels itself as “revolution writing” and contemplates how the French revolution changed “Europe.” Here, Percy Shelley constructs an idea of “Europe” upon his interests in radical politics and the possibility of utopian social progress. Laon's setting, Constantinople, is a border-zone between Europe and Asia; it is simultaneously a European city in the throes of revolution and an Oriental tyranny. The Shelleys evoke “America” in a similar manner, treating it as a non-European “other” and as a more ideal version of “Europe” uncorrupted by post-revolutionary disappointments. Lastly, based on a remark in a letter to Percy Shelley about “European marriage,” I examine the connection between “Europeanness” and sexual mores. If, for Shelley, debates about “Europe” occur within specific parameters relating to revolution and radical change, “European” also has very different connotations connected to orthodox moral and sexual conventions","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/215553.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/29372\/1\/The%20Shelleys%20and%20the%20idea%20of%20Europe%20%28LSERO%29.pdf","pdfHashValue":"1806388c75c299002e9ce879f0b5eea680efe4f1","publisher":"Routledge","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:29372<\/identifier><datestamp>\n      2012-09-20T13:46:05Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4859<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/29372\/<\/dc:relation><dc:title>\n        The Shelleys and the Idea of Europe<\/dc:title><dc:creator>\n        Stock, Paul<\/dc:creator><dc:subject>\n        D901 Europe (General)<\/dc:subject><dc:subject>\n        PR English literature<\/dc:subject><dc:description>\n        This article explores how the Shelleys and their circle configure ideas of “Europe” between January 1817 and March 1818. I begin with Frankenstein, discussing how Mary Shelley associates Frankenstein's experiment with the particularly “European” problem of over-reaching - a drive for success leading to conflict or failure. I then turn to Laon and Cythna, a poem which labels itself as “revolution writing” and contemplates how the French revolution changed “Europe.” Here, Percy Shelley constructs an idea of “Europe” upon his interests in radical politics and the possibility of utopian social progress. Laon's setting, Constantinople, is a border-zone between Europe and Asia; it is simultaneously a European city in the throes of revolution and an Oriental tyranny. The Shelleys evoke “America” in a similar manner, treating it as a non-European “other” and as a more ideal version of “Europe” uncorrupted by post-revolutionary disappointments. Lastly, based on a remark in a letter to Percy Shelley about “European marriage,” I examine the connection between “Europeanness” and sexual mores. If, for Shelley, debates about “Europe” occur within specific parameters relating to revolution and radical change, “European” also has very different connotations connected to orthodox moral and sexual conventions.<\/dc:description><dc:publisher>\n        Routledge<\/dc:publisher><dc:date>\n        2008-10<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/29372\/1\/The%20Shelleys%20and%20the%20idea%20of%20Europe%20%28LSERO%29.pdf<\/dc:identifier><dc:identifier>\n          Stock, Paul  (2008) The Shelleys and the Idea of Europe.  European Romantic Review, 19 (4).  pp. 335-349.  ISSN 1050-9585     <\/dc:identifier><dc:relation>\n        http:\/\/www.tandf.co.uk\/journals\/titles\/10509585.html<\/dc:relation><dc:relation>\n        10.1080\/10509580802405684<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/29372\/","http:\/\/www.tandf.co.uk\/journals\/titles\/10509585.html","10.1080\/10509580802405684"],"year":2008,"topics":["D901 Europe (General)","PR English literature"],"subject":["Article","PeerReviewed"],"fullText":"  \nPaul Stock  \nThe Shelleys and the idea of Europe \n \nArticle (Accepted version) \n(Refereed) \n \n \n \nOriginal citation: \nStock, Paul (2008) The Shelleys and the Idea of Europe. European romantic review, 19 (4). pp. \n335-349. ISSN 1050-9585   \nDOI: 10.1080\/10509580802405684 \n \n© 2009 Taylor and Francis   \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/29372\/ \nAvailable in LSE Research Online: September 2012 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, \nincorporating any revisions agreed during the peer review process.  Some differences between \nthis version and the published version may remain.  You are advised to consult the publisher’s \nversion if you wish to cite from it. \n \n \n1Article for European Romantic Review\nThe Shelleys and the Idea of “Europe”\nby Paul Stock\nIntroduction\nThis article explores how the Shelleys and their circle configure ideas of “Europe” \nbetween January 1817 and March 1818.  In this period, Mary was finishing \nFrankenstein and Percy wrote, planned and published Laon and Cythna, two texts \nwhich, I will argue, are especially concerned with the meanings of “Europe” and \n“European”.  More specifically, Percy Shelley constructs an idea of “Europe” upon \nhis interests in radical politics and the possibility of utopian and revolutionary social \nprogress.  This construction, however, is not straightforward:  the Shelleys’ reflections \non “Europe” also reveal potential instabilities at the heart of Percy’s radical \n“European” vision, and I focus on how Laon, and to a lesser extent Frankenstein, \nforeground these complexities.  The article begins with the latter text, discussing how \nFrankenstein’s experiment is associated with the particularly “European” problem of \nover-reaching – a drive for radical success leading to conflict or failure.  I then turn to \nLaon and Cythna, a poem which labels itself as “revolution writing” and contemplates\nhow the French revolution changed “Europe” and what it meant to call oneself \n“European”.  Here Percy Shelley reflects on the possibility of radical reform, but also \nthe disappointments and disruptions within “European” history.  Set in \nConstantinople, a border-zone between Europe and Asia, Laon uses the language of \ncollective identity both to construct “Europe” and to question that same construction.  \nShelley evokes “America” in a similarly double-sided manner:  as a non-European \n“other” and as a more ideal version of “Europe” uncorrupted by post-revolutionary \ndisappointments.  Lastly, based on a remark in a letter to Percy Shelley about \n“European marriage”, I examine the connection between “Europeanness” and \nparticular sexual mores.  If, for Shelley, debates about “Europe” occur within specific \nparameters relating to revolution and radical change, “European” also has very \ndifferent connotations connected to orthodox moral and sexual conventions.  In this \n2respect therefore, debates about “Europe” in the period encompass wider complexities \nbeyond the immediate political concerns of the Shelley circle.   \nFrankenstein and the “European” Anxiety\n“European” is the first adjective used to describe Frankenstein when he appears in \nMary Shelley’s novel.  Chancing upon Frankenstein and his creation in the Arctic \nwastes, the explorer Walton frames their relationship in terms of a confrontation \nbetween European and non-European:  “he was not, as the other traveller [the \nCreature] seemed to be, a savage inhabitant of some undiscovered island, but an\nEuropean” (Frankenstein, 13).  Frankenstein himself emphasises this difference \nthroughout the novel, insisting that the Creature “quit Europe forever, and every other \nplace in the neighbourhood of man” (122), as if he has no right to live alongside \nEuropeans.  Frankenstein’s fear of the non-European outsider is all-consuming; he \nworries that if the Creature and his bride “were to leave Europe, and inhabit the \ndeserts of the new world […] a race of devils [would] be propagated upon the earth”\n(138).  And yet, as his obsession grows, he becomes an outsider himself, “banished \nfrom my native country”, “a friendless outcast over the earth” (161).  Walton defines \nhim as a European, but Frankenstein becomes increasingly estranged and isolated, \nwandering in the border regions of “Tartary and Russia”, at the very edges of\nEuropean society.  \nBut what is specifically “European” about Frankenstein?  According to his own \ntestimony in chapter one, he hails from a multi-national family, he speaks many \nlanguages and is very well travelled, building precise (and rather exacting) criteria for \nwho a “European” might be.  More importantly, he is associated with radical causes, \nchoosing to conduct his experiment at Ingolstadt university.  Revolution-era works \nlike John Robison’s Proofs of a Conspiracy (1797) and Augustin Barruel’s History of \nJacobinism (1797), traced the founding of the Illuminati order to Ingolstadt, and \npurported to demonstrate how that shadowy society had masterminded the French \nRevolution (St Clair, 437).  Frankenstein’s experimentation is therefore associated \nwith the unorthodoxy and social radicalism of Revolutionary ideas, just as “the raising \nof ghosts or devils” was thought to be the province of “revolutionary sympathisers”\n(Frankenstein, 254-5n.).  Introduced as a “European”, Frankenstein’s activities are \nideologically connected with radical attempts to re-shape European society, and with \n3the controversial trajectory of recent history.  This has inspired some interesting \nMarxist analyses of the novel’s import.  Frankenstein’s relationship with the Creature, \nsays Franco Moretti, resembles that between the bourgeoisie and “wage-labour”:  the \ncreated subordinate who desires equal participation in society, but who is denied by \nhis self-appointed superiors (Moretti, 84-6).  This argument underestimates, however, \nthe extent to which Frankenstein’s own actions have Revolutionary implications –\nhow his experimentation is connected to the wider upheavals of European society, and \nhow his original and daring triumphs rapidly disintegrate into disappointment and \nself-destructive violence.  To this extent, Frankenstein’s career is an allusion to the \ndegeneration of other radical ideas, similarly identified in the public mind with the \nunorthodox thinkers of Inglostadt university.\nLike Prometheus, Frankenstein is an over-reacher whose glorious successes \nprecipitate disastrous failure.  He becomes aware of the destructive potential in his \nambition early in the novel, observing that “the pursuit of knowledge” “has a \ntendency to weaken your affections, and to destroy your taste. […] Study [can be] \nunlawful, that is to say, not befitting the human mind” (Frankenstein, 37).  However, \nhe concludes, this drive for potentially destructive knowledge has fuelled the course \nof civilisation’s progress as well as its mistakes:\nIf this rule were always observed; if no man allowed any pursuit whatsoever to \ninterfere with the tranquillity of his domestic affections, Greece had not been \nenslaved; Caesar would not have spared his country; America would have \nbeen discovered more gradually; and the empires of Mexico and Peru had not \nbeen destroyed (37-8)\nIn other words, this notion of “over-reaching”, of the drive for knowledge and power \nleading to conflict or disaster, characterises Europe’s development, and particularly its \nrelations with the non-European world.  “Over-reaching” is thus particularly \nassociated with European history:  through Frankenstein the European, the novel \nexplores radicalism that both redefines “European” progress, and creates a terrifying \nnon-European “other”.  Frankenstein has sustained many fruitful postcolonial \nreadings, which show how the novel is complicit with, but also interrogates, the \nassumptions of imperialist identity politics1.  Yet nobody so far has noted how the text \nconstructs similarly complex ideas of “Europe” – especially how it associates \n“European” with potentially dangerous radical thought and the concept of “progress”.  \n4Importantly, however, it also reflects on the problems inherent in those constructions, \nparticularly the fractious interaction of Europeans and non-Europeans, and the \nquestionable directions of “European” social progress theory.  Mary therefore offers \nan uneasy analysis of what defines and shapes “the European”, and for the rest of this \narticle I wish to show how Percy’s Laon and Cythna explores similar issues and \ndifficulties rather more extensively.  \n“Revolution […] in an European nation”\nWriting to a potential publisher in 1817, Percy Shelley described Laon and Cythna as:\na tale illustrative of such a Revolution as might be supposed to take place in an \nEuropean nation, acted upon by the opinions of what has been called \n(erroneously as I think) the modern philosophy, & contending with antient \nnotions & the supposed advantages derived from those who support them.  It \nis […] the beau ideal as it were of the French Revolution (Letters, I, 563-4).  \nShelley thus advertises the work firstly as a kind of historical commentary on \nEuropean history, exploring how writing and debate causes revolution, and secondly\nas an idealised version of those events, a vision of what “Europe” should be like.  \nThe preface to Laon and Cythna continues this double purpose:  the poem “is an \nexperiment on the temper of the public mind, as to how far a thirst for a happier \ncondition of moral and political society survives, among the enlightened and refined, \nthe tempests which have shaken the age in which we live” (Laon, preface, lines 3-6)2.  \nThe poem thus engages with the effects of history, but also attempts to change that \nhistory by “kindling within the bosom of my readers, a virtuous enthusiasm for the \ndoctrines of liberty and justice” (preface, lines 10-13).  In other words, the poem has a \ndetermined project:  it creates a meta-historical European narrative based on the \ninterpretation of the past, and then projects that narrative into an idealised vision of \nEurope’s potential future.  This is not to imply a blinkered optimism:  the preface \nnotes how the historical revolution was not “in every respect prosperous”, since \n“successive tyrannies” established themselves afterwards (preface, lines 78-82).  \nInstead, the poem reconfigures recent European history, emphasising both its \nfictionalised “beau ideal” and its grounding in historical reality.  The first canto, for \nexample, portrays an allegorical conflict between the “great Spirit of Good” and its \nManichean opposite, “King, and Lord and God”, or “Fear, Hatred, Faith and \n5Tyranny” (lines 378, 386).  The narrative interprets history in the light of this conflict:  \nin the Revolution “thrones then first shook, \/ And earth’s immense and trampled \nmultitude, \/ In hope on their own powers began to look” (402-4).  Subsequently \nhowever, the “oppressors” have struck back by re-establishing convention:  “Justice \nand truth, with custom’s hydra bond, \/ Wage silent war” (419-20).  The plot converts \nrecent historical events into an allegory, relating first the joy of revolutionary success, \nwhen disparate factions are “reconciled” by the “love of freedom’s equal law” (1865-\n72), and then the crushing disappointments of the restoration, facilitated by “the \narmies of the leaguéd kings” (3825).  In narrating this transition, the poem alludes to \nhow ideas of “Europe” have been in dispute, vacillating between a new vision of \n“nations […free] of bondage” (2118-20) and a “Europe” defined by “despots” and \n“banded slaves” (3824-8).\nThis engagement with the Revolution has two important implications.  Firstly, it \nrevives the political language and concerns of the 1790s:  William St Clair has \nidentified numerous verbal parallels between the preface to Laon and Cythna and the \npreface to the first edition of William Godwin’s Enquiry Concerning Political Justice \n(1793) (St Clair, 431).  Laon and Cythna reinvests late eighteenth-century debates \nabout “monarchy”, “freedom” and the state of “Europe” with a new immediacy, \nhoping that poetry can both diagnose oppression and offer hope for “Man’s free-born \nsoul” (3258).  In doing so, Shelley evokes the forthright style of Wollstonecraft’s \nHistory […] of the French Revolution (1794), which he and Mary Shelley read in \n1814 (M. Shelley, Journals, I, 87).  Here Wollstonecraft identifies historical episodes \nthat definitively reshaped society, from the crusades to the recent Revolution, \nsearching for a means of historical analysis that moves beyond individual states to \ntalk about “Europe” as a totality.  She establishes a progressive history for the sub-\ncontinent, arguing that “all Europe” was enslaved by feudalism, but “the discovery of \nuseful truths” has rapidly spread – especially from Paris, “a thoroughfare to all the \nkingdoms on the continent” (Wollstonecraft, 220-1, 231, 502).  Speaking of 1789 \nitself, she says “revolution did not interest frenchmen alone, for it’s [sic] influence \nextending throughout the continent, all the passions and prejudices of Europe were \ninstantly set afloat.  That most favoured part of the globe had risen to an astonishing \npre-eminence” (305).  As Shelley does, Wollstonecraft presents this process as “the \nnatural consequence of intellectual improvement”, foregrounding the influence of \n6writers and thinkers (“the confederacy of philosophers”) in directly reshaping \n“Europe” (Wollstonecraft, vii and 498). \nHowever, Laon and Cythna was not alone in revitalising this thirty year old debate, \nsince the language of the French Revolution was used to justify contemporary policy \ninitiatives.  According to Leigh Hunt’s Examiner, the British government justified its \nprogramme of repressive legislation in 1817 by comparing the recent stoning of the \nPrince Regent’s coach to the dangers “of 1795, […] when the pretence was a dread of \nFrance and of Revolution” (Examiner [9 Feb 1817] 81).  Later in the same month, the \nnewspaper couches its own reformist agenda in revolutionary language, titling an anti-\ntaxation article “Friends of Revolution” and complaining about the post-Napoleonic \n“Settlement of Europe” (Examiner [23 Feb 1817] 113).  And in April it mounts an \nextended satirical attack on those who believe that “all crimes and sufferings begin \nwith the French Revolution”, offering instead a history of monarchical deviance \n(Examiner [6 Apr 1817] 209).  Like those it criticises, the Examiner uses its own \ninterpretation of revolution to diagnose present political problems, and to project \nhopes for society’s future.\nCentral to all these conjectures is the idea that the Revolution changed “Europe”.  In \nher work France, published in 1817 and read by the Shelleys in the same year, Lady \nMorgan concludes that the Revolution re-defined Europe:  “the bond of society was \nrent asunder […] consecrated by the vows of all that was enlightened and liberal in \nEurope” (Morgan, 89; M. Shelley, Journals, I, 100).  Like Shelley and Hunt therefore, \nMorgan bases her understanding of “Europe” on specifically French politics and the \nconsequences of Revolution.  When analysing the “State of Europe”, however, the \nExaminer alternates between emphasising the great changes undergone since 1789, \nand complaining that, after the restoration, the ancien régime remains in place.  An \neditorial entitled “Impossibility of the Continuance of the Present State of Things in \nEurope”, rails against the apparent intractability of “Bourbonite” regimes, but \nsimultaneously asserts that Europe has irreversibly altered and “would not bear any \nsort of dictation” (Examiner [12 Jan 1817] 17).  The paper’s consistent editorial \nposition is that the Allies betrayed a promise to “secure the independence of the State \nof Europe”, replacing Napoleonic rule with monarchical despotism, and refusing to \ncountenance constitutional reform (Examiner [21 Sep and 26 Oct 1817] 611 and 679).  \n7It even uses the word “Europe” to refer specifically to monarchical government:  \n“[Napoleon] pushed Europe to arms in defence of her existence”; “the Sovereigns of \nEurope hate him” (Examiner, [27 Apr 1817], 275).\nWhat should be clear from this is that discussions about the “State of Europe” and the \nconduct and legacy of the French Revolution, are part of the same debate:  writings \nabout the Revolution, from policy documents to mythologised histories like Laon and \nCythna, are deeply engaged with creating and shaping ideas of “Europe”.  Indeed, \nLaon’s participation in this process is acknowledged by contemporaries.  The Monthly \nReview locates the poem as a Revolutionary document, announcing that “the wild \nburst of the French Revolution called out ten thousand fancies and furies […] not only \nwere politics rhapsodised in the cause of that tremendous occurrence, but rhapsodies \nbecame political” (The Monthly Review [Mar 1819] 323-4).  And although John \nGibson Lockhart at first attempts to depoliticise the poem (“a great part of it has no \nnecessary connexion with politics”), he later acknowledges the radical theme, \nmentioning the “Revolutionised city” and the “men weary of political, and women \nsick of domestic slavery”, mischievously choosing to praise Shelley’s work using \nmonarchical language (“the noble and majestic footsteps of his genius”) (Blackwood’s\n[Jan 1819] 475-82).  \nBy far the most strident assertion of the poem’s Revolutionary social message occurs \nin Hunt’s Examiner review.  He identifies a utopian purpose to the poem:  “Mr. \nShelley is of opinion […] that the world is a very beautiful one externally, but wants a \ngood deal of mending with respect to it’s [sic] mind and habits”.  Hunt thus turns \nLaon and Cythna into a kind of manifesto and he explains how writing and printing \ncan affect the future of Europe – “the Press, which has got hold of Superstition and \ngiven it some irrecoverable wounds already, will, we hope and believe, finally […] \ncrush it as a steam-engine would a great serpent” (Examiner [22 Feb and 1 Mar 1818]\n121-2, 139-41).  In seeking publicity for Laon, Shelley sought out individuals linked \nto earlier publishing and political controversies, emphasising the close relationship \nbetween radical words and Revolutionary events.  He engaged as co-publishers \nSherwood, Neely and Jones. Sherwood particularly had longstanding connections \nwith the radical publishers of the 1790s, working at one point for H. D. Symonds, \nwho was imprisoned and fined for publishing Paine’s Rights of Man (1791) (Shelley \n8and His Circle, V, 155).  Shelley also sought to create a coterie of people convinced \nof their authority, as poets and writers, to comment on and influence the world of \npolitics.  Reassuring Ollier about the blasphemous and incestuous content of Laon, \nShelley suggested that the Government “would hesitate before they invaded a member \nof the higher circles of the republic of letters” – implying that he and other writers \noccupy a political space “beyond” or outside the proper reach of national governments \n(P. Shelley, Letters, I, 579).  He makes a similar point when anonymously reviewing \nGodwin’s Mandeville (1817) in the Examiner, investing the author (along with \nWollstonecraft) as part of a European community of radicals:  “the other nations of \nEurope […] have anticipated the judgement of posterity […their writings] have been \ntranslated and universally read in France and Germany, long after the bigotry of \nfaction had stifled them in our own country” (Examiner [28 Dec 1817], 827).  In this \nsense, Shelley projects radical writing itself as a revitalisation of “Europe”:   offering \nas the Laon subtitle claims, “A Vision of The Nineteenth Century”.\nThe “Beau Ideal” of Europe\nWhat, however, is the nature of this European “beau ideal”?  At times, the Examiner\nuses “Europe” to refer to a particular group of states.  A review of James Mill’s The \nHistory of British India (1818), for example, identifies a “European” “nation”; it \nobserves “the character of the Hindoos”, and makes comparisons with the Europeans, \ncollectivising the members of particular states as sharing certain “characteristics”.  \nMill’s work, says the review, “affords much food for national pride” – but “national” \ndoes not refer to a specific state like Britain, but rather to collected “European” \nsuccesses, such as victories “against large eastern armies” (Examiner [8 Mar 1818]\n157).  A collective idea of “Europe” is constructed through comparison with non-\nEuropean “others”.  Elsewhere, however, the present condition of “Europe” and “the \nworld” are collated, as if the “beau ideal” for that sub-continent were also the ideal \nstate for the whole world.  After Waterloo, Hunt says in an editorial, “the world would \nnot bear any sort of dictation”, assuming that his understanding of European history is \nuniversally applicable (Examiner [12 Jan 1817] 17).  Later, an article entitled \n“Modern Virtue” draws various reformist ideas from the lessons of European history, \nand then universalises them into moral precepts about “fealty to the laws” (not the \nwill of tyrants) and “benevolence to all mankind” (Examiner [13 Jul 1817], 433).\n9It is precisely this reasoning “from a particular to a universal” that J. T. Coleridge \nobjects to in his review of Laon and Cythna:  for him Shelley had formulated \nerroneous universal laws from irrelevant observations about oriental tyranny \n(Quarterly Review [April 1819] 460-71).  Certainly, in his letters about the poem, \nShelley details its universal relevance:  “I have attempted […] to speak to the \ncommon & elementary emotions of the human heart” (Letters, I, 563).  Comments \nlike this lead Nigel Leask to suggest that Shelley creates “a fantasy of the \nuniversalism of revolutionary reason”, desiring “a state of universal Sameness” in \nwhich other cultures can be “alchemized” into resembling the European revolutionary \nideal (Leask, 128 and 89)3.  However, as we have seen, Shelley also evokes \nmembership of a smaller, more exclusive coterie (the “higher circle of the republic of \nletters” [Letters, I, 579]), as well as an international “community of feeling”, where \npeople “maintain that connexion between one man and another” by mourning “any \npublic calamity which has befallen their country or the world” (P. Shelley, Prose \nWorks, 232)4.  \nThis same problem recurs throughout Laon and Cythna when Shelley relates the \ndisappointments of European history and his hopes for reconciliation.  In canto V the \nnarrator mentions how, in the course of revolution, disparate “patriots”, defined by \ntheir enthusiasm for parochial identity, gradually form a wider community:  “they, \nand all, in one loud symphony \/ My [Laon’s] name with Liberty commingling” (lines \n1873-4).  In terms of Shelley’s European myth-history, he here imagines the \nreconciliation of post-revolutionary “Europe”, when different states had the chance to \nrally around one governmental ideal and the concept of “Liberty”.  The delineation of \nvarious groups or collective identities thus articulates the competing visions of \n“Europe” presented in the poem.  Canto V imagines a “Europe” riven by tribal \nconflict:  “our tribes were gathered far”, in the “patriot hosts” “murderers fled \/ like \ninsect tribes” (1770-84), before eventually allying as a “mighty brotherhood \/ Linked \nby a jealous interchange of good” (1839-41).  Elsewhere, however, the poem evokes \nuniversal ideas of Liberty and Equality, imagining “Europe” as a unified assembly of \n“free spirits” rather than competing rivals.  Laone’s ode celebrates this commonality:  \n“a hundred nations swear that there shall be \/ Pity and Peace and Love, among the \ngood and free” (2210-1).  This introduces an important uncertainty.  Is the revolution \nof the Golden City a nationalist uprising of “patriots” struggling for independence \n10\nagainst a ruler which has “dispossessed \/ All native power” (977-8)?  Or is it the \nunification of many peoples in a common cause?  Is it a particularist rebellion for the \nreclamation of “native power”, or a universal act, whereby disparate factions act as \none?  This uncertainty is visible from the poem’s preface, when Shelley explains how \nhe intends to inspire “a virtuous enthusiasm for those doctrines of liberty and justice, \nthat faith and hope in something good, which neither violence, nor misrepresentation, \nnor prejudice, can ever totally extinguish among mankind” (preface, 10-13).  But \nwhat kind of project is this?  Does Shelley present the “beau ideal” of a rebellious \nindividual nation, of an international community, or a universal vision for the world?  \nAnd the question matters because it resembles precisely the challenge of \nunderstanding “Europe” as a space for competing nationalisms, as a transnational \ncollective, or as a universal ideal (in that “Europe” represents the premier social state \nfor all humanity).  \nThis interest in the potential universality of European society is, of course, hardly \nunique to Shelley.  Volney also suggested that “the communication of knowledge will \nextend from society to society till it comprehends the whole earth.  By the law of \nimitation the example of one people will be followed by others, who will adopt its \nspirit and its laws […Despots will relent] and civilisation will be universal” (Volney, \n115-6).  But Shelley is not quite this explicit:  by investigating various notions of \ngroup identity, and by doubting the extent to which “European” government or ideas \nmight have universal or particular applicability, Laon and Cythna questions what \n“European” might mean, or to whom it might apply.  Unfortunately, Shelley does not \noffer a solution to these complexities.  By contrast, Hazlitt’s fragmentary “On \nPatriotism” (published in the same year as Laon) understands universal collectivity\nthrough patriotism.  Love of country, he says, “is little more than another name for the \nlove of liberty, of independence, of peace, and social happiness” (Hazlitt, I, 238)5.  In \nother words, patriotism inspires not merely a devotion to the particular, but also a \nuniversalist social vision, an ideal for all societies.  Hazlitt insists that patriotism is \n“not a natural but an artificial idea”; despite its apparent parochialism, it has much \nwider application beyond the “local”.\nConstantinople\n11\nThe setting of Laon and Cythna provides an important context for understanding the \n“European”.  The action is “supposed to be laid in Constantinople and modern \nGreece, but without much attempt at minute delineation of Mahometan manners” (P. \nShelley, Letters, I, 563).  Although the poem deals with events “as might be supposed \nto take place in an European nation”, it is thus set at the very edges of “Europe”.  \nThroughout 1817 and early 1818, the Shelleys read Edward Daniel Clarke’s massive \nTravels in Various Countries of Europe, Asia and Africa (1810-23) (M. Shelley, \nJournals, II, 642), which talks of Constantinople as the location where Asia and \nEurope meet, both a dividing border and a fusion of different cultures and historical \nperiods:  harems co-exist with Greek language booksellers, and the city’s inhabitants \nare “ages behind the rest of the world”.  In this way, Constantinople reveals the \n“otherness” of the non-European, but also represents the historical origins of Europe \nsince “Athens itself was not very unlike Constantinople in its present state”.  It is both \nan “other” and an exemplar of Europe (Clarke, I, 669; II, 4-8, 20-1, 49).  For some \ncontemporary reviews, this setting renders Laon’s politics inadmissible.  John Taylor \nColeridge complains that “the laws and government on which Mr Shelley’s reasoning \nproceeds, are the Turkish, administered by a lawless despot[…] We are Englishmen, \nChristians, free and independent; we ask Mr Shelley how his case applies to us?”.  \nColeridge suggests that the poem is irrelevant to the concerns of a European audience, \nexcept that Greece, “the land full beyond all others of recollections of former glory \nand independence [is] now covered with shame and sunk in slavery” (Quarterly \nReview [Apr 1819], 466).  Responding to this accusation, Hunt upholds Shelley as an \nexemplary “citizen of the world” whose words break down borders and have universal \nrelevance (Examiner [10 Oct 1819] 653).  William St Clair argues that Shelley might \nhave used imagery of “the East” to disguise the European pretensions of his politics:  \nphilosophical writers “wrote Constantinople when they meant London and \nMahometanism when they meant Christianity” to avoid censorship laws – “as Godwin \nhad been taught in theology class, a war to drive the Turks out of Europe was a \nuniversally accepted paradigm of a just revolution” (St Clair, 234, 432).  By setting \nLaon and Cythna in Constantinople, and eventually re- titling the poem The Revolt of \nIslam, Shelley could attack organised religion and tyrannous government, and \nadvocate revolution more easily.  Montesquieu had used a similar tactic in the Persian \nLetters (1721), ensuring greater freedom to critique French society by employing \nPersian narrators who he ironically denounces as “full of ignorance and prejudice” \n12\n(Montesquieu, 284).  In the 1790s this strategy gains a new immediacy.  Volney, for \nexample, connects Turkey and Revolutionary France through the language of liberty:  \n“a great nation […] contracted a fondness for a nation the enemy of liberty […] The \nFrench were smitten with a passion for the Turks:  they were delirious of engaging in \na war for them, and that at a time when a revolution in their own country was just at \nits commencement” (Volney, 103).  This kind of association makes it ideologically \npossible to allude to European revolution whilst overtly discussing Turkey or “the \nEast”.  \nAt some points in Laon, however, this duel interest in “Europe” and the “East” \nmanifests itself as an apparent hostility between the two.  In the preface, Shelley \nblames the Roman Empire’s fall on the infiltration of “Eastern” attitudes and \npractices:  “contempt for virtue […] arising from the enslaved communities of the \nEast, then first began to overwhelm the western nations in its stream” (lines 226-9).  \nAnd the poem itself hints obliquely at threats from the east:  in canto I an easterly mist \nshrouds the “orient sun in shadow” and in canto III, the “azure East darkness again \nwas piled” (1404).  Later, the Tyrant himself is presented as an oriental despot:  \nCythna is captured by his Tartar troops (2558) and held captive by an “Ethiop” at \n“Oman’s Sea” (the Persian Gulf).  In canto IX his followers are explicitly described as \nMuslims (3532-4).  Nigel Leask glosses the ambiguous second title of the poem as \nmeaning “revolt against Islam”; that is, the poem presents revolution by civilised \nprogressives against Islamic despotism and oppression.  This, says Leask, involves the \nimposition of Eurocentric ideas of “universal” liberty:  “for Shelley, [the East] \nbeckoned as an uncluttered site for the fulfilment of frustrated dreams of liberty, but \nin practice revealed itself to be treacherous and obstacle-ridden, the nemesis of \nrevolutionary narcissism” (Leask, 73 and 10).  \nHowever, Shelley’s presentation of Constantinople is more complex than this might \nsuggest:  the Golden City is neither simply a disguised European city in the throes of \nrevolution, nor an example of authoritarian Oriental rule; rather, it is a combination of \nboth.  In her work on the interaction of cultures, Mary Louise Pratt speaks of “contact \nzones”, or “social spaces where disparate cultures meet and clash”, places where \npeoples encounter and represent “others”, and then reconfigure themselves in terms of\nthat encounter (Pratt, 4).  Shelley, I think, presents Constantinople \/ the Golden City \n13\nas such a contact zone – a space where different ideas of “the European” and the \n“non-European” co-exist simultaneously.  The city is on the borders of “Europe”, \nacting both as an exemplar of European history (presenting an ideal of past, and the \npossibility of future, revolutions) and as a non-European “other” – an unenlightened \noppressive state, opposed to liberty and revolution.  Put briefly, the Golden City \nsimultaneously represents “Europe” and its “other” – Shelley’s ideal of revolution and \nits reactionary opposite.  \nShelley is not alone in this complex use of Constantinople as a literal and ideological \nborder between “Europe” and “non-Europe”.  The broad idea of seeing the East (and \nespecially Constantinople) as a battleground between European freedom and Islamic \ntyranny seems to have been popular in the period.  In Lalla Rookh Thomas Moore \nsays that “liberty” cannot exist in an Islamic government (Moore, 378-9) and the \nExaminer worries that the oppressive governance of the East could spread to Europe:  \n“such is the state of the Eastern world, where […] the tendency […] to tyrannise and \nto be tyrannised over, has had full time to develop itself. […] Our turn seems next” \n(Examiner [12 Jan 1817] 26).  In Thomas Jefferson Hogg’s fictional Memoirs of \nPrince Alexey (1813), the title character visits the city and observes the “tyranny of \nthe Turks” as well as cultivating an “excessive love of perfect liberty”.  \nConstantinople is a scene of strange and backward otherness, a place to think radical \nthoughts about the future – especially regarding rebellion in Greece (Hogg, Alexey,\n75-6).  Henry Weber’s Tales of the East (1812), read by the Shelleys in 1815 (M. \nShelley, Journals I, 92), praises the city for offering a romantic escape into the \nfictions of the “Arabian Nights’ Entertainments”, and a true insight into “authentic \nportraits of oriental manners” (Weber, I, iii)6.  But Weber’s image of east-west \nrelations is different from Shelley’s, for Laon uses the same image to construct an \nidea of “Europe” and its other – a scene of European revolution and an oriental \ndespotism.  In formulating what “Europe” should be like, the City is both an exemplar \nand a warning.\n“America”: The New “Europe”?\nIn contrast to such complex understandings of “Europe”, the Shelley circle presents \nAmerica as a living paradise.  The conclusion of Laon and Cythna eulogises America\nas:  “A land beyond the Oceans of the West \/ Where […] Freedom and Truth \/ Are \n14\nworshipped” (lines 4415-7).  England, the former inheritor of Athenian democracy, \nhas become oppressed “by inbred monsters”, and now “her chainless child” America\nembodies the Greek legacy (4420-1).  In preserving this tradition, the United States \nprovides “an epitaph of glory for the tombs \/ Of murdered Europe” (4427-8) – it has \ntaken up the mantle of European history and now defines what it means to be \n“European” more fully than post-restoration “Europe” itself.  This is a complex \nassertion, for it identifies a “European” tradition (extending from Greece to Britain), \nbut then strips that tradition of its specific “Europeanness” by suggesting that America\nexemplifies its characteristics.  Put differently, the idea of “Europe” becomes the idea \nof “America”.  Thirty years earlier, Richard Price had proclaimed America the heir of \na “glorious” liberal-revolutionary tradition initiated in Britain (Price, 49-50).  By \n1817, however, the Examiner sees America as the vanguard of progress, and Europe \nthe slothful follower.  In an article praising Congress’s decision to commission \nhistorical paintings of Independence, the writer says “America, with a foresight and \nenergy worthy of Greece, has set them [the British government] an example it should \nhave been their glory to set her” (Examiner [13 Apr 1817] 230).  The Examiner pays \nparticularly close attention to South American revolutions too, claiming that “the \nactual work of freedom” is going on there despite the recent failures in Europe.  The \nrevolution in Brazil, the paper claims, is “connected with the subject of reform all \nover the world”, since it attacks “the incorrigible pretensions of ‘Legitimacy’” by \nengaging in a “struggle for independence”.  It draws an explicit comparison with \n“Europe” under the Allies, noting their hypocritical warnings to Portugal to refrain \nfrom “acting in the New World to the provinces of Spain as they have done in the old \nto Norway, Saxony and Italy” (Examiner [12 Jan and 1 Jun 1817] 18, 337-8).  \nAmerica has become the new bastion of Reform:  in the Examiner, as in Laon, the \n“beau ideal” for “Europe” has been magnified into a universal (applicable to all\ncountries everywhere), and displaced into the precise locales of north and south \nAmerica.  \nThis adulation of American revolutionary potential once again demonstrates the 1817 \nShelley circle’s deep engagement with the political work of the 1790s.  \nWollstonecraft, for example, describes the American Revolution as “an experiment in \npolitical science” – an opportunity to lay the “first stones” of government without \nrepeating the mistakes of absolute monarchy.  “Anglo-americans”, she says, \n15\n“appeared to be another race of beings, men framed to enjoy the advantages of \nsociety, and not merely to benefit those who governed” (Wollstonecraft, 13-14).  The \nuse of “race” highlights the “otherness” of American society when compared to \nEuropean practices, but also implies that Americans are “naturally” or intrinsically \nmore advanced, as well as the products of a superior culture.  In The Ruins, Volney \ntraces the universal development of human society, looking forward to the time when \ndisconnected states will band together, ending the “period of faction”.  America, he \nproclaims, will help institute this transnational idyll by instigating “a new age” “of \nsurprise and dread to tyrants, of emancipation to a great people, and of hope to the \nwhole world” (Volney, 117-8).  Volney and Wollstonecraft see the New World as a \nmore perfect version of their hopes for “Europe” and the Shelley circle replicated \ntheir views twenty years later, the disappointments surrounding European revolution\nonly amplifying their expectations.\nOf Shelley’s Marlow circle in 1817-18 only Hogg expresses reservations about \nAmerica.  “In heart I am more a Grecian than ever”, he writes to Peacock.  “The \nvulgarity of America as depicted in Ashe’s Travels & shewn by all other \ncommunications from that country, &, which in a great measure arises from ignorance \nof Classical Literature, is so disgusting, that we shrink from it in horror & take refuge \nin the ruins of antient taste & elegance” (Hogg, Athenians, 38).  Unlike Shelley and \nHunt, who identify the most recent incarnations of ancient Greek culture in \ncontemporary states, Hogg, and to a lesser extent Peacock, assert the complete \nseparateness of the modern world and its Grecian past.  Peacock’s Rhododaphne\n(1818) invokes Greece as a means of withdrawing from the world through study:  \n“Among those gifted bards and sages old \/ Shunning the living world, I dwell and \nhear” (Rhododaphne, 3). Whereas for Shelley Greece is a living concept visible in the \nworld, for Hogg and Peacock it is a vanished ideal, and modern pretenders are poor \nimitators of its splendour.  As Hogg admits, his comments on America’s neglect of \nclassical tradition derive from Thomas Ashe’s Travels in America (1808).  This work \nrevels in a scathing critique of the United States, attacking “sordid speculators”, \n“shameful degeneracy” and the “bigotry, pride and malignant hatred” which infects \nthe country.  Significantly though, like admirers of America, Ashe associates the \ncountry with support for the French Revolution, including a bogus account of a \nSussex farmer who, infused with enthusiasm for revolution, “fixed on America as his \n16\ndestination” as it seemed to realise his dreams of reform (Ashe, I, 2-4 and 56-66).  \nAshe uses this thinly disguised fiction to assail both the U.S. and the concept of \nrevolution, but, like Shelley, he assumes that America embodies a reformed “Europe”.  \nFor detractors and supporters alike, America is understood in terms of ideas about \n“Europe” – according to their conceptions of what “Europe” should be like, and \nwhether the United States has emulated or destroyed that ideal.\n“Europe” and Sexual Morality\nThus far, I have written about “Europe” as a historical or political concept.  But what \ndid it mean to the Shelley circle to be “Europeans”?  How should a “European”\nbehave?  In this section, I explore how being “European” meant adhering to certain \ncodes of sexual morality.  Shelley and his friends were often accused of disrespecting \nmarriage, of conducting unorthodox (i.e. extra-marital) sexual relations, and therefore \nof not being “European”.  This shows the term “Europe” being used in a very \ndifferent way:  to bolster conventional forms of social behaviour, rather than to \nexplore the complexities of radical politics.  \nIn December 1817, William Baxter, a member of Godwin’s circle and father of \nMary’s childhood friend Isabel, wrote to Shelley, defending his decision to break \ncontact between their families:\nThe station your rank and fortune gives you in society, the sphere which it \nentitles you to move in are such as I cannot in good conscience introduce my \nfamily into […].  This independence of fortune, too, has given you a freedom \nof thought and action entirely inconsistent with the customs, manners and \nprejudices of European society with which I have been at pains to imbue their \nminds, and which I wish not to see eradicated. (P. Shelley, Letters, I, 586)\nWhat did Baxter mean by defining Shelley’s conduct as “uneuropean”?  As the \neditors of Shelley and His Circle suggest, Baxter’s letter was probably written at the \ninstigation of his son-in-law (and Isabel’s husband) David Booth, who explained his \nreservations about the Shelleys in a letter to his wife early in 1818: Percy Shelley is \n“certainly insane”, partly because he associates with the scandalous Byron, but mainly \nbecause, according to Booth, he lives alternately with Mary and Claire Clairmont.  As \na result, he “tramples on the morality of his country”, excluding himself from British \nand European society (Shelley and His Circle, V, 391-2).  Shelley’s perceived lack of \n17\n“Europeanness” therefore derives from his alleged sexual immorality:  Booth and \nBaxter imply that “Europe” is defined by particular social codes, notably marriage.\nShelley himself, of course, was much exercised by marital problems in this period, \nand he would often discuss these matters using the language of Revolution, \ncomplaining of his “persecution” by those who disrespect his radical opinions.  And \nyet he constitutes those principles as important aspects of future reform, for by\nholding to them he provides “important benefit to mankind”.  Writing to Byron about \nthe custody battle for Charles and Ianthe, Shelley interprets the debate about his \nunorthodox ideals and (sexual) behaviour as an epic conflict between Reform and \nReaction:  his enemies intend to “expose me in the pillory, on the ground of my being \na REVOLUTIONIST and an Atheist” (Letters, I, 557 and 530).  In this sense, like his \n“enemies”, Shelley connects his personal conduct and his political ideals:  his notions \nabout marriage are an expression of the perfect, reformed “European” society.  \nShelley explores this connection further in his draft declaration to the Chancery court \nregarding the custody case:  “the allegations from which this unfitness [for paternal \ncustody] is said to proceed, are reduced to a simple statement of my holding doctrines \ninimical to the institution of marriage as established in this country”.  “Marriage”, he \ncontinues, “as it exists precisely in the laws and opinions of this country, [is] a \nmischievous and tyrannical institution”, adding that he has dared to imagine an \nalternative “system of social life” and that “all ages and countries have admitted in \nvarious degrees the principle of divorce” (Prose Works, 168-9).  For him, the primary \nissue is one of social organisation, and he allies himself with a cosmopolitan \nflexibility regarding marriage and divorce, and against parochial British law.  This is \nnot specifically an idea of “Europe”, since Shelley invokes a universal ideal (“all ages \nand countries”).  But nevertheless, he builds upon an important tradition which \ndefines “Europeanness” by reference to marriage.  Writing in 1797, probably with \nWollstonecraft in mind, Godwin remarks “I find the prejudice of the world in arms \nagainst the woman who practically opposed herself to the European institution of \nmarriage” (St Clair, 173).  To Godwin’s dismay, being properly “European” depends \nupon adhering to a particular sexual code – and the concepts are so closely aligned \nthat marriage itself is a “European institution”.  By questioning marital laws in his \n18\nChancery papers, Shelley is thus postulating an alternative vision of “European”\nsocial relations – one not so wedded to stringent marital codes.\nMarriage is a defining feature of European society in Hunt’s Examiner:  “the \ndegeneracy of some nations of the East, the Egyptians and Chaldeans for instance, has \nbeen traced to the marriages that were in use between brothers and sisters”.  By \ncontrast, “Europe” has excelled through its practice of international marriage:  the \nGoths and the Romans together produced “the early modern Italians, who led all the \ngenius of modern Europe”, and the French have recently become pre-eminent “partly \ndue to the great mixture of breed that has resulted from their free intercourse with all \nthe other nations of the Continent”.  The most “feeble houses” are consequently Spain \nand Portugal – the least internationalist and the most inbred states (Examiner [26 Oct \n1817] 731).  According to this thesis, international marriage is what defines “Europe”, \nboth in terms of common adherence to the custom, and also because it facilitates \ninter-state communication and the sharing of ideas.  \nHunt’s interest in marriage contributes to what Jeffrey Cox calls his “sexualised \nimagination”, epitomised in the erotic imagery of Foliage (1818), and The Story of \nRimini (1816), which, like Laon and Cythna, deals with incestuous behaviour (Cox, \n71). Reviewing these works, Hunt’s opponents also make the connection between \n“Europeanness” and sexual morality.  Lockhart’s assessment of Rimini assaults \nHunt’s style:  “his poetry resembles that of a man who has kept company with kept-\nmistresses” – in other words, it indicates his sexual deviancy.  And this criticism is \nintimately connected to Hunt’s faulty understanding of international relations and \nEuropean culture.  On the one hand, Lockhart attacks Hunt’s lack of languages, \nsuggesting that he has not received a proper European and classical education.  But on \nthe other hand, Hunt’s views are a “dilution of the blasphemies of the Encyclopédie –\nhis patriotism a crude, vague, ineffectual, and sour Jacobinism” (Blackwood’s [Oct \n1817] 38-41).  Lockhart thus criticises from two distinct directions, arguing firstly that \nHunt is ignorant and not an internationally minded gentleman; but also that he is \nexcessively international – copying the radical extremism of the philosophes and thus \nnot correctly patriotic.  This widely disseminated review therefore links dubious \nsexual morality with “defective” political views – just as Wollstonecraft’s political \nradicalism and alleged sexual licentiousness had been connected in the 1790s7.  \n19\nJ. T. Coleridge’s review of Laon and Cythna objects using very similar terminology.  \n“Mr. Shelley is his own Laon”, Coleridge says, as if Laon’s behaviour accurately \nmirrors Shelley’s.  Alluding to the controversial incest theme Coleridge writes:  \n“‘Love,’ [Shelley] says, ‘is to be but the sole law which shall govern the moral world’\n[…] We are loath to understand it in its lowest sense, though we believe that as to this \nissue this would be the correctest mode of interpreting it” (Quarterly Review [April \n1819] 467-8).  For this reason – because Shelley writes about sexual taboos – his \nideas about the reformation of “Europe” are inadmissible:  he wishes “to abolish all \nsocial strictures” by questioning both the ideal political state of “Europe”, and its \naccepted sexual customs.  In defending Shelley from this onslaught, Hunt reassures \nhis readers of Shelley’s conventional lifestyle, while simultaneously supporting his \nright to propound new theories and potentially “alter the condition of sexual \nintercourse”.  Significantly, however, he also declares that Shelley is a proper \nEuropean – engaged with the international problems of “Europe” despite the original \npoem’s apparent questioning of sexual orthodoxy.  He quotes Bacon in reference to \nShelley:  “‘If a man be generous towards strangers, it shews he is a citizen of the \nworld, and that his heart is no island cut off from other lands, but a continent that \njoins to them’” (Examiner [10 Oct 1819] 653).  The imagery here of a parochial island \ndisconnected from the European mainland is powerful:  Shelley is a world-citizen, \nand not a narrow-minded islander like his opponents, who attempt to exclude him \nfrom “European” society.\nThis debate, then, is partly about the conventions of “European” behaviour, and partly \nabout the idea of “Europe” itself – what kind of common characteristics or customs \n“European” societies should possess.  Ronald Paulson notes how Revolutionary \ndebate in the 1790s was filtered through the language of sexuality:  Burke emphasised \nthe dangers of insurrection by narrating the storming of the French palace as a sexual \nassault on Marie Antoinette, forced to “fly almost naked” from revolutionary \ndeviants. “The act of love”, Paulson says, “was an act of rebellion, or at least a \nscandalous act, in the context of a society of arranged marriages and closed families”\n(Paulson, 65 and 268).  By this logic, people with unorthodox sexual lives challenged \nthe very basis of society.  In Peacock’s satirical novel Melincourt (1817), the \nreactionary Mr. Vamp exclaims that “every man who talks of moral philosophy [i.e. \n20\nradical ideas] will never make any scruple of seducing his neighbour’s wife”, as if \nreform and sexual misbehaviour necessarily go together (401).  And the liberal Lady \nMorgan remembers how the Quarterly Review accused her, like Wollstonecraft, of \n“licentiousness, profligacy, irreverence, blasphemy, libertinism, disloyalty, and \natheism”, conflating religious and political radicalism with sexual dissolution\n(Morgan, vii-viii).  In this context, William Baxter’s remark to his daughter that \nShelley possesses “truly republican frugality” is unusual, for it associates \n“republicanism” with abstinence and prudence, not sexual irresponsibility, as Booth \nand Lockhart declare (Shelley and His Circle, V, 340).\nThese accusations about Shelley’s and Hunt’s personal behaviour are, therefore, \ncontributions to a wider argument about how “European” society should be \nconstructed, and what kind of behaviour is properly “European”.  I have suggested \nthat Shelley’s ideas of “Europe” reveal (as well as challenge) his interests in \nrevolution, radical reform, and the possibility of utopian social progress.  For his \ncritics though, “European” denotes a yardstick of acceptable (sexual) conduct – and \nShelley’s unorthodox personal life means that he can be attacked as “uneuropean”.  \nThis conservative use of “Europe” indicates the extent to which Shelley’s own radical \n“Europe” is an attempt to reject what he considered to be pernicious social forms and \nstructures.  But the debates about his “Europeanness” reveal how, in the post-\nNapoleonic political climate, the construction of “Europe” had become a battleground \nfor expressing various social ideologies, and not just radical ones.  Thinking about \n“Europe” does not just involve imagining political “beau ideals”:  it also involves \ntheorising and practising competing behavioural codes and notions of social \nresponsibility.  In this way, Shelley’s circle themselves are employed as subjects\nwhen recognising and defining “Europeanness”.                                                 \n                                               \nNotes\n1 Gayatri Spivak notes how “the dark side of imperialism understood as social mission” surfaces in \nFrankenstein – particularly in the figure of Henry Clerval, who aims to go to India, “assisting the \nprogress of European colonization and trade”.  However, she suggests, it also criticises imperialist \nprocedures because it refuses to countenance “binary oppositions” of race and gender which often \n“consolidate the imperialist self”.  Joseph Lew also observes how the Creature’s physical appearance \nlinks it to the subjects of imperialist rule in British India.  However, it also “exists outside [the…] \ncategories” of male and female or Occident “self” and Oriental “other”.  In this way, the novel \nquestions any absolute separation between a self and its “others”, and therefore critiques “the growth \nand methods of the British Empire in the East”.  For Spivak and Lew, Frankenstein reflects on the \n21\n                                                                                                                                      \ncomplexities inherent in identity politics – an intricacy which, I am suggesting, also informs its \npresentation of “Europe” and “European” (Spivak, 254-6; Lew, 273-4 and 283).    \n2 All quotations from Laon and Cythna are from the text edited by Jack Donovan, which is contained \nwithin The Poems of Shelley, ed. Everest and Matthews.  Line numbers refer to this edition.\n3 Dipesh Chakrabarty observes how a “universal and secular vision of the human” is deeply associated \nwith the idea of “Europe”.  In other words, “Europe” seeks to define its values – citizenship, the state, \nequality before the law, scientific rationality – in terms of their “universal” relevance and potentially \nuniversal application.  Chakrabarty particularly mentions progress histories, which enshrine “Europe” \nas the culmination of human development, and view other societies as stages leading to a “European” \nperfection.  As Leask notes, some of these assumptions can be detected in Shelley’s writing.  \n(Chakrabarty, 4, 29 and 39).          \n4This “community of feeling” evokes Cohen and Alliston’s notion of “sympathy” – which enables \ncross-border cultural interaction to exist alongside and in tension with “conceptions of national \nidentity”.  See Alliston’s “Transnational Sympathies, Imaginary Communities” and Cohen’s \n“Sentimental Communities” in Cohen and Denver, eds.\n5 Hazlitt’s argument strongly resembles Richard Price’s idea that “Liberty is the […] object of patriotic \nzeal [as] an enlightened country must be a free country”.  Reflecting on the French Revolution, Price \nalso suggests that the spread of “freedom”, already crucial in the establishment of patriotic identity, is \nalso instrumental in creating a new “Europe” (Price, 19 and 50).  \n6Ros Ballaster notes how eighteenth-century “oriental tales” are typically received both as “feigned \nstories” and “faithful representations” of the East.  See Fables of the East, 2; and Fabulous Orients, 14-\n17.    \n7 Richard Polwhele, for example, suggests in 1798 that ‘female advocates of Democracy’ are inevitably \nsexual deviants.  Wollstonecraft submits to her “heart’s lusts”, while Helen Maria Williams is “an \nintemperate advocate for Gallic [revolutionary] licentiousness”.  For Polwhere, radical politics and \nsexual unorthodoxy are both direct challenges to societal order. (Polwhele, 9-10, 19 and 30).     \nReferences\nAshe, Thomas. Travels in America. 3 vols. London:  Richard Philips, 1808.\nBallaster, Ros. Fables of the East:  Selected Tales 1662-1785. Oxford:  O.U.P., 2005.\n___.  Fabulous Orients:  Fictions of the East in England 1662-1785. Oxford:  O.U.P., 2005.\nBlackwood’s Edinburgh Magazine II and IV (October 1817 and January 1819).  Reiman, Part C, I, 49-\n52; 96-103.\nChakrabarty, Dipesh.  Provincializing Europe:  Postcolonial Thought and Historical Difference.  \nPrinceton and Oxford:  Princeton U. P., 2000.\nClarke, Edward Daniel. Travels in Various Countries of Europe, Asia, and Africa. 6 vols. Cambridge:  \nC.U.P.; London:  T. Cadell and W. Davies, 1810-23.\nCohen, Margaret and Carolyn Denver, eds.  The Literary Channel:  The Inter-National Invention of the \nNovel. Princeton:  Princeton U.P., 2002.\nCox, Jeffrey. “Leigh Hunt’s Foliage:  A Cockney Manifesto.” Leigh Hunt:  Life, Poetics, Politics. Ed. \nNicholas Roe.  London:  Routledge, 2003.\nThe Examiner, A Sunday Paper on Politics, Domestic Economy and Theatricals.  London:  John Hunt, \n1817-1819.\nHazlitt, William [and Leigh Hunt]. The Round Table:  A Collection of Essays on Literature, Men and \nManners. 2 vols. Edinburgh:  Constable and Co.; London:  Hurst, Orme, Rees and Brown, 1817.\nHogg, T.J.  The Athenians:  Being a Correspondence between Thomas Jefferson Hogg and his friends \nThomas Love Peacock, Leigh Hunt, Percy Bysshe Shelley, and others. Ed. Walter Sidney Scott.  \nLondon:  Golden Cockerel, 1943.\n22\n                                                                                                                                      \n___.  Memoirs of Prince Alexey Haimatoff, translated from the Original Latin MSS. Under the \nimmediate supervision of the Prince by John Brown Esq. London:  T. Hookham, 1813.\nLeask, Nigel.  British Romantic Writers and the East. Cambridge:  C.U.P., 1992.\nLew, Joseph W. “The Deceptive Other:  Mary Shelley’s Critique of Orientalism in Frankenstein”. \nStudies in Romanticism 30 (1991) 255-83.\nMoore, Thomas.  Lalla Rookh:  An Oriental Romance. London:  Longman, Hurst, Rees, Orme and \nBrown, 1817.\nMontesquieu, Charles de Secondat, Baron de. “Some Reflections on the Persian Letters” (1754), in \nPersian Letters (1721). Trans. C. B. Betts. Harmondsworth:  Penguin, 1973.\nThe Monthly Review, new series, LXXXVIII (March 1819).  Reiman, Part C, II, 702-3.\nMoretti, Franco. Signs Taken for Wonders:  Essays in the Sociology of Literary Forms.  London:  \nVerso, 1983.\nMorgan, Lady. France. London:  Henry Colburn, 1817.\nQuarterly Review XXI (April 1819). Reiman, Part C, II, 770-6.\nPaulson, Ronald.  Representations of Revolution (1789-1820).  London and New Haven: Yale U.P., \n1983.\nPeacock, Thomas.  Melincourt (1817).  The Works of Thomas Love Peacock. 10 vols. Ed. H.F.B. Brett-\nSmith and C.E. Jones.  London:  Constable & Co., 1924-34.\n___.  Rhododaphne, A Poem. London:  T. Hookham; Baldwin, Cradock and Joy, 1818.\nPolwhele, Richard.  The Unsex’d Females, A Poem. London:  Cadell and Davies, 1798.\nPratt, Mary Louise. Imperial Eyes:  Travel Writing and Transculturation. New York and London:  \nRoutledge, 1992.\nPrice, Richard.  Discourse on the Love of Our Country.  London:  T. Cadell, 1789.\nReiman, Donald H. The Romantics Reviewed:  Contemporary Reviews of British Romantic Writers.  \nPart C:  Shelley, Keats, and London Radical Writers. 2 vols. New York and London:  Garland, \n1972.\nShelley, Mary. Frankenstein, or The Modern Prometheus:  The 1818 Text. Ed. Marilyn Butler, Oxford:  \nO.U.P., 1993.\n___.  The Journals of Mary Shelley, 1814-1844. 2 vols. Ed. Paula Feldman and Diana Scott-Kilvert, \nOxford:  Clarendon Press, 1987).\nShelley, Percy Bysshe. The Letters of Percy Bysshe Shelley. 2 vols. Ed. Frederick L. Jones, Oxford:  \nClarendon Press, 1964.\n___.  The Poems of Shelley. 2 vols. to date. Ed. Kelvin Everest and Geoffrey Matthews, Harlow:  \nLongman, 1989 – . \n___.  The Prose Works of Percy Bysshe Shelley. 1 vol. to date. Ed. E. B. Murray, Oxford:  Clarendon \nPress, 1993.\n___. Shelley and His Circle 1773-1822. 10 vols. to date. Ed. K. N. Cameron (vols. I-IV), D. H. \nReiman (vols. V-VIII), D. H. Reiman and D. D. Fischer (vols. IX-X). Cambridge, Mass.:  Harvard \nU. P., 1961 – .\n23\n                                                                                                                                      \nSpivak, Gayatri Chakrovorty. “Three Women’s Texts and a Critique of Imperialism”. Critical Inquiry \n12 (1985) 243-61.\nSt Clair, William. The Godwins and The Shelleys:  The Biography of a Family. London:  Faber, 1989.\nVolney, Constantin François de Chassboeuf, Comte de. The Ruins, or A Survey of the Revolutions of \nEmpires, translated from the French. London:  Printed by A. Searle, [1795].\nWeber, Henry.  Tales of the East, Comprising the Most Popular Romances of Oriental Origin […]. 3 \nvols. Edinburgh: Ballantyne & Co.; Doig and Stirling; London:  Longman, Hurst, Rees, Orme and \nBrown; Robert Scholey, 1812.\nWollstonecraft, Mary. An Historical and Moral View of the Origin and Progress of the French \nRevolution, and the Effect it has Produced in Europe. 2nd ed. London:  J. Johnson, 1795.\n"}