{"doi":"10.1177\/1359104507078455","coreId":"101081","oai":"oai:epubs.surrey.ac.uk:486","identifiers":["oai:epubs.surrey.ac.uk:486","10.1177\/1359104507078455"],"title":"How Can a Mentor Support Experiential Learning?","authors":["Lee, Anne"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-01-01","abstract":"<p>Mentoring is an emancipatory act. Although the term ‘mentor’ has been appropriated in some professions to include notions of assessment, the pure conception of mentoring is to encourage personal growth. Within this framework a trusted mentor can be a key person to help reflection. The mentor can help by encouraging questioning of the governing variable(s), support the mentee in their journey from the known into uncharted territory, and focus on learning opportunities.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:486<\/identifier><datestamp>\n      2017-10-31T13:58:23Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D43454144<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/486\/<\/dc:relation><dc:title>\n        How Can a Mentor Support Experiential Learning?<\/dc:title><dc:creator>\n        Lee, Anne<\/dc:creator><dc:description>\n        <p>Mentoring is an emancipatory act. Although the term ‘mentor’ has been appropriated in some professions to include notions of assessment, the pure conception of mentoring is to encourage personal growth. Within this framework a trusted mentor can be a key person to help reflection. The mentor can help by encouraging questioning of the governing variable(s), support the mentee in their journey from the known into uncharted territory, and focus on learning opportunities.<\/p><\/dc:description><dc:date>\n        2007-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/486\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Lee, Anne  (2007) How Can a Mentor Support Experiential Learning?   Clinical Child Psychology and Psychiatry, 12 (3).  pp. 333-340.      <\/dc:identifier><dc:relation>\n        10.1177\/1359104507078455<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/486\/","10.1177\/1359104507078455"],"year":2007,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"SPECIAL SECTION \n \n \nHow Can a Mentor Support Experiential \nLearning? \n \nANNE LEE \nUniversity of Surrey, UK \n \n \n \nABSTRACT \n \nMentoring is an emancipatory act. Although the term ‘mentor’ has been appro- \npriated in some professions to include notions of assessment, the pure conception \nof mentoring is to encourage personal growth.  Within this framework a trusted \nmentor can be a key person to help reflection. The mentor can help by encourage- \ning questioning of the governing variable(s), support the mentee in their journey \nfrom the known into uncharted territory, and focus on learning opportunities.   \n \nKEYWORDS \nexperience, learning, mentoring, reflection thresholds \n \n \n \nThe young dealer had been so proud of his job in the City.  The way he had spotted \ngaps in the market and been fleet of foot to make small, but profitable trades.   Then the \nbad day came.  He made a big mistake.  His company was going to be £1m worse off. \n \nHe hung his head as he went in to confess and to hand in his resignation.  His manager \nlistened to the sorry tale. \n \n“What is in that envelope you are holding?” she eventually asked the young man. \n \n“It’s my resignation” came the reply “I know you won’t want me around after this” \n \n“Of course I will” retorted the manager “do you think I am going to waste the million \npounds I have just spent training you”.\n(Anon) \n \n \nADULT LEARNING HAPPENS most powerfully through reflection.  Reflection is a \nmetacognitive state where we analyse and direct our thinking.  We can reflect on our \nown, with a significant other or in a group. A mentor can be an appropriate significant \nother who can provide honest guidance, support and challenge at the right moments for \nPublished in Clinical Child Psychology and Psychiatry  Vol 12 (3): 333-340  SAGE   \nDOE: 10.1177\/1359104507078455   © Dr Anne Lee 2007  a.lee@surrey.ac.uk . \ntheir mentee.  This article argues that the true mentor does not have to be a ‘supervisor’, \nand should not be a line manager or an assessor.  (Various organisations and professions \nhave appropriated the term ‘mentor’ and applied it in these ways).  The quality of a \nrelationship which is voluntarily entered into and where there is already a positive \nregard on both sides can provide a profound learning experience (for both sides).  \n     It has been argued that learning from experience is the distinguishing element \nbetween pedagogy and andragogy (Knowles, Holton & Swanson, 1998).  The adult \nlearner comes with a richer variety of experience than the child and thus within any \ngroup of adults the richest resource they have is themselves.  This resource can have \nnegative as well as positive influences; they may have constructed their world in a way \nwhich militates against new ideas.  They may have developed presuppositions and \nmental constructs which close their minds.  The skill of challenging and the willingness \nto be challenged become increasing important for the adult.   \n     For Knowles et al. (1998), ‘pedagogy’ refers to a more transmission-based learning \nappropriate for children where ‘the teacher knows best’.  Andragogy is a model of \ndiscovery learning where the individual is motivated to learn because of their \nexperience.  They want to understand why they are learning.  This is why failure – one’s \nown or (more easily) observing the failure of others – can be a powerful trigger for \nlearning. \n \n \nWhat is learning? \n \nLearning can take place in different contexts and for different reasons.  The focus of this \narticle is ‘emancipatory learning’ (Rogers 1986) which refers to self-understanding, \nawareness and transformation of the cultural and personal presuppositions that are \nalways with us and affect the way we act.  Recent research suggests that the effective \nlearner constructs their own ‘arch of knowledge’, and to do this they research, reflect, \nask questions and work to fit their own jigsaw of the situation together. \n     Prosser and Trigwell (1999) refer to the ‘presage-process-product model of student \nlearning’ (p 12) and say that the student’s perceptions of the learning and teaching \ncontext are an interaction between their previous experiences of learning and teaching, \nand the learning and teaching context itself.  They recommend adopting a constructivist \nperspective and say that ‘in any act of learning and teaching prior experiences, \nperceptions, approaches and outcomes are simultaneously present, although in some \ncontexts one or more of these aspects may be more to the foreground of awareness’ \n(p14). \n     For the purposes of this article I am defining ‘learning’ as a transformative \nexperience - an experience which enables the learner to approach their world in a \ndifferent and more positive way and which changes (or transforms) the learner in its \nwake.   Mezirow (1991) refers to this as ‘a meaning perspective’ (p 46) and reminds us \nthat the sociologist Erving Goffman used the term ‘frame’ to refer to a shared definition \nof a situation that organizes and governs social interaction.  ‘Reframing’ has been used \nas a way of demonstrating that this shared definition can be developed. \n \n \n \nANNE LEE is Academic Development Adviser at the University of Surrey.  She has \nworked at all levels of education and also had a background in mentoring, careers \ncounselling and business. \n \nCONTACT:  Anne Lee.  The Post House, West Clandon, Guildford, Surrey GU4 7ST. \nUK  (E-mail: a.lee@surrey.ac.uk) \n \nPublished in Clinical Child Psychology and Psychiatry  Vol 12 (3): 333-340  SAGE   \nDOE: 10.1177\/1359104507078455   © Dr Anne Lee 2007  a.lee@surrey.ac.uk . \n     Some people learn from experience easily, and some find it more difficult.  I would \nargue that it helps if we can understand the concepts that some people might find \nparticularly difficult.  Meyer and Land (2002) refer to these as ‘threshold concepts’.  \nThreshold concepts’ (such as ‘opportunity cost’ for the economist, ‘pain’ for the \nmedical student or ‘cultural interpretation’ for the theologian) act as ‘portals’ to \nunderstanding the subject.  According to Meyer and colleagues a threshold concept may \npossess a number of characteristics, it is likely to be (a) integrative, in that it exposes the \npreviously hidden interrelatedness of something: (b)  transformative so that, once \nunderstood, it produces a significant shift in the perception of the subject: (c) potentially \nirreversible, that is, once acquired, it is likely to permanently alter the individual’s \nperspective (d) potentially troublesome.  (Meyer & Shanahan 2003 p 4). For example \ntrainee medical doctors pass through a threshold when they realise that ‘pain’ is a major \nsource of information and begin to analyse it as such, rather than to perceive it as \ndiscomfort.  The threshold that they pass through is similar to the thresholds that we all \npass through when we begin to learn from experience rather than repeat experience. \n     The concept of learning from practice is about questioning the governing variable \nrather than looking at the action itself.  Argyris and Schon 1974  call this double- (as \nopposed to single-) loop learning. This all implies that we will only internalize our \nlearning when we are given opportunity to reflect on experience. \n     There is a general acceptance amongst constructivists that reflection on practice is a \n‘good thing’.   Jenny Moon (1999) argues that it is a higher order meta-cognitive \nactivity.  Reflection,  however,  has its critics.  Alan Bleakly (2000) argues that \nreflective thinking is too much like the confessional. He says that reflexive writing can \nbe “dominated by a discourse of personalistic humanism and the personal confessional \ngenre, with attendant internal contradictions, such as unreflexive accounts of personal \n“discovery” and “growth” (p11).  Bleakley highlights both one of the strengths and the \nweaknesses of reflective writing – that it accesses tacit knowledge.   This is the most \nprofound and powerful type of knowledge, but there is the need to seek input as well. \n     Reflective writing can follow the patterns shown in Figures 1 and 2.  Cowan (1998) \nhas adapted Kolb’s famous learning cycle to suggest that the learner moves from \n‘experience’ through ‘reflection’, to ‘generalizing’ and ‘testing’.  He observes that key \nconcepts of the learning cycle are continuously adapted, so below is another adaptation \nwhich takes into account some of the criticisms of earlier versions (Race 2005). \n \n \n \n                                           Identify and reflect on experience \n                                               (individually or with others)     \n   \n \n \n                                Compare experience with current theorists’ views \n \n \n \n                                                 \n                                                 Create\/evolve new theory \n \n \n \n \nFigure 1: Flow chart for reflection \n \n \n \nPublished in Clinical Child Psychology and Psychiatry  Vol 12 (3): 333-340  SAGE   \nDOE: 10.1177\/1359104507078455   © Dr Anne Lee 2007  a.lee@surrey.ac.uk . \nExperience \n \n \n         Experiment \n         Practice and                                                                                  Reflect and \n         reframe                                                                                          reframe \n               \n \n \n    \nGeneralise and conceptualise \n \nFigure 2: Kolb’s Learning Cycle  \nSource: Cowan (1998 p 34) \n \n \nThe importance of journeying from the known is highlighted by Carl Rogers (1967): \n \nI have come to feel that the only learning which significantly influences behaviour \nis self-discovered, self-appropriated learning. … Such self-discovered learning, \ntruth that has been personally appropriated and assimilated in experience, cannot be \ndirectly communicated to another … When I try to teach, as I do sometimes, I am \nappalled by the results, which seem a little more than inconsequential, because \nsometimes the teaching seems to succeed. When this happens, I find that the results \nare damaging. It seems to cause the individual to distrust his own experience, and to \nstifle significant learning. Hence I have come to feel that the outcomes of teaching \nare either unimportant or hurtful. \n           As a consequence, I realise that I am only interested in being a learner … I find \nthat one of the best, but most difficult ways for me to learn, is to drop my own \ndefensiveness, at least temporarily, and to try to understand the way in which (the \nother person’s experience) seems and feels to them.” (pp. 276–277) \n \nBut we need to be aware that non-directive therapy (or teaching) can never totally live \nup to its name.  As the therapist (teacher) chooses the questions he or she asks, so the \nfacilitator has an influence over the type of knowledge base to be covered. \n \n \nWhat types of experiences can we learn from? \n \nThis paper starts from the same point of view as Jarvis, Holford, and Griffin (1998) \nwhen they suggest that experience is the foundation of, and stimulus for, learning.  They \ndescribe it as ‘the experience through which individuals become themselves.’  (p. 46)  \nThey argue that this experience may be either primary or secondary, either actual or \nrecalled, either real or artificial.  We can learn from other people’s experiences and from \nthe stories they tell as well. \n     We don’t have to learn from experience.  Arguably real failure is the failure to learn \nfrom experience, the repeating of a negative pattern, leading the unexamined life.  To \nprevent this we have to make ourselves (or be encouraged to) reflect, to test assumptions \nand to consider other points of view. \n \n \nThe role of the mentor in learning from experience \n \nThe mentor is a non-judgemental adviser.  Morton-Cooper and Palmer (2000) see it as \nbuilding upon Rogers’ belief that self experience and self-discovery are important facets \nPublished in Clinical Child Psychology and Psychiatry  Vol 12 (3): 333-340  SAGE   \nDOE: 10.1177\/1359104507078455   © Dr Anne Lee 2007  a.lee@surrey.ac.uk . \nof learning. Learning involves acknowledging that adults can move from being \ndependent to being self-directed, accumulate experiences and create a biography from \nwhich they can learn and can change from needing to acquire knowledge and being \nsubject-centred to becoming more performance-centred, resulting in the application of \nexperience and the development of sound critical thinking abilities.    \n     Thus mentoring is a non-judgemental, developmental relationship entered into \nvoluntarily by both sides (Morton 2000).  A mentor is not necessarily a trained \ncounsellor or therapist (although they can be) but they are respected by their mentee and \nthe mentee perceives the mentor as experienced, successful at their job and a good role \nmodel. \n     It is frequently claimed that mentoring is the most effective way of passing on \nknowledge. It ought to be: it is one-to-one and has all the dimensions of creating \nlearning situations in a trusting environment.  Two people who have elected to work \ntogether should be able to experiment with developing knowledge and explaining \ncomplex issues in a language that both understand. \n     A mentor can be primary or secondary (Kram 1985 p 23, Freeman 1998).  The \nsecondary mentor has much more of a businesslike relationship with their mentee.  They \nconcentrate on providing support for career development.  They can suggest projects, \nhelp to solve work-based problems, provide coaching where they have particular skills \nand might actively promote their mentee where they think it could be helpful. \n     The primary mentor can provide a more profound experience .  When an emotional \nbond is developed the mentee is deemed to have a primary mentor.  The strength of the \nprimary mentor is that by spending time with the mentee they are providing acceptance \nand confirmation that the mentee is worthwhile and this leads to personal empowerment.  \nBy being a role model they are offering an alternative to the mentee’s previous \nexperiences of learning and, if they are skilled in enabling learning, they can help the \nmentee to learn from a variety of life experiences as well as planning and rehearsing \nfuture encounters.  During a lifetime, the fortunate mentee may have several mentors, \neach bringing knowledge, skills and experience relevant to the particular circumstances \nthat the mentee is facing at that particular time.   \n     Secondary mentors are obviously easier to find, and are often provided within an \norganisational setting.  Sometimes a relationship would start with more functional, \nsecondary mentoring expectations, and go on to become fundamental for both parties. \n \n \nWhat do the mentor and mentee gain? \n \nThe mentee obviously benefits from this relationship when it is at its most productive.  \nThey learn where to spend their time most effectively, they can learn how to cope with \norganisations more productively and get more job satisfaction.  (Murray and Owen \n1991).  \n     Most mentors undertake this work without seeking or expecting payment.  Mentors \ndo gain considerable benefits however.  They enjoy keeping in touch with grassroots \nfeelings and experiences, many feel a sense of parental pride; they learn from the \nrelationship, too, and can become more effective managers and supervisors as a result. \n \n \nWhen is mentoring most beneficial? \n \nCritical incidents can provide rich food for reflection, but often past experiences can be \nused as a gateway to reveal more about present concerns.  The experienced mentor will \nspot such opportunities to open doors and reveal trends or illuminate blind spots (Egan \n2002).  Mentoring is used to help mentees into a new role or organisation, to fast-track \ntheir development, to develop cross-cultural awareness, to aid coping with managing \nPublished in Clinical Child Psychology and Psychiatry  Vol 12 (3): 333-340  SAGE   \nDOE: 10.1177\/1359104507078455   © Dr Anne Lee 2007  a.lee@surrey.ac.uk . \nchange, to help manage the conflict between the professional role, patient autonomy and \norganisational demands, to help manage the cloak of defence against emotion and to \nhelp those who are seeking explanations of their own perceived inadequacy.  (Morton-\nCooper and Palmer 2000).  However it is worth emphasising that mentoring is for the \nwell, not for the sick.   \n     Some organisations now have sophisticated mentoring programmes and staff who \ndevise the guidelines for the scheme and manage the applications and ‘matching’ \nprocess.  But it does not need to be that sophisticated: Many mentoring relationships are \nless formal.  Some are based on co-mentoring where people of roughly equal status have \nan agreement whereby they can ‘book’ time with each other. \n     Whatever the life of the mentoring relationship (and Kram mentioned 5 years as a \npossible average, but 2 years currently seems the norm) there does need to be an \nagreement that at any time either party can instigate a ‘no fault divorce’.  This \nunderlines the voluntary nature of the relationship and reinforces its positive power.  \nOther areas worth discussing in the early stages are mutual expectations about \nconfidentiality, frequency of meetings, the purpose of the relationship and what the \nmentee wants to learn.   \n \n \nWhat do you want to learn? \n \nThis is the most powerful question that the mentor can pose to the mentee  (Herman and \nMandell 2004).   I recommend that every mentor asks that question at each meeting and \nevery mentee prepares themselves to answer that same question before the meeting.   \n     Therapists will be alive to the power of the reflected question, but mentoring does \nnot have to be non-directive.  Providing the mentor is self-aware and the mentee is \nprepared to be critically reflective, appropriate self-disclosure can be helpful (‘when I \nfaced that problem, what I found was really going on was…).  Other skills that the \nmentor will use will be giving feedback, counselling, influencing and coaching.  In the \nlanguage of Heron (2001), the skilled mentor may want to explore their abilities to make \ncompetent interventions within the six categories (prescriptive, informative, confronting, \ncathartic, catalytic and supportive), but it is not the purpose of this article to suggest \nthan an effective mentor has to master these skills. \n     Whilst most mentors will rely largely upon skills of questioning, reflecting and \nsummarising, Freeman (1998) came up with a series of questions I call ‘mentoring by \nrote’.   These were devised in response to a plea from General Practitioners in the UK \nfor help in creating an ‘easy to use’ mentoring schema.  In the UK, family doctors often \nwork work in teams, but are essentially self-employed, and there is an isolation inherent \nin the role of the practitioner faced with a series of individual clients.   \n     Freeman suggests that a useful mentoring experience can be had by intelligently \nadapting her proposed questions under six different headings: the professional self; \nfuture hopes; social self; personal self; educational experience and future plans.  If all \nthese skills above are combined with an ability to recognise threshold concepts in \ntherapeutic relationships and the willingness to work towards reframing old problems in \na way that suggests a new direction, the mentor has a rich menu to choose from. \n \n \nSeparating \n \nThe mentoring relationship usually ends at some point, because it was appropriate to a \nset of needs and the skills, knowledge and position that the mentor had at the time.   \n     Sometimes there is a problem with the ending, an unaware mentor can ‘cling on’ and \nthe mentee can experience a sensation of wanting to escape and reclaim their life.  \nRegular reviews are necessary to establish when the formal mentoring relationship \nPublished in Clinical Child Psychology and Psychiatry  Vol 12 (3): 333-340  SAGE   \nDOE: 10.1177\/1359104507078455   © Dr Anne Lee 2007  a.lee@surrey.ac.uk . \nshould close.  Then a friendship or working relationship might continue, but it would be \ndifferent.  It is easier to mark the separation by meeting in a different place, or agreeing \nto do something different at a final session. \n \n \nIn how many ways … can it go wrong? \n \nThe quality of the relationship is more important than whether the relationship is formal \nor informal.  (Clutterbuck and Ragins 2002 p 45) \n     The uncritical mentee faced with an untrained mentor who is burdened with a lack of \nself-awareness can be a problem.  Berglass (2002) has shown how some coaches ‘gain a \nSvengali-like hold over both the executives they train and the CEO’s they report to’ \n(p91). \n     Darling (1985) coined the term ‘toxic mentors’ and these include avoiders, \ndestroyers and criticisers.  Egoists could be added to the list. \n     Some rather dated studies of sexuality in mentoring relationships suggest that \nheterosexual males can abuse the mentoring relationship, and these studies are currently \nbeing updated.  Nonetheless, common sense tells us that there are some boundaries \nwhich should not be crossed by the mentor. \n     Because mentors are not necessarily trained psychotherapists, they may need to be \nparticularly aware of the dangers of mentoring over issues that they have not fully \nresolved themselves. \n \n \nThe way forward \n \nMentoring is only one way of learning from practice, but it is a powerful way.  A \nrelationship that is one to one, where the meaning of the words exchanged can be tested \nand refined and where the language is directly appropriate to the mentee can lead to the \nmost effective transmission of and creation of knowledge and experience. \n     The matching of mentor to mentee can be an imperative of geography and an \naccident of time.  The joy of the mentoring relationship is that it can be informal and it \ncan be initiated by either the mentor or the mentee. It can be a short or a long \nrelationship.  It can be for two people within the same organisation or not.   In \nmentoring we want growth, challenge and achievement, for both parties.  It should be \nenjoyable and life-enhancing.  I hope it is for you.   \n \n \nReferences \n \nArgyris, C,. and Schon, D. (1974)  Theory in practice:  Increasing professional \n     effectiveness. San Francisco:  Jossey Bass   \nBerglass. S. (2002) The very real dangers of executive coaching.  Harvard Business \n      Review 80(6), 86-93 \nBleakley. A. (2000).  Writing With Invisible Ink: narrative, confessionalism and \n     Reflective practice.  Journal of Reflective Practice. 1(1), 11-24 \nClutterbuck, D., and Ragins, B., R. (2002) Mentoring and Diversity. Oxford: \n     Butterworth Heineman. \nCowan, J. (1998) On becoming an Innovative University Teacher  Reflection in Action. \n     Buckingham; Open University Press \nDarling. L. A. (1985) What do nurses want in a mentor?  Journal of Nursing \n     Administration 14 (10) 42-44  \nEgan, G (2002).  The skilled helper.  Pacific Grove CA: Thomson \nFreeman, R. (1998).  Mentoring in General Practice.  Oxford: Butterworth Heinemann. \nPublished in Clinical Child Psychology and Psychiatry  Vol 12 (3): 333-340  SAGE   \nDOE: 10.1177\/1359104507078455   © Dr Anne Lee 2007  a.lee@surrey.ac.uk . \nHerman L and Mandell A (2004) From teaching to mentoring: principle and practice, \n     dialogue and life in adult education.   London  Routledge Farmer \nHeron, J. (2001)  Helping the client  London  Sage \nJarvis, P., Holford, J., & Griffin, C. (1998)  The Theory and Practice of Learning.  \n     London: Kogan Page  \nKram, K. E. (1985)   Mentoring at work: Developmental Relationship in Organisational \n      Life. Glenview Il: Scott, Foresman and Company  \nKnowles, M., Holton, E., & Swanson, R. (1998)  The Adult Learner.  Woburn MA: \n      Butterworth.  Heinemann \nMeyer, J., and Land, R.,  (2002) Threshold concepts and troublesome knowledge: \n      linkages to ways of thinking and practising within the disciplines Proceedings of the \n      2002 10thInternational Symposium on Improving Student Learning \nMeyer, J. H. F., and Shanahan, M. P. (November 2004)  Developing metalearning \n      capacity in students: actionable theory and practical lessons learned in first-year \n      economics  Innovations in Education and Teaching International  Vol 41 No 4   \n      Routledge  \nMezirow, J. (1991) Transformative Dimensions of Adult Learning San Francisco: \n      Jossey Bass \nMoon, J. (1999) Reflection in Learning & Professional Development  London:  Kogan \n      Page \nMorton, A. (2003)  Mentoring  York:  LTSN Generic Centre \nMorton-Cooper, A., and Palmer,  A. (2000) Mentoring, Preceptorship and Clinical \n      Supervision. Oxford: Blackwell Science \nProsser, M., and Trigwell, K. (1999) Understanding Learning and Teaching. The \n      Experience in Higher Education.  Buckingham: Open University Press \nRace, P. (2005)  Making learning happen: A guide for post-compulsory education.  \n      London: SAGE Publications \nRogers, A., (1986) Teaching Adults.  Buckingham: Open University Press.   \nRogers, C. (1967) On becoming a person: a therapist’s view of psychotherapy London: \n      Constable. \nPublished in Clinical Child Psychology and Psychiatry  Vol 12 (3): 333-340  SAGE   \nDOE: 10.1177\/1359104507078455   © Dr Anne Lee 2007  a.lee@surrey.ac.uk . \n"}