{"doi":"10.1080\/09612020400200396","coreId":"66236","oai":"oai:dro.dur.ac.uk.OAI2:2323","identifiers":["oai:dro.dur.ac.uk.OAI2:2323","10.1080\/09612020400200396"],"title":"Working for Jewish girls : Lily Montagu, girls' clubs and industrial reform 1890-1914.","authors":["Spence,  J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-09","abstract":"Lily Montagu was involved in social work and religious ministry with the London Jewish community for over sixty years. This article considers the significance of her involvement in the girls' club movement and her efforts towards workplace reform. It argues that the specific circumstances of working-class Jewish girls in the early twentieth century enabled her to develop a comprehensive view of both industrial organisation and social work. Her approach was submerged as social work and trade unionism diverged along fault lines of gender, but continues to raise issues of relevance toda","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66236.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/2323\/1\/2323.pdf","pdfHashValue":"18ec9dfb8f5252328bb6ee7c034c3f74f22a374a","publisher":"Routledge","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:2323<\/identifier><datestamp>\n      2011-08-17T08:37:34Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Working for Jewish girls : Lily Montagu, girls' clubs and industrial reform 1890-1914.<\/dc:title><dc:creator>\n        Spence,  J.<\/dc:creator><dc:description>\n        Lily Montagu was involved in social work and religious ministry with the London Jewish community for over sixty years. This article considers the significance of her involvement in the girls' club movement and her efforts towards workplace reform. It argues that the specific circumstances of working-class Jewish girls in the early twentieth century enabled her to develop a comprehensive view of both industrial organisation and social work. Her approach was submerged as social work and trade unionism diverged along fault lines of gender, but continues to raise issues of relevance today<\/dc:description><dc:publisher>\n        Routledge<\/dc:publisher><dc:source>\n        Women's history review, 2004, Vol.13(3), pp.491-509 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2004-09<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:2323<\/dc:identifier><dc:identifier>\n        issn:0961-2025<\/dc:identifier><dc:identifier>\n        issn: 1747-583X<\/dc:identifier><dc:identifier>\n        doi:10.1080\/09612020400200396<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/2323\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1080\/09612020400200396<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/2323\/1\/2323.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0961-2025"," 1747-583x","issn: 1747-583X","0961-2025"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2004,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n07 August 2008\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nSpence, J. (2004) ’Working for Jewish girls : Lily Montagu, girls’ clubs and industrial reform 1890-1914.’,\nWomen’s history review., 13 (3). pp. 491-509.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1080\/09612020400200396\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online \n Deposited in DRO:\n07 August 2008\nVersion of attached file:\nAccepted\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nSpence, J. (2004) 'Working for Jewish girls : Lily Montagu, girls' clubs and industrial\nreform 1890-1914.', Women's history review., 13 (3), pp.\u0000491-509.\nFurther information on publisher\u0000s website:\nhttp:\/\/dx.doi.org\/10.1080\/09612020400200396\nWorking for Jewish Girls: Lily Montagu, Girls’ Clubs and Industrial Reform 1890-1914 \n \nJean Spence \nDurham University: September 2002 \n \nAbstract \n Lily Montagu was involved in social work and religious ministry with the London Jewish community for \nover sixty years. This article considers the significance of her involvement in the girls’ club movement and \nher  efforts towards workplace reform. It argues that the specific circumstances of the working class Jewish \ngirls in the early twentieth century enabled her to develop a comprehensive view of both industrial \norganisation and social work. Her approach was submerged as social work and trade unionism diverged \nalong fault lines of gender, but continues to raise issues of relevance today.  \n \n \nIntroduction \nOpening emergency workshops \nOn August 18th 1914, one week after the declaration of war between Britain and Germany, the \nNational Organisation of Girls Clubs (NOGC) opened its rooms in Great Titchmarch Street, London as a \nrelief workroom for girls.  It did so in response to a crisis in the clothing trade as wealthy patrons, \npanicking at the prospect of war, suddenly withdrew their orders. Initially, the workrooms were intended to \nhelp tide over a few affiliated club members in distress. However, so great was the demand for work, that \ntwo weeks after opening, the enterprise moved to the West Central Jewish Girls’ Club, run by Lily \nMontagu  in  Dean Street, Soho. By the middle of September they had moved yet again to the Whitfield \nTabernacle, where six hundred young women a day were employed.  \n \nDuring that first month of war, Lily Montagu, who chaired the NOGC, became a member of the \nCentral Committee on Women's Employment, and through it secured a Government grant of £500 in order \nthat the renamed “experimental” workrooms might take any unemployed girl, regardless of club \n 1\nmembership. By mid October, statutory workrooms were in place and the NOGC scaled down its \noperation. By January 1915, the  employment crisis  had passed, new openings were emerging for female \nlabour and the NOGC workshops closed altogether with a pledge to seek work for the 20 girls remaining. \n[1]  \n \nThe National Organisation of Girls Clubs \nThat the NOGC could respond so rapidly and effectively to a temporary but very real need \namongst clothing workers in London in 1914, was a consequence of its interests and its history. As its name \nsuggests, its purpose was the national co-ordination  of Girls' Clubs. It also provided activities and lectures, \ncampaigned around the interests of young female workers and offered a support service for those who \nwished to complain about infringements of the Factory Acts. Many of the women involved in the work of \nthe NOGC were, like Montagu, running girls' clubs. They were in regular contact with their members and \nthe effects of the war on the girls would have been immediately obvious to them.  \n \nThe organisation could trace its antecedents to the industrial unrest in London in the 1880s. It had \nemerged from the Women's Industrial Council (WIC), itself a development from the Women's Trade Union \nAssociation which had been created after the 1889 Dock Strike in order to organise female workers. As a \nmember of the WIC, Montagu had been the Honorary Secretary of the Clubs Industrial Association (CIA), \nan associated group whose primary aim had been to educate young female workers about the Factory Acts, \nand to use girls’ clubs as a basis for industrial organisation. In 1911, after disputes over policy regarding \nthe demand for a minimum wage [2], the CIA became fully independent and joined with elements of the \nNational Union of Women Workers to create the National Organisation of Girls Clubs.  \n \nThe main interest of the NOGC was the welfare of young women at work and its uniqueness lay in \nits stated objective, to develop  “social and industrial work under one head” for this group of workers. The \nrecreational and educational activities which were the  hallmark of affiliated clubs were devised in relation \nto the working life of members and in response to the effects which work had upon them. Where waged \nwork impacted negatively upon moral, physical and intellectual development, the NOGC accepted \n 2\nMontagu’s argument that club leaders had a responsibility to “interfere in the industrial life of their \ngirls”.[3] Thus in 1914, the NOGC was in touch with young women as workers in a way which could be \nmatched by no other organisation.  \n \nBecause many of the women who were involved  were “ladies of influence”[4], belonging to well-\nconnected families, they could affect political decision-making,  have their research findings and arguments \ntaken seriously and thus inform government policy. Indeed, whilst the workrooms were being organised in \nOctober 1914, the Intelligence Department of the Local Government Board was also requesting the help of \nthe NOGC in collecting statistics regarding the extent of unemployment.[5]  It is no accident that their \nChairwoman was seconded to the Central Committee on Women’s Employment, and that the workroom \nfacility they opened was endorsed by the State. Lily Montagu was self-consciously determined to use her \nclass priviledges to improve the lives of working class young women and her commitment to the NOGC \nreflected this determination. She was powerful within the organisation and the direction of its work in its \nearly years, is marked by her priorities. These were general in their application but arose from the particular \ncircumstances of her personal life.  \n \nLily Montagu \nLily Montagu’s main concern was the girls of  London’s Jewish community, many of whom were \ndaughters of immigrant families. Young female workers, toiling in sweatshops, factories and at home were \nnot in the ordinary course of events reached by the trade union movement. However, many were connected \nwith girls' clubs. These clubs, provided by middle class voluntary social workers, sometimes as an aspect of \na Christian “mission”, offered opportunities for recreation and informal education.[6] Montagu was \nenthusiastic about their potential, and keen to make provision specifically for Jewish girls. She believed \nthat clubs could help to heal class conflict and division if the middle class leaders were prepared to meet the \nworking class members in a spirit of friendship.  For her, to know a club member as a friend was to know \nabout her life and circumstances and to work for her benefit. Taking this view, Montagu learned directly \nfrom the members of her club how low wages, overwork and insanitary conditions were implicated in the \nmaterial, cultural and spiritual poverty which blighted their young lives. She thus became concerned with \n 3\nthe question of industrial reform and she worked tirelessly, both as a girls’ club leader in day to day \nassociation with members and at an organisational level with other industrial reformers, to improve female \nworking conditions. Yet she is a largely forgotten figure both in the general history of club work with \nyoung people and that of industrial reform. \n  \nAs the moving force behind the creation of the NOGC, Montagu founded a major national \nvoluntary youth organisation which continues its work today as ' UK Youth'. However, her name hardly \nappears in the general historical accounts of youth work, many of which are concerned primarily with club \nwork with boys and young men or with particular movements such as the Scouts.  Even in its own “Short \nHistory” [7], UK Youth does not mention Montagu. It is only within feminist and Jewish youth work that \nshe is present.[8]  Yet she was one of the few early youth workers to write about club work.  The loss of her \nmemory relates partly to her identification with the interests of the Jewish community and faith which \nsituated her as a ‘specialist’ worker, despite her declared ecumenicism. However it is also due to her \ndetermination to place young women at the centre of her thinking and action. For as the twentieth century \nprogressed, work with ‘youth’ became increasingly masculine.[9] The dominant practice came to \nconcentrate almost entirely upon the social education and recreational needs of boys. Meanwhile as trade \nunions took care of boys’ industrial conditions, any pretensions towards industrial reform were abandoned \nin mainstream youth work.  \n \nThe growth of trade unionism as the major movement towards workers’ rights and industrial \nreform has meant that complementary organisations working towards similar ends but without allegiance to \nparty politics have not been given a great deal of attention by labour historians.  Therefore, not only has \nMontagu been marginalised in the history of youth work, but she has also been virtually ignored in the \naccounts of twentieth century social and industrial reform.  Only with Mappen's 1985 study of the Women's \nIndustrial Council [10], does she begin to emerge into the frame. Yet she was associated with some of the \nbest known female activists of the Edwardian period. For example, Beatrice Webb, Emmeline Pethick \nLawrence, Clementina Black and Margaret Bondfield were all colleagues and Margaret Macdonald, who \ncreated the Women’s Labour League, was a great friend. With Emmeline Pethick and Mary Neal of the \n 4\nEsperance Girls' Club, Lily Montagu and her sister Marian purchased the Green Lady Hostel in \nLittlehampton as a holiday home for Girls' Club members which became a significant asset in the work of \nLondon Girls’ Clubs.[11]  Meanwhile, as the Chair of the Labour Law Association, Montagu worked \nalongside its President, Beatrice Webb.[12] Yet references to her in the accounts of these eminent women \nare sparse.  \n \nIt is certainly the case that Lily Montagu does not fit easily into the stereotyped images of female \nlabour reformers. She was not a waged worker and did not ally herself with any one trade union, and she \nseems to have retained her Liberal allegiances despite her friendship with Margaret and Ramsay \nMacdonald. Her story does not fit easily into the narratives of socialist activism and there is a marked \nabsence of ideology in her own writings which are very simple and direct. In situating her reforming \nactivism within clubs rather than trades unions, she was signifying her understanding of the manner in \nwhich young women could be reached. However, this ran counter to the principles of labour organisation \nemerging at that time. Emmeline Pethick Lawrence recalled in relation to her own work with the Esperance \nGirls Club: \nThere were people of some importance in the socialist movement who used to call on \nus in order to point out that what we were doing was quite worthless, since we were \nonly extending to a handful of people some of the benefits that the capitalist regime \nhad bestowed upon us, instead of throwing all our energy into an attempt to change \nthe economic system.[13] \n  \nMontagu did not think in revolutionary terms. She considered it her duty to extend to as many \npeople as she could  “the benefits that the capitalist regime had bestowed” upon her, and she was convinced \nthat this was  work which could improve lives.  At the same time, she believed that trade unionism could be \na force for industrial progress, smoothing industrial relations, improving conditions for workers, and \nbenefiting all in the process. She therefore hoped that her work would lead to trade union organisation \namongst Jewish young women: \n 5\n I must admit to my deep regret that with a few exceptions our girls have not identified \n themselves closely with trade organisations.... \nPerhaps because of persecution, most of our parents are individualistic. They have had \nto fight for their place in the world of industry; they have had to win for themselves \nthe right to work for their living; so their strength has spent itself, and they have been \ninclined to teach their children to get on with their work, mind their own business and \nlet other people get on with theirs, saying  “What's it to do with you?” Again and \nagain, we have tried to inculcate a wider point of view, and to explain the advantages \nof belonging to unions. The results have been rather sporadic and not very \nsuccessful.[14] \n     \nAmongst people who had fled pogroms and for whom anti-Semitism was an ever-\npresent reality, to be able to earn a living without harassment was the most pressing ambition. \nMontagu was alert to the conditions under which such sentiments had emerged and her realism \nled her to investigate other means by which she could affect conditions of labour. It was in this \ncontext that the work of the Women’s Industrial Council was appealing. Here was an \norganisation comprising mainly middle class women like her, which carried some weight with \nthe establishment, but without party political allegiance. However, because she chose to use it \nas a basis for extending her club work, rather than as an adjunct to political activism she only \nappears on the margins of the political story.  \n \nNevertheless, Lily Montagu is not totally forgotten. She is remembered for her contribution to \nJewish welfare and religion. Those who knew her recall with respect and affection her club and settlement \nwork and her continuing involvement in youth work until her death in 1963.[15] Her status in this context \nhas an extra dimension because of her contribution towards the establishment of Liberal Judaism.[16] She \nundertook a long and painful spiritual journey away from the Orthodoxy of her family which eventually \nresulted in strained relations with her beloved father. She confided her troubles in Margaret Macdonald, \nwho compared the situation with the family opposition she encountered when she moved to the left in \n 6\npolitics; but Margaret thought Lily’s religious struggles “specially difficult”.[17]  Ultimately, although \nMontagu’s family was important to her, her faith took precedence. All other activities flowed from her \ndesire to create a “Living Judaism”.[18]  In 1915 she had the honour of being the first woman to preach in a \nBritish Synagogue [19] and she became Britain’s first Jewish woman Minister. Prior to this she had often \nofficiated at the services of the West Central Section of the Liberal Jewish Synagogue whose congregation \nwas at the outset primarily female.  \n \nLily Montagu never courted fame.  However, the fact that she occupied roles which granted her \norganisational power and authority and the amount of work which she embraced, suggests that her \ninvisibility in the record of socialist and social welfare movements is structural as well as personal. Not \nonly did her concern with working class Jewish girls situate her outside the main concerns of trade union \norganisation, but her particular emphasis upon the importance of combining industrial, social and personal \nmatters meant that her interests were out of temper with the tendency of the times to resolve social \nquestions and issues into grand narratives and mass movements.  Suffrage and social justice she supported, \nbut suffragism and socialism never claimed her allegiance.  Similarly, in her religious life, her tendency \nwas towards interpretation. She sought harmony between individual feelings, emotions and beliefs and the \ntextual, ceremonial and organisational imperatives of formal religion.  \n \nIn pursuit of a balance between faith (spiritual and personal life), friendship (community life), and \nunderstanding (intellectual and cultural life), Montagu  gave her time and energy across three major fronts - \nJewish religious reform, girls' clubs and industrial reform. That she should have attempted to combine these \nthree elements reflects to a large extent not only her own personality, but also the particular time, place and  \nsocial space into which she was born.  \n \nIdentity and Identification \nMontagu was very much a child of her time, maturing in a period when young women of her class \nwere attempting to carve out a space for themselves in the public world. She recognised this herself:  \n 7\nIt was the time of great changes in the lives of girls in the so-called leisured homes. \nTheir education was too good to allow of them being any longer content with the \nsmall home duties which in another generation satisfied unmarried girls. They felt the \nneed to justify their existence by some form of useful effort.[20] \n  \nMany of these young women justified their existence through voluntary social, welfare and \nmissionary work. Visiting the poor in their homes, developing clubs, teaching in Sunday Schools and \norganising groups to campaign against destructive habits such as drinking, gambling and prostitution, was \nquite the fashionable thing to do. Such work - undertaken in moderation - was considered suitable for \nyoung women because it could be easily conceived within the traditional terms of domesticity and \nfemininity.[21]  \n \nIn addition to this general atmosphere affecting young  ladies, there were particular factors \naffecting Lily Montagu: the example and influence of her parents; her awareness of the conditions of the \nEast End of London; and her Jewish  identity in a period of Jewish immigration.  \n \nParents \nEllen (nee Cohen) and Samuel Montagu were members of the Anglo-Jewish establishment Her \nmother’s power was expressed as a woman “in the background” [22] exerting a strong family influence. \nEllen Montagu gave continuous practical and moral support to Lily, the sixth of her ten children, even \nwhen religious differences caused a family rift.  Lily Montagu took her mother as a role model for her \napproach to club work, endeavouring to learn about each of the members individually, to guide them and \nteach them with tolerance and understanding, maintaining her authority by offering an example of \nexemplary behaviour in her own life. Later, she was to refer to herself as the “Club Mother” and to \nacknowledge the significance of the   \nloving understanding of my mother…because during forty years of my life I have \nbeen called “mother” by a vast number of girls and women. I feel I owe much of my \npower to win the  confidence of  “my children” from having as my model the mother \n 8\nwho throughout her life had no greater pleasure than that of sharing her children's \ninterests, and whose faith in God was expressed in every detail of her life.[23]   \n  \nHer father was a self-made, millionaire banker. He was an influential figure within the Anglo-\nJewish community, involved in religious, philanthropic and political organisations. As a Gladstonian \nLiberal he became MP for Whitechapel in 1885.  Samuel Montagu was a powerful figure in his daughter’s \nlife and it was to her father that she looked for her inspiration to act upon and change social and industrial \nconditions. Until 1911, when she broke with Orthodox Judaism, she had her father’s unequivocal support. \nFor instance, along with Fred Lawrence, Samuel Montagu donated £1000 towards paying off the mortgage \nand extending the premises of the Green Lady Hostel.[24] \n \nAlthough there were some limitations upon her freedom, such as the necessity of being \naccompanied by a chaperone when she first began to visit poor homes, Lily Montagu benefited greatly \nfrom having been brought up in a large, liberal and politically active household:  \nMy parents led strong, purposeful lives, and were not opposed to our having interests \noutside  the home. They applauded our desire to assist others less fortunately placed \nthan ourselves, and, through their close concern with the East End of London, I was \nconstantly visiting there.[25] \n  \nVisiting the East End included attendance at some of her father’s political meetings where she was \nable to observe the audience from the platform. She recalled that it was here that she learned to understand \nthat recreation in community was important, that association gave people pleasure and that laughter could \ncement relationships. Most of all, she learned that people could be won over if they were heard and taken \nseriously.[26] These lessons were applied directly in both her club work and in organising around industrial \nissues.  \n \n 9\nThe East End \nWhile her father was MP for Whitechapel, the East End of London, suffering gravely from \neconomic volatility, was alive with political activity and industrial unrest. In 1886-7 there were \ndemonstrations and occasional rioting amongst unemployed workers which spilled over into the smart areas \nof the West End, threatening the wealthy inhabitants with fears of revolution.[27] In 1888, the Match Girls’ \nstrike brought to the forefront of public attention the conditions under which these women laboured and the \nconsequences for their health and well being. Annie Besant, who led their strike, powerfully connected \ntheir conditions with the lack of female political power.[28] The following year, the Great Dock Strike \ngave the lie to the widely held view that unskilled casual labourers could not be organised. From this was \nborn the ‘New Unionism’, which gave great impetus to socialist organising.    \n \nAt the same time as these events dominated the political stage, Montagu’s constituency became \nnotorious through the 1888 Whitechapel murders. The fact that the victims were prostitutes inhabiting some \nof the poorest areas, spoke to the deepest fears of the Victorian establishment regarding the sexual dangers \nof the city. Narratives of sexual degradation and corruption had already established the city streets as a \nplace of danger for girls and women [29] and many respectable people were involved in activities to \npromote sexual purity, or to ‘save’ the fallen. Within philanthropic work with women, this theme was ever-\npresent. It did not take a great deal of imagination to link prostitution with poor wages and the absence of \nwholesome leisure activity for young women. \n  \nA politically involved household like the Montagu’s could not have failed to have opinions on \nthese matters. Samuel Montagu, offered a reward of £100 for information leading to the arrest of the \nWhitechapel murderer.[30] Meanwhile, the MP attempted to demonstrate sympathy with the dockers, \narguing that they should at least be provided with shelters as they waited for work. The events of those \nyears must have had a strong effect upon the consciousness of Lily Montagu.  In 1888, aged fifteen, she \nhad just left school, and was struggling to continue her education at home. Certainly social and religious \nissues were significant in the growing political awareness of Margaret Gladstone (Macdonald) with whom \nLily was in constant communication and it appears that the two young women significantly informed each \n 10\nother’s views.[31] Moreover, for Lily the question of the East End was even more acute because of the \ntensions created in response to the growing numbers of immigrant Jews settling there.   \n \nJewish Immigration \nThe involvement of the Montagu family in Whitechapel reflected the significance of the Jewish \ncommunity in that area. In 1886 in particular, Jewish people displaced by persecution in Russia made their \nway to the East End of London where, it has been suggested, their presence “disturbed the precarious \nrelations in East London Trades” and made more “visible” the “conditions of work in the sweated \ntrades”.[32]  Jewish charities which had traditionally cared for the Jewish poor  were inadequate to the task \nof providing comprehensively for the new settlers and there was much discussion about the practical \nconsequences of the migration. Nathan Adler,  Chief Rabbi for 35 years until 1880, wrote of the refugees: \nMany of them are lost without livelihoods...it is difficult for them to support \nthemselves and their households, and at times they contravene the will of their Maker \non account of poverty and overwork, and violate the Sabbath and Festivals. Some \nhave been ensnared in the net of the missionaries and renounced their religion, may \nthe Merciful save. Woe to the eyes which see and to the ears which hear such \nthings.[33]   \n  \nMoreover, the new Jewish settlers were different. They had different languages, dress and social \nand religious habits. They were obvious on English streets. For the settled Jewish community, only recently \nenfranchised in 1858, such visibility was destabilising. It stirred up anti-semitism.[34] The challenge was \ntherefore to help the immigrants to assimilate to English ways as quickly as possible whilst at the same \ntime enabling them to retain their Jewish identity and faith.[35] Samuel Montagu was a driving force in \nattempting to meet this challenge.  \n \nIn her memoir of her father written in 1913, two years  after his death, Lily Montagu mentions his \neducation in the Mechanics Institute in  Liverpool where he had  to  “fight many battles in order to exhort \nrespect for the Community which he represented, and to which he was from his earliest days passionately \n 11\nloyal”.[36] The words she used to describe him, could easily have been said of herself:  “As a worker \namong Jews, he had always one supreme object in view; he wished to free the least happy of his co-\nreligionists from oppression, whether political, industrial, social or religious”.[37]  It was within this \ncontext that Lily Montagu began to take an active part in social and religious work. However, she was \nconcerned primarily with the female experience. For her, the question of poverty was compounded by the \nsexual vulnerability of women. Women who could not earn a decent wage, could become easy prey to \npredatory rich young men or be ensnared by prostitution.  Intolerable working conditions made young \nwomen vulnerable to hasty and unsatisfactory marriages.  Meanwhile, Saturday work denied them the \nopportunity for Sabbath observance and they could thereby be easily lost to an inflexible Judaism, either \nthrough conversion to Christianity or through marriage to a Christian. Montagu explored these themes \nprimarily in her fictional and semi-fictional writing [39].     \n \nA Vision \nAccording to Nellie Levy an early  member of the West Central Club, later its leader and who in \n1914 was employed by the NOGC, Lily Montagu was motivated by a vision experienced in 1892: \nA young girl dreamed and behold a vision appeared and she saw her sisters, and they \nlacked much that had been bestowed on her, some needed guidance and friendship, \nsome to be lifted out of squalor and shown the light; some seemed mere children \nforced to become breadwinners; some ran to and fro to snatch at pleasures that were \ntransitory and left bitterness and disillusionment; some cried “Give us opportunities \ndenied us, we too need light, space, knowledge”; others sat and waited to enter the \nworld of literature and art, and again, others feared to tread, for the path seemed  \nstrewn with giants, who could be overcome only by strength which they lacked, and \nstill others groped towards those frailer than themselves and longed to hold out a \nhelping hand but knew not how. \n ...and she cried: \n “To this vision I consecrate myself, and for its fruition I will labour unceasingly. I will \nbreak down barriers, establish friendships and give opportunities. I will share, bind up \n 12\nthose who are broken, and I will set before them light and good through a Faith in \nJudaism, so that they have strength  wherewith to live”. \n And God blessed her and she awoke.[39]  \n   \nThis was undoubtedly the story which  Montagu used to explain her motivations for founding the \nWest Central Jewish Girls Club. However, her interventions began before 1892. In 1890, with her sister \nMarian, she offered lessons in History and Literature to girls forced to leave school in order to work. \nMeanwhile, she was helping to run “happy evenings” for children at the Jewish Free School. She enjoyed \nthese evenings but doubted their value, claiming that they lacked structure and purpose.[40] During this \nperiod she was introduced to club work by Margaret Gladstone who ran a Sunday School class and Church \nboys’ club between 1889 and 1893. Through Margaret she realised the importance of developing \nfriendships with the children.[41]  The idea of cross-class friendship was at the heart of the separation of \nsocial work from that socialism which was motivated by ideas about class conflict and Montagu’s \ncommitment to the principle of friendship undoubtedly restrained her relationship with the Labour \nMovement. While Margaret moved from social welfare to political activity and thence to socialism, Lily \nremained a social welfare worker throughout her life.  \n \nIt was probably Margaret’s Gladstone’s Sunday School which encouraged Lily to start her \nSabbath services for Jewish children. At these informal services, she found that not only the children, but \nalso their mothers attended in preference to the Synagogue. It was clear to the ever-observant young \nwoman that the formalism of the Synagogue and routine observation of ritual, did not speak to the real lives \nof these women and children, and here began her quest for a reformed and responsive Judaism.  \n \n However, in 1893, when the West Central Club was founded, her Orthodox credentials were \nbeyond reproach and when the devout Emily Harris started a Bible class in Bloomsbury, she invited Lily \nMontagu to give Shakespeare readings to the girls as a treat for coming to the class. When these girls \nsuggested that there were numerous Jewish girls involved in the Soho clothing trade  who would welcome a \nclub if the young lady would like to start one, the young lady took the hint. Thus Lily Montagu began to \n 13\nprovide social and educational work in Frith Street for the Jewish girls who worked in the sweatshops of \nthe area. Nellie Levy continues the story: \nWhen the numbers had reached 17 and had outgrown the accommodation, two rooms \nin Dean Street were rented. Marian, her sister, immediately joined her in this work, \nbecame immersed in it and remained a co-worker, a loving, loyal and self-effacing \nhelper to Miss Lily throughout her life. Immediately, classes were formed, the three \nladies feeling that the girls having left school at a very early age had been deprived of \nknowledge which would have made their lives richer and fuller. Most of the girls and \ntheir parents had come from Russia and Poland, having escaped from persecution, and \nMiss Lily wanted to integrate them into the English way of life, so English classes for \nforeigners (as they were then called) were started.  \nIn a short time, the membership roll reached 70 and the West Central Jewish Club for \nWorking Girls sprang into being: the objects stated were “to bring brightness and \nrefinement into the lives of Jewish working girls”.[42] \n  \nIndustrial Interests \nWhilst most middle class women who became engaged in club work with girls would have \nclaimed that their work was designed to educate and improve the condition of working class girls, Montagu \nbelieved that few club leaders understood the level of commitment required to achieve their goals: \nLike other philanthropists, club workers are too easily satisfied with fringing the \nproblems with which they should grapple. They peep down the abyss in which the \nunderfed, the ill-housed, and badly clothed work out their life's drama, and they turn \ntheir energies to surface polishing. They try to make their girls conduct themselves \nwell in the clubs, and interest them and amuse them as best they can during their \nevening's leisure. But they are inclined to ignore the industrial life; they like to forget \nthe grim truth that if girls work for less than a living wage, in a vitiated atmosphere, \nthey are not likely to become the strong, self-controlled women whom we desire the \nclubs to train.[43] \n 14\n  \nFor someone who desired to assist working class Jewish young women to achieve the highest \nideals of Jewish womanhood, it would have been impossible to ignore the circumstances of work. \nEverything about the daily life in the factories, sweatshops and home based industries of the London \neconomy in which young working class women of whatever faith spent their days, militated against these \nideals. Montagu worried about the effects of labour upon young women at a number of levels. \n \nFirstly she was concerned about the age at which they started work. This disrupted their education \nand prevented them growing to their full potential, a loss which she herself had experienced.  Earning a \nwage also meant that to a large extent they became independent of home control. This was dangerous to \ntheir safety and sexual morality particularly when the drudgery of working life created a craving for \nexcitement. Jewish girls were predominantly engaged in the seasonal trades. Here the situation was \nexacerbated in the slack periods when with nothing to occupy their time, the girls simply hung around \n“loafing”. Thus she advocated the raising of the school-leaving age and, alongside recreational activities, \ndeveloped in her club a curriculum of both formal and informal educational work. \n \nSecondly, she believed that low wages, unequal to those of boys, caused girls to think of \nthemselves as cheap. Low wages, and a lack of training, were related to the belief that waged work for girls \nwas only a temporary interlude before marriage. Industrial organisation amongst girls was consequently \nconsidered irrelevant. This undermined any sense of responsibility or pride which might be developed in \ngirls with regard to their work. When work lacked skill it was mere drudgery and it was hardly surprising \ntherefore that many longed for marriage as an escape from such labour.  Thus the educational work of \nMontagu’s club was designed to increase skill and encourage aspiration amongst her members.  In reality, \nmany girls and women were the main breadwinners of their families. Particularly within religious Jewish \nfamilies where male education was considered to be of more significance than female, the women were \noften the main earners. The self-worth of such young women could be heightened by improved wages and \ntraining. These gains Montagu believed could only be won through self-directed industrial organisation, but \nskills learned in the club might help.  \n 15\n Thirdly, industrial success was won as a consequence of individual ambition and competition, \nwhere self was central. The culture of competition sat in direct opposition to Montagu’s belief in the \nimportance of the shared and common life, wherein association and equality between individuals \nencouraged care and concern for each other. Against such competitive attitudes she advocated co-operation \nand organisation in both social and working life.  \n \nGeneral conditions of work for young women were often exaggerated in their consequences for \nyoung Jewish women toiling in local sweatshops. Remembering the conditions which were common at the \nend of the nineteenth century, she later wrote:  \nThe wages of women and girls were so low that it is not surprising that they regarded \ntheir working life as a temporary evil rather than as a career in  which it was desirable \nto be as efficient as possible. Girls, or at any rate, Jewish girls, were expected to \nmarry, and they often married for the sake of deliverance from the crushing \ncircumstances of their lives. Most of my girls in the early years of the Club were \ntailoresses in domestic workshops. The employers had to carry on their work near the \nbig, fashionable West End retail shops. Rents were inordinately high, and it was \nnecessary to live near the “shop”, so that rooms had to be used for living and working \npurposes. The average working hours were 8.00 am to 8 pm with an hour for dinner \nand half an hour for tea. In hot weather the men often worked stripped to the waist, \nand the atmosphere created by overheated bodies was anything but pleasant.... \n Many of our girls worked for very long hours as dressmakers and milliners. It \n seemed remarkable that children could survive the strain of such protracted \n sedentary occupation.[44] \n  \nIn encountering the conditions of work of the members of the West Central Club it became \napparent to Montagu that industrial reform included policing existing legal standards effectively. There \ncould be an important role for the middle class leaders in helping to enforce and improve industrial law. \n 16\nHer conviction in this matter was expressed through her membership of the Women’s Industrial Council \n(WIC) to which she was introduced by Margaret Gladstone in 1896. \n \nThe Women’s Industrial Council \nThe WIC was founded in 1894 by a number of middle class women who, in the wake of the \nstrikes of the 1880s had attempted to unionise women workers in the East End of London through the \nWomen’s Trade Union Association. They had very little success and eventually they turned their energies \nto the wider aim of improving the industrial conditions for women. The WIC was designed to play to the \nclass strengths of the women involved. Its intentions were explained in the first issue of its quarterly \nmagazine, the Women’s Industrial News (WIN): \nThe Women’s Industrial Council was established by a little group of people, who after \nseveral years’ endeavour to organise working women, had become convinced, \nFirst: that there was a great need for the careful and systematic collection and \npublication of facts about the conditions of female work and  \nSecond: that the position of working women might be ameliorated in various ways by \nthe organising of recreative clubs, by the training and developing of greater skill in \ncertain occupations, and in some instances by alterations of the law.[45]  \n  \nThe organisation offered a congenial environment for Montagu to pursue her aspirations. From the start she \nprioritised the concerns of young women. In 1897, the WIN reprinted a conference paper that she had \ndelivered in which she argued that, it was the “imperative duty” of club leaders to “interest themselves in \nthe industrial lives of their members”:  \nI have heard leaders say that it is outside their club work to interfere in the industrial \nlives of their girls. I ask them whether they can honestly profess friendship with their \ngirls if they refrain from making use of the knowledge which might render their young \nlives far more tolerable? Again, can a club leader maintain that her girls derive full \nbenefit from the classes and amusements which she provides for them, while they \nspend their days under insanitary conditions, and constantly work beyond the legal \n 17\nnumber of hours?.…We can only promote the usefulness of our clubs by trying to \nimprove  the conditions of the members’ industrial lives.[46] \n   \nParticularly after 1899 when  she became Secretary of  the Clubs Industrial Association, and as \nChair of the Industrial Law Association,  she concentrated her efforts upon educating girls about their rights \nat work, emphasising the importance of the Factory Acts, encouraging club members to provide \ninformation about employers who flouted the rules and linking them with the services of a voluntary lawyer \nshould they need help. At the same time, she argued vigorously for an increase in the numbers of female \nfactory inspectors. These themes were to remain at the forefront of her activity as the Club’s Industrial \nAssociation transformed itself in 1911 into the National Organisation of Girls Clubs. Looking back in 1943 \nshe explained her priorities:  \nQuite early in our Club history, we realised the importance of securing for our girls at \nleast the minimum legal standard of working conditions. We knew that bad \nemployers, by evasion of the law, could get an unfair advantage over those who \nbenefited their employees by keeping the law. The first necessity for us leaders was to \nknow the law, and we had the assistance on our council of Clementina Black. At one \ntime she made a skilful rhyme of the Factory Act.... \n In order to obtain the confidence of workers and convince them that it was their \nresponsibility to report evasions of the Factory Act we founded the Clubs Industrial \nAssociation....We had lectures from factory inspectors, especially the senior Inspector, \nMiss Anderson (afterwards Dame) and Mrs. S. Webb, and since we had the girls' \nconfidence we could easily discover illegal overtime, and other evasions of the \nFactory Acts.… \n Under the presidency of Mrs Sidney Webb, we formed the Industrial Law \nAssociation, in connection with the Women's Industrial Council, and lectures were \norganised for club leaders, who would take counsel together on general industrial \nconditions, and they in turn would instruct their girls. Among other distinguished \ncolleagues, were Miss Margaret Bondfield and Miss M. Symonds.[47]  \n 18\n  \nFrom a personal concern with the well-being of girls, to an understanding of the necessity of \nimproving female working conditions, Lily Montagu moved inexorably towards the question of educational \nprovision. Firstly, it was crucial that Club Leaders should “know the law”. Secondly, it was the \nresponsibility of those leaders to inform their members about the law and thirdly it was important that club \nleaders share their knowledge  in order to better “instruct their girls”. Eventually the desire to provide the \nbest possible service in club work directed her attention towards the necessity of training workers. She \nherself regretted the fact that she had received no formal training. Her work had begun in a period when \nclass and status were all that was required to intervene in the lives of others less fortunate but in a \nconsideration of the industrial training needs of working class girls she came to understand only too clearly \nits relevance for her own profession.   \n \nConclusion \nLily Montagu’s life work had at its heart her Jewish faith and identity as well as an abiding belief \nin the potential of femininity as a power for good.  This cut across class differences and encouraged in her a \nsympathy for Jewish girls whose circumstances were not as fortunate as her own. In many ways, her early \ninterventions into working class life were typical of those of any young middle class English woman of her \nage seeking useful employment beyond the limits of domesticity.  Montagu’s initial efforts to increase \nopportunities for religious understanding and observance amongst Jewish women and children were \nbroadly educational and very similar to the faith inspired activities of middle class Christian women \nventuring into voluntary social work.  \n \nHowever, the particular situation of  young Jewish women workers made her keenly aware of the \nimpact of waged labour upon their lives. This not only restricted their potential to realise themselves in the \nideals of Jewish womanhood, but also narrowed their intellectual and social horizons. It was this realisation \nwhich, in the context of the liberal humanism of Montagu’s own education and social network, encouraged \nher to become active in the women’s movement for industrial reform.  She was unusual in not translating \nthis concern into party political activism or feminist activism. Although she favoured trade union \n 19\norganisation, her awareness of the precariousness of life for many immigrant Jewish families, of the \nparticular circumstances of the trades in which Jewish workers were engaged and of the place of women \nwithin this caused her to maintain her commitment to the possibilities of the club movement as a means of \nindustrial organisation and education for young women.  \n \nWithin the club movement she was also unusual in situating industrial reform at the heart of the \nwork. Whist most girls’ club workers were inspired by an evangelical desire to “improve” their members \nthrough general education, training and recreational activity, few were inclined to use their clubs as a \nvehicle for rights-based education, for campaigning, and for legal interventions into industrial matters. \nMontagu understood that to know the conditions under which her club members laboured, was to \nunderstand the girls themselves. Such knowledge provoked a moral obligation to not only seek to improve \ngirls’ characters, but also to improve the circumstances in which such characters were formed. This in turn \nbrought with it a desire that the girls might be educated to organise themselves, to be active rather than \npassive participants in their own world.   \n \nLily Montagu’s work offers an example of a sustained effort to organise and educate women \naround their working conditions in a manner which centred the reality of women’s lives. The masculinity of \nthe trade union movement and the therapeutic, family-centred approach which was to characterise the \nhistorical development of social work place her outside the mainstream of both movements. However, \nmany of the issues which were of concern to her remain pertinent today  for those who work in the fields of \ntrade union organisation, education and social welfare and who have a particular concern for young \nwomen. The emphases are of course different, and work and education have changed significantly for the \nmajority. Nevertheless, for young women who belong to poor working class families, for the daughters of \nminority communities and asylum seekers, there is much which is all too familiar, particularly in relation to \nconditions of work, low wages and an absence of recreational and informal educational opportunities. For \nthose who might wish to intervene in the lives of such young women, an appreciation of Lily Montagu’s \nwork has much to offer.   \n \n 20\nReferences and Notes \n \n[1] NOGC Minutes 15th Oct. 1914; 21st Jan. 1915.   \n[2] Christine Collette (1989) For Labour and for women: the Women's Labour League, 1906-1918 p.46  \n(Manchester: Manchester University Press). \n[3] Lily H. Montagu (1897) The relations of girls’ club leaders towards the Factory Acts,  Women’s \nIndustrial News, December,  p.15.  \n[4]  A. Susan Williams (2000) Ladies of Influence: women of the elite in interwar Britain London: Allen \nLane.  \n[5]  NOGC Minute 15th Oct. 1915. \n[6]  Maud Stanley (1890) Clubs for Working Girls  (London: Macmillan.) \n[7]  A short history of UK Youth  (London: UK Youth, 2001).  \n[8] Sidney Bunt (1975) Jewish Youth work in Britain: past, present and future, (London: Bedford Square \nPress); \nJean Spence, (1998) Lily Montagu: A short biography, Youth and Policy Summer, 60,  pp.73-83; \nAnnemarie Turnbull (2001) Gendering young people - work, leisure and girls' clubs: The work of the \nNational Organisation of Girls' Clubs and its successors 1911-1961' in R. Gilchrist, T. Jeffs, and J. \nSpence (Eds.) Essays in the History of Community and Youth Work,  pp.95-110 (Leicester: Youth \nWork Press). \n[9] Jean Spence (1990) Youth Work and Gender in Tony Jeffs and Mark Smith (eds.) Young People, \nInequality And Youth Work, pp99-119 (London: Macmillan). \n[10] Ellen Mappen, (1985) Helping Women At Work: The Women's Industrial Council 1889-1914, \n(London: Hutchinson in association with the Explorations in Feminism Collective).  \n[11] Emmeline Pethick-Lawrence (1938) My part in a changing world pp120; 132, (London: Victor \nGollancz). \n[12] Beatrice Webb (Ed.) (1902) The case for the Factory Acts, (London: Grant Richards).  \n[13] Pethick-Lawrence, My part in a changing world, p.119. \n 21\n[14] Lily H. Montagu (1954) My Club and I: the story of the West Central Jewish Club, p. 64 (London: \nNeville Spearman and Herbert Joseph; first published 1944). \n[15] Eric Conrad (1967) In Memory of Lily H. Montagu: Some extracts from her letters and addresses \n(Amsterdam: Polak and Van Gennep);  \nNellie G. Levy (u.d.) The West Central Story And Its Founders The Hon. Lily H. Montagu  CBE, JP, \nDD And The Hon. Marian Montagu: 1893-1968. Club Pamphlet. \n[16] Lily H. Montagu (1943) The Faith of a Jewish Woman (London: George Allen and Unwin); \n  Rev. Lawrence Rigal, (1978) A Brief History Of The West Central Liberal Synagogue (London: West \nCentral Synagogue). \n[17] J. Ramsay MacDonald (1913) Margaret Ethel MacDonald: A memoir p. 108 (London: Hodder and \nStoughton). \n[18] Eric Conrad (1953) Lily H. Montagu: Prophet of a Living Judaism (New York: National Federation of \nTemple Sisterhoods).  \n[19] Montagu, The faith of a Jewish woman, p. 42. \n[20] Ibid. p.13. \n[21] Jean Spence (2003) The Girls’ Own Paper and social welfare (1880-1908) in Ruth Gilchrist, Tony \nJeffs and Jean Spence (Eds.) Architects of Change: Studies in the history of youth and community \nwork, pp. 21-42 (Leicester: National Youth Agency). \n[22] Lily H. Montagu (1904) The Girl In The Background, in E. J. Urwick, (Ed.) Studies of Boy Life in \nOur Cities pp. 233-254 (London: J.M. Dent).  \n[23] Montagu, My club and I,  p. 19. \n[24] Pethick Lawrence, My part in a changing world  pp. 131-132. \n[25] Montagu, The faith of a Jewish woman,,  p. 13. \n[26] Montagu, My club and I,   p. 22. \n[27] Macdonald, Margaret Ethel MacDonald,  pp. 73-4 \n[28] William J. Fishman (1988) East End 1888,  p. 284 (London: Duckworth).  \n[29] Judith R. Walkowitz, (1992) City of Dreadful Delight: narratives of sexual danger in late Victorian \nLondon,  (London: Virago).  \n 22\n[30] Fishman, East End 1888, p.  211. \n[31] Macdonald, Margaret Ethel Macdonald  p. 19. \n[32] Walkowitz, City of dreadful delight  p. 28. \n[33] Lloyd P. Gartner, (1960) The Jewish Immigrant in England 1870-1914 p. 24 (London: George Allen \nand Unwin).  \n[34] Anna Davin (1996) Growing Up Poor: Home, school and street in London, 1870-1914, pp. 199-202 \n(London: Rivers Oram Press).  \n[35] Susan L. Tananbaum (1997) Philanthropy and Identity: Gender and ethnicity in London,  Journal of  \nSocial History Summer,  30: 4, pp.  937-961. \n[36] Lily H. Montagu (1913) Samuel Montagu, First Baron Swaythling: A character sketch, p. 1 (London: \nTruslove and Hanson). \n[37] Ibid p. 45. \n[38] Lily H. Montagu (1901) Naomi’s Exodus (London: Fisher Unwin);  \n Lily H. Montagu (1902) Broken Stalks ( London: Brimley Johnson); \n Lily H. Montagu (1926) What Can a Mother Do? And other stories, (London: George Routledge). \n[39] Levy, The West Central Story p. 1 \n[40] Montagu, The faith of a Jewish woman p. 14-15.  \n[41] Montagu, My club and I, p. 14 \n[42] Levy, The West Central Story, p. 2. \n[43] Montagu, ‘The girl in the background’ pp. 249-250.  \n[44] Montagu, My club and I  p. 60. \n[45] WIN, Vol. 1, No. 1 Oct. 1895, p. 1. \n[46] Montagu, ‘The relations of girls’ club leaders to the Factory Acts’, p. 15. \n[47] Montagu, My club and I  pp. 64-65. \n \n \n \n \n 23\n 24\n \n  \n \n   \n \n \n \n"}