{"doi":"10.1023\/A:1025742423308","coreId":"66221","oai":"oai:dro.dur.ac.uk.OAI2:2451","identifiers":["oai:dro.dur.ac.uk.OAI2:2451","10.1023\/A:1025742423308"],"title":"Does stricter employment protection legislation promote self-employment?","authors":["Robson,  M. T."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-11-01","abstract":"Using recently developed indicators of the strictness of employment protection legislation in OECD countries, the paper examines the issue of whether strict employment protection legislation may promote self-employment by encouraging employers to contract-out work to self-employed workers. Contrary to the results of previous studies, the paper finds little evidence for a positive relationship between self-employment and the strictness of EPL. While the raw data suggest that a positive relationship may indeed exist, once suitable control variables are introduced into the analysis, it appears that if anything, the opposite may be true: i.e. stricter employment protection legislation may actually reduce self-employment","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66221.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/2451\/1\/2451.pdf","pdfHashValue":"d0376338716ddd5083832582c3ea81ab4cad3d41","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:2451<\/identifier><datestamp>\n      2014-07-30T14:26:36Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Does stricter employment protection legislation promote self-employment?<\/dc:title><dc:creator>\n        Robson,  M. T.<\/dc:creator><dc:description>\n        Using recently developed indicators of the strictness of employment protection legislation in OECD countries, the paper examines the issue of whether strict employment protection legislation may promote self-employment by encouraging employers to contract-out work to self-employed workers. Contrary to the results of previous studies, the paper finds little evidence for a positive relationship between self-employment and the strictness of EPL. While the raw data suggest that a positive relationship may indeed exist, once suitable control variables are introduced into the analysis, it appears that if anything, the opposite may be true: i.e. stricter employment protection legislation may actually reduce self-employment.<\/dc:description><dc:publisher>\n        Springer<\/dc:publisher><dc:source>\n        Small business economics, 2003, Vol.21(3), pp.309-319 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2003-11-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:2451<\/dc:identifier><dc:identifier>\n        issn:0921-898X<\/dc:identifier><dc:identifier>\n        issn: 1573-0913<\/dc:identifier><dc:identifier>\n        doi:10.1023\/A:1025742423308<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/2451\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1023\/A:1025742423308<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/2451\/1\/2451.pdf<\/dc:identifier><dc:rights>\n        The original publication is available at www.springerlink.com<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0921-898x","issn:0921-898X","issn: 1573-0913"," 1573-0913"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2003,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n26 August 2008\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nRobson, M. T. (2003) ’Does stricter employment protection legislation promote self-employment ?’, Small\nbusiness economics., 21 (3). pp. 309-319.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1023\/A:1025742423308\nPublisher’s copyright statement:\nThe original publication is available at www.springerlink.com\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online \n Deposited in DRO:\n26 August 2008\nVersion of attached file:\nAccepted\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nRobson, M. T. (2003) 'Does stricter employment protection legislation promote self-employment\n?', Small business economics., 21 (3), pp.\u0000309-319.\nFurther information on publisher\u0000s website:\nhttp:\/\/dx.doi.org\/10.1023\/A:1025742423308\nPublisher\u0000s copyright statement:\nThe original publication is available at www.springerlink.com\n1Does Stricter Employment Protection Legislation\nPromote Self-employment?\nMartin T. Robson*\nDepartment of Economics and Finance\nUniversity of Durham\n23-26 Old Elvet\nDurham\nDH1 3HY\nEmail: M.T.Robson@durham.ac.uk\nThis version completed in January 2002; published in Small Business Economics, vol. 21,\n2003, pp. 309-19\nAbstract\nUsing recently developed indicators of the strictness of employment protection legislation in\nOECD countries, the paper examines the issue of whether strict employment protection\nlegislation may promote self-employment by encouraging employers to contract-out work to\nself-employed workers. Contrary to the results of previous studies, the paper finds little\nevidence for a positive relationship between self-employment and the strictness of EPL.\nWhile the raw data suggest that a positive relationship may indeed exist, once suitable control\nvariables are introduced into the analysis, it appears that if anything, the opposite may be true:\ni.e. stricter employment protection legislation may actually reduce self-employment.\nJEL Codes: J21, J23\n                                         \n* The analysis reported in this paper grew out of work originally carried out for the OECD. I\nam grateful to John Evans and Paula Adam of the OECD, for their help in providing some of\nthe data used in the analysis and to John Evans, Simon Parker and an anonymous referee for\ntheir helpful comments on previous versions of the paper. Responsibility for the analysis and\ninterpretation of the data, and for the views expressed in the paper, is mine alone.\n21. Introduction\nIn recent years, there has been a great deal of interest from academics and policy\nmakers in the effects of employment protection legislation (EPL) on labour market\nperformance. Empirical research into the effects of EPL has focussed chiefly on its role in\naccounting for cross-national variations in the rate and structure of unemployment (see for\nexample, Bertola, 1990, Gregg and Manning, 1997, and Nickell, 1997).1 More recent work\nhas examined the effects of EPL on patterns of worker and job flows (Schettkat, 1997; and\nBoeri, 1999). A final strand of research has attempted to analyse the impact of EPL on the\nstructure of employment. Within this vein, a recent study by the OECD (OECD, 1999) reports\nevidence of a positive and statistically significant relationship between summary measures of\nthe strictness of employment protection legislation and the share of self-employment in\nOECD member states.2 The explanation for this result, which echoes findings from previous\nstudies by OECD (1992) and Grubb and Wells (1993), is that employers may attempt to\ncircumvent the effects of regulations on their ability to hire and fire employees by\ncontracting-out work to self-employed contractors. This finding, if correct, suggests that\nemployers may be able to use self-employment as a means of undermining the intended\neffects of employment protection legislation.  It would also lend support to the view that a\nsignificant proportion of reported self-employment may be ‘false’, in the sense that the\nworkers concerned are essentially employees, but are employed on self-employment contracts\nin order to economise on employers’ non-wage labour costs.3 The rate of self-employment has\n                                         \n1 For a recent theoretical analysis of the effects of employment protection regulations see\nPissarides (2001).\n2 The study by the OECD contains a detailed summary of previous work on the effects of EPL\non labour market performance.\n3 Pfieffer (1999) documents the prevalence of this phenomenon in Germany. A number of\nOECD countries have recently introduced measures designed to control the incidence of such\n‘false’ self-employment. See OECD (2000) for a detailed summary.\n3recently been increasing in a number of OECD countries (OECD, 2000). At the same time,\nthere has been a resurgence of interest within government policy-making circles in issues\nrelating to entrepreneurship.4 In the light of this, it is important to ask whether the increases in\nself-employment that have been observed may simply reflect the response of employers to an\nincreasing burden of labour market regulation – and hence are merely indicative of an\nincrease in the incidence of ‘false’ self-employment - or whether they reflect a genuine\nresurgence of entrepreneurial activity in the countries concerned. The present paper attempts\nto shed some light on this issue by re-examining the evidence on the relationship between the\nincidence of self-employment in OECD countries and the strictness of EPL.\nThe analysis reported in the paper is conducted in two strands. In the first, we examine\nthe relationship between EPL and the rate of non-agricultural self-employment in the OECD\nusing panel data on an index of the overall strictness of employment protection legislation\nrecently compiled by Blanchard and Wolfers (2000). The data used in this analysis covers 13\nOECD countries for seven five-year periods from the mid-1960s to the mid-1990s. In the\nsecond strand, we use data compiled by the OECD that provides a breakdown of the incidence\nof EPL into measures of its constituent components - namely, regulations relating to the\nprotection of regular employment; to the protection of temporary employment; and\nregulations governing collective dismissals. This analysis follows the findings of OECD\n(1999), which indicate that the incidence of self-employment is positively related to the\nstrictness of regulations relating to the protection of regular employment, rather than to\nregulations relating to temporary employment or collective dismissals. The figures compiled\nby the OECD cover a slightly broader range of countries than is used in the first part of the\nanalysis, but only two time periods: the late 1980s and the mid-1990s.\n                                                                                                                          \n4 See, for example, OECD (1998) and Commission of the European Communities (1999).\n4In brief, the results from the two strands of the analysis suggest that the findings of\nprevious studies concerning the relationship between the strictness of employment protection\nlegislation and the rate of self-employment are non-robust. While the raw data do indeed\nsuggest the existence of a positive relationship between EPL and the rate of self-employment,\nthis evidence disappears once controls are introduced for other potential influences on the rate\nof self-employment; in particular, once allowance is made for the presence of country-specific\nfixed effects. On the basis of the present analysis, we therefore conclude that there is only\nvery limited evidence to support the hypothesis that stricter employment protection legislation\npromotes self-employment.\nThe plan of the paper is as follows. Section 2 discusses the summary measure of the\nstrictness of EPL that is compiled by Blanchard and Wolfers (2000) and examines the\nrelationship between this measure and the rate of non-agricultural self-employment in 13\nOECD countries. Section 3 performs a similar analysis using the figures compiled by OECD\n(1999) on the constituent components of EPL. Finally, Section 4 concludes the paper.\n2. Measures of the Strictness of Employment Protection Legislation\nA number of studies have been carried out that have attempted to construct\ncomparative measures of the strictness of employment protection legislation across different\ncountries (Emerson, 1988; Bertola, 1990; Lazear, 1990; Grubb and Wells 1993, OECD 1999).\nThe study by Blanchard and Wolfers (2000) builds on the work carried out by OECD (1999)\nand Lazear (1990) to construct a summary indicator of the strictness of employment\nprotection legislation that covers a number of OECD countries over the period from 1960\nthrough to the mid-1990s. The indicator is scaled to lie between a minimum value of 0\n                                                                                                                          \n5(corresponding to very weak employment protection) and a maximum of 6 (corresponding to\nvery strict protection).5\nTable I shows values of the indicator of the strictness of employment protection for\nthree selected periods for the 13 OECD countries for which we have corresponding time-\nseries data on the rate of non-agricultural self-employment.  In summary, the data indicate\nthat the overall strictness of EPL tends to be highest in Spain and Italy, and weakest in the\nUSA, Canada and the United Kingdom, with Australia and Ireland not far behind. In a\nnumber of countries, but most notably in Sweden, there is evidence of a relaxation of the\nstrictness of EPL during the 1990s. The main exception to this trend is France, for which there\nis an increase in the indicator of the overall strictness of EPL between the late 1980s and the\nmid-1990s, due to the imposition of tighter restrictions on the maximum cumulative duration\nof fixed term contracts and tighter limits on the scope of the activities of Temporary Work\nAgencies (TWAs).6\n  Table II shows corresponding data from OECD (1999) that provides information on\nthe constituent components of employment protection legislation. The Table shows indicators\nof measures relating to the protection of regular workers from the threat of dismissal, the\nregulation of collective dismissals, and the regulation of temporary employment contracts.\nThe indicators are scaled to lie between 0 and 6 in the same way as the Blanchard and\n                                         \n5 See the Appendix to Blanchard and Wolfers (2000) for details of the construction of the\nindicator of the strictness of EPL. The Appendix is available at\nhttp:\/\/web.mit.edu\/blanchar\/www\/articles.html\n6 See OECD (1999)\n6Wolfers indicator of the overall strictness of EPL (which itself is based on the OECD\nmeasure).7\nThe picture that emerges from these figures is similar to that in Table I, though it\ncovers a slightly broader range of countries, but only two time periods: the late 1980s and the\nmid-1990s. The figures show that Belgium and Germany joined Sweden in implementing a\nnoticeably more lenient employment protection regime during the 1990s. In each case, this\nmanifested itself principally in the form of a relaxation of regulations relating to the hiring of\ntemporary workers, including regulations governing the use of fixed term contracts and the\nactivities of TWAs. A detailed analysis of the figures, including comparisons with indicators\nof the strictness of EPL compiled by other studies, is presented in OECD (1999).\n                                         \n7 Note that information on the strictness of regulations governing collective dismissals is only\navailable for the mid-1990s. To maintain consistency with the figures for the late 1980s,\ntherefore, the figures for the overall indicator of the strictness of EPL exclude information on\nthe severity of regulations relating to collective dismissals.\n73. Analysis of the Relationship Between Self-employment and the Strictness of\nEPL\nThe present study is motivated by the results of previous analyses by OECD (1992),\nGrubb and Wells (1993) and in particular, OECD (1999), which report evidence of a positive\nrelationship between the strictness of employment protection legislation and the incidence of\nself-employment in OECD countries.  The explanation put forward for this finding is that\nemployers may use self-employed contractors as a means of circumventing the restrictions\nthat EPL imposes on their ability to hire and fire employees. If correct, this finding implies\nthat employers may be able to significantly undermine the intended effects of job security\nlegislation by substituting self-employed contractors for waged workers, or by placing\nmembers of the workforce on self-employment contracts. The latter, in turn, may imply that a\nsignificant proportion of observed self-employment may be ‘false’, in the sense that the\nmantle of self-employment is used to cloak what is essentially an employment contract. The\nimplications for the conduct of employment policy and, in particular, for the efficacy of\npolicies designed to promote or facilitate self-employment, suggest that this is a topic worthy\nof further investigation.\n The analysis of the present paper is conducted in two strands. In the first, we use panel\ndata on thirteen OECD countries for the period from the mid-1960s to the mid-1990s.8\nBlanchard and Wolfers calculate their index of the strictness of EPL for a sequence of five-\nyear intervals.9 In Figure I, we plot the values of this index against the corresponding five-\n                                         \n8 The countries are those listed in Table I. Note that we have three missing observations - data\non the rate of non-agricultural self-employment in Finland is only available from 1970-4,\nwhile for the Netherlands it is only available from 1975-9. Hence, the maximum number of\nobservations for this analysis is 88.\n9 The final observation covers just three years, 1995-7.\n8year average values of the rate of non-agricultural self-employment in our thirteen countries.10\nThe picture is consistent with the notion of a positive relationship between the strictness of\nEPL and the incidence of self-employment, and this is supported by the results of a simple\nOLS regression, reported in the first column of Table III. However, the evidence of a positive\nrelationship between EPL and the rate of self-employment quickly disappears when we allow\nfor the presence of country-specific fixed effects, as shown in the second column of the Table.\nSimilar results emerge f om a random effects specification, and from models with the log of\nthe self-employment rate as the dependent variable.11\nDoes the introduction of other potential explanatory variables for the rate of self-\nemployment alter the findings? To investigate this, we introduce into the analysis a set of\nexplanatory variables that have been found in other studies to have a significant effect on\ncross-national variations in the rate of self-employment. These are: the level of GDP per\ncapita; the rate of female labour force participation; the average rate of income tax; payroll\ntaxes; and the unemployment benefit replacement ratio. The first of these variables has been\nfound by Acs, Audretsch and Evans (1994) to have a significant negative effect on the rate of\nnon-agricultural self-employment in the OECD. The explanation for this, following the\nanalysis of Lucas (1978), is that a rise in the level of GDP per capita is associated with a\ndecline in the returns to self-employment relative to those from waged employment. Acs et al.\nalso find that the rate of self-employment is positively related to the rate of unemployment\n                                         \n10 We exclude the agricultural sector, as self-employment in this sector is likely to be heavily\ninfluenced by historically and culturally determined traditions of family-based ownership.\n11 Hausman test results indicate that the fixed effects specification is superior to the random\neffects one. These results are available from the author, on request.\n9and the rate of female labour force participation, though the former appears significant only in\na bivariate context.12\nA number of studies find evidence of a link between income tax rates and the rate of\nself-employment (e.g. Blau, 1987; Robson, 1998; Parker and Robson, 2000; Bruce, 2000;\nSchuetze, 2000). Robson and Wren (1999) show that it is important to distinguish between the\neffects of changes in the marginal rate of income tax and changes in the average rate of tax.\nUsing data for 15 OECD countries, they find that the former have a negative effect on the rate\nof self-employment while the latter have a positive effect. Unfortunately, for this study we do\nnot have data for the marginal rate of income tax and so only the average rate of income tax is\nincluded.\nWe measure the rate of payroll tax using the average rate of employers’ social security\ncontributions. This is included as a control variable in the regressions on the grounds that in\nthe absence of perfect tax shifting, a high rate of employers’ social security contributions may\nmotivate employers to use self-employed contractors as a means of reducing the cost of\nlabour. In support of this hypothesis, OECD (1992) reports a correlation of 0.7 between the\nrate of employers’ social security contributions and the rate of self-employment in a cross-\nsection of OECD countries.\nFinally, the benefit replacement ratio is included on the grounds that a high ratio of\nbenefits to earnings may discourage the unemployed from setting up in business. Moreover,\nas self-employed workers often do not enjoy the same entitlement to benefits as those in\nwaged employment, a high replacement ratio may also deter some workers from leaving paid-\n                                         \n12 A positive relationship between self-employment and the rate of unemployment is also\nreported in the cross-country study carried out by Staber and Bogenhold (1993). However,\nBlanchflower (2000) reports a negative relationship between self-employment and\nunemployment for most of the countries in his data sample.\n10\nemployment for self-employment for fear of losing their access to benefits. Both Staber and\nBogenhold (1993) and Parker and Robson (2000) report evidence of a negative relationship\nbetween the replacement ratio and the rate of self-employment in the OECD.\nIn keeping with the previous analysis, the additional explanatory variables are entered\nin the form of five-year averages. The results are reported in the third column of Table III.\nThey show significant positive effects on the rate of non-agricultural self-employment from\nthe rate of unemployment and the payroll tax rate and a significant negative effect from the\naverage rate of income tax. None of the other additional explanatory variables is statistically\nsignificant. Most importantly for the current analysis, the results show that the addition of\nthese extra variables fails to restore the initial finding of a positive relationship between the\nstrictness of EPL and the rate of non-agricultural self-employment.13 Instead, they suggest\nthat an increase in the strictness of employment protection legislation may, if anything, lead to\na reduction in the rate of self-employment, other things equal. An explanation for this may be\nthat workers are deterred from entering self-employment through fear that strict regulations\non hiring and firing may prevent them from making a speedy return to waged-employment in\nthe event of business failure. Alternatively, it may be that tighter job security regulations\ndiscourage entry into self-employment by those who themselves expect to become employers.\nFinally, it may be that the co-existence of a high level of employment protection legislation\nand a low rate of self-employment in certain countries is symptomatic of a general aversion to\nemployment instability amongst members of the country’s workforce. Individuals who are\nrisk averse may be unwilling to enter self-employment and more inclined to support the\nintroduction of government measures to restrict the flexibility of employment contracts.\n                                                                                                                          \n13 Missing observations on some of the additional explanatory variables mean that the sample\nsize in this regression is reduced to 68. In particular, we have no observations for Ireland or\nNorway, as the payroll tax data is unavailable for these countries.\n11\nThe Relationship Between Self-employment and the Individual Components of EPL\nIn this second strand of the analysis, we use the data from OECD (1999) - as reported\nin Table II – on the constituent components of EPL. Specifically, we examine the effects on\nself-employment of regulations relating to regular employment contracts and regulations\ngoverning the use of temporary employment. Compared with the previous analysis using the\nBlanchard and Wolfers summary measure of the overall strictness of EPL, we have data on a\nslightly larger range of countries – including Austria, Belgium, Denmark, Germany, Greece,\nand Portugal, but excluding Japan – but only two time periods: the late 1980s and the mid-\n1990s.\nAs a first step, we again perform a simple fixed effects regression of the relationship\nbetween the overall indicator of the strictness of EPL and the rate of non-agricultural self-\nemployment using the new data set.14 The results are reported in the first column of Table IV\nand indicate strongly the presence of a negative, rather than a positive, relationship between\nthe strictness of EPL and the rate of self-employment. The results reported in the second\ncolumn of Table IV indicate that, in particular, it is the presence of strict regulations on the\nuse of temporary employment contracts that is associated with a reduction in the rate of self-\nemployment.\nIn the third and fourth columns of the Table, we investigate the effects of introducing\nadditional explanatory variables into the analysis. The third column introduces the full set of\nexplanatory variables used in the earlier analysis of the Blanchard and Wolfers measure of\nEPL. The results are quite poor in the sense that none of the additional explanatory variables\n                                                                                                                          \n14 A qualitatively similar result is obtained with a random effects specification. However, the\nresult of a Hausman test indicates that the random effects specification is decisively rejected\nin favour of fixed effects.\n12\nattains statistical significance. Further analysis indicates that this may be due to the presence\nof multicollinearity amongst the explanatory variables.15 As a result of this, in the final\ncolumn, we report the results of a fixed effects regression in which the log of real GDP per\ncapita is included as the sole additional explanatory variable.   The picture remains the same:\nwe find no evidence of a positive relationship between the strictness of EPL in a country and\nthe rate of self-employment. If anything, the opposite seems to be true: i.e. stricter\nemployment protection legislation reduces the incidence of self-employment.\nComparison with the Results of Previous Studies\n How can we reconcile these results with those of previous studies, which as we have\nseen, have found evidence of a positive relationship between the strictness of EPL and the\nincidence of self-employment in OECD countries? In particular, how can we reconcile the\nresults with those from OECD (1999), which used a data sample very similar to that used in\nthe second part of our analysis? The answer seems to lie with the definition of the dependent\nvariable that is used. The analysis reported in OECD (1999) is based on a definition of the\ndependent variable that includes the agricultural sector. The specific variable used is the share\nof self-employment in total employment. Table V shows the results when we repeat the\nsecond part of our analysis above, using this definition of the dependent variable instead of\nthe rate of non-agricultural self-employment. The evidence for a positive relationship between\nthe strictness of EPL and self-employment is restored, though it is specifically the strictness\nof regulations governing regular employment contracts that seems to matter.\n                                                                                                                          \n15 Regressing the explanatory variables on one another, leads to R2 va ues m stly in the range\n0.5 – 0.7. The highest value, 0.72, is obtained when EPL is regressed on the additional\nexplanatory variables. The coefficients in this regression equation suggest that the strictness\nof employment protection legislation is most closely related to the rate of payroll tax and the\nlog of per capita GDP.\n13\nWe suggested earlier that there are likely to be particular factors that influence the\nincidence of self-employment in the agricultural sector. In particular, there seems little reason\nto suppose that the high rates of self-employment that are traditionally observed in this sector\ncan be substantially explained by the effects of employment protection legislation. We would\ntherefore suggest that it is the regression results reported in Tables III and IV that are most\nlikely to reflect the true relationship between the strictness of EPL and the rate of self-\nemployment in OECD economies. At the very least, the results of this study suggest that the\nevidence for a positive relationship between the strictness of EPL and the incidence of self-\nemployment rests on rather flimsy empirical foundations.16\n                                         \n16 One possible explanation for our inability to find robust evidence of a positive relationship\nbetween the strictness of EPL and the incidence of self-employment may be the existence of\nmeasurement error in the dependent variable. The OECD data on self-employment that are\nused in this study are drawn from the results of national labour force surveys. In these surveys\nthe classification of a worker as self-employed or an employee is based on the respondent’s\nown perception of their employment status. As is noted in the text, firms may respond to an\nincrease in the strictness of EPL by moving some of their workers from employment contracts\nto self-employed contractor status. However, the worker – particularly if he or she continues\nto provide labour services solely to their previous employer – may be unaware of the change\nin their status. Note, however, that the existence of this kind of ‘false’ self-employment\ncannot explain the discrepancy between the results of this study and those of previous\nanalyses as these too use OECD data in the construction of the dependent variable.\n14\n4. Conclusions\nAnalysis reported in OECD (1999) and other studies finds evidence of a positive\nrelationship between the strictness of employment protection legislation and the incidence of\nself-employment in OECD member states. In particular, in OECD (1999) it is found that\nincreases in the strictness of regulations relating to regular employment contracts appear to\nlead to an increase in the share of self-employment in total employment. These findings\nsuggest that employers may use self-employed labour as a means of circumventing the\nrestrictions imposed on their ability to hire and fire employees.\nIn this study, we have undertaken a further investigation of the relationship between\nthe strictness of employment protection legislation and the incidence of self-employment in\nthe OECD. Using a panel data set for 13 OECD countries covering the period from the mid-\n1960s to the mid-1990s, we have found that the evidence for a positive relationship between\nEPL and self-employment disappears when allowance is made for the presence of country-\nspecific fixed effects.17 Subsequently, we have shown that the findings concerning the\nrelationship between the individual components of EPL and the incidence of self-employment\nare sensitive to whether or not the agricultural sector is included in the definition of the\ndependent variable.\nOn the basis of this analysis, we conclude that the findings of a positive relationship\nbetween EPL and self-employment reported in previous studies are non-robust. Contrary to\nthe suggestion of these studies, there appears to be only very limited evidence to support the\nnotion that stricter employment protection legislation promotes self-employment. As in\n                                         \n17 These fixed effects may capture differences between countries in the measurement of self-\nemployment, in particular the treatment of owner-managers of incorporated businesses (see\nthe Appendix to OECD, 1992, for a detailed discussion of measurement issues).\nAlternatively, they may reflect differences between countries in the latent capacity for\nentrepreneurship (Blanchflower, Oswald and Stutzer, 2001).\n15\nprevious studies of this issue, the relatively small sample sizes of the available data temper the\nconclusions that may be drawn from the analysis and should be borne in mind when\ninterpreting the results. Nonetheless, it seems unlikely on the basis of the findings we have\nreported that attempts by employers to circumvent the restrictions that EPL imposes on their\nability to hire and fire labour can account for the increases in self-employment that have\nrecently been experienced in a number of OECD countries.\n16\nTable I. The Blanchard and Wolfers Index of the Strictness of Employment Protection\nLegislation (Selected Values)\nCountry 1965-9 1985-9 1995-7\nAustralia 1 1 1\nCanada 0.6 0.6 0.6\nFinland 2.4 2.4 2.1\nFrance 1.02 2.6 3.1\nIreland 0.25 1 1.1\nItaly 4 4 3.4\nJapan 2.8 2.8 2.8\nNetherlands 2.7 2.7 2.4\nNorway 3.1 3.1 2.7\nSpain 4 3.8 3.1\nSweden 0 3.6 2.4\nUnited Kingdom0.33 0.7 0.7\nUSA 0.2 0.2 0.2\nSource: Appendix to Blanchard and Wolfers (2000), available at http:\/\/web.mit.edu\/blanchar\/www\/articles.html\n17\nTable II. OECD Summary Indicators of the Strictness of Employment Protection\nLegislation\nOverall EPL Strictness Regular Employment Temporary EmploymentCollectiveDismissalsa\nLate 1980s Mid 1990sb Late 1980s Mid 1990sb Late 1980s Mid 1990sb Mid 1990sb\nAustralia 0.9 0.9 1.0 1.0 0.9 0.9 2.6\nAustria 2.2 2.2 2.6 2.6 1.8 1.8 3.3\nBelgium 3.1 2.1 1.5 1.5 4.6 2.8 4.1\nCanada 0.6 0.6 0.9 0.9 0.3 0.3 3.4\nDenmark 2.1 1.2 1.6 1.6 2.6 0.9 3.1\nFinland 2.3 2.0 2.7 2.1 1.9 1.9 2.4\nFrance 2.7 3.0 2.3 2.3 3.1 3.6 2.1\nGermany 3.2 2.5 2.7 2.8 3.8 2.3 3.1\nGreece 3.6 3.6 2.5 2.4 4.8 4.8 3.3\nIreland 0.9 0.9 1.6 1.6 0.3 0.3 2.1\nItaly 4.1 3.3 2.8 2.8 5.4 3.8 4.1\nNetherlands 2.7 2.1 3.1 3.1 2.4 1.2 2.8\nNorway 3.0 2.6 2.4 2.4 3.5 2.8 2.8\nPortugal 4.1 3.7 4.8 4.3 3.4 3.0 3.6\nSpain 3.7 3.8 3.9 2.6 3.5 3.5 3.1\nSweden 3.5 2.2 2.8 2.8 4.1 1.6 4.5\nUK 0.5 0.5 0.8 0.8 0.3 0.3 2.9\nUSA 0.2 0.2 0.2 0.2 0.3 0.3 2.9\n Source: OECD (1999), Table 2.5.\nNotes:\na  Information on the strictness of regulations governing collective dismissals is only available for the mid 1990s.\nFor consistency, this information is therefore omitted from the calculations for the figures for the overall\nstrictness of EPL for this period. An alternative summary indicator of the strictness of EPL in the late 1990s, that\nincludes information on the strictness of regulations relating to collective dismissals, is reported in OECD\n(1999).\nb OECD (1999) refers to this period as the ‘Late 1990s’, but as the data relate to the years 1995-7, the term ‘Mid\n1990s’ seems more appropriate.\n18\nTable III. The Relationship Between Self-employment and the Strictness of Employment\nProtection Legislation (Blanchard and Wolfers Index)\nThe dependent variable is the rate of non-agricultural self-employment\nOLS Fixed Effects Fixed Effects\nBlanchard & Wolfers EPL Index 1.622 - 0.471 - 0.744\n(5.28) (1.21) (1.61)\nln [GDP per capita] - 1.729\n(1.08)\nUnemployment rate 0.214\n(2.27)\nFemale participation rate 0.027\n(0.89)\nIncome tax rate - 0.228\n(3.30)\nPayroll tax rate 0.195\n(2.46)\nBenefit replacement ratio 0.023\n(0.43)\nR2 0.24 0.88 0.95\nF-test of significance of fixed effects 32.9 [p = 0.00] 8.5  [p = 0.00]\nNo. of observations. 88 88 68\nNotes:\n1. t-ratios in parentheses.\n2. Intercept terms included but not reported.\nSee text and Data Appendix for variable definitions and data sources.\n19\nTable IV. The Relationship Between Self-employment and the OECD Indicators of the\nStrictness of Employment Protection Legislation\nThe dependent variable is the rate of non-agricultural self-employment\n(1) (2) (3) (4)\nOverall EPL - 1.125\n(3.07)\nRegular Employment EPL - 0.694 - 0.736 - 0.322\n(1.05) (0.73) (0.46)\nTemporary Employment EPL - 0.496 - 0.398 - 0.368\n(2.18) (1.16) (1.52)\nln [GDP per capita] - 0.242 2.430\n(0.04) (1.34)\nUnemployment rate - 0.036\n(0.32)\nFemale participation rate 0.053\n(0.39)\nIncome tax rate - 0.124\n(0.92)\nPayroll tax rate 0.024\n(0.27)\nBenefit replacement ratio - 0.022\n(0.61)\nR2 0.36 0.29 0.48 0.37\nF-test of significance of fixed effects106.7 [p = 0.00]81.0 [p = 0.00] 19.7 [p = 0.00] 29.3 [p = 0.00]\nFixed effects estimation; t-ratios in parentheses.\nNumber of observations = 36\nIntercept terms not reported.\n20\nTable V. Regressions on OECD Indicators of the Strictness of EPL with the Share of\nSelf-employment in Total Employment as the Dependent Variable\n(1) (2) (3) (4)\nOverall EPL 0.961\n(1.14)\nRegular Employment EPL 3.966 2.547 2.798\n(3.64) (1.79) (2.96)\nTemporary Employment EPL 0.021 - 0.569 - 0.380\n(0.06) (1.19) (1.16)\nln [GDP per capita] - 8.360 - 7.644\n(1.09) (3.11)\nUnemployment rate - 0.027\n(0.17)\nFemale participation rate 0.014\n(0.07)\nIncome tax rate - 0.005\n(0.02)\nPayroll tax rate - 0.003\n(0.03)\nBenefit replacement ratio - 0.042\n(0.83)\nR2 0.07 0.47 0.72 0.69\nF-test of significance of fixed effects82.3 [p = 0.00]126.1 [p = 0.00]38.7 [p = 0.00] 68.2 [p = 0.00]\nFixed effects estimation; t-ratios in parentheses.\nNumber of observations = 36\nIntercept terms not reported.\n21\nFigure I. The Relationship Between the Rate of Non-agricultural Self-employment and\nthe Blanchard and Wolfers Index of EPL\nSources: see text and Data Appendix\n0\n5\n10\n15\n20\n25\n0 0.5 1 1.5 2 2.5 3 3.5 4 4.5\nEmployment Protection\nS\ne\nlf\n-E\nm\np\nlo\ny\nm\ne\nn\nt \nR\na\nte\n (\n%\n)\n22\nData Appendix\nFirst Data Set\nAs indicated in the text, in the part of the analysis we use average data on 13 countries for\nseven time periods: 1965-69, 1970-4, 1975-9, 1980-4, 1985-9, 1990-4, and 1995-7. The\ncountries included in the sample are: Australia, Canada, Finland, France, Ireland, Italy, Japan,\nNorway, Spain, Sweden, United Kingdom, and USA.\nBlanchard and Wolfers EPL Index\nSee the Appendix to Blanchard and Wolfers (2000) for details of the construction of the\nindex. The Appendix and data are available from Olivier Blanchard’s home page,\nhttp:\/\/web.mit.edu\/blanchar\/www\/articles.html\nRate of Non-agricultural Self-employment\nNon-agricultural self-employment as a percentage of total civilian non-agricultural\nemployment (employees plus self-employed) plus unemployment. Source OECD Labour\nForce Statistics.\nReal GDP per Capita\nGDP per capita in US dollars at 1990 prices and exchange rates. Source: OECD National\nAccounts.\nUnemployment Rate\nUnemployed as a percentage of the labour force. Source: OECD Labour Force Statistics.\nFemale Labour Force Participation Rate\nTotal female labour force as a percentage of the female population aged 15-64. Source:\nOECD Labour Force Statistics.\nAverage Rate of Income Tax\nIncome tax payments plus employees’ social security contributions as a percentage of wages\nand salaries plus the operating surplus of unincorporated enterprises plus property income.\nSources: tables of the income and outlay accounts of households and unincorporated\nenterprises in OECD National Accounts Statistics and UN National Accounts Statistics.\n23\nPayroll Tax Rate\nEmployers’ contributions to social security as a percentage of wages and salaries. Sources:\nincome and outlay accounts of households and unincorporated enterprises in OECD National\nAccounts Statistics and UN National Accounts Statistics.\nReplacement Ratio\nOverall average of gross replacement ratios for three types of families (single person, married\nperson with dependent spouse, married person with spouse in work) and two earnings levels\n(average earnings and 66.7 per cent average earnings. Source: OECD Database of Benefit\nEntitlements and Gross Replacement Rates. Data kindly supplied by John Evans of the\nOECD.\nSecond Data Set\nExcept where stated, the data are six-year averages for the years 1985-90 and 1992-7. The 18\ncountries included in the sample are: Austria, Belgium, France, Germany, Ireland,\nNetherlands, United Kingdom, Greece, Italy, Portugal, Spain, Denmark, Finland, Norway,\nSweden, Canada, USA, and Australia. For the most part, the variable definitions and data\nsources are the same as those for the first data set. The exceptions are listed below.\nOECD Summary Indicators of the Strictness of EPL\nSource: OECD (1999), which contains a detailed discussion of the construction of the\nindicators and the data sources from which they are compiled.\nAverage Rate of Income Tax\nAverage rate of income tax (%) for single person with no children, earning the average\nproduction worker’s wage. The data are averages of observations for 1985, 1987, 1989, and\n1994-6, respectively. Calculated from data provided by John Evans of the OECD.\nPayroll Tax Rate\nRatio of employers’ social security contributions to earnings of average production worker\n(%). The data are averages of observations for 1985, 1987, 1989, and 1994-6, respectively.\nCalculated from data provided by John Evans of the OECD.\nShare of Self-employment in Total Employment\nCalculated from data kindly supplied by Paula Adams of the OECD.\n24\nReferences\nAcs, Z., D. Audretsch, and D. Evans, (1994), ‘Why Does the Self-Employment Rate Vary\nAcross Countries and Over Time?’, C ntre for Economic Policy Research Discussion Paper\nno. 871.\nBertola, G., (1990), ‘Job Security, Employment and Wages’, European Economic Review, 34,\npp. 851-886.\nBlanchard, O. and J. Wolfers, (2000), ‘The Role of Shocks and Institutions in the Rise of\nEuropean Unemployment: the Aggregate Evidence’, Economic Journal, 110, pp. C1-33.\nBlanchflower, D.G., (2000), ‘Self-employment in OECD Countries’, Labour Economics, 7,\npp 471-505.\nBlanchflower, D.G., A.J. Oswald, and A. Stutzer, (2001), ‘Measuring Latent Entrepreneurship\nAcross Nations’, European Economic Review, 45, pp. 680-91.\nBlau, D., (1987), ‘A Time-Series Analysis of Self-Employment in the United States’, Journal\nof Political Economy, 95, pp. 445-67.\nBoeri, T., (1999), ‘Enforcement of Employment Security Regulations, On-the-job Search and\nUnemployment Duration’, European Economic Review, 43, pp. 65-89.\nBruce, D. (2000), ‘Effects of the United States Tax System on Transitions into Self-\nEmployment’, Labour Economics, 7, pp. 545-74.\nCommission of the European Communities, (1999), Report from the Commission to the\nCouncil, the European Parliament, the Economic and Social Committee and the Committee of\nRegions, On Concerted Action with the Member States in the Field of Enterprise Policy,\nBrussels, 09.11.1999 COM (1999) 569 final.\nEmerson, M., (1988), ‘Regulation or De-regulation of the Labour Market: Policy Regimes for\nthe Recruitment and Dismissal of Employees in Industrialised Countries’, Eur pean\nEconomic Review, 32, pp. 775-817.\nGregg, P. and A. Manning, (1997), ‘Labour Market Regulation and Unemployment’, in D.\nSnower and G. de la Dehesa (eds.), Unemployment Policy: Government Options for the\nLabour Market, Cambridge, Cambridge University Press.\nGrubb, D. and W. Wells, (1993), ‘Employment Regulation and Patterns of Work in EC\nCountries’, OECD Economic Studies, no. 21, Winter, pp. 7-58.\nLazear, E.P., (1990), ‘Job Security Provisions and Employment’, Quarterly Journal of\nEconomics, 105, pp. 699-726.\nLucas, R.E., (1978), ‘On the Size Distribution of Business Firms’, Bell Journal of Economics,\n9, pp. 508-523.\n25\nNickell, S., (1997), ‘Unemployment and Labor Market Rigidities: Europe Versus North\nAmerica’, Journal of Economic Perspectives, 11, pp. 55-74.\nOECD, (1992), Employment Outlook, Paris, OECD.\nOECD, (1998), Fostering Entrepreneurship, Paris, OECD.\nOECD, (1999), Employment Outlook, Paris, OECD.\nOECD, (2000), Employment Outlook, Paris, OECD.\nParker, S.C. and M.T. Robson (2000), ‘Explaining International Variations in Self-\nEmployment: Evidence from a Panel of OECD Countries’, Working Paper No. 2008,\nDepartment of Economics and Finance, University of Durham.\nPfieffer, F., (1999), ‘Business Start Ups and Employment’, Centre for European Economic\nResearch (ZEW).\nPissarides, C.A. (2001), ‘Employment Protection’, Labour Economics, 8, pp. 131-59.\nRobson, M.T., (1998), ‘The Rise in Self-Employment Among UK Males, Small Business\nEconomics, 10, pp. 199-212.\nRobson, M.T. and C.M. Wren, (1999), ‘Marginal and Average Tax Rates and the Incentive\nfor Self-Employment’, Southern Economic Journal, 65, pp. 757-73.\nSchettkat, R., (1997), ‘Employment Protection and Labour Mobility in Europe: an Empirical\nAnalysis Using the EU’s Labour Force Survey’, International Review of Applied Economics,\n11, pp. 105-118.\nSchuetze, H.J., (2000), ‘Taxes, Economic Conditions and Recent Trends in Male Self-\nEmployment: a Canada – US Comparison’, Lab ur Economics, 7, pp. 507-44.\nStaber, U. and D. Bogenhold, (1993), ‘Self-Employment; a Study of Seventeen OECD\nCountries’, Industrial Relations Journal, 24, pp. 126-37.\n"}