{"doi":"10.1117\/12.547414","coreId":"69629","oai":"oai:eprints.lancs.ac.uk:25505","identifiers":["oai:eprints.lancs.ac.uk:25505","10.1117\/12.547414"],"title":"Modeling and controlling of stochastic dynamics of complex nonlinear systems","authors":["Luchinsky, Dmitry G.","McClintock, Peter V. E.","Silchenko, Alexandr N.","Smelyanskiy, Vadim N.","Dykman, Mark"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004","abstract":"An application of the path-integral approach to an analysis of the fluctuations in complex dynamical systems is discussed. It is shown that essentially the same ideas underly recent progress in the solutions of a number of long-standing problems in complex dynamics. In particular, we consider the problems of prediction, control and inference of chaotic dynamics perturbed by noise in the framework of path-integral approach","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69629.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/25505\/1\/5471_19PostPrint.pdf","pdfHashValue":"be2669228fb8ee0f043085e0f025bb6a70a9cca8","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:25505<\/identifier><datestamp>\n      2018-01-24T05:24:11Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Modeling and controlling of stochastic dynamics of complex nonlinear systems<\/dc:title><dc:creator>\n        Luchinsky, Dmitry G.<\/dc:creator><dc:creator>\n        McClintock, Peter V. E.<\/dc:creator><dc:creator>\n        Silchenko, Alexandr N.<\/dc:creator><dc:creator>\n        Smelyanskiy, Vadim N.<\/dc:creator><dc:creator>\n        Dykman, Mark<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        An application of the path-integral approach to an analysis of the fluctuations in complex dynamical systems is discussed. It is shown that essentially the same ideas underly recent progress in the solutions of a number of long-standing problems in complex dynamics. In particular, we consider the problems of prediction, control and inference of chaotic dynamics perturbed by noise in the framework of path-integral approach.<\/dc:description><dc:date>\n        2004<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/25505\/1\/5471_19PostPrint.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1117\/12.547414<\/dc:relation><dc:identifier>\n        Luchinsky, Dmitry G. and McClintock, Peter V. E. and Silchenko, Alexandr N. and Smelyanskiy, Vadim N. and Dykman, Mark (2004) Modeling and controlling of stochastic dynamics of complex nonlinear systems. Proceedings of SPIE, 5471. pp. 145-158. ISSN 0277-786X<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/25505\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1117\/12.547414","http:\/\/eprints.lancs.ac.uk\/25505\/"],"year":2004,"topics":["QC Physics"],"subject":["Journal Article","NonPeerReviewed"],"fullText":"Modelling and controlling of stochastic dynamics of complex\nnonlinear systems\nDmitry G. Luchinskya, Peter V.E. McClintocka, Alexandr N. Silchenkoa, Vadim N.\nSmelyanskiyb, Mark I. Dykmanc.\na Department of Physics, Lancaster University, Lancaster LA1 4YB, UK;\nb NASA Ames Research Center, Mail Stop 269-2, Moffett Field, CA 94035, USA;\nc Department of Physics and Astronomy, Michigan State University, East Lansing, MI 48824.\nABSTRACT\nAn application of the path-integral approach to an analysis of the fluctuations in complex dynamical systems\nis discussed. It is shown that essentially the same ideas underly recent progress in the solutions of a number of\nlong-standing problems in complex dynamics. In particular, we consider the problems of prediction, control and\ninference of chaotic dynamics perturbed by noise in the framework of path-integral approach.\nKeywords: Fluctuational transitions, chaos, control of chaos, nonlinear dynamical inference\n1. INTRODUCTION\nAlmost all systems, whether in nature or in technology, are noisy and nonlinear and, in general, their behaviour\ncan only be understood if the nonlinearity and noise are taken explicitly into account. Such studies are of wide\napplicability to many branches of science and technology, where identical model equations often arise in diverse\ncontexts.\nOne of the ultimate goals of such studies is prediction and control of complex stochastic dynamics – the prob-\nlem that was challenging researchers for decades. A particular challenging aspect of this problem is an analysis\nof fluctuations in systems with complex geometrical structure of an attractor or\/and attractor’s boundaries, such\nas chaotic systems.\nA traditional approach to the problem of prediction in the context of stochastic nonlinear dynamic would be\nto calculate the probability of various events in such systems, including e.g. the probability of fluctuation-induced\ntransitions between coexisting states.1 As a result the dynamical information is usually lost and traditional\napproach does not allow the development of methods of dynamical control. Moreover, in the actual experimental\nsituation the model is not usually known exactly from “first principles” and one is faced with the problem of\ninferencing a parametric model from the measured time-series data.\nTherefore, a few fundamental distinct problems can be formulated in the context of research of complex\ndynamical systems:\n• inference of the parametric dynamical model from the experimental time-series data;\n• calculations of the probability distribution function;\n• development of the methods of dynamical control.\nThese problems are usually considered in the context of distinct scientific disciplines, see e.g..2–4\nWe will show, however, that the problems of prediction, control, and inference of complex dynamical systems\ncan be addressed in a general framework of the path-integral approach to the analysis of the fluctuational\ntrajectories.5, 6 The unifying theme of this approach is the idea that the solution of all above mentioned problems\nFurther author information: (Send correspondence to D.G.L)\nD.G.L.: E-mail: d.luchinsky@lancaster.ac.uk, Telephone: +44 1524 593079\nPublished in Noise in Complex Systems and Stochastic Dynamics II, eds. Z. Gingl, J. M. Sancho,\nL. Schimansky-Geier and J. Kertesz, Proc. of SPIE vol. 5471, Bellingham, 2004, pp 145-158. \nin the limit of weak to moderate noise-intensities requires global minimization of similar probability density\nfunctionals. An additional important advantage of this approach is that it allows to use similar calculations for\nboth maps and flows. A special care should be taken, however, in transformation from stochastic to dynamical\nvariables in each case.\nThe paper is organized as follows. In the Sec. 2 we introduce the probability density functional to have a\ngiven fluctuational trajectory in dynamical flows and maps. In the Sec. 3 we apply the path-integral approach\nto the analysis of the noise-induced escape from a chaotic attractor via fractal basin boundary. In the Sec. 4 we\ndemonstrate that the same approach can be used to solve the problem of energy-optimal control of migration\nin chaotic attractor. Finally, in Sec. 5 we apply path-integral formulation to the solution of infer parameters of\nchaotic system from the experimental time-series data.\n2. PROBABILITY DENSITY FUNCTIONAL OF FLUCTUATIONAL\nTRAJECTORIES\nConsider a dissipative stochastic dynamical system described by L-dimensional map\nxn+1 = f(xn) + σξn, 〈ξαnξβn′〉 = δnn′δαβ , (1)\nwhere xn, ξn ∈ RL, and σ is a matrix that mixes white Gaussian noises ξn. Note that particular case f(xn) = xn+\nhK(xn) corresponds to a prepoint Euler discretization scheme for Langevin systems of equations corresponding\nto dissipative dynamical flow\nx˙ = K(x) + σξ(t), (2)\n〈ξα〉 = 0, 〈ξα(t)ξβ(s)〉 = δ(t− s)δαβ ,\nwhere xn = x(tn), tn = nh, h = (tf − t0)\/N with the initial and final times t0 and tf . In both cases x is a\nL-dimensional vector of dynamical variables describing the systems (1) and (2). K(x) is a non-linear vector field\n(which may depend explicitly on time), ξ(t) is a zero-mean Gaussian noise.\nThe form of the probability functional is determined by the properties of the dynamical noise ξ(t).6, 7 It\nis clear from the eq. (1) that the probability ρ(xN , tf |x0, t0) of fluctuational path {xn} connecting attractor\nSA with arbitrary point SB in its basin of attraction is deterministically related to the probability ρ[ξn] for the\nrandom force to have corresponding random realization {ξn}. Taking into account that for white Gaussian noise\nξn at each time step are independent on each other the later probability is given by (cf.1, 8–11)\nρ[ξn]\nN−1∏\nn=0\ndξn =\nN∏\nn=0\nL∏\nl=0\ndξn√\n2π\nexp\n(\n−1\n2\nξTn,lξn,l\n)\n. (3)\nChanging to dynamical variables we have the probability for the system (1) to have fluctuational trajectory {xn}\nin the form\nρ[xn]\nN−1∏\nn=0\ndxn =\n1√\n(2π)NL det (D)\nN−1∏\nn=0\ndxn exp\n(\n−1\n2\n(xn+1 − f(xn))TD−1(xn+1 − f(xn))\n)\n, (4)\nwhere D = σσT . In the transformation from (3) to (4) we have neglected the Jacobian of transformation\nJ(xn) =\n∂(ξn1,ξn2,...ξnL)\n∂(xn+1,1...xn+1,L)\n. This Jacobian is 1 for the maps. However, for the flows it is essential different from 1\nas follows from the mid-point finite difference approximation of (2) xn+1 = xn +hK(x∗n)+σ\n′zn where σ′ = σ\n√\nh\nand x∗n = (xn + xn+1)\/2. It can be easily seen that in this case to the first order approximation in h the\nJacobian of transformation is J(x) ≈ 1 − h2\n∑L\nl=0\n∂Kl(xn)\n∂xn,l\n(cf.12–14). This term turns out to be unimportant in\nthe analysis of the large deviations of the system from the attractor in Sec. 3 and 4. The reason is that in this\ncase noise intensity is assumed to be very small as compared to the action integral taken along the fluctuational\ntrajectories. Or other words D tend to zero in (4) the corresponding term− 12 (xn+1−f(xn))TD−1(xn+1−f(xn)) is\nexponentially larger then the term related to the prefactor. However, it was suggested in46, 47 that in the analysis\nof the inference one does not assume necessarily the presence of large deviations and the prefactor term gives\nthe dominant contribution to the reconstruction of the system dynamics from the time-series data.\nFinally the probability density functional F [x] over the trajectory xn of system (1) and of system (2) (in\nEuler approximation) is given by the following equation\nF [x] = J(x)√\n(2πh)NL det (D)\nexp\n(\n− 1\n2h\nN−1∑\nn=1\n(xn+1 − f(xn))TD−1(xn+1 − f(xn))\n)\n, (5)\nwhere J(x) = 1 and h = 1 for the maps (1) and J(x) ≈ 1− h2\n∑L\nl=0\n∂Kl(xn)\n∂xn,l\nand h is the time step of discretization\nfor the flows (2).\n2.1. Extremal fluctuational paths\nSuppose we are interested in calculation of the probability to find a dynamical system at any point in the basin\nof attraction Ω of some attractor A. If the distance from the attractor is much larger then the square root of\nlargest eigenvalue of D we can assume that the noise is small and in this sense to analyze the probability of large\ndeviations from A.\nAs we have mentioned above in the analysis of large deviations the prefactor can be neglected and we can\nproceed to obtain equations for the most probable fluctuational paths via analysis of the global minimum of the\nenergy functional for the system (1)\nS =\n1\n2\nN∑\nn=1\nξTn ξn, under condition xn+1 − f(xn)− σξn = 0, (6)\non a discrete time n = 0, ..., N , where x0 belongs to the attractor and xN is an arbitrary point in the basin of\nits attraction. In a particular case of the escape from the basin of attraction xN belongs to the basin boundary.\nThe corresponding results for the flows can be obtained as a limiting case of f(xn) = xn + hK(xn) with h → 0.\nIntroducing Lagrangian multipliers λn we have to minimize11 effective functional\nS∗ =\n1\n2\nN∑\nn=1\nξTn ξn +\nN∑\nn=1\nλTn (xn+1 − f(xn)− σξn), (7)\nwith respect to independent variations of ξn, λn, and xn leading to 2L-dimensional map of the form11\n{\nxn+1 = f(xn) + σσTλn,\nλn+1 = {f ′(xn+1)}−1 λn. (8)\nTo obtain corresponding results for the flows we substitute Euler approximation f(xn) = xn + hK(xn) into (8).\nTaking into account that σ goes into σ′ = σ\n√\nh we obtain\n{\nx˙ = K(x) + Dp,\np˙ = −K ′(x)p, (9)\nwhich are well-known15, 16 Hamilton’s equations for the flows in the extended phase space. Here we introduced\nthe notations for vanishingly small h: λn → p(t), xn → x(t), (λn+1 − λn)\/h → p˙, and (xn+1 − xn)\/h → x˙.\nThis clarifies physical meaning of the Lagrangian multipliers in (8) as quantities equivalent to momenta in\ncontinuous equations and show the connection between eqs. (8) the Hamilton’s equations for the flows.\nTrajectories of (8) and (9) found with appropriate boundary conditions cover densely the configuration spaces\nof original systems (1) and (2). The global minimum of the energy functional (6) found by minimization over\nall the trajectories arriving to a given point of the basin of attraction provide the solution of the problem of\npredicting the probabilities of various states of the stochastic flows and maps.\n2.2. Boundary conditions\nTo describe initial conditions we assume for simplicity that the attractor has a fixed point x0 of period one and\nlinearize eqs. (8) about this point to obtain\n{\nδxn+1 = f ′(x0)δxn + Dλn,\nλn+1 =\n{\nf ′(x0)\n}−1\nλn.\nor in matrix form\n(\nδxn+1\nλn+1\n)\n=\n(\nA D\n0 A−1\n)(\nδxn\nλn\n)\n(10)\nwhere A = f ′(x0). The unstable manifold of x0 is a two-dimensional hyperplane spanned by the two unstable\neigenvectors vu1 and v\nu\n2 of (10). The generic point on the unstable manifold is written as vn+1 = α1v\nu\n1µ\nn\n1 +\nα2v\nu\n2µ\nn\n2 where α1,2 are complex coefficients and µ1 and µ2 are two multipliers corresponding to the unstable\neigendirections. Separating the δx and the λ components we obtain linear relationship between x and λ for a\n2-dimensional map in the form\n(\nλx\nλy\n)\n= M\n(\nx\ny\n)\n, where M =\n(\nv1λx v2λx\nv1λy v2λy\n)(\nv1x v2x\nv1y v2y\n)−1\n. (11)\nSimilarly a substitution of Euler approximation f(xn) = xn + hK(xn) into (10) recovers a well-known result for\nthe linearized Hamiltonian equations for continuous systems (cf. e.g.6, 17, 18)\n{\nδx˙ = K ′(x0)δx + Dp,\np˙ = −K ′(x0)p. or in matrix form\n(\nδx˙\np˙\n)\n=\n(\nB D\n0 −B\n)(\nδx\np\n)\n(12)\nwhere B = K ′(x0) and δx is small deviation of the coordinate from the fixed point attractor x0. The generic\npoint on the unstable manifold is written in this case as v(t) = α1vu1 exp\nλ1t +α2vu2 exp\nλ1t where α1,2 are complex\ncoefficients and λ1 and λ2 are two positive eigenvalues corresponding to the unstable eigenvectors vu1 and v\nu\n2 .\nAccordingly the connection between the momenta and coordinates on the unstable manifold of the linearized\nsystem can be written in the form similar to (11)\n(\npx\npy\n)\n= M\n(\nx\ny\n)\n, where M =\n(\nv1px v2px\nv1py v2py\n)(\nv1x v2x\nv1y v2y\n)−1\n. (13)\nEquations (11) and (13) provides the choice of a proper initial conditions for the solution of the boundary\nvalue problem for flows and maps. For the two-dimensional flows and three-dimensional maps considered in the\nfollowing chapters the corresponding unstable manifolds can be parameterized using two-parameter sets.\nIn particular, the activation processes in the systems (1) and (2) in the limit of small noise intensity is gov-\nerned by the most probable escape path that drives the system from the point attractor x0 at t0 → −∞ to the\nsaddle orbit SB at tf → +∞.\nThe analysis of the stable manifold of an unstable (or saddle) structure is performed in a similar way.\n2.3. Experimental investigation of the large deviations\nOne of the important points to bare in mind is that the optimal fluctuational paths can be measured directly in\nthe experiment as was suggested by Dykman et al.19 In this technique the dynamics of the system is followed\ncontinuously. Several dynamical variables of the system and the random force (when available20) are recorded\nsimultaneously, and then the statistics of all actual trajectories along which the system moves in a particular\nsubspace of the coordinate space is analysed. The theory predicts and the experiment demonstrates19–25 that\nso-called prehistory probability distribution of such trajectories moving the system from the equilibrium state to\nthe remote state are sharply peaked about the optimal fluctuational path.\nIt is clear that information about stochastic processes obtained in this way is much more detailed than that\nobtained by the standard method of measuring stationary probability distributions. In our technique, not only\ndo we count rare events (i.e. arrivals of the system at a given point in configuration space), but we also learn how\neach of these events comes about. The underlying mechanism is that, when the system is driven by a random\nforce, it will occasionally fluctuate to a given point in the attractor basin. In doing so in the limit where the noise\nintensity tends to zero, the system will follow very closely the “deterministic” optimal fluctuational trajectories.\nThis technique has been mainly developed through the applications to the analysis of fluctuations in electronic\ncircuits23 and only recently it was extended to the investigations of the fluctuations in real physical systems. In\nparticular, in the work by Hales and co-authors25 the prehistory distribution was observed experimentally using\na semiconductor laser with optical feedback.\nWe emphasize that the possibility of experimental investigation of the probability density functional of large\ndeviations is an additional important advantage of the path-integral approach to the analysis of the fluctuations\nin complex stochastic nonlinear systems, where neither stationary probability distribution nor the PDF (5) are\nknown theoretically. As we will show in the next two sections such experimental measurements can be very\nhelpful in the analysis of escape and control problems in chaotic systems in particular.\n3. ESCAPE THROUGH A FRACTAL BOUNDARY\nThe mechanism of fluctuational escape from a chaotic attractor (CA) through a fractal basin boundary (FBB)\nrepresents one of the most challenging unsolved problems in fluctuation theory.1, 8, 11, 26 The unpredictable and\nhighly complex stochastic behavior of such systems arises in part from the presence of limit sets of complex\ngeometrical structure, and in part from the fractality of the basin boundary.27, 28 For this reason, the central\nquestion – whether or not there exists a generic mechanism for fluctuational transitions through the FBB – has\nremained unanswered.\nIn this Section we show that a generic mechanism of fluctuational transition between co-existing CAs separated\nby an FBB can be found using experimental analysis of the probability distribution of the fluctuational trajec-\ntories described above. Such an analysis reveals a unique solution for the escape problem and the corresponding\nboundary conditions both on the attractor and attractor boundaries and facilitates further investigations of the\nnoise-induced transitions in chaotic systems based on the path-integral approach.\nTo demonstrate the existence of this escape mechanism, we take as an example the two-dimensional map\nintroduced by Holmes.29 The properties of this map, including the structures both of its CA and of its locally\ndisconnected FBB, are generic for a wide class of maps and flow systems.30 This fact, taken with the results\nof our investigations of escape in other systems, allows us to conclude that the escape mechanism we describe is\nindeed a typical one. The Holmes map is\nxn+1 = yn (14)\nyn+1 = −b xn + d yn − y3n + ξn,\nwhere ξn is zero-mean, white, Gaussian noise of variance D. Due to symmetry, the noise-free system (14) with\nb = 0.2 and 2.0 ≤ d ≤ 2.745 has pairs of co-existing attractors, the basins of which are separated by a boundary\nthat may be either smooth or fractal, depending on the choice of parameter values. We choose for our studies\nb = 0.2 and d = 2.7, which corresponds to there being two co-existing CAs separated by a locally disconnected\nFBB (see Fig. 1). The fractal dimension of the boundary has been determined numerically (dim = 1.84472) by\nusing the “uncertainty exponent” technique introduced in.31 The chaotic attractors in (14) appear as the result\nof a period-doubling cascade and, for the parameters chosen, each of them consists of two disconnected parts.\nWe have modelled the system (14) numerically, exciting it with weak noise, and have collected trajectories\nthat include escape paths from one CA to the other, and also the corresponding realisations of noise that induced\nthese transitions. By ensemble averaging a few hundred such escape trajectories and noise realisations, we have\nobtained the optimal escape path and the corresponding optimal force, which are shown in Fig. 1(b). The results\nof this statistical analysis allow us both to determine the boundary conditions near the CA and the FBB, and\nto demonstrate the uniqueness of the MPEP. It can be seen in particular that, in leaving the CA, the system\n(14) falls into a small neighbourhood of the saddle point of period 1 (S1) located between its two disconnected\nparts and having the multipliers ρ1 = 0.118975 and ρ2 = 1.681025. Its stable manifolds separate the parts of the\nCA, while the unstable ones belong to the CA. The system makes a few iterations in the neighbourhood of S1\n(small plateau in Fig. 1(b)) and then moves to the FBB in three steps, crossing it at a saddle point of period 3\nS1 S3\nS3\nS3\nS3\nS3\nS3\nS1\nx\nyn\nn\nO\n(a)\n0 4 8 12 16 20 24 28 32 36 40 44 48 52\nn\n-2\n-1.5\n-1\n-0.5\n0\n0.5\n1\n1.5\n2\nx\n8 12 16 20 24 28\nn\n-0.03\n-0.02\n-0.01\n0\no\npt\nim\nal\n f\nor\nce\nn\n(b)\n8\n7\n6\n5\n4\n3\n2\n1\n9\n10\nFigure 1. (a) The co-existing chaotic attractors (filled black regions) and their basins of attraction represented by grey\nand white respectively. The accessible boundary saddle points of period 3 are shown by the small filled black circles labelled\nS3. Their stable manifolds are shown as full black lines. The saddle points of period 1 are shown by the crosses labelled\nS1. The saddle point at the origin is labelled O. (b) The most probable escape path (dashed line) connecting the CA\nwith the period-3 saddle cycle lying on the fractal boundary, obtained from the Monte-Carlo simulations with D = 10−5.\nThe optimal path found by the solution of the boundary-value problem is shown as a solid line. The x-coordinate of the\nsaddle point S1 is shown by the horizontal dashed line.\n(S3) with multipliers ρ1 = 0.001016 and ρ2 = 7.875512. Calculations have shown that, for the chosen parameter\nvalues, S3 lies within the FBB. Moreover, its stable manifold (solid black line in Fig. 1(a)) is dense in the FBB\nand detaches the open neighborhood, including an attractor, from the FBB itself. This allows us to classify it\nas an accessible boundary point.32\nAn analysis of the structure of escape paths inside the FBB has shown that the homoclinic saddle points\nplay a key role in its formation. In the system (14), we observe an infinite sequence of saddle-node bifurcations\nof period 3, 4, 5, 6, 7..., which occur at parameter values d3 < d4 < d5 < d6 < d7... and are caused by tangencies\nof the stable and unstable manifolds of the saddle point O at the origin. The homoclinic orbits appearing as\na result of these bifurcations were classified earlier as original saddles, and it was also shown that their stable\nand unstable manifolds cross each other in a hierarchical sequence.32 To characterize this hierarchical relation\nbetween original saddles, it is reasonable to introduce a parameter µ equal to the ratio | ln(ρ1(P )) | \/ ln(ρ2(P )),\nwhere ρ1 and ρ2 are the multipliers of a saddle point P . Calculations have shown that, for the original saddles\nof period 3, 4, 5, 6, 7, 8... in (14), the following hierarchical sequence of index µ values occurs: µ3 = 3.339, µ4 =\n3.08, µ5 = 2.999, µ6 = 2.339, µ7 = 1.958, µ8 = 1.539. Moreover, the values of index µ corresponding to the\nother homoclinic saddle cycles are close to zero. Correspondingly the probability of finding the system in their\nneighbourhood tends to zero.\nThese results allows us to infer features of a fluctuational transition through a locally disconnected FBB that\nare probably generic, as follows: (i) it always occurs through a unique accessible boundary point; and (ii) the\noriginal saddles forming the homoclinic structure of the system play a key role in the formation of the paths\ninside the FBB, the difference in their local stability defining the hierarchical relationship between them. Thus,\nwe may claim that complicated structure of escape trajectories, caused by the thin homoclinic structure and\ntheir randomness, has in many respects a deterministic nature.\nHaving now understood the mechanism of escape, we can seek the MPEP according to the Hamiltonian\ntheory of fluctuations (see Sec. 2). The following area-preserving map is obtained in this case\nxn+1 = yn\nyn+1 = −b xn + d yn − y3n + λyn (15)\nλxn+1 = (d− 3x2n+1)λxn\/b− λyn\/b\nλyn+1 = λ\nx\nn\nEquations (15) are supplemented by the following boundary conditions\nlim\nn→−∞λ\ny\nn = 0, (x\n0\nn, y\n0\nn) ∈ S1, (x1n, y1n) ∈ S3. (16)\nThe MPEP is the minimum-energy heteroclinic trajectory connecting S1 to S3 in the phase space of (15). The\nsolution of this boundary value problem found by the method briefly outlined in the Sec. 2 is shown in Fig. 1(b).\nIt can be seen that, within the range shown by the vertical dotted lines in Fig. 1(b), the theoretical MPEP closely\ncoincides with the path obtained by statistical analysis of escape trajectories in the Monte Carlo simulations.\nNote that no further action is required to bring the system to the other attractor once it has reached the accessible\norbit of the FBB, i.e. once it has reached the points numbered 8 in Fig. 1(b); correspondingly, the optimal force\nmeasured in the numerical simulations (inset) falls back to zero.\nIn conclusion, we have demonstrated33 that the path-integral approach to the analysis of complex systems\ncan be used very effectively to reveal the mechanism by which noise-induced escape occurs through a locally\ndisconnected FBB. We want to emphasize that the revealed escape mechanism must be applicable to the broad\nclass of two dimensional maps and flows29, 30 exhibiting the same type of FBB.\n4. CONTROL OF A CHAOTIC OSCILLATOR\nIn this section we demonstrate that the analysis of the optimal trajectories can be used to solve one of the\nlong-standing problem of control of chaos. We consider the motion of a periodically driven nonlinear oscillator\nx˙1 = f1 = x2, (17)\nx˙2 = f2 = −2Γx2 − ω20x1 − βx21 − γx31 − h cos(Ωt) + u(t),\nHere u(t) is the control function. Parameters were chosen such (β2 < Γω20 ,\nβ2\nΓω20\n> 910 ,Γ = 0.025) that the chaotic\nattractor coexists with the stable limit cycle (SC in Fig. 2(b)). The chaotic state appears via period-doubling\nbifurcations and thus corresponds to a non-hyperbolic attractor. Its boundary of attraction ∂Ω is nonfractal and\nis formed by the saddle cycle of period 1 (S1). For details about the phase diagram see.34 We have considered\nthe following energy-optimal control problem. The system (17) with unconstrained control function u(t) is to be\nsteered from the CA to the stable limit cycle in such a way that the energy (“cost”) functional R is minimized,\nwith t1 unspecified\nR = inf\nu∈U\n∫ t1\nt0\nf0(x, t)dt, f0(x, t) =\n1\n2\nu2(t). (18)\nHere the control set U consists of functions (control signals) able to move the system from the CA to the SC.\nThe idea of the method is that the optimal control signal u¯(t) can be identified with the optimal fluctuational\nforce35 that drives the system from the CA to the SC. Therefore the control function can be found as an optimal\nforce of the following\nx¨ + 2Γx˙ + ω20x + βx\n2 + γx3 + h cos(Ωt) = ξ(t), (19)\n〈ξ(t)〉 = 0, 〈ξ(t)ξ(0)〉 = 4ΓkTδ(t)\nif the control signal u(t) in (17) is substituted with zero-mean white Gaussian noise ξ(t) in (19).\nThe interrelationship between the two problems is intuitively clear because, in thermal equilibrium (D =\n4ΓkBT ), the probability of fluctuations is determined by the minimum work from the external source needed to\nproduce the corresponding change in the thermodynamic quantities ρ ∝ exp(−Rmin\/kBT )36 and for the system\n(17) Rmin is given by R in (18). On the other hand the same probability is given by the optimal realisation of\n−1 0 1\n−1\n0\n1\nq1\nq2\n SC\n S1\nFigure 2. The basin of attraction (shaded region) of the stable limit cycle SC (large filled circle) and that of the chaotic\nattractor CA (white) in Poincare´ cross-section with Ωt = 0.6π(mod2π), Ω = 0.95. The boundary S1 of the CA’s basin\nof attraction, the saddle cycle of period 1, is shown by the black square. The saddle cycle of period 3 is shown by black\npluses. The intersections of the actual escape trajectory with the Poincare´ cross-section are indicated by the small filled\ncircles.\nthe random force ξ(t) minimising integral in the probability density functional (5)( cf.37, 38). We therefore have\nto solve the same variational problem in both cases.\nThe most probable escape path 〈qesc(t)〉 and the corresponding solution u˜(t) ≈ 〈ξesc(t)〉 of the energy-optimal\ncontrol problem can be found using our experimental method of statistical analysis of the distribution of escape\ntrajectories explained in Sec. 2.3 and 3. Note that the topological features of the prehistory distribution yield\ndirect insight into the control problem: where the prehistory distribution does not develop a well defined ridge\nin the D → 0 limit, we may infer that control via a simple function is not achievable. In the present case, this\ndistribution turns out to be characterised by a narrow ridge, as the noise intensity is decreased, allowing us to\ndefine an approximate solution u˜(t) for the control function (the exact solution is u¯(t) = limD→0 u˜(t)), as an\nensemble average 〈ξesc(t)〉 of the realisations of the random force corresponding to the energy-optimal escape\npath.\nOnce boundary conditions are specified one can solve the corresponding boundary value problem for the\nsystem (19) numerically.34 The results of the numerical solution of the boundary value problem obtained by the\nrelaxational method are shown in Fig. 3(a) by the dotted lines and are in a good agreement with the solution\nfound from the analysis of fluctuational trajectories. To demonstrate that the optimal force u˜(t) found in the\nexperiment really does minimise the energy of the control function steering the system (17) from the CA to the\nSC1 we set it to arbitrary initial conditions in the basin of attraction of the CA and let it evolve deterministically\nuntil it passed through the initial part of the unstable manifold of S5. At this moment the deterministic control\nfunction was switched on. For a given shape of the control function and\/or initial conditions, its amplitude was\nset to the threshold for switching of the system from chaotic to regular motion on SC1.\nIt was found that the system is very sensitive to small variations in the control function: any deviation\nfrom the shape of u˜(t), or from the initial conditions found in the experiment, leads to a substantial increase\nin the energy required to attain SC1. Some experimental results are shown in Fig. 3. It can be seen that the\nenergy of the control function is approximately twice larger if the optimal force is approximated by the sin\nfunction modulated by a Gaussian u(t) = a1 sin(a2t) exp(−(t−a3)2a4), and it is respectively ∼ 4 and ∼ 20 times\nlarger if the optimal force is approximated by rectangular pulses or distorted with an arbitrary low-frequency\nperturbation.\nWe have also performed experiments using an open-plus-closed-loop control technique39 and an adaptive\ncontrol algorithm40 to steer the system from the CA to the SC1. Although these methods are designed to\n0 5 10 15\n−1\n0\n1\n2\n3\nωft\/2π\n〈 q1\nesc〉\n 〈 ξesc〉\n 0\n \n(a)\n−0.05\n0 1 2 3 4 5 6\n10−3\n10−2\n10−1\n100\n Control\n \nE\nn\ner\ngy\n(b)\nFigure 3. (a)The most probable escape path (bottom solid curve) from S5 to the S1, found in the numerical simulations.\nSingle periods of the unstable saddle cycles of period 5, 3 and 1 are shown by open circles, squares and triangles respectively;\nthe stable limit cycle is shown by rombs. Parameters were h = 0.13, ωf ≈ 0.95, ω0 ≈ 0.597, D ≈ 0.01. Optimal force (top\ncurve) corresponding to the optimal path after filtration. (b) Energies of various control functions used in the numerical\nexperiments: 1 - optimal force found by statistical analysis of the fluctuational escape trajectories; 2 - approximation of\nthe optimal force by u(t) = a1 sin(a2t) exp(−(t − a3)2a4) where ai are constants; 3 - approximation of the optimal force\nby the rectangular pulses; 4 - arbitrary perturbation of the optimal force with a low-frequency perturbation; 5 - control\nfunctions produced by the OPCL algorithm.\noptimise the recovery time, rather than to minimise the energy of the control function, they are efficient in\nentraining the system dynamics to the goal dynamics. So it is interesting to compare their performance with\nthat of the control function found in our experiment. The energy of the control functions (see Fig. 3(b)) obtained\nby these methods is more than an order of magnitude larger then the energy of the optimal control function u˜(t)\nfound by our new technique.\nThe results of this section demonstrate41 that a novel technique for the energy optimal steering of a chaotic\nsystem can be developed using the Hamiltonian formalism for the analysis of fluctuational trajectories in complex\nnonlinear systems.\n5. NONLINEAR DYNAMICAL INFERENCE OF A CHAOTIC SYSTEM\nAs we have mentioned in the introduction, in the actual experimental situation the model is not usually known\nexactly from “first principles” and one is faced with the problem of inferencing a parametric model from the\nmeasured time-series data. For a complex stochastic nonlinear system this problem does not have a general\nsolution.\nDeterministic inference techniques3 consistently fail to yield accurate parameter estimates in the presence of\nnoise. The problem becomes even more complicated when both measurement noise as well as intrinsic dynamical\nnoise are present.42 A standard approach to this problem is often based on optimization of a certain cost\nfunction (a likelihood function) at the values of the model parameters that best reconstruct the measurements.\nIt can be further generalized using a Bayesian formulation of the problem.42, 43 Existing techniques usually\nemploy numerical Monte Carlo techniques for complex optimization44 or multidimensional integration43 tasks.\nInference results from noisy observations are shown to be very sensitive to the specific choice of the likelihood\nfunction.45 Consequently, the correct choice of the likelihood function is one of the central questions in the\ninference of continuous-time noise-driven dynamical models considered here.\nIn this section we demonstrate, however, that the effective algorithm of nonlinear dynamical inference can\nbe developed using path-integral approach to the analysis of the fluctuational trajectories. Specifically, this\napproach guarantees correct choice of the likelihood function that provides optimal compensation for the noise-\ninduced errors. For the full N-dimensional version of the algorithm and its application to an ensemble of coupled\noscillators see,46 an example of application of this algorithm to the real data of physiological experiment is\ndiscussed in.47\nConsider for the sake of simplicity a one-dimensional dynamical system subject to additive noise of the form\nx˙ = K(x|c) + ξ(t), (20)\n〈ξ(t)〉 = 0, 〈ξ(t)ξ(0)〉 = Dδ(t),\nwhere K(x|c) is the deterministic drift force, ξ(t) is the white zero-mean Gaussian noise and D is the noise\nintensity. We assume that the unknown deterministic force can be represented in the form\nK(x|c) =\nM∑\nk=1\nckfk(x), (21)\nwhere fk(x) are known base functions, and c = {ck} is a set of unknown coefficients that have to be inferred\nfrom experimental data.\nSuppose that we can measure directly in the experiment the dynamical variable x(t) by sampling it on a time\nlattice ti = tin + i h (i = 0, 1, . . . , N) with the step h = (tfn − tin)\/N . Using path-integral approach outlined\nin Sec. 2 conditional probability density function (PDF) L(x|c) of an observation x(t) for a given choice of the\nmodel parameters c can we written as\nL(x|c) = Pst(x(t0)|c)F [x], (22)\nwhere Pst(x|c) is a stationary PDF of the system (20) given in (5). Thus all the information about our system\nis now encapsulated in the likelihood function that relates observations to the dynamical process (20).\nSuppose also that we can use a priory available information and an expert opinion about our system sum-\nmarized in a so-called prior PDF p(c).\nGiven a set of observation summarized in the likelihood function (22) one can improve an a priori estimate\nof the model parameters taking advantage of the Bayes theorem\np(c|x) = L(x|c)p(c)∫\nL(x|c)p(c)dc . (23)\nHere p(c|x) is a so-called posterior PDF that contains the improved by observations information about the model\nparameters. The integral in the denominator in (23) insures that the posterior PDF is normalized. Clearly,\nEq.(23) can be applied iteratively each time a new record of measurements is used: prior distribution in the\nnext iteration is just a posterior distribution from the previous iteration. For sufficiently large number N of\nobservations in x the posterior distribution p(c|x) becomes sharply peaked about certain parameter values c\ncorresponding to the most probable model of the system for a given measurement set.\nLet us choose the prior p(c) in a Gaussian form\np(c) =\n√\ndetA0\n(2π)M\nexp\n[\n−1\n2\n(c− c0)TA0(c− c0)\n]\n, (24)\nwhere c0 is a vector with arbitrary initial values of parameters and A0 is a diagonal matrix with arbitrary values\nof diagonal elements. In particular, small values of diagonal elements of A0 will reflect the fact that initial values\nof the model parameters are not known. Now we can rewrite the likelihood in the form\nL(x|c) = (2πDh)−N\/2 exp\n[\n−R\nD\n−\n(\nγ − α\nD\n)\nc− cT B\n2D\nc\n]\n,\nwhere\nαk =\n∫ xN\nx0\ndx fk(x), xi = x(ti), Bk k′ = h\n∑\ni\nfk(xi) fk′(xi),\nγk =\nh\n2\n∑\ni\nf ′k(xi), R =\n1\n2h\n∑\ni\n(xi+1 − xi)2 .\nMaximising the likelihood with respect to unknown model parameters we obtain the following algorithm of\ninference\nAp+1 =\nB\nD\n+ Ap, cp+1 = −A−1p+1\n(\nγ − α\nD\n− cTp A\n)T\n, (25)\nwhere index p corresponds to prior parameters and index p + 1 corresponds to improved posterior parameters.\nNoise intensity D for each block of data can be inferred as\nD =\n2\nN\n∑\ni\n(\nR− αcp + cTp\nB\n2\nc\n)\n.\nWe now illustrate following47 the application of the algorithm to inferencing a paradigmatic example of complex\ndynamical system – the Lorenz system. It has dynamical variables, x = {x1, x2, x3}, the vector field\n\n\n\nx˙ = σ(x2 − x1),\ny˙ = rx1 + x2 − x1x3,\nz = x1x2 − bx3.\n(26)\nand noise correlation matrix 〈ξn(t)ξn′(t′)〉 = dnδn,n′ . The parameters in (26) are σ = 10, r = 28, b = 83 . We\n10−2 10−1 10\n(a)\n0 101 102\n−28\n−14\n0\n14\n28\n t\n〈 a31〉\n0.01 10\n10−4\n101\n t\n〈∆\na\n2 31\n〉\n1 \n2 \n2 \n1 \n0 10 20 30 40 50\n0\n40\n80\n120\nr\nρ\n(b)\n(r)\nFigure 4. (a) Examples of convergence of the coefficient a31 corresponding to parameter r of the Lorenz system (26) for\nthe total length of the time record T = 560 and the following sets of parameters: line 1 {dn} = {0.01, 0.012, 0.014} time\nstep h = 0.002; line 2 {dn} = {100, 120, 140} and h = 0.00002. The insert shows dispersion 〈∆a231〉=〈a231〉 - 〈a31〉2 for the\nsame sets of parameters. The vertical dashed line shows the time-scale of the step-wise decrease in the variance. (b) The\ncomparison of the results of inference that take into account the prefactor term described in the text (black solid line)\nwith the generalized least square fit (dotted line). The correct value of the coefficient is shown by vertical dashed line. To\nbuild distribution ρ(r) of the inferred values of the coefficient r we have used an ensemble of 1000 numerical experiments\nusing 90000 data points each. These results follow.47\nsample a system trajectory x(t) and produce a “data record” {y(tk)} to be fed directly into the algorithm. As\nan inferential framework, we introduce the following model of stochastic dynamics for x(t):\nx˙n =\n3∑\ni=1\nani xi(t) +\n3∑\ni<j=1\nbnij xi(t)xj(t) + ξn(t), (27)\nn, i, j = 1, 2, 3, where M = {{ani}, {bnij}, {Dn}} is the vector of 18 unknown coefficients and 3 values of the\nnoise intensities. We note that for diagonal noise matrix as in the case of (27) the problem is reduced to 1D case\nof inference described in this section. We were able to infer the accurate values of c,D for time step h varying\nfrom 0.01 to 10−6 and noise intensities dn varying from 0 to 102. An example of convergence of the coefficients\nis shown in Fig. 4 (see47 for further details).\nWe found a step-wise decrease in variances that occurs on a time scale of the period of oscillations τosc ≈ 0.6\n(dashed line in the figure). The error of the inference is sensitive to the noise intensity, total time T and the time\nstep h. For example, for the parameters of the curve 1 in the Fig. 4 the relative error was 0.015%. The ratio\nT\/h has to be increased at least 250 times to achieve error less then 1% when the noise intensity is increased 104\ntimes (curve 2 in the figure).\nAs show in47 it is important to keep the prefactor term in the probability density functional (5) to achieve\ncorrect results of inference. We demonstrate this following46 by comparing the statistical analysis of the results\nof inference of the coefficient r in the Lorenz equations preformed with and without prefactor term. As shown\nin the Fig. 4(b) the absence of this term results in a systematic underestimation of the model coefficient, while\ntaking this term into account provides optimal compensation of the noise induced errors.\n6. CONCLUSIONS\nIt is shown that novel effective techniques of prediction, control, and inference of complex dynamical systems can\nbe addressed in a general framework of the path-integral approach to the analysis of the fluctuational trajectories.\nACKNOWLEDGMENTS\nThe work was supported by the Engineering and Physical Sciences Research Council (UK), NASA IS IDU project\n(USA), the Russian Foundation for Fundamental Science, and INTAS.\nREFERENCES\n1. R. Graham, A. Hamm, and T. Tel, “Nonequilibrium potentials for dynamical systems with fractal attractors\nor repellers,” Phys. Rev. Lett. 66(24), pp. 3089–3092, 1991.\n2. V. I. Mel’nikov, “The kramers problem: fifty years of development,” Physics Reports 209(1\/2), pp. 1–71,\n1991.\n3. H. Kantz and T. Schreiber, Nonlinear Time Series Analysis, Cambridge University Press, Cambridge, 1997.\n4. S. Boccaletti, C. Grebogy, Y.-C. Lai, H. Mancini, and D. Maza, “The control of chaos: theory and applica-\ntions,” Phys. Rep. 329, pp. 103–197, 2000.\n5. M. I. Dykman and M. A. Krivoglaz, “Theory of the fluctuational transitions between the stable states of a\nnonlinear oscillator,” Sov. Phys. - JETP 50, pp. 30–37, 1979.\n6. M. I. Dykman, “Large fluctuations and fluctuational transitions in systems driven by colored gaussian\nnoise–a high frequency noise,” Phys. Rev. A 42, pp. 2020–2029, 1990.\n7. R. Graham, “Path integral formulation of general diffusion processes,” Z. Phys. B 26, pp. 281–290, 1977.\n8. P. D. Beale, “Noise-induced escape from attractor in one-dimensional maps,” Phys. Rev. A 40(7), pp. 3998–\n4003, 1989.\n9. Y. Kifer, “Large deviations in dynamical systems and stochastic processes,” Trans. Amer. Math. Soc. 321(2),\npp. 505–524, 1990.\n10. R. L. Kautz, “Noise, chaos, and the josephson standard,” Rep. Prog. Phys. 59, pp. 935–992, 1996.\n11. P. Grassberger, “Noise-induced escape from attractors,” J. Phys. A: Math. Gen. 22(16), pp. 3283–3290,\n1989.\n12. R. Graham, Tracts in Modern Physics, vol. 66, ch. Quantum Statistics in Optics and Solid-State Physics.\nSpringer-Verlag, New York, 1973.\n13. G. E., “Functional-integral approach to parisi-wu stochastic quantization: Scalar theory,” Physical Review\nD 28, pp. 1922–1930, 1983.\n14. A. J. McKane, “Noise-induced escape rate over a potential barrier: Results for a general noise,” Phys. Rev.\nA 40(7), pp. 4050–4053, 1989.\n15. D. Ludwig, “Persistence of dynamical systems under random perturbations,” SIAM Rev. 17(4), pp. 605–640,\n1975.\n16. M. Freidlin and A. D. Wentzel, Random Perturbations in Dynamical Systems, Springer, New-York, 1984.\n17. R. S. Maier and D. L. Stein, “Limiting exit location distributions in the stochastic exit problem,” SIAM J.\nAppl. Math. 57(3), pp. 752–790, 1997.\n18. V. N. Smelyanskiy, M. I. Dykman, and R. S. Maier, “Topological features of large fluctuations to the interior\nof a limit cycle,” Phys. Rev. E 55(3), pp. 2369–2391, 1997.\n19. M. I. Dykman, P. V. E. McClintock, V. N. Smelyanskiy, N. D. Stein, and N. G. Stocks, “Optimal paths and\nthe prehistory problem for large fluctuations in noise driven systems,” Phys. Rev. Let. 68(18), pp. 2718–2721,\n1992.\n20. D. G. Luchinsky, “On the nature of large fluctuations in equilibrium systems: observation of an optimal\nforce,” J. Phys. A 30(16), pp. L577–L583, 1997.\n21. M. I. Dykman, D. G. Luchinsky, P. V. E. McClintock, and V. N. Smelyanskiy, “Corrals and critical behavior\nof the distribution of fluctuational paths,” Phys. Rev. Lett. 77(27), pp. 5229–5232, 1996.\n22. D. G. Luchinsky, R. S. Maier, R. Mannella, P. V. E. McClintock, and D. L. Stein, “Experiments on critical\nphenomena in a noisy exit problem,” Phys. Rev. Lett. 79(17), pp. 3117–3120, 1997.\n23. D. G. Luchinsky and P. V. E. McClintock, “Irreversibility of classical fluctuations studied in analogue\nelectrical circuits,” Nature 389(6650), pp. 463–466, 1997.\n24. D. G. Luchinsky, P. V. E. McClintock, and M. I. Dykman, “Analogue studies of nonlinear systems,” Reports\non Progress in Physics 61(8), pp. 889–997, 1998.\n25. J. Hales, A. Zhukov, R. Roy, and M. I. Dykman, “Dynamics of activated escape and its observation in a\nsemiconductor laser,” Phys. Rev. Lett. 85(1), pp. 78–81, 2000.\n26. R. L. Kautz, “Activation energy for thermally induced escape from a basin of attraction,” Phys. Lett. A\n125(6,7), pp. 315–319, 1987.\n27. J. Guckenheimer and P. Holmes, Nonlinearoscillations, Dynamical Systems, and bifurcations of vector fields,\nSpringer-Verlag, New-York, 1983.\n28. E. Ott, Chaos in Dynamical Systems, Cambridge University Press, Cambridge, 2002.\n29. P. Holmes, “A nonlinear oscillator with a strange attractor,” Phil. Trans. R. Soc. 292, pp. 419–448, 1979.\n30. S. V. McDonald, C. Grebogi, E. Ott, and J. A. Yorke, “Fractal basin boundaries,” Physica D 17, pp. 125–\n153, 1985.\n31. C. Grebogi, S. W. McDonald, and E. Ott, “Final-state sensitivity - an obstruction to predictability,” Phys.\nLett. A 99, pp. 415–418, 1983.\n32. C. Grebogi, E. Ott, and J. A. Yorke, “Basin boundary metamorphoses - changes in accessible boundary\norbits,” Physica D 24, pp. 243–262, 1987.\n33. A. Silchencko, S. Beri, D. G. Luchinsky, and P. V. E. McCLintock, “Fluctuational transitions through a\nfractal basin boundary,” Phys. Rev. Lett. 91, p. 174104, 2003.\n34. D. G. Luchinsky, S. Beri, R. Mannella, P. V. E. McClintock, and I. A. Khovanov, “Optimal fluctuations\nand the control of chaos,” Int. J. Bif. Chaos 12(3), pp. 583–604, 2002.\n35. V. N. Smelyanskiy and M. I. Dykman, “Optimal control of large fluctuations,” Phys. Rev. E 55(3), pp. 2516–\n2521, 1997.\n36. L. D. Landau and E. M. Lifshitz, Statistical Physics, Pergamon, New York, 3rd ed., 1980. Part 1.\n37. L. Onsager and S. Machlup, “Fluctuations and irreversible processes,” Phys. Rev. 91(6), pp. 1505–1512,\n1953.\n38. R. P. Feynman and A. R. Hibbs, Quantum Mechanics and Path Integrals, McGraw-Hill, New-York, 1965.\n39. E. A. Jackson, “The oplc control methods for entrainment, model-resonance, and migration actions on\nmultiple-attractor systems,” Chaos 7(4), pp. 550–559, 1997.\n40. S. P. Raj and S. Rajasekar, “Migration control in two coupled duffing oscillators,” Phys. Rev. E 55(5),\npp. 6237–6240, 1997.\n41. I. A. Khovanov, D. G. Luchinsky, P. V. E. McClintock, and R. Mannella, “Fluctuations and the energy-\noptimal control of chaos,” Phys. Rev. Lett. 85(10), pp. 2100–2103, 2000.\n42. R. Meyer and N. Christensen, “Fast bayesian reconstruction of chaotic dynamical systems via extended\nkalman filtering,” Phys. Rev. E 65, p. 016206, 2001.\n43. R. Meyer and N. Christensen, “Bayesian reconstruction of chaotic dynamical systems,” Phys. Rev. E 62,\npp. 3535–3542, 2000.\n44. J.-M. Fullana and M. Rossi, “Identification methods for nonlinear stochastic systems,” Phys. Rev. E 65,\np. 031107, 2002.\n45. P. E. McSharry and L. A. Smith, “Better nonlinear models from noisy data: attractors with maximum\nlikelihood,” Phys. Rev. Lett. 83, pp. 4285–4288, 1999.\n46. V. N. Smelyanskiy, D. G. Luchinsky and R. Morris, “Inference of stochastic nonlinear oscillators with\napplications to physiological problems,” see this issue of SPIE proceedings.\n47. V. N. Smelyanskiy, D. A. Timucin, A. Bandrivskiy and D. G. Luchinsky, “Model reconstruction of nonlinear\ndynamical systems driven by noise,” physics\/0310062 http:\/\/arxiv.org\/.\n"}