{"doi":"10.1007\/s10100-009-0111-5","coreId":"15197","oai":"oai:dro.dur.ac.uk.OAI2:8180","identifiers":["oai:dro.dur.ac.uk.OAI2:8180","10.1007\/s10100-009-0111-5"],"title":"An optimising approach to alternative clustering schemes.\\ud","authors":["Jessop,  A."],"enrichments":{"references":[{"id":668675,"title":"Strategic groups: untested assertions and research proposals.","authors":[],"date":"1990","doi":null,"raw":null,"cites":null},{"id":668676,"title":"Classification and Regression Trees.","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":668677,"title":"Community and Privacy: Towards a New Architecture of Humanism.","authors":[],"date":"1966","doi":null,"raw":null,"cites":null},{"id":668678,"title":"Genetic clustering algorithms.","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":668679,"title":"A genetic algorithm approach to cluster analysis.","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":668680,"title":"Airport Statistics 2003\/2004.","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":668681,"title":"Cluster Analysis (Third edn.).","authors":[],"date":"1993","doi":null,"raw":null,"cites":null},{"id":668682,"title":"Product modularity: measures and design methods.","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":668683,"title":"Managing Airports; An International Perspective, 2nd edn.","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":668684,"title":"Multivariate Data Analysis (Sixth edn.). Pearson Prentice Hall, Upper Saddle River NJ,","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":677563,"title":"Statistics and partitioning of species diversity, and similarity among multiple communities.","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":677564,"title":"Stochastic Population Dynamics in Ecology and Conservation.","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":677565,"title":"A new approach to cluster analysis: the clustering-function-based method.","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":677566,"title":"Ecological Diversity and its Measurement.","authors":[],"date":"1988","doi":null,"raw":null,"cites":null},{"id":677567,"title":"Genetic algorithm-based clustering technique.","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":677568,"title":"Renyi’s entropy as an index of diversity in simple-stage cluster sampling.","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":677569,"title":"In search of optimal clusters using genetic algorithms.","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":677570,"title":"Diversity as a concept and its measurement.","authors":[],"date":"1982","doi":null,"raw":null,"cites":null},{"id":677571,"title":"Mapping the structure of MBA programmes: a comparative study of the structure of accredited AMBA programmes in the United Kingdom.","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":677572,"title":"The measurement of species diversity.","authors":[],"date":"1974","doi":null,"raw":null,"cites":null},{"id":685803,"title":"Mathematical Ecology.","authors":[],"date":"1977","doi":null,"raw":null,"cites":null},{"id":685804,"title":"ILP Approaches to the blockmodel problem.","authors":[],"date":"2007","doi":null,"raw":null,"cites":null},{"id":685805,"title":"Diversity and dissimilarity coefficients: a unified approach.","authors":[],"date":"1982","doi":null,"raw":null,"cites":null},{"id":685806,"title":"Cluster analysis and mathematical programming.","authors":[],"date":"1971","doi":null,"raw":null,"cites":null},{"id":685807,"title":"On the measures of entropy and information.","authors":[],"date":"1961","doi":null,"raw":null,"cites":null},{"id":685808,"title":"A mathematical theory of communication.","authors":[],"date":"1948","doi":null,"raw":null,"cites":null},{"id":685809,"title":"Measurement of diversity.","authors":[],"date":"1949","doi":null,"raw":null,"cites":null},{"id":685810,"title":"Economics and Information Theory.","authors":[],"date":"1967","doi":null,"raw":null,"cites":null},{"id":685811,"title":"Improving dynamic programming strategies for partitioning.","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":685812,"title":"Integer programming and the theory of grouping.","authors":[],"date":"1969","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-09-01","abstract":"Clustering objects into groups is usually done using a statistical heuristic or an optimisation. The method depends on the size of the problem and its purpose. There may exist a number of partitions which do not differ significantly but some of which may be preferable (or equally good) when aspects of the problem not formally contained in the model are considered in the interpretation of the result. To decide between a number of good partitions they must first be enumerated and this may be done by using a number of different heuristics. In this paper an alternative method is described which uses an integer linear programming model having the number and size distribution of groups as objectives and the criteria for group membership as constraints. The model is applied to three problems each having a different measure of dissimilarity between objects and so different membership criteria. In each case a number of optimal solutions are found and expressed in two parts: a core of groups, the membership of which does not change, and the remaining objects which augment the core. The core is found to contain over three quarters of the objects and so provides a stable base for cluster definition. \\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/15197.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/8180\/1\/8180.pdf","pdfHashValue":"9a916454bf79760621da9935162122ef758384a8","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n  \n  \n    \n      oai:dro.dur.ac.uk.OAI2:8180<\/identifier><datestamp>\n      2011-05-17T09:03:43Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        An optimising approach to alternative clustering schemes.\\ud\n<\/dc:title><dc:creator>\n        Jessop,  A.<\/dc:creator><dc:description>\n        Clustering objects into groups is usually done using a statistical heuristic or an optimisation. The method depends on the size of the problem and its purpose. There may exist a number of partitions which do not differ significantly but some of which may be preferable (or equally good) when aspects of the problem not formally contained in the model are considered in the interpretation of the result. To decide between a number of good partitions they must first be enumerated and this may be done by using a number of different heuristics. In this paper an alternative method is described which uses an integer linear programming model having the number and size distribution of groups as objectives and the criteria for group membership as constraints. The model is applied to three problems each having a different measure of dissimilarity between objects and so different membership criteria. In each case a number of optimal solutions are found and expressed in two parts: a core of groups, the membership of which does not change, and the remaining objects which augment the core. The core is found to contain over three quarters of the objects and so provides a stable base for cluster definition. \\ud\n<\/dc:description><dc:subject>\n        ILP<\/dc:subject><dc:subject>\n         Multicriteria<\/dc:subject><dc:subject>\n         Statistics<\/dc:subject><dc:subject>\n         Cluster.<\/dc:subject><dc:publisher>\n        Springer<\/dc:publisher><dc:source>\n        Central European journal of operations research, 2010, Vol.18(3), pp.293-309 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2010-09-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:8180<\/dc:identifier><dc:identifier>\n        issn:1435-246X<\/dc:identifier><dc:identifier>\n        issn: 1613-9178 <\/dc:identifier><dc:identifier>\n        doi:10.1007\/s10100-009-0111-5<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/8180\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1007\/s10100-009-0111-5<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/8180\/1\/8180.pdf<\/dc:identifier><dc:rights>\n        The original publication is available at www.springerlink.com\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1613-9178","issn:1435-246X","1435-246x"," 1613-9178"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":["ILP","Multicriteria","Statistics","Cluster."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n17 May 2011\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nJessop, A. (2010) ’An optimising approach to alternative clustering schemes.’, Central European journal of\noperations research., 18 (3). pp. 293-309.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1007\/s10100-009-0111-5\nPublisher’s copyright statement:\nThe original publication is available at www.springerlink.com\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n1 \n \nAn Optimising Approach to Alternative Clustering Schemes \nAlan Jessop \nDurham Business School, Durham University, Mill Hill Lane, Durham,  DH1 3LB, UK (e-mail: a.t.jessop@durham.ac.uk) \n \n \n \nAbstract \n  \nClustering objects into groups is usually done using a statistical heuristic or an optimisation. The \nmethod depends on the size of the problem and its purpose. There may exist a number of  \npartitions which do not differ significantly but some of which may be preferable (or equally good) \nwhen aspects of the problem not formally contained in the model are considered in the \ninterpretation of the result. To decide between a number of good partitions  they must first be \nenumerated and this may be done by using a number of different heuristics. In this paper an \nalternative method is described which uses an integer linear programming model having the \nnumber and size distribution of groups as objectives and the criteria for group membership as \nconstraints. \nThe model is applied to three problems each having a different measure of dissimilarity \nbetween objects and so different membership criteria.  In each case a number of optimal solutions \nare found and expressed in two parts: a core of groups, the membership of which does not change, \nand the remaining objects which augment the core. The core is found to contain over three quarters \nof the objects and so provides a stable base for cluster definition. \n. \n \nJEL Classification:  C61 \n \nKeywords:  ILP; Multicriteria; Statistics; Cluster \n1 Introduction \nThere are many circumstances in which objects are partitioned into groups: task partitioning, the \nanalysis of social relations, the definition of taxa, and others. Objects which are similar or close \nwill be in the same group. The necessary pairwise relations may be given directly, as when pairs of \npeople in a society are defined as being linked in some way, or each object may be described \naccording to a number of attributes and from these data a measure of the dissimilarity between \neach pair is calculated. In these latter problems the groups are usually called clusters. For the \ndevelopment of our model we consider that a grouping scheme will have four constituents: \n \nd: a measure of pairwise dissimilarity  \nc: a criterion for group membership (based on d) \nn: the number of groups \nu: the unevenness of the size distribution of groups  \n \nThere are a number of measures of dissimilarity (eg. Everitt 1993). Some measure a distance \nbetween a pair of objects based on a number of attributes possessed by each; Euclidean distance, \nfor instance. Other measures describe the distance between pairs of groups, the mean of the \npairwise Euclidean distances. The purpose is to have some metric such that the larger the value the \nless similar are the pair and so the less the justification for including them in the same group. This \nallows object pairs to be defined as either too dissimilar to be grouped or sufficiently similar to \nform candidate groups from which a partition may be formed. \nIt is common that in cluster formation a hierarchical heuristic is used in which, for instance, \nobjects join the nearest cluster until all have been allocated. The process of cluster formation is \n2 \n \ndisplayed as a tree showing the level of dissimilarity at which clusters are formed. In the light of \ncontextual or theoretical considerations this tree is inspected and a decision made  as to the most \nappropriate partition. Once d has been chosen c, n and u are considered together in interpreting the \nresult. This may be a cognitively difficult.  The result is a single partition. Some form of sensitivity \ntesting, by choosing different measures for d say, or by using more than one method to form \nclusters (Kaufman and Rousseeuw 1990) is recommended as a way of exploring alternatives. \nCluster formation is, in this broad sense, interactive. \nTask variety may be reduced by pre-setting the number of groups to n=k (the k-means method). \nThere may be no strong reason for preferring a particular k so that while this method reduces the \nnumber of factors to be considered in interpreting results it requires a corresponding increase in \nsensitivity testing to see the effect of different values of k. Nonetheless, structuring the analysis in \nthis way offers the prospect of easier interpretation of results. \nOptimization has been intermittently proposed for clustering problems using aggregate \ndissimilarity as an objective. For example, we may minimise the sum of squares of intra-cluster \ndissimilarities given appropriate constraints on the number of groups or their size. Clusters are \nformed by the use of mathematical programming methods (Rao 1971; Hansen and Jaumard 1997), \nnotably linear programming (Vinod 1969; Joseph and Bryson 1998) and dynamic programming \n(Jensen 1969; van Osulman 2004). A considerable benefit of optimising approaches is that they \nhave a clear criterion which allows for an assessment of how good optimal and other partitions are \n(Li 2006). This helps the evaluation of alternative partitions. These optimising methods work well \nfor small and medium sized problems but they become infeasible for very large problems for \nwhich other methods such as the application of genetic algorithms are available (Murthy and \nChowdhury 1996; Cowgill, Harvey and Watson 1999; Maulik and Bandyopadhyay 2000; Chiou \nand Lan 2001). However, most published applications of cluster analysis are of moderate size \n(Kettenring 2006) so that optimization methods may find wide application. \nIn this paper it is proposed that a nested set of integer linear programmes (ILPs) having as their \nobjectives the number and size distribution of groups (n and u above) offers a method of aiding \ncluster definition which is easily comprehended and so forms a good basis for interaction. First, \nthe method is described in outline and a measure characteristic of the size distribution is chosen. \nNext, the optimisation models are set out and applied to three illustrative cases. Finally, the results \nare discussed. \n \n2 Method \nWhen the number of groups is fixed in advance (as with the k-means method) the distribution of \nobjects into groups, and so the distribution of group sizes, is found as a result. If there is no \ncompelling reason for specifying some particular number of groups then parsimony of description \nrequires that the minimum number of groups be chosen. When the number of groups satisfactory \nfor a particular problem is not obvious using the minimum number of groups is likely to be a good \nstart. \nTo identify and distinguish between the resulting partitions some judgement about the relative \nsizes of groups may be made: are groups of similar size to be preferred or is it better to identify \nlarge groups, if they exist, with the corresponding reduction in size of the remainder? Given a \nmeasure of the unevenness of the distribution of group sizes an optimum profile can be found.  \nIt is probable that there is more than one allocation of objects to groups which has this optimal \nprofile and these must be found. The ability of an optimising approach easily to generate a number \nof optimal and near-optimal solutions allows the enumeration of alternatives with known \nproperties.  \nCombining these ideas, the outline method is: \n \nstep 1:  set criteria  for group membership \nstep 2:  minimise the number of groups given membership constraints \nstep 3:  optimise the size distribution given constraints of group membership \nand the optimal number of groups \nstep 4: find several optimal (and near-optimal) partitions \nstep 5: interpret and return to step 1 if necessary \n3 \n \n \nTo implement this scheme requires a measure of the unevenness of a distribution of group sizes for \nuse in step 3. \n \n3 Measures of Evenness \nIn a partition m objects are allocated to n groups, the proportion in each group being pi (i = \n1,2…n). The evenness of this distribution may be measured in a number of ways, for instance by \nShannon entropy H = - i pilog(pi) (Shannon 1948) or the Simpson index S  =  i pi\n2\n (Simpson \n1949). The measure G = 1-S is the Gini index, popular as a descriptor of income inequality. Both \nH and G have maxima (Hmax = log(n) and Gmax = (1 – 1\/n) ) when the distribution is even (pi = 1\/n) \nand a minimum of zero when some pi is 1. Though there are other measures of unevenness (Hill \n1973) we restrict comparison to these two. Hill (1973) gives a general index Ia  =  [ i pi\na\n ]\n1\/(1-a)\n of \nwhich three cases are: I0 = n; I1 = exp(H); I2 = 1\/S. In this sense there is a formal relation between \nH and S. The logarithm of Ia is the entropy measure due to Renyi (1961). Other entropy measures \nand their relations to H and S are given in Mayoral (1998), Patil and Taillie (1982), Rao (1982) \nand Peet (1974). \nThere are two considerations which are often used in differentiating H from S: disaggregation \nproperties (Theil 1967) and sampling effects (Magurran 1988; Pielou 1977; Lande 1996; Lande et \nal 1996; Keylock 2005). Neither is relevant in this application but it may still be the case that \nsolutions depend on whether  H or S is used to measure evenness.  \nIn considering the construction of classification trees Breiman et al (1998) used both H and S \namong other measures but found the result to be relatively insensitive to which was used. To \nillustrate this we generate two sets of data for n = 10. First, fifty randomly selected probability \ndistributions and, second, binomial distributions with parameter values from 0.01. The graph of G \n= 1-S against H (Figure 1) shows that the correspondence between these two measures of \nunevenness is very high, certainly one is an excellent proxy for the other. We use the simpler \nmeasure S in what follows. \nFigure 1. Relation between alternative measures of evenness. \n \n0.0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\n0.0 0.5 1.0 1.5 2.0\nG = 1-S\nH\nrandom\nbinomial\n4 \n \n4 Optimal Groups \nIt will be easier to deal with the number in each group, mi , rather than the proportion and so S = \nimi\n2\n and m = imi  will be used in the optimisation. S may be maximised (lumpy size distribution \npreferred) or minimised (even distribution preferred). In what follows S is maximised to identify \nlarge groups if they exist. \nFollowing Jessop (2003) and Proll (2007),  Jessop et al (2007) discuss approaches for this sort \nof optimization and describe two methods useful for moderate sized problems. It was found that if \nthe network density (the proportion of all inter-object relations classed as similar rather than \ndissimilar) was not too high then an approach based on the enumeration of groups is feasible. \nProblems with between 140 and 350 objects and with network densities up to 0.14 were solved in \nthis way. In the networks tested size and density were negatively correlated indicating that for \nsmaller problems higher density networks could be solved. An alternative formulation was \nsuccessful for higher density networks of 100 objects (see also Jessop 2009).  \nIn this paper the method based on enumeration is used. If all possible groups are enumerated it \nis simple to find a set which optimises S. The usual difficulty with enumeration  is that the number \nof groups is too large for this strategy to be practicable, though this depends on network density. \nHowever, in Step 1 criteria for group membership are set, so that only feasible groups need be \nenumerated. For a wide class of problems this renders enumeration a viable method. During the \nenumeration the size of each candidate group and so of mi\n2\n  is retained.  \nThe enumeration ensures that membership criteria are met and that the resulting candidate \ngroups are listed. These are described by a binary matrix, X, in which xij = 1 if object j is in group \ni.  \nCandidate groups are selected via the binary vector  in which i = 1 if group i is chosen. \nThe first ILP (Step 2 above) selects the smallest number of groups such that each object \nappears in exactly one group: \n \nModel 1:  min   i i  =  nmin \ns.t.     i xij i = 1    ; j \n \nSince values of mi\n2\n will have already been found in the enumeration selecting an optimal \nconfiguration is also an ILP: \n \nModel 2:  max S  =  i mi\n2\n  \ns.t. i xij i = 1    ; j \ni i  =  nmin \n \nShould there be any other requirements – minimum or maximum group sizes, for instance – these \ncan easily be incorporated either as constraints in the ILPs or in the enumeration. \nOther solutions are easily found (Step 4) by ensuring that the number of candidate groups \nshared between the current solution and any previous solution is less than nmin. If \n1\n is the first \nsolution found, \n2\n the second, and so on, then the kth solution is found by augmenting Model 2: \n \nModel 3:  max S  =  i mi\n2\n  \ns.t. i xij\nk\ni = 1    ; j \ni \nk\ni  =  nmin \ni \nk\ni \na\ni  <  nmin ;  a = 1…k-1  \n \nThe first few solutions are likely to be alternative optima with increasingly sub-optimal solutions \nfollowing. \nThe method is now applied to three cases, each illustrating a different idea of group \nmembership.  \n \n5 \n \n5 Illustrative Applications \n5.1 Design Network \nA large number of problems can be described by the binary relations between objects. Chermayeff \nand Alexander (1966) described a design problem in which thirty three design requirements for an \nurban area are defined. Requirements were such as arrangements to protect the dwelling from \nlocal noise and safe and pleasant walking and wheeling surfaces. Two requirements interact if \nadopting different solutions for meeting one affects the solutions used in meeting another. The pair \nare dissimilar if they do not interact for we wish to form groups (design tasks) of interacting \nrequirements both to give coherent sub-problems and to minimise inter-task dependency. \n The pairwise interactions form arcs in a network where  lij = 1 if nodes are linked and 0 \notherwise and lii = 1. This Chermayeff and Alexander network has L = i jlij = 373 links and so a \nnetwork density D = L\/m\n2\n = 0.34. \nThe criterion for group membership is that all groups are maximally connected, ie. all group \nmembers are connected to each other. This means that inter-group interactions are minimised so \nthat sub-problems (groups) are as independent as possible. \nThere are 639 candidate groups ranging in size from 1 to 7. Using models 1 and 2 gives nmin = \n9, Smax = 133 and Smin = 123. For Smax  the distribution of group sizes is [6,5,4,4,3,3,3,3,2] and for \nSmin  is [4,4,4,4,4,4,3,3,3].  A measure of the adequacy of the grouping is the proportion of links \ncontained in groups (Gershenson et al 2004): A  =  Smax\/L  =  0.36. \nFigure 2. Design. An optimal partition: m = 33; L = 373; Smax = 133; D = 0.34;  A  =  0.36. (This solution is \nno. 3 in Table 1.) \n \nUsing model 3 gives 12 Smax groups. Figure 2 shows one of these Smax groupings. Rows and \ncolumns are indexed in accord with the original presentation of the problem. Each shaded square \nrepresents a link. The nine maximally connected groups are shown on the diagonal in order of \ndecreasing size. The figure confirms the relatively low value of A in that much of the interaction is \nbetween groups rather than being contained within them, an unsatisfactory partition. However, \nsome further aggregation is possible either by relaxing the maximum density constraint in the \nenumeration of groups or by joining some of the groups which have a high inter-group density, \ngroups 4 and 5 in Figure 2, for instance. \n3 6 7 10 19 29 1 2 13 26 27 12 20 22 23 16 17 24 25 4 11 21 5 28 30 8 9 31 15 18 32 14 33\n3\n6\n7\n10\n19\n29\n1\n2\n13\n26\n27\n12\n20\n22\n23\n16\n17\n24\n25\n4\n11\n21\n5\n28\n30\n8\n9\n31\n15\n18\n32\n14\n33\n1\n2\n3\n4\n5\n6\n7\n8\n9\n6 \n \n \nTable 1. Optimal partitions for the design problem. \n  solutions \n core 1 2 3 4 5 6 7 8 9 10 11 12 \na [3,6,7,10,19,29]             \nb [5,28,30]             \nc [8,9,31]             \nd [12,20,22,23]       13 13 13 13 13 13 \ne [1,2,26,27] 13 13 13 13 13 13       \nf [17,25] 16,24 16,24 16,24 24 24  16,24 16,24 16,24 24 24  \ng [14,33] 15 15  15  15 15 15  15  15 \nh [11,21]  4 4 4,16 4,16 16,24  4 4 4,16 4,16 16,24 \ni [18,32] 4  15  15 4 4  15  15 4 \n28 of the 33 objects appear in the same groups in all twelve solutions. In Table 1 these \ngroupings are shown as the core at the left of the table. Each subsequent column shows a solution. \nA blank entry means that that the core group appears as shown. If numbers are entered then the \ncore group is augmented. For example, solution 1 consists of these groups: \n   \na [3,6,7,10,19,29] \nb [5,28,30] \nc [8,9,31] \nd [12,20,22,23] \ne & 13 [1,2,13,26,27] \nf&16,24 [16,17,24,25] \ng&15 [14,15,33] \nh [11,21] \ni&4 [4,18,32] \nThe structure of the set of optimal solutions is clear. Object 13 may be attached either to core d \nor e and this divides the 12 solutions in two. Each of the sets of six solutions are subdivided in the \nsame way depending on the allocation of the remaining four objects 4, 15, 16, 24. \nIdentifying the core, and so the non-core, aids the final decision as to which partition should be \nadopted. In this case it is clear that the decision is about the disposition of the 5 non-core tasks, a \nsimpler problem than considering all 33. The larger the core the more similar are the alternative \noptima. The proportion of objects in the core C = 28\/33 = 0.85 indicates this. \n \n5.2 Airport Performance \nData on the operating and financial performance of twenty five UK airports were taken from \nCruicksahnk et al (2004). The airports were: \n \n1 Heathrow 14 Belfast International \n2 Gatwick 15 Cardiff International \n3 Stansted 16 London Luton \n4 Southampton 17 Blackpool \n5 Glasgow 18 Bristol \n6 Edinburgh 19 Exeter \n7 Aberdeen 20 Liverpool \n8 Manchester 21 London Biggin Hill \n9 Bournemouth 22 London City \n10 Humberside 23 Norwich \n11 Nottingham East Midlands 24 Southend \n12 Birmingham International 25 Teesside \n7 \n \n13 Newcastle \n \nFrom the data seven performance measures were calculated for each airport: \n \n1. proportion of international passengers \n2. proportion of charter passengers \n3. number of passengers \/ employee \n4. number of passengers \/ air traffic movement \n5. commercial revenue \/ total revenue \n6. commercial revenue \/ passenger \n7. profit (after interest and tax) \/ revenue \n \nThese are measures of the type used to assess airport performance (Graham 2003). In \nbenchmarking and performance analysis it is helpful to group these airports according to their \nperformance profile, the extent to which values on the seven measures are similar.  \nIn dealing with multicriteria problems it is common to scale incommensurable variables to \nsome common metric. Scaling each variable to have a mean 0 and variance 1 is popular for the \npreparation of  tables of  performance measures (for instance, the rankings made by the Financial \nTimes of MBA and other programmes) and is also used in cluster analysis (Hair et al 2006). While \nany such transformation will be to some extent a matter of convenience we choose this because it \nis representative of practice. \nThe similarity between pairs of airports is measured by the correlation, r, of the transformed \nvariables and so 1-r is the measure of dissimilarity between them. \nWe use a simple criterion for group membership, that all objects in a group should be similar to \nsome minimum extent: 1-r < . For illustration we use  = 0.5 and find that nmin = 10, Smax = 81 \nand Smin = 69. For Smax  the distribution of group sizes is [5,4,4,3,2,2,2,1,1,1] and for Smin  is \n[4,3,3,3,3,2,2,2,2,1].  \n \nFigure 3. Airports. An optimal partition: m = 25; L = 121; Smax = 81; D = 0.19;  A  =  0.67.  (Solution 2 in \nTable 2.) \n10 19 21 24 25 1 3 16 20 11 13 15 18 5 6 14 2 8 17 9 23 7 22 12 4\n10\n19\n21\n24\n25\n1\n3\n16\n20\n11\n13\n15\n18\n5\n6\n14\n2\n8\n17\n9\n23\n7\n22\n12\n4 10\n1\n9\n2\n3\n4\n5\n6\n7\n8\n8 \n \n  \n \nTable 2. Optimal partitions for the airport problem. \n  solutions max \n core 1 2 3 4 1-r \na [10,19,21,24,25]     0.48 \nb [1,3,16,20]     0.25 \nc [11,13,15,18]     0.40 \nd [5,6,14]     0.32 \ne [2,8]     0.38 \nf [17]     n\/a \ng  9,23 9,23 4,9 4,9  \nh  12,22 7,22 12,22 7,22  \ni  4 4 7 12  \nj  7 12 23 23  \n (1-r) for  row g 0.17 0.17 0.48 0.48  \n (1-r)  for  row h 0.36 0.23 0.36 0.23  \nAn optimal result is shown in Figure 3 and all four optimal solutions in Table 2. Unlike the \ndesign case the core groups appear unaugmented in all four optimal partitions and account for 19 \nairports. The remaining six airports appear in various combinations (two pairs and two singletons) \nas shown in rows g to j. In the design case all that could be done was to present alternative \nsolutions as an aid to a final partitioning. In this case a further guide is possible by examining the \nmaximum values of 1-r for each group. The values for the core are shown at the right, but since \nthe core groups are unaugmented these maxima do not help to differentiate between solutions. The \nlast two rows show 1-r values for the non-core groups. If there are no other considerations it \nmakes sense to prefer the solution for which these values are smallest, in this case solution 2. \n \n5.3 MBA  Programmes \nPaucar-Caceres and Thorpe (2005) analysed the structure of  32 full-time UK MBA programmes \naccording to the subjects covered in core and elective courses. The MBAs were offered at the \nfollowing business schools: \n \n1 Aberdeen 12 De Montfort 23 London \n2 Ashridge 13 Durham 24 Manchester \n3 Aston 14 Edinburgh 25 Middlesex \n4 Bath 15 Exeter 26 Newcastle \n5 Birmingham 16 Glasgow 27 Nottingham \n6 Bradford 17 Henley 28 Oxford \n7 Bristol 18 Imperial 29 Strathclyde \n8 Brunel 19 Kingston 30 Wales \n9 Cambridge 20 Lancaster 31 Warwick \n10 City 21 Leeds 32 Westminster \n11 Cranfield 22 Leicester   \n \nand the core modules were \n \n1 e-business 11 management development \n2 entrepreneurship 12 microeconomics \n3 ethics 13 management information systems \n4 finance 14 marketing management \n5 financial accounting 15 management science \n9 \n \n6 general management 16 operations management \n7 human resource management 17 organisational behaviour \n8 international business 18 project management \n9 macroeconomics 19 statistics \n10 management accounting 20 strategy \n \nA features matrix Y encodes which of the 20 core subjects were offered at each programme:  yij \n= 1 if programme i has core subject j and zero otherwise. Programmes varied, offering between 3 \nand 15 of the twenty subjects. Programmes are similar to the extent that they offer the same \nmodules, specifically that group members should all share some minimum number, , of core \nsubjects.  \nWith  = 5 the results of the optimisation are: nmin = 15, Smax = 170 and Smin = 82; for Smax  the \ndistribution of group sizes is [11,5,3,2,1,1,1,1,1,1,1,1,1,1,1] and for Smin  is \n[4,3,3,3,3,3,2,2,2,2,1,1,1,1,1]. 29 of the 32 programmes are in the core, as shown in Table 3. \nThe result is also shown in Figure 4. Figures 2 and 3 showed links between similar objects. \nFigure 4, on the other hand, shows which modules are offered by each programme. The rows \n(programmes) are ordered in the blocks shown in Table 3. The columns (modules) are ordered to \nemphasise the extent to which programmes have modules in common. \nIt is no surprise that a large fraction of programmes are clustered together because they share \nsome core modules, the largest group having a focus on operations and strategy and the next \nlargest a focus on softer topics such as management development and ethics. The large number of \nsingletons is at first more surprising but the diagram shows the sparseness of shared features. Of \nthe ten  singletons (rows c to m in Table 3) five possess fewer than  = 5 of the core modules, two \nhave exactly 5, two have 6 and the remaining one has 7. The presence of the ten singletons is a \nresult of setting  = 5; different values could be tried.  \n \n \n \nFigure 4. Features of MBA core programmes. \n \n10 \n \n \n \nTable 3. Optimal partitions for the MBA problem. \n  solutions \n core 1 2 3 \na [4,6,7,11,12,15,23,24,27,28,30]    \nb [18,20,22,25,31]    \nc [2]    \nd [3]    \ne [5]    \nf [8]    \nh [13]    \ni [14]    \nj [16]    \nk [21]    \nl [29]    \nm [32]    \nn [17,19]  10 10 \no [9] 1,10 26 1 \np  26 1 26 \n \n6 Comparison with Other Clustering Algorithms \nWhile the method used here is different from the usual heuristic clustering algorithms it is of \ninterest to compare the results found by both. For this the Airport data are used with r as the \ndistance measure. Six algorithms were used. One of these, centroid clustering, gave the same \nresults as that recommended above, Figure 3 and solution 2 in Table 2. The dendrogram for the \ncentroid clustering is shown in Figure 5. The core groups, a – e, are indicated on the tree and the \nnon-core pairs, (9,23) and (7,22) shown by braces to the left of the diagram. \n \n \n Figure 5. Dendrogram for centroid clustering \n \n \n \n \n \n \n \n \n \n \n \n \n \n              3    \n             16                   \n              1                         \n             20                                   \n              7                            \n             22                      \n             12                             \n             11                            \n             18                                     \n             13                           \n             15                                    \n              2                      \n              8                                  \n              5                                    \n             14                                  \n              6                                     \n             21                           \n             25                              \n             10                                 \n             19                                \n             24                         \n              9           \n             23                               \n              4    \n             17   \nb \nc \na \nd \ne \nf \n11 \n \n \nThree of the other methods – complete linkage, single linkage and average linkage (between \ngroups) – gave similar results, one of which is shown as Figure 6. The differences are that group e \nsplits with airport 2 joining b and airport 8 joining d. Airport 6 is detached from the original group \nd. The result is clusters (c+d+8) and (b+2) together with a and f. Group e disappears. \nThis rearrangement is not surprising given the links shown in Figure 3: groups c and d have a \nhigh inter-group density of connection; airport 8 is linked to two of the three members of d and \none of the four of c; airport 2 is linked to three of the four members of b. \nThe results from the other two methods – median and average distance (within groups) – have \nthe additional aggregation of airports 9 and 23 with group a earlier in the aggregation process than \nshown in Figure 6. Again, this is consistent with the links shown in Figure 3. \nFigure 3 shows not just the groups but also the inter-group links. For common problems of \nmoderate size, such as those shown here, high overlaps can easily be seen and decisions on \nreallocation taken. For example, airport 2 is Gatwick which is linked with the three other London \nairports in b as well as with the largest airport outside London, Manchester, in e. Similarly, group \nd has the main Scottish airports, Glasgow and Edinburgh, plus Belfast. These might be seen as \nsimilar to the larger regional airports in group c or, perhaps, with Cardiff airport (number 15) \nmight be part of d, a group of British but not English airports. \nResolution and final allocation depend on the context and purpose of the analysis. The \ndendrograms associated with different clustering heuristics give alternative allocations, as \ndiscussed above. Diagrams such as Figure 3 show the full set of similarities and are readily \nsuggestive of ambiguities and possible regrouping. \n \n  \nFigure 6. Dendrogram for complete linkage clustering \n \n \n \n \n \n \n \n \n \n \n \n7 Discussion \nA method is given for generating alternative partitions which uses a dissimilarity metric to impose \nconstraints on group membership, and then uses the number and size distribution of groups as the \nobjectives in ILP optimisations.  \n  3    \n 16     \n  1     \n 20           \n  2               \n  4                           \n 17                                   \n  9                         \n 23                            \n 21                                       \n 25                           \n 10                                         \n 19                                              \n 24                                         \n  7                                     \n 22                \n 12                                    \n  5                                     \n 14                            \n  8                 \n 13           \n 15             \n 11         \n 18         \n  6   \na \nb \nc \nd \ne \nf \nc+d+8 \nb+2 \n12 \n \nIt is a criticism sometimes levelled at cluster analysis (eg. Barney and Hoskisson 1990) that it \nwill always produce clusters whatever the data and that because of this does not provide results \nwith much meaning. Specifying group membership criteria as constraints when enumerating \ncandidate groups overcomes this objection, for if the criterion is not met then no groups will be \nformed. This is seen in the large number of singletons in the MBA problem. This resolution of the \ninevitability of cluster formation comes at a price, that of having explicitly to specify the criteria of \ngroup membership a priori rather than making some post hoc judgement. The initial specification \ncan, of course, be revised and the model rerun. The contention is that it is more straightforward to \nuse the number and size distribution of groups as objectives in the ILPs and so leave the criteria \nfor group membership as parameters to be altered in sensitivity testing runs of the models. \nMembership criteria are likely to be more dependent on views taken of the context and purpose of \nthe analysis and so forcing an a priori specification (just what do we mean by “similar”?) will \nencourage a thoughtful engagement with the problem. \n Table 4. Summary of the three illustrative cases. \n Illustrative application \n 1. Design network 2. Airports 3. MBAs \nno. of objects - m 33  25  32  \nno. of links - L 373  121  n\/a  \nnetwork density - D 0.34  0.19  n\/a  \nno. of candidate groups  639  118  3861  \nnmin 9  10  15  \nSmax 133  81  170  \nSmin 123  69  82  \nno.  of optimal groups 12  4  3  \nproportion of links  in groups - A 0.36  0.67  n\/a  \nproportion of objects  in core - C 0.85  0.76  0.91  \nTable 4 summarises the three cases. The descriptors permit an appreciation of the feasibility \nand usefulness of the partition. First, A  shows how satisfactory the partition is as a system \ndescription. The differences between the design and airport illustrations show this. The usefulness \nof the partition in the design case is poor but that for the airports is good. Second, the relative size \nof the core, C,  shows the stability or robustness of the optimal partitions. In the three cases C  is \nquite high (at least 0.76) showing that decisions between alternative optimal partitions is a matter \nof considering only the disposition of at most 24% of the objects. Third, the difference between \nSmax and Smin is a subsidiary indicator of the extent to which the optimal partitions are superior. \nBecause the number of objects was not large the optimisation problems were easily solved by \nenumeration even though the network density was as high as 0.34. This confirms the speculation \nmade in Section 4 of the negative correlation between size and density for problems solvable by \nthis method. \nFinding an acceptable partition is a decision problem. The method proposed in this paper \nemphasises this by enumerating a number of alternative partitions and providing indicators to help \ncomparison between them. In addition, the identification of core groups means that judgement is \nexercised on the relatively smaller problem of the disposition only of non-core objects. The larger \nthe core the easier this will be and the more robust the result. \n \nReferences \n[1] Barney JB, Hoskisson RE (1990)  Strategic groups: untested assertions and research proposals. \nManagerial and Decision Economics 11, 187–198.  \n[2] Breiman L, Friedman JH, Olshen RA, Stone CJ (1998) Classification and Regression Trees. CRC, Boca \nRaton, Ch 4. \n13 \n \n[3] Chermayeff S, Alexander C (1966) Community and Privacy: Towards a New Architecture of \nHumanism. Penguin, Harmondsworth. \n[4] Chiou Y-C,Lan LW (2001) Genetic clustering algorithms. European Journal of Operational Research  \n135, 413 427. \n[5] Cowgill MC, Harvey RJ, Watson LT (1999) A genetic algorithm approach to cluster analysis. \nComputers and Mathematics with Applications 37, 99 108. \n[6] Cruicksahank A, Flanagan P, Marchant J (2004) Airport Statistics 2003\/2004. University of Bath \nCentre for the Study of Regulated Industries, Bath. \n[7] Everitt BS (1993) Cluster Analysis (Third edn.). Arnold, London, Ch 3. \n[8] Gershenson JK, Prasad GJ,  Zhang Y (2004) Product modularity: measures and design methods. Journal \nof Engineering Design 15, 33-51. \n[9] Graham A (2003) Managing Airports; An International Perspective, 2nd edn. Elsevier, Oxford. \n[10] Hair JF, Black WC, Babin BJ, Anderson RE, Tatham RL (2006) Multivariate Data Analysis (Sixth \nedn.). Pearson Prentice Hall, Upper Saddle River NJ, p579. \n[11] Hansen P, Jaumard B (1997) Cluster analysis and mathematical programming. Mathematical \nProgramming 79, 191 215. \n[12] Hill MO (1973) Diversity and evenness: a unifying notation and its consequences. Ecology 54, \n427 432. \n[13] Jensen RE (1969) A dynamic programming algorithm for cluster analysis. Operations Research 17, \n1034 1057.  \n[14] Jessop A (2003) Blockmodels with maximum concentration. European Journal of Operational Research \n148, 53 64.  \n[15] Jessop A (2009) A multicriteria blockmodel for performance assessment. Omega 37, 204–214. \n[16] Jessop A, Proll L, Smith BM (2007) Optimal Cliques: applications and solutions. University of Leeds, \nSchool of computing, Research Report 2007.03, 2007. \n (available via  http:\/\/www.comp.leeds.ac.uk\/research\/pubs\/reports\/2007\/2007_03.pdf ) \n[17] Joseph A, Bryson N  (1998) Parametric linear programming and cluster analysis. European Journal of \nOperational Research 111, 582 588.  \n[18] Kaufman L, Rousseeuw PJ (1990) Finding Groups in Data: An Introduction to Cluster Analysis. Wiley, \nNew York, p37. \n[19] Kettenring JR (2006) The practice of cluster analysis. Journal of Classification 23, 3 30. \n[20] Keylock CJ  (2005) Simpson diversity and the Shannon-Weiner index as special cases of generalised \nentropy. Oikos 109, 203 207. \n[21] Lande R (1996) Statistics and partitioning of species diversity, and similarity among multiple \ncommunities. Oikos 76, 5 13. \n[22] Lande R, Engen S, Sæther B-E (2003) Stochastic Population Dynamics in Ecology and Conservation. \nOxford University Press, Oxford, Ch 7. \n[23] Li B (2006) A new approach to cluster analysis: the clustering-function-based method. Journal of the \nRoyal Statistical Society B 68, 457 476.  \n[24] Magurran AE (1988) Ecological Diversity and its Measurement. Princeton University Press, Princeton \nNJ., Table 4.5. \n[25] Maulik U, Bandyopadhyay S (2000) Genetic algorithm-based clustering technique. Pattern Recognition \n33, 1455 1465. \n[26] Mayoral MM (1998) Renyi’s entropy as an index of diversity in simple-stage cluster sampling. Journal \nof Information Sciences 105, 101 114. \n[27] Murthy CA, Chowdhury N (1996) In search of optimal clusters using genetic algorithms. Pattern \nRecognition Letters 17, 825 832.  \n[28] Patil GP, Taillie C (1982) Diversity as a concept and its measurement. Journal of the American \nStatistical Association 77, 548–561. \n[29] Paucar-Caceres A, Thorpe R (2005) Mapping the structure of MBA programmes: a comparative study \nof the structure of accredited AMBA programmes in the United Kingdom. Journal of the Operational \nResearch Society 56, 25–38.  \n[30] Peet RK (1974) The measurement of species diversity. Annual Review of Ecology and Systematics 5,  \n285–307.    \n[31] Pielou EC (1977) Mathematical Ecology. Wiley, New York.   \n[32] Proll L (2007) ILP Approaches to the blockmodel problem. European Journal of Operational Research \n177, 840 850. \n[33] Rao CR (1982) Diversity and dissimilarity coefficients: a unified approach. Theoretical and Population \nBiology 21, 24–43. \n[34] Rao MR (1971) Cluster analysis and mathematical programming.  Journal of the American Statistical \nAssociation 66, 622 626.  \n[35] Renyi A (1961) On the measures of entropy and information. In: Proceeding of the Fourth Berkely \nSymposium on Mathematics, Statistics and Probability, Volume 1, pp 547 561. \n14 \n \n[36] Shannon CE (1948) A mathematical theory of communication. Bell Systems Technical Journal 27, 379–\n423, 623–656. [Reprinted in Shannon CE, Weaver W (1949) The Mathematical Theory of \nCommunication. University of Illinois Press, Urbana.] \n[37] Simpson EH (1949) Measurement of diversity. Nature 163, 688. \n[38] Theil H (1967) Economics and Information Theory. North-Holland, Amsterdam, appendices to \nChapters 4 and 8. \n[39] van Os BJ, Meulman JJ (2004)  Improving dynamic programming strategies for partitioning. Journal of \nClassification 21, 207 230. \n[40] Vinod HD (1969) Integer programming and the theory of grouping. Journal of the American Statistical \nAssociation 64, 506 519.  \n \n \n \n \n \n"}