{"doi":"10.1103\/PhysRevA.65.053607","coreId":"66464","oai":"oai:dro.dur.ac.uk.OAI2:1393","identifiers":["oai:dro.dur.ac.uk.OAI2:1393","10.1103\/PhysRevA.65.053607"],"title":"Quantum field theory of dilute homogeneous Bose-Fermi mixtures at zero temperature : general formalism and beyond mean-field  corrections.","authors":["Albus, A. P.","Gardiner, S. A.","Illuminati, F.","Wilkens, M."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2002-04","abstract":"We consider a dilute homogeneous mixture of bosons and spin-polarized fermions at zero temperature. We first construct the formal scheme for carrying out systematic perturbation theory in terms of single particle Green’s functions. We especially focus on the description of the boson-fermion interaction. To do so we need to introduce the renormalized boson-fermion T matrix, which we determine to second order in the boson-fermion s-wave scattering length. We also discuss how to incorporate the usual boson-boson T matrix in mean field approximation to obtain the total ground-state properties of the system. The next-order term beyond mean field stems from the boson-fermion interaction and is proportional to aBFkF. The total ground-state energy density to this order is the sum of the kinetic energy of the free fermions, the boson-boson mean-field interaction, the usual mean-field contribution to the boson-fermion interaction energy, and the first boson-fermion correction beyond mean field. We also compute the bosonic and the fermionic chemical potentials, the compressibilities, and the modification to the induced fermion-fermion interaction. We discuss the behavior of the total ground-state energy and the importance of the correction beyond mean field for various parameter regimes, in particular considering mixtures of 6Li and 7Li and of 3He and 4He. Moreover, we determine the modification of the induced fermion-fermion interaction due to the effects beyond mean field. We show that there is no effect on the depletion of the Bose condensate to first order in the boson-fermion scattering length aBF","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66464.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/1393\/1\/1393.pdf","pdfHashValue":"86824ee5d2cdac56694cde2b5ad4db0e0baaaa3c","publisher":"American Physical Society","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:1393<\/identifier><datestamp>\n      2010-10-19T09:58:05Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Quantum field theory of dilute homogeneous Bose-Fermi mixtures at zero temperature : general formalism and beyond mean-field  corrections.<\/dc:title><dc:creator>\n        Albus, A. P.<\/dc:creator><dc:creator>\n        Gardiner, S. A.<\/dc:creator><dc:creator>\n        Illuminati, F.<\/dc:creator><dc:creator>\n        Wilkens, M.<\/dc:creator><dc:description>\n        We consider a dilute homogeneous mixture of bosons and spin-polarized fermions at zero temperature. We first construct the formal scheme for carrying out systematic perturbation theory in terms of single particle Green’s functions. We especially focus on the description of the boson-fermion interaction. To do so we need to introduce the renormalized boson-fermion T matrix, which we determine to second order in the boson-fermion s-wave scattering length. We also discuss how to incorporate the usual boson-boson T matrix in mean field approximation to obtain the total ground-state properties of the system. The next-order term beyond mean field stems from the boson-fermion interaction and is proportional to aBFkF. The total ground-state energy density to this order is the sum of the kinetic energy of the free fermions, the boson-boson mean-field interaction, the usual mean-field contribution to the boson-fermion interaction energy, and the first boson-fermion correction beyond mean field. We also compute the bosonic and the fermionic chemical potentials, the compressibilities, and the modification to the induced fermion-fermion interaction. We discuss the behavior of the total ground-state energy and the importance of the correction beyond mean field for various parameter regimes, in particular considering mixtures of 6Li and 7Li and of 3He and 4He. Moreover, we determine the modification of the induced fermion-fermion interaction due to the effects beyond mean field. We show that there is no effect on the depletion of the Bose condensate to first order in the boson-fermion scattering length aBF.<\/dc:description><dc:subject>\n        Einstein condensation<\/dc:subject><dc:subject>\n         HE-3-HE-4 mixtures<\/dc:subject><dc:subject>\n         Atomic gas<\/dc:subject><dc:subject>\n         Superfluidity<\/dc:subject><dc:subject>\n         Degeneracy<\/dc:subject><dc:subject>\n         Collisions.<\/dc:subject><dc:publisher>\n        American Physical Society<\/dc:publisher><dc:source>\n        Physical review A, 2002, Vol.65(5), pp.053607 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2002-04<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:1393<\/dc:identifier><dc:identifier>\n        issn:1050-2947<\/dc:identifier><dc:identifier>\n        issn: 1094-1622<\/dc:identifier><dc:identifier>\n        doi:10.1103\/PhysRevA.65.053607<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1393\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1103\/PhysRevA.65.053607<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1393\/1\/1393.pdf<\/dc:identifier><dc:rights>\n        © 2002 by The American Physical Society. All rights reserved.<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1050-2947"," 1094-1622","1050-2947","issn: 1094-1622"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2002,"topics":["Einstein condensation","HE-3-HE-4 mixtures","Atomic gas","Superfluidity","Degeneracy","Collisions."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n01 July 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nAlbus, A. P. and Gardiner, S. A. and Illuminati, F. and Wilkens, M. (2002) ’Quantum field theory of dilute\nhomogeneous Bose-Fermi mixtures at zero temperature : general formalism and beyond mean-field\ncorrections.’, Physical review A., 65 (5). 053607.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1103\/PhysRevA.65.053607\nPublisher’s copyright statement:\n2002 by The American Physical Society. All rights reserved.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nQuantum field theory of dilute homogeneous Bose-Fermi mixtures at zero temperature:\nGeneral formalism and beyond mean-field corrections\nA. P. Albus,1 S. A. Gardiner,1,2 F. Illuminati,3,4 and M. Wilkens1\n1Institut fu¨r Physik, Universita¨t Potsdam, D-14469 Potsdam, Germany\n2Institut fu¨r Theoretische Physik, Universita¨t Hannover, D-30167 Hannover, Germany\n3Dipartimento di Fisica, Universita` degli Studi di Salerno, I-84081 Baronissi (Sa), Italy\n4Istituto Nazionale per la Fisica della Materia, Unita` di Salerno, Baronissi (Sa), Italy\n~Received 20 December 2001; published 26 April 2002!\nWe consider a dilute homogeneous mixture of bosons and spin-polarized fermions at zero temperature. We\nfirst construct the formal scheme for carrying out systematic perturbation theory in terms of single particle\nGreen’s functions. We especially focus on the description of the boson-fermion interaction. To do so we need\nto introduce the renormalized boson-fermion T matrix, which we determine to second order in the boson-\nfermion s-wave scattering length. We also discuss how to incorporate the usual boson-boson T matrix in mean\nfield approximation to obtain the total ground-state properties of the system. The next-order term beyond mean\nfield stems from the boson-fermion interaction and is proportional to aBFkF . The total ground-state energy\ndensity to this order is the sum of the kinetic energy of the free fermions, the boson-boson mean-field\ninteraction, the usual mean-field contribution to the boson-fermion interaction energy, and the first boson-\nfermion correction beyond mean field. We also compute the bosonic and the fermionic chemical potentials, the\ncompressibilities, and the modification to the induced fermion-fermion interaction. We discuss the behavior of\nthe total ground-state energy and the importance of the correction beyond mean field for various parameter\nregimes, in particular considering mixtures of 6Li and 7Li and of 3He and 4He. Moreover, we determine the\nmodification of the induced fermion-fermion interaction due to the effects beyond mean field. We show that\nthere is no effect on the depletion of the Bose condensate to first order in the boson-fermion scattering length\naBF .\nDOI: 10.1103\/PhysRevA.65.053607 PACS number~s!: 03.75.Fi, 03.70.1k , 01.55.1b\nI. INTRODUCTION\nFollowing the spectacular success in achieving Bose-\nEinstein condensation in trapped, dilute atomic gases in 1995\n@1–3#, there has been an explosion of experimental and the-\noretical activity on this newly accessible state of matter ~for\nrecent reviews focusing on different experimental and theo-\nretical aspects, see, for instance, Refs. @4–8#!. More recently,\nthere has been increasing interest and experimental activity\nalso in quantum-degenerate ultracold Fermi gases @9–14#, in\nparticular because of the possibility of observing a BCS type\ntransition in a dilute atomic gas @15,16#. Dilute mixtures of\nultracold gases of bosonic and fermionic atoms are also re-\nceiving increased attention, in particular because sympathetic\ncooling of the fermions by the bosons is an important means\nof their achieving quantum degeneracy @11–14#, and also\nbecause bosons can mediate an induced ~attractive! fermion-\nfermion interaction @17#. Moreover, mixtures of atomic 3He\nand 4He have become interesting in their own right after the\nrecent achievement of Bose-Einstein condensation in meta-\nstable 4He @18,19#, as they could represent a bridge toward\nthe understanding of superfluidity in helium.\nCurrent analyses of dilute mixtures of ultracold atomic\nboson and fermion vapors are based on mean-field approxi-\nmations. They include, for example, the work on stability\nconsiderations for homogeneous systems by Viverit et al.\n@17#, and the calculation of density distributions and phase\nseparation of trapped mixtures by Nygaard and Mo\u0094lmer @20#.\nSome interesting effects have been studied by Bijlsma et al.\n@21#, where an effective modification of the fermion-fermion\nscattering length, mediated by boson-fermion scattering pro-\ncesses, was determined. Pu et al. have determined the pho-\nnon spectrum of the Bose condensate in a boson-fermion\nmixture at zero temperature @22#.\nMean-field approaches have proved to be extremely use-\nful in the theoretical and experimental study of Bose-\nEinstein condensed dilute atomic gases, and are likely to\nprove similarly useful for quantum-degenerate mixed boson-\nfermion systems. It is nevertheless desirable to consider ef-\nfects beyond mean field, and under what circumstances they\nare likely to be most relevant. For pure ~unpolarized! fer-\nmion @23–25# and pure boson @24–31# systems, expansions\nof the ground-state energy, in terms of the small parameters\nkFaFF and AnBaBB3 (kF is the Fermi wave number, nB the\nboson density, and aFF and aBB the fermion-fermion and\nboson-boson scattering lengths!, are well established. These\nexpansions go beyond mean-field approximations while still\ndepending only on the s-wave scattering lengths. Although\ndetermined for homogeneous systems, the use of beyond\nmean-field corrections arising from consideration of such ex-\npansions may be readily extended to the experimentally rel-\nevant case of inhomogeneous trapped gases by application of\nthe local density approximation. In general, the corrections\nbeyond mean field for the bosons are smaller than for the\nfermions, since the exponent of the small dimensionless pa-\nrameter n1\/3a (n is the density parameter and a the scattering\nlength! is 1 in the fermion case but 3\/2 in the boson case.\nImportant work on realistic treatments of strongly inter-\nPHYSICAL REVIEW A, VOLUME 65, 053607\n1050-2947\/2002\/65~5!\/053607~15!\/$20.00 ©2002 The American Physical Society65 053607-1\nacting 4He- 3He mixtures has been carried out by exploiting\ncorrelated basis function theory. In this framework the\nground-state energy density can be written as an integral\nover the interaction potential and the correlation functions\n@32,33#. A thorough variational theory of fermion-boson mix-\ntures has then been developed in terms of extended Jastrow-\nFeenberg wave functions that include both pair and triplet\ncorrelation functions. On the other hand, the application of\nfield theoretic and functional methods to mixtures of bosons\nand fermions has been so far almost unexplored. In the case\nof dilute fermions immersed in a Bose gas an expansion of\nthe ground-state energy in terms of the small parameters\nAaBB3 nB and nF \/nB , where nF is the fermion density, was\nperformed by Saam @34#. This was motivated by considering\nquantum-degenerate dilute gases as a model for the behavior\nof superfluid helium, where the assumption of nF \/nB as a\nsmall parameter is justified by the much greater natural oc-\ncurrence of bosonic 4He compared to that of the fermionic\n3He isotope. Considering a regime of low fermion concen-\ntration relative to the boson concentration, Saam neglected\ncorrections of the order of the Fermi wave number to the\nmean-field interaction, while treating the bosons in the Bo-\ngoliubov approximation; in this way, he obtained the correc-\ntions to mean field that are proportional to the bosonic gas\nparameter. Considering a regime of high fermion concentra-\ntion, we instead assume the bosons in the ideal gas approxi-\nmation ~thus neglecting the corrections proportional to the\nbosonic gas parameter!, while treating the boson-fermion in-\nteraction to second order, thus obtaining the corrections to\nmean field that are proportional to the Fermi wave number.\nWe will show in the following that in the case of comparable\nbosonic and fermionic densities, these latter corrections are\nlarger than those obtained by Saam. In particular, we develop\na systematic treatment of the boson-fermion interaction, by\ndetermining the renormalized boson-fermion T matrix to sec-\nond order in the boson-fermion scattering length. In this way\nwe compute the lowest order correction beyond mean field to\nthe ground-state energy density due to the boson-fermion gas\nparameter. This correction is obviously absent in Saam’s\ntreatment, and it is of order 7\/3 in the overall power of the\ncombined bosonic and fermionic densities. On the other\nhand, the lowest Saam’s correction due to the renormalized\nboson-boson interaction is of order 5\/2 in the overall power\nof the combined bosonic and fermionic densities. The cor-\nrection due to the renormalized boson-fermion interaction is\nthen the larger one, and thus the one of greatest relevance for\nthe description of dilute Bose-Fermi mixtures beyond mean\nfield, when both densities are of comparable magnitude, or\nthere are vastly more fermions than bosons. We can in prin-\nciple combine the effects of the renormalization of the\nboson-fermion and boson-boson couplings to compute all the\ncorrections to order 5\/2 ~which will include the ones com-\nputed by Saam by taking into account only the renormalized\nboson-boson interaction!. Work is in progress on the deter-\nmination of the higher-order corrections, and will be reported\nelsewhere.\nWe point out that our results are valid for any ratio of the\nfermionic and bosonic densities. Systems where there are\nvastly more bosons than fermions are certainly experimen-\ntally achievable in dilute atomic gases, and it can in fact be\nadvantageous to have an excess of bosons in order to en-\nhance sympathetic cooling @11#. However, there is in prin-\nciple no a priori reason to confine theoretical analyses to\nsuch systems. In fact, in recent experiments @13,14# the num-\nbers of fermions and bosons are comparable. Thus moti-\nvated, in the present paper, as already anticipated, we derive\na systematic perturbative expansion for the ground-state en-\nergy and other related relevant physical quantities for dilute\nBose-Fermi mixtures at zero temperature and for arbitrary\nratios of the boson and fermion densities. In this way we\ndetermine the lowest-order correction to the mean field in the\ncase of weakly interacting bosons and spin-polarized fermi-\nons in terms of the Bose-Fermi gas parameter kFaBF , where\naBF is the boson-fermion s-wave scattering length. The\nground-state energy thus derived can then be implemented,\nin local density approximation, as the energy functional for\nthe study of the experimentally relevant case of trapped mix-\ntures, in complete analogy with the pure bosonic and pure\nfermionic cases.\nThe plan of the paper is as follows. In Sec. II we intro-\nduce the basic Hamiltonian for a system of interacting\nbosons and spin-polarized fermions, expressed in its grand-\ncanonical form after performing the Bogoliubov replace-\nment. In Sec. III we define the one-particle Green’s functions\nneeded for a systematic field-theoretical analysis of the\nboson-boson and boson-fermion interactions, and we deter-\nmine the associated Feynman rules. In Sec. IV we implement\nthe perturbative expansion by introducing the boson-fermion\nself-energy and the renormalized boson-fermion T matrix in\nthe ladder approximation and by solving the corresponding\nBethe-Salpeter equation to second order in kFaBF . In Sec. V\nwe exploit the results obtained in the previous sections to\ncompute some relevant physical quantities. In particular, we\nprovide the expression for the ground-state energy density to\nsecond order in the gas parameter, the bosonic and fermionic\nchemical potentials, the compressibilities, and the induced\nfermion-fermion interaction. We then compare the results\nthus obtained with actual and foreseeable experimental situ-\nations to assess the relative importance of higher-order cor-\nrections with respect to the mean-field results. In Sec. VI\nconclusions are drawn and some possible future develop-\nments are discussed.\nII. SYSTEM\nA. Hamiltonian and ground-state energy\n1. Many-body Hamiltonian\nWe consider a homogeneous mixture of interacting\nbosons and fermions, imposing periodic boundary conditions\non a volume V. In complete generality there are thus boson-\nboson, boson-fermion, and fermion-fermion interactions to\nconsider. However, for spin-polarized fermions, there is no\ns-wave scattering contribution to the fermion-fermion inter-\naction @35#. The first nonvanishing contribution is due to\np-wave scattering, which can generally be neglected when\ncompared to the boson-boson and boson-fermion interactions\ndue to s-wave scattering. We thus take into account s-wave\nscattering between bosons, and between bosons and fermions\nonly.\nALBUS, GARDINER, ILLUMINATI, AND WILKENS PHYSICAL REVIEW A 65 053607\n053607-2\nIn second-quantized form, the Hamiltonian describing this\nsituation is\nHˆ 5Tˆ B1Tˆ F1Uˆ 1Vˆ , ~1!\nwhere\nTˆ B5\n\\2\n2mB\nE d3x\u0093Fˆ †~x!\u0095\u0093Fˆ ~x!, ~2!\nTˆ F5\n\\2\n2mF\nE d3x\u0093Cˆ †~x!\u0095\u0093Cˆ ~x!, ~3!\nUˆ 5E E d3xd3x8Fˆ †~x!Cˆ †~x8!U~ ux2x8u!Cˆ ~x8!Fˆ ~x!,\n~4!\nVˆ 5\n1\n2E E d3xd3x8Fˆ †~x!Fˆ †~x8!V~ ux2x8u!Fˆ ~x8!Fˆ ~x!,\n~5!\nand where Fˆ (x) is a bosonic field operator, Cˆ (x) is a fermi-\nonic field operator, and mB and mF are the respective masses\nof the bosons and fermions. For later reference we also de-\nfine\nHˆ 05Tˆ B1Tˆ F , ~6!\nWˆ 5Uˆ 1Vˆ . ~7!\n2. Mean-field theory\nIt is straightforward to determine a zero-temperature\nmean-field theory for Hˆ @20#. Employing the well-known\nThomas-Fermi approximation, the mean-field ground-state\nenergy density is\nE\nV 5\n3\n5\n\\2kF\n2\n2mF\nnF1\n2p\\2aBF\nm\nnBnF1\n2p\\2aBB\nmB\nnB\n2\n, ~8!\nwhere m5mFmB \/(mF1mB) is the reduced mass, and kF\n5(6p2nF)1\/3 is the Fermi wave number @36#. In the case of\na pure ~unpolarized! fermionic system, the corrections to the\nground-state energy density beyond the mean field are given\nby @23#\nEF\nV 5\n3\\2kF\n2\n5mF\nnFF11 12815 kFaF1~kFaF!21\u0095\u0095\u0095G . ~9!\nFor pure bosons corrections to the ground state have been\ncalculated by, e.g., Hugenholtz and Pines @28# and by Wu\n@29#. These corrections are obtained via a perturbative ex-\npansion in terms of the bosonic gas parameter AnBaBB3 . As\nalready mentioned, this parameter is in general smaller than\nthe fermionic gas parameter ~see also Sec. V B!. Our goal is\nthus to determine a general expression equivalent to Eq. ~9!,\ntaking into account boson-fermion interactions, while ne-\nglecting corrections proportional to higher powers of the\nbosonic gas parameter.\nB. Bogoliubov replacement and grand-canonical Hamiltonian\nIn order to determine the energy functional to higher order\nthan in Eq. ~8!, we will adopt a perturbative approach using\none-particle Green’s functions, in a way essentially equiva-\nlent to the field-theoretical treatment of pure bosonic and\nfermionic systems @24,25#. We thus first carry out the Bogo-\nliubov replacement @37#, where the condensate bosons are\ntreated as a c-number field:\nFˆ ~x!5An01fˆ ~x!, ~10!\nwhere n05N0 \/V is the condensate density, and N0 is the\nnumber of ~condensate! atoms in the k50 mode. This pre-\nscription breaks particle number conservation ~see @38–41#\nfor alternative Bogoliubov replacements that preserve par-\nticle number conservation!; average particle number conser-\nvation is assured by introducing the grand-canonical Hamil-\ntonian\nKˆ 5Hˆ 2mBNˆ B , ~11!\nwhere mB is a Lagrange multiplier, to be identified with the\nboson chemical potential @25#. Substituting Eq. ~10! into Eq.\n~11!, the grand-canonical Hamiltonian reads\nKˆ 5Kˆ 02mBN01Uˆ 11Uˆ 21Uˆ 31Vˆ 11Vˆ 2\n1Vˆ 31Vˆ 41Vˆ 51Vˆ 61Vˆ 7 , ~12!\nwhere\nKˆ 05\n\\2\n2mB\nE d3x\u0093fˆ †~x!\u0095\u0093fˆ ~x!\n1\n\\2\n2mF\nE d3x\u0093Cˆ †~x!\u0095\u0093Cˆ ~x!2mBE d3xfˆ †~x!fˆ ~x!,\n~13!\nUˆ 15n0E E d3xd3x8Cˆ †~x8!U~ ux2x8u!Cˆ ~x8!, ~14!\nUˆ 25An0E E d3xd3x8Cˆ †~x8!U~ ux2x8u!Cˆ ~x8!fˆ ~x!\n1H.c., ~15!\nUˆ 35E E d3xd3x8fˆ †~x!Cˆ †~x8!U~ ux2x8u!Cˆ ~x8!fˆ ~x!,\n~16!\nVˆ 15\n1\n2 n0\n2E E d3xd3x8V~ ux2x8u!, ~17!\nVˆ 25n0An0E E d3xd3x8V~ ux2x8u!fˆ ~x!1H.c., ~18!\nVˆ 35\n1\n2 n0E E d3xd3x8V~ ux2x8u!fˆ ~x8!fˆ ~x!1H.c.,\n~19!\nQUANTUM FIELD THEORY OF DILUTE HOMOGENEOUS . . . PHYSICAL REVIEW A 65 053607\n053607-3\nVˆ 45n0E E d3xd3x8fˆ †~x!V~ ux2x8u!fˆ ~x8!, ~20!\nVˆ 55n0E E d3xd3x8fˆ †~x!V~ ux2x8u!fˆ ~x!, ~21!\nVˆ 65An0E E d3xd3x8fˆ †~x!V~ ux2x8u!fˆ ~x8!fˆ ~x!1H.c.,\n~22!\nVˆ 75\n1\n2E E d3xd3x8fˆ †~x!fˆ †~x8!V~ ux2x8u!fˆ ~x8!fˆ ~x!.\n~23!\nIII. SYSTEMATIC PERTURBATION THEORY WITH\nGREEN’S FUNCTIONS\nA. Green’s functions: Definitions\nThe boson ~B! and fermion ~F! Green’s functions for the\nboson-fermion system are defined as\niGB~x,t ,x8,t8!5^juT@Fˆ ~x,t !Fˆ †~x8,t8!#uj& , ~24!\niGF~x,t ,x8,t8!5^juT@Cˆ ~x,t !Cˆ †~x8,t8!#uj&, ~25!\nwhere the time argument in Fˆ (x,t) and Cˆ (x,t) means they\nevolve according to Heisenberg’s equations of motion, T de-\nnotes the time ordered product, and uj& is the ground state of\nKˆ ~we similarly define uj0& to be the ground state of Kˆ 0). We\nuse the Bogoliubov replacement to write\niGB~x,t ,x8,t8!5n01iGB8~x,t ,x8,t8!, ~26!\nwhere\niGB8~x,t ,x8,t8!5^juT@fˆ ~x,t !fˆ †~x8,t8!#uj& ~27!\nis the propagator for the noncondensate bosons.\nB. Perturbative expansion\nThe Green’s functions can be evaluated in perturbation\ntheory @25#, where Wˆ is the perturbation to Kˆ 0. Thus\niGB8~x,t ,x8,t8!5\n(\nn50\n‘\niG˜ B\n(n)~x,t ,x8,t8!\n(\nn50\n‘\n^j0uS (n)uj0&\n, ~28!\niGF~x,t ,x8,t8!5\n(\nn50\n‘\niG˜ F\n(n)~x,t ,x8,t8!\n(\nn50\n‘\n^j0uS (n)uj0&\n, ~29!\nwhere\niG˜ B\n(n)~x,t ,x8,t8!5^j0uT@S (n)f˜ ~x,t !f˜ †~x8,t8!#uj0&, ~30!\niG˜ F\n(n)~x,t ,x8,t8!5^j0uT@S (n)C˜ ~x,t !C˜ †~x8,t8!#uj0&, ~31!\nS (n)5\n1\nn! S 2i\\ D\nnE dt1\u0095\u0095\u0095E dtnT@W˜ ~ t1!\u0095\u0095\u0095W˜ ~ tn!# . ~32!\nOperators with a tilde are defined to be in the interaction\npicture, i.e., O˜ (t)5exp(iKˆ 0t\/\\)Oˆ exp(2iKˆ 0t\/\\). In the limit\nof a noninteracting system (Wˆ →0) the Green’s functions\nreduce to the zeroth order terms in the expansions, so that\niGB\n0 ~x,t ,x8,t8!5iG˜ B\n(0)~x,t ,x8,t8!\n5^j0uT@f˜ ~x,t !f˜ †~x8,t8!#uj0&, ~33!\niGF\n0~x,t ,x8,t8!5iG˜ F\n(0)~x,t ,x8,t8!\n5^j0uT@C˜ ~x,t !C˜ †~x8,t8!#uj0&. ~34!\nC. Evaluation of terms using Wick’s theorem\nEquations ~30!, ~31!, and ~32! can be evaluated by Wick’s\ntheorem, which states that the vacuum ~noninteracting\nground-state! expectation values of time ordered products of\noperators can be expressed as the sum of all products of\ncontractions of pairs of operators in the time-ordered product\n@42#. The contraction of two operators is defined as\nO˜ ~ t !(i)P˜ ~ t8!(i)5T@O˜ ~ t !P˜ ~ t8!#2:O˜ ~ t !P˜ ~ t8!: , ~35!\nwhere :O˜ (t)P˜ (t8): is the normal ordered product. In particu-\nlar,\nf˜ ~x,t !(i)f˜ †~x8,t8!(i)5f˜ †~x8,t8!(i)f˜ ~x,t !(i)\n5iGB\n0 ~x,t ,x8,t8!, ~36!\nC˜ ~x,t !(i)C˜ †~x8,t8!(i)52C˜ †~x8,t8!(i)C˜ ~x,t !(i)\n5iGF\n0~x,t ,x8,t8!, ~37!\nand all other contractions of pairs of operators\nP$f˜ (x,t),f˜ †(x8,t8),C˜ (x9,t9),C˜ †(x-,t-)% vanish ~see also\nAppendix A!. Substituting Eqs. ~36! and ~37! into Eqs. ~30!,\n~31!, and ~32!, the first order terms can be determined to be\niG˜ B\n(1)~xm,ym!5\n2i\n\\ E E d4x1md4y1mH U~x1m2y1m!\n3@2n0iGF\n0~y1\nm\n,y1\nm!iGB\n0 ~xm,ym!\n2iGF\n0~y1\nm\n,y1\nm!iGB\n0 ~xm,x1\nm!iGB\n0 ~x1\nm\n,ym!#\n1V~x1\nm2y1\nm!Fn022 iGB0 ~xm,ym!\n1n0iGB\n0 ~xm,x1\nm!iGB\n0 ~x1\nm\n,ym!\n1n0iGB\n0 ~xm,x1\nm!iGB\n0 ~xm,x2\nm!G J , ~38!\nALBUS, GARDINER, ILLUMINATI, AND WILKENS PHYSICAL REVIEW A 65 053607\n053607-4\niG˜ F\n(1)~xm,ym!5\n2i\n\\ E E d4x1md4y1mH U~x1m2y1m!\n3@2n0iGF\n0~y1\nm\n,y1\nm!iGF\n0~xm,ym!\n2n0iGF\n0~xm,y1\nm!iGF\n0~y1\nm\n,ym!#\n1V~x1\nm2y1\nm!\nn0\n2\n2 iGF~x\nm\n,ym!J , ~39!\nS (1)5\n2i\n\\ E E d4x1md4y1mH U~x1m2y1m!@2in0GF0~y1m ,y1m!#\n1V~x1\nm2y1\nm!\nn0\n2\n2 J , ~40!\nwhere we have used the more compact four-vector notation\n@xm5(t ,x)# , and defined U(xm2ym)5U(x2y)d(x02y0)\nand V(xm2ym)5V(x2y)d(x02y0). Note that GB0 (t ,x,t ,y)\n50 ~i.e., there are no boson loops at zero temperature!.\nHigher-order terms may be similarly evaluated, and will\nsimilarly be expressed in terms of integrals over products of\nnoninteracting Green’s functions, condensate factors n0, and\ninteraction terms. We represent these graphically ~see Fig. 1!:\nstraight lines for fermions, wiggly lines for noncondensate\nbosons, dashed lines for condensate bosons, and zigzag lines\nfor interaction terms ~whether it is a boson-boson or boson-\nfermion interaction is clearly determined by the kinds of par-\nticle lines attached to the vertices of the interaction line!.\nAs is usual @24,25,43#, all disconnected graphs in the nu-\nmerator can be factorized out by the denominator, so that\nGB8~xm,ym!5 (\nn50\n‘\nG˜ B\n(n)~xm,ym!connected , ~41!\nGF~xm,ym!5 (\nn50\n‘\nG˜ F\n(n)~xm,ym!connected . ~42!\nNoting that each connected graph essentially appears n!\ntimes, with simple permutations on the labeling, when com-\nposing such graphs we integrate over all internal variables\nand affix a factor of (i\/\\)n(21)F(2i)C, where n is the num-\nber of interaction lines, F is the number of closed fermion\nloops, and C is the number of dashed boson lines.\nD. Feynman rules\nFor homogeneous systems it is convenient to Fourier\ntransform to energy-momentum space, so that\nGB\n0 ~pm!5\n1\np02\\p2\/2mB1mB \/\\1in\n, ~43!\nGF\n0~pm!5\n1\np02\\p2\/2mF1i sgn~p2kF!n\n, ~44!\nwhere sgn(k)51 for k>0 and 521 for k,0 ~we write p\nfor upu). The appropriate Feynman rules for the boson ~fer-\nmion! Green’s function in this representation are then as fol-\nlows.\n~1! Draw all topologically distinct connected diagrams\nwith one outgoing external wiggly boson ~fermion! line and\none incoming external wiggly boson ~fermion! line, no ex-\nternal fermion ~boson! lines and no internal dashed boson\nlines, n zigzag interaction lines, each of which is attached at\none vertex to an incoming and an outgoing boson line ~either\nwiggly or dashed!, and at the other vertex either to an incom-\ning and an outgoing boson line, or to an incoming and an\noutgoing ~not necessarily distinct! fermion line. Each vertex\nmust be attached to exactly one zigzag interaction line.\n~2! All wiggly boson lines must run the same direction\nand there are no closed boson loops.\n~3! Each dashed boson line corresponds to a factor of\nAn0, each wiggly boson line to a factor of GB\n0 (km), each\nfermion line to a factor of GF\n0(km), each boson-fermion in-\nteraction line to a factor of U(km)5U(k), and each boson-\nboson interaction line to a factor of V(km)5V(k).\n~4! Assign a direction to each interaction line; associate a\ndirected four-momentum with each line and conserve four-\nmomentum at each vertex. Each dashed boson line carries\nfour-momentum 0 and each wiggly boson line has four-\nmomentum not equal to 0.\n~5! Integrate over the n independent four-momenta.\n~6! Affix a factor of (i\/\\)n(2p)24(n)(21)F(2i)C, where\nF is the number of closed fermion loops and C is the number\nof dashed boson lines.\nIV. DETERMINATION OF THE BOSON-FERMION T\nMATRIX AND SELF-ENERGIES IN LADDER\nAPPROXIMATION\nA. The Hugenholtz-Pines theorem\nAccording to the Hugenholtz-Pines theorem @28,44#, the\nbosonic chemical potential mB , defined as\n]E\/V\n]nB\n5mB , ~45!\nis given by\nmB5\\SB~0 !2\\S12~0 !, ~46!\nwhere SB(0) and S12(0) are the proper self-energies for the\nbosons due to their interaction with both bosons and fermi-\nFIG. 1. Definition of the diagram lines.\nQUANTUM FIELD THEORY OF DILUTE HOMOGENEOUS . . . PHYSICAL REVIEW A 65 053607\n053607-5\nons, evaluated at pm50 ~in what follows we call them the\nbosonic self-energies!. The self-energies are in general re-\nlated to the Green’s functions by the Dyson equations. The\nDyson equation for the bosons is given by\nS GB8~pm! G12~2pm!G21~pm! GB8~2pm! D\n5S GB0 ~pm! 00 GB0 ~2pm!D 1S GB\n0 ~pm! 0\n0 GB\n0 ~2pm!D\n3S SB~pm! S12~pm!\nS21~pm! SB~2pm!\nD S GB8~pm! G12~pm!G21~pm! GB8~2pm!D ,\n~47!\nwhere we have introduced the anomalous boson Green’s\nfunctions G12(pm) and G21(pm) \u0084defined as the Fourier\ntransforms of G12(xm,ym)5^juT@fˆ (xm)fˆ (ym)#uj& and\nG21(xm,ym)5^juT@fˆ †(xm)fˆ †(ym)#uj&, respectively\u0085. The\nDyson equation for the fermions takes the much simpler sca-\nlar form\nGF~pm!5GF\n0~pm!1GF\n0~pm!SF~pm!GF~pm!, ~48!\nwhere SF(pm) is the proper self-energy for the fermions due\nto the interaction with the bosons ~the fermionic self-energy!.\nB. The self-energies in the ladder approximation\nAs we are considering a dilute system, in terms of Feyn-\nman diagrams only diagrams with interaction lines between\ntwo systems of connected propagators are important @24,25#\n~the ladder approximation!. This is expressed in terms of the\nboson-fermion and boson-boson T matrices in Fig. 2, where\nthe boson-fermion T matrix TBF in the ladder approximation\nis defined in Fig. 3, the boson-boson T matrix TBB ~also in\nthe ladder approximation! is well known from studies of di-\nlute pure Bose systems, and the normal ~diagonal! bosonic\nproper self-energy is given by\nSB~pm!5SBF~pm!1SBB~pm!. ~49!\nThe proper self-energies can thus be determined by add-\ning the proper self-energies of a system of interacting bosons\nto those of a hypothetical mixed boson-fermion system\nwhere there are boson-fermion interactions only @45#. This\nresult arises from our use of the ladder approximation, and is\nnot in general true ~there also exist, for example, inseparable\nthree-legged ‘‘ladders’’ consisting of a boson-boson and a\nboson-fermion ladder joined by a common boson leg, but\nthese clearly describe higher-order processes!. For such a\nhypothetical mixed system, the only self-energies we need to\nconsider and to evaluate are SBF(pm) and SF(pm), which can\nbe written algebraically as\n\\SBF~pm!52\ni\n~2p!4\nE d4kmTBF~pm,km,pm,km!GF0~km!,\n~50!\n\\SF~pm!5TBF~0,pm,0,pm!n0 . ~51!\nC. Bethe-Salpeter equation for TBF\nThe boson-fermion T matrix TBF can also be represented\nrecursively, as shown in Fig. 4. If we now transform to\ncenter-of-mass coordinates,\nPm5p1\nm1p2\nm5p3\nm1p4\nm\n,\nk1\nm5~p1\nm2p2\nm!\/2, ~52!\nk2\nm5~p3\nm2p4\nm!\/2,\nthe algebraic form of the equation represented in Fig. 4 reads\nTBF~k1\nm\n,k2\nm\n,Pm!5U~k12k2!1\ni\n\\~2p!4\nE d3kU~k12k!\n3E dk0GB0 ~Pm\/21km!\n3GF\n0~Pm\/22km!TBF~km,k2\nm\n,Pm!. ~53!\nThis is a kind of Bethe-Salpeter integral equation, which we\nwill now solve recursively for low momenta, stopping at\norder aBF\n2\n. As the interactions are instantaneous, the only\nfrequency dependence in TBF(k1m ,k2m ,Pm) is in P0 @24,25#.\nThus, a contour integration over k0 in Eq. ~53! yields\nFIG. 2. The self-energies in the ladder approximation, expressed\nin terms of the T matrices.\nALBUS, GARDINER, ILLUMINATI, AND WILKENS PHYSICAL REVIEW A 65 053607\n053607-6\nTBF~k1 ,k2 ,Pm!5U~k12k2!1\n1\n~2p!3\nE d3k U~k12k!TBF~k,k2 ,Pm!u~ uP\/22ku2kF!\n\\P02\\2~P\/21k!2\/2mB2\\2~P\/22k!2\/2mF1m1in\n. ~54!\nWe now express Eq. ~54! in terms of the free scattering amplitude f (k1 ,k2), by first formally inverting ~see Ref. @24#!\n2p\\2\nm\nf ~k1 ,k2!5U~k22k1!1\n1\n~2p!3\nE d3kU~k22k!2p\\2 f ~k1 ,k!\/m\n\\2k1\n2\/2m2\\2k2\/2m1in\n, ~55!\nand then exploiting the resulting expression to rewrite Eq. ~54! as\nTBF~k1 ,k2 ,Pm!5\n2p\\2\nm\nf ~k2 ,k1!1\n1\n~2p!3\nE d3k2p\\2\nm\nf ~k,k1!TBF~k,k2 ,Pm!\n3F u~ uP\/22ku2kF!\n\\P02\\2~P\/21k!2\/2mB2\\2~P\/22k!2\/2mF1m1in\n2\n1\n\\2k1\n2\/2m2\\2k2\/2m1inG . ~56!\nFor low momenta the vacuum scattering amplitude f (k1 ,k2) can be expanded to second order in the scattering length aBF ~see\nRef. @25#!:\nf ~k1 ,k2!’aBF2iaBF2 k , ~57!\nwhere k5k15k2→0. We insert this into Eq. ~56!, iteratively substituting Eq. ~56! into itself, and consistently keeping terms\nup to quadratic order in aBF only. This produces\nTBF~k1 ,k2 ,Pm!’\n2p\\2\nm\n@aBF2iaBF\n2 k1#1\n4p2\\4aBF\n2\n~2p!3m2\nE d3k\n3F u~ uP\/22ku2kF!\n\\P02\\2~P\/21k!2\/2mB2\\2~P\/22k!2\/2mF1m1in\n2\n1\n\\2k1\n2\/2m2\\2k2\/2m1inG , ~58!\nFIG. 3. The boson-fermion T matrix.\nFIG. 4. The integral equation for TBF .\nQUANTUM FIELD THEORY OF DILUTE HOMOGENEOUS . . . PHYSICAL REVIEW A 65 053607\n053607-7\nthe renormalized second order expansion of the boson-fermion T matrix. The integral can be evaluated ~see Appendix B! to\ngive\nTBF~k1 ,k2 ,Pm!’\n2p\\2\nm\naBF1\n2\\2aBF\n2 kF\nm\n1\naBF\n2 \\2\n2m2\nS mBkF2P 2 m2PmB 22mAD2 mBDP D lnkF1mP\/mB1AD1in\/2aBFADkF2mP\/mB2AD2in\/2aBFAD\n2\naBF\n2 \\2\n2m2\nS mBkF2P 2 m2PmB 12mAD2 mBDP D ln kF2mP\/mB1AD1in\/2aBkF1mP\/mB2AD2in\/2aBFAD , ~59!\nwhere\nD52\nm\nmB1mF\nP21\n2mP0\n\\\n1\n2mm\n\\2\n. ~60!\nV. PHYSICAL QUANTITIES\nA. Bosonic chemical potential\nSubstituting Eq. ~44! into Eq. ~50! the equation for\nSBF(pm) can be rewritten as\n\\SBF~pm!52\ni\n~2p!4\nE d4qm\n3\nTBF\u0084~p2q!\/2,~p2q!\/2,pm1qm\u0085\nq02\\q2\/2mF1i sgn~q2kF!n\n. ~61!\nTo evaluate this, we substitute Eq. ~58! into Eq. ~61!, and\nfirst carry out the frequency integral. As the pole in the com-\nplex q0 plane of the integrand in Eq. ~58! is below the real\naxis, in order to get a nonvanishing result the pole of @q0\n2\\q2\/2mF2i sgn(q2kF)n#21 must be above the real axis\n(q,kF). The frequency integral is thus readily solved by\ncontour integration. The k integration in Eq. ~58! is then very\nsimilar to that leading to Eq. ~59!. The resulting expression\nfor \\SBF(pm) is then\n\\SBF~pm!5\n1\n~2p!3\nE d3qu~kF2q !\n3TBFS p2q2 ,p2q2 ,S p01 \\q\n2\n2mF\n,p1qD D .\n~62!\nWe wish to similarly solve this integral to second order in\naBF . In Eq. ~59!, all terms that depend on D have a prefactor\naBF\n2\n. Thus, in order to get a result for Eq. ~62! that is correct\nto second order in aBF , it is sufficient to use the zeroth order\nexpression for D. Specializing to the case where pm50 this\ncan be written as\nD05\nmB\n2\n~mB1mF!\n2 q\n2\n. ~63!\nWe now substitute D0 for D in Eq. ~59!, and, after a straight-\nforward ~if lengthy! integration over q, arrive at\n\\SBF~0 !5\n2p\\2aBF\nm\nnFF11 aBFkFp f ~d!G , ~64!\nwhere\nf ~d!512 31d4d 1\n3~11d!2~12d!\n8d2\nln\n11d\n12d , ~65!\nd5(mB2mF)\/(mB1mF), and we have used\n(2p)24*d4kmGF(km)5GF(xm,xm)5inF . Note that in this\nintegration we need only consider the real part of the boson-\nfermion T matrix, as within the range of the integration the\nimaginary part is zero ~see Appendix B!. The necessary ex-\npression for the T matrix is then just given by Eq. ~59!,\nwhere we take the absolute values of the arguments of the\nlogarithms and set n50. From the Hugenholtz-Pines theo-\nrem @Eq. ~46!#,\nmB5\\SBF~0 !1\\SBB~0 !2\\S12~0 !. ~66!\nThus, using the expression for SBF(0) in Eq. ~64!, and the\nresults from Ref. @27# for SBB(0) and S12(0) ~neglecting\ncorrections of the order of the boson gas parameter!,\nmB5\n4p\\2aBB\nmB\nnB1\n2p\\2aBF\nm\nnFF11 aBFkFp f ~d!G . ~67!\nThis is exactly equivalent to adding \\SBF(0) to the standard\nmean-field result for the bosonic chemical potential for a\npure, self-interacting bosonic system.\nB. Ground-state energy density\nTo obtain the ground-state energy we simply integrate Eq.\n~45!:\nE\nV 5E0\nnB\nm~nB4 !dnB41C~nF!, ~68!\nwhere C(nF) is a quantity that can depend on the fermion\ndensity nF only. Considering the limit aBF→0, we see that\nC(nF) can only be the kinetic energy for free fermions ~the\nFermi energy density eF) @25#, that is,\nALBUS, GARDINER, ILLUMINATI, AND WILKENS PHYSICAL REVIEW A 65 053607\n053607-8\nC~nF!5eF5\n3\n5\n\\2kF\n2\n2mF\nnF . ~69!\nSubstituting this and Eq. ~67! into Eq. ~68!, and then inte-\ngrating, gives, finally,\nE\nV 5eF1eB1\n2p\\2aBF\nm\nnFnBF11 aBFkFp f ~d!G , ~70!\nwhere eB52p\\2aBBnB\n2 \/mB is the bosonic mean-field energy\ndensity. Equation ~70! is the main result of this paper, being\nthe desired extension of the mean-field result Eq. ~8!.\nIt is illuminating to describe Eq. ~70! in terms of the di-\nmensionless gas parameters and the dimensionless ratio of\nthe boson and fermion densities:\na5aBFkF , ~71!\nb5AnBaBB3 , ~72!\nh5\nnB\nnF\n, ~73!\nso that\nE\nV 5eFX11 20ph11d H ~12d!S hb6p2D\n2\/3\n1\na\n3p2\nF11 ap f ~d!G J C, ~74!\nThe corrective term to second order in a is proportional to\nthe rather complicated function f (d), defined in Eq. ~65!, of\nthe relative mass ratio d; the value of this function will thus\nvary considerably depending on the masses of the atomic\nspecies used in any given experiment. In Fig. 5 the values for\nmixtures of 6Li and 7Li, and 40K and 87Rb, corresponding to\nreal experimental configurations currently under investiga-\ntion, are plotted, as well as that for a mixture of 3He and\n4He, also a likely candidate for future investigation in ultra-\ncold dilute gas experiments. The value for a hypothetical\nmixture of 3He and 1H is also shown, as it is almost exactly\nthe maximum possible. The function f (d) is always positive\nin the total range @21,1# of variations of d . Note that in the\nlimit mB \/mF→‘ , one has d→1 and f (d)→0. Thus the\nsecond-order correction to the boson-fermion interaction en-\nergy and the total boson-boson interaction energy disappear.\nThis is because if the bosons are infinitely massive ~com-\npared to a fixed, finite fermion mass!, then it is impossible\nfor them to be scattered out of the condensate, and only the\nboson-fermion mean field interaction remains, since all the\nbosons can be treated as the ~condensate! mean field. In the\nopposite limit of mB \/mF→0, the situation is different, be-\ncause of the Pauli exclusion principle.\nIn Fig. 6 we compare the mean-field contributions ~a! and\nsecond-order correction ~b! to the energy functional for a\n6Li,7Li mixture, for a range of values of h . The plots corre-\nspond to a situation where the scattering lengths aBB\n50.2 nm, aBF52.7 nm and the fermion density nF55.1\n31010 cm23 are fixed, and compatible with the experiments\ndescribed in Ref. @14#, while the boson density is varied.\nNote that for any reasonable boson density, the boson gas\nparameter b is indeed very small compared to a . In Fig. 7\nwe do the same for a 3He,4He mixture. In this case the\ninterspecies scattering length is unknown; however, we con-\njecture it to be of the same order of magnitude as the boson-\nboson scattering length. The plots correspond to a situation\nwhere aBB5aBF516 nm, and nF53.131013 cm23. These\nvalues are compatible with current experiments on meta-\nFIG. 5. Plot of f (d), where d5(mB2mF)\/(mB1mF), propor-\ntional to the correction to second order in a5kFaBF to the energy\ndensity functional @Eq. ~74!#. The relevant values of f (d) for mix-\ntures of 3He and 1H, 6Li and 7Li, 3He and 4He, and 40K and\n87Rb are indicated. Quantities are dimensionless.\nFIG. 6. Boson-fermion ~solid\nline! and boson-boson ~dotted\nline! mean-field contributions ~a!\nand second-order correction ~b! to\nthe ground-state energy density of\na 6Li,7Li mixture, in units of eF ,\nto the ground-state energy density\nin units of eF . Parameters are\nnF\n1\/3aBF50.001 and nB\n1\/3aBB\n50.000 135h1\/3, where the di-\nmensionless density ratio h is the\nrunning independent variable.\nQUANTUM FIELD THEORY OF DILUTE HOMOGENEOUS . . . PHYSICAL REVIEW A 65 053607\n053607-9\nstable triplet 4He condensates @18,19#, and are particularly\ninteresting in that the corrections beyond mean field are quite\nlarge ~of the order of 10%!. The true significance of the\nboson-fermion interaction energy correction will of course\ndepend on the actual value of the interspecies scattering\nlength. We notice that if the latter turns out to be about one\norder of magnitude larger than in the pure fermionic and\nbosonic cases ~this is, for instance, what happens for lithium\nmixtures!, then the effect of the correction can be as large as\n50% of the mean-field prediction. Then, of course, correc-\ntions proportional to the boson gas parameter also have to be\ntaken into account.\nC. Other physical quantities, Bose condensate depletion,\nand induced fermion-fermion interaction\nFrom Eq. ~70! we can readily determine the chemical po-\ntential for the fermions mF , defined as\nmF5S ]E\/V]nF D NB ,V , ~75!\nto be\nmF5\n\\2kF\n2\n2mF\n1\n2p\\2aBF\nm\nnBF11 4aBFkF3p f ~d!G . ~76!\nThe pressure reads\nP52S ]E]V D NB ,NF5\n2\n5\n\\2kF\n2\n2mF\nnF1\n2pnB\n2 aBB\\\n2\nmB\n1\n2p\\2aBF\nm\nnFnBF11 4aBFkF3p f ~d!G . ~77!\nWe then obtain the compressibilities, respectively, for the\nbosons,\ncB\n2 5\n1\nmB\nS ]P]nBD NF ,V5\n4pnB\n2 aBB\\\n2\nmB\n2 1\n2p\\2aBF\nmBm\nnF\n3F11 4aBFkF3p f ~d!G , ~78!\nand for the fermions,\ncF\n25\n1\nmF\nS ]P]nFD NB ,V5\n2\n3\n\\2kF\n2\n2mF\n2 1\n2p\\2aBF\nmFm\nnB\n3F11 16aBFkF9p f ~d!G . ~79!\nWe notice that the possible instabilities induced by the mean-\nfield boson-fermion interaction term in the case of a negative\nvalue of aBF are countered by the beyond mean-field correc-\ntion, since the latter is always positive.\nConcerning the structure of the Bose condensate fraction,\nin addition to the known depletion due to the boson-boson\ninteraction, we expect in principle a further contribution to\ndepletion due to the interaction of the bosons with the fermi-\nons. The depletion is computed in a standard way by inte-\ngrating the boson propagator for the noncondensed particles\nGB8 (pm) over the four-momentum. To obtain the boson\npropagator we have to solve the Dyson equation ~47! for\nGB8 (pm). This yields\nGB8~pm!5Fp01 \\p22mB 1SB~2pm!2SB~0 !1S12~0 !G\n3H Fp02 SB~pm!2SB~2pm!2 G2\n2F \\p22mB 2SB~0 !1S12~0 !\n1\nSB~pm!1SB~2pm!\n2 G\n2\n1S12\n2 ~pm!J 21, ~80!\nwhere we have made use of the Hugenholtz-Pines relation.\nThe total diagonal bosonic self-energy SB(pm) picks up a\nboson-boson and a boson-fermion contribution @see Eq.\n~49!#. It can be easily checked that to first order in aBB and in\naBF the total diagonal bosonic self-energy does not depend\non the four-momentum. Therefore the diagonal self-energy\nterms in the boson propagator Eq. ~80! cancel, GB8 (pm) is\nindependent of aBF , and there is no depletion of the Bose\ncondensate due to the fermions to this order, since the con-\ntribution of the fermions to the off-diagonal self-energies\nFIG. 7. Boson-fermion ~solid\nline! and boson-boson ~dotted\nline! mean-field contributions ~a!\nand second-order correction ~b! to\nthe ground-state energy density of\na 3He,4He mixture, in units of eF ,\nto the ground-state energy density\nin units of eF . Parameters are\nnF\n1\/3aBF50.05 and nB1\/3aBB\n50.05h1\/3, where the dimension-\nless density ratio h is the running\nindependent variable.\nALBUS, GARDINER, ILLUMINATI, AND WILKENS PHYSICAL REVIEW A 65 053607\n053607-10\nvanishes anyway in the ladder approximation. The situation\nwill be different to next order in aBF , as in this case the total\ndiagonal bosonic self-energy will depend on the four-\nmomentum. However, the calculation of SB(pm) to second\norder in the boson-fermion scattering length at nonzero four-\nmomentum involves the evaluation of integrals that cannot\nbe carried out analytically in a straightforward way. In con-\nclusion, in the present situation, we will consider the deple-\ntion due to the bosons only, which is well known @24,25#:\nnB2n05\n8\n3A\nnBaB\n3\np\nnB . ~81!\nWe now turn to a discussion of the fermion-fermion inter-\naction induced by the presence of the bosons. Subtracting the\nbosonic contribution from the energy density, we get\nE\nV 2eB5eFF11 20h3p~11d! a1 20h3p~11d! f ~d!p a2G .\n~82!\nThis describes the first three terms of a power expansion in\na , of exactly the same form as that of an imperfect ~unpo-\nlarized! Fermi gas, although clearly with different coeffi-\ncients. There is thus, as expected, an induced fermion-\nfermion interaction, which can now be computed by\nexploiting the expressions that we have derived for both the\nbosonic and the fermionic chemical potentials. This will\nyield a modification of the known induced fermion-fermion\ninteraction previously discussed in the mean-field approxi-\nmation @17#. The expression for the induced interaction at\nzero energy-momentum transfer U ind(qm50) is\nU ind~qm50 !5\n]mF\n]nF\nU\nmB\n2\n]mF\n]nF\n52S ]mF]nBD\n2 ]nB\n]mB\n, ~83!\nwhich in our case reads\nU ind~qm50 !52\n4p\\2~12d2!h1\/3a2\nmFkF~6p2!1\/3b2\/3\n3@114 f ~d!a\/3p# . ~84!\nThe extension to finite momentum transfer is achieved by\nintroducing the boson density-density response function\nx(qm), and is represented diagrammatically in Fig. 8, where\ntwo fermions interact by exchanging a boson density fluctua-\ntion wave. This is the simplest diagram by which two fermi-\nons can interact via the exchange of a bosonic excitation.\nThe density-density response function x(qm) is indepen-\ndent of aBF to first order. This can be easily verified follow-\ning the same line of reasoning described previously in the\nanalysis of the bosonic propagator. Thus its expression is the\nsame as in the pure bosonic case ~to this order!:\nx~qm!5\n\\n0q2\/mB\n~q0!22~\\q2\/2mB!224p\\3n0aBBq2\/mB\n2 .\n~85!\nThe vertex gFF can be determined by considering the lim-\niting expression for x(qm) as qm→0. In this case the expres-\nsion for the diagram given in Fig. 8 must reduce to the ex-\npression given in Eq. ~84!. It follows that\ngFF5\n2Ap\\2aBF\nm\n@114 f ~d!aBFkF\/3p# . ~86!\nThen the induced interaction potential in the static case (q0\n50) reads\nU ind~0,q!52\n4p\\4aBF\n2 @114 f ~d!aBFkF\/3p#2\nm2\n3\nn0\n\\q2\/4mB14p\\2n0aBB \/mB\n. ~87!\nIn real space this is\nU ind~0,q!5\n4\\2mBn0aBF\n2 @114 f ~d!aBFkF\/3p#2\nm2\n3\ne\nA2r\/j\nr\n, ~88!\nwhere\nj25\n1\n8pn0aB\n. ~89!\nWe observe that, compared to the mean-field result @17#,\nwhile there are quantitative modifications in the prefactors,\nthere is no qualitative change in the form of the induced\ninteraction, i.e., we still have an attractive Yukawa potential.\nModifications in the analytic form of the induced fermion-\nfermion interaction potential will appear only once second\norder effects in the boson-fermion scattering length aBF to\nthe depletion of the Bose condensate are included.\nVI. DISCUSSION AND OUTLOOK\nIn summary, we have determined ground-state properties\nof a homogeneous system of bosons mixed with spin-\npolarized fermions at zero temperature. We have calculated\nthe boson-fermion T matrix and the corresponding self-\nenergies. We have then shown how to incorporate the effects\nFIG. 8. Effective fermion-fermion interaction due to exchange\nof boson density fluctuations.\nQUANTUM FIELD THEORY OF DILUTE HOMOGENEOUS . . . PHYSICAL REVIEW A 65 053607\n053607-11\nof the boson-boson interaction and derived some relevant\nphysical quantities of the system, in particular the ground-\nstate energy. The importance of the corrections beyond mean\nfield has been discussed in several different instances of ex-\nperimental interest. For mixtures of bosonic and fermionic\nhelium we have shown that the terms beyond mean field may\nyield significant corrections ~up to 50% of the mean-field\nresult!. We have provided partial results also on two very\nsignificant physical quantities, namely, the Bose condensate\nfraction and the induced fermion-fermion interaction. To pro-\nvide more quantitative predictions for these quantities, as\nwell as for the BCS transition temperature, we will need to\ncompute in detail the corrections to second order in the\nboson-fermion scattering length. Results of this analysis,\nwhich go beyond the scope of the present paper, will appear\nin a forthcoming work, together with a detailed numerical\nanalysis of the conditions for stability and for phase separa-\ntion. Collective modes, effective fermion mass, and excita-\ntion spectra fully evaluated to second order in the boson-\nfermion scattering length will be discussed as well.\nExtensions of the formalism developed in this paper can\nbe made in different directions. First, one can consider un-\npolarized spin-1\/2 fermions. Calculations are very similar to\nthe present situation with the main difference that one has to\ninclude the effects of the direct interactions of fermions with\ndifferent spins. This would correspond to having a third scat-\ntering length aFF . As in the previous case, we expect that in\nthe two-particle scattering approximation the energy contri-\nbution for a pure fermion system of spin-1\/2 fermions is\nsimply added to Eq. ~70! in this case ~and of course, the\nFermi momentum has to be modified appropriately!.\nThe formalism can also be extended to consider finite\ntemperature. As in the case of pure bosons we expect con-\nsiderable difficulties near the critical temperature. Well be-\nlow that temperature, however, we expect no major compli-\ncations and the calculations will be similar to the present\ncase, except that boson loops will have to be taken into ac-\ncount and frequency integrals will have to be replaced by\nMatsubara frequency sums.\nA very important and natural possible extension is the\ninvestigation of inhomogeneous, e.g., harmonically trapped,\nsystems. This can be done by augmenting the existing mean-\nfield calculations via the correlation terms in local density\napproximation. To this end, the results obtained in the\npresent work are needed. The method and the full numerical\nprocedure will be described in a forthcoming paper.\nFinally, higher-order corrections may be computed in\nprinciple. These higher-order terms will also involve the\nbosonic gas parameter as well as three-particle correlations,\nand thus expansions like Eq. ~70! will not reduce to sums of\nterms, where only one scattering length appears at a time, but\nwill include also terms that contain products of powers of\nboth scattering lengths. To even higher orders nonuniversal\nproperties like the parameters describing the shape of the\ninteraction potentials will become important and will have to\nbe taken properly into account, as has been recently done in\nthe pure bosonic case @31,47#.\nACKNOWLEDGMENTS\nWe are grateful to Gordon Baym for seminal comments\non an earlier draft of the present work. We acknowledge very\nuseful discussions with Sam Morgan and Stefano Giorgini,\nas well as with Misha Baranov, Chris Pethick, Luciano Vi-\nverit, and Allan Griffin. A.P.A., S.A.G., and M.W. thank the\nDFG, BEC20001, and the Alexander von Humboldt Foun-\ndation for financial support. F.I. thanks the INFM for finan-\ncial support.\nAPPENDIX A: NORMAL ORDERED PRODUCTS\nAND THE VACUUM STATE\nIf we expand the field operators in terms of momentum\neigenstates we get\nFˆ ~x!5\n1\nAV (k a\nˆ ke\nik\u0095x5\n1\nAV\naˆ 01fˆ ~x!, ~A1!\nCˆ ~x!5\n1\nAV (k b\nˆ ke\nik\u0095x5cˆ 1†~x!1cˆ 2~x!, ~A2!\nwith\nfˆ ~x!5\n1\nAV (uku.0 a\nˆ ke\nik\u0095x\n, ~A3!\ncˆ 1~x!5\n1\nAV (uku<kF\nbˆ k\n†e2ik\u0095x, ~A4!\ncˆ 2~x!5\n1\nAV (uku.kF\nbˆ keik\u0095x. ~A5!\nIn terms of the bosonic and fermionic occupation number\noperators Nˆ B(k)5aˆ k†aˆ k and Nˆ F(k)5bˆ k†bˆ k the ground state of\nthe noninteracting system uj0& can be characterized by\nNˆ B~0!uj0&5NBuj0&, ~A6!\nNˆ B~k!uj0&50 for uku.0, ~A7!\nNˆ F~k!uj0&5uj0& for uku<kF , ~A8!\nNˆ F~k!uj0&50 for uku.kF , ~A9!\nwhere NB is the total number of bosons, which in this case\ncoincides with the number of zero-momentum bosons N0\n~Bose-Einstein condensate!. In occupation number represen-\ntation we thus have\nuj0&5uNB,0,0, . . . &B^ u1,1, . . . ,1,1,0,0, . . . &F , ~A10!\nwhere the subscript B refers to the boson Hilbert space and F\nto the fermion Hilbert space. The change from 1 to 0 in the\nfermion state happens at kF . Additionally,\nfˆ ~x!uj0&5cˆ 1~x!uj0&5cˆ 2~x!uj0&50. ~A11!\nALBUS, GARDINER, ILLUMINATI, AND WILKENS PHYSICAL REVIEW A 65 053607\n053607-12\nIn this sense the ground state can be regarded as the vacuum\nstate with respect to fermions excited above the Fermi sea,\nthe fermion holes below the Fermi sea, and the nonconden-\nsate bosons.\nThe normal product is defined on pairs of creation and\ndestruction operators:\n:f˜ ~x,t !f˜ †~x8,t8!:5f˜ †~x8,t8!f˜ ~x,t !,\n:c˜ j~x,t !c˜ k\n†~x8,t8!:52c˜ k\n†~x8,t8!c˜ j~x,t !,\n~A12!\n:f˜ ~x,t !c˜ j\n†~x8,t8!:5c˜ j\n†~x8,t8!f˜ ~x,t !,\n:c˜ j~x,t !f˜\n†~x8,t8!:5f˜ †~x8,t8!c˜ j~x,t !,\nfor j ,kP$1,2%. For all other pairs of creation and destruction\noperators the normal product is the same as the ordinary\noperator product. It can also be readily determined that\n@f˜ ~x,t !,f˜ †~x8,t8!#5^j0uf˜ ~x,t !f˜ †~x8,t8!uj0&,\n$c˜ 1~x8,t8!,c˜ 1\n†~x,t !%5^j0uC˜ †~x8,t8!C˜ ~x,t !uj0&,\n~A13!\n$c˜ ~x,t !,c˜ †~x8,t8!%5^j0uC˜ ~x,t !C˜ †~x8,t8!uj0&,\nand all other ~anti!commutators are zero. With Eqs. ~A12!\nand ~A13!, the contractions of Eq. ~37! can be readily evalu-\nated.\nAPPENDIX B: EVALUATION OF THE T MATRIX AND\nCOUPLING CONSTANT RENORMALIZATION\n1. The first integral I\nWe define\nI5E d3k u~ uP\/22ku2kF!\n\\P02\\2~P\/21k!2\/2mB2\\2~P\/22k!2\/2mF1m1in\n. ~B1!\nTransforming the integration variables to P\/22k gives\nI5E d3k u~ uku2kF!\n\\2k2\/2m2\\2P\u0095k\/mB2\\P01\\2P2\/2mB2m2in\n. ~B2!\nSetting a5\\2\/2m , b5\\2P\/mB , and E52\\P0\n1\\2P2\/2mB2m and transforming to spherical coordinates,\nwe get\nI52pE\nkF\nkc\ndkk2E\n0\np\ndf sin f\n1\nak22bk cos f1E2in\n5\n2p\nb EkF\nkc\ndkk ln\nak22bk1E2in\nak21bk1E2in\n, ~B3!\nwhere we will ultimately consider the limit kc→‘ . Using\nD5(b\/2a)22E\/a we can approximate for small n ~if D\nÞ0; the case D50 can be treated similarly and gives the\nsame answer as taking the limit D→0 at the very end!:\nI52 2pmB\n\\2P\nE\nkF\nkc\ndkkS lnk1mP\/mB1AD1in\/2aADk2mP\/mB2AD2in\/2aAD\n1ln\nk1mP\/mB2AD2in\/2aAD\nk2mP\/mB1AD1in\/2aAD\nD . ~B4!\nThe integral can be solved @46# to give\nlim\nkc→‘\nI52 8pmkc\n\\2\n1\n4pmkF\n\\2\n1\np\n\\2\nS mBkF2P 2 m2PmB 22mAD\n2\nmBD\nP D lnkF1mP\/mB1AD1in\/2aADkF2mP\/mB2AD2in\/2aAD\n2\np\n\\2\nS mBkF2P 2 m2PmB 12mAD2 mBDP D\n3ln\nkF2mP\/mB1AD1in\/2aAD\nkF1mP\/mB2AD2in\/2aAD\n, ~B5!\nwhere outside the logarithms we have taken the limit n→0\n~simply setting n50), and we have made use of the identity\nlim\nx→‘\nx2 ln\n11a\/x\n12a\/x 52ax , ~B6!\nfor the limit kc→‘ . There remains an ultraviolet divergent\nterm; the boson-fermion T matrix @Eq. ~58!# is, however,\nultimately renormalized by the second integral.\nThe real part of I is readily evaluated in the limit n→0 by\nsetting n50 and using the absolute values inside the loga-\nrithms:\nQUANTUM FIELD THEORY OF DILUTE HOMOGENEOUS . . . PHYSICAL REVIEW A 65 053607\n053607-13\nlim\nn→0\nRe I52 8pmkc\n\\2\n1\n4pmkF\n\\2\n1\np\n\\2\nS mBkF2P 2 m2PmB\n2\nmBD\nP D lnU~kF1mP\/mB!22D~kF2mP\/mB!22DU2 2pm\\2 AD\n3lnU~kF1AD !22~mP\/mB!2\n~kF2AD !22~mP\/mB!2\nU . ~B7!\nUsing the identity ~easily evaluated by polar decomposi-\ntion!\nlim\nn→01\nIm ln\na1in\nb2in 5H 0, sgn~a !5sgn~b !,p , sgn~a !Þsgn~b !, ~B8!\nthe imaginary part of I in the limit n→0 can be evaluated to\nbe\nlim\nn→0\nIm I5p\n2\n\\2\nS mBkF2P 2 m2PmB 22mAD2 mBDP D ~B9!\nif D.0 and kF,umP\/mB2ADu;\nlim\nn→0\nIm I52 4p\n2mAD\n\\2\n~B10!\nif D.0 and umP\/mB2ADu,kF,mP\/mB1AD; and\nlim\nn→0\nIm I50 ~B11!\nif D<0 or kF.mP\/mB1AD .\n2. The second integral J\nWe define\nJ52E d3k 1\n\\2k1\n2\/2m2\\2k2\/2m1in\n5\n4p\na\nE\n0\nkc\ndkS 12 k121in\/ak22k122in\/a D , ~B12!\nwhere as before a5\\2\/2m , and we have transformed to po-\nlar coordinates and integrated over the angle variables. The\nintegral can be evaluated @46# to give\nJ5 4pkc\na\n2\n2p\na\nAk122in\/aln\nkc1Ak122in\/a\nkc2Ak122in\/a\n1\n2p\na\nAk122in\/aln\nAk122in\/a\n2Ak122in\/a\n. ~B13!\nWe then use\nlim\nkc→‘\nln\nkc1Ak122in\/a\nkc2Ak122in\/a\n50 ~B14!\nto get\nlim\nn→0\nJ5 8pmkc\n\\2\n1i\n4p2mk1\n\\2\n. ~B15!\nIf we now take the sum of Eqs. ~B5! and ~B15!, the ultravio-\nlet divergent terms cancel exactly. The resulting expression\nfor I1J can then be substituted into Eq. ~58! to get Eq. ~59!\nfor the renormalized boson-fermion T matrix.\n@1# M. H. Anderson, J. R. Ensher, M. R. Matthews, C. E. Wieman,\nand E. A. Cornell, Science 269, 198 ~1995!.\n@2# K. B. Davis, M.-O. Mewes, M. R. Andrews, N. J. van Druten,\nD. S. Durfee, D. M. Kurn, and W. Ketterle, Phys. Rev. Lett. 75,\n3969 ~1995!.\n@3# C. C. Bradley, C. A. Sackett, J. J. Tollett, and R. G. Hulet,\nPhys. Rev. Lett. 75, 1687 ~1995!.\n@4# F. Dalfovo, S. Giorgini, L. P. Pitaevskii, and S. Stringari, Rev.\nMod. Phys. 71, 463 ~1999!.\n@5# Bose-Einstein Condensation in Atomic Gases, edited by M.\nInguscio, S. Stringari, and C. E. Wieman ~IOS Press, Amster-\ndam, 1999!.\n@6# W. Ketterle, Phys. Today 52~12!, 30 ~1999!.\n@7# A. J. Leggett, Rev. Mod. Phys. 73, 307 ~2001!.\n@8# G. Baym, J. Phys. B 34, 4541 ~2001!.\n@9# B. DeMarco and D. S. Jin, Science 285, 1703 ~1999!.\n@10# B. DeMarco, S. B. Papp, and D. S. Jin, Phys. Rev. Lett. 86,\n5409 ~2001!.\n@11# J. Goldwin, S. B. Papp, B. DeMarco, and D. S. Jin, Phys. Rev.\nA 65, 021402~R! ~2002!.\n@12# A. G. Truscott, K. E. Strecker, W. I. McAlexander, G. B. Par-\ntridge, and R. G. Hulet, Science 291, 2570 ~2001!.\n@13# F. Schreck, G. Ferrari, K. L. Corwin, J. Cubizolles, L. Khayk-\novich, M.-O. Mewes, and C. Salomon, Phys. Rev. A 64,\n011402~R! ~2001!.\n@14# F. Schreck, L. Khaykovich, K. L. Corwin, G. Ferrari, T. Bour-\ndel., , and C. Salomon, Phys. Rev. Lett. 87, 080403 ~2001!.\n@15# H. T. C. Stoof, M. Houbiers, C. A. Sackett, and R. G. Hulet,\nPhys. Rev. Lett. 76, 10 ~1996!.\n@16# M. Holland, S. J. J. M. F. Kokkelmans, M. L. Chiofalo, and R.\nWalser, Phys. Rev. Lett. 87, 120406 ~2001!.\n@17# L. Viverit, C. J. Pethick, and H. Smith, Phys. Rev. A 61,\n053605 ~2000!.\n@18# A. Robert, O. Sirjean, A. Browaeys, J. Poupard, S. Nowak, D.\nBoiron, C. I. Westbrook, and A. Aspect, Science 292, 461\n~2001!.\n@19# F. Pereira Dos Santos, J. Le´onard, J. Wang, C. J. Barrelet, F.\nPerales, E. Rasel, C. S. Unnikrishnan, M. Leduc, and C.\nCohen-Tannoudji, Phys. Rev. Lett. 86, 3459 ~2001!.\n@20# N. Nygaard and K. Mo\u0094lmer, Phys. Rev. A 59, 2974 ~1999!.\n@21# M. J. Bijlsma, B. A. Heringa, and H. T. C. Stoof, Phys. Rev. A\n61, 053601 ~2000!.\n@22# H. Pu, W. Zhang, M. Wilkens, and P. Meystre, Phys. Rev. Lett.\n88, 070408 ~2002!.\nALBUS, GARDINER, ILLUMINATI, AND WILKENS PHYSICAL REVIEW A 65 053607\n053607-14\n@23# V. Galitskii, Sov. Phys. JETP 7, 104 ~1958!.\n@24# A. A. Abrikosov, L. P. Gorkov, and I. E. Dzyaloshinski, Meth-\nods of Quantum Field Theory in Statistical Physics ~Dover\nPublications, New York, 1963!.\n@25# A. L. Fetter and J. D. Walecka, Quantum Theory of Many-\nParticle Systems ~McGraw-Hill, New York, 1971!.\n@26# T. T. Lee and C. N. Yang, Phys. Rev. 105, 1119 ~1957!.\n@27# S. Beliaev, Sov. Phys. JETP 7, 299 ~1958!.\n@28# N. Hugenholtz and D. Pines, Phys. Rev. A 99, 489 ~1959!.\n@29# T. T. Wu, Phys. Rev. 115, 1390 ~1959!.\n@30# K. Sawada, Phys. Rev. 116, 1344 ~1959!.\n@31# E. Braaten and A. Nieto, Eur. Phys. J. B 11, 143 ~1999!.\n@32# A. Fabrocini and A. Polls, Phys. Rev. B 25, 4533 ~1982!.\n@33# E. Krotscheck and M. Saarela, Phys. Rep. 232, 1 ~1993!.\n@34# W. F. Saam, Ann. Phys. ~N.Y.! 53, 239 ~1969!.\n@35# A. Galindo and P. Pascual, Quantum Mechanics ~Springer-\nVerlag, Berlin, 1990!, Vol. II.\n@36# This is only true for spin-polarized fermions. In general kF\n5@6p2nF \/(2s11)#1\/3, where s is the spin degeneracy.\n@37# N. Bogoliubov, J. Phys. ~Moscow! 11, 23 ~1947!.\n@38# M. Girardeau and R. Arnowitt, Phys. Rev. 113, 755 ~1959!.\n@39# C. W. Gardiner, Phys. Rev. A 56, 1414 ~1997!.\n@40# Y. Castin and R. Dum, Phys. Rev. A 57, 3008 ~1998!.\n@41# S. A. Morgan, J. Phys. B 33, 3847 ~2000!.\n@42# G. C. Wick, Phys. Rev. 80, 268 ~1950!.\n@43# Considering Eq. ~7.12! of Ref. @25#, we take V(x,x8)aa8,bb8\n5U(x,x8)daa8dbb8da(2b)1V(x,x8)daa8dbb8dabda(1\/2) , and\nreplace cˆ 1\/2(x) by fˆ (x) and cˆ 21\/2(x) by Cˆ (x). The derivation\nis then the same, apart from some sign factors.\n@44# The proof of the validity of the Hugenholtz-Pines theorem can\nbe adopted literally from the pure boson case, since it is based\non how to replace condensate lines by noncondensate propa-\ngators; a procedure which is unchanged in the present situa-\ntion.\n@45# This could possibly be realized by a Feschbach resonance,\nwith the effective boson-boson scattering length tuned down to\nnearly zero. See J. Stenger, S. Inouye, M. R. Andrews, H.-J.\nMiesner, D. M. Stamper-Kurn, and W. Ketterle, Phys. Rev.\nLett. 82, 2422 ~1999!; S. L. Cornish, N. R. Clausen, J. L.\nRoberts, E. A. Cornell, and C. E. Wieman, ibid. 85, 1795\n~2000!.\n@46# A. P. Prudnikov, Yu. A. Brychkov, and O. I. Marichev, Inte-\ngrals and Series ~Gordon and Breach Science Publishers, Am-\nsterdam, 1998!, Vol. 1.\n@47# E. Braaten, H.-W. Hammer, and S. Hermans, Phys. Rev. A 63,\n063609 ~2001!.\nQUANTUM FIELD THEORY OF DILUTE HOMOGENEOUS . . . PHYSICAL REVIEW A 65 053607\n053607-15\n"}