{"doi":"10.1007\/978-90-481-3071-9_54","coreId":"56022","oai":"oai:nora.nerc.ac.uk:10908","identifiers":["oai:nora.nerc.ac.uk:10908","10.1007\/978-90-481-3071-9_54"],"title":"Mass transport events and their tsunami hazard","authors":["Tappin, D.R."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":["Mosher, D.C."],"datePublished":"2010","abstract":"Mass transport events, such as those from submarine landslides, volcanic flank collapse at convergent margins and on oceanic islands, and subaerial failure are reviewed and found to be all potential tsunami sources. The intensity and frequency of the tsunamis resulting is dependent upon the source. Most historical records are of devastating tsunamis from volcanic collapse at convergent margins. Although the database is limited, tsunamis sourced from submarine landslides and collapse on oceanic volcanoes have a climate influence and may not be as hazardous as their frequency suggests. Conversely, tsunamis sourced from submarine landslides at convergent margins may be more frequent historically than previously recognized and, therefore, more hazardous","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/56022.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/10908\/1\/Tappin_D_R_in_Mosher_et_al_%28eds%29Mass_Transport_Events.pdf","pdfHashValue":"1e4f7ba3553dcfe47acab8adb75aee32a9c57433","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:10908<\/identifier><datestamp>\n      2012-11-22T12:12:30Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533130<\/setSpec><setSpec>\n      74797065733D626F6F6B5F73656374696F6E<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/10908\/<\/dc:relation><dc:title>\n        Mass transport events and their tsunami hazard<\/dc:title><dc:creator>\n        Tappin, D.R.<\/dc:creator><dc:subject>\n        Earth Sciences<\/dc:subject><dc:description>\n        Mass transport events, such as those from submarine landslides, volcanic flank collapse at convergent margins and on oceanic islands, and subaerial failure are reviewed and found to be all potential tsunami sources. The intensity and frequency of the tsunamis resulting is dependent upon the source. Most historical records are of devastating tsunamis from volcanic collapse at convergent margins. Although the database is limited, tsunamis sourced from submarine landslides and collapse on oceanic volcanoes have a climate influence and may not be as hazardous as their frequency suggests. Conversely, tsunamis sourced from submarine landslides at convergent margins may be more frequent historically than previously recognized and, therefore, more hazardous. <\/dc:description><dc:publisher>\n        Springer<\/dc:publisher><dc:contributor>\n        Mosher, D.C.<\/dc:contributor><dc:date>\n        2010<\/dc:date><dc:type>\n        Publication - Book Section<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/10908\/1\/Tappin_D_R_in_Mosher_et_al_%28eds%29Mass_Transport_Events.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Tappin, D.R..  2010  Mass transport events and their tsunami hazard.    In: Mosher, D.C., (ed.) Submarine mass movements and their consequences.  Dordrecht, the Netherlands, Springer, 667-684.  (Advances in natural and technological hazards research, 28).      \n <\/dc:identifier><dc:relation>\n        http:\/\/www.springerlink.com\/content\/978-90-481-3070-2<\/dc:relation><dc:relation>\n        10.1007\/978-90-481-3071-9_54<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/10908\/","http:\/\/www.springerlink.com\/content\/978-90-481-3070-2","10.1007\/978-90-481-3071-9_54"],"year":2010,"topics":["Earth Sciences"],"subject":["Publication - Book Section","PeerReviewed"],"fullText":"667 \nD.R. Tappin () \nBritish Geological Survey, Nottingham, England, NG12 5GG, 44-115-936-3449 \ne-mail: drta@bgs.ac.uk \n \nD.C. Mosher et al. (eds.), Submarine Mass Movements and Their Consequences, 667-684 \nAdvances in Natural and Technological Hazards Research, Vol 28, \n© Springer Science + Business Media B.V. 2010 \nMass transport events and their tsunami hazard \nD. R Tappin \nBritish Geological Survey, Nottingham, England, NG12 5GG, 44-115-936-3449, drta@bgs.ac.uk \nAbstract    \nMass transport events, such as those from submarine landslides, volcanic flank collapse \nat convergent margins and on oceanic islands, and subaerial failure are reviewed and \nfound to be all potential tsunami sources. The intensity and frequency of the tsunamis \nresulting is dependent upon the source. Most historical records are of devastating tsu-\nnamis from volcanic collapse at convergent margins. Although the database is limited, \ntsunamis sourced from submarine landslides and from collapse on oceanic volcanoes \nhave a climate influence and may not be as hazardous as their frequency suggests. Con-\nversely, tsunamis sourced from submarine landslides at convergent margins may be \nmore frequent historically than previously recognized and more hazardous. \nKeywords Tsunami • submarine landslide • volcano • hazard \n1. Introduction \nDestructive tsunamis are mainly generated by earthquakes. However, they can also be \nsourced by failure of sediment and rock both on land and at the seabed. Most of these \nsediment\/rock failures are submarine or from volcanoes, fewer are subaerial. Despite \nrecords that, in some places (e.g., Japan), go back thousands of years, there are few reli-\nable historical accounts of tsunamis from submarine and subaerial failure but there are \nsignificantly more from volcanoes. The oldest historical records of tsunamis generated \nby mass failures are of volcanic lateral collapse in Japan and date back to the 18th cen-\ntury e.g., Oshima-Oshma in 1741 (e.g. Satake 2007). Historic records of devastating \ntsunamis resulting from subaerial landslides, are few, e.g., Scilla, Calabria in 1783 \n(Graziani et al. 2006) and Vaiont, Italy in 1963 (Hendron and Patten 1985). \n \nAlthough submarine landslides, including slumps, debris flows and turbidites, have \nbeen researched for decades, until recently these were rarely indentified as a tsunami \n668  \nsource. In fact they were discounted as a cause of destructive tsunamis (e.g. Jiang and \nLeBlond 1994; LeBlond and Jones 1995). This, despite tsunamis such as the Grand \nBanks in 1929 (e.g. Heezen et al. 1954; Piper and Asku 1987) and those associated with \nthe Good Friday 1964 earthquake in Alaska, at Seward and Valdez, (e.g. Lee et al. \n2003). These events might have flagged the hazard from submarine landslides but they \ndid not and, it was not until 1998, when a submarine slump caused the devastating tsu-\nnami in Papua New Guinea, in which 2,200 people died, that the threat from submarine \nlandslides was fully realized  (Tappin et al. 2008a; Tappin et al. 2001). It is thus the in-\ntention of this paper to provide a broad overview of the tsunami hazard from mass \ntransport events. The review mainly addresses tsunamis generated from submarine land-\nslides and volcanoes, but subaerial failures are briefly considered. The objective is to \nreview submarine mass transport processes relevant to tsunami formation and identify \nwhere these may be a tsunami hazard. \n \n2. Mass transport events \nMass transport events take place in many different environments. Hampton et al. \n(1996) introduced the term “landslide territory” for those areas where they are more \ncommon than elsewhere; with locations identified from unique combinations of sedi-\nmentology and physiography. The environments recognized include the open continen-\ntal shelf, submarine canyon\/fan systems, fjords, active river deltas and volcanic islands. \nIn addition, Lee (2005) identified convergent margins as an important environment \nwhere submarine landslides also take place. Consideration of these landslide environ-\nments indicates several dominant controls on slope stability, that have been elucidated \nby Lee (in press) as: i) sediment delivery to the continental margins; its rate, volume \nand type, ii) sediment thickness, iii) changes in seafloor conditions, which can influence \nhydrate stability and the possible generation of free gas, iv) variations in seismicity and,  \nv) changes in groundwater flow. However in many respects these controls may be sec-\nondary to the main driving force, namely global climate change which, over the past \nhundreds of thousands of years, has resulted in alternating glacial and interglacial envi-\nronments. The major impact of these climate changes has been on eustatic sea level. \nDuring glacial\/interglacial cycles changing sea level has controlled the delivery of se-\ndiment to the oceans, as well as influencing seismicity along the continental margins, \nmainly through sea water loading and glacioisostacy. With regard to controls on volcan-\nic mass failure there is an added contribution from magmatism that is driven by deep \nearth processes and regional structural controls on intrusion. However, climate change \nmay affect volcanic collapse through both changes in sea level that affects slope stabili-\nty (Quidelleur et al. 2008) and in rates of volcanic activity that also has an influence on \nflank collapse (McGuire et al. 1997). \n \nThere is a close and genetic relationship between most landslide territories and tsu-\nnami but, whereas there may be similar controls on sediment deposition and landslide \ntriggering, in some territories, such as active river deltas, there is no evidence that mass \nmovements have resulted in tsunamis. For example, submarine landslides are common \nin the Mississippi Delta. In 1969, when Hurricane Camille struck the Gulf coast, three \n669 \noffshore drilling platforms collapsed as a result of seabed sediment failure that resulted \nin a change of seabed relief of up to 12 m (e.g. Bea et al. 1983). However, there was no \nassociated tsunami. The lack of evidence may, however, be more apparent than real. In \nother territories, such as open continental slopes and canyons, fjords, convergent mar-\ngins and volcanoes, there is significant evidence that mass movement can result in ha-\nzardous, if not, devastating tsunamis; such as at Mt Unzen in 1792 (Siebert et al. 1987), \nPNG in 1998 and Storegga at 8,200 years BP (Bondevik et al. 2005).  \n3. Submarine mass failures \n3.1 Open Continental slope and rise \nContinental margin environments are regions where sediment transfer from land to \nsea takes place. During changes in sea level sediment in these regions has the potential \nto become unstable, in the process triggering tsunami. One of the best studied regions \nfor submarine landslides on the open continental slope and rise is the North Atlantic \n(Hühnerbach et al. 2004; Lee in press; McAdoo et al. 2000). Numerous focused initia-\ntives, such as ENAMII (Mienert 2002) and the high scientific interest from surrounding \nnations have resulted in an extensive database of submarine landslides, their deposition-\nal character, age, and triggering mechanisms. In addition, the discovery off of Norway \nof the second largest gas field in Europe beneath the largest submarine landslide in the \nNorth Atlantic, resulted in one of the most intensive investigations into offshore slope \nstability ever undertaken (Solheim et al. 2005).  \n \nThere are numerous submarine landslides of all scales along the Atlantic continental \nmargins. Mechanisms of failure are numerous and include, debris flows, landslides and \nslumps. Submarine landslides are generally more abundant in the western North Atlan-\ntic (off Canada and the US) than in the eastern North Atlantic (off Europe). Landslides \nin the west are generally smaller than those in the east. On both sides of the Atlantic, \nmost slides originate in water depths between 1000 and 1300 m. Three geographic re-\ngions are recognized: a glaciated margin north of 56° N (southern tip of Norway), a \n“glacially-influenced” margin from 26° N to 56° N, and a non-glaciated margin south of \n26° N (Weaver et al. 2000). \n \nFour giant submarine landslides border the Norwegian margin, Andøya Traenadju-\npet, Finneidfjord, and Storegga, with the latter the largest at 3,500 km3. Farther south, \noff Britain and Ireland, there are further submarine landslides including Peach and \nRockall off of Scotland. The Storegga slide generated a tsunami that hit the west coast \nof Norway with runups of up to 20 m (Bondevik et al. 2003). The evolution of the slide \nis probably representative of similar slides along the Norwegian margin. Failure took \nplace at the end of the last glaciation or soon after deglaciation. The slide was transla-\ntional with failure planes related to strain softening behavior of marine clay layers. Des-\ntabilization prior to failure is related to rapid loading from glacial deposits with genera-\ntion of excess pore pressure and reduction of the effective shear strength in the \n670  \nunderlying clays. The slide failed towards the base in a retrogressive manner. Climatic \nprocesses led to a preconditioning of the sediment mass, subsequently failing through \nearthquake shock, the result of isostatic uplift driven by ice retreat. Although hydrate \ndestabilization may contribute locally, this is not regarded as a primary driver of mass \nfailure (Bryn et al. 2005).  \n \nOff the US margin 48 landslides have been mapped (Chaytor et al. 2007), the largest \nof which, the Cape Fear Slide, has a volume of 200 km3 (Lee in press). Landslides on \nthe slope are generally larger than on the rise, thus having a higher potential to generate \ndamaging tsunamis. Off of Canada, 24 submarine landslides have been identified (Piper \nand McCall 2003). The best known is the 1929 Grand Banks event. 41 people lost their \nlives in the ensuing tsunami. The tsunami was the result of a debris flow released from \nthe Canadian shelf by earthquake shock. Recent mapping of the landslide indicates that \nit was relatively thin (20 m average) and probably retrogressive (Mosher and Piper \n2007). Off of North Africa there are five or six large submarine landslides, including the \ngiant Saharan debris flow. In the south Atlantic, submarine landslides lie off the Ama-\nzon Delta, with volumes of 2,500 km3 (Maslin et al. 1998); off of southern Africa is the \nAgulhas Slump with a proposed volume of 20,0003 km (Dingle 1977) although this fig-\nure is based on pre-swath bathymetry data. Yet, of all these landslides on the margins of \nthe Atlantic, that must be several hundred in number, the only direct evidence of any \ntsunamis associated with their failure, is from Storrega where there sedimentary depo-\nsits (Bondevik et al. 2005)and the Grand Banks, where there are survivors accounts an \nsediments (e.g. Tuttle et al. 2004). In the case of Storegga, the sediments have been pre-\nserved for 8,200 years. \n \nLee (in press) reviewed the depositional environments and known ages of submarine \nlandslides on the margins of the Atlantic Ocean. He found that, over the past 20,000 \nyears, there is a relatively even distribution of large landslides with the period between \nthe last glacial maximum until about five thousand years ago. The database is limited, \nhowever, because few slides have been dated. Notwithstanding, he found that most fail-\nures took place during glacial periods or just after. He attributed the distribution of ages \nto the accumulation of thick sedimentary deposits on the upper continental slope during \nglacial periods and their failure due to increased seismicity (caused by isostatic read-\njustment) during and following deglaciation.  \n \nFrom areas outside of the Atlantic, there are numerous submarine landslides. In the \nMediterranean, probably the largest is the ‘BIG’95 debris flow off of Spain with an area \nof 2000 m2 (Lastras et al. 2004). In the other areas, landslides have been identified off \nFrance and in the eastern Mediterranean off of Egypt and Israel. Again, there is little \nevidence for associated tsunami. Two major studies have been carried on landslides off \nCalifornia on the US west coast. The Goleta Slide, in the Santa Barbara Channel, is a \ncompound failure that contains both surfical slump blocks and mud flows, forming a to-\ntal volume of 1.75 km3. The slide is interpreted as Holocene in age (Fisher et al. 2005; \nGreene et al. 2005) . There are three main lobes one of which, upon failing, has been \nmodeled to source a tsunami wave with a runup of ~10 m. Although historical records \nsuggest that tsunamis struck the area in the 19th century, they appear to be sourced from \nearthquakes rather than from submarine landslides. The Palos Verdes debris avalanche, \nlocated in a submarine canyon offshore of Long Beach (Bohannon and Gardner 2004), \n671 \nis the largest late Quaternary SMF in the inner California Borderland basins, dated at \n7,500 years BP (Normark et al. 2004) and with a volume of 0.34km 3.  Modeling indi-\ncates that it  was large enough to generate a significant tsunami that would inundate the \nadjacent coastline (Locat et al. 2004). However, as of yet, there is no evidence of the \ntsunami on the adjacent coast.  \n3.2 Fjords \nSubmarine landslides are common in fjords. In glacial environments rapid sedimen-\ntation results in deposits that are susceptible to failure. Decay of organic matter depo-\nsited from rivers produces methane gas that may lead to elevated pore water pressure \nand further reduce sediment strength. Fjord head deltas can fail under cyclic loading \n(e.g. Prior et al. 1986) as at Kitimat Fjord in British Columbia in 1975. Triggered by a \nlow tide, a landslide in the fjord created a tsunami of up to 8.2 m (Lee 1989; Prior et al. \n1982). Although there was significant damage, no lives were lost. Weak sediments can \nalso fail through earthquake shock as happened during the great Alaska earthquake of \n1964. The resulting tsunamis were enormously destructive, with loss of lives and infra-\nstructure (Hampton et al. 1993; Lee 1989; Plafker et al. 1969).  At Seward a 1 km sec-\ntion of the waterfront failed as a result of submarine failure, creating a 10 m high tsu-\nnami (Lemke 1967). The destruction was compounded by a subsequent earthquake-\ngenerated tsunami, also 10 m high, arriving 30 minutes later. Most of the 13 people who \ndied were inundated by the tsunami. At Valdez, an initial landslide volume of 0.4 km3 \nincreased to 1 km3 as it incorporated sediment from the seabed (Coulter and Migliaccio \n1966). The resulting tsunami attained heights locally of 52 m. 32 people died in the \nevent.  \n3.3 Convergent margins \nConvergent margins, like passive open continental slopes and rises, are regions of \nimportant sediment flux between the land and the sea. Their characterization into those \nmargins where the sediment flux is significant (sediment rich) and those where it is not \n(sediment starved) has implications for landslide generation, although the relationships \nare complex. It is not always those margins where sediment flux is large that produce \nthe most hazardous tsunami. For example, the PNG event took place along the New \nGuinea trench which is sediment starved (Tappin et al. 2001). Landslides along the \nSunda margin, where there is a much larger accretionary prism than in New Guinea. are \nsmall-scale and less of a hazard in sourcing destructive events (Tappin et al. 2007). \nSubmarine landslides have been mapped on many convergent margins (McAdoo et al., \n2004). Their size varies from ‘super-scale’ in Cascadia (Goldfinger et al. 2000) to \n‘small’ along the Sunda margin in the Indian Ocean (Tappin et al. 2007). Along the \nNankai accretionary prism, highly eroded lower slopes show little evidence of large, \nwell-preserved submarine landslides (McAdoo et al. 2004). The Makran and Kodiak ac-\ncretionary margins evidence mass wasting on the upper slopes, with the lower slopes \n672  \nlacking large landslides. In contrast, the sediment-starved Sanriku, Nicaragua, and \nAleutian margins have large landslides. \n \nConvergent margins are the most recent addition to landslide territory environments \n(Lee 2005), mainly because of the 1998 tsunami in PNG.  With the gradual, but not uni-\nversal, acceptance that the PNG tsunami was the result of a submarine slump there is \nnow an expanding field of research into convergent margin events from landslides. \nSome of this research is based on newly acquired multibeam data, e.g., Puerto Rico, \n1918 (Lopez-Venegas et al. 2008), while new research is on re-evaluating anomalous \ntsunamis with runups that, to some degree, are too large in relation to their proposed \nearthquake source. The Alaska 1946 tsunami has always been enigmatic. An earthquake \nof MS =7.1 produced a disproportionately large local tsunami (Mt =9.3) which claimed \n167 lives (Fryer et al. 2004).  A large landslide on GLORIA data indicated that this \nmight be a more likely source but, this was not resolved on recently acquired multibeam \ndata (Rathburn et al. 2009) so the source of the tsunami is still enigmatic. The earth-\nquake source of the Puerto Rico tsunami of 1918 has also been re-evaluated, with a \nlandslide identified as an alternative (Hornbach et al. 2008; López-Venegas et al. 2008). \nThe Messina tsunami and earthquake of 1908 claimed 60,000 lives, many in the tsuna-\nmi. The earthquake magnitude (MS =7.1) is incompatible with both the height distribu-\ntion and southward extent of local tsunami runups (Billi et al. 2008). A submarine \nlandslide has been identified on multibeam data that may explain the inconsistency. Al-\nternatively, the tsunami may have resulted from both the earthquake and a landslide \n(Tappin et al. 2008b). The Indian Ocean tsunami of 1945 was previously believed to the \nresult of an earthquake located along the Makran margin. However, there are inconsis-\ntencies between the timing of tsunami runups and the earthquake, thus a landslide \nsource has been proposed (Rajendran et al. 2008). Other events where there is a suspi-\ncion of a landslide contribution include the Sanriku tsunami of 1896 in which over \n22,000 people perished, Flores tsunami of 1982 (Imamura et al. 1995) in which over \n2,000 people died, and Java, 2006, where focused runups hint at an SMF source.  \n4. Volcanoes \nCatastrophic volcanic flank collapse has been reported from numerous convergent \nmargin and intra-plate locations. Mount St Helens in 1980 (Lipmann et al. 1988) is the \nbest studied recent collapse event. Although on land, it has led to an improved under-\nstanding of the processes of flank failure that has been extended into the marine domain. \nAt coastal locations, flank collapse has the potential to create devastating tsunamis (e.g. \nMcMurtry et al. 2003; Satake 2007). Volcanic collapse along oceanic and convergent \nmargin volcanoes has been subject to extensive research. Study of the giant submarine \nlandslides (GSLs) on Hawaii was seminal in identifying the potential tsunami hazard \nfrom this source. Along convergent margins collapses are smaller in scale by orders of \nmagnitude from oceanic island failures. Historical records however, show that these \npose a serious hazard because of their higher frequency and because of their proximity \nto population centers. Tsunamis may be generated directly by volcanic eruption as ex-\nemplified by Santorini in 3,500 BC (McCoy and Heiken, 2000). Thus, to address the \ndifferent tsunami sources this section provides an introduction the processes of collapse \n673 \nand then considers each of the main environments where collapse may result in tsuna-\nmis \n \nNumerous volcanic edifices have large open amphitheatre-shaped structures that \nhave been created either by caldera or flank collapse that results in debris avalanches \n(e.g. Siebert 1984). These amphitheatres are at all scales. The debris avalanches of Ha-\nwaii are the largest on Earth, with the Nuuanu giant submarine landslide (GSL) cover-\ning 5,000 km2. The largest failed block, the Tuscaloosa Seamount, stands 2 km above \nthe surrounding sea bed. The formation of volcanic avalanche amphitheatres is well \nknown. It involves gravity sliding of large sectors of volcanoes along glide planes that \nsteepen sharply upslope, forming near-vertical, crater-like walls at their upper ends, and \nthat flatten  down slope leaving an open breach between the low-lying tips of the amphi-\ntheatre escarpment. Slippage initially takes place as rockslides, but these disintegrate ca-\ntastrophically into rock avalanches. Longer travel distances generally produce smaller \nblocks in the avalanche deposits. In the marine domain these features are well imaged at \nmany volcanic locations. For example recent mapping off Ritter Island northeast of \nNew Guinea revealed a debris avalanche that extends up to 75 km from its source (Sil-\nver et al. 2005). The deposit has three components: i) large blocks, up to 2 km across, \noccur adjacent to the collapse scar, ii) smaller (10 to 100 m) blocks, that form a series of \ndiscrete debris avalanche lobes or hummocks, are traced up to 35 km from the volcano, \nand iii) landslide deposits that form a broad, thin sheet 20 km wide.   \n \nOne of the major constraints in assessing the tsunami hazard from volcanic collapse \nis the triggering mechanism(s) because they are numerous and varied  (McGuire 1996). \nVolcanic rift zones have been recognized on many oceanic islands such as Stromboli \nand the Canary Islands and have been linked to edifice failures (Siebert 1984). They \nconcentrate magma upwelling as dyke swarms, which can trigger instability by strength \nreduction through thermal or mechanical pressurization of pore fluids (Elsworth and \nDay 1999), or by the growth of an anomalously high topographic load (McGuire, 1996). \nSlope angle and gravitational instability favor failure, but low-angle edifices such as \noceanic shield volcanoes, the Hawaiian Islands for example, are also prone to large-\nscale flank destabilization. Asymmetric building onto a dipping basement can direct \ncollapses towards a preferred direction. Such structural control of preferred landslide di-\nrection has been advocated in the Lesser Antilles (Deplus et al. 2001). Instantaneous \ndestabilization of weakened edifices can result from strong regional earthquakes, or \nfrom seismicity along listric basement faults acting as décollement surfaces. Strength-\nreduction basal volcanic layers by hydrothermal alteration and\/or increased pore fluid \npressure such as during periods of high rainfall can also favor instability. Finally, how-\never, as McGuire (1996) points out, the main driving force of collapse is gravity. \n \nProposed climate controls on volcanic slope stability are intimately associated with gla-\ncial and interglacial cycles. Analysis of GRIP ice cores reveals a strong correlation over \nthe past 110,000 years between accelerations in rates of sea level change and increased \nrates of explosive volcanism (Zielinski et al. 1996). These may in turn influence flank \ncollapse (McGuire et al. 1997). Over longer time scales, large-scale flank collapse of \nvolcanic islands may correlate with sea-level rise driven by climate change. On Hawaii, \nMcMurtry et al. (2003) propose that large flank collapses are related to increased reten-\ntion of groundwater during wet and warm climates characterizing interglacial periods. \n674  \nQuidelleur et al. (2008) using a more global dataset, identify large volume (>10 km3) \ncollapses at glacial stage terminations. \n \n \n4.1 Convergent margins - Volcanic flank collapse  \nThe earliest recorded historical tsunamis from flank collapse are from Japan.  In \n1640, on Komagatake volcano, Hokkaido, collapse resulted in a large-scale debris ava-\nlanche that entering the sea, caused a tsunami in which more than 700 people died (Ni-\nshimura et al. 1999). In 1741, also in Hokkaido, catastrophic volcanic collapse on \nOshima-Oshima Island created a tsunami in which there were approximately 2,000 fa-\ntalities (Satake 2007). The tsunami resulted in local runups of up to 13 m. In the far \nfield, over 1,000 km to the southwest, on the coast of Korea there were runups of 3-4 m. \nIn 1792 collapse on Mt Unzen led to a debris avalanche that swept through Shimabara \nCity and into the Ariaka Sea. The tsunami resulted in the loss of over 10,000 lives \n(Miyachi 1992; Siebert et al. 1987). In Papua New Guinea, the Ritter Island sector col-\nlapse of 1888 created a local tsunami of 12-15 m  (Johnson 1987). Run ups several hun-\ndred kilometers away were up to 8 m (Cooke 1981), scores, if not hundreds of people in \nlocal villages perished. The most recent tsunami caused by a volcanic flank failure was \non the 30 December 2002, on Stromboli, in the Aeolian Islands. The local tsunami was \nup to 10 m above sea level and caused significant damage to buildings on the eastern \ncoast of the island but no loss of life (Tinti et al., 2005).  \n4.2 Convergent Margins – Eruption tsunami \nThe most prominent eruption tsunamis are undoubtedly those from Krakatau in 1883 \nand Santorini in 3,500 BC. Other examples include the 1815 eruption of Tambora in In-\ndonesia, generated by pyroclastic flows entering the ocean (Self and Rampino 1981) \ncausing coastal inundation of up to 4 m (Van Padang 1971). Pyroclastic flows from the \neruption of Aniakchak volcano, Alaska in 3,500 years BP resulted in a tsunami with ru-\nnups as high as 15 m (Waythomas and Neal 1997). In 1883, over 36,000 people died in \nthe Krakatau tsunami. 40 m tsunami waves were reported from Java (Simkin and Fiske \n1983). The source of the tsunami is controversial, with three possible volcanic sources, \ni) large-scale collapse of the northern part of Krakatau Island (Self and Rampino 1981), \nii) pyroclastic flows (e.g. Francis 1985)and, iii) a submarine explosion (Yokoyama \n1987). A submarine explosion, one to five minutes duration best fits the observed tsu-\nnami heights and waveforms recorded at Batavia (Normanbhoy and Satake, 1995). It is \npossible that the smaller tsunamis were caused by pyroclastic flows (Francis 1985; Si-\ngurdsson et al. 1991).  \n \n675 \n4.3 Oceanic volcanoes - flank collapse  \nVolcanic flank collapses have been mapped on numerous oceanic islands. Using a \ncombination of onshore mapping and offshore data including multibeam bathymetry \nand sub-seabed geophysics, we now have access to comprehensive data sets that under-\npins an improved understanding of flank failure at these locations. However, only a few \nexamples have been intensely studied in the context of their potential to create tsunami.  \n \nIn Hawaii, large-scale, gravitational volcanic collapses, GSLs, have long been recog-\nnized (e.g. Moore et al. 1989). Along the Hawaii-Emperor Ridge there are over 68 ma-\njor landslides over 20 km in length, some are over 200 km long, with volumes exceed-\ning 5,000 km3. These are the largest landslides on Earth. Two main landslide \nmorphologies are recognized, debris avalanches and slumps, with numerous variations \nin-between. The slumps, fail slowly by creep, thus their potential as tsunami sources is \nminimal; they will not be considered further. Debris avalanches form the majority of \nfailures and these lie on slopes <3° and are formed of fragmented volcanic rock. They \nare ~ 100’s m in thickness, with well defined amphitheatres at their head. They display \nthe classic hummocky surface topography of debris avalanches.  Some debris ava-\nlanches have a significant proportion of large blocks (e.g., Nuuanu and Wailau) others \nhave smaller blocks and a greater proportion of finer material (e.g. Alika 2).  \n \nDating of the GSLs indicates that on average failure rate is every 100,000 years. Al-\nthough occurring throughout the lifetimes of the volcanoes, the largest landslides oc-\ncurred when the centers were young and unstable, were close to their maximum size, \nand when seismic activity was at a high level. The morphology of the GSLs, together \nwith their large lateral extent and the fact that they travelled long distances across the \nHawaiian Deep upslope onto the Hawaiian Ridge, in places overtopping vertical eleva-\ntions of 100s of meters, indicates that they travelled at high velocities of 100 to 200 m\/s. \nThe debris avalanches are thus almost probably catastrophic, and take place as single \nevents.  \n \nSince their discovery the tsunami potential from the Hawaii GSLs has been the sub-\nject of controversy (McMurtry et al. 2004a; Moore and Moore 1988; Rubin et al. 2000; \nStearns, 1978). However now, a combination of seabed mapping, dating of the Alika 2 \nGSL, modeling its’ failure as a tsunami source, and the presence of sediments at over \n340 m above sea level laid down by the tsunami at the time of generation, provide \nstrong evidence that failure of the GSL do indeed create massive tsunamis. These tsu-\nnamis locally have runups of the order of 100s of meters above sea level. In the far \nfield, the limited modeling available from the collapse of the Nuuanu GSL indicates a \nreal hazard; offshore heights of tens of meters may strike the coasts of southern Califor-\nnia and the Aleutian islands (Satake et al. 2002).  \n \nThe GSLs of Hawaii are not unique, most oceanic volcanoes fail catastrophically \nduring part of their existence. In the younger and more volcanically active, western Ca-\nnary Islands there at least 14 large failures on El Hierro, La Palma and Tenerife (Mas-\nson et al. 2002). The failures are smaller in volume than those in Hawaii. The debris \navalanches are superficial and up to 2 km thick. They have areas of a few thousand ki-\n676  \nlometers, volumes of 50 to 200 m3 and runouts of 50 to 100 km. Glide planes at the base \nof the avalanches are typically up to 10º on the upper slope and less than 5º on the lower \nslopes. The majority of Canary Island failures are less than 1 million years old. The \nyoungest, on the northwest flank of El Hierro, is 15,000 thousand years BP. There is no \nregularity in the failures, but on average, as with Hawaii, they take place every 100,000 \nyears. The most common failure mechanism is a catastrophic debris avalanche. \n \nDespite the overall evidence from Hawaii that lateral volcanic collapse can result in \nhazardous tsunamis, there has been much debate about whether collapse of the Canary \nIslands volcanoes poses a similar risk (Wynn and Masson 2003). As with landslides in \nnon-volcanic sediments, such as at Storegga, it has been proposed that the Canary vol-\ncanoes fail retrogressively, thus reducing their ability to create a large tsunami. Contro-\nversially, Ward and Day (2001) propose that a 500 km3 collapse of Cumbre Vieja vol-\ncano on La Palma could create a tsunami that would be catastrophic in the near field \nand extremely dangerous to the east coast of America. Simulations of a smaller scale \ncollapse on La Palma (e.g. 375 km3) (Løvholt et al. 2008) indicates that local runups \nwould indeed be devastating, but with less significant consequences in the far field. It is \nclear from the modeling, that the volume of the collapse, as well the particular environ-\nment, slide mobility, as well as the model used, is important in identifying and resolving \nwhether a hazardous tsunami would be formed. Notwithstanding the controversy in the \nfar field, sedimentary deposits at 188 m on Grand Canaria have been identified as \nsourced from a collapse tsunami (Pérez-Torrado et al. 2006) thereby indicating that the \nlocal event caused by a volcanic collapse may well be extremely dangerous to local \ncommunities if of sufficient volume. \n5. Subaerial Failures \nA number of tsunamis have been created by subaerial landslides. The most well \nknown is at Lituya Bay in 1948 (Miller 1960). Triggered by an earthquake, a 4.3 km3 \nlandslide failed into the sea creating a tsunami up to 524 meters high. Two people died \nin the event. The most catastrophic tsunami created by a subaerial failure, was at Vaiont \nin Italy in 1963 (Hendron and Patten 1985). Although perhaps not strictly a tsunami, \nmore a seiche, the collapse was created by a combination of reservoir water drawdown \nand heavy rains. There were warning signs. The displaced water overtopped the dam \nand a 250 m high wave flooded the valley below, drowning 2,000 people. In 1783, at \nScilla in Calabria, a cliff collapsed into the sea causing a devastating tsunami  in which \n1,500 perished (Graziani et al. 2006). The fatalities were particular heavy because sur-\nvivors from the previous day’s earthquake were taking shelter on the open beach at Scil-\nla located about 1 km east of the collapse. The waves reached up to 200 m inland and up \nto 8.3 m run-up within the town. \n677 \n6. Tsunami Hazard \nReview of mass transport events in the different environments described demon-\nstrates that they all have potential to create hazardous if not devastating tsunamis. As-\nsessment of the hazard and risk from tsunami however, is at an early stage and although \nunderstanding of processes has advanced significantly over the past decade the database \nof well studied events is still small. On the North Atlantic passive continental margins, \nthere is a good preliminary understanding of the process of deposition and landslide \nfailure. Yet there is still a paucity of data to confirm or refute recent hypotheses on how \nthese failures relate to tsunami generation. There are still too few case studies of actual \nevents, particularly parametric modeling of tsunami generation based on the architecture \nof known failures. More dates of landslide failure are required to test hypotheses on \nclimate control of mass failure processes. At first sight, the large number of landslides \nsuggests high risk. However, the likelihood of future tsunami from slide failure may not \nbe as great as the numerous landslides suggest. The work of Lee (in press) indicates that \nmost landslides fail during glacial periods or just after, thus the risk of tsunamis today \nmay not be as  great as at previous periods over the past 10,000 years. But more re-\nsearch is required, especially in dating more landslide events. \n \nApart from the major climate controls on slope stability, there are others that are ef-\nfective now. On the Scotian margin, as demonstrated by the Grand Banks tsunami, there \nis a risk of submarine landslides triggered by earthquakes during interglacials. As noted \nby Piper et al. (2003) there have been three >M7 events since 1800 and these have the \npotential to trigger landslides (Piper et al. (1985).  Progressive creep failure may also be \na trigger (Piper et al. 2003). With regard to tsunami magnitude, the Grand Banks \nlandslide was in quite deep water, yet generated an event that resulted in much destruc-\ntion and loss of life.  \n \nAlong the US Atlantic margin the earthquake trigger risk may not be as great as off \nCanada (ten Brink et al. in press). However, salt movement may be an added threat  \n(Hornbach et al. 2007). The lack of evidence of tsunami from onshore (or in fact off-\nshore cored sediments) is intriguing. The preservation potential of tsunami deposits is \nundoubtedly low. Subsidence increases the likelihood of preservation, such along the \nCascadia margin where tsunami deposits over thousands of years have been laid down. \nSubsidence may not be taking place along passive margins, especially those previously \nsubject to post glacial uplift, although there are advantages here as demonstrated by the \nStoregga deposits. Alternatively, tsunami sediments may not have been discriminated \nfrom other depositional sources, such as storms. Also, given that many submarine \nlandslides took place at lowered sea levels, the lack of deposits may be because of the \nwidth of the US continental shelf, that in places up to 200 km wide.  \n \nOne aspect of landslides that is still controversial is the role of hydrate dissociation in \nthe initiation of their failure (e.g. Maslin et al. 2004). As yet there are few definitive \nstudies that show that this process has definitely caused a landslide. Most of the \nlandslides dated by Lee (in press) from the last 20,000 yr, were emplaced during stable \nor rising sea level, a period when hydrate disassociation would least be expected. In ad-\ndition, the relatively poor accuracy of landslide dates makes it difficult to associate fail-\n678  \nure events with relatively short periods of sea level fall (Maslin et al. 2004). Hydrate \ndissociation was considered as a trigger of the Storegga slide, but this has been dis-\ncounted as a major factor (Bryn et al. 2005). Although there is a lot of circumstantial \nevidence on the association between hydrates and submarine landslides, isotopic ice \ncore evidence now shows that methane increase during interglacials is from non-marine \nsources (Sowers 2006). \n \n \nWith regard to other passive margins, the evidence on which to assess the hazard \nfrom of submarine landslide tsunami is patchy. There are large mass failures off the \nAmazon Fan, but these are in deep water. Off southern Africa, there is the Aguhlas \nslump. In both areas there is no evidence of associated tsunami. In other landslide terri-\ntories, such as fjord regions, the well researched tsunamis associated with the 1964 \nearthquake illustrate that these areas are may be prone, but not everywhere. Although, \nmass failures are known from Norway (e.g. Finneidford 1996), there is no evidence of \nassociated tsunami. The likelihood is perhaps that the glaciers feeding the fjord head \ndeltas in North America are of a larger scale than those in Norway. Regarding active \nriver delta environments, the lack of tsunamis in the Gulf of Mexico, where there are \nnumerous submarine landslides appears contradictory. Absence of tsunamis may be be-\ncause the landslides are too deep, and tsunamis generated too small to notice. The storm \nconditions under which they are triggered may mask any associated tsunami. During a \nCategory 5 hurricane, would a tsunami wave be identified in the storm surge?  \n \nAlong convergent margins there is a tsunami hazard from both submarine landslides \nand volcanic flank collapse. The PNG event flagged the landslide hazard, and recent \n(and continuing) re-evaluation of anomalous tsunami events suggests that some ano-\nmalous earthquake tsunamis may be the result of submarine landslides. Review of tsu-\nnami processes along convergent margins also indicate that thick and rapid sedimenta-\ntion regimes are not necessarily the locations of large-scale submarine failure; in \nregions of frequent earthquakes more frequent and smaller landslides may result, and \nhence a reduced tsunami hazard. More work is required to test this hypothesis. Smooth \nslopes along the margins seem to be the result of frequent events (McAdoo et al. 2004). \nHowever, along the Sunda margin, the slopes are heavily gullied and, mass failures fre-\nquent. More re-evaluations of anomalous tsunami events are required to assess the ha-\nzard along these margins. Small landslides, such as PNG are a real threat, but it will be \nvery difficult to identify potential locations where these may be located. As noted by \nMosher and Piper (2003) swath bathymetry doesn’t always provide definitive proof of \nthe presence (or absence) of landslides. Large failures have been mapped along South-\nern and Middle American Pacific margins, for example the massive slide off Peru (von \nHuene et al. 1989). Large mass failures have also been mapped off of Costa Rica and \nNicaragua (von Huene et al. 2004). Modeling of these events indicates that failure \nwould result in a 50 m high tsunami wave at source.  However, care has to exercised in \ndiscriminating the tsunami sources at these plate boundaries, deep water locations. \nSome ‘slow’ earthquakes may reproduce the same effects as a submarine landslide (e.g. \nPelayo and Wiens 1990). The main discrimination between a slow earthquake and \nlandslide tsunami is that the runups from latter would be more focused, and with a sig-\nnificant peak runup (Tappin et al. 2008). Additionally, there may be combined events, \n679 \nboth earthquake and landslide as may have occurred at Messina in 1908 (Tappin et al. \n2008). \n \nTsunamis from volcanic flank collapse into the ocean can be catastrophic, as shown \nby historical events from the convergent margins of Japan and Ritter Island, PNG. Thus \nvolcanic tsunamis at these locations are a real threat, more so because at present col-\nlapse cannot yet be predicted, as at Stromboli in 2002. They may also be very near \ndensely populated areas. On oceanic islands, such as Hawaii and the Canary Islands \nthere has been debate on the mechanism of flank collapse – catastrophic or incremental \n– and whether the collapse creates hazardous tsunamis. Certainly in both locations any \nmoderate if not small collapse could be very destructive locally. On Stromboli, a small \nfailure created a local tsunami of 10 m. In the far field the resultant tsunami would de-\npend on the scale of the collapse. Although a sedimentary slide on a passive margin, the \nevidence from Storegga shows that its’ collapse created a tsunami that travelled at least \nas far as the Faeroes. The 2.5 km3 collapse on Oshima-Oshma Island created a 2-3 m \ntsunami in Korea 1,000 km away. However, the evidence from Hawaii, and perhaps the \nCanary Islands, is that collapse is more likely during the early stages of volcanic evolu-\ntion, thus the hazard may be small. Additionally, collapse may be more prevalent during \nclimates not similar to those experienced at present.   \n \n \nAcknowledgments   Thanks to the patience and encouragement of Jason Chaytor, who also provided \nan excellent review.  This paper is published with the permission of the Director of the British Geologi-\ncal Survey, Natural Environment Research Council, UK.  \n7. References  \nBea, R.G., Wright, S.G., Sicar, P. and Niedoroda, A.W., 1983. Wave-induced slides in South Pass \nBlock 70, Mississippi delta. Journal of Geotechnical Enginering, 109: 619–644. \nBilli, A. et al., 2008. On the cause of the 1908 Messina tsunami, southern Italy. Geophysical Re-\nsearch Letters, 35(L06301). \nBohannon, R.G. and Gardner, J.V., 2004. Submarine landslides of San Pedro Sea Valley, south-\nwest Long Beach, California. Marine Geology, 203: 261-268. \nBondevik, S., Mangerud, J., Dawson, S., Dawson, A. and Lohne, Ø., 2003. Record-breaking \nheight for 8000-year-old tsunami in the North Atlantic. EOS, 84: 289,293. \nBondevik, S., Mangerud, J., Dawson, S., Dawson, A. and Lohne, Ø., 2005. Evidence for three \nNorth Sea tsunamis at the Shetland Islands between 8000 and 1500 years ago. Quater-\nnary Science Reviews 24: 1757–1775. \nChaytor, J.D., Twichell, D.C., ten Brink, U.S., Buczkowski, B.J. and Andrews, B.D. (Editors), \n2007. Revisiting submarine mass movements along the U.S. Atlantic continental mar-\ngin: implications for tsunami hazard. Submarine Mass Movements and their Conse-\nquences. Springer, 394-403 pp. \nCooke, R.J.S., 1981. Eruptive history of the volcano at Ritter Island. In: R.W. Johnson (Editor), \nCooke–Ravian Volume of Volcanological Papers. Geological Survey of Papua New \nGuinea Memoir 10, pp. 115–123. \n680  \nCoulter, H.W. and Migliaccio, R.R., 1966. Effects of the earthquake of March 27, 1964 at Valdez, \nAlaska 542-C. US Geol. Survey Prof., Paper 542-E. \nDeplus, C. et al., 2001. Submarine evidence for large-scale debris avalanches in the Lesser Anti-\nlles Arc. Earth and Planetary Science Letters, 192(2): 145-157. \nDingle, R.V., 1977. Anatomy of a large submarine slump on sheared continentgal margin (south-\neast Africa). Jounal of the Geological Society of London, 134: 293-310. \nElsworth, D. and Day, S.J., 1999. Flank collapse triggered by intrusion: the Canarian and Cape \nVerde Archipelagoes. Journal of Volcanology and Geothermal Research, 94(1-4): 323-\n340. \nFisher, M.A., Normark, W.R., Greene, H.G., Lee, H.J. and Sliter, R.W., 2005. Geology and tsu-\nnamigenic potential of submarine landslides in Santa Barbara Channel, Southern Cali-\nfornia. Marine Geology, 224(1-4): 1-22. \nFrancis, P.W., 1985. The origin of the 1883 Krakatau tsunamis. Journal of Volcanological and \nGeothermal Research 25: 349–369. \nFryer, G.J., Watts, P. and Pratson, L.F., 2004. Source of the great tsunami of 1 April 1946: a \nlandslide in the upper Aleutian forearc. Marine Geology 203: 201-218. \nGoldfinger, C., Kulm, L.D., McNeill, L.C. and Watts, P., 2000. Super-scale failure of the south-\nern Oregon Cascadia margin. In: B. Keating, C. Waythomas and A. Dawson (Editors), \nSpecial Issue on Landslides Tsunamis. Pure and Applied Geophysics, pp. 1189-1226. \nGraziani, L., Maramai, A. and Tinti, A., 2006. A revision of the 1783–1784 Calabrian (southern \nItaly) tsunamis. Natural Hazards and Earth System Sciences, 6: 1053–1060. \nGreene, H.G. et al., 2005. Submarine landslides in the Santa Barbara Channel as potential tsunami \nsources. Natural Hazards and Earth System Sciences, 6: 63–88. \nHampton, M.A., Lee, H.J. and Locat, J., 1996. Submarine Landslides. Reviews of Geophysics, \n34: 33-59. \nHampton, M.A., Lemke, R.W. and Coulter, H.W., 1993. Submarine landslides that had a signifi-\ncant impact on man and his activities: Seward and Valdez, Alaska. In: W.C. Schwab, \nH.J. Lee and D.C. Twichell (Editors), Submarine Landslides: Selected Studies in the US \nEEZ. USGS Bull., pp. 123–142. \nHeezen, B.C., Ericsson, D.B. and Ewing, M., 1954. Further evidence of a turbidity current follow-\ning the 1929 Grand Banks earthquake. Deep Sea Research, 1: 193–202. \nHendron, A.J. and Patten, F.D., 1985. The Vaiont Slide. . US Corps of Engineers Technical Re-\nport GL-85-8. \nHornbach, M.J., Lavier, L.L. and Ruppel, C.D., 2007. Triggering mechanism and tsunamogenic \npotential of the Cape Fear Slide complex, U.S. Atlantic margin. Geochem. Geophys. \nGeosyst., 8(Q12008). \nHornbach, M.J., Mondziel, S.A., Grindlay, N.R., Frohlich, C. and Mann, P., 2008. Did a subma-\nrine slide triger the 1918 Puerto Rico tsunami? Science of Tsunami Hazards, 27, No. 2: \n1-31. \nHühnerbach, V., Masson, D.G. and partners, C.p., 2004. Landslides in the north Atlantic and its \nadjacent seas: an analysis of their morphology, setting and behaviour. Marine Geology, \n213: 343–362. \nImamura, F., Gica, E., Takahashi, T. and Shuto, N., 1995. Numerical simulation of the 1992 \nFlores tsunami: Interpretation of tsunami phenomena in northeastern Flores Island and \ndamage at Babi Island. Pure Appl. Geophys., 144: 555–568. \nJiang, L. and LeBlond, P.H., 1994. Three dimensional modelling of tsunami generation due to \nsubmarine mudslide. J. Phys. Ocean, 24: 559–573. \n681 \nJohnson, R.W., 1987. Large-scale volcanic cone collapse: the 1888 slope failure of Ritter Volca-\nno, and other examples from Papua New Guinea. Bulletin of Volcanology, 49: 669–\n679. \nLastras, G. et al., 2004. Characterisation of the recent BIG'95 debris flow deposit on the Ebro \nmargin, Western Mediterranean Sea, after a variety of seismic reflection data. Marine \nGeology, 213: 235–255. \nLeBlond, P.H. and Jones, A., 1995. Underwater landslides ineffective at tsunami generation. Sci. \nTsunami Hazards, 13: 25–26. \nLee, H.J., 1989. Undersea landslides: extent and significance in the Pacific Ocean. In: E.E. Brabb \nand B.L. Harrod (Editors), Landslides, extent and economic significance. Proceedings \nof the 28th International Geological Congress: symposium on landslides, Washington, \nD.C., pp. 367–380. \nLee, H.J., 2005. Undersea landslides: extent and significance in the Pacific Ocean, an update. \nNatural Hazards and Earth System Sciences, 5: 877–892. \nLee, H.J., in press. Timing of occurrence of large submarine landslides on the Atlantic Ocean \nmargin. Marine Geology, In Press, Corrected Proof. \nLee, H.J., Kayen, R.E., Gardner, J.V. and Locat, J., 2003. Characteristics of several tsunamigenics \nsubmarine landslides. In: J. Locat and J. Mienert (Editors), Submarine Mass Move-\nments and their Consequences. Kluwer, The Netherlands, pp. 357–366. \nLemke, R.W., 1967. Effects of the earthquake of 27 March 1964, at Seward, Alaska. US Geol. \nSurvey Prof., Paper 542-E. \nLocat, J., Locat, P., Lee, H.J. and Imran, J., 2004. Numerical analysis of the mobility of the Palos \nVerdes debris avalanche, California, and its implication for the generation of tsunamis. \nMarine Geology 20(3): 269-280. \nLópez-Venegas, A.M., Brink, U.S.t. and Geist, E.L., 2008. Submarine landslide as the source for \nthe October 11, 1918 Mona Passage tsunami: Observations and modeling. Marine Ge-\nology, 254: 35–46. \nLøvholt, F., Pedersen, G. and Gisler, G., 2008. Oceanic propagation of a potential tsunami from \nthe La Palma Island. J. Geophys. Res., 113(C09026). \nMaslin, M., Mikkelsen, N., Vilela, C. and Haq, B., 1998. Sea-level -and gas-hydrate-controlled \ncatastrophic sediment failures of the Amazon Fan. Geology, 26(12): 1107-1110. \nMaslin, M., Owen, M., Day, S. and Long, D., 2004. Linking continental-slope failures and cli-\nmate change: Testing the clathrate gun hypothesis. Geology, 32(1): 53–56. \nMasson, D.G. et al., 2002. Slope failures on the flanks of the western Canary islands. Earth \nScience Reviews 57: 1–35. \nMcAdoo, B., Pratson, G. and Orange, L.F., 2000. Submarine Landslide Geomorphology, U.S. \nContinental Slope. Marine Geology 169: 103-136. \nMcAdoo, B.G., Capone, M.K. and Minder, J., 2004. Seafloor geomorphology of convergent mar-\ngins: implications for Cascadia seismic hazard. Tectonics, 23. \nMcGuire, W.J., 1996. Volcano instability: a review of contemporary themes. Geological Society, \nLondon, Special Publications, 110(1): 1-23. \nMcGuire, W.J. et al., 1997. Correlation between rate of sea-level change and frequency of explo-\nsive volcanismin the Mediterranean. Nature, 389: 473-476. \nMcMurtry, G.M. et al., 2004a. Megatsunami deposits on Kohala volcano, Hawaii, from flank col-\nlapse of Mauna Loa. . Geology 32: 741–744. \nMcMurtry, G.M., Watts, P., Fryer, G.J., Smith, J.R. and Imamura, F., 2003. Giant landslides, \nmega-tsunamis, and paleo-sea level in the Hawaiian Islands. Marine Geology 203: 219-\n233. \n682  \nMcMurtry, G.M., Watts, P., Fryer, G.J., Smith, J.R. and Imamura, F., 2004b. Giant landslides, \nmega-tsunamis, and paleo-sea level in the Hawaiian Islands. Marine Geology 203: 219-\n233. \nMienert, J. (Editor), 2002. Special issue: European North Atlantic Margin (ENAM II): quantifica-\ntion and modelling of large-scale sedimentary processes. Marine Geology, 188, 1–248 \npp. \nMiller, D., 1960. Giant waves in Lituya Bay, Alaska. Geol. Surv. Prof. Pap., 354-C. \nMiyachi, M., 1992. Geological examination of the two old maps from the Tokugawa Era concern-\ning the Shimabara Catastrophe. In: T. Yanagi, H. Okada and K. Ohta (Editors), Unzen \nVolcano, the 1990-1992 eruption. Nishinippon & Kyushu University Press, pp. 99-102. \nMoore, G.W. and Moore, J.G., 1988. Large-scale bedforms in boulder gravel produced by giant \nwaves in Hawaii, Sedimentologic Consequences of Convulsive Geologic Events. Spec. \nPap. Geol. Soc. Am. , pp. 101-110. \nMoore, J.G. et al., 1989. Prodigious submarine landslides on the Hawaiian Ridge. J. Geophys. \nRes, 94: 17465-17484. \nMosher, D.C. and Piper, D.J.W., 2007. Analysis of multibeam seafloor imagery of the Laurentian \nFan and the 1929 Grand Banks landslide area. In: V. Lykousis, D. Sakellariou and J. \nLocat (Editors), Submarine Mass Movements and their Consequences. Springer, pp. 77-\n88. \nNishimura, Y., Miyaji, N. and Suzuki, M., 1999. Behavior of historic tsunamis of volcanic origin \nas revealed by onshore tsunami deposits. Physics and Chemistry of the Earth, Part A: \nSolid Earth and Geodesy, 24(11-12): 985-988. \nNormark, W.R., McGann, M. and Sliter, R., 2004. Age of Palos Verdes submarine debris ava-\nlanche, southern California. Marine Geology 203: 247-259. \nPelayo, A.M. and Wiens, D.A., 1990. The Novemeber 20, 1960 Peru tsunami earthquake: source \nmechanism of a slow event. Geophysical Research Letters, 17(6): 661-664. \nPérez-Torrado, F.J. et al., 2006. Tsunami deposits related to flank collapse in oceanic volcanoes: \nThe Agaete Valley evidence, Gran Canaria, Canary Islands. Marine Geology, 227(1-2): \n135-149. \nPiper, D.J.W. and Asku, A.E., 1987. The source and origin of the 1929 Grand Banks turbidity \ncurrent inferred from sediment budgets. Geo Marine Letters, 7: 177–182. \nPiper, D.J.W. and McCall, C., 2003. A synthesis of the distribution of submarine mass move-\nments on the eastern Canadian Margin. In: J. Locat and J. Mienert (Editors), Submarine \nmass movements and their consequences. Kluwer Academic Publishers, pp. 291–298. \nPlafker, G., Kachadoorian, R., Eckel, E.B. and Mayo, L.R., 1969. Effects of the earthquake of \nMarch 27, 1964 on various communities, US Geol. Survey Prof., Paper 542-G. \nPrior, D.B., Bornhold, B.D., Coleman, J.M. and Bryant, W.R., 1982. Morphology of a submarine \nslide, Kitimat Arm, British Columbia. Geology, 10: 588–592. \nPrior, D.B., Bornhold, B.D. and Johns, M.W., 1986. Active sand transport along a fjord-bottom \nchannel, Bute Inlet, British Columbia. Geology, 14: 581–584. \nQuidelleur, X., Hildenbrand, A. and Samper, A., 2008. Causal link between Quaternary paleocli-\nmatic changes and volcanic islands evolution. Geophysical Research Letters \n35(L02303). \nRajendran, C.P., Ramanamurthy, M.V., Reddy, N.T. and Rajendran, k., 2008. Hazard implica-\ntions of the late arrival of the 1945 Makran tsunami. Current Science 95(12): 1739-\n1743. \nRathburn, A.E. et al., 2009. Geological and biological heterogeneity of the Aleutian margin \n(1965-4822 m). Progress In Oceanography, 80(1-2): 22-50. \n683 \nRubin, K.H., Fletcher, C.H., III and Sherman, C., 2000. Fossiliferous Lanai deposits formed by \nmultiple events rather than a single giant tsunami. Nature 408: 675-681. \nSatake, K., 2007. Volcanic origin of the 1741 Oshima-Oshima tsunami in the Japan Sea. Earth \nPlanets Space, 59: 381-390. \nSatake, K., Smith, J.R. and Shinozaki, K., 2002. Three-dimensional reconstruction and tsunami \nmodel of the Nuuanu and Wailau giant landslides. In: E. Takahashi, P. Lipman, M. \nGarcia, J. Naka and S. Aramaki (Editors), Hawaiian Volcanoes : Deep Underwater \nPerspectives. AGU Monograph pp. 333-346. \nSelf, S. and Rampino, M.R., 1981. The 1883 eruption of Krakatau. Nature, 294: 699-704. \nSiebert, L., 1984. Large volcanic debris avalanches: characteristics of source areas, deposits, and \nassociated eruptions. Journal of Volcanology and Geothermal Research, 22: 163-197. \nSiebert, L., Glicken, H. and Ui, T., 1987. Volcanic hazards from Bezymianny- and Bandai-type \neruptions. Bulletin of Volcanology, 49: 435-459. \nSigurdsson, H., S. Carey, C. Mandeville and Bronto, S., 1991. Pyroclastic flows of the 1883 Kra-\nkatau eruption. Eos Trans. AGU, 72(36): 377, 380–381. \nSilver, E. et al., 2005. Island Arc Debris Avalanches and Tsunami Generation. Eos, 86(47): 485, \n489. \nSimkin, T. and Fiske, R.S., 1983. Krakatau 1883: the volcanic eruption and its effects. Smithso-\nnian Institution Press, Washington, D.C. \nSolheim, A., Bryn, P., Sejrup, H.P., Mienert, J. and Berg, K., 2005. Ormen Lange—an integrated \nstudy for the safe development of a deep-water gas field within the Storegga Slide \nComplex, NE Atlantic continental margin; executive summary. Marine and Petroleum \nGeology, 22: 1-9. \nSowers, T., 2006. Late Quaternary Atmospheric CH4 Isotope Record Suggests Marine Clathrates \nAre Stable. Science, 311: 838-840. \nStearns, H.T., 1978. Quaternary shorelines in the Hawaiian Islands. Bernice P. Bishop Museum \nBulletin, 237: 57pp. \nTappin, D.R., McNeil, L., Henstock, T. and Mosher, D. (Editors), 2007. Mass wasting processes - \noffshore Sumatra. Submarine Mass Movements and Their Consequences. Springer, \n327-336 pp. \nTappin, D.R., Watts, P. and Grilli, S.T., 2008a. The Papua New Guinea tsunami of 17 July 1998: \nanatomy of a catastrophic event. Nat. Hazards Earth Syst. Sci., 8(1–24). \nTappin, D.R. et al., 2008b. The 1908 Messina tsunami. Some comments on the source: earth-\nquake, submarine landslide or a combination of both? . Eos Trans. AGU, 89 (53) Fall \nMeeting Suppl., Abstract S41D-07. \nTappin, D.R., Watts, P., McMurtry, G.M., Lafoy, Y. and Matsumoto, T., 2001. The Sissano Pa-\npua New Guinea tsunami of July 1998 - offshore evidence on the source mechanism. \nMarine Geology 175: 1-23. \nten Brink, U.S., Lee, H.J., Geist, E.L. and Twichell, D., in press. Assessment of tsunami hazard to \nthe U.S. East Coast using relationships between submarine landslides and earthquakes. \nMarine Geology. \nTuttle, M.P., Ruffman, A., Anderson, T. and Jeter, H., 2004. Distinguishing tsunami from storm \ndeposits in eastern North America: the 1929 Grand Banks tsunami versus the 1991 Hal-\nloween storm. Seismological Research Letters, 75(117–131). \nVan Padang, M., 1971. Two Catastrophic Eruptions in Indonesia, Comparable with the Plinian \nOutburst of the Volcano of Thera (Santorini) in Minoan Time. Acta of the 1st Intl. Sci. \nCong. on the Volcano of Thera; Arch. Services of Greece, General Direction of Anti-\nquitiest and Research, Athens: 51–63. \n684  \nvon Huene, R., Bourgois, J. and Miller, J., Pautot, G., 1989. A large tsunamogenic landslide and \ndebris flow along the Peru Trench. Journal of Geophysical Research, 94: 1703-1714. \nvon Huene, R., Ranero, C.R. and Watts, P., 2004. Tsunamigenic slope failure along the Middle \nAmerica Trench in two tectonic settings. Marine Geology, 203: 303-317. \nWard, S.N. and Day, S., 2001. Cumbre Vieja volcano – Potential collapse and tsunami at La Pal-\nma, Canary Islands. Geophysical Research Letters, 28(17) 3397– 3400. \nWaythomas, C.F. and Neal, C.A., 1997. Tsunami Generation during the 3500 yr BP Caldera-\nforming Eruption of Aniakchak Volcano. EOS Trans., Am. Geophys. Union 78, F816. \nWeaver, P.P.E., Wynn, R.B., Kenyon, N.H. and Evans, J., 2000. Continental margin sedimenta-\ntion, with special reference to the north-east Atlantic margin. Sedimentology, 47 (Suppl. \n1): 239–25. \nWynn, R. and Masson, D., 2003. Canary Islands landslides and tsunami generation: Can we use \nturbidite deposits to interpret landslide processes. In: J. Locat and J. Mienert (Editors), \nSubmarine Mass Movements and Their Consequences. Kluwer Acad., Dordrecht, Neth-\nerlands, pp. 325– 332. \nYokoyama, I., 1987. A scenario of the 1883 Krakatau tsunami. Journal of Volcanology and Geo-\nthermal Research, 34(1-2): 123-132. \nZielinski, G.A., Mayewski, P.A., Meeker, L.D., Whitlow, S. and Twickler, M.S., 1996. An \n110,000-year record of explosive volcanism from the GISP2 (Greenland) ice core. Qua-\nternary Research, 43: 109–118. \n \n \n"}