{"doi":"10.1109\/EDMO.2003.1260051","coreId":"113639","oai":"oai:epubs.surrey.ac.uk:1234","identifiers":["oai:epubs.surrey.ac.uk:1234","10.1109\/EDMO.2003.1260051"],"title":"Thermal Processing Effects in Proton-Isolated N-Type GaAs Devices","authors":["Ahmed, S","Amirov, K","Larsson, U","Too, P","Sealy, B J","Gwilliam, R"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-01-01","abstract":"<p>In this paper we present the results of two new experiments (1) Infrared Reflectivity (IR) measurements of the thickness of the modified layers following the proton implantation in n-type GaAs layers at various implant temperatures and (2) a detailed study of the thermal stability of n-type GaAs layers isolated by proton implantation. It is found that the threshold dose (minimum implant dose required for a maximum sheet resistivity) for a device is a key parameter to obtain good thermal stability. The optical properties also depend on the implantation temperature and dose.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1234<\/identifier><datestamp>\n      2017-10-31T14:01:11Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D636F6E666572656E63655F6974656D<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:696F6E5F6265616D<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1234\/<\/dc:relation><dc:title>\n        Thermal Processing Effects in Proton-Isolated N-Type GaAs Devices<\/dc:title><dc:creator>\n        Ahmed, S<\/dc:creator><dc:creator>\n        Amirov, K<\/dc:creator><dc:creator>\n        Larsson, U<\/dc:creator><dc:creator>\n        Too, P<\/dc:creator><dc:creator>\n        Sealy, B J<\/dc:creator><dc:creator>\n        Gwilliam, R<\/dc:creator><dc:description>\n        <p>In this paper we present the results of two new experiments (1) Infrared Reflectivity (IR) measurements of the thickness of the modified layers following the proton implantation in n-type GaAs layers at various implant temperatures and (2) a detailed study of the thermal stability of n-type GaAs layers isolated by proton implantation. It is found that the threshold dose (minimum implant dose required for a maximum sheet resistivity) for a device is a key parameter to obtain good thermal stability. The optical properties also depend on the implantation temperature and dose.<\/p><\/dc:description><dc:date>\n        2003-01-01<\/dc:date><dc:type>\n        Conference or Workshop Item<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1234\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Ahmed, S, Amirov, K, Larsson, U, Too, P, Sealy, B J and Gwilliam, R  (2003) Thermal Processing Effects in Proton-Isolated N-Type GaAs Devices  In: The 11th IEEE International Symposium on Electron Devices for Microwave and Optoelectronic Applications, 2003. EDMO 2003..     <\/dc:identifier><dc:relation>\n        10.1109\/EDMO.2003.1260051<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1234\/","10.1109\/EDMO.2003.1260051"],"year":2003,"topics":[],"subject":["Conference or Workshop Item","NonPeerReviewed"],"fullText":"Thermal processing effects in proton-isolated n-type GaAsdevices \nS. Ahmed\"', K. Amirov', U. Lamon*, P. Too', B. J. Sealy' and R. Gwilliam' \nAdvanced Technology Institute, University of Surrey, Guildford, GU2 7XH, United Kingdom \n'Department of Physics, Uppsala University, Box 530 SE-75 1 2 1 Uppsala, Sweden \n*Tel: 44 (0) 1483 683373 \n1 \nFax: 44 (0) 1483 689404 E-mail: s.ahmed@eim.surrey.ac.uk \nAbstract \nIn this paper we present the results' of two new experiments (1) Infrared Reflectivity \n(IR) measurements of the thickness of the modified layers following the proton implantation \nin n-type GaAs layers at various implant temperatures and (2) a detailed study of the thermal \nstability of n-type GaAs layers isolated by proton implantation. It is found that the threshold \ndose (minimum implant dose required for a maximum sheet resistivity) for a device is a key \nparameter to obtain good thermal stability. The optical properties also depend on the \nimplantation temperature and dose. \nIntroduction: \nCompound semiconductors are currently employed in the fabrication of optoelectronic \ndevices and integrated circuits (IC) for high frequency operations [I] .  Ion bombardment with \nappropriate ion doses in these materials is used to convert a conductive layer to a highly \nresistive one or to improve the electrical isolation between neighbouring devices in ICs. \nElectrical isolation of In-V semiconductors formed by introduction of a controlled \nconcentration of point defects from light ion irradiation is a well-established technique [2]. \nBesides the efficiency of this method to obtain highly isolated layers, it has the additional \nadvantage of maintaining the planarity of the isolated structures [3], Proton implantation of \nthe n-type GaAs wafers produces a variety of lattice defects, such as vacancies and \ninterstitials, which can trap the free electrons and reduce the carrier concentration in the \nimplanted region. Thermal processing of the crystal tends to remove this damage and reduce \nthe degree of compensation, while at the same time producing diffusion of the defect centres \n[4]. Proton implantation is also used to form infrared optical waveguides as well as other \nguided wave components [4]. For such devices, annealing ofthe implanted regions is required \nin order to reduce the propagation losses to acceptable levels [4-5]. Therefore thermal \nprocessing due to elevated implantation temperature and post-implant annealing cycles is \ncrucial to enable electrical and optical characteristics. In the present article, a systematic \ninvestigation of the dependence of the threshold dose on the thermal process for isolation as a \nfunction of the original donor concentration in GaAs structures and their thermal stability is \nreported. Optical changes due to variation ofthe implantation temperature are also discussed. \nExperimental: \nThe starting material was prepared using multi-energy silicon ion implantation into \nsemi-insulating GaAs at various doses to form a micron thick n-type GaAs layer of two \ndifferent initial sheet carrier concentrations (n, = 3 . 3 ~ 1 0 ' ~  e-\/cmz and n, = 3 . 2 ~ 1 0 ' ~  e-\/cm2). \nThe isolation was obtained by proton irradiation at energy of 300 keV to place the peak of the \n0-7803-7904-7\/03\/$17.00 02003 IEEE. 210 \nAuthorized licensed use limited to: University of Surrey. Downloaded on February 5, 2010 at 06:46 from IEEE Xplore.  Restrictions apply. \ndamage distribution (2.45 'microns) well inside the semi-insulating 'GaAs substrate and to \nproduce a constant level of damage in the near surface region. All doping implants were \nperformed at room temperature using a Danfysik 1090 implanter or a 2MV High Voltage \nEngineering Europe implanter. The normal to the wafers was inclined at 7' with respect to \nthe beam to minimise ion channelling. The wafers were then encapsulated on both back and \nfront sides with 500-800A of Si3N4 deposited by the plasma enhanced chemical vapour \ndeposition (PECVD) technique at a temperature of 300°C. Rapid thermal annealing (RTA) \nwas carried out at 900°C: for 30s in order to electrically activate the implanted Si. The \nencapsulant was removed in 10% buffered HF acid and cleaned with organic solvents after \nbeing cleaved to obtain several samples of approximately 1 cm2. Cloverleaf pattems were \nphoto-lithographically defined on the surface of the samples using photoresist. Following this \nprocess, the exposed area of the samples was etched to a depth of 4pm in a solution of H202: \nHzSO4: (1: 2.5: 2.5 vol.) to form structures suitable for van der Pauw measurements. \nThe total etch depth was measured using a Rank Taylor Hobson Talystep, the error typically \nbeing 5%. Ohmic contacts were formed using tin (Sn) dots applied to the GaAs surface and \nannealed for 1-2 minutes in a forming as ambient. Isolation implants were performed at \ndifferent doses ( 5 ~ 1 0 ' ~  cm-', 2 ~ l O ' ~ c m - ,  5~lO'~cm-*and 2x10L5 cm-*) at room temperature \n(RT). Additionally, some samples were also implanted at -196\"C, 100°C and 200°C for \noptical characterisation using Infrared Reflectivity measurements. For liquid nitrogen \ntemperature (-196°C) and hot implantation, special arrangements were made in order to cool \ndown or heat up the sample stage to the required temperatures. During implantation the beam \ncurrent was maintained below O.lpAcm-Z. The doped regions under the contact areas were \nmasked using the previously applied Sn contacts and a molybdenum foil on top of those \ncontacts. \nThe Hall and resistivity measurements were carried out using a Bio-Rad \nHL5900 system. All measurements were done at RT. The reflectivity spectra of the samples \nwere taken with a Shimadzu UV3010 spectrophotometer. The beam was incident at an angle \nof 30 degrees from normal with a s read of k 8 degrees. Measurements were made over a \nspectral range from 4000 to 180 cm- and a number of fringes were observed for each of the \nas-implanted samples. The fringe pattems in the range from 2000 to 600 cm-' were very \nperiodic and hence were used to determine the thickness of the layer. \nResults and Discussion: \nInfrared Reflectivity (IR) Measurements \nMonochromatic light reflected from a transparent film on a substrate displays \ninterference effects due to multiple reflections at both boundaries of the film [5]. Many \nproperties of the film including its thickness and refractive index, can, in principle, be \ndetermined from this set of fringes. If the refractive index of the sample 9. is uniform and \ndoes not vaty appreciably over the spectral range of measurement, the resulting fringe pattem \nwill be simply periodic [6]. The periodicity of the fringes resulting from the Infrared \nReflectivity measurements can be used to estimate the thickness of the compensated film, \nwhich is inversely proportional to the average fringe separation. To a good approximation \nthickness, t I  is given by [7]: \nB \nP \n211 \nAuthorized licensed use limited to: University of Surrey. Downloaded on February 5, 2010 at 06:46 from IEEE Xplore.  Restrictions apply. \nwhere S denotes the average spectral separation (in wavenumbers) and B is the angle of \nincidence of the incoming light. A value of 3.29 was used for v s  since this is the average \nrefractive index for intrinsic GaAs in the specified spectral range [5] .  Figure 1 shows the \nmeasured average fringe separation as a function of implantation tem erature for proton- \nisolated GaAs layers of initial sheet carrier concentration of 3 . 3 ~ 1 0 ' ~  cm' , The measurements \nwere pejformed for a range of proton doses at different implantation temperatures. \n4 \n. \nLiquid Nitrogen implants are shown (Figure 1) to yield the lowest average fringe \nseparation and hence the thickest optically modified layer at each of the fluence levels used in \nthese experiments. For each substrate temperature during implantation, the thickness of the \ncompensated layer increased with increasing ion dose. For example, for a higher dose of \n2x1015 cm-* the cryogenic implants produce a compensated layer of about 4.1 microns thick \nwhereas the thickness is 3.3 microns in the case of 200°C implants. For a relatively lower \ndose of 5x1013 cm-* the thickness of compensated layer is about 3.2 and 2.8 microns, \nrespectively for liquid nitrogen and 200°C implants. It is interesting to note that the original n- \ntype layer is only about a micron thick for these experiments. The projected range, Rp, and \nstraggle, SRp, of 300 keV protons in GaAs are 2.45 and 0.27 microns, respectively as \ndetermined by the simulation code Transport of Ions in Matter (TRIM) [8,11]. We observe \nthat 200°C implants with lower proton dose produces a 2.8 microns thick compensated layer, \nwhich is in agreement with the thickness (%+ 8%) calculated by TRIM. For further higher \ndoses, the compensated layer produced at 200°C implantation is'thicker than the calculated \nthickness. If the defect centres are primarily removed during the enhanced dynamic annealing \ndue to hot implantation, the thickness of the compensated layer is reduced. The extent of this \nreduction may vary with the extent of damage produced by the proton implantation at various \ndoses. Further analysis of the reflectivity data is expected to yield accurate values for the \ndepths to which the optical effects extend. \nElectrical Measurements \nSamples implanted at RT were subsequently annealed in order to observe any changes \nin sheet resistivity (R,) with the post-implanted annealing temperatures. The thermal stability \nof implant isolation is a critical issue to consider in device applications. In particular, \nmaximising the thermal stability of the isolated regions is desirable. It is known [8-IO] that \nthe electrical isolation depends critically on ion dose and initial free carrier concentration. The \ndose dependence of sheet resistivity for our material [8] shows that at the low doses, R, \nremains relatively unaffected, while it increases abruptly due to both free carrier trapping at \ndefect levels and to mobility degradation with increasing dose. The sheet resistance as a \nfunction of dose reaches a narrow plateau when the concentration of deep levels is of the same \norder of magnitude as the free carrier concentration [9]. Any further increase in dose beyond \nthis plateau results in the monotonic decrease in R, because of hopping conduction of camers \nbetweenclosely spaced defects [9]. Following Ref. [SI, a thresholddose for isolation, D&, can \nbe defined as the minimum ion dose at which R, reaches its maximum value. These results [8- \n101 show that ion doses required for an effective isolation of GaAs have simple linear and \nreciprocal dependences on the values of initial free carrier concentration and ion-beam- \nproduced atomic displacements, respectively. As a result, implant conditions necessary for an \neffective electrical isolation of a particular GaAs-based device can be readily estimated based \non experimental data and the number of atomic displacements calculated using, for example, \nthe TRIM code [ 1 I]. If n,  is the original sheet carrier concentration of the n-type GaAs layers, \nD is the implanted dose to isolate the structure, n,D is the measured sheet carrier concentration \nafter the isolation implantation to dose D then R will be the camer removal rate which is a \nAuthorized licensed use limited to: University of Surrey. Downloaded on February 5, 2010 at 06:46 from IEEE Xplore.  Restrictions apply. \nfunction of mass and energy of the ion. The equation relating these parameters is as follows \n[SI: \nnso = n,D i RXD (2) \nBased on the above model, it is estimated that an average number of seven protons with \nenergy of 300 keV are required to compensate one electron. The threshold doses in this \nexperiment are (using the results mentioned above [SI) D = 2 ~ 1 O ' ~ c m ~ ~  and D = 2 ~ 1 0 ' ~ c m \"  \nfor the n-type GaAs layers with initial sheet carrier concentrations of 3 .3~10\"  e-\/cm2 and \n3 . 2 ~ 1 0 ' ~  e-\/cmz, respectively. Figures 2 and 3 illustrate the resistivity of  the isolation for \nlayers implanted with protons at RT for a range of doses including the threshold dose. Each \ndata point is comprised of,the cumulative isochronal annealing sequence for 60s periods at the \nlower RTA temperatures. For the D* case in figure 2, the stability of the isolation is restricted \nto temperatures below 400 \"C. Above 400 \"C a decrease of R, by 4 orders of magnitude is \nobserved. The decrease of the  dose from Dm to 0.25Dm resulted in a remarkable decrease in \nthe thermal stability ahoye 100°C, although the as implanted resistivity value is as high as \n-10' ohms\/square. In the samples irradiated to doses higher than the threshold dose (2.501h) \nthe isolation persists up to the temperature of 350 \"C. The annealing characteristics in this \ncase are similar ,to those, of threshold dose, with slightly better sheet resistivity at lower \nannealing temperatures. The increase of the irradiation dose to 100, leads to the decrease of \nR, because of hopping conduction in the highly damaged region. During post irradiation \nannealing there is a progressive increase of R, with increasing temperature up to 300 \"C, since \nthe canier hopping becomes less effective as the damage is repaired. The defects are removed \nby annealing above this temperature, which would correspond to the annealing of defect \nclusters or defect complexes. Figure 3 presents the evolution of R, with the annealing \ntemperature of the implanted i-type resistors using four different doses: 2x10\" cm-' (D& \n5 ~ 1 0 ' ~  cm-' (0.02501h); 2 ~ 1 0 ' ~  cm-' (O.lDth), and 5 ~ 1 0 ' ~  cmz (0.2501h). In the sample \nirradiated with the lowest dose 0.025 Dm, R, starts to decrease after 200 \"C &er achieving a \nmaximum value close to 1080hms\/square. Increasing the dose to O.ID, the isolation persists \nup to 300 \"C. The resistivity is reduced by about 3 to 5 orders of magnitude during annealing \nat 400-550 \"C. In the sample irradiated to the dose of 0.25Dth one can observe a similar \nbehaviour of the evolution of sheet resistivity with annealing temperatures as in the case of \n2.5 times smaller dose. The isolation is stable up to 300 \"C. After an irradiation to the \nthreshold dose o f  2x 10\" cm-*, higher sheet resistivity values are stable even &er annealing at \n500 \"C. It is interesting to note in Fig. 3 that resistors irradiated with threshold doses provide \na large thermally stable process window. Figure 3 also explains that the devices of starting \nmaterial with high sheet carrier concentration are effectively isolated with threshold doses. \nFurther higher doses, for example in the case of figure 2, are not needed to obtain better \nisolation. 'Ihe larger thermally stable window (till 500°C) achieved in the case of the results \nshown in figure 3, is sufficient for subsequent processing such as contact sintering. \nSummary: \nThe thermal stability of electrical isolation is found to depend on the original free \ncamer concentration and the ion dose. A significant improvement in the thermal stability is \nobtained in samples irradiated to a dose we call a threshold dose, Du, for higher initial sheet \ncanier concentrations. In these samplesthe isolation is maintained up to 500 \"C, which seems \nadequate for most technological applications. Optical measurements indicate that the depths to \nwhich the optical changes extend in the ?-implanted devices are greatest for liquid nitrogen \nimplantation where no dynamic annealing occurs. Optical effects are also dose dependent. \n213 \nAuthorized licensed use limited to: University of Surrey. Downloaded on February 5, 2010 at 06:46 from IEEE Xplore.  Restrictions apply. \nThe data presented here shows that both electrical and optical effects are important to \nconsider when choosing different implantation parameters for an efficient device isolation \nscheme. \nAcknowledgements: \nThe authors gratefully acknowledge financial support from the UK Engineering and Physical \nSciences Research Council (EPSRC). \nReferences: \nH. Boudinov, A. V. Coelho, and .I. P. DeSouza, J. Appl. Phys. 91,6585 (2OL2). \nS. J. Pearton, Mater Sci. Rep. 4,313 (1 990). \nI. Danilov, J. P. DeSouza, andH. Boudinov, J. Appl. Phys. 92,4261 (2002). \nM. A. Mentzer, R. G. Hunsperger, J. M. Zavada, H. A. Jenkinson, and T. J. Gavanis, Appl. Phys. A. 32, \n19 (1983). \nR. G. Hunsperger Infegrafed Optics: Theory and Technology (Springer, Berlin, 1982). \nT. S. Moss. Opticalproperties ofSemiconducfors @utterworths, London, 1959). \nS. Somekh, E. Garmire, A. Yariv, H. L. Gmin,  R. G. Hunsperger, Appl. Opt. 13,327 (1974). \nS. Ahmed, B. J. Sealy, and R. Gwilliam. IEEE Technical Digest: Electron Devices for Microwave and \nOptoelectronic Applications, 18 (2002). \nJ. P. deSouza, I. Danilov, andH. Boudiiov, J. Appl. Phys. 81,650 (1997). \nJ. P. de Souza, I. Danilov, and H. Boudinov, Appl. Phys. Lett 68,535 ( I  996). \nJ. F. Ziegler, J. P. Biersack, and U. Littmark. The Stopping and Range of Ions in Solids (Pergamon, \nOxford, 1985). \n550 - \nX \n.o_ 450- \nal \nm \n-*- D = ~ X I  0’4 ~m\n15 --r-D=2x10 cm \n350 - \n_ _ _  . \n-200 -1 00 0 100 200 \nImplantation Temperature @) \nFigure 1: Infrared Reflectivity Measurements: Average Fringe Separation as  a function of \nimplantation temperature for proton-isolated GaAs layers. The average spectral separation is inversely \nproportional to the depths io which the optical effects extend. \n214 \nAuthorized licensed use limited to: University of Surrey. Downloaded on February 5, 2010 at 06:46 from IEEE Xplore.  Restrictions apply. \n10Ql _. \nAnneal ing Tempera ture  ( \" C )  \nn, = 3 . 3 x 1 0 \" e ' \/ c m 2  \n--X- 0 . 2 5  D th - D t h = Z x l  0\" ~ m - '  \n-A- 2 . 5  D ,\" \n..... E ..... 1 0 D  \nFigure2 Annealing stability of sheet resistance for layers implanted with 300 keV protons at \nRT to variable doses. The effect of threshold doses on the annealing temperatures and thermal \nstability is also a function of initial sheet carrier concentration, which is 3 . 3 ~ 1 0 ' ~  e-\/cm2 in \nthis case. \nns = 3 . 2 x 1 0 \" e 7 c m 2  \n--X--- 0.025D,, \n.. *. 0.1 D \n..... ..... D,\"= \nI O ' ,  . I . I . \n0 100 2 0 0  300 400 500 600 700 \nAnnealing Temperature  (\"C) \nFigure3: Thermal stability of sheet resistivity for layers, implanted with 300 keV protons at \nRT to variable doses. The effect of threshold doses on the annealing temperatures and thermal \nstability is also a function of initial sheet carrier concentration, which is 3 . 2 ~ 1 0 ' ~  e-\/cm2 in \n215 \nAuthorized licensed use limited to: University of Surrey. Downloaded on February 5, 2010 at 06:46 from IEEE Xplore.  Restrictions apply. \nthis case. The devices irradiated with threshold doses provide a large thermally stable process \nwindow. \n216 \nAuthorized licensed use limited to: University of Surrey. Downloaded on February 5, 2010 at 06:46 from IEEE Xplore.  Restrictions apply. \n"}