{"doi":"10.1111\/j.1467-9248.2010.00837.x","coreId":"215688","oai":"oai:eprints.lse.ac.uk:29556","identifiers":["oai:eprints.lse.ac.uk:29556","10.1111\/j.1467-9248.2010.00837.x"],"title":"Rethinking the modern prince: partisanship and the democratic ethos","authors":["White, Jonathan","Ypi, Lea"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-10","abstract":"This article lays out and defends the role of political parties in cultivating a democratic ethos among citizens. It argues that citizens' commitment to the democratic idea of self-rule requires positive conviction of the worth of collective political agency, and suggests that this conviction draws on three main sources, characterised as normative, motivational and executive. The article shows theoretically why parties are able to cultivate all three sources in a way no other political actor can match, thus constituting a unique and indispensable mode of civic engagement. Moreover, it proposes that the widely noted shortcomings of parties in contemporary democracy leave this basic capacity unimpaired, indeed that certain important developments herald renewed opportunities","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/215688.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/29556\/1\/White_Rethinking_the_Modern_Prince.pdf","pdfHashValue":"bb89f78fd3827cab61c5d3a8969aeb0fb04c820d","publisher":"Wiley-Blackwell Publishing","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:29556<\/identifier><datestamp>\n      2017-05-04T09:35:13Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4555<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/29556\/<\/dc:relation><dc:title>\n        Rethinking the modern prince: partisanship and the democratic ethos<\/dc:title><dc:creator>\n        White, Jonathan<\/dc:creator><dc:creator>\n        Ypi, Lea<\/dc:creator><dc:subject>\n        JC Political theory<\/dc:subject><dc:description>\n        This article lays out and defends the role of political parties in cultivating a democratic ethos among citizens. It argues that citizens' commitment to the democratic idea of self-rule requires positive conviction of the worth of collective political agency, and suggests that this conviction draws on three main sources, characterised as normative, motivational and executive. The article shows theoretically why parties are able to cultivate all three sources in a way no other political actor can match, thus constituting a unique and indispensable mode of civic engagement. Moreover, it proposes that the widely noted shortcomings of parties in contemporary democracy leave this basic capacity unimpaired, indeed that certain important developments herald renewed opportunities.<\/dc:description><dc:publisher>\n        Wiley-Blackwell Publishing<\/dc:publisher><dc:date>\n        2010-10<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/29556\/1\/White_Rethinking_the_Modern_Prince.pdf<\/dc:identifier><dc:identifier>\n          White, Jonathan and Ypi, Lea  (2010) Rethinking the modern prince: partisanship and the democratic ethos.  Political Studies, 58 (4).  pp. 809-828.  ISSN 0032-3217     <\/dc:identifier><dc:relation>\n        http:\/\/www.politicalstudies.org\/<\/dc:relation><dc:relation>\n        10.1111\/j.1467-9248.2010.00837.x<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/eprints.lse.ac.uk\/29556\/","http:\/\/www.politicalstudies.org\/","10.1111\/j.1467-9248.2010.00837.x"],"year":2010,"topics":["JC Political theory"],"subject":["Article","PeerReviewed"],"fullText":"  \nJonathan White and Lea Ypi  \nRethinking the modern prince: \npartisanship and the democratic ethos \n \nArticle (Accepted version) \n(Refereed) \n \n \n Original citation: White, Jonathan and Ypi, Lea (2010) Rethinking the modern prince: partisanship and the democratic ethos. Political Studies, 58 (4). pp. 809-828. ISSN 0032-3217  \n \nDOI: 10.1111\/j.1467-9248.2010.00837.x \n \n© 2010 The Authors. \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/29556\/ \nAvailable in LSE Research Online: February 2016 \n \nLSE has developed LSE Research Online so that users may access research output of the School. \nCopyright © and Moral Rights for the papers on this site are retained by the individual authors and\/or \nother copyright owners. Users may download and\/or print one copy of any article(s) in LSE Research \nOnline to facilitate their private study or for non-commercial research. You may not engage in further \ndistribution of the material or use it for any profit-making activities or any commercial gain. You may \nfreely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE Research Online website.  \n \nThis document is the author’s final accepted version of the journal article. There may be differences \nbetween this version and the published version.  You are advised to consult the publisher’s version if \nyou wish to cite from it. \n \n \n \n  1 \nRethinking the Modern Prince: \nPartisanship and the Democratic Ethos \n \n \nThis article lays out and defends the role of political parties in cultivating a democratic ethos \namongst citizens. It argues that citizens’ commitment to the democratic idea of self-rule requires \npositive conviction in the worth of collective political agency, and suggests that this conviction draws \non three main sources, characterised as normative, motivational and executive.  The article shows \ntheoretically why parties are able to cultivate all three sources in a way no other political actor can \nmatch, thus constituting a unique and indispensable mode of civic engagement. Moreover, it proposes \nthat the widely-noted shortcomings of parties in contemporary democracy leave this basic capacity \nunimpaired, indeed that certain important developments herald renewed opportunities.\n*\n \n \n \nA number of recent studies have sought to capture processes of change in contemporary \ndemocracies by reference to ideas of ‘depoliticisation’ (Mair 2006), ‘citizen disaffection’ \n(Schmitter 1995) or ‘political malaise’ (Offe 2006).  These words imply that something \nto whose presence we have become accustomed, and which has perhaps played an \nimportant ethical role in democratic life, is in danger of being lost, though quite what the \nthing is remains contested.  Some diagnoses focus on the rise of policy-making by non-\nmajoritarian institutions, seeing in this the erosion or the streamlining of democratic \npractices.  Others focus on decreasing levels of political participation and an increase in \nelectoral volatility.  Still others focus on the narrowing of political choices made \navailable to voters at election time.  Most accounts give at least some of these \ndevelopments a critical reading, noting how they tend to weaken the ability of citizens \ndirectly to influence policy-making, or how they increase political alienation and deprive \ninstitutions of democratic legitimacy (Offe 2006).  \nAt the heart of these concerns seems to be the vitality of the democratic ethos \nitself, understood as a positive conviction amongst citizens of the worth of engaging \nwith collective political agency so as to exercise the fundamental democratic principle of \ncollective self-rule.  This paper explores the conditions necessary to the maintenance of \nthis conviction, and advances an ideal-typical conception of the role of political parties \nin promoting it.  It does so not by providing a comprehensive empirical account of the \ncurrent challenges faced by parties in Western countries, or by seeking to offer a positive \ncausal model for contemporary processes – these issues have already been carefully \nexplored by other scholars.  Rather, the paper takes a distinctly theoretical route.  It \n                                                 \n*\n The authors warmly thank Peter Mair, Russell Muirhead, Matthew Festenstein and two anonymous \nreviewers for written comments on earlier versions of this article. A draft was presented at the Council \nfor European Studies 16th International Conference, Chicago, 6-8 March 2008.  Jonathan White records \nappreciation of the financial support of the Alexander von Humboldt Stiftung. \n  2 \nbegins by suggesting that, at least since the advent of democracy as collective self-rule, \nconviction in the worth of collective political agency has drawn on three sources: first, \nan ability amongst citizens to articulate political ideals that can be addressed through \ncollective action (the normative source); second, a willingness to see these goals as ours, \nin the sense that our own fate or that of those with whom we identify is bound up in their \nachievement, and that they may require ‘our’ collective engagement to be met (the \nmotivational source); and third an understanding that political agency can be \ninstitutionally applied to secure them (the executive source).  The article then examines \nwhich modes of civic engagement, if any, can nourish these sources, and argues that the \ncrucial role is best played by political parties.  The paper goes on to show that although \nthere are other forms of civic activity which are able to cultivate some of the three \nsources mentioned, the party is unique in being able to address all.                                                                                                                                                                                    \nIn contemporary scholarship, despite the industry with which empirical research \non parties continues to be conducted, their centrality in rendering meaningful the idea of \ncollective self-rule is often forgotten.  Parties are acknowledged as exercising an \nimportant procedural role, organising the mechanisms of government, legislation and the \nselection of office-holders, and they are recognised as a key component in the idea of \nrepresentation, notwithstanding increasing doubts about their capacities in this regard \n(Dalton and Wattenberg 2002).  But rather less attention is given to the role of parties in \ncultivating a broader democratic ethos.  Such an ethos, in addition to the liberal virtues \nof tolerance and respect of individual rights, entails a commitment to the idea of dealing \ncollectively with matters of common concern.  It implies the conviction amongst citizens \nthat self-government is possible and desirable.  As we shall note, parties and their \nrelationship to society have changed significantly in recent decades, yet their importance \nto the idea of democracy, and to some of its most significant practices, persists.  By \nexploring their role as essential modes of civic engagement necessary to cultivate \nconviction in the worth of political agency, the intention is to contribute to a wider \nrethinking of the place of political parties and partisanship in contemporary democracy \n(Muirhead 2006) (Rosenblum 2008) (Biezen and Saward 2008).\n1\n   \n \n \nThree Sources of Commitment to Political Agency \n \nIt is often emphasised that one of the most fundamental features of democratic politics \nhas to do with the possibility of connecting political agency to collectively determined \n  3 \ngoals.  “Government of the whole people by the whole people, equally represented”, to \nuse J. S. Mill’s definition (Mill 1861, ch. 7), is what democracy ultimately means, and it \nholds true for any conception which takes seriously the idea of collective self-rule and \nnot merely the constitutional restraint of authority.  The recognition by citizens that \ncertain situations are a matter of concern, and that they can and should be addressed in \ncommon rather than by individual adaptation, is what publicises them and makes them \nrelevant to decision-making by democratic means.  A political community that can \nadequately be regarded as democratic is one in which the citizenry holds on to the basic \nconviction that political engagement is for these reasons meaningful, notwithstanding \nthe possible limitations of existing structures and practices.  \nYet a question more rarely explored concerns the conditions under which \nconviction in the worth of political agency can be strengthened and reproduced.  For \nsimply the existence of institutional structures to some degree responsive to public \ninfluence hardly suffices to ensure its endurance.  A democratic ethos requires that the \nidea of collective self-rule be given focus and rendered meaningful to citizens.  While \nthis issue has been widely problematised by republican political theorists, scholars with \npurely normative interests have often taken civic engagement for granted as a natural \ninclination of citizens, leaving the sources necessary to cultivate it unexamined.  In this \nsection we argue that a democratic ethos may be seen as drawing nourishment from \nthree sources: normative, motivational and executive, understood as explicitly political \nin focus.  Let us consider these in turn. \nThe normative source concerns the ends of political action and the principles by \nwhich they are inspired.  It involves the appreciation that there are political goals which \ndeserve to be pursued, and that there is a relationship between them such that they need \nto be pursued as part of a more or less coherent whole.  Cultivating this source involves \ngiving political shape to the grievances which are manifest in society, to the \ndissatisfactions which persist despite outward appearances of consensus, and connecting \nthese to normatively grounded, powerful notions of the possibility of a better society.  It \ninvolves appeals to general interests and\/or to political values such as freedom, justice \nand equality, and implies analysing conflicts between these, identifying normative \npriorities in particular historical circumstances, and combining them to address \nsubstantive political problems (White a, 2010).\n2\n  \nThe normative source is necessary to guide citizens’ critical appraisal of their \njoint political institutions, to allow them to form judgments on matters of common \nconcern, and to articulate such judgments in a way that could appeal to the \n  4 \nunderstanding of all.  In its absence the quality of political judgments formed by citizens \nwould inevitably suffer, they would be unable to share their concerns with others in a \ncoherent way, and the lack of a larger perspective on the basis of which to assess the role \nand conduct of political representatives would render them vulnerable to political \nmanipulation.\n3\n  Political agency would not be worth engaging with because there would \nbe no shared political ends to speak of; citizens’ interactions with each other would be \neither entirely parochial or grounded on interests which they would be unable to defend \nor negotiate from a non-solipsistic perspective.  Indeed, even the assessment of political \ninstitutions based on purely private interests requires availing oneself of normative \nsources.  Without these, citizens would be unable to express their interests in a way that \nis meaningful and could be understood, if not immediately agreed upon, by the rest of \nthe citizen-body.   \nWhether phrased in the language of interests, values or problems, active political \nengagement of this kind requires putting forward interpretations of the common good \ndesigned to appeal to a wide variety of citizens.  Such interpretations are normative first \nin the sense that they involve the adoption of justifiable positions on basic aspects of \nhuman affairs and the life in common where ‘facts’ underdetermine how these positions \nshould look.  The meaning of basic political values can be developed in different ways, \nand no simple appeal to reality can adjudicate between these.  In this sense, all political \norientations – including those which depart little from the common-sense views or \n‘centre ground’ of their particular historical moment – contain normative elements.  \nEven a pragmatic politics of problem-solving never fully divests itself of such elements.\n4\n  \nYet interpretations of the good which are normative in a deeper sense are marked by \ncertain patterns of coherence and continuity, such that different aspects of the political \nworld are linked together across subject and time rather than each taken piecemeal.  In \norder to inspire a commitment to ongoing political agency – and not just the fulfilment \nof an isolated cause, whose resolution then results in democratic disengagement – links \nmust be drawn across political issues so as to project a degree of coherence onto the \ncomplexity of the political world and to highlight the necessity of democratic political \naction.  Similar patterns of coherence and continuity need not, of course, be so \nencompassing as to conjure a closed ideational system (even accepting such a \npossibility); indeed they may allow for ongoing revision and reinterpretation of political \njudgments according to the requirements of public reason-giving.\n5\n  \nNaturally the recognition that certain normative goals are worth pursuing is \nunlikely on its own to generate real commitment to the exercise of political agency.  One \n  5 \ncan believe that something needs to be addressed in a certain way without supposing \nthat it is a matter for ‘us’ – the onus (or privilege) may be assumed to fall to others, \nwhether remote in space or time.\n6\n  Thus the normative source of conviction needs \nfurther motivational support, and it is this motivational source which is the second in our \ntypology.  This consists in the availability and promotion of the discursive resources and \nforms of engagement by which citizens can perceive themselves as political subjects.  \nThe dissemination of these, and thus the building of political constituencies whose \nmembers feel a sense of common purpose and are inclined to show solidarity towards \none another, is crucial if the normative goals just discussed are to be met with an \nimpulse to see them realised.  There needs to be the conviction that these ends are in \nsome way ‘ours’ and need to be pursued through action in common rather than \nindividually, else there is likely to be little emotional engagement with them and little \nsense of indignation or disappointment if they are inadequately fulfilled.  Without the \nfeeling of belonging to one or several collective ‘we’s, conviction in the worth of joint \naction is likely to be absent, and efforts to advance political programmes in the face of \nopposition are likely to have little resonance with citizens, who may treat them rather as \nsquabbling amongst elites (White a, 2010).  Only where the motivational source is \npresent is disenchantment amongst citizens towards political institutions likely to take \nthe form of active mobilisation rather than cynicism or disinterest. \nMoreover, in order to be supportive of the worth of political agency, this sense of \ncollective subjecthood needs to have an explicitly political focus.  It needs to be bound \nup in the idea of pursuing shared political projects which can only be achieved \ncollectively through individuals acting in concert: forms of collective identification \nwhich lack this are as likely to inspire a retreat into the private sphere as a receptiveness \nto political engagement.  It may be that some such forms of subjecthood draw on the \nsymbolic resources associated with bonds of cultural commonality, or on the ties of \nsolidarity associated with pre-existing social groupings, though as the modern world \nbecomes increasingly fluid and as individuals engage in increasingly diverse forms of \nidentification this pattern may become rarer.  In any case, to foster commitment to \npolitical agency these forms of subjecthood cannot simply involve a perception of \ncommon attributes or diffuse feelings of sympathy: they must acquire a political \ndirection such that they refer to the pursuit of shared projects (Ypi 2008; Ypi 2010). \nThe third element relevant to deepening conviction in the worth of political \nagency involves demonstrating that those political ends to which ‘we’ are committed \nmay be successfully realised: that is, that there exists the political power and means \n  6 \nneeded to tackle them.  It is this projection of the successful execution of political \nprogrammes which demonstrates, in the form of visible outcomes, the credibility of \npolitical agency.  Demonstrations of this kind are likely, in many cases, to involve the \napplication of legal means: they require using the coercive power of institutions to \ntransform ideas into rules of societal regulation.  Popular sovereignty obtains tangible \nexpression for citizens only when the normative ideals they engage with are transformed \ninto practice-orienting rules, reshaping the conduct of both individual and institutional \nactors.  Citizens need not necessarily understand the workings of parliaments, \ngovernment and other bureaucratic institutions in their most intricate details – the \ncomplexity of modern democracy makes this most unlikely – but some sense that they \nall, in concert, can serve meaningful ends is indispensable (White b, 2010).   \nNote that this source cannot be subsumed under the normative and motivational \nones, since it does not rely for its effect on an identity between those programmes \nsuccessfully executed at a given moment and those which are dear to ‘us’.  Indeed, this \nwould undermine the very objective of the political process, which is to confront and \nselect particular views on the common good in the midst of a plurality of conflicting \nperspectives.  If all political ideals could be endorsed by all citizens at all times, politics \nwould be superfluous: the government of people might as well be replaced by the \nadministration of things, as Saint Simon urged.  What matters in this context is the \nperception that political ideals, in general, can be feasibly realised.  Even where some \ngroups of citizens oppose the particular programmes of specific actors, they may still be \nconvinced of the meaningfulness of political agency insofar as it succeeds in leaving an \ninstitutional imprint.    \nOne may propose, then, that it is the erosion of these three sources – normative, \nmotivational and executive – which leads to democratic disengagement and a loss of \nconviction in the worth of political agency.  In the absence of the normative source, \ncitizens may experience powerful feelings of dissatisfaction with the social and political \nworld yet will be weakly able to articulate these, tending rather to a state of resentful \nbewilderment.  In the absence of the motivational source, the social and political world \nmay be fully intelligible, yet citizens are likely to be unmoved to engage in its problems, \nthus rendering politics the activity of a small elite.  In the absence of the executive \nsource, citizens may recognise the urgency of certain projects and their relevance to ‘us’, \nyet they are likely to doubt their capacity to be realised. \n \n \n  7 \nThe Role of the Political Party \n \nWhen one or more of the three sources mentioned is absent, the likely consequence is \ndemocratic disengagement amongst citizens.  An effective exercise of collective self-\nrule requires forms of civic engagement in which all three sources are made available.  \nIn what follows, we shall propose and defend the role of political parties in promoting \nthis task.  Indeed, we shall argue that parties are not only well suited to cultivate these \nsources of conviction in the worth of political agency but that they respond to the \nnormative, motivational and executive demands in ways that no other type of actor can \nmatch. \nBefore proceeding we should specify further what is to be understood by \n‘political parties’ for the purposes of this discussion.  A remarkable diversity of forms \nmay be subsumed under the term, ranging from catch-all parties to cartel parties, \nreformist parties to anti-system parties, nationalist parties to religious parties, and many \nbesides.  Indeed, the application of the term is never politically neutral, and groupings \nwhich might more appropriately be described under a different name (we shall touch on \nthe contrast with ‘factions’ below) may have strategic reasons to present themselves as \n‘parties’, or may be commonly described as such by observers for the sake of \nconvenience.  Our own conception, expressed in the three roles we discuss, should be \nunderstood as an ideal type.  It is clearly rooted in empirical reality, drawing inspiration \nfrom the roles parties have historically performed and, as we shall argue, may still \nperform, yet it is also informed by our reading of the ethos to which citizens in a \ndemocracy are generally understood to aspire.  As a model, it is intended not merely to \ndescribe reality but to regulate the observations and evaluations one makes of it, to draw \nattention to what partisans at their best may achieve, and to highlight those cases where \nsuch achievements are unmet.  Perhaps no existing party fits the model precisely, but \nnor should it be regarded as an ideal formed in disregard of practical conditions.   \nLet us take each of the three elements discussed in the previous section in turn.  \nThe normative one is perhaps one of the most distinctive features of parties, and has \nbeen well-captured in the definitions of authors as diverse in political orientation and \nhistorical background as Burke and Gramsci.  For Burke, a party is ‘a body of men \nunited for promoting by their joint endeavours the national interest, upon some \nparticular principle in which they are all agreed’ (Burke 1770, p.271).  For Gramsci, the \nparty represents ‘the modern prince’, ‘the first cell in which there come together the \ngerms of a collective will tending to become universal and total’ (Gramsci 1971, p.129).  \n  8 \nGramsci’s reflection on Machiavelli is particularly instructive here.  For Gramsci, the \naim of Machiavelli’s “Prince” was not to depict the political biography of a historically \nexisting figure but to articulate a theoretical reflection on political agency able to move \nbeyond both existing treaties on political utopia and the pedantic realism contained in \nthe mirror-for-princes literature.  Gramsci’s conceptualisation of the party as the \n‘modern prince’ aimed to capture, from a theoretical perspective, the role of artificially \nconstructed agents in addressing the issue of political reform from a particular \nperspective, sensitive both to the normative force of universal ideals such as freedom \nand equality, and to the historical circumstances in which a specific combination of \nthem obtained particular significance.   \nThat parties, properly understood, have a special role in articulating \ninterpretations of the public good has been a staple theme for those philosophers who \nhave addressed the question of their place in a healthy democracy.  Voltaire, in his \nDictionnaire philosophique as well as the entry on ‘faction’ that he contributed to the \nEncyclopedia, uses the normative focus of parties as the basis of a distinction with \n‘faction’.  A faction for him represents a ‘seditious party’, something which is ‘still \nweak’ and does not ‘participate in the state’ (Voltaire 1752, p. 319), whereas parties \nconstitute a unique mode of civic engagement serving the general interest by expressing \ndistinctive visions on the future of the polity.  Montesquieu follows Voltaire on this, \narguing that while factions build their allegiances on particularistic interests and egoistic \ncauses, parties reflect the position of a collective on matters of common concern.  As he \nargues, their role is essential to ensuring citizens’ participation in accordance with a \npolitical ideal of the good polity: ‘what is spoken of as union of the political body is in \nfact something very ambiguous, the true one is a union of harmony, following which all \nthe parties, albeit seemingly opposed to each other, concur to the common good, just \nlike some dissonances in music concur to the overall harmony’ (Montesquieu 1734, ch. \nIX).   \nThis normative role, it should be noted, tends to be badly captured in political-\nscience accounts of parties inspired by rational-choice or economic perspectives.  \nFollowing an aggregative model of politics, parties are generally conceived as seeking to \nrepresent preferences which are given, and as distinguishing themselves mainly by the \ncombinations of interests to which they appeal.  Partisans’ concern to remain faithful to \nthese interests is held to be conditioned by their own interest in maximising their appeal \nto the ‘median voter’, and thereby securing and retaining office (Downs 1957) \n(Schlesinger 1991).  Yet even parties which speak only the language of interests are in \n  9 \nno sense merely a passive medium of representation – not to mention those which make \nexplicit appeal beyond interests to reflexively chosen values.  Interests have to be \nselected, defined and articulated compatibly with a certain idea of mutual advantage, \nand it seems hardly possible to perform this role without reference to principles of some \nkind.\n7\n  Such oversight in this literature is ironic, given that it is this aspect of parties \nwhich marks their most important contribution to realising the idea of democracy as \ncollective self-rule.  Unless one acknowledges their role in advancing normative \ninterpretations of the collective good, rather than simply their organisational dimension \nas clientelist networks that maximise the likelihood that certain individuals attain the \nvotes needed for political office (Downs 1957), one has little reason to see anything \ndistinctive or attractive about democracy as a regime form (Goodin 2008, pp. 204-224).  \nWithout the normative dimension of parties, voters can select representatives only with \nreference to a narrow range of personal characteristics (competence, integrity, the extent \nto which they resemble ‘me’).  Politics becomes purely the ‘politics of presence’ \n(Phillips 1994).  No doubt some parties may compromise their normative commitments \non certain occasions (opportunism), perhaps so as to take immediate advantage of \nopportunities for institutional power, and undoubtedly normative commitments are \nadjusted over time (pragmatism), perhaps because earlier positions are deemed \nunworkable or no longer relevant.  But if one treats these purely as a sequence of ad hoc \nmanoeuvres, rather than as acts of deviation and repositioning relative to ongoing \nideational commitments, one will have left no space for democratic politics as collective \nself-rule. \nWhen we move to the motivational element, we find again that parties are of \npeculiar relevance.  For they have the capacity to generate a sense of political \ncollectivity amongst citizens, both by articulating political identities and giving visible \nexpression to their cross-temporal and cross-spatial reality, and by projecting a sense of \ncommon purpose in pursuit of a political project.  Because they involve multiple \nindividuals acting in concert, parties can cohere as political entities beyond the life-\nspans and career-spans of individuals, thus giving a sense of continuity of struggle \nacross periods.  They act as the carriers of political memory, as well as the embodiment \nof collective will.  Such a mode of civic engagement expresses and reinforces the \nindividual’s sense of place within a wider constituency.  Of course, parties do not \nconstruct such constituencies from scratch: they draw considerably on the discursive \nresources which pre-exist them in society.  But only parties – and to some extent social \nmovements, as discussed below – can elaborate explicitly political identities, which \n  10 \ncitizens do not passively inherit as part of their social experiences and position within \nsociety, but towards which they orientate themselves reflexively based on an evaluation \nof the associated political objectives (Urbinati 2006, pp. 36 ff.).  And while individuals \nmay develop distinctive normative perspectives and run for political office with the \nclaim to promote them, only parties can credibly embody the continuous and \ncoordinated action required to realise specific values in practice, to take on other \norganised actors in political struggle and overcome them.   \nAgain, it is a role which much of the political-science literature on parties tends \nto ignore.  Seeing parties primarily as mechanisms of passive representation, these \naccounts tend to assume a largely unidirectional relationship between the forms of \nsubjecthood existing in society and those in the political arena.  Political constituencies \ntend to be seen as a function of underlying societal cleavages, whether rooted in interests \nor sedimented cultural oppositions (e.g. Rokkan and Lipset 1967), with the groups \ninvolved in these cleavage structures assumed to be already endowed with a sense of \ncollective identity (Gallagher, Laver and Mair 1995, p.210).  They are treated already as \ngroups for themselves as well as in themselves, in other words: the role of the party in \ndeveloping this self-consciousness, by creatively articulating political subjects, is often \nunder-specified.  The literature on ‘linkage’ between parties and citizens (or state and \nsociety) also tends to suppose interaction between two pre-defined groupings rather than \nan ongoing process of mutual constitution.  While some of the classic accounts note that \nparty activities are in no sense entirely derivative of cleavage structures – not all \ncleavages are translated into dimensions of political conflict, and parties have some \ndegree of creative role in shaping as well as responding to citizen preferences (Sartori \n1976) – even these accounts tend to have little to say about the creative role of parties in \ndefining their constituency and thereby offering citizens ways of understanding not just \ntheir preferences but their very selves. \nParties are equally significant when we consider the third, executive source of \nconviction in the worth of political agency.  For only parties are in a position to \ndemonstrate in full the capacities of government for implementing public policies \nresponsive to the democratic process.  Parties serve two purposes here: they render \npolitical contestation possible, and they render it comprehensible.  In their absence one \nmay still have political decision-making of some kind: even where all representatives of \na decision-making chamber have been elected as individuals rather as members of a \nparty, they may organise votes and thereby choose policies, perhaps forming ad hoc \ncoalitions on each piece of legislation (Goodin 2008, pp.205-211).  They may also, as \n  11 \nindividuals, secure certain basic advantages for the constituency which elected them – \nimprovements in local infrastructure, for example.  But there cannot be organised \nagenda-setting such that a programme with some basic level of normative coherence is \ntranslated into policies.  The policy proposals on which votes are taken will be drawn up \npiecemeal and in isolation, perhaps each sponsored by a different representative, and \nunless practices of ideas-based cooperation between representatives across issues start to \nemerge (i.e. parties emerge) there will be no discernible coherence in these decisions – \neither in their origins or in the justifications retrospectively given to them.  There will \ntherefore be little sense that the resultant policies are expressions of collective political \nagency – indeed, given the self-contradictory results which decision-making by a \nsequence of votes can produce, there is a strong probability that some will look \ndecidedly arbitrary.\n8\n  Even where there is rudimentary coordination, the premises on \nwhich it rests will not be subject to organised contestation.  Shared normative \nperspectives will emerge as the prerequisite of coordination, but they will remain largely \ntacit and unproblematised unless organised groupings emerge to challenge them.  Nor \nwill there be any mechanism by which the experiences of policy-making, including their \nsuccesses and failures, and the practical knowledge representatives acquire in the course \nof governing, are able to feed back into normative political visions.  In sum, without \nparties there will be a chaotic or opaque quality to decision-making which gives citizens \nno reason to take normative objectives seriously, and which therefore precludes \nwidespread conviction of the worth of collective political agency.  \nUndeniably, while the presence of parties seems a necessary condition for \nprovision of the executive source, it may not be sufficient at all times.  There may be \ncases when its provision is undermined by an ineffective government bureaucracy which \nfails to respond to the outcomes of political contestation, or when the major media \noutlets systematically under-report the activities of the legislature or diminish their \nideational basis.  Moreover, one of the strategies of opposition parties is likely to be to \ntry to cultivate the perception that the execution of policy-making is weak or disjointed.  \nFor parties in government, convincing citizens of the efficacy of their decision-making – \nin addition to its normative desirability – will evidently be one of the challenges of \noffice.  But though it is a case that needs to be made, it is a case made possible by party-\nled coordination amongst political representatives.  \n \n \nThree Alternatives to the Party \n  12 \n \nThe argument we have sketched faces a number of objections.  Perhaps most \nimportantly, even those who acknowledge that parties have played these roles at certain \npoints in the history of democracy may want to argue that under contemporary \nconditions there are other actors which may perform them equally well or better.  In this \nsection we examine three alternative actors and show how each of them is able to \nperform one, perhaps two, but not all three of the roles identified above, thus failing to \ncultivate conviction in the worth of political agency along the dimensions specified. \nThe first alternative perspective might consider social movements rooted in civil \nsociety as performing largely the same function (Tilly & Tarrow 2007).  Social \nmovements and parties may be distinguished, at least at a definitional level, by the fact \nthat while both attempt to define and raise support for collective goals, and seek to do so \nover a sustained period of time, social movements focus on a more narrowly defined set \nof issues and do not seek to hold office themselves.  Due to organisational and financial \nconstraints, social movements tend to be most successful when they focus their energies \non a closely delimited set of campaigns (Offe 1990), which means the majority of them \nare unlikely to develop comprehensive political visions and attempt to transform \npolitical institutions in accordance with these.  Their strategy is to make claims on \ngovernments and the institutions of state without seeking to become part of their ruling \nadministrations.  But this very fact seems to make social movements unsuited to \nmaintaining expectations of collective political agency by means of the executive role \ndescribed above.  Not only do they reject institutionalisation, but they reject the power \nwhich comes with this.  The most they will be able to project therefore is the capacity to \ninfluence the governmental agenda – not the capacity to design it and execute it \nindependently.  This is not to say that they do not exert an important influence on the \npublic sphere, simply that their rejection of integration into mainstream institutional \npolitics is likely to render them inadequate to perform the executive role without support \nfrom other political actors.  \nWhere social movements may contribute most to the fulfilment of the three roles \nidentified is with regard to the motivational role.  Historically, such movements have \nbeen distinctly successful at articulating collective subjects oriented to the pursuit of \nspecific political goals, based for instance on categories of social income, gender, race \nand sexuality.  Moreover, their ability to create networks of activists, to transfer \ninformation, and to engage in awareness-raising campaigns has been widely documented \n(Della Porta 2006; Keck and Sikkink 1998).  Social movements are undoubtedly a \n  13 \nsignificant alternative provider of motivational resources in times when parties are weak.  \nWhat they cannot do is substitute for parties on all of the three roles described above.  \nFurthermore their inability or unwillingness to engage in the executive role may end up \nundermining conviction in the worth of political agency amongst citizens who are not \nactivists.  The risk that these latter perceive the work of movements as well-intentioned \nyet utopian may lead to a sceptical if sympathetic attitude, thus contributing to a \nweakening of the democratic ethos. \nIf one of the arguments against social movements from a party-centred \nperspective is that they are unable to cultivate the executive source, parties themselves \nhave often been subjected to a similar critique from those emphasising the reality of \ncorporate pluralism (Schmitter 1974).  Neocorporatist authors maintain that the role of \nparties in articulating or channelling institutional proposals and dictating the priorities of \npublic policy has been increasingly replaced by direct communication between \nspecialised interest groups and state agencies.  Rather than following what Rokkan has \ntermed the ‘partisan-electoral’ channel, political representation – neocorporatists \nemphasise – increasingly takes the form of a direct relation between formal, \nhierarchically-ordered associations (e.g. trade unions) and state agencies.  Whilst \nproviding organised interest-groups with recognition, legitimation and a certain \n‘representational monopoly’ vis-à-vis alternative actors, state agencies trade such \nbenefits with the possibility to maintain control over their selection of leaders, the kind \nof pressure exercised on the political system, and the articulation of political demands \n(Schmitter 1974).  This has naturally raised doubts about the role of parties, and indeed \nparliamentary government more generally, in the delivery of public policy, and has led \nsome to question whether liberal corporatism may be on the point of superseding \ndemocratically elected institutions (Lehmbruch 1979, p. 149). \nThe limits of this alternative proposal emerge if we assess the issue of political \nrepresentation from a more normative perspective.  Without denying the relevance of \norganised interest-groups in the execution of public policy, it is this type of critique of \ncorporate actors that reminds why political parties remain relevant.  Indeed while the \nlatter constitute modes of civic engagement with a view to promoting the collective \npolitical good, and try to appeal to the reasons of all, corporate actors renounce this \nambition by definition.  Hence they appear particularly vulnerable to the democratic \ncritique of factional groups, well captured in the words of Rousseau: “when particular \ninterests begin to make themselves felt, and small societies to influence the larger \nsociety, the common interest diminishes, and meets with opposition […] the general will \n  14 \nis no longer the will of all, contradictions and disagreements arise, and the best opinion \nno longer carries the day unchallenged” (Rousseau 1762, p. 121-122).  Of course, if one \nviews parties only as agents aggregating self-evident interests in a competitive way, one \nwill have trouble seeing the difference.  Indeed their function would be reduced to \nmerely replicating what corporate actors already do in more powerful ways.  But if we \ntake seriously their role as ‘discursive architects’, providing a variety of normative \nresources upon which to draw in deliberating upon competing policy options with a \nview to the collective political good, then parties cannot be so easily discarded.  As \nNorberto Bobbio emphasises, while the ‘sectional representation’ offered by interest \ngroups may be appropriate to numerous sub-domains of public life, in the political arena \nit cannot substitute for the advocacy of general visions provided by parties (Bobbio \n1987, p.51).  The very process by which the interests of corporate actors are integrated is \nsubject to political negotiation, the modality of incorporation depends on the importance \nascribed to specific interests at any given time and may be subject to different normative \nassessments.   \nIf, as Rousseau exhorts us, we should be suspicious of interests entering the \npublic sphere in an unmediated way, then the best way to counter their disruptive effects \nis to elaborate policies of dealing with them through the open, deliberative and \nnormatively-informed environment that parties make available.  The role of parties thus \ncannot be replaced by corporate agents.  They may be powerful, but they cannot be \ndirectly controlled by citizens, nor can they modify what they stand for in accordance \nwith public expectations of collective agency and normative ideas of the good polity.  \nTo normalise them at the expense of parties would be to sacrifice the idea of collective \nself-rule to that of absolute rule by the strongest interest group(s) (Kelsen 2000, p.93).  \nHence rather than relieving the symptoms of democratic disengagement, corporate \nactors run the risk of merely aggravating the disease.  They may well perform the \nexecutive role we have associated with parties, and sometimes even the motivational \none, but they cannot substitute for them in performing the normative role.  \nIf the critique to corporate actors as alternative political agents focuses on their \nfailure to provide the resources for informed and non-egoistic political deliberation, \nparties themselves have been often subjected to an analogous critique.  One of the \nstandard objections advanced by theorists of deliberative democracy is that they lie at \nthe heart of a process in which only preference-aggregation matters, not the reasons \ncitizens might have for expressing those particular preferences.  Of course, as \nemphasised, no party aggregates votes automatically: some measure of deliberation is \n  15 \nunavoidable.  Perhaps why defenders of deliberative democracy really object to party-\ncentred political agency is on the grounds that parties foster commitment to oppositional \nactivity rather than encouraging engagement with the opponent’s argument (Young \n2001, p. 671).  Hence comes the deliberative democrat’s emphasis on discourse, \nreciprocal argumentation and consent.  Whether conceived as electronic improvements \non familiar mechanisms of deliberation (Lupia and Matsuaka 2004), citizens’ juries and \ndeliberative polls (Fishkin 1991) or mini-publics convening to discuss issues of common \nconcern (Fung 2003), such alternative political agents have all recently been considered \nmore authentic expressions of the democratic idea. \nIronically, theoretical arguments on the superiority of deliberative fora \nproliferate as empiricists increasingly lament the tendency towards political disaffection \nand democratic disengagement (Mair 2006, p. 28).  ‘So what?’, the deliberative \ndemocrat, may respond.  If citizen apathy is the problem, participatory democracy might \nprovide the solution.  After all, deliberative decision-making constitutes an ideal, one \nwhich becomes all the more appealing in the face of the failure of traditional agents such \nas parties to operate as emancipatory forces in society.  A deliberativist may be quite \ncomfortable with any putative failure of partisanship, since deliberation is understood to \nbe anchored in conceptions of justice that transcend the partisan perspective.  In an ideal \nspeech situation, all relevant arguments emerge in debate of their own accord, and \norganised collective agency may be a source of distortion, or may limit levels of citizen \nparticipation (Biezen and Saward 2008; Muirhead 2006).  \nLet us leave aside the conceptual question of whether the general interest may \nplausibly be conceived as something transcending partisan conflict and susceptible to \naccess through a non-partisan exercise of public reason.\n9\n  Let us focus instead on the \nmotivational capacities of deliberation.  Historically speaking, those (admittedly few) \nexperiments in deliberative democracy that have left the most durable marks have been \nable to cultivate conviction in the worth of political agency only when paired with an \nadditional motivational component.  They have taken shape in times of both \ncommitment to the realisation of a normative ideal of the just society and widespread \npartisan engagement on the side of the citizen body.  One may think here of the soviets \nin 1917 Russia, or workers’ councils in 1917-1918 Germany, or peasants’ organisations \nin 1936-1937 Spain, or citizens’ deliberative fora in 1956 Hungary.  Even if deliberation \nis simply proposed as a normative ideal, it would be wrong to seek to abstract from the \nbody of meanings and opinions derived from political conflict when constructing \ndeliberative political agency.  One may confront views when one has views to confront; \n  16 \none may try to persuade others of the worth of a political cause when a political cause is \nworth devoting oneself to; one may engage in a process of political transformation when \na process of political transformation has been initiated.  An organised political agent is \nneeded, one able to define topics of concern, to create enduring constituencies, to \nsupport principled alignment, and to provide a sense of shared commitment to a \ncollective political project, if citizens’ conviction in the worth of collective political \nagency is to be maintained.   \nDeliberative agents lack this motivational capacity: they convene on an ad hoc \nbasis, and once the theme on the table has been exhausted, deliberating agents are liable \nsimply to leave the room and return to their private affairs – perhaps less certain of their \nbeliefs than previously.  One of the interesting findings of research on public discussion \nand deliberation is that participants tend to avoid the overt contestation of opinions, \npreferring to leave disagreement latent or, where recognising it, to avoid deeper \nengagement and argumentation over the bases of preferences (Conover, Searing and \nCrewe 2002, p.58; Duchesne and Haegel 2007, p.8, 11; Ryfe 2005).  Such acts of \npersonal distancing from political conflict suggest that while political talk may \nilluminate the lines of division on which political actors can draw, it is not in itself likely \nto be the precursor to political action.  As Rosenblum puts it, ‘deliberative settings may \nbe endured; participants may even be enlightened.  But it is not clear that they will be \npolitically energised.’ (Rosenblum 2008, p.310).  Deliberative constituencies have no \npast and no present: no history of joint struggles and defeats, no political errors to reflect \nupon, no projects to articulate in common.  Deliberative political agents cannot replace \nparties.  This is not to say that deliberative democracy is an unworthy enterprise.  But \nrather than replacing parties with deliberative constituencies, the point is to think of \nways to integrate the two by rendering constituencies more partisan and\/or encouraging \nparties to deliberate within (Biezen and Saward 2008).\n10\n  \nIf conviction in the worth of political agency derives from three main sources – \nnormative, motivational and executive – it seems that parties offer a contribution that \nnone of the other familiar actors in contemporary politics can match.  Social movements \nare able to supply the normative and motivational components but lack the executive \ncapacity; corporate interest groups can supply the motivational and executive \ncomponents, but without normative resources; and deliberative fora provide the \nnormative and possibly executive components, but seem to lack the capacity for \nmobilisation.  \n \n  17 \n \nAn Impossible Task?  Concluding Thoughts on Parties in Contemporary Democracy \n \nIt is, of course, one thing to argue that political parties represent a mode of civic \nengagement indispensable to maintaining conviction in the worth of political agency, \nand quite another to insist either that currently existing parties are up to this task or that \nthe future emergence of such parties can be expected.  For well might it be argued that, \nalthough the ideal type sketched alerts us to the fundamental yet overlooked functions \nwhich parties may serve, it does so ultimately so as to invite a depressing conclusion.  \nIndeed, the dominant tone of contemporary academic scholarship on parties is itself \noften one of scepticism concerning what can be achieved.  While contemporary political \ntheorists of most descriptions tend to be altogether silent on parties, for empiricists the \nnotion that ‘parties do matter’ has come to be seen as a questionable thesis.  A sizeable \nliterature observes that parties are in a state of fundamental change and perhaps long-\nterm decline, as membership rates fall, leaders act as disconnected cartels, electoral \ncontests focus on the dramatic personalities of individuals, and processes of \ntransnational integration render the established political groupings obsolete (Mair 2006; \nCrouch 2004; Ginsborg 2005).   \nAccordingly, one may note that the three roles identified for parties in this article \nare currently weakly performed.  First, talk of ‘third-way’ consensi expresses the way \nnormative innovation appears to be missing in mainstream politics (Mouffe 2005).  \nPolicy-making seems to respond more to a need to assuage transitory fears, many of \nthem inflated by parties themselves, than to promote a long-term and interconnected set \nof goals.  Second, parties seem increasingly to want to construct their constituencies not \nin terms of clearly defined collective political identities but as free-floating individuals \nor ‘consumers’, who exercise ‘choice’ between party brands external to their sense of \nself rather than political programmes continuous with their self-understandings.  The \nrise of the ‘catch-all party’ (Kirchheimer 1966) has been widely documented, and held \nresponsible for the increasingly amorphous voting patterns which see voters switching \nparties from one election to the next (Knutsen 2006).  Third, a whole host of concerns \nabout whether the party-composition of governments has meaningful effects on the \ntypes of policies pursued, about trends towards presidentialist politics and the increasing \npopularity of the term ‘governance’ over ‘government’, raise doubts regarding the \nrelationship between parties and decision-making (Mair 2008).  Insofar as parties \ncontinue to influence government and the structuring of legislative chambers, thereby \n  18 \nserving a procedural function, it is argued they do so increasingly as appendages of the \nstate, as small networks of ‘managers’ concerned mainly with office-holding rather than \nas organisations responsive to the concerns of a broader array of citizens (Mair 2003).  \nIn the light of such patterns, democratic disengagement, understood as the loss of \nconviction in the worth of political agency, now seems a thinkable prospect, even if \npresently incomplete.   \nThese points would signal reason for the utmost pessimism concerning the fate \nof democracy if they could be attributed to structural changes which ruled out alternative \npaths of development.  If the argument of the preceding sections is accepted, and parties \nare indeed crucial to fostering the ethos on which democracy survives, then any \nsuggestion that their task is an impossible one must be regarded as a challenge to the \npossibility of democracy.  So let us examine the plausibility of such arguments.  Are \nparties really incapable of playing the normative role?  At the extreme level, one might \nargue that, following the achievement of universal suffrage and the establishment of \nbasic human rights, all worthwhile political ideals have already been realised and that \nwhat remains is merely a steering role – that the ‘end of history’ has indeed been \nreached.  More circumspectly, one might argue that the contemporary world is no longer \nreceptive to narratives of transformation rather than pragmatic reform, and that \nprinciple-based thinking – whatever its merits – no longer has an audience.  Yet there \nseems no good reason why even those who accept such arguments should be inclined to \nsacrifice political ideals such as the commitment to collective self-rule.  For it is exactly \nunder conditions of uncertainty that conflict over political ends becomes vital: where no \nsingle perspective can claim absolute authority, a horizon of possibilities opens out.  \nUncertainty entails not universal doubt – a most impractical disposition, as Wittgenstein \nreminds – but a recognition of the contestability of viewpoints, something which is not \nonly consistent with normative creativity but conducive to ensuring that political conflict \ntakes democratic forms.  Scholars of ideology inform us that the totalistic and rather \nfixed Weltanschauungen of the twentieth century may be fragmenting and waning, but \nemphasise the persistence of ideational formations of considerable structure and popular \nresonance (Freeden 2005). \nLikewise, one should be dubious about the idea that there are structural-\ndeterminative reasons why contemporary parties are unable to play the motivational \nrole.  To be sure, it seems that, due to changing patterns of economic production and \nincreasing levels of migration, the well-defined mass social groupings associated with \nFordist society are passing, thus disrupting some of the organisational and symbolic \n  19 \nresources on which parties of the recent past have been able to draw.  But this does not \nmean that mobilisation itself is no longer viable.  Quite the contrary, it increases the \nopportunities available to parties for creatively redefining the terms of political conflict.  \nThe decline of older social groupings and their attendant patterns of political behaviour, \nto the extent this can be observed (e.g. Franklin et al., 1992), is exactly what makes \npossible the articulation of new forms of collective identification which transcend \npartisanship in the sectarian sense.  A new political space is opening, one which enables \nappeals to wider groupings than those rooted in narrowly defined ethno-cultural or \nproductivity-based criteria, and which prioritises bonds of choice over those of tradition \nand inheritance.  This space enables not only a politics of pragmatism, anodyne catch-\nall-ism, or quasi-universalist technocracy, as many identify in contemporary Western \nsocieties, but its opposite: a clash of citizens who understand themselves as, and who are \nconstructed by organised actors like parties as, advancing competing interpretations of \nthe collective political good.  Mobilising citizens to this type of endeavour becomes \nincreasingly possible as more sectarian forms of collective identification recede.  As a \npossibility proof, one may consider the example of Europe’s increasingly prominent \n‘new populist’ parties, which succeed in drawing together under the sign of ‘the people’ \ngroups of citizens hitherto politically incompatible (Laclau 2005).  These parties’ \ncapacity for mobilisation is unquestionable.  What they lack is a contribution to the \nnormative and executive roles: they tend to have few clear political objectives beyond \nopposition to the existing system (Mudde 2004; Canovan 2005), and thus tend to be \nexposed as vacuous and substantively disappointing when extended a role in the \nformation of government policy. \nFinally, what of the argument that structural changes in the contemporary world \nhave rendered impossible parties’ performance of the executive role?  Such a position is \noften taken in view of processes of globalisation and regional integration which increase \nthe porousness of political boundaries and the complexity of decision-making.  In a \nworld of transborder problems, ever more demanding swathes of information, and the \nconsequent need for expert knowledge, bounded and election-oriented organisations \nmay seem obsolete.  ‘Government’, it may be argued, must give way to ‘governance’, \nleading to a system where power is widely diffused, elections result neither in the visible \nformation of a party-led centre of authority nor a clearly defined opposition, and no \nsingle political actor can hope to influence the decision-making arena as before.  In such \nconditions, those who commit themselves to supporting a given party are denied the \nchance to see a tangible outcome to their efforts in the form of the coordinated \n  20 \nenactment of a political programme: hence there can be no executive source of \ncommitment to political agency.  On the one hand, such reasoning seems to rests on an \noften exaggerated and determinist reading of the changes currently being experienced by \nstates and their political institutions.  The retreat of state power is arguably far less \nadvanced than such arguments suggest (Hirst and Thompson, 1999), and whatever \npressures for such changes may exist have origins which are ideological at least as much \nas they are material (Hay 2007, chap. 4).  On the other hand, many such arguments rest \non a rather limited conception of the possible forms of transnational institutional \nstructures.  The fact that existing ones, for example those associated with the European \nUnion, are arguably inadequately responsive to political contestation and the direct \ninfluence of parties does not mean that parties are no longer relevant to governmental \ndecision-making.  Rather, as sites of decision-making power multiply, it is likely that \nparties will have an increasingly important role to play in linking up political conflict \nacross different arenas of contestation.  What this requires is that parties use the existing \ninfluence they retain – indirectly through national governments, and through their ability \nto foster transnational networks – to redesign the system so as to increase its \nresponsiveness to direct forms of influence.  Certainly there will be parties with \nprincipled objections to doing so, either because they are localist in orientation or \nbecause they are content to divest themselves of political responsibilities and powers – \nbut this should not be mistaken for a structural imperative.   \nThe possibility of projecting the successful execution of political programmes \nthrough governments and legislative bodies remains and is necessary.  A democratic \nethos can be maintained only where the citizenry retains control over the legislature and \nwhere governments are accountable to democratic will. Where legislatures have lost \nconnection with the people, or where their capacity to orient the activity of governments \nhas been supplanted by other domestic or international political actors, the democratic \nethos suffers.  Even where such transformations have become an unavoidable part of \npolitical life, rather than being hailed, they should invite further reflection on the quality \nof democracy and its implications for citizens’ conviction in the worth of political \nagency.  \n \n‘Only self-deception or hypocrisy,’ wrote Kelsen, ‘can lead one to believe that \ndemocracy is possible without political parties.  A democracy is necessarily and \nunavoidably a party state’ (Kelsen 2000, p.92).  E.E. Schattschneider, in a passage \nalmost too famous to bear further repetition, likewise pronounced modern democracy \n  21 \n‘unthinkable’ save for parties (Schattschneider 1942, p.1).  As we have tried to show, \nnumerous thinkers have made the link between the principle of democracy – collective \nself-rule – and the necessity of certain modes of civic engagement by which citizens \nmobilise for the purpose of realising an interpretation of the common good.  Yet it is \nwith some irony that one notes that authors such as Kelsen and Schattschneider \nunderstood themselves explicitly as realists, stating truths which in the last instance \ncould be defended as mere statements of the way things are.  Kelsen called his \nobservation a ‘simple assertion of fact’, something ‘of which one can convince oneself \nby a glance at the development of all historical democracies’ (p.92).  Schattschneider’s \nconvictions were similar.  Today, defenders of the normative and empirical significance \nof parties seem more likely to be cast in the role of nostalgics or utopians.  The \ntemptation has been to downgrade the role of parties, and to overlook the reasons other \nthan the purely procedural for why they became a central political feature.  The result \nhas been that moves towards the individualisation and technocratisation of politics have \nbeen criticised without pairing this concern with an analysis of the modes of citizen \nengagement able to restore conviction in the worth of collective political agency.  \nAs our last remarks have indicated, an insistence on the centrality of parties for \nstrengthening the democratic ethos seems anything but an exercise in yearning for an era \npast or fated never to come.  Though not strictly descriptive in its intent, the sketch \ngiven in this paper is by no means without empirical plausibility.  To be sure, as the \nforms of democracy change, parties must adapt to new conditions, and a more detailed \nexamination of the options available to them is one of the tasks for future discussion.  \nBut it seems as premature to doubt parties’ capacity to adapt as it is ill-advised to \noverlook the importance of partisanship for collective self-rule.  The future of modern \ndemocracy remains inseparable from the future of the party.  \n \n                                                 \n1\n A number of interesting, theoretically-focused works on political parties have appeared in recent years, \nattempting to highlight and remedy the continued estrangement of debates in political theory from \ndiscussions of partisanship in comparative politics, as well as to challenge wider currents of scepticism \ntowards partisanship as a democratic ideal.  (Muirhead 2006) and (Rosenblum 2008) have both \ncontributed to a rehabilitation of the ethical standing of partisan activists, showing how many of the \nstandard critiques of partisanship in political thought can be countered not just on realist grounds to do \nwith the functional necessities of modern democracy, but with regard to the intrinsic virtues of \nparticipation in collective political action.  (Biezen and Saward 2008) have indicated the depth of the \nintellectual divide between democratic theorists and party scholars, as well as possible lines of re-\nengagement based on examining the contribution of parties to matters of shared interest, notably political \ndeliberation.  The present piece is of a different but complementary focus.  It concerns primarily the \neffects partisanship may have on the public beyond the party organisation, and reflects on citizens’ \ncommitment not to particular standards of democratic practice (such as the deliberative ideal) but to the \nvery principle of democracy, i.e. collective self-rule.  More importantly, our insistence on the unique \ncombination of three different sources of conviction in the worth of collective political agency (normative, \nmotivational and executive) traces the significance of partisanship back to the core idea of collective self-\n  22 \n                                                                                                                                            \nrule and to what we call the ‘democratic ethos’ which underpins it.  It allows a deeper appreciation of the \ndistinctiveness of partisan engagement vis-a-vis other modes of civic participation, and thereby offers \nadditional important reasons for taking seriously the democratic role of political parties. \n2\n Note that for the purposes of this paper it is unnecessary to draw a strong contrast between appeals to \ninterests and values: both are interpretational acts which involve putting forward one of the many possible \ndescriptions of the world, whether for the purposes of orientation or as a prelude to action.  \n3\n This is why Kant cautions against authoritative figures trying to discourage citizens from articulating \ntheir judgments in a normative perspective (Kant 1784, p. 11 ff.). \n4\n Such is the implication of John Maynard Keynes’ famous observation that ‘practical men, who believe \nthemselves to be quite exempt from any intellectual influences, are usually the slaves of some defunct \neconomist’  (Keynes 2007, p.383).  \n5\n Parties in practice may of course betray such an ideal. If and when they do, the detachment of leaders \nfrom the normative goals endorsed by other members of the party is itself problematic. \n6\n The distinction between normative reason and motivation is a familiar one in political theory and bears \nparticular weight in discussions concerning moral universalism and particularism. For further analysis of \nits implications see Ypi 2008, pp. 54-56. \n7\n The more sophisticated accounts of parties have recognised this (see Sartori 1976; Mair 1997, p.65), but \nit tends to be overlooked in contemporary accounts – perhaps because empirical research is considerably \neasier if a party’s normative position is taken to be measurable by socio-economic data about its members \nand voters. \n8\n Note then that this feature of parties allows decision-making to be both coherent and politicised.  In the \nabsence of parties, and where the choice is between direct majoritarian voting and non-majoritarian \ndeliberation, one may rightly fear a trade-off between the two (Pettit 2001).   \n9\n One critique may be found in (Kelsen 2000, p. 93). \n10\n For example, it is possible to imagine deliberative polls being used to address both technical issues \nregarding ruling procedures like membership fees and financial subsidies, and more normative questions \nsuch as the content of electoral manifestos, specific policy-prescriptions and the selection of leaders. For \nfurther analysis of deliberation within parties see (Ware 1986) (Teorell 1998); for a sceptical view see \n(Hendriks et al. 2007). \n \n \n \nReferences  \n \nBiezen, Ingrid van and Saward, Michael (2008), 'Democratic Theorists and Party Scholars: Why They \nDon't Talk to Each Other, and Why They Should', Perspectives on Politics, 6 (1), pp.21-35. \nBobbio, Norberto (1987), ‘Representative and Direct Democracy’, in The Future of Democracy (Oxford: \nBlackwell) pp.43-62. \nBurke, Edmund ([1770] 1998), 'Thoughts on the cause of the present discontents', A Philosophical \nEnquiry Into the Origin of Our Ideas of the Sublime and Beautiful and Other Pre-revolutionary \nWritings (London: Penguin Classics), pp.201-76.  \nCanovan, Margaret (2005), The People (Cambridge: Polity). \nConover, Pamela, Searing, Donald D., and Crewe, Ivor (2002), 'The Deliberative Potential of Discussion', \nBritish Journal of Political Science, 32 (1). \nCrouch, Colin (2004), Post-Democracy (Cambridge: Polity Press). \nDalton, Russell J. (2004), Democratic Challenges, Democratic Choices: the Erosion of Political Support \nin Advanced Industrial Democracies (Oxford: OUP). \nDalton, Russell J. and Martin P. Wattenberg (2002), Parties Without Partisans: Political Change in \nAdvanced Democracies (Oxford: OUP).   \nDella Porta, Donatella (2006), Globalization from Below: transnational activists and protest networks \n(Minneapolis: University of Minnesota Press). \nDowns, Anthony (1957), An Economic Theory of Democracy (New York: Harper and Row). \nDryzek, John (2000), Deliberative Democracy and Beyond: Liberals, Critics, Contestations (Oxford: \nOUP). \nDuchesne, Sophie and Haegel, Florence (2007), 'Avoiding or Accepting Conflict in Public Talk', British \nJournal of Political Science, 37 (1). \nFishkin, James (1991), Democracy and deliberation: new directions for democratic reform (New Haven: \nYale University Press). \nFlinders, Matthew and Buller, Jim (2006), ‘Depoliticisation: Principles, Tactics and Tools’, British \nPolitics, 1, (3) pp.293-318. \nFranklin, Mark, Tom Mackie, Henry Valen et al. (1992), Electoral Change: Responses to Evolving Social \nand Attitudinal Structures in Western Countries (Cambridge CUP). \n  23 \n                                                                                                                                            \nFreeden, Michael (2005), ‘Confronting the Chimera of a “Post-Ideological” Age’, Critical Review of \nInternational Social and Political Philosophy 8 (2), pp.247- 262. \nFung, Archon (2003), 'Recipes for public spheres: eight institutional design choices and their \nconsequences', The Journal of Political Philosophy, 11 (3), 338-67. \nGinsborg, Paul (2005), The Politics of Everyday Life: Making Choices, Changing Lives (London: Yale \nUniversity Press). \nGramsci, Antonio (1971), Selections from the Prison Notebooks, eds. Quintin Hoare and Geoffrey \nNowell-Smith (London: Lawrence & Wishart). \nGoodin, Robert E. (2008), Innovating Democracy, (Oxford: OUP). \nHay, Colin (2007), Why We Hate Politics (Cambridge: Polity). \nHendriks, Carolyn M., Dryzek, John S., and Hunold, Christian (2007), 'Turning up the heat: Partisanship \nin deliberative innovation', Political Studies, 55 (2), 362–83. \nHirst, Paul and Grahame Thompson (1999) Globalisation in Question: The International Economy and \nthe Possibilities of Governance (Cambridge: Polity). \nHume, David ([1748] 1998), ‘Of parties in general’, Political Essays (Cambridge: CUP), pp.33-40. \nKant, Immanuel ([1784] 1996), ‘An answer to the question: What is Enlightenment’, in Mary J. Gregor \n(ed.), Practical philosophy (Cambridge: CUP), pp.11-22. \nKeck, Margret and Sikkink, Kathleen (1998), Activists Beyond Borders: Advocacy Networks in \nInternational Politics (Ithaca: Cornell University Press). \nKelsen, Hans (2000), ‘On the Essence and Value of Democracy’, in Arthur Jacobson and Bernard Schlink \n(eds.) Weimar: A Jurisprudence of Crisis, trans. Belinda Cooper (Berkeley: University of \nCalifornia Press). \nKeynes, John Maynard (2007 \/ 1936), General Theory of Employment, Interest and Money (London: \nMacmillan). \nKirchheimer, Otto (1966), 'The Transformation of the Western European Party Systems' in La Palombara \nand Weiner (eds) Political Parties and Political Development (Princeton: PUP). \nKnutsen, Oddbjorn (2006), ‘The Decline of Social Class?’ in Dalton and Klingemann (eds.) The Oxford \nHandbook of Political Behaviour.  \nLaclau, Ernesto (2005), On Populist Reason (London: Verso). \nLehmbruch, Gerhard (1979), ‘Liberal Corporatism and Party Government’, in Schmitter, Philippe C. and \nLehmbruch (eds.) Trends toward corporatist intermediation (London: Sage), pp. 147-83.. \nLipset, Seymour and Stein Rokkan (1967), Party Systems and Voter Alignments (Toronto: The Free \nPress). \nLupia, Arthur and Matsuaka, John G. (2004), ‘Direct Democracy: New Approaches to Old Questions,’ \nAnnual Review of Political Science 7: pp.463-82. \nMair, Peter (1997), Party System Change. Approaches and Interpretation (Oxford, OUP). \n--- (2005), ‘Popular Democracy and the European Union Polity’, European Governance Papers \n(EUROGOV) No. C-05-03. \n---, (2006), ‘Ruling the Void? The Hollowing of Western Democracy’, New Left Review, 42 (Nov\/Dec). \n--- (2007), ‘Political Opposition and the European Union’, Government and Opposition, 42 (1). \n--- (2008), ‘The Challenge to Party Government’, West European Politics 31 (1). \nMontesquieu, Charles de Secondat ([1734] 1999), Considerations on the causes of the greatness of the \nRomans and their decline, trans. David Lowenthal (Indianapolis: Hackett). \nMouffe, Chantal (2005), On the Political (London: Verso). \nMudde, Cas (2004), ‘The Populist Zeitgeist’, Government and Opposition 39(4). \nMuirhead, Russell (2006), ‘A defence of party spirit’, Perspectives on Politics, 4 (4), pp.713 - 27. \nOffe, Claus (1990), 'Reflections on the Institutional Self-transformation of Movement Politics: A \nTentative Stage Model', in Russell J. Dalton and Manfred Kuechler (eds.), Challenging the \nPolitical Order: New Social and Political Movements in Western Democracies (Cambridge: \nPolity). \n--- (2006), 'Political disaffection as an outcome of institutional practices? Some post-Tocquevillean \nspeculations', in T. Mariano and G. R. Montero (ed.), Political Disaffection in Contemporary \nDemocracies. Social capital, institutions and politics. (London: Routledge), pp.23-45. \nPettit, Philip (2001) ‘Deliberative Democracy and the case for Depoliticising Government’, University of \nNSW Law Journal, 24 (3). \nPhillips, Anne (1994), ‘Dealing with difference: a politics of ideas or a politics of presence’, \nConstellations, 1, pp.74-91. \nRosenblum, Nancy (2008), On the Side of the Angels An Appreciation of Parties and Partisanship \n(Princeton: Princeton University Press). \nRousseau, Jean Jacques ([1762] 1997), 'Of the social contract', in Victor Gourevitch (ed.), The social \ncontract and other later political writings (Cambridge: CUP), 39-161. \n  24 \n                                                                                                                                            \nRyfe, David M. (2005), 'Does deliberative democracy work?' Annual Review of Political Science, 8 (1), \n49-71. \nSartori, Giovanni (1976), Parties and Party Systems (Cambridge: CUP). \n--- (1968), “The Sociology of Parties. A critical review”, in Peter Mair (ed.), 1990, The West European \nParty System (Oxford, OUP). \nSchattschneider, E. E. (1942), Party Government (New York: Holt, Rinehart & Winston). \nSchlesinger, Joseph A. (1991), Political Parties and the Winning of Office (Ann Arbor: University of \nMichigan Press). \nSchmitter, Philippe C. (1974), ‘Still the Century of Corporatism?’ The Review of Politics, 36 (1), pp.85-\n131. \nTeorell, Jan (1999), ‘A Deliberative Defence of Intra-Party Democracy’, Party Politics, 5, pp.363-82. \nTilly, Charles and Tarrow, Sidney (2007), Contentious Politics (Boulder, Colo.: Paradigm). \nUrbinati, Nadia (2006), Representative Democracy: Principles and Genealogy (Chicago: Chicago UP). \nVoltaire, Francois-Marie Arouet ([1752] 2003), Philosophical Dictionary (Montana: Kessinger). \nYoung, Iris Marion (2001), ‘Activist Challenges to Deliberative Democracy’, Political Theory, 29 (5) \npp.670-90. \nWare, Alan (1986), ‘Political parties’, in David Held and Christopher Pollitt (ed.), New Forms of \nDemocracy (London: Sage), pp.110-34. \nWhite, Jonathan (a, 2010), ‘Europe and the Common’, Political Studies 58 (1). \n--- (b, 2010), ‘Europe in the Political Imagination’, Journal of Common Market Studies 48 (4). \nYpi, Lea (2008), ‘Statist Cosmopolitanism’, The Journal of Political Philosophy, 16 (4), pp. 391-418. \n--- (2010), ‘Politically constructed solidarity: the idea of a cosmopolitan avant-garde’, Contemporary Political \nTheory, 9 (1). \n"}