{"doi":"10.1080\/09687760600837066","coreId":"5875","oai":"oai:generic.eprints.org:678\/core5","identifiers":["oai:generic.eprints.org:678\/core5","10.1080\/09687760600837066"],"title":"Attitudes to the rights and rewards for author contributions to repositories for teaching and learning","authors":["Bates, Melanie","Loddington, Steve","Manuel, Sue","Oppenheim, Charles"],"enrichments":{"references":[{"id":190590,"title":"Contributing to FERLS survey: final report. Available online at: http:\/\/ ferl.becta.org.uk\/display.cfm?page=727 (e-mail team to receive report).","authors":[],"date":"2005","doi":null,"raw":"FERL (2005)  Contributing to FERLS survey: final report.  Available online at: http:\/\/ ferl.becta.org.uk\/display.cfm?page=727 (e-mail team to receive report).","cites":null},{"id":190589,"title":"Digital rights management: final report (Linlithgow, Intrallect). Available online at: http:\/\/www.intrallect.com\/drm-study\/ DRMFinalReportv2.pdf (accessed 15","authors":[],"date":"2004","doi":null,"raw":"Duncan, C., Barker, E., Douglas, P., Morrey, M. & Waelde, C. (2004) Digital rights management: final report (Linlithgow, Intrallect). Available online at: http:\/\/www.intrallect.com\/drm-study\/ DRMFinalReportv2.pdf (accessed 15 November 2005).","cites":null},{"id":190587,"title":"Engaging with the learning object economy, in: A. Littlejohn (Ed.) Reusing online resources: a sustainable approach to e-learning (London,","authors":[],"date":"2003","doi":null,"raw":"Campbell, L. (2003) Engaging with the learning object economy, in: A. Littlejohn (Ed.) Reusing online resources: a sustainable approach to e-learning (London, Kogan Page), 35–45.","cites":null},{"id":190588,"title":"Institutional repositories: hidden treasures,","authors":[],"date":"2004","doi":null,"raw":"Drake, M. (2004) Institutional repositories: hidden treasures, Searcher, 12(5), 41–45.","cites":null},{"id":190586,"title":"Open educational resources: forum report. Available online at:","authors":[],"date":"2006","doi":null,"raw":"Albright, P. (2006)  Open educational resources: forum report.  Available online at: http:\/\/ www.unesco.org\/iiep\/virtualuniversity\/forumsfiche.php?queryforumspages_id=23 (accessed 4 May 2006).","cites":null},{"id":190592,"title":"RoMEO Studies 1: the impact of copyright ownership on academic author self-archiving,","authors":[],"date":"2003","doi":"10.1108\/00220410310698239","raw":"Gadd, E., Oppenheim, C. & Probets, S. (2003a) RoMEO Studies 1: the impact of copyright ownership on academic author self-archiving, Journal of Documentation, 59(3), 243–277.","cites":null},{"id":190591,"title":"Understanding faculty to improve content recruitment for institutional repositories, D-Lib Magazine. Available online at: http:\/\/dlib.org\/dlib\/january05\/ foster\/01foster.html (accessed 15","authors":[],"date":"2005","doi":null,"raw":"Foster, N. F. & Gibbons, S. (2005) Understanding faculty to improve content recruitment for institutional repositories, D-Lib Magazine. Available online at: http:\/\/dlib.org\/dlib\/january05\/ foster\/01foster.html (accessed 15 November 2005).","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-03","abstract":"In the United Kingdom over the past few years there has been a dramatic growth of national and regional repositories to collect and disseminate resources related to teaching and learning. Most notable of these are the Joint Information Systems Committee’s Online Repository for [Learning and Teaching] Materials as well as the Higher Education Academy’s subject specific resource databases. Repositories in general can hold a range of materials not only related to teaching and learning, but more recently the term ‘institutional repository’ is being used to describe a repository that has been established to support open access to a university’s research output. This paper reports on a survey conducted to gather the views of academics, support staff and managers on their past experiences and future expectations of the use of repositories for teaching and learning. The survey explored the rights and rewards associated with the deposit of materials into such repositories. The findings suggest what could be considered to be an ‘ideal’ repository from the contributors’ perspective and also outlines many of the concerns expressed by respondents in the survey","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/5875.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/678\/1\/ALT_J_Vol15_No1_2007_Attitudes_to_the_rights_and_re.pdf","pdfHashValue":"6caf970a391d2b704b3184bb3c5dd78abf9763ad","publisher":"Taylor and Francis Ltd","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:678<\/identifier><datestamp>\n      2011-04-04T09:03:46Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/678\/<\/dc:relation><dc:title>\n        Attitudes to the rights and rewards for author contributions to repositories for teaching and learning<\/dc:title><dc:creator>\n        Bates, Melanie<\/dc:creator><dc:creator>\n        Loddington, Steve<\/dc:creator><dc:creator>\n        Manuel, Sue<\/dc:creator><dc:creator>\n        Oppenheim, Charles<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        In the United Kingdom over the past few years there has been a dramatic growth of national and regional repositories to collect and disseminate resources related to teaching and learning. Most notable of these are the Joint Information Systems Committee’s Online Repository for [Learning and Teaching] Materials as well as the Higher Education Academy’s subject specific resource databases. Repositories in general can hold a range of materials not only related to teaching and learning, but more recently the term ‘institutional repository’ is being used to describe a repository that has been established to support open access to a university’s research output. This paper reports on a survey conducted to gather the views of academics, support staff and managers on their past experiences and future expectations of the use of repositories for teaching and learning. The survey explored the rights and rewards associated with the deposit of materials into such repositories. The findings suggest what could be considered to be an ‘ideal’ repository from the contributors’ perspective and also outlines many of the concerns expressed by respondents in the survey.<\/dc:description><dc:publisher>\n        Taylor and Francis Ltd<\/dc:publisher><dc:date>\n        2007-03<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/678\/1\/ALT_J_Vol15_No1_2007_Attitudes_to_the_rights_and_re.pdf<\/dc:identifier><dc:identifier>\n          Bates, Melanie and Loddington, Steve and Manuel, Sue and Oppenheim, Charles  (2007) Attitudes to the rights and rewards for author contributions to repositories for teaching and learning.  Association for Learning Technology Journal, 15 (1).  pp. 67-82.  ISSN 0968-7769 (print)\/1741-1629 (online)     <\/dc:identifier><dc:relation>\n        10.1080\/09687760600837066<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/678\/","10.1080\/09687760600837066"],"year":2007,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"ALT-J, Research in Learning Technology\nVol. 15, No. 1, March 2007, pp. 67–82\nISSN 0968-7769 (print)\/ISSN 1741-1629 (online)\/07\/010067–16\n© 2007 Association for Learning Technology\nDOI: 10.1080\/09687760600837066\nAttitudes to the rights and rewards for \nauthor contributions to repositories for \nteaching and learning\nMelanie Bates, Steve Loddington, Sue Manuel and \nCharles Oppenheim*\nLoughborough University, UK\nTaylor and Francis LtdCALT_A_183643.sgm10.1080\/09687760600837066ALT-J Research n earning Technology0968 7769 (pri t)\/1741-1629 (online)Original Article2 06 & Fr n is43 000S ptember 2 6harlesOpp heim.Oppenheim@lboro. c.uk\nIn the United Kingdom over the past few years there has been a dramatic growth of national and\nregional repositories to collect and disseminate resources related to teaching and learning. Most\nnotable of these are the Joint Information Systems Committee’s Online Repository for [Learning\nand Teaching] Materials as well as the Higher Education Academy’s subject specific resource data-\nbases. Repositories in general can hold a range of materials not only related to teaching and learning,\nbut more recently the term ‘institutional repository’ is being used to describe a repository that has\nbeen established to support open access to a university’s research output. This paper reports on a\nsurvey conducted to gather the views of academics, support staff and managers on their past expe-\nriences and future expectations of the use of repositories for teaching and learning. The survey\nexplored the rights and rewards associated with the deposit of materials into such repositories. The\nfindings suggest what could be considered to be an ‘ideal’ repository from the contributors’ perspec-\ntive and also outlines many of the concerns expressed by respondents in the survey.\nIntroduction\nThere are a number of different initiatives that promote the open use of learning and\nteaching materials. In 2002, the term ‘Open Educational Resources’ was adopted by\nthe United Nations Educational Scientific and Cultural Organization ‘to refer to the\nopen provision of educational resources, enabled by information and communication\ntechnologies, for consultation, use and adaptation by a community of users for non-\ncommercial purposes’ (Albright, 2006). Some initiatives have developed, or are in the\nprocess of developing, systems that provide users with Open Educational Resources.\nMost notably, the Massachusetts Institute of Technology OpenCourseWare\nInitiative, which provides ‘a free and open educational resource for faculty, students,\n*Corresponding author. Department of Information Science, Loughborough University, \nLoughborough LE11 3DN, UK. Email: c.oppenheim@lboro.ac.uk\n68 M. Bates et al.\nand self-learners around the world’ (Massachusetts Institute of Technology Open-\nCourseWare, 2006), and more recently, in the United Kingdom, the Open University\nannounced their Open Content Initiative project. This £5.65 million project, jointly\nfunded by the William and Flora Hewlett Foundation, aims to provide users with ‘a\nselection of higher education learning resources and provides on-line tools to manage\nlearning and support and the development of collaborative learning communities’\n(Open University, 2006, p. 3). Despite the growth of these international\/national\nrepositories, the growth and popularity of such repositories at institutional levels is\nunclear. Also, what barriers exist and what incentives are needed to motivate people\nto contribute to these types of repositories?\nThe Rights and Rewards in Blended Institutional Repositories project is funded\nunder the Joint Information Systems Committee (JISC) Digital Repositories\nProgramme. The programme, which funds over 20 projects, aims to cover a variety\nof topics in relation to repositories and to bring together a wide range of expertise.\nThe JISC acknowledges that ‘Digital repositories are, in many ways, an emerging\narea’ and recognises that ‘they are of considerable importance to institutions, staff\nand students in further and higher education’ (Jacobs, 2005).\nAs part of the first phase of the project, a survey of academics, support staff and\nmanagers was carried out. This was undertaken to discover their views in relation to\ncontributing teaching and learning materials to Institutional Repositories (IR). The\nsurvey aimed to identify motivational factors, as well as barriers that have discouraged\npeople from contributing in the past and what types of rewards (both financial and\nnon-financial) would encourage contribution. The survey also gathered information\nabout intellectual property rights that contributors were prepared to assign or license,\nand about access rights to different communities. This paper reports on the key find-\nings and concludes with some emerging issues arising from the study and identifica-\ntion of future areas of work.\nBackground\nResearch versus teaching repositories\nLittle has been written hitherto on teaching material repositories. This is in marked\ncontrast to the volume of literature on research material repositories. For example,\nSwan and Brown (2005) and Gadd et al. (2003) describe in-depth research into\nattitudes towards depositing research output into institutional repositories and\nsubject-based repositories. Genoni (2004, pp. 301–302) recognises the need for\nlearning and teaching material repositories to ‘broaden the content of institutional\nrepositories where they include many types of texts that would fall outside those\ncategories of material previously collected in libraries’. We therefore need to know\nwhich materials academics would like to contribute and find in repositories. This is\nparticularly important because, as Foster and Gibbons (2005) state, ‘in spite of the\nrapid pace at which organizations are establishing IR’s, the quantity of content depos-\nited into them remains quite modest’.\nRights and rewards for author contributions to repositories 69\nDifferent content, communities and repository types\nIt is possible that some of the barriers to populating research repositories will be\nsimilar for teaching and learning material repositories; however, there is still a need\nto focus on the specific issues around depositing teaching and learning materials—\nsuch as understanding into which type of repository academics will be willing to place\ntheir materials. Drake (2004, p. 41) identified a range of repositories: ‘Repositories\nmay be limited to one field, one department, one institution or a consortium of\nseveral institutions’. Another issue is whether or not academics are willing to grant\naccess to their materials externally. JISC’s Online Repository for [Learning and\nTeaching] Materials (JORUM) is a relatively new national repository of teaching\nmaterials. They carried out a study in 2004 (JORUM, 2004) that showed 88.6% of\nparticipants were in favour of a national repository of teaching materials and that 91%\nsaid they would contribute. The JORUM study however, did not examine motiva-\ntions, rewards or incentives.\nMotivation and incentives\nWe are aware of only one previous study on ways of rewarding academics for\ncontributing to a repository. The Further Education Resources for Learning\n(FERL) is a repository aimed at further education academics. FERL (2005)\ncarried out a survey and found that the main incentive for contributing was the\nopportunity for, and satisfaction of, sharing. However, higher education academ-\nics might have different reasons for contributing material to repositories. For\nexample, they make want to be sure that the repository they are using has a\nclear purpose, such as making materials available to students pre and post\nlectures.\nPotential barriers\nGadd et al. (2003) found that 32% of the authors they surveyed were unaware of the\ncopyright status of their journal articles. Campbell (2003, p. 43) found that ‘some\neducators may be wary of sharing their resources within and beyond their own\ncommunities of practice if there is a risk of IPR [Intellectual Property Rights] being\nviolated’, and the JISC Digital Rights Management (DRM) study (Duncan et al.,\n2004) found that the ‘lack of a suitable DRM approach has been seen as a genuine\nbarrier to sharing and reuse of learning resources’.\nIt is generally agreed that the technical challenges and costs of installing the\nsoftware needed to create an institutional repository are relatively minor compared\nwith the time and effort required to persuade users to populate it (Genoni, 2004,\np. 300; Horwood et al., 2004, p. 170; Foster & Gibbons, 2005). We focus in this\nstudy on what motivates contributors, and explore what barriers there are to contrib-\nuting materials. Furthermore, solutions to these barriers, which may be in the form\nof incentives, were also explored.\n70 M. Bates et al.\nMethods\nPrior to the online survey, six pilot studies using a paper-based version were carried\nout with academic staff and information professionals at Loughborough University.\nSome of the introductory text, questions and layout were amended as a result of\ncomments; in particular, the terminology used was carefully selected to minimise\nerrors in comprehension.\nThe survey addressed two main research questions: What types of repositories\nrelated to teaching and learning are academics, teaching and learning support staff\nand managers currently accessing and what are their impressions of using these repos-\nitories? What are the main barriers and incentives in contributing to repositories for\nteaching and learning? The survey consisted of 16 questions, divided into six sections,\nwith both open and closed questions. The Library and Information Statistics Unit\nconfirmed that the survey was valid. Two issues should be noted. Firstly, that online\nquestionnaires are likely to draw responses from those with strong views, either in\nfavour or against, the topic in question. Secondly, although awareness of repositories\nis growing, they remain unfamiliar to many, which is likely to affect the survey\nresponse rate and results.\nThe target population, the UK higher education community, were approached in\na number of ways but primarily by email invitation. Wider dissemination from this\ninitial contact was requested in all communications sent. Advertising by email was\nconsidered a good way to reach a large number of academics with little cost involved;\nhowever, it did have a number of drawbacks. The primary one was that it made it\nimpossible to give a figure for the sample size and therefore the response rate. This is\nbecause information about where the email had been forwarded to by the original\nrecipient was not available.\nA total of 755 emails were sent to 98 universities. The Times Top 100 Universities\n(Times Good University Guide, 2005) listing was used as a reference point. Some\nuniversities from this list were not contacted as email addresses were not available on\ntheir websites. The emails were sent to Pro Vice-Chancellors and Deans for teaching,\nHeads of Departments and to teaching and learning centres. Academics at Loughbor-\nough University all received a personal email requesting them to complete the\nquestionnaire. This led to a greater response rate than at other institutions (58\nresponses, 13.5% of the total sample). Responses were not received from all univer-\nsities contacted. In addition, 56 individuals at Higher Education Academy (HEA)\nSubject Centres were contacted. Many of the HEAs responded positively, stating that\nthey would circulate the email, and\/or include a mention of the questionnaire in an e-\nBulletin and on their website. Fifteen JISCMAIL lists were also sent an email,\nfollowed by a reminder near the closing date for the questionnaire. The Higher\nEducational Funding Council for England-funded Centres for Excellence in Learning\nand Teaching were also invited to respond to the survey. These mailing lists were\nselected because of their audiences’ interests and involvement with learning and\nteaching. The questionnaire was completed by 430 individuals. Responses from\nindividuals outside the initial target group were also received as follows: institutions\nRights and rewards for author contributions to repositories 71\noutside the United Kingdom, three responses; UK further education, 42 responses;\nand other, 17 responses. Table 1 presents the top 10 universities by total number of\nresponses to the questionnaire.\nSurvey analysis\nA broad range of subject disciplines and job titles were recorded (Table 2). Responses\nwere received from 88 distinct UK higher education institutions; 17 individuals failed\nto provide full information or were involved in research, consultancy, health-related\nfields or support roles (Table 3). The remainder did not provide any information\nabout their institution or department.\nFifty-seven per cent of respondents reported that they had 11 years or more expe-\nrience of working in academia; 20.2% had been employed for less than five years.\nWhen questioned about where they usually deposited teaching materials, 53.5%\nTable 1. Top 10 universities\nUniversity\nTotal responses \n(n) %\nLoughborough University 58 13.3\nManchester Metropolitan University 26 6.0\nUniversity of Edinburgh 18 4.1\nUniversity of Gloucestershire 15 3.4\nUniversity of Leeds 15 3.4\nUniversity of Plymouth 15 3.4\nUniversity of Ulster 10 2.3\nUniversity of Leicester 8 1.8\nUniversity of Liverpool 8 1.8\nUniversity of Strathclyde 8 1.8\nTable 2. Respondents’ subject discipline\nSubject collections Total (n) %\nC, D, F (Biological Sciences, Veterinary Sciences, Agriculture and related \nsubjects)\n87 20.0\nL, M, N (Social Studies, Business and Administrative Studies) 81 18.6\nX (Education) 66 15.1\nG (Mathematical and Computing Sciences) 61 14.0\nA, B (Medicine and subjects allied to Medicine) 43 9.9\nH, J, K (Engineering, Technology, Architecture, Building and Planning) 39 8.9\nP (Mass communications and Documentation including information services) 33 7.6\nV, W (Historical and Philosophical studies, Creative Arts and Design) 28 6.4\nQ, R, T (Linguistics, classics and related, Languages, Literature and related) 28 6.4\nTotal 466\n72 M. Bates et al.\nstated that they used their institutions’ VLE (Virtual Learning Environment).\nPersonal websites and departmental stores were also cited (26.7%). Some evidence\nof lack of awareness of the nature of the systems being used was noted, particularly in\nrelation to the use of VLEs. Although 230 respondents reported using a VLE, an\nadditional 26 named proprietary systems, such as Blackboard and WebCT, or in-\nhouse systems. A number of bespoke or in-house repository systems were noted in the\nfree-text comments, as well as personal storage and publicly available systems.\nWhen asked about their experience of Learning Object Repositories, low levels of\nawareness of existing repositories were expressed. The best known were JORUM\n(UK) (25.1%) and Multimedia Educational Resource for Learning and Online\nTeaching (MERLOT) (International) (17.9%). However, being aware of a repository\ndid not necessarily mean that they were downloading or using material (Table 4).\nFigures for contributing to repositories were even lower. However, there was a high\nlevel of interest expressed about repositories; for example, 27.7% of respondents\nstated that they would look at MERLOT.\nOther cited repositories included subject-specific repositories, HEA repositories,\nmultimedia collections and general repositories. The HEAs were referred to on 23\noccasions, MIT Open Courseware four times, BizED four times, FERL four times,\nScottish Cultural Resources Across the Network three times and Stòr Cùram (now\nknown as the Learning Exchange) three times.\nOne hundred and eighty-seven individuals had prior experience of browsing and\ndownloading teaching material from a repository. They gave favourable responses for\nthe quality and ease of locating materials, with 69.5% strongly agreeing\/agreeing that\nTable 3. Respondents’ job title\nDescription Total (n) %\nLecturer 118 27.1\nSenior lecturer\/subject leader 106 24.3\nProfessor\/Chair 42 9.6\nCentre Manager\/Head of Department\/Head of School 38 8.7\nResearch assistant\/associate\/fellow\/reader 37 8.5\nTeaching and learning support 29 6.7\nTechnical\/computing\/IT staff 15 3.4\nTeaching fellow\/university teacher\/technical tutor 14 3.2\nLibrary\/Information Services 8 1.8\nProject Officer\/Project Coordinator\/Consultants 8 1.8\nAssociate Dean\/Deans 6 1.4\nOther 3 0.7\nTeachers in further education\/colleges 2 0.5\nSenior university management 2 0.5\nSecretarial, clerical, ancillary 1 0.2\nStudent support services 1 0.2\nTotal 430\nRights and rewards for author contributions to repositories 73\nT\nab\nle\n 4\n.\nE\nxp\ner\nie\nnc\ne \nof\n r\nep\nos\nit\nor\nie\ns \n(%\n)\nR\nep\nos\nit\nor\ny\nH\nea\nrd\n o\nf\nD\now\nnl\noa\nde\nd \nm\nat\ner\nia\nl f\nro\nm\n \nit\n (\n%\n o\nf \nth\nos\ne \nw\nho\n h\nad\n h\nea\nrd\n \nof\n it\n)\nC\non\ntr\nib\nut\ned\n \nm\nat\ner\nia\nl t\no \nit\n \n(%\n o\nf \nth\nos\ne \nw\nho\n h\nad\n h\nea\nrd\n \nof\n it\n)\nW\nill\n u\nse\n a\nga\nin\n \n(%\n o\nf t\nho\nse\n w\nho\n \nha\nd \nhe\nar\nd \nof\n it\n)\nW\nill\n \nlo\nok\n u\np\nN\nat\nio\nna\nl\/i\nnt\ner\nna\nti\non\nal\n g\nen\ner\nal\n r\nep\nos\nit\nor\nie\ns\nJO\nR\nU\nM\n25\n.1\n13\n.0\n5.\n6\n17\n.6\n26\n.7\nM\nE\nR\nL\nO\nT\n17\n.9\n37\n.7\n0.\n9\n17\n.6\n27\n.7\nN\nat\nio\nna\nl s\nub\nje\nct\n b\nas\ned\n r\nep\nos\nit\nor\nie\ns\nE\nE\nV\nL\n: I\nnt\ner\nne\nt \nG\nui\nde\n t\no \nE\nng\nin\nee\nri\nng\n, M\nat\nhs\n a\nnd\n C\nom\npu\nti\nng\n18\n.8\n18\n.6\n29\n.6\n2.\n5\n13\n.3\nH\nig\nhe\nr \nE\ndu\nca\nti\non\n A\nca\nde\nm\ny \nE\nng\nin\nee\nri\nng\n S\nub\nje\nct\n C\nen\ntr\ne \nR\nes\nou\nrc\ne \nda\nta\nba\nse\n16\n.3\n16\n.1\n37\n.1\n10\n.0\n12\n.8\nU\nK\n C\nen\ntr\ne \nfo\nr \nM\nat\ner\nia\nls\n E\ndu\nca\nti\non\n9.\n1\n8.\n9\n25\n.6\n7.\n7\n17\n.0\nR\neg\nio\nna\nl r\nep\nos\nit\nor\nie\ns\nY\nor\nks\nhi\nre\n a\nnd\n H\num\nbe\nrs\nid\ne \nL\nea\nrn\nin\ng \nR\nep\nos\nit\nor\ny\n4.\n4\n10\n.5\n21\n.1\n10\n.5\n19\n.8\nO\nbj\nec\nt \nW\nar\neh\nou\nse\n f\nor\n L\nea\nrn\nin\ng \n(N\nor\nth\n E\nas\nt)\n3.\n0\n0.\n0\n7.\n7\n0.\n0\n19\n.5\nO\nth\ner\n r\nep\nos\nit\nor\nie\ns\nB\nU\nF\nV\nC\n—\nM\nov\nin\ng \nIm\nag\ne \nG\nat\new\nay\n19\n.5\n29\n.8\n1.\n2\n17\n.9\n19\n.3\nT\nR\nIL\nT\n—\nT\nel\nev\nis\nio\nn \nan\nd \nR\nad\nio\n I\nnd\nex\n f\nor\n L\nea\nrn\nin\ng \nan\nd \nT\nea\nch\nin\ng\n15\n.1\n29\n.2\n1.\n5\n13\n.8\n23\n.3\nB\nB\nC\n M\not\nio\nn \nG\nal\nle\nry\n15\n.1\n29\n.2\n1.\n5\n13\n.8\n23\n.3\nO\nth\ner\n (\npl\nea\nse\n s\nta\nte\n)\n7.\n0\n93\n.3\n43\n.3\n43\n.3\n3.\n3\n74 M. Bates et al.\n‘The material I found was of good quality’, compared with 11.2% who disagreed\/\nstrongly disagreed. A total of 64.2% strongly agreed\/agreed that the repository was\neasy to use, compared with 22.5% who disagreed\/strongly disagreed. A total of 56.5%\nstrongly agreed\/agreed that it did not take long to locate useful content, whereas\n29.6% disagreed\/strongly disagreed. However, the respondents were less clear on the\ntimesaving and copyright potential benefits of repositories: time saving (44.3%\ndisagreed\/strongly disagreed that their workload was reduced due to the easy access\nof materials); and copyright (39.8% disagreed\/strongly disagreed that it was clear how\nmaterials could be used or modified).\nEleven individuals (6.4%) agreed\/strongly agreed that they did not want to use a\nrepository, with 16.4% responding ‘no opinion’ or ‘don’t know’. The following issues\narose: concerns about the quality or usefulness of the materials, a preference for creat-\ning their own, usability problems relating to the repository system itself and lack of\nawareness.\nThe quality and type of content emerged as an important factor. The survey asked\nwhich content users would find most useful in their ideal teaching repository. The\nresponses demonstrate a high interest in the following types of content: images\/\nmultimedia (84.0%), text-based resources\/lecture notes (71.2%), links to external\nwebsites (68.4%), case studies (68.1%), exemplars of innovative teaching and learning\nmethods (64.9%), units of learning with learning outcomes (59.8%) and subject-based\nreading lists (55.6%). The least favoured content was exemplars in methods of learner\nmanagement or administration (34.4%). Statistical analysis using the chi-squared test\nshowed that text-based materials were significantly more likely to be requested by those\nwho had been in academia for less than 10 years while Computer Assisted Learning\nresources were of greater interest to respondents with six years or more in academia.\nA number of other types were listed in the additional comments: embedded items\n(video lectures, interactive media, examination questions, student coursework assign-\nments and audio clips), information items (pedagogic guides to hardware and software,\ncontext based use-cases of resources and module outlines), assessment items and\ncomments on the expected file formats of items.\nOver one-third (38.8%) of respondents had made a contribution to a repository,\nwith 37.3% stating a preference for a departmental repository and 32.5% an institu-\ntional repository. The most frequently cited reasons for contributing were: to improve\nteaching (51.2%), to increase student motivation (48.2%) and that there was a link\nto the university’s VLE (33.3%). These results confirm the main incentives for contri-\nbutions to a repository are concerned with course management, student access to\nmaterials and alignment with traditional teaching methods. Statistical analysis shows\nthat when a repository is linked to a university VLE, contributions are more likely to\nbe made by individuals who have been in academia for more than 15 years. With less\nthan 10 years’ experience, contribution is more likely when a previous positive\nexperience of repository use has been experienced.\nOther reasons cited for contribution included: kudos (35.1%), link to research\n(31.0%), a positive experience of benefiting from existing materials (21.4%), that\ncolleagues are contributing (17.3%), compulsory (13.1%), preservation of materials\nRights and rewards for author contributions to repositories 75\n(33.9%) and financial rewards (3.0%). Of those who had contributed to a repository,\n23.1% added free-text comments to this question. A major theme of providing greater\naccess to specific groups emerged. For example, one respondent commented that ‘It\ncan make it easier and\/or cheaper for my students to access materials’. Another major\ntheme was for reasons of professionalism or altruism; for example, ‘to set an example’\nand it ‘makes life easier for other staff’.\nAbout two-thirds (286) of respondents were prevented or deterred from contribut-\ning for the following reasons: lack of awareness of repositories (43.0%), not having\nenough time to prepare materials for use outside of their institution (31.3%), materi-\nals are already in a VLE (28.0%) and lack of time to contribute (27.6%). Other\nreasons for non-contribution were given by 26.2% of respondents. Some respondents\ndid not produce materials to contribute, others expressed the intention to contribute\nin the future, while others believed that these materials are available in other ways.\nAdditional themes included personal factors (lack of knowledge or awareness of the\nissues, lack of time, lack of confidence in their own materials and not realising that\nothers would want their materials), internal factors (no departmental policy, not\nbeing asked to contribute, lack of support, or the opportunity had not arisen), context\nof materials (materials are not relevant when taken out of the context), repositories\nissues (lack of awareness of suitable repositories, desire to have materials peer\nreviewed, desire to have download statistics available, lack of confidence in the matu-\nrity of the systems and concern over a potential increase in student plagiarism) and\nIPR\/copyright issues (IPR and copyright might not be maintained and concerns over\nwho owns the copyright).\nThe survey also set out to discover what respondents ‘ideal’ teaching material\nrepository would be. This explored what conditions for access this repository would\nneed to meet and what type of material respondents would be happy to contribute, as\nwell as what review process they required. Reasons for contributing in the future were\nalso suggested; respondents were asked to choose each option according to whether\nit would make them more or less likely to contribute. Some motivating factors, both\nfinancial and non-financial, were also investigated.\nWhen asked to consider what type of repository they would be happiest to contrib-\nute to in terms of their ideal repository, a national subject-based repository was iden-\ntified by 49.3%, national all subjects by 17.9% and an institutional repository was\nfavoured by 16.0%; only 4.7% wanted a regional repository of any kind. Levels of\naccess to this ‘ideal’ repository varied, but the majority wanted some form of access\nrestriction on users. Password access to registered users was requested by 33.0%.\nLess than one-quarter (22.6%) wanted to give different access permissions on differ-\nent types of their material. In defining their ‘ideal’ repository, 31.4% wanted it to have\nopen access to anyone. Additional comments suggested taking payment for subscrip-\ntion, concerns over protection of copyright and requested feedback in the form of\naccess statistics. Two individuals expressed the surprising view that students should\nnot be allowed access.\nWith regards to materials that participants would be willing to submit to a\nrepository of teaching materials, text-based resources (70.7%) were the most\n76 M. Bates et al.\nfavoured items to contribute. ‘Reading lists’ (49.3%) and ‘photos, images,\ndiagrams or movies’(47.4%) were also popular, and the lowest (apart from ‘other’)\nwas exemplars in learner management (17.2.%). This shows that participants were\nwilling to contribute a variety of material, which shows that participants had a\nnumber of purposes in mind for their ‘ideal’ repository. Answers received for the\nfree-text comments were split into two main themes; items to embed into\nteaching, and items to inform the teaching and learning process. This also high-\nlights that participants were thinking differently about the purpose of their ideal\nrepository.\nTo ensure the quality of materials, 58.8% wanted a system where users could add\ncomments and ratings. A review of the content was requested by 57.0%, and a\ntechnical and legal review by 54.7%. The proportion not wanting any form of review\nwas only 12.1%.\nThe highest reasons (or motivations) given for contributing to a repository in the\nfuture were if support was freely available (40.9%) and not needing to maintain the\nlinks to items contributed (38.5%). Also popular was having a departmental (34.2%)\nor institutional directive (33.7%) or receiving a pay award (32.1%). The reason that\nwas most unpopular in relation to contribution being ‘much less likely’ was having an\ninstitutional directive (8.6%).\nThe survey set out to gather views on what motivators, financial or non-financial,\nwould encourage the greatest level of contribution. Things cited included nomination\nfor a salary increment (44.9%) or lump sum (36.3%), obtaining money to spend on\na teaching and learning project (29.5%) or simply the satisfaction of contributing\n(29.1%). An article in an internal publication (57.0%), the possibility of doing\npedagogical research (39.8%) and a nomination for an internal teaching prize\n(37.9%) were regarded as rewards that would have no effect in relation to motivating\nthe contribution of materials. Other motivators suggested by respondents were\naltruistic, to improve teaching and learning, the opportunity to collaborate and for\nfeedback on materials.\nWhen asked who owns the copyright on teaching materials, 54.9% responded that\nthey were unsure. A further 26.0% believed that the institution owned the copyright,\n12.8% responded that they owned the copyright and 6.3% did not answer.\nWhen asked about what operations participants would permit others to carry out\nwith their submitted material in a repository, participants were given a list of permis-\nsions and three choices to be chosen for each permission, which were ‘freely’, ‘with\nlimits or conditions’ of ‘not at all’ as shown in Figure 1.\nFigure 1. Question 14: what would you permit others to do with any teaching materials in a repository?A higher percentage of participants would allow users to display (81.5%), play\n(62.3%), print (60.4%) and save (54.3%) material freely than would allow users to\nfreely modify (27.2%) or sell (13.3%) materials. As shown in Figure 1, the number\nof participants that wanted ‘limits or conditions’ placed on their work was mostly the\nsame for each of the activities.\nOver one-half (50.5%) of the participants would not allow their materials to be\nsold, but a smaller percentage would disallow modification (20.5%) or copying of\nmaterials (16.5%). All but one of the activities had a higher number of participants\nRights and rewards for author contributions to repositories 77\nthat would freely permit them than those that would not allow them at all, and in\nmany cases the percentage of participants that would disallow an activity was small.\nIn the penultimate question, participants were asked which conditions and\/or\nrestrictions, if any, they would like. A total of 22.6% of participants stated that they\nwould not like any restrictions and 6.3% stated that they would not like any\nconditions placing on their work. However, 75.1% of participants wanted their name\nattributed to the material and 51.2% wanted their institution associated with it.\nHowever, there was less of a preference for limits to geographical regions (13.3%) and\nlimited to the number of times the material could be used (10.7%).\nIn all, 18.1% of participants made additional comments, which in most cases were\nlengthy. There were many positive altruistic reasons such as the desire to share for the\ncollective good of the subject area. One participant stated that ‘it is really nice to find\nother people use the materials. I like to hear about it and get feedback from my\ncolleagues. Teaching materials evolve and it is through this that they improve’. There\nwere, however, some concerns about the time and support needed to make materials\navailable, and there was a lack of awareness of a number of issues including techno-\nlogical difficulties and copyright awareness. The latter was a common concern; many\nrespondents commented that they were unaware of the implications of copyright and\nwhat could happen in the event of misuse of their work by students who plagiarise and\nexternal peers who could aggregate materials and pass them off as their own, without\nproper acknowledgement. One participant mentioned that ‘The main thing that stops\n0% 10% 20% 30% 40% 50% 60% 70% 80% 90% 100%\nSell\nModify\nAnnotate\nAggregate\nCopy\nSave\nLend\nExcerpt\nGive\nPrint\nDisplay\nPlay\nFreely\nWith\nlimits or\nconditions\nNot at all\nFigure 1. Question 14: what would you permit others to do with any teaching materials in \na repository?\n78 M. Bates et al.\nme sharing teaching material currently is that I am unclear about IP’. Another\ncommonly raised concern was that of obtaining and delivering content, which was\naccurate and of minimum quality to and from repositories. It is clear that the survey\nprompted strong and sometimes emotive responses to a range of issues emerging\nregarding repositories. Some participants stated that they were against repositories\nand gave reasons such as not seeing the benefits of repositories and that repositories\nmay be harmful to teaching rather than helpful. One participant stated ‘it allows lazy\nlecturers to skimp on teaching and contributes to the de-skilling of lecturing’, and\nanother stated ‘that too much use of online repositories might result in homogenised\nteaching at least within subject areas, and loss of individual creativity in the develop-\nment of teaching materials’.\nDiscussion\nCurrent practice and opinions\nThe survey identified that most of the current sharing of teaching material is through\nVLEs and departmental stores, which shows that this current participation is related\nto the purpose of course management and for facilitating the activity of teaching\nwithin an institution. The purpose of international, national and regional repositories\nlie outside the direct link to academics’ own teaching, and therefore the purpose of\nthese repositories is not clear to many people. Lack of participation in these reposito-\nries can be attributed to personal factors such as not being able to find the time and\neffort to contribute. A VLE is the most popular type of repository because most have\na purpose. Therefore, emerging repositories such as JORUM need to present a clear\nimage if they wish to encourage participation.\nBarriers\nIt is obvious that the lack of awareness of repositories is a barrier to recruiting\nteaching materials from academics and support staff. With just over one-quarter of\nrespondents having heard of JORUM and only 17.9% of MERLOT, it is not\nsurprising that a high proportion of academics are not contributing to these. It is\nunderstood that JORUM relies on an institution to be a recognised ‘contributor’\nthat has signed the agreement, and that it is a new teaching material repository and\nthat awareness within institutions is still on the increase. MERLOT has more of an\ninternational presence and has been in existence since 1997, yet there seems to be a\nlack of awareness and participation. Our results support the claim by Foster and\nGibbons (2005) that content recruitment remains modest at present because of the\nlow number of participants that have previously contributed material to a\nrepository.\nAwareness can be a barrier in a number of ways other than knowing that reposito-\nries exist. It is clear from this survey that academics are unsure about the purpose of\nrepositories, how they work and the benefits that they bring to an institution or a\nRights and rewards for author contributions to repositories 79\nsubject area. Many academics were getting confused between a VLE and a repository.\nAlthough they are similar, a VLE can be less formal than a repository, whereas a\nrepository is more structured and materials can be reviewed to maintain a certain level\nof quality. This all links back to the intended purpose of a repository, and if the\npurpose lacks clarity then this is a potential barrier to increase contribution to repos-\nitories.\nIn the RoMEO (Gadd et al., 2003) survey, 32% of respondents did not know who\nowned the copyright in their research output, compared with 54.9% in this survey.\nCuriously enough, the copyright situation for teaching materials is actually clearer\nthan for research output. Teaching output normally belongs to the employer, unless\na contract of employment varies this. The survey also found that there is was general\nlack awareness on IPR issues. This in itself creates a barrier to contributing material\nto repositories. The results suggest that academics want to retain control over their\nteaching materials by placing restrictions and conditions on their materials. This\nbacks up the JISC DRM Study findings and those of Campbell (2003). With regards\nto teaching materials, if an institution sets up a repository it should not have problems\naccessing this as it owns the material and has the right to place it into the IR’s. This\nis in contrast to research output, where in most cases the IPR has been assigned to a\npublisher.\nRewards and incentives\nRewards are a potential way of motivating academics to contribute to a repository.\nOur results indicate that a variety of financial and non-financial rewards would\nencourage academics to contribute or consider contributing to a repository of teach-\ning materials, with financial rewards being more popular than non-financial ones.\nThe general feeling among respondents was that if others were making money out of\nteaching materials, then they would also like a share. The idea of royalties was\nmentioned in some of the free-text comments as being a good idea, yet it was recog-\nnised that this may be difficult to implement.\nOne of the most preferred incentives cited (which backed up the FERL survey in\n2005) was the satisfaction of contributing, which indicates that some academics have\nan altruistic approach when it comes to sharing materials. Other incentives were that\nparticipants would share materials to improve staff development.\nConclusions\nThis was the first major survey to question academics and learning support staff in\nUK higher education institutions on their views of contributing learning and teaching\nitems to a repository. It is clear from the survey that many academics feel strongly\nabout repositories and teaching materials, and there are obvious concerns regarding\nthe misuse and manipulation of their materials. The results showed that respondents\nwere making use of a range of repositories (international, national, regional, institu-\ntional and departmental). The repositories respondents had encountered were\n80 M. Bates et al.\nreported to be easy to use (64.2%), and the material located was of good quality\n(69.5%) and relevant to their teaching (50.5%). Repository use did not lead to a\nreduction in workload for 44.3% but for 26.5% of respondents it did. On the whole,\nit did not prove to be a good way to find colleagues in other institutions active within\na given subject area.\nConcerns were expressed about the quality of the content contained in repositories.\nThis was demonstrated in the form of doubts about the quality of respondents’ own\nmaterials; whether such materials were suitable, in terms of content or presentation,\nfor sharing with others; the quality of others’ materials and whether others could\nmake use of these items. Having enough time to devote to familiarising themselves\nwith repositories, and to prepare teaching materials, both proved to be a common\nconcern. Protecting copyright was seen as a key issue for some. Further investigations\ninto the real situation with copyright ownership of teaching materials would provide\nuseful information for a range of stakeholders within academic institutions. Others\nstressed the importance of individuality and the personal nature of the creation of\ncourse materials, claiming that sharing teaching resources would make for bland\ncontent. The view that it would be easier for students to cheat and plagiarise materials\nwas also noticed. It was also felt that some individuals might make use of others’\nmaterials without contributing their own in return. Some individuals regarded the\nconcept of a repository with a degree of scepticism and would not be willing to\ncontribute to a repository.\nOn the other hand, many potential benefits to both academics and students\nwere expressed. Many were willing to share their resources with others and would\nview a repository as a valuable resource to assist in the preparation of teaching\nmaterials. The value of feedback from others on how their material had been used,\noutlining how it had been amended, was perceived to be a good way to improve\nthe quality of the materials. Potential benefits to students were seen as improving\naccess to these resources, enhancing their learning and improved teaching\nstandards.\nThe ‘ideal’ repository depends on the needs of the individual, but 58.2% expressed\na preference for a subject-based repository. The survey has highlighted the view that\ndepositors’ needs vary according to the content of the materials they are likely to be\ndepositing and restrictions they would want to place on access to their items to\nprotect copyright. The need for support in creating materials in a suitable format was\nalso clear. Table 5 summarises how our results may assist those in the process of\nsetting up a repository as it provides indicators to the requirements that contributors\nare likely to have when using a teaching material repository.\nAcknowledgements\nThe authors would like to thank the JISC for funding this project. They would also\nlike to thank all of the participants who took time to respond to the survey. The\nauthors would also like to thank Lizzie Gadd and the anonymous referees for their\nhelpful comments.\nRights and rewards for author contributions to repositories 81\nReferences\nAlbright, P. (2006) Open educational resources: forum report. Available online at: http:\/\/\nwww.unesco.org\/iiep\/virtualuniversity\/forumsfiche.php?queryforumspages_id=23 (accessed 4\nMay 2006).\nCampbell, L. (2003) Engaging with the learning object economy, in: A. Littlejohn (Ed.) Reusing\nonline resources: a sustainable approach to e-learning (London, Kogan Page), 35–45.\nDrake, M. (2004) Institutional repositories: hidden treasures, Searcher, 12(5), 41–45.\nDuncan, C., Barker, E., Douglas, P., Morrey, M. & Waelde, C. (2004) Digital rights management:\nfinal report (Linlithgow, Intrallect). Available online at: http:\/\/www.intrallect.com\/drm-study\/\nDRMFinalReportv2.pdf (accessed 15 November 2005).\nFERL (2005) Contributing to FERLS survey: final report. Available online at: http:\/\/\nferl.becta.org.uk\/display.cfm?page=727 (e-mail team to receive report).\nFoster, N. F. & Gibbons, S. (2005) Understanding faculty to improve content recruitment for\ninstitutional repositories, D-Lib Magazine. Available online at: http:\/\/dlib.org\/dlib\/january05\/\nfoster\/01foster.html (accessed 15 November 2005).\nGadd, E., Oppenheim, C. & Probets, S. (2003a) RoMEO Studies 1: the impact of copyright\nownership on academic author self-archiving, Journal of Documentation, 59(3), 243–277.\nTable 5. Preferences related to those setting up a repository\nAbout you\nOver one-half of respondents deposit materials to their institution’s VLE\nUse of repositories\nOver 80% of respondents would like to find photographs, images and diagrams in a repository \nof teaching materials; therefore, usage may increase if this content is available in the repository. \nThere are a wide range of reasons as to why people use repositories. Many reasons should be \nhighlighted to attract a large and varied audience of users and contributors\nCurrent contributions to repositories\nDepartmental and insititutional repositories were most popular in terms of current contribution\nMany currently contribute to improve their teaching and to improve student motivation, and \nthese are therefore good non-financial rewards to highlight. Reasons for not contributing were \nbecause their materials are on the VLE or not in a suitable format to share outside their \ninstitution\nFuture contributions to repositories\nOver one-half of participants wanted the subject content reviewed in terms of quality. This \nwould give the repository prestige. Contribution was more likely if support was easily and freely \navailable, therefore, such assistance may increase content recruitment. Over one-half of \nrespondents would like users to be able to add comments to materials. This facility could be used \nto encourage greater usage in the future\nRights associated with your material\nEnsure the ownership situation and copyright implications are easily understandable and \naccessible due to general lack of awareness in this area. Reassure contributors that their materials \nwill be used in accordance to their rights, to create a level of trust with them\nOther\nThere were many positive and altruistic motives for contributing and therefore it is important to \nencourage others to contribute for the collective good of the community\nIn a future paper we will explore some of the rights and rewards issues further, including an \nexploration of the possible role of Creative Commons licenses in such repositories.\n82 M. Bates et al.\nGenoni, P. (2004) Content in institutional repositories: a collection management issue, Library\nManagement, 25(6–7), 300–306.\nHorwood, L., Sullivan, S., Young, E. & Garner, J. (2004) OAI compliant institutional reposito-\nries and the role of library staff, Library Management, 24(4\/5), 170–176. Available online at:\nhttp:\/\/iris.emeraldinsight.com\/vl=6333825\/cl=130\/nw=1\/fm=docpdf\/rpsv\/cw\/mcb\/01435124\/\nv25n4\/s1\/p170 (accessed 15 November 2005).\nJacobs, N. (2005) JISC digital repositories programme. Available online at: http:\/\/www.jisc.ac.uk\/\nindex.cfm?name=programme_digital_repositories (accessed 15 November 2005).\nJORUM (2004) JORUM scoping and technical appraisal study volume III. Available online at: http:\/\/\nwww.jorum.ac.uk\/research\/archive\/docs\/vol3_Fin.pdf (accessed 15 November 2005).\nMassachusetts Institute of Technology OpenCourseWare (2006) Available online at: http:\/\/\nocw.mit.edu\/index.html (accessed 4 May 2006).\nOpen University (2006) Open content initiative: application to the William and Flora Hewlett Foundation.\nAvailable online at: http:\/\/oci.open.ac.uk\/pdf\/OU-OCI.pdf (accessed 4 May 2006).\nSwan, A. & Brown, S. (2005) Open access self-archiving: an author study. Technical report, external\ncollaborators, JISC, HEFCE. Available online at: http:\/\/eprints.ecs.soton.ac.uk\/10999\/\n(accessed 15 December 2005).\nTimes Good University Guide (2005) Times top 100 universities. Available online at: http:\/\/\nwww.timesonline.co.uk\/pdfs\/finalunitable2.pdf (accessed 22 November 2005).\n"}