{"doi":"10.1007\/s00340-009-3690-x","coreId":"139993","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/3882","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/3882","10.1007\/s00340-009-3690-x"],"title":"Self-mixing interference effects in tunable diode laser absorption spectroscopy","authors":["Masiyano, Dackson","Hodgkinson, Jane","Schilt, S.","Tatam, Ralph P."],"enrichments":{"references":[{"id":37955587,"title":"MAndersson and S Svanberg.Approachtoopticalinterferencefringesreduction in diode laser absorption spectroscopy.","authors":[],"date":"2007","doi":null,"raw":"LPersson, F Andersson, MAndersson and S Svanberg.Approachtoopticalinterferencefringesreduction in diode laser absorption spectroscopy. Appl. Phys. B 87, 523–530, 2007.","cites":null},{"id":37955586,"title":"ProcSPIE 4074, 90-98, Applicationsof Optical Fiber Sensors,","authors":[],"date":"2000","doi":null,"raw":"J Hodgkinson, R D Pride, C Tandy, D G Moodie and G Stewart, ProcSPIE 4074, 90-98, Applicationsof Optical Fiber Sensors, Alan J. Rogers; Ed. (2000)","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-09-01T00:00:00Z","abstract":"We report the effects of self-mixing interference on gas detection using tunable\ndiode laser spectroscopy. For very weak feedback, the laser diode output\nintensity gains a sinusoidal modulation analogous to that caused by low finesse\netalons in the optical path. Our experiments show that self-mixing interference\ncan arise from both specular reflections (e.g. cell windows) and diffuse\nreflections (e.g. Spectralon™ and retroreflective tape), potentially in a wider\nrange of circumstances than etalon-induced interference. The form and magnitude\nof the modulation is shown to agree with theory. We have quantified the effect\nof these spurious signals on methane detection using wavelength modulation\nspectroscopy and discuss the implications for real gas detecto","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/139993.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1007\/s00340-009-3690-x","pdfHashValue":"a08d7a00df4b9f50a7d066d5dd30ec0dec16a13b","publisher":"Springer Science   Business Media","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/3882<\/identifier><datestamp>2011-05-05T11:54:43Z<\/datestamp><setSpec>hdl_1826_19<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Self-mixing interference effects in tunable diode laser absorption spectroscopy<\/dc:title><dc:creator>Masiyano, Dackson<\/dc:creator><dc:creator>Hodgkinson, Jane<\/dc:creator><dc:creator>Schilt, S.<\/dc:creator><dc:creator>Tatam, Ralph P.<\/dc:creator><dc:description>We report the effects of self-mixing interference on gas detection using tunable\ndiode laser spectroscopy. For very weak feedback, the laser diode output\nintensity gains a sinusoidal modulation analogous to that caused by low finesse\netalons in the optical path. Our experiments show that self-mixing interference\ncan arise from both specular reflections (e.g. cell windows) and diffuse\nreflections (e.g. Spectralon™ and retroreflective tape), potentially in a wider\nrange of circumstances than etalon-induced interference. The form and magnitude\nof the modulation is shown to agree with theory. We have quantified the effect\nof these spurious signals on methane detection using wavelength modulation\nspectroscopy and discuss the implications for real gas detector<\/dc:description><dc:publisher>Springer Science   Business Media<\/dc:publisher><dc:date>2011-04-14T23:22:29Z<\/dc:date><dc:date>2011-04-14T23:22:29Z<\/dc:date><dc:date>2009-09-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>D. Masiyano, J. Hodgkinson, S. Schilt and R. P. Tatam, Self-mixing interference effects in tunable diode laser absorption spectroscopy, Applied Physics B: Lasers and Optics, Volume 96, Number 4 \/ September, 2009, pp863-874<\/dc:identifier><dc:identifier>0946-2171<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1007\/s00340-009-3690-x<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/3882<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0946-2171","issn:0946-2171"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":[],"subject":["Article"],"fullText":"1Self-mixing interference effects in tunable diode laser absorption spectroscopy\nD Masiyano1,2, J Hodgkinson1*, S Schilt3,4 and R P Tatam1\n1 Engineering Photonics Group, School of Engineering, Cranfield University, Bedfordshire,\nMK43 0AL, UK.\n2 Now at: Alps Electric (UK) Ltd, Garamonde Drive, Wymbush, Milton Keynes, MK8 8LW, UK.\n3 IR Microsystems, Rue Daniel Colladon, PSE-C, 1015 Lausanne, Switzerland.\n4 Now at: Université de Neuchâtel, Laboratoire Temps-Fréquence (LTF), Rue de Bellevaux 51, 2009\nNeuchâtel, Switzerland.\n* corresponding author j.hodgkinson@cranfield.ac.uk\nAbstract\nWe report the effects of self-mixing interference on gas detection using tunable diode laser spectroscopy. For\nvery weak feedback, the laser diode output intensity gains a sinusoidal modulation analogous to that caused by\nlow finesse etalons in the optical path. Our experiments show that self-mixing interference can arise from both\nspecular reflections (eg cell windows) and diffuse reflections (eg SpectralonTM and retroreflective tape),\npotentially in a wider range of circumstances than etalon-induced interference. The form and magnitude of the\nmodulation is shown to agree with theory. We have quantified the effect of these spurious signals on methane\ndetection using wavelength modulation spectroscopy, and discuss the implications for real gas detectors.\nOCIS codes\n300.6260 Spectroscopy, diode lasers\n120.6200 Spectrometers and spectroscopic\ninstrumentation\n300.1030 Absorption\n280.4788 Optical sensing and sensors\n21 Introduction\nTunable diode laser spectroscopy (TDLS) is a high resolution spectroscopic technique in which the emission\nfrom a laser diode is scanned or modulated across the wavelength corresponding to a single absorption line of a\ntarget gas[1]. Gas absorption linewidths are narrow (full width at half maximum of ~5 GHz at atmospheric\npressure) and therefore to resolve the gas line requires the use of lasers with narrower emission linewidths; tens\nof MHz is typical. One consequence is the long coherence length of the laser emission (typically tens of\nmetres), with the potential for optical interference arising from etalons lying on the optic axis. For the “wrong”\nlength of etalon, the resulting interference fringes appear as unwanted spectral features that can be\nindistinguishable from the absorption line of the measurand.\nThe gas sample cells themselves have been considered to be frequent culprits[2], because typical lengths of the\norder of 30 mm give rise to etalons with a free spectral range of the order of 5 GHz. Despite the use of wedged\nwindows and antireflection coated optics, small Fresnel reflections often persist in the optical path[1] or develop\nafter a period of time in the field[3]. Over time, fluctuations in temperature and \/ or vibrations of the etalon cause\nthe interference fringes to shift in wavelength such that they cannot be removed by subtraction of a zero\nbaseline. In practical systems, the resulting uncertainty is often considered to be the limiting factor in gas\ndetection performance at low concentrations. Various post-detection filtering schemes exist to remove the\nunwanted spectral features[1], but in the main these rely on those features having a width that notably differs\nfrom that of the absorption line.\nThe phenomenon of laser diode self-mixing is well-known as a means of measuring the deflection of surfaces in\na direction normal to the optic axis[4]. Figure 1 shows a simplified example. The light from a laser diode leaves\nthe front facet and, sometimes after passing through a collimating lens, is directed towards the target surface.\nReflections or scattered light are directed back towards the laser diode front facet, often but not always with the\naid of the collimating lens, which may be enlarged to collect more of the reflected light. Feedback effects within\nthe laser diode create an output intensity modulation that is periodic in the optical phase difference induced by\nsurface displacement or wavelength changes. This modulation can be monitored on the output from the rear\nfacet, using the monitor photodiode which is often found in the laser diode package. A typical set-up involves\nthe use of a single-mode Fabry-Perot laser diode, but self-mixing interference has been demonstrated using both\ndistributed feedback (DFB) laser diodes[5] and vertical cavity surface emitting lasers (VCSELs)[6]. Self-mixing\ninterference has been observed using mirrors as targets and from rough surfaces, where the returned light takes\nthe form of a speckle field[7].\n3Figure 1. Typical schematic configuration for measurement of deflection using laser diode self-mixing.\nAfter Guiliani et al[4].\nWe report observations of self-mixing induced spectral features in the absorption spectra measured for TDLS\nbased gas detection. These features are almost identical in appearance to interference fringes and can create\nequally problematic measurement uncertainties that limit detector performance. To our knowledge, self-mixing\ninterference or feedback interference has not been previously reported in TDLS, though it may have been\nwidely observed. The effect is difficult to distinguish from etalon – induced interference fringes, and as we\nshow, it can arise in a greater range of circumstances than is the case for etalons. In particular, this phenomenon\nis particularly relevant to the use of diffusely reflective surfaces within gas cells.\n2 Theory\n2.1 Gas detection\nMethane has a well-known 23 absorption band in the near infrared region of the spectrum, centred around\n1.66μm, shown in Figure 2. Our studies concentrate on the R4 quadruplet line at 1.651μm.\nFigure 2. Absorption spectrum for 100% methane in the near infra-red, calculated using data from the\nHITRAN database[8].\nFor monochromatic radiation, the level of light transmitted through a gas cell is given by the Beer-Lambert law;\n zαII  exp0 (1)\nwhere I0 is the light power transmitted in the absence of light absorption, α is the absorption coefficient of the\nwavelength \/ μm\n1.62 1.64 1.66 1.68 1.70 1.72\n0\n0.2\n0.4\nab\nso\nrp\ntio\nn\n\/c\nm\n-1\n1.6505 1.651 1.6515\n1.74\nlaser\ndiode\nd\nmonitor\nphotodiode\ntarget\nsurface\n4measurand in cm-1 (equal to the specific absorptivity of the gas ε multiplied by the gas concentration) and z is\nthe pathlength (here in cm). The gas absorptivity is often expressed in units of cm-1 per unit partial pressure of\ngas; at 1651nm and at atmospheric pressure, methane has a value of ε at the line centre of 0.38 cm-1atm-1 [8]. At\nlow values of αz, equation (1) approximates to the following linear relationship.\n zαII  10 (2)\n2.2 Interference from low finesse etalons\nLow finesse Fabry-Perot etalons within the optical path give rise to an intensity modulation that takes the\nform[9];\n δKII cos10  (3)\nwhere I0 is the incident intensity,  is the wavelength, K is a constant whose value lies between zero and one\nand δ is the optical phase of the cavity of length d, with δ = 4πd\/λ for a cavity round trip (see Figure 3). The\nvalue of K is proportional to 21rr , where r1 and r2 are the reflectivities of the two surfaces forming the etalon.\nIf the reflectivities of the two surfaces are equal (r1 = r2 = r), as might be expected in the case of windows, K\nvaries in proportion to r.\nFigure 3. A low-finesse etalon in the optical path of a detection system; the partially reflective surfaces are\noften the windows of the gas sample cell.\nThe light reflected from the cavity is also modulated, such that it is out of phase by 180° in δ with respect to the\ntransmitted intensity. The light modulation occurs outside the laser cavity and the laser itself is unaffected. The\ntotal level of light emitted from the diode (transmitted + reflected) is therefore constant, as is the voltage across\nthe laser diode at a given drive current.\n2.3 Interferometric speckle\nIf coherent light is incident on an optically rough surface, the returned light can take the form of a speckle field.\nIn speckle interferometry, the speckle is deliberately mixed with a reference beam[10]. The principle applies to\nan in-line configuration relevant to the geometry of a gas absorption cell, as shown in Figure 4, for which the\nlaser\ndiode\nd\nphoto-\ndetector\npartially reflective surfaces\n5reference beam is created by the partial reflection from an optical surface such as one side of a cell window, and\na speckle pattern is produced by scattering from a diffuse surface after a further distance d.\nFigure 4. Observation of interferometric speckle in an in-line configuration.\nIn speckle interferometry, the speckle field is imaged to provide spatial information about the target surface, but\nhere the speckles are simply integrated over the surface of a single detector. Interference features in the speckle\nimage are termed correlation fringes and represent an intensity modulation of the randomised speckle field. We\nhave previously demonstrated such an intensity modulation arising from a gas cell that uses a diffusely\nreflective surface[11]. Sirohi has shown that the intensity modulation at the detector takes the form[12];\n δAII cos10  (4)\nThe constant A is proportional to 21II , where I1 and I2 are the intensities of the reference beam and speckle\nfield respectively. For a gas cell incorporating a window (giving the reference beam) and a diffusely reflective\nsurface (giving the speckle field), the fringe amplitude is proportional to 21rr , where r1 and r2 are the surface\nreflectivities.\n2.4 Self-mixing interference\nGiuliani et al[4] have characterised the form of self-mixing interference for a general case of single-mode Fabry\nPerot laser diodes, according to the level of feedback reaching the laser. The conditions described in our\nexperimental section correspond to their “very weak feedback” regime, in which the lasers maintain single-\nmode behaviour. The laser output intensity takes the form;\n cos10 MII  (5)\nwhere I0 is the output power from the diode in the absence of feedback, I is the modulated power output in the\npresence of feedback and M is described as a modulation index (not to be confused with the modulation index\nm used in TDLS, which describes the ratio of the sinusoidal source modulation to the gas linewidth). M is a\nlaser\ndiode\nd\nphoto-\ndetector\noptically rough\nsurface\n6function of the so-called feedback parameter C (dependent on the characteristics of the laser) and, for very weak\nfeedback, proportional to r where r is the proportion of light reflected back into the laser diode.\nThis form of intensity modulation that is observed at the photodetector is therefore indistinguishable from\nequation (3), but the effects differ from those of etalon interference in two ways. Firstly, the result is a\nmodulation of the output intensity of the laser diode rather than of the intensity of light transmitted or reflected\nfrom the interfering cavity. The output from the rear facet is also modulated with a 180° phase change in δ,\ncompared to the front facet. Secondly, while the laser drive current is ramped, a modulation can also be\nobserved on the voltage across the diode[4]. The laser itself is thus affected in the case of self-mixing, forming\npart of the interfering cavity.\nFor a perfect Lambertian diffuse reflector, the level of returned light I into a small solid angle δΩ is given by\n  Ω2cos1\n4\n3\n0\nδθF\nπI\nIδr  (6)\nF is the fraction of light backscattered in total by the diffuser (=0.99 for Spectralon and similar materials, as\nused in our experiments) and θ is the angle that the collection axis makes to the normal to the surface. \n2.5 Effect of wavelength modulation spectroscopy\nWavelength modulation spectroscopy (WMS) is a well-known technique used to detect small absorption signals\nsuch as produced by low concentration gas absorption lines[1]. In WMS, a small sinusoidal modulation at a\nfrequency f (several kHz) is applied to the laser injection current to dither the wavelength emitted by the laser\ndiode, with an amplitude λm set approximately equal to the full width at half maximum of the absorption line[1].\nThe 2f component of the output is measured using a lock-in amplifier. It reaches a maximum at the absorption\nline centre and its magnitude is proportional to the depth of the absorption at low αz. If the laser centre\nwavelength is slowly swept across the absorption line (typically at mHz scan rates), the 2f signal appears as a\nsecond derivative of the absorption feature. The technique confers greater sensitivity of the measurement to\ncurved spectral features, enabling detection of small absorbances in the range 10-5-10-6 for a well designed\noptical set-up[1].\nHowever, the high sensitivity of WMS to small absorption features makes the technique also very prone to\nweak interference fringes. For a sinusoidal interference pattern, there will again be a second derivative-like\nstructure in the second harmonic signal, which also takes the form of a sinusoidal modulation. The amplitude of\nthe fringes in the 2f signal depends on the amplitude of the intensity modulation in the direct signal as\ndescribed by (3), (4) or (5), but also on the ratio of the laser wavelength modulation to the free spectral range of\nthe interference fringes Δλ\n[13]\n. For λm<<Δλ, the result as we sweep in wavelength is approximately equal to the \n7second derivative of the underlying spectrum. For λm>Δλ, the amplitude of the 2f fringes varies as a sine\nfunction of (λm\/Δλ) multiplied by an envelope function that is proportional to (λm\/Δλ)\n-1\/2 [13].\n2.6 Summary\nAll the above interference effects can create a modulation of the light intensity at a detector, both in the dc and\n2f components when WMS is applied. For low levels of returned light and a given cavity length d, the resulting\nfringes take the same sinusoidal form. The effects of interference from low reflectivity etalons and from diffuse\nreflections are equivalent. Interference caused by self-mixing in the laser diode cavity can be distinguished from\nthese effects in two ways:\n(i) Measuring a modulation of the output from the laser diode itself, which may conveniently be achieved at\nthe rear facet by using a monitor diode.\n(ii) Measuring a modulation of the voltage across the diode. This has a poor signal to noise ratio, but is more\nconvenient for laser diodes with no rear emission, such as VCSELs.\nSelf-mixing interference can be caused by both specular and diffuse reflections with equivalent effects for the\nsame levels of returned light and cavity length.\nIf multiple sources of interference effects combine, the result will be a combination of intensities taking the\nform of equations (3), (4) or (5). For cavities of different lengths, the overall form of the modulation can appear\nas a series of narrow fringes with a broader envelope.\n3 Experimental details\nWe used a straightforward implementation of WMS at f = 6 kHz with second harmonic (2f) detection at\n12 kHz. We applied a simultaneous slow wavelength scan across the spectrum at mHz rates, in the vicinity of a\ngas absorption line. A variety of different sample cell geometries was used and these are described in greater\ndetail in the results section. We also used two different types of laser diode, a distributed feedback (DFB) laser\nand a vertical cavity surface emitting laser (VCSEL). Figure 5 shows a schematic diagram of our laser diode\nmodulation and detection apparatus, in this case configured for measurement of self-mixing modulation of the\nrear facet emission from the DFB laser diode.\n8Figure 5. Schematic experimental configuration for 2f wavelength modulation spectroscopy, implemented\nusing the emission from the rear facet of the DFB laser in order to distinguish self-mixing interference from\nother types of interference.\nA detector \/ amplifier (Thorlabs PDA400) was used to detect the forward emission from the laser diode, with a\ngain of 0dB (15 kΩ). A lock in amplifier (Stanford Research SR850) was used for 2f demodulation, its output\nvoltage (X, in X,Y mode) sampled using a data acquisition card and transferred to a PC for data processing. In\nthe absence of gas, the demodulated 2f signal showed a broadly flat baseline with increasing current, as\nexpected. In the presence of methane, at the absorption line centre an increase in the 2f signal was observed\ncorresponding to the magnitude of the absorption. Single-mode operation of the laser diodes was confirmed\nusing a confocal Fabry-Perot interferometer (Toptica FPI100, FSR = 1GHz, Finesse >100). This instrument\nwas also used to determine the current tuning coefficient of our laser diodes over the wide tuning range\nconsidered in our experiments, by monitoring the transmission of the interferometer and counting fringes while\nramping the laser diode current through its full range.\nTest gases were fed to the gas cell from certified cylinders (Scott Specialty Gases), one containing hydrocarbon\n(HC) free air and the other containing methane in HC free air at a concentration of either1010 ppm or 2.5 %vol.\nA bank of mass flow controllers (Teledyne Hastings HFC-302 with THPS-400 controller) was used to control\nflow rates from the two cylinders, with downstream mixing generating different concentrations in the range\n0-2.5 %vol.\n3.1 DFB laser diode\nOur DFB laser diode package (Semelab Ltd) incorporated a 1650 nm laser (NEL NLK1U5C1CA-TS)\ncollimated with an aspheric lens (Lightpath 350230D) with clear aperture of 4.9 mm. As shown in Figure 6,\nbehind the rear facet was a gas reference cell, consisting of a Ge photodiode sitting at the bottom of a TO18 can\nfilled with 100% methane. With an internal pathlength of 5.3 mm, this facilitated locking of the laser diode\nemission to the methane line during gas detection experiments, with the 3f signal component from the Ge\nsignal\npackaged DFB\nlaser diode\nlaser\ncontroller\nsine\ngenerator\n2f lock-in\namp\nref\ntransimpedance\namplifier\nmonitor diode +\nreference gas\nsawtooth\ngeneratorΣ\n9photodiode providing our error signal. We also used this monitor photodiode to record self-mixing interference\nmodulation of the laser diode output, in which case the bulk laser temperature was set to provide emission away\nfrom a methane absorption line.\nFigure 6. Optical layout of the DFB laser package, showing key distances between components.\nThe emitted wavelength was scanned across the gas absorption line centre by applying a current ramp through a\nlaser driver (ILX Lightwave, ILX LDC-3722B), the current varying between a minimum of 30mA and a\nmaximum of 80mA (corresponding to a frequency range of 33 GHz). For WMS, a sinusoidal dither was also\napplied at a frequency of 6 kHz and an amplitude of 24mA (peak to peak), giving a peak-to-peak modulation λm\nof 0.3 pm (or 6 GHz expressed as a frequency). Gross wavelength tuning was achieved by controlling the diode\ntemperature using a Peltier element within the package.\n3.2 VCSEL diode\nA 1686nm VCSEL (Vertilas, VL-1686-1-SP-A5) was housed in a TO can with angled and antireflection (AR)\ncoated front window. It was driven by a high precision current controller (Thorlabs LDC 200 VCSEL) and a\ntemperature controller (Thorlabs TED 200). Modulation of the drive current was achieved by supplying the\ncurrent controller with a 6 kHz sine waveform from a signal generator (Hewlett Packard HP33120A). A ramp\nsignal (2.5V peak to peak) derived from a second signal generator (Stanford Research DS345) was used to scan\nthe laser DC current from 6 mA to 8 mA.\n4 Laboratory Results\nWe investigated the effect of self-mixing feedback on our two laser diodes for a variety of configurations\napplicable to gas sensing. These included feedback from an AR coated, wedged window, a retroreflector and a\ndiffuse reflector. Most of our experiments were conducted using the DFB laser because it was convenient to\nmonitor self-mixing feedback using the monitor photodiode at the rear facet, but we also confirmed self-mixing\nfeedback in the VCSEL. For these laboratory experiments, we were able to vary the cavity spacing and change\nmonitor photodiode\nenclosed in a\nTO18 can filled\nwith methane\nlaser die collimatinglens\nmain\noutput\nbeam\n6.6mm 2.9mm5.3mm\n21mm\nNOT TO SCALE\n10\nthe level of feedback reaching the laser. Finally, we made gas measurements in the presence of interference\nfringes.\n4.1 Packaged DFB laser with no external feedback\nWith no sources of feedback or etalons external to the DFB laser package, we were able to observe a\nmodulation of the laser’s output with a fringe period of several GHz. To characterise such large fringes required\ntemperature tuning of the laser while maintaining a constant drive current of 50mA. The modulation was\nobserved on both the forward and rear emission; Figure 7 shows signals recorded by the monitor diode (Ge) as\nwell as the signal from the methane reference gas within the can. The second harmonic signal was recorded\nwhile the temperature was stepped from 25°C to 53°C. This range spanned two methane absorption lines (R3\nand R4 lines of the 2ν3 band), which also allowed precise measurement of the temperature tuning coefficient\n(-12.8 GHz °C-1).\nFigure 7 (a) Theoretical methane transmission lines obtained from the Hitran database[8] for a pathlength of\n5.3mm. (b) 2f signals obtained from the monitor diode while temperature tuning the laser. (c) Expansion of\n(b). The fringe spacing was approximately 1±0.2 °C, corresponding to a cavity spacing of 12±2 mm.\n(a)\n(b)\n(c)\n1650.96 nm 1653.73 nm\n1.651 1.652 1.653 1.654\n80\n90\n100\nwavelength \/ μm\ntra\nns\nm\nis\nsi\non\n\/%\n-0.006\n-0.004\n-0.002\n0\n0.002\n30 30.5 31 31.5 32 32.5 33\n-0.10\n-0.05\n0\n0.05\n0.10\n0.15\n25 35 40 45 50 55\n51.9°C28.1°C\nTemperature\/°C\n2f\nsi\ngn\nal\n\/V\n30\n11\nA small modulation was observed on the laser output, with a periodicity of approximately 1±0.2 °C,\ncorresponding to a cavity spacing of 12±2 mm. This modulation was observed on both the rear and forward\nemissions. The spacing is consistent with self-mixing interference arising within the DFB laser package, such\nas from the monitor diode (see Figure 6), and we confirmed that moving the monitor diode caused the\ninterference to change. Although the monitor diode itself was angled to avoid etalon formation, light could still\nbe backscattered from either the photodiode itself, its contacts or the header on which it sat. The resulting weak\nmodulation persisted throughout our experiments with this laser, reported below, appearing as a broad envelope\nfor narrower fringes.\n4.2 DFB laser with feedback from wedged windows\nWe conducted an experiment to confirm the behaviour of interference effects due to self-mixing, using the\nconfiguration illustrated schematically in Figure 8. The specular reflection from the front surface of a wedged\nwindow was directed back towards the laser diode to induce feedback. This represents a worst case scenario for\ngas sensing; typically one would aim to have this reflection aligned away from the optical axis.\nFigure 8. Schematic diagram of the experimental configuration to measure the effects of feedback from a\nwedged window\nA fraction of the main beam was sampled by a beam splitter pellicle beamsplitter (Thorlabs BP245B3, 45:55\nspilt ratio) and directed to a confocal optical spectrum analyser (Toptica FPI100, FSR = 1GHz, Finesse >100)\nor detector A (Thorlabs PDA400). A slight tilt was applied to the spectrum analyser\/ detector A to direct the\nreflected beam away from the laser. A 6° wedged window was placed in the path of the transmitted beam\n154mm from laser. The optical pathlength of the cavity was estimated to be 154 mm, plus an additional 1.5 mm\naccounted for by the finite thickness of the collimating lens (n=1.586 at 1550nm). A fraction of backreflected\nlight from the wedged window was sampled by the beam splitter and directed to detector B (Thorlabs\nPDA400). After amplification, the signals detected by the reference monitor photodiode, detector A and\ndetector B were then demodulated at 2f.\nDFB laser package\nmonitor\nphotodiode\nsignal\ndetector B\npellicle\nbeamsplitter\nwedged\nwindow\ndetector A\n12\nThe results in Figure 9 show that high frequency fringes of the same periodicity were observed at each of the\nthree detectors. Using the calibrated tuning coefficient, the cavity length was estimated from these fringes to be\n163±8 mm, which compares well with the measured optical pathlength of 155.5mm.\nFigure 9. Interferometric signals caused by feedback from a wedged window placed 154mm from the laser,\nobtained at (a) the reference photodiode (100kΩ transimpedance gain), (b) detector A (0dB gain), (c)\ndetector B (30dB gain).The laser temperature was set to 40° (away from the gas line). Note different scales.\nWe conducted a further experiment to quantify self-mixing interference from windows with different\nreflectivities, in this case comparing a plain wedged window with an AR coated wedged window (Thorlabs\nPS812-C). This type of window is routinely used in gas absorption cells to reduce the intensity of specular\nreflections that might give rise to etalon effects. The AR coating had a specified reflectivity of approximately\n0.4% at 1650nm. The uncoated window (BK7 glass) had a reflectivity estimated to be 4% at 1650nm. To\nobserve weak feedback with a high signal to noise ratio, we recorded the forward emission from the laser diode\n2f\nsi\ngn\nal\n\/m\nV\n2f\nsi\ngn\nal\n\/m\nV\n0.35\n0.85\n1.35\n1.85\n2.35\n2.85\n3.35\n(a) monitor photodiode\n0.08\n0.10\n0.12\n0.14\n0.16\n0.18\n(b) detector A\n-0.02\n0.02\n0.06\n0.10\n0.14\n30 40 50 60 70\n(c) detector B\n2f\nsi\ngn\nal\n\/m\nV\nlaser current \/ mA\n13\nusing detector A in a Figure 9. Where the modulation signal was strong enough to be measurable at the rear\nfacet, it corresponded well with the modulation observed in the forward path.\nFigure 10. Self-mixing induced interference fringes observed in the laser diode forward emission for\nfeedback from (a) an uncoated 6° wedged window at a distance of 154mm, (b) an AR coated 6° wedged\nwindow at a distance of 154 mm, and (c) the latter at a distance of 227 mm.\nFor self-mixing interference, we expect to see the magnitude of the modulation vary with r , as shown here.\nAt a distance of 154mm, reducing the surface reflectivity by a factor of approximately 10 has reduced the fringe\namplitude by a factor of 2.5, in line with our expectations of a factor of 3.3. Increasing the distance to 227 mm\nreduced the amplitude by a further factor of approximately 3. However, in the latter case the effect of reducing\nthe cavity FSR is likely to dominate the change in fringe amplitude, as discussed in section 2.5, and we can\ndraw no conclusions from this about the level of self-mixing induced interference.\nAt a distance of 154 mm, the fringe amplitude obtained with the AR coated window corresponded to a gas\nconcentration of approximately ± 900 ppm CH4 in a 100 mm pathlength. Assuming equation (5) holds, we\nwould have to reduce the level of feedback to below the level of 1 part in 108 to be able to detect methane at the\nlevel of 1 ppm..\n(a) r = 4%, d = 154 mm\n-20\n-10\n0\n10\n20\n30\n40\n2f\nsi\ngn\nal\n\/m\nV\n-10\n0\n10\n20\n(b) r = 0.4%, d = 154 mm\n(c) r ≤ 0.4%, d = 227 mm\n30 40 50 60 70 80\nlaser drive current \/ mA\n-10\n0\n10\n14\n4.3 DFB laser with feedback from a retroreflective tape\nSelf-mixing interference was observed to arise from optical feedback from a retroreflective tape. In this case,\nthe modulation signal was strong enough to be observed directly on the voltage across the diode as well as on\nthe rear diode emission. With our set-up it was not practical to measure these parameters simultaneously, so the\nrear emission and the voltage were measured during consecutive experiments. In both cases, for increased\nsensitivity the 2f component of the signal was recorded, and the lock-in amplifier phase was set so as to\nminimise the background (dc) voltage signal. To ensure that the voltage signal was not directly caused by the\nlaser current modulation at f, a control experiment was conducted in the absence of external feedback.\nFigure 11 shows the correspondence between 2f components of the laser voltage and the signal received by the\nmonitor photodiode.\nFigure 11. Comparison of the self-mixing – induced 2f signal components (a) on the laser monitor\nphotodiode, (b), (c) on the laser diode voltage, and (d) on the laser diode voltage in a control experiment\nwith no external feedback.\n1\n2\n3\n4\n5\n2f\nsi\ngn\nal\n\/m\nV\n(b) diode voltage; d=150mm\n30\n-0.02\n-0.01\n0\n0.01\n0.02\n0.03\n-0.03\n(c) diode voltage; d=90mm\n(d) diode voltage; no feedback (control)\n-0.02\n-0.01\n0\n0.01\n0.02\n0.03\n-0.03\n-0.02\n-0.01\n0\n0.01\n35 40 45 50 55 60 65 70\nLaser current \/ mA\n(a) photodiode output; d=150mm\n15\nThis experiment confirms that, for strong self-mixing interference, we can observe the effect as a small\nmodulation of the laser diode voltage while ramping the drive current. The voltage modulation showed good\ncorrespondence with the modulated output intensity and increased its pitch with decreasing cavity length, as\nexpected.\nAs can be seen from Figure 11 (d), the low signal to noise ratios for voltage measurements meant that we were\nunable to observe the weak spectral feature resulting from feedback within our laser package, as mentioned in\nsection 4.1. The broad fringe envelope observed in Figure 11 (a) – (c) is therefore believed to be associated\nwith the external feedback cavity, and its FSR was observed to change with the cavity length. We have\nobserved this effect repeatably in other experiments involving higher levels of feedback (see section 4.5), but\nhave been unable to determine its precise cause.\n4.4 DFB laser with feedback from a diffuse reflector\nWe recorded self-mixing interference signals using the DFB monitor photodiode, for case of feedback from a\ndiffuse reflector (SpectralonTM) placed in the output beam at a range of distances from the laser diode. A sample\nof the results is shown in Figure 12. The modulation observed in the absence of external feedback is consistent\nwith the findings of section 4.1.\nFurther experiments were conducted for d values covering the range 38mm – 268mm. For each recorded\nspectrum, we determined the fringe spacing by counting fringes over a defined spectral region and calculated\nthe relevant cavity length using the laser diode current tuning coefficient. The results are shown in Figure 13.\n16\nFigure 12. Self-mixing modulation of the output from the rear facing DFB monitor photodiode by feedback\nfrom a SpectralonTM plate placed at different distances from the laser. (a) No external feedback, (b) d =\n38mm, (c) d = 76mm, (d) d = 131mm.\n(a) no external feedback\n(b) Spectralon, d = 38mm\n(d) Spectralon, d = 131mm\n(c) Spectralon, d = 76mmm\n-10\n-8\n-6\n-4\n-2\n0\n2\n30 40 50 60 70 80\nlaser current \/ mA\n-8\n-6\n-4\n-2\n0\n2\n-10\n-8\n-6\n-4\n-2\n0\n2\n2f\nsi\ngn\nal\n\/m\nV\n-10\n-8\n-6\n-4\n-2\n0\n2\n17\nFigure 13. Results of self-mixing feedback from a diffuse reflector: distance estimated from the fringe\ncount versus measured experimental distance from reflector to laser diode.\nAt a distance of 108 mm, the mean fringe depth was estimated to be equivalent to a gas measurement\nuncertainty of approximately 400 ppm. At this distance, the proportion of light backscattered by a perfect\nLambertian diffuser into a 4.9mm diameter aperture is estimated using equation (6) to be r  8  10-4.\nComparing this result with the equivalent estimate (r = 0.4%) of section 4.2, a reduction in the feedback level\nby a factor of 5 has resulted in an improvement in the detection uncertainty by a factor of approximately 5, in\nline with the predictions of equation (5).\n4.5 VCSEL with feedback from a retroreflective tape\nConfirmation of self-mixing modulation of the output from a VCSEL was hampered by the lack of a rear facet\nfor this laser design. Instead of monitoring the rear emission, we repeated our experiment with retroreflective\ntape to increase the signal level and monitored the voltage across the diode. Figure 14 shows the results.\n0 50 100 150 200 250 300\nexperimental distance \/ mm\ndi\nst\nan\nce\nes\ntim\nat\ned\nfro\nm\nfri\nng\nes\n\/m\nm\n0\n50\n100\n150\n200\n250\n300\n18\nFigure 14. Self-mixing interference observed as a modulation of the voltage across a VCSEL. Second\nharmonic signals obtained with retroreflective tape placed at distance d of (a) 10mm, (b) 20mm and (c)\n50mm.\nThese results confirm self-mixing interference behaviour in our VCSEL. The change in fringe spacing with\ncavity length is again consistent with equation (5). Again, at these higher levels of feedback, we observed a\nbroad envelope for the narrower fringes, and this envelope appeared to change with the external feedback\ncavity spacing.\n4.6 Gas absorption measurements\nA series of gas absorption measurements was made with relatively high levels of self-mixing feedback. In order\nto separate the effects of feedback from possible etalon effects within the gas cell, the configuration in Figure\n15 was used, which is similar to the configuration in Figure 8. Self-mixing induced interference was confirmed\nfor this configuration using the DFB monitor photodiode, but to combine this with a measurement using a gas\ncell, we recorded the effects on the forward emission. A pellicle beamsplitter (Thorlabs BP245B3, 45:55\nsplitting ratio) was used to pass a proportion of the main beam emitted by the DFB laser diode towards a\nreference detector (D1). The main beam was then directed towards a 6° wedged window, whose front surface\nwas aligned to direct the reflected beam back towards the laser with a reflectivity of approximately 0.4%, the\nfeedback at the laser diode being reduced to 0.1% of the initial intensity after traversing the beamsplitter twice.\nA conventional gas cell was used with a 10cm pathlength and 6° wedged AR coated windows to reduce etalon\neffects to an insignificant level compared with self-mixing feedback. Transmission though the cell was\nmonitored with a second detector (D2). Signals from both detectors (Thorlabs PDA400) were demodulated at\n2f\nsi\ngn\nal\n\/m\nV\nLaser current \/mA\n-20\n0\n10\n20\n6.0 6.5 7.0 7.5 8.0\n(a) retroreflector, d=10mm\n10\n-10\n0\n10 (b) retroreflector, d = 20mm\n-10\n0\n10 (c) retroreflector, d = 50mm\n19\n2f using lock-in amplifiers as previously described. With hydrocarbon free air in the gas cell, the 2f output from\neach detector \/ lock-in amplifier combination was normalised so as to balance the two readings.\nFigure 15. Configuration of experiments to investigate self-mixing feedback in gas absorption\nmeasurements.\nIn a first experiment, the laser drive current was ramped over the range 30-80mA in steps of 0.2mA, while 2f-\ndemodulated outputs were recorded simultaneously for channels D1 and D2. Scans were taken with different\nconcentrations of methane in air within the gas cell (all at atmospheric pressure). The results are shown in\nFigure 16 (a) and show self-mixing feedback on both detectors D1 and D2, with a fringe spacing dictated by the\ndistance from the wedged window to the laser diode (64mm).\nThe fact that self-mixing feedback induces a modulation on the entire laser diode output allows for a\nstraightforward reduction scheme. Here, we have simply subtracted the normalised output from the reference\nchannel D1 (after lock-in demodulation) from that of our main signal channel D2. Figure 16 (b) shows that this\nhas removed the modulation to first order. A small residual modulation remains, caused by a slight phase\nchange in δ observed between the two sets of fringes, the precise cause of which is uncertain, but it may be\nassociated with an imbalance in the two photodetector \/ amplifiers. At 1010ppm, the methane line is just\ndiscernible.\nD1\n(700mm\nfrom laser)\n64mm\nDFB laser\npackage\nD2\n45mm\n1m\ngas cell\n100mm\nNOT TO SCALE\nwindows\nmisaligned\naligned to\nreflect back\nto diode\n20\nFigure 16. Results of wavelength scans through a methane line at different concentrations, while high\nlevels of feedback were deliberately applied to the laser diode. (a) Normalised 2f signal components,\n(b) signals from D2 corrected by subtraction of the reference signal from D1. (Lock-in τ 100ms.)\nIn a second experiment, the laser diode output was locked to the methane line and 2f-demodulated outputs from\nboth detectors were recorded simultaneously. Different methane concentrations were delivered to the cell; first\nhydrocarbon free air, then 1010ppm methane in air. The results are shown in Figure 17. Here, subtraction of the\ndemodulated reference signal has improved the signal to noise ratio by over a factor of 10, giving an estimated\nlimit of detection of approximately 100ppm. Residual noise and drift in the corrected signal is attributed to\nimbalances between the two light paths leading to D1 and D2, possibly caused by etalon effects.\n-10\n0\n10\n20\n(a) normalised raw\ndata, 1.25 % vol\n(b) with reference\nsubtracted\nD2: signal from gas cell\nD1: reference detector\nlaser current \/ mA\nno\nrm\nal\nis\ned\n2f\nsi\ngn\nal\n\/u\nni\ntle\nss\n-30\n-20\n-10\n0\n10\n20\n30\n30 40 50 60 70 80\n2.5 % vol\n1.25 % vol\n1010 ppm\n0 ppm\n21\nFigure 17. Normalised 2f-demodulated output from detectors D1 and D2 plotted as a time series while\ndifferent methane concentrations (in air) were delivered to the gas cell. (a) Normalised raw data, (b) data\ncorrected by subtraction of the reference. (Lock-in τ 10s.)\nPrevious work using balanced detection schemes has been reported, showing a performance improvement when\ninterference fringes are present[14]. Such schemes are similar in principle to the work shown here, but have the\nadvantage of closer matching of the measurement and reference channels. However, the nature and source of\nthe fringes has not, to our knowledge, been explicitly reported. Here we show that an “upstream” reference\nmeasurement can compensate for the “downstream” generation of fringes.\n5 Results for a commercial VCSEL based instrument\nWe conducted experiments using a commercial gas detector (IR Microsystems microLGDTM). The instrument\nemploys a 1651 nm VCSEL (Vertilas VL-1651-1-SP-T5) mounted in a cell of 80 mm physical length with a\nreflective geometry and a total path length of 160 mm. The cell has been carefully designed so as to minimise\nthe opportunity for etalons to arise in the optical path, by tilting the photodiode to prevent direct specular\nreflection from the detector or its package to be redirected towards the laser. A custom electronics board\nperformed laser current and temperature control as well as second harmonic demodulation for WMS. Signals\nwere transferred to a computer running LabviewTM software via a RS232 port. The VCSEL was modulated at a\nfrequency f = ~20 kHz to generate a WMS gas detection signal,.\nBecause the instrument configuration was fixed, we were unable to confirm self-mixing interference behaviour\ndirectly by any of the techniques used in our laboratory experiments. Instead, we simply recorded 2f signals\n-3\n-2\n-1\n0\n1\n2\n3\n(a) Normalised raw data D1: signal\nfrom gas cell\nD2: reference\ndetector\n0 5 10 15 20\ntime \/ minutes\nno\nrm\nal\nis\ned\n2f\nsi\ngn\nal\n\/u\nni\ntle\nss\n(b) With reference subtracted\n0\n0.5\n1.0\n1.5\n1010\nppm\n1010\nppm\n0\nppm\n22\nfrom the photodiode. Figure 18 shows the results of a wavelength scan for a methane concentration of 100ppm\nwithin the cell. For straightforward WMS, a large fringe-like modulation can be observed superimposed on the\ngas line (Figure 18 (a)). These fringes can be efficiently reduced by applying a mechanical modulation[15] or a\ndeliberate low amplitude modulation to the laser[16]. Here, suppression of over a factor of 10 has been achieved\nusing the latter technique at 1.6 kHz (Figure 18 (b)).\nFigure 18. 2f WMS signals acquired by the microLGDTM for a methane concentration of 100ppm.\n(a) Interference fringes superimposed on the absorption line for straightforward WMS at f=20 kHz.\n(b) Suppression of fringes using an additional low amplitude modulation.\nThe fringe spacing was found to correspond to a 16cm cavity, twice the physical length of the gas cell. Angling\nor misaligning either the laser or the photodiode did not significantly reduce the fringe visibility. This is\nconsistent with two possible causes, (i) self mixing interference, possibly caused by a small fraction of the light\nreflected by the mirror falling directly onto the laser diode, and (ii) a weak etalon in the optical path, formed\nbetween the photodiode and mirror or the laser diode and mirror. We were unable to confirm unambiguously\nwhich of these causes was responsible.\nFollowing suppression of the fringes, the short-term rms noise was established to be approximately 1.8ppm\nover a period of 3 minutes, with a longer term zero drift of approximately 10ppm.\n0\n1\n2\n3\n4\n(a) 2f output\n2f\nsi\ngn\nal\n\/V\n0\n1\n2\n3\n4\n3 3.5 4 4.5 5\n(b) 2f output with additional\nmodulation\nlaser current \/ mA\n23\n6 Discussion and conclusions\nIn WMS, the impact of interference fringes caused by etalons in the optical path of gas cells is well-known, but\nto our knowledge the effects of self-mixing interference have not been explicitly reported. We have shown that\nthe amplitude of the resulting modulation in the laser output can be significant, corresponding to a gas signal at\nthe 900 ppm level for the reflection from an AR coated wedged window at a distance of 154mm, or 400ppm\nfrom SpectralonTM at a distance of 108mm. With our DFB laser diode, we estimate that feedback would have to\nbe reduced to below 1 part in 108 to permit detection of methane at 1ppm within a 100 mm pathlength.\nOur experiments used exaggerated levels of optical feedback in order to investigate the effect; in practice we\nexpect that good optical design would reduce this to give decreased fringe amplitudes. As mentioned above, to\nmaximise self-mixing interference signals for the purpose of distance sensing, a large diode collimating \/\ncollection lens is often used. Therefore in gas sensing applications (where we wish to minimise the effect) our\nDFB package design is less than ideal. Better immunity to weak feedback would result from the use of a\nsmaller lens aperture or from reducing the coupling efficiency. This is the case for our VCSEL design, which\nuses no lens and so has a divergent beam with a divergence angle of >10°, and a much smaller entrance\naperture for back-reflected light. We indeed observed that the VCSEL was less sensitive to feedback, with good\nsignal : noise ratios only achievable for short laser – reflector distances. However, without quantifying the level\nof returned light to the VCSEL in these experiments, it is difficult to compare the two types of diode directly. .\nGiuliani et al have compared the sensitivity of different types of laser diode, and show that some DFB lasers are\nmore sensitive to feedback than VCSELs whereas others are less sensitive, depending on the exact design [4].\nHowever we optimise the laser package design, the problem remains that if we want to use the laser diode\nemission, a return path will remain for feedback. A good quality (60dB) optical isolator would circumvent the\nproblem by reducing feedback, but for reasons of cost and simplicity, many workers prefer to avoid them,\nespecially for industrial systems. It has indeed been our experience that in small quantities, isolators designed\nfor use at non-standard wavelengths can cost more than the laser diodes themselves. Furthermore, the problem\nremains of feedback arising from reflections from the front face of the isolator. However, intensity referencing,\nas implemented in balanced detection schemes[14], can remove the effects of the modulation to first order. In our\nsimple experiments, referencing improved the signal to noise ratio by over a factor of 10.\nWe have shown that self-mixing interference can arise from specular reflections, but perhaps more importantly\nfrom diffuse reflections (in our case, from SpectralonTM and a retroreflective tape). This results means that the\npresence of dust or dirt within the optical path will also present a problem, and could be an issue for gas\ndetectors designed for use in industrial environments. Air filters can be used to protect the optics, but these\ncompromise response times and can themselves become blocked by dirt.\n24\nThus, self-mixing interference fringes can arise in a greater range of circumstances than etalon-induced fringes.\nFurthermore, if etalons are created by gas cell windows, as is often the case, the two surfaces comprising the\netalon have similar, low reflectivities and the resulting fringes have a modulation depth proportional to r.\nHowever, for self-mixing interference the modulation depth is proportional to r . Therefore, as the value of r\nreduces, limited in practice by the quality of AR coatings, self-mixing interference is increasingly dominant.\nTo conclude, we have shown that self-mixing interference can cause spurious signals to arise in gas detectors\nbased on wavelength modulation spectroscopy. As with etalon-induced fringes, the problem is particularly\nsevere for this form of gas detection, which is highly sensitive to curved or periodic spectral features with a free\nspectral range of the order of the gas absorption linewidth. For methane this corresponds to an optical path\ndifference of approximately 30 mm. In the very weak feedback regime, the effect is a sinusoidal modulation of\nthe laser diode output, whose amplitude is proportional to the square root of the level of reflected or\nbackscattered light reaching the laser diode. The modulation can be observed on the forward and rear diode\nemission (for lasers with a rear facet) as well as, for strong signals, on the voltage across the diode.\nAcknowledgements\nThis work was carried out under an EPSRC research grant (GR\/T04601\/01). Jane Hodgkinson is supported by\nan EPSRC Advanced Research Fellowship (GR\/T04595\/01).\nReferences\n[1] H I Schiff, G I Mackay and J Bechara, Chapter 5 in Air Monitoring by Spectroscopic Techniques, M W\nSigrist, Ed, M Wiley, New York (1994)\n[2] D S Bomse, A C Stanton and J A Silver, Appl. Opt. 31 (6), 718-30 (1992)\n[3] J Hodgkinson, R D Pride, C Tandy, D G Moodie and G Stewart, Proc SPIE 4074, 90-98, Applications of\nOptical Fiber Sensors, Alan J. Rogers; Ed. (2000)\n[4] G Giuliani, M Norgia, S Donati and T Bosch, J. Opt. A: Pure Appl. Opt. 4, S283-294 (2002)\n[5] J Zhou, M Wang and D Han, Opt. Express 14 (12), 5301 – 5306 (2006).\n[6] F Vogel and B Toulouse B, IEEE T. Instrum. Meas. 54 (1), 428-431 (2005)\n[7] G Giuliani, S Bozzi-Pietra and S Donati, Meas. Sci. Technol. 14 (1), 24-32 (2003)\n[8] L S Rothman et al, J. Quant. Spectrosc. Ra. 96, 139-204 (2005).\n[9] J L Santos, A P Leite and D A Jackson, Appl. Opt. 31 (34), 7361-7366 (1992).\n25\n[10] A E Ennos, Chapter 6 in Laser Speckle and Related Phenomena, J C Dainty, Ed, Springer-Verlag, Berlin\n(1975)\n[11] D Masiyano, J Hodgkinson and R P Tatam, Appl. Phys. B 90, 279-288 (2008)\n[12] R S Sirohi, Contemp. Phys. 43 (3), 161-180 (2002)\n[13] T Igushi, J. Opt. Soc. Am. B 3 (3), 419-423 (1986)\n[14] L Persson, F Andersson, M Andersson and S Svanberg. Approach to optical interference fringes reduction\nin diode laser absorption spectroscopy. Appl. Phys. B 87, 523–530, 2007.\n[15] J A Silver and A C Stanton, Appl. Opt. 27, 1914-1916 (1988)\n[16] R Reid, M El-Sherbiny, B K Garside and E A Ballik, Appl. Opt. 19, 3349-3354 (1980)\n26\n"}