{"doi":"10.1063\/1.2335594","coreId":"101012","oai":"oai:epubs.surrey.ac.uk:416","identifiers":["oai:epubs.surrey.ac.uk:416","10.1063\/1.2335594"],"title":"Fluorine-vacancy complexes in ultrashallow B-implanted Si","authors":["Abdulmalik, DA","Coleman, PG","Cowern, NEB","Smith, AJ","Sealy, BJ","Lerch, W","Paul, S","Cristiano, F"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-07-31","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"AMER INST PHYSICS","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:416<\/identifier><datestamp>\n      2017-10-31T13:58:08Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:696F6E5F6265616D<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/416\/<\/dc:relation><dc:title>\n        Fluorine-vacancy complexes in ultrashallow B-implanted Si<\/dc:title><dc:creator>\n        Abdulmalik, DA<\/dc:creator><dc:creator>\n        Coleman, PG<\/dc:creator><dc:creator>\n        Cowern, NEB<\/dc:creator><dc:creator>\n        Smith, AJ<\/dc:creator><dc:creator>\n        Sealy, BJ<\/dc:creator><dc:creator>\n        Lerch, W<\/dc:creator><dc:creator>\n        Paul, S<\/dc:creator><dc:creator>\n        Cristiano, F<\/dc:creator><dc:publisher>\n        AMER INST PHYSICS<\/dc:publisher><dc:date>\n        2006-07-31<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/416\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Abdulmalik, DA, Coleman, PG, Cowern, NEB, Smith, AJ, Sealy, BJ, Lerch, W, Paul, S and Cristiano, F  (2006) Fluorine-vacancy complexes in ultrashallow B-implanted Si   APPLIED PHYSICS LETTERS, 89 (5), ARTN 0.       <\/dc:identifier><dc:relation>\n        10.1063\/1.2335594<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/416\/","10.1063\/1.2335594"],"year":2006,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"APPLIED PHYSICS LETTERS 89, 052114 \u00012006\u0002Fluorine-vacancy complexes in ultrashallow B-implanted Si\nD. A. Abdulmalik and P. G. Colemana\u0001\nDepartment of Physics, University of Bath, Bath BA2 7AY, United Kingdom\nN. E. B. Cowern, A. J. Smith, and B. J. Sealy\nAdvanced Technology Institute, University of Surrey, Guildford, Surrey GU2 7XH, United Kingdom\nW. Lerch and S. Paul\nMattson Thermal Products GmbH, Daimlerstr. 10, D-89160 Dornstadt, Germany\nF. Cristiano\nLAAS-CNRS, 7 Avenue du Colonel Roche, 31077 Toulouse Cedex 4, France\n\u0001Received 11 May 2006; accepted 21 June 2006; published online 3 August 2006\u0002\nShallow fluorine-vacancy \u0001FV\u0002 complexes in Si have been directly observed using variable-energy\npositron annihilation spectroscopy and secondary ion mass spectrometry. The FV complexes,\nintroduced to combat the deactivation and transient-enhanced diffusion of ultrashallow boron, were\nobserved in preamorphized Si wafers implanted with 0.5 keV B and 10 keV F ions at a dose of\n1015 cm−2, and then annealed isothermally at 800 °C for times ranging from 1 to 2700 s. The\nresults are in agreement with a model which predicts that the complexes are of the form F3nVn, with\nn most probably being 1 and\/or 2. © 2006 American Institute of Physics. \u0003DOI: 10.1063\/1.2335594\u0004Interest in the beneficial consequences of implanting F\nions in Si has grown in recent years as defect engineering has\nbeen developed to meet the continuing challenges of device\nminiaturization. The application of particular interest here\nconcerns ultrashallow B implantation into preamorphized Si\nregrown via solid-phase epitaxy \u0001SPE\u0002; efficient activation of\nthe B while limiting its diffusion is the key to the formation\nof ultrashallow junctions. Recent work by Cowern et al.1\nshowed that F in B-implanted Si can form clusters that trap\ninterstitals \u0001I\u0002 released from the band of end-of-range \u0001EOR\u0002\ndefects, which in turn both retard the transient enhanced dif-\nfusion of B implants and significantly decrease their deacti-\nvation. Kham et al.2 linked F found at half the projected ion\nrange to the formation of clusters of F with vacancies \u0001V\u0002 in\nthis region. Other studies conclude that FV or FI complexes\nsuppress B diffusion by reducing I emission from extended I\ndefects generated by implantation.3,4\nVariable-energy positron annihilation spectroscopy \u0001VE-\nPAS\u0002 is used here to probe the nature of the complexes\nformed by the implanted F ions. The technique has been used\nto identify FV complexes in thermally treated F-implanted\nSi.5,6 VEPAS measures the Doppler broadening of the\n511 keV \u0001-ray annihilation line, whose extent is determined\nby the average momentum of the electrons at the annihilation\nsite. The broadening is characterized by the line-shape pa-\nrameter S, defined as the central fraction of the 511 keV line.\nS for a chosen experimental setup has a characteristic value\nfor each annihilation site, for example, for pure bulk Si or for\neach specific vacancy-type defect, the latter being strong\npositron traps. The mean depth z of positrons implanted with\nenergy E \u0001keV\u0002 is determined from the relation z=17.2\nE1.6 nm. Secondary ion mass spectrometry \u0001SIMS\u0002 measure-\nments were performed to determine atomic profiles.\nSamples used in this study were n-type \u0005100\u0006 Cz Si wa-\nfers with a resistivity of 10–20 \u0002 cm. All wafers were first\npreamorphized with 30 keV, 1015 cm−2 Ge ions, and im-\na\u0002Electronic mail: p.g.coleman@bath.ac.uk\n0003-6951\/2006\/89\u00025\u0001\/052114\/3\/$23.00 89, 05211\nDownloaded 30 Mar 2009 to 131.227.178.132. Redistribution subject toplanted with 0.5 keV B ions at 1015 cm−2. Half of the\nsamples were additionally implanted with F ions at 10 keV\nand 1015 cm−2, placing the F ions between the B implants\nand the amorphous-crystalline interface. After restoring the\namorphous layer to crystallinity via SPE regrowth at 650 °C,\nthe samples were then rapidly annealed in a N2 atmosphere\nat 800 °C for times between 1 and 2700 s.\nFigure 1 compares the variation of the S parameter, nor-\nmalized to a value \u0001=SB\u0002 of 1.00 for bulk Si, with E for the\nsamples implanted with \u0001a\u0002 B ions only and \u0001b\u0002 B followed\nby F ions. The differences in the S\u0001E\u0002 curves for incident\npositron energies in the range of \u00075–20 keV are due to the\nelectric field in the depletion region.7 The solid lines in Fig.\n1 are fits to the raw data using the code VEPFIT \u0001Ref. 8\u0002\nwhich, while being relatively insensitive to electric field, fits\nwell the position and width of the depletion region for each\nsample. The model used assumed a linear electric field in the\nrange of \u0001−9 to −3.4\u0002\u0003106 V m−1 calculated as the ratio of\nbuilt-in potential and depletion layer width, both related to\nthe impurity gradient assumed for these samples.1 Because of\nthe low doping level in the wafers used in this experiment\n\u0001\u00071015 cm−3\u0002 the fitted depletion regions extend from\n\u0007150 nm to 300–450 nm, for annealing times between 1\nand 2700 s, which are consistent with those expected theo-\nretically. Under these conditions, VEPAS data are only\nweakly sensitive to the B diffusion depth. Thus, although F\ndoes significantly influence B diffusion, the main impact of\nthe F implants on our VEPAS results occurs through the\nintroduction of F-related defects.\nFigure 2 highlights the most significant difference be-\ntween S\u0001E\u0002 for samples with and without F, which have both\nbeen annealed at 800 °C for 900 s. In the sample without F,\npositrons are drifted to the surface by the electric field, to be\nannihilated there with SS\u00070.91SB. In the F coimplanted\nsamples VEPFIT analysis indicates that positrons are drifted\nby the field to a layer of FV complexes of \u000740 nm thickness,\nwhere they are efficiently trapped; therefore, the S parameter\ncharacteristic of the defected layer SD\b0.87SB is obtained\n© 2006 American Institute of Physics4-1\n AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\n052114-2 Abdulmalik et al. Appl. Phys. Lett. 89, 052114 \u00022006\u0001via VEPFIT, rather than SS. Low SD values, associated with\nthe proximity of higher-momentum F electrons, were also\nattributed to FxVy defects by Pi et al.6 and Simpson et al.5\nThe slight variation in the measured near-surface S in the\nsamples without F \u0003Fig. 1\u0001a\u0002\u0004 arises from the different effi-\nciencies of the various internal electric fields in drifting the\npositrons to the surface. In the F-implanted samples \u0003Fig.\n1\u0001b\u0002\u0004 this small effect is overcome by the stronger effect of\ntrapping in the defect layer with S=SD.\nAt very low implantation energies some of the\npositrons—a fraction of which may be unthermalized—will\nFIG. 1. \u0001a\u0002 Normalized S parameter vs incident positron energy and positron\nmean depth for samples implanted with 0.5 keV, 1015 cm−3 B ions and\nannealed at 800 °C for different annealing times. \u0001b\u0002 Corresponding results\nfor a second set of samples in which F has been coimplanted at 10 keV at\n1015 cm−3. The solid lines are fits to the data obtained using VEPFIT.\nFIG. 2. Comparison between the S\u0001E\u0002 curves of two samples, with and\nwithout F, annealed at 800 °C for 900 s.\nDownloaded 30 Mar 2009 to 131.227.178.132. Redistribution subject tohave the ability to diffuse to the surface, evidenced by the\nsmall increase in the measured S value below \u00071 keV; this\nfraction is, however, much reduced because of the electric\nfield in the thin highly doped near-surface layer arising from\nband bending at the surface.9 This surface field region is so\nthin that some positrons are still able to penetrate the poten-\ntial barrier. In the case of the samples without F, barrier\npenetration and reaching the surface are more likely because\nthe positrons have longer effective diffusion lengths in the\nabsence of the FV layer sink, and approach the barrier more\noften. The electric fields at the surface and across the deple-\ntion region combine to direct positrons towards the FV layer,\nthereby enhancing the sensitivity of VEPAS to the defected\nlayer.\nAlthough the FV defect concentration remains high\nenough to trap all the positrons that are implanted into it with\nenergies of a few keV for annealing times from 1 to 900 s,\nthe low-energy \u0001E\u00041 keV\u0002 shapes of S\u0001E\u0002 \u0003see Figs. 1\u0001b\u0002\nand 2\u0004 suggest a decrease in the FV concentration with an-\nnealing time, as more positrons are able to diffuse to the\nsurface and the increase in S towards SS becomes more pro-\nnounced. The SIMS profiles in Fig. 3 suggest that the de-\ncrease in FV concentration is particularly marked within the\nfirst 5 nm or so beneath the surface.\nAfter annealing for 2700 s the S parameter of the de-\nfected layer increases measurably to 0.89SB \u0003Fig. 1\u0001b\u0002\u0004. Be-\ncause the small increase in diffusion to the surface is only\nseen at E\u00051.5 keV, VEPFIT is able unambiguously to at-\ntribute the increase in S to a decrease in defect concentration.\nUsing SD=0.87SB, the fraction of positrons trapped in the FV\ndefect layer after annealing for 2700 s is given by\nF = \u00011 − 0.89\u0002\/\u00011 − 0.87\u0002 = 0.85. \u00011\u0002\nThe trapping rate K of the positrons in the FV layer in the\nsame sample is then\nK = \u0006BF\/\u00011 − F\u0002 = 2.6\u0003 1010 s−1, \u00012\u0002\nwhere \u0006B is the positron annihilation rate in Si \u0001=4.54\n\u0003109 s−1\u0002.10 Now K=\u0007CD, where \u0007 is the specific positron\ntrapping rate in s−1 \u0001\b3n\u00031014 s−1, where n is the number\nof vacancies in the defect structure11\u0002 and CD is the defect\nconcentration per atom. Thus CD=K \/\u0007= \u00018.6\/n\u0002\u000310−5 per\natom, \b\u00014.3\/n\u0002\u00031018 cm−3. The uncertainty on this value is\n\u0007±25%, mostly arising from the uncertainty in the value of\nFIG. 3. SIMS profiles of F in samples implanted with 0.5 keV, 1015 cm−2 B\nand 10 keV, 1015 cm−2 F, and annealed at 800 °C for 15, 120, and 2700 s.\u0007, and larger if the assumption that \u0007 for an FxVy complex is AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\n052114-3 Abdulmalik et al. Appl. Phys. Lett. 89, 052114 \u00022006\u0001similar to that for an unattached Vy is invalid. The SIMS\nprofiles \u0001Fig. 3\u0002 yield an average F concentration in the first\n40 nm after annealing for 2700 s of 1.31\u00031019 cm−3, which\nis 3n greater than the defect concentration indicated by VE-\nPAS. The defect structure suggested by the combination of\nVEPAS and SIMS is thus F3nVn, in agreement with the the-\noretical prediction of Diebel and Dunham12 and the experi-\nmental estimate of Cowern et al.,1 from which it may be\nconcluded that the most likely value\u0001s\u0002 of n are 1 and\/or 2.\nFigure 3 also yields average F concentrations of\n\u000113.6 and 7.7\u0002\u00031019 cm−3 in the first 40 nm after annealing\nat 800 °C to 15 and 120 s, respectively. These would corre-\nspond to F3nVn concentrations of \u0003\u00014.5\/n\u0002 and \u00012.6\/n\u0002\u0004\n\u00031019 cm−3 and trapped fractions F=98.5 and 98%, respec-\ntively, in line with the assumption above that at shorter an-\nnealing times essentially all the positrons annihilated in the\ndefect layer are trapped.\nThe results presented in this letter provide evidence that\nthe F-related defects introduced beneath the ultrashallow B\nimplant are vacancy complexes F3nVn, most likely F3V\nand\/or F6V2. The vacancies trapped by the F atoms are in\nturn able to trap the interstitials migrating from the EOR\nregion and thus significantly reduce B diffusion, as observed\nby Cowern et al.1 VEPAS and SIMS results indicate that the\nconcentration of the complexes, to within 25%, decreased\n19 −3from \u0003\u00014.5\/n\u0002 to \u00012.6\/n\u0002\u0004\u000310 cm between 15 and 120 s\nDownloaded 30 Mar 2009 to 131.227.178.132. Redistribution subject toannealing times at 800 °C, but dropped significantly to\n\u00014.3\/n\u0002\u00031018 cm−3 after annealing for 2700 s.\nThe authors are grateful for the support of the EU FP6\ncoordination project CADRES. One of the authors \u0001D.A.A.\u0002\nthanks the state of Qatar for a government scholarship. An-\nother author \u0001N.E.B.C.\u0002 is sponsored by Applied Materials,\nPhilips, and the UK Royal Academy of Engineering.\n1N. E. B. Cowern, B. Colombeau, J. Benson, A. J. Smith, W. Lerch, S.\nPaul, T. Graf, F. Cristiano, X. Hebras, and D. Bolze, Appl. Phys. Lett. 86,\n101905 \u00012005\u0002.\n2M. N. Kham, H. A. W. El Mubarek, J. M. Bonar, and P. Ashburn, Mater.\nSci. Eng., B 124\/125, 192 \u00012005\u0002.\n3H. A. W. El Mubarek, and P. Ashburn, Appl. Phys. Lett. 83, 4134 \u00012003\u0002.\n4G. Impellizzeri, J. H. dos Santos, S. Mirabella, F. Priolo, E. Napolitani,\nand A. Carnera, Appl. Phys. Lett. 84, 1862 \u00012004\u0002.\n5P. J. Simpson, Z. Jenei, P. Asoka-Kumar, R. R. Robison, and M. E. Law,\nAppl. Phys. Lett. 85, 1538 \u00012004\u0002.\n6X. D. Pi, C. P. Burrows, and P. G. Coleman, Phys. Rev. Lett. 90, 155901\n\u00012003\u0002.\n7A. P. Knights and P. G. Coleman, Mater. Sci. Forum 445\/446, 123 \u00012004\u0002.\n8A. van Veen, H. Schut, J. de Vries, R. A. Hakvoort, and M. R. Ijpma, AIP\nConf. Proc. 218, 171 \u00011990\u0002.\n9J. A. Duffy, W. Bauer-Kugelmann, G. Kögel, and W. Triftshäuser, Appl.\nSurf. Sci. 116, 241 \u00011997\u0002.\n10S. Dannefaer, J. Phys. C 15, 599 \u00011982\u0002.\n11P. J. Schultz, E. Tandberg, K. G. Lynn, B. Nielsen, T. E. Jackman, M. W.\nDenhoff, and G. C. Aers, Phys. Rev. Lett. 61, 187 \u00011988\u0002.\n12Milan Diebel and Scott T. Dunham, Phys. Rev. Lett. 93, 245901 \u00012004\u0002.\n AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\n"}