{"doi":"10.1007\/s10533-009-9399-4","coreId":"59433","oai":"oai:nora.nerc.ac.uk:8246","identifiers":["oai:nora.nerc.ac.uk:8246","10.1007\/s10533-009-9399-4"],"title":"Effects of storm events on mobilisaton and in-stream processing of dissolved organic matter (DOM) in a Welsh peatland catchment.","authors":["Austnes, Kari","Evans, Christopher D.","Eliot-Laize, Caroline","Naden, Pamela S.","Old, Gareth H."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-07","abstract":"Peatlands are important contributors of dissolved organic matter (DOM) to downstream aquatic systems. We investigated the effects of storm events on dissolved organic carbon (DOC) concentrations and DOM quality in a stream draining a Welsh peatland catchment. Intensive stream samples were collected and analysed for pH, DOC, dissolved organic nitrogen (DON), absorbance and fluorescence. Soil water samples and samples of sphagnum pore water were also collected, and a simple end-member mixing model was applied to account for changes occurring during the events. Fluorescence data were interpreted using parallel factor analysis (PARAFAC). DOC concentrations increased and pH decreased during the storm events. The soil water data and the mixing model indicated that this was due to a change of flow paths and draining of the DOC-rich acrotelm. Absorbance indices and the DOC\/DON ratio suggested that the DOM released during events was less degraded. There was a striking, inversely related diurnal pattern in absorbance and fluorescence after the discharge peak. The diurnal pattern and a lack of fit with the mixing model suggested that fluorescing DOM was mainly produced in-stream. Fluorescence has been found to peak in the morning and decline during day-time due to photo-bleaching. We hypothesise that the input of additional DOM during events causes a change in the diurnal pattern, giving a peak at mid-day, when the processing of the additional DOM is highest","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/59433.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/8246\/2\/AustnesN008246PP.pdf","pdfHashValue":"7130ee05accdcf40e3bbc9953124991aca8a8c5b","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:8246<\/identifier><datestamp>\n      2014-09-12T10:44:35Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D5332<\/setSpec><setSpec>\n      7375626A656374733D533131<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/8246\/<\/dc:relation><dc:title>\n        Effects of storm events on mobilisaton and in-stream processing of dissolved organic matter (DOM) in a Welsh peatland catchment.<\/dc:title><dc:creator>\n        Austnes, Kari<\/dc:creator><dc:creator>\n        Evans, Christopher D.<\/dc:creator><dc:creator>\n        Eliot-Laize, Caroline<\/dc:creator><dc:creator>\n        Naden, Pamela S.<\/dc:creator><dc:creator>\n        Old, Gareth H.<\/dc:creator><dc:subject>\n        Agriculture and Soil Science<\/dc:subject><dc:subject>\n        Ecology and Environment<\/dc:subject><dc:description>\n        Peatlands are important contributors of dissolved organic matter (DOM) to downstream aquatic systems. We investigated the effects of storm events on dissolved organic carbon (DOC) concentrations and DOM quality in a stream draining a Welsh peatland catchment. Intensive stream samples were collected and analysed for pH, DOC, dissolved organic nitrogen (DON), absorbance and fluorescence. Soil water samples and samples of sphagnum pore water were also collected, and a simple end-member mixing model was applied to account for changes occurring during the events. Fluorescence data were interpreted using parallel factor analysis (PARAFAC). DOC concentrations increased and pH decreased during the storm events. The soil water data and the mixing model indicated that this was due to a change of flow paths and draining of the DOC-rich acrotelm. Absorbance indices and the DOC\/DON ratio suggested that the DOM released during events was less degraded. There was a striking, inversely related diurnal pattern in absorbance and fluorescence after the discharge peak. The diurnal pattern and a lack of fit with the mixing model suggested that fluorescing DOM was mainly produced in-stream. Fluorescence has been found to peak in the morning and decline during day-time due to photo-bleaching. We hypothesise that the input of additional DOM during events causes a change in the diurnal pattern, giving a peak at mid-day, when the processing of the additional DOM is highest. <\/dc:description><dc:publisher>\n        Springer<\/dc:publisher><dc:date>\n        2010-07<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/8246\/1\/N008246PP.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Austnes, Kari; Evans, Christopher D.; Eliot-Laize, Caroline; Naden, Pamela S.; Old, Gareth H..  2010  Effects of storm events on mobilisaton and in-stream processing of dissolved organic matter (DOM) in a Welsh peatland catchment.   Biogeochemistry, 99 (1-3). 157-173.  https:\/\/doi.org\/10.1007\/s10533-009-9399-4 <https:\/\/doi.org\/10.1007\/s10533-009-9399-4>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.springerlink.com\/content\/q941625833626u59\/?p=77208243912f4bcbb898b07d89d224a4&pi=0<\/dc:relation><dc:relation>\n        10.1007\/s10533-009-9399-4<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/8246\/","http:\/\/www.springerlink.com\/content\/q941625833626u59\/?p=77208243912f4bcbb898b07d89d224a4&pi=0","10.1007\/s10533-009-9399-4"],"year":2010,"topics":["Agriculture and Soil Science","Ecology and Environment"],"subject":["Publication - Article","PeerReviewed"],"fullText":" \n \n \nArticle (refereed) \n \n \n \nAustnes, Kari; Evans, Chrisptoher D.; Eliot-Laize, Caroline; \nNaden, Pamela S.; Old, Gareth H.. 2010.  Effects of storm events \non mobilisaton and in-stream processing of dissolved organic \nmatter (DOM) in a Welsh peatland catchment. Biogeochemistry, \n99 (1-3). 157-173. 10.1007\/s10533-009-9399-4 \n \n \n \n \n© Springer Science+Business Media B.V. 2009 \n \nThis version available http:\/\/nora.nerc.ac.uk\/8246\/  \n \n \nNERC has developed NORA to enable users to access research outputs \nwholly or partially funded by NERC. Copyright and other rights for material \non this site are retained by the authors and\/or other rights owners. Users \nshould read the terms and conditions of use of this material at \nhttp:\/\/nora.nerc.ac.uk\/policies.html#access  \n \n \nThis document is the author’s final manuscript version of the journal \narticle, incorporating any revisions agreed during the peer review \nprocess. Some differences between this and the publisher’s version \nremain. You are advised to consult the publisher’s version if you wish \nto cite from this article. \n \nwww.springerlink.com \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nContact CEH NORA team at  \nnoraceh@ceh.ac.uk \n \n \n \nThe NERC and CEH  trade marks and logos (‘the Trademarks’) are registered trademarks of NERC in the UK and \nother countries, and may not be used without the prior written consent of the Trademark owner. \n                             Editorial Manager(tm) for Biogeochemistry \n                                  Manuscript Draft \n \n \nManuscript Number: BIOG1172R1 \n \nTitle: Effects of storm events on mobilisation and in-stream processing of dissolved organic matter \n(DOM) in a Welsh peatland catchment \n \nArticle Type: Manuscript \n \nKeywords: DOC; DOM quality; Fluorescence; In-stream processes; Peat stream; Storm events \n \nCorresponding Author: Dr. Kari Austnes, Ph.D. \n \nCorresponding Author's Institution:  \n \nFirst Author: Kari Austnes, Ph.D. \n \nOrder of Authors: Kari Austnes, Ph.D.; Christopher D Evans; Caroline Eliot-Laize; Pamela S Naden; \nGareth H Old \n \nAbstract: Peatlands are important contributors of dissolved organic matter (DOM) to downstream \naquatic systems. We investigated the effects of storm events on dissolved organic carbon (DOC) \nconcentrations and DOM quality in a stream draining a Welsh peatland catchment. Intensive stream \nsamples were collected and analysed for pH, DOC, dissolved organic nitrogen (DON), absorbance and \nfluorescence. Soil water samples and samples of sphagnum pore water were also collected, and a \nsimple end-member mixing model was applied to account for changes occurring during the events. \nFluorescence data were interpreted using parallel factor analysis (PARAFAC). DOC concentrations \nincreased and pH decreased during the storm events. The soil water data and the mixing model \nindicated that this was due to a change of flow paths and draining of the DOC-rich acrotelm. \nAbsorbance indices and the DOC\/DON ratio suggested that the DOM released during events was less \ndegraded. There was a striking, inversely related diurnal pattern in absorbance and fluorescence after \nthe discharge peak. The diurnal pattern and a lack of fit with the mixing model suggested that \nfluorescing DOM was mainly produced in-stream. Fluorescence has been found to peak in the morning \nand decline during day-time due to photo-bleaching. We hypothesise that the input of additional DOM \nduring events causes a change in the diurnal pattern, giving a peak at mid-day, when the processing of \nthe additional DOM is highest. \n \nResponse to Reviewers: Dear editor\/reviewer \n \nThe manuscript \"Effects of storm events on mobilisation and in-stream processing of dissolved organic \nmatter (DOM) in a Welsh peatland catchment\" has been revised according to the reviewer's comments. \n \nThe main issue addressed in the review was the potential iron interference of the spectrophotometric \nanalyses. We have now explored this issue thoroughly, and our conclusion is that that there may have \nbeen some iron interference, but that this does not appear to affect the interpretation -  our main focus \nwas temporal patterns throughout the events, not absolute levels, and these patterns were hardly \naffected by the iron correction. The issue has been adressed in the methods (lines 173-195 and results \n(lines 351-364+394-401) sections. For absorbance and sUVa, Fe corrected values were included in the \nrevised paper, based on a published equation (Weishaar et al 2003). The fluorescence estimate was \nbased on a similar regression, but it was more crude as we had to produce the equation ourselves \nbased on the data in the paper by Ohno et al. (2008). Hence, we did not feel it would be appropriate to \npresent these data, but the effect was much the same as that for absorbance, and again did not alter the \ninterpretation. Having accounted for Fe interference in our revised analysis, described this in the \nmethods, and found that it did not alter the interpretation, we did not feel there was a need to alter or \nexpand the discussion and conclusions further on this subject (cf specific comment 11). However, \nfurther detail could be included if requested by the editor.  \n \nSpecific comments: \n2. The filters were rinsed with both water and sample before proper filtering, to exclude the possibility \nof filter bleed. A description of this has been included in the text (lines 155-156 and 160). \n3. The two different filters were used for two different aliquots of the sample. This has now been made \nclearer in the text (lines 157-158). Due to risk of contamination, samples to be analysed for \nfluorescence had to be filtered at CEH Wallingford according to their procedures. The different filter \nsize was also according to their procedures. 1.2 µm is sufficient to remove substituents that can cause \nscattering. There is hardly any difference in fluorescence between 0.45 and 1.2 µm, as the important \nregion is around 0.1 µm, where microbial and cellular material is removed from the solution. \n4. sUVa and E2\/E3 are not specific measures of particular properties of DOM, but are correlated with \nsome properties. This is thoroughly explained at the beginning of the discussion on DOM quality. In our \nopinion it would be confusing and too complicated to include this information in the methods section. \nThe interpretation of absorbance or fluorescence analyses are not explained either, for the same \nreason. It is merely stated in the introduction that spectrophotometric analysis gives information on \nDOM quality (lines 103-107). \n5. The fluorescence exhibited by two of the sphagnum samples may indicate some protein-like material. \nThe excitation wavelength fits with that of tyrosine or especially tryptophan, but the emission \nwavelength was somewhat lower. However, as explained (lines 284-285) this was not a significantly \nstrong feature across all samples for a component in this region to be validated. PARAFAC extracts \ncomponents in all regions of the EEM measured, so if this was a strong feature, it would have been \nexpressed in a valid component. As stated in lines 371-374 some overlap with the fluorescence caused \nby contamination in some of the samples may have reduced the chances of validating a component in \nthis region, but most likely not, as it was only a slight overlap between the regions of true and \ncontaminant fluorescence. Hence, as a true component in this region was not validated, we did not \ninclude a thorough discussion of what this component, if validated, would have represented, even \nthough it was most likely some protein-like material. \n6. This has already been addressed. \n7. Yes, we did measure blank samples from these tubes. This has now been stated in lines 370-371. \n8. The point of the mixing model was merely to give an indication of the shape of the end-member \nvariation through the event, not the exact proportions. The mixing model also highlights the strong \ndeviation of fluorescence from anything resembling conservative mixing. We consequently think the \nmixing model serves as a good illustration, and would like to keep it. A couple of lines (439-441) on the \nreliability of the different models were included.  \n9. True, this is not really a good way to express this. The main reason to include E2\/E3 is that it is a \ndifferent type of parameter, and when both parameters indicate the same change in properties, this \nstrengthens the conclusion. E2\/E3 is in fact also a more robust parameter, because there is less risk of \ncontamination when only using spectrophotometric analysis (a line on this has been included in the \ntext, line 457). However, more readers will be familiar with the sUVa index, so it would not be a good \nalternative to use E2\/E3 only. As explained above, there is no reason to believe that iron interference \nwould have a strong impact on E2\/E3. \n10. The mechanism is not clear here, as it cannot be drawn from the data themselves. However, it is not \nlikely to be related to sorption in the mineral soil as the catchment is strongly peat-dominated. \nSorption to organic soil is more likely, but we have no evidence to support such a mechanism. \n11. The discussion has been shortened wherever possible. The main changes have been made to the \nfirst section, Effects of events on DOC concentration. Here the last two paragraphs have been removed. \nWe found this discussion interesting, but removing them makes the manuscript more focused. \nAccordingly, some details have been removed from the results chapter, as these were mainly a basis for \nthis discussion. No complete paragraphs have been removed from the last two sections of the \ndiscussion, as these are the most important parts. The third section has been left as it was, while the \nsecond section has been modified to make the discussion shorter and clearer. \n \nFigures: Figure 7 is mainly an example, and can be removed. We would like to keep the rest of the \nfigures, as they give important background, or serve as useful illustrations to the reader. The figure \nnumbers are thus changed for figures 8-11, to 7-10. Some cosmetic changes have been made to figures \n3-5+7. \n \n \nYours sincerely \nKari Austnes \n \n 1 \nEffects of storm events on mobilisation and in-stream processing of dissolved 1 \norganic matter (DOM) in a Welsh peatland catchment 2 \n 3 \nK. Austnes\n1*\n, C.D. Evans\n2\n, C. Eliot-Laize\n3\n, P.S. Naden\n4\n and G.H. Old\n4 \n4 \n 5 \n1. Department of Plant and Environmental Sciences, Norwegian University of Life 6 \nSciences, P.O. Box 5003, N-1432 Ås, Norway. Current address: Norwegian Institute 7 \nfor Water Research, Gaustadalléen 21, N-0349 Oslo, Norway  8 \n2. Centre for Ecology and Hydrology Bangor, Environment Centre Wales, Deiniol 9 \nRoad, Bangor, Gwynedd, LL57 2UW, UK 10 \n3. Centre for Ecology and Hydrology Wallingford, Maclean Building, Benson Lane, 11 \nCrowmarsh Gifford, Wallingford, Oxfordshire, OX10 8BB, UK. Current address: 12 \nPremier Analytical Services, Microscopy, The Lord Rank Centre, Lincoln Road, 13 \nHigh Wycombe, Buckinghamshire, HP12 3QR, UK 14 \n 4. Centre for Ecology and Hydrology Wallingford, Maclean Building, Benson Lane, 15 \nCrowmarsh Gifford, Wallingford, Oxfordshire, OX10 8BB, UK  16 \n 17 \n*Corresponding author:  18 \nTel.: +47 02348 19 \nFax: +47 22185200 20 \nE-mail address: kari.austnes@niva.no 21 \n 22 \nRunning head: Storm events and DOM effects in a peatland catchment  23 \nArticle type: Original paper 24 \n 25 \nManuscript\nClick here to download Manuscript: AustnesBGC revised.doc Click here to view linked References\n 2 \nKey words: DOC, DOM quality, Fluorescence, In-stream processes, Peat stream, 26 \nStorm events 27 \n 28 \nAbstract 29 \n 30 \nPeatlands are important contributors of dissolved organic matter (DOM) to 31 \ndownstream aquatic systems. We investigated the effects of storm events on dissolved 32 \norganic carbon (DOC) concentrations and DOM quality in a stream draining a Welsh 33 \npeatland catchment. Intensive stream samples were collected and analysed for pH, 34 \nDOC, dissolved organic nitrogen (DON), absorbance and fluorescence. Soil water 35 \nsamples and samples of sphagnum pore water were also collected, and a simple end-36 \nmember mixing model was applied to account for changes occurring during the 37 \nevents. Fluorescence data were interpreted using parallel factor analysis (PARAFAC). 38 \nDOC concentrations increased and pH decreased during the storm events. The soil 39 \nwater data and the mixing model indicated that this was due to a change of flow paths 40 \nand draining of the DOC-rich acrotelm. Absorbance indices and the DOC\/DON ratio 41 \nsuggested that the DOM released during events was less degraded. There was a 42 \nstriking, inversely related diurnal pattern in absorbance and fluorescence after the 43 \ndischarge peak. The diurnal pattern and a lack of fit with the mixing model suggested 44 \nthat fluorescing DOM was mainly produced in-stream. Fluorescence has been found 45 \nto peak in the morning and decline during day-time due to photo-bleaching. We 46 \nhypothesise that the input of additional DOM during events causes a change in the 47 \ndiurnal pattern, giving a peak at mid-day, when the processing of the additional DOM 48 \nis highest.  49 \n 50 \n 3 \nIntroduction 51 \n 52 \nPeatlands are important contributors of dissolved organic matter (DOM) to 53 \ndownstream aquatic systems. Mean dissolved organic carbon (DOC) fluxes in rivers 54 \ndraining peat dominated areas are higher than in rivers draining most other landscape 55 \ntypes, in the order of 50-100 kg ha\n-1 \nyr\n-1\n (Aitkenhead and McDowell 2000). 56 \nPercentage peat cover is found to be a good predictor of DOC concentration across 57 \nlarge spatial scales (Aitkenhead et al. 1999). 58 \nThe concentration of DOC is commonly found to correlate positively with 59 \ndischarge in streams and rivers in temperate and boreal catchments (e.g. Thurman 60 \n1985, p. 50; Hope et al. 1994; Soulsby et al. 2003). Likewise, DOC concentrations 61 \nhave frequently been found to increase during storm events (e.g. Hinton et al. 1997; 62 \nBuffam et al. 2001). However, most studies of discharge-DOC concentration 63 \nrelationships have been conducted in catchments with organo-mineral or mixed soils 64 \n(Clark et al. 2007a). Given the significant contribution of peat systems to DOC 65 \nconcentrations and fluxes, it is important to investigate the relationship between 66 \ndischarge and not only DOC (as a measure of DOM quantity) but also DOM quality 67 \nin these systems. Studying these relationships is especially important in a climate 68 \nchange perspective, given that annual precipitation, as well as extremes of daily 69 \nprecipitation, are likely to increase in northern Europe (Christensen et al. 2007).   70 \nIn streams draining organo-mineral soils, the increased DOC concentration at 71 \nhigh discharge is commonly explained by changes in flow paths towards increased 72 \nlateral flow through the upper horizons, where DOC concentrations are higher (e.g. 73 \nMcDowell and Likens 1988; Boyer et al. 1997; Hinton et al. 1998; Inamdar et al. 74 \n2006). Change in flow path can be an important control on DOC concentration in peat 75 \n 4 \nstreams as well, but seems to depend upon the hydrological connectivity between the 76 \npeat and the underlying bedrock\/mineral soil (Clark et al. 2007a, b). Peat soils consist 77 \nof an upper horizon (the acrotelm) with roots and decomposing plant material, and a 78 \nlower horizon (the catotelm) with dense peat (Evans et al. 1999). The stored carbon in 79 \nthe catotelm is hydrologically disconnected from the stream (Billett et al. 2006). 80 \nWhere there is hydrological connectivity between the peat and the mineral soil, base 81 \nflow is characterised by alkaline DOC poor groundwater (Worrall et al. 2002; Clark et 82 \nal. 2007a). As the water table rises during an event, resulting in subsurface flow in the 83 \nacrotelm, stream DOC concentration increases due to the input of DOC rich soil water 84 \n(Evans et al. 1999; Worrall et al. 2002; Soulsby et al. 2003; Clark et al. 2007a, b). 85 \nHowever, further progress of the event may introduce low DOC, rain-like water 86 \n(Clark et al. 2007b), due to exhaustion of the acrotelm or the occurrence of saturated 87 \noverland flow or macropore flow (Evans et al. 1999; Worrall et al. 2002). Hence, 88 \nstream concentration can be described by mixing of water from three different source 89 \nareas, so-called end-members (Worrall et al. 2002). In other peat catchments, base 90 \nflow is chemically similar to the acidic DOC rich soil water in the acrotelm (Clark et 91 \nal. 2007b).  In these systems stream water during events derives from two end-92 \nmembers only: soil water and the rain-like water (Clark et al. 2007a). This causes a 93 \ndecrease in stream DOC concentration during events (Clark et al. 2007a; Eimers et al. 94 \n2008).  95 \nLiterature on the effects of storm events on DOM quality is sparse. If storm 96 \nevents cause changes of flow paths and not merely dilution, one would assume a 97 \nchange in the quality of the DOM released to the stream (Buffam et al. 2001). DO\n14\nC 98 \ndata from peat moorland in the upper Conwy catchment showed that base flow 99 \nreleases old, soil-derived DOC, whereas high flow releases younger DOC, probably 100 \n 5 \nderived from recent plant material (Evans et al. 2007). Probably, a difference in age 101 \nalso implies different degree of degradation, which in turn affects DOM quality 102 \n(Qualls and Haines 1992; Kalbitz et al. 2003; Saadi et al. 2006). Spectrophotometric 103 \nmeasurement of absorbance and fluorescence can give information on DOM quality in 104 \nterms of chemical characteristics of the organic material and its bioavailability (e.g. 105 \nSenesi 1990; Peuravuori and Pihlaja 1997; Croué et al. 1999; McKnight et al. 2001; 106 \nKalbitz et al. 2003; Fellman et al. 2008). To our knowledge fluorescence scanning of 107 \nhigh frequency event samples has not previously been conducted.  108 \nIn the present study high frequency measurement of chemical and 109 \nspectrophotometric characteristics of high frequency stream water samples was 110 \nconducted in a peatland catchment in Wales. The objectives of the study were: 1) To 111 \ninvestigate the effect of storm events on DOC concentration, 2) to investigate the 112 \neffects of storm events on DOM quality, and 3) to explore the usefulness of 113 \nfluorescence analyses to assess short term changes in DOM quality.  114 \n 115 \nMethods 116 \n 117 \nField site 118 \n 119 \nThe study site is a small (3.2 km\n2\n) peatland catchment in north Wales drained by the 120 \nstream Afon Ddu (Fig. 1). The catchment is a sub-catchment of the upper Conwy 121 \ncatchment, and it is part of the large Migneint blanket peatland area. Catchment 122 \naltitude ranges from 440 to 540 m.a.s.l., with the main part being below 500 m.a.s.l.. 123 \nAverage temperature is 8C and mean annual rainfall is 2300 mm. Hydrological 124 \nresponse to rainfall events is rapid (Billett et al. 2007). The bedrock is volcanic, mixed 125 \n 6 \nrhyolitic and basaltic, of Ordovician origin. Peat soils (histosols) dominate, but at 126 \nelevated sites podzols occur. The soil depth is usually around 1-2 m, but may be up to 127 \n5 m. The vegetation is dominated by heather (Calluna vulgaris L.) and Sphagnum 128 \nspp. mosses, with scattered grasses and sedges. There is some drainage ditching in the 129 \ncatchment dating from the 1930s-1960s.  130 \n 131 \nWater sampling 132 \n 133 \nIntensive high-flow event sampling in the Afon Ddu was conducted in the autumn of 134 \n2007 (sampling point at Ordnance Survey coordinates 277520,344920). Samples were 135 \ncollected during autumn because DOC concentrations were expected to be high (Clark 136 \net al. 2007b). Samples were collected during three events (September 17\nth\n-18\nth\n, 137 \nOctober 3\nrd\n-4\nth\n, October 26\nth\n-30\nth\n), hereafter referred to as events 1, 2 and 3. During 138 \nevents 1 and 2, samples were collected for 24 hours (event 1 two-hourly, event 2 139 \nhourly), while during the larger event 3 samples were collected two-hourly for 96 140 \nhours. Samples were collected using a Xian 1000 autosampler (Hach Lange, 141 \nGermany). 142 \nSamples were collected from a number of nearby locations during each event, 143 \nto provide information on potential end-members. These were sphagnum pore water 144 \nsamples collected by manual squeezing, and three different types of soil water 145 \nsamples collected from blanket peat: bulked soil water collected at 5 cm using micro-146 \nrhizon suction samplers and soil water collected at 5 and 10 cm using zero-tension 147 \nlysimeters.  148 \n 149 \n  150 \n 7 \nAnalyses 151 \n 152 \nAll samples were split in three for different analyses. The aliquot that was to be 153 \nanalysed for carbon and nitrogen was filtered immediately (within maximum 2 days) 154 \nthrough Whatman sterile 0.45µm cellulose nitrate filters. The filters were rinsed with 155 \ndeionised water and an aliquot of sample. All samples were stored at <3°C. 156 \nThe event sample aliquots that were to be analysed for fluorescence and 157 \nabsorbance were brought to CEH Wallingford as soon as possible (within 0-5 days). 158 \nPrior to analysis all samples were filtered through Whatman 1.2 µm glass microfibre 159 \nGFC filters, after rinsing with water and an aliquot of sample. All equipment used was 160 \nacid washed. The water used was purified with a NANOpure DIamond Analytical and 161 \nUV Systems from Barnstead. One cm quartz cells were used. Fluorescence analyses 162 \nwere performed on a Varian Cary Eclipse instrument. Several blanks were run, to 163 \nensure that the equipment used had no residual fluorescence. The samples were 164 \nscanned for emission from 280 to 500 nm at excitation 200 to 400 nm. Absorbance 165 \nwas measured on a Varian Cary 50 instrument, measuring the spectrum from 200 to 166 \n800 nm. Whenever the absorbance was above 0.3 cm\n-1\n, the samples were diluted to 167 \nbelow this level, and both analyses repeated, as inner-filtering correction (see below) 168 \nhas been found to be insufficient above this level (Ohno 2002). The sUVa index was 169 \ncalculated as absorbance measured at 254 nm divided by DOC (mg l\n-1\n) (Vogt et al. 170 \n2004) and the E2\/E3 index as absorbance measured at 250 nm divided by absorbance 171 \nmeasured at 365 nm (Peuravuori and Pihlaja 1997). 172 \nBoth absorbance and fluorescence may be affected by iron interference. 173 \nAbsorbance may be overestimated, as Fe ions absorb light  (Weishaar et al. 2003). 174 \nFluorescence may be underestimated, due to quenching of the fluorescence signal 175 \n 8 \ncaused by Fe-DOM complexation (Zepp et al. 2004; Ohno et al. 2008). To investigate 176 \npossible iron intereference, data from biweekly sampling (November 2006 to January 177 \n2008) at the same spot were used, as Fe concentration was not analysed in the event 178 \nsamples. Fe in the biweekly samples were analysed by ICP-OES. Preliminary 179 \nanalyses showed that the Fe concentration was positively linearly related to DOC 180 \nconcentration (R\n2\n = 0.59). This is in line with Neal et al. (2008), who observed strong 181 \ncorrelation between Fe and DOC concentration across a range of UK sites. However, 182 \nthere was also a negative linear relationship with log(flow) (Environment Agency 183 \ndischarge data for the River Conwy at Cwm Llanerch 184 \n(http:\/\/www.nwl.ac.uk\/ih\/nrfa\/station_summaries\/066\/011.html) (R\n2\n = 0.30). Hence, 185 \nFe concentration could be reasonably well explained (R\n2\n = 0.78) using multiple linear 186 \nregression with DOC concentration and log(flow) as explanatory variables. A linear 187 \nrelationship (R\n2\n = 0.82) was established between Cwm Llanerch flow and Afon Ddu 188 \nstage (data from August to November 2007). Fe concentration in the event samples 189 \nwas estimated using the multiple linear regression equation with event sample DOC 190 \nconcentration and Cwm Llanerch flow (calculated from Afon Ddu stage) as inputs. 191 \nThe contribution of Fe to absorbance at 254 nm was estimated using the equation for a 192 \npure Fe\n3+\n solution in Weishaar et al. (2003). Weishaar et al. showed that the 193 \nabsorbances of Fe and DOM are additive. A crude estimate of Fe quenching of 194 \nfluorescence was done based on data in Ohno et al. (2008). 195 \nThe remaining analyses on event samples were conducted at CEH Bangor. 196 \nUnfiltered samples were analysed for pH using a Metrohm SM 702 Titrino. Filtered 197 \nsamples were analysed for total dissolved nitrogen (TDN) and non purgeable organic 198 \ncarbon (NPOC) by elemental analysis using a Thermalox TOC\/TN Analyser. The 199 \npurging prior to total carbon analysis removes inorganic carbon as CO2 (by addition 200 \n 9 \nof 11 μl of 1M HCl and purging with oxygen for 90 sec), so that only dissolved 201 \norganic carbon (DOC) is determined. Nitrate-N (NO3-N) and ammonium-N (NH4-N) 202 \nwere analysed by autoanalyser (Skalar SA-40). NO3-N was analysed by the 203 \nsulphanilamide\/NEDA\/Cd\/Cu reduction method, with extinction at 540nm, and NH4-204 \nN by the Indol-phenol blue method, with extinction at 660nm. Dissolved organic 205 \nnitrogen (DON) was calculated by subtracting NO3-N and NH4-N from TDN. 206 \n 207 \nDischarge 208 \n 209 \nDischarge at the Afon Ddu lower site was measured by a Starflow Ultrasonic Doppler 210 \ninstrument with an integrated micrologger (Unidata, Western Australia). Due to 211 \ninstrument failure, the velocity measurements were not correct, so accurate discharges 212 \ncould not be calculated. However stage data were reliable, and provided an effective 213 \nproxy for the discharge changes associated with each event. 214 \nRain data used were from the Snowdon Environmental Change Network site, 215 \nabout 20 km north-west of the Afon Ddu catchment (Countryside Council for Wales 216 \n2008). 217 \n 218 \nData analysis 219 \n 220 \nThe event data are described quantitatively using different approaches. Base flow 221 \ncomposition was defined as the average stream water composition of samples taken 222 \nwhen there was minimal change in stream stage (the first 3, 5 and 11 samples in event 223 \n1, 2 and 3, respectively; average for pH calculated via H\n+\n). In event 1 the stable stage 224 \nlevel did not represent a true base flow level, as it closely followed an earlier event. 225 \n 10 \nTo account for changes in the different parameters during the events, the percentage 226 \nchange from the base flow to a maximum or minimum was calculated. Base flow and 227 \naverage soil water (the micro-rhizon and the two zero-tension lysimeter samples) was 228 \ncompared for each event using two sample t-test. Results for sphagnum pore water 229 \ncould not be compared statistically to base flow or soil water, as there was only one 230 \nsample per event. Correlation of parameters was done using Pearson’s r. Results were 231 \nconsidered significant for P < 0.05. Minitab Release 14 was used as statistical 232 \nsoftware. Regression analyses for the Fe-estimation were performed with JMP 7.0.1. 233 \nA simple two end-member mixing model was applied to each event and 234 \nparameter (H\n+\n and DOC concentration, absorbance at 254 nm and fluorescence 235 \nintensity), using the average base flow as one end-member and average soil water as 236 \nthe other end-member. This corresponds to the end-member model described by 237 \nWorrall et al. (2002) but omits the rain end-member (dilution). The model calculates 238 \nthe proportion of each of the two end-members contributing to stream water, starting 239 \nfrom the first non-base flow sample. It is a crude model, as there were probably other 240 \nend-members; base flow is not a true end-member; and none of the parameters are 241 \nconservative. The intention was simply to assess whether the proposed two end-242 \nmember system could consistently explain observed variations in different 243 \nparameters, i.e. that the contribution of the two end-members was consistent for 244 \ndifferent parameters throughout the event.  245 \nFluorescence data were analysed using parallel factor analysis (PARAFAC) in 246 \nMATLAB (version R2007b), according to the procedure described by Stedmon and 247 \nBro (2008). PARAFAC decomposes the complex set of sample emission-excitation 248 \nmatrices (EEMs) and extracts specific components (Stedmon et al. 2003), 249 \n 11 \nrepresenting groups of fluorophores with similar fluorescence characteristics 250 \n(Stedmon and Markager 2005). The model is defined as 251 \nF\nijk if jf kf ijk\nf 1\nx a b c ε\n\n   252 \ni = 1,...,I; j = 1,...,J; k = 1,...,K      (1) 253 \nwhere xijk is the fluorescence intensity of the ith sample at emission wavelength j and 254 \nexcitation wavelength k. aif is directly proportional to the concentration of the fth 255 \ncomponent in sample i. bjf is linearly related to the quantum efficiency (fraction of 256 \nabsorbed energy emitted as fluorescence) of the fth component at emission 257 \nwavelength j. ckf is linearly proportional to the specific absorption coefficient of the 258 \nfth component at excitation wavelength k. The residual matrix εijk represents the 259 \nvariability not accounted for by the model, and the model is found by minimising the 260 \nsum of squared residuals (Stedmon et al. 2003).  261 \nThe raw data were corrected for inner-filtering effects according to Parker and 262 \nBarnes (1957). Inner filtering reduces the fluorescence intensity due to the absorption 263 \nof the excitation beam and of emitted light after excitation (Lakowicz 1983, p. 44). 264 \nThe correction suggested by Lakowicz (1983, p. 44) and applied by e.g. McKnight et 265 \nal. (2001) and Ohno (2002) gave nearly identical results as the Parker and Barnes 266 \n(1957) correction, but the latter correction was selected because it takes account of the 267 \ndimensions of the excitation and emission beams. The matrices were then corrected 268 \nfor instrument bias, i.e. the effects of lamp output and instrument sensitivity\/response. 269 \nA blank, measured on a sealed cell of Milli-Q water, was subtracted to remove\/reduce 270 \nthe Raman line (Hudson et al. 2007). Finally a mask was applied to the data matrix, 271 \nsetting all data in the regions without fluorescence (excitation wavelength exceeds 272 \nemission wavelength) to zero, and replacing all data in the regions greatly influenced 273 \n 12 \nby the two Rayleigh-Tyndall lines (Hudson et al. 2007) with missing values (NaN in 274 \nMATLAB).  275 \nA series of PARAFAC models with three to seven components were fitted to 276 \nthe data. As some of the components gave negative excitation or emission loadings, 277 \nnon-negativity constraints were applied. The PARAFAC model could be split half 278 \nvalidated (i.e. separate modelling of two halves of the samples gave statistically 279 \nidentical results, cf. Stedmon, C. A. and Bro, R. 2008) for up to three components. 280 \nInitial exploration revealed that the sphagnum pore water samples from event 1 and 2 281 \nshowed a high residual fluorescence at low excitation and emission wavelength. Some 282 \nother samples, especially soil water samples, also exhibited some fluorescence in this 283 \nregion. However, overall this feature was present in too few samples for a model 284 \nincluding a component in this region to be validated. Thus, the two sphagnum pore 285 \nwater samples were considered as outliers, and removed prior to the final modelling. 286 \nThe final model was the three component model giving the smallest residual error out 287 \nof ten models fitted following random initialisation of the model. The maximum 288 \nfluorescence intensity of the different components (Fmax) for individual samples was 289 \ncorrected for dilution by multiplying by the dilution factor.  290 \n 291 \nResults 292 \n 293 \nHydrology 294 \n 295 \nThe rainfall during event 1, 2 and 3 was 16, 17 and 114 mm, respectively (Fig. 2). 296 \nEvent 1 was the second in a series of events following an 11 day dry period. There 297 \nwas a 26 mm event just prior to event 1, and the stage was 198 mm at the onset of the 298 \n 13 \nevent. During the event, stage rose to 334 mm. Event 2 was preceded by 7 dry days, 299 \nwith a series of large events before that (total precipitation 347 mm). The stream stage 300 \nwas 138 mm at the onset of the event and maximum stage during the event was 211 301 \nmm. Event 3 was preceded by a 10 day dry period. The stream stage was at 131 mm 302 \nat the onset. During the event, stage rose to 1045 mm. Event 3 was clearly the largest 303 \nof the three events, and one of the largest of the whole autumn.  304 \n 305 \npH and DOC 306 \n 307 \nThe pH decreased during all events (Fig. 3). The largest decrease (2.3 pH units from 308 \nbase flow levels) occurred in event 3, compared to 0.9 and 1.1 pH units in events 1 309 \nand 2, respectively. Base flow pH was significantly higher than that of soil water in all 310 \nevents. pH of sphagnum pore water was at a similar level as that of soil water. 311 \nDOC concentrations increased during all events (Fig. 3), by 16%, 44% and 312 \n89% relative to base flow in events 1, 2 and 3, respectively. The DOC concentration 313 \nwas significantly and negatively correlated with pH (r\n2\n 0.59, 0.81 and 0.86 for event 314 \n1, 2 and 3, respectively). Soil water DOC concentrations were higher than those of 315 \nbase flow, but the difference was only significant for event 2 and 3. DOC 316 \nconcentration in sphagnum pore water was higher than in soil water in event 1 and 2, 317 \nand at the same level as in soil water in event 3. 318 \n 319 \nDOC\/DON ratio 320 \n 321 \nThe DOC\/DON ratio data (Fig. 4) were noisy, but there was an upward trend in all 322 \nevents. Maximum values were 58, 57 and 103% higher than base flow values in event 323 \n 14 \n1, 2 and 3, respectively. There was no significant difference between soil water and 324 \nbase flow DOC\/DON ratios in any of the events. The DOC\/DON ratios of the 325 \nsphagnum samples were far lower than those of both base flow and soil water 326 \nsamples. 327 \n  328 \nAbsorbance  329 \n 330 \nAbsorbance at 254 nm increased during events 2 and 3 (Fig. 5), with 30 and 53% 331 \nmaximum increases from base flow, respectively. In these events, absorbance was 332 \nsignificantly and positively correlated with DOC concentration (r\n2\n 0.88 and 0.92, 333 \nrespectively). In event 3 there was a striking diurnal pattern in absorbance after the 334 \ninitial peak, with consistent maxima at 7 am and minima at 1 pm. Soil water 335 \nabsorbance was significantly higher than that of base flow in events 2 and 3. 336 \nAbsorbance of sphagnum pore water was generally lower than that of both base flow 337 \nand soil water. 338 \nThe sUVa index (Fig. 5) decreased from base flow levels during event 1 (16% 339 \nchange), and more clearly during event 3 (28% change). There was no apparent 340 \npattern in event 2. The four deviating samples in event 2 with relatively low sUVa 341 \nvalues correspond to the four samples with relatively low DOC, and appears to be 342 \ncaused by a DOC measurement error, as this deviation was not observed for 343 \nabsorbance. The reason for this error could not be established. Base flow sUVa was 344 \nsignificantly higher than that of soil water in all events. sUVa in sphagnum pore water 345 \nwas far lower than sUVa in both base flow and soil water. 346 \nThere was a rising trend in E2\/E3 (Fig. 5) for all events, with a change from 347 \nbase flow to maximum levels of 5, 3 and 27% for events 1, 2 and 3, respectively. Soil 348 \n 15 \nwater E2\/E3 was significantly higher than that of base flow in all events. E2\/E3 in 349 \nsphagnum pore water was at a similar level as in soil water. 350 \nThe average estimated Fe concentration was 2.2, 1.6 and 1.5 mg l\n-1\n for events 351 \n1, 2 and 3, respectively, i.e. above the level (0.5 mg l\n-1\n) where iron interference should 352 \nbe considered (Weishaar et al. 2003). The estimated Fe concentration followed closely 353 \nthe DOC concentration, and was only slightly modified by flow. Fig. 5 shows the 354 \neffect of correcting for Fe absorbance on absorbance and sUVa. The effect is 355 \npronounced, and the resulting sUVa values are more realistic (cf. Weishaar et al. 356 \n2003, table 1). However, the temporal patterns are preserved to a high degree. As the 357 \nfollowing discussion is mainly focused on the relative changes and temporal patterns, 358 \nthe issue of iron interference will not be further discussed, but it should be kept in 359 \nmind that the absorbance and sUVa values are overestimated. E2\/E3 is probably not 360 \nstrongly affected by iron interference. Weishaar et al. (2003) observed similar iron 361 \ninterference at 280 nm as 254 nm, so the interference at 365 nm is not believed to be 362 \nvery different. Moreover, the E2\/E3 values obtained are realistic (cf. Peuravuori and 363 \nPihlaja 1997, table 2). 364 \n 365 \nFluorescence 366 \n 367 \nComponent 3 from the PARAFAC analysis was considered to represent 368 \ncontamination, as it only appeared in the samples where a certain plastic tube was 369 \nused for dilution. Blank samples using the same plastic tube exhibited the same 370 \nfeature. This component is consequently not discussed in the following. However, this 371 \ncomponent overlapped with the region that was poorly modelled for the sphagnum 372 \n 16 \nsamples, and the presence of this contamination component may have added to the 373 \ndifficulty of validating a model with a true component in this region. 374 \nThe two remaining components are shown in Fig. 6. Both components were 375 \ndouble-peaked. Component 1 (C1) had maximum excitation at <250 nm with a 376 \nsecondary peak at 310 nm, and maximum emission at 440 nm. Component 2 (C2) had 377 \na maximum at excitation 260 nm with a secondary peak at 360 nm, and maximum 378 \nemission at 474 nm. The temporal variation in the fluorescence intensity (Fig. 7) did 379 \nnot seem to coincide with the changes in stream stage. Throughout the sampling 380 \nperiods the intensity levels were either stable or decreasing. C1 had the clearest 381 \ndecreasing trend. This resulted in a decrease in the C1\/C2 ratio in all events, with a 382 \nlevelling off (event 1 and 2) or increase (event 3) towards the end of the events (Fig. 383 \n7). The decrease from base flow levels to minimum levels was 7, 18, and 17% in 384 \nevents 1, 2 and 3, respectively. C1 was higher in base flow than soil water, but this 385 \nwas only significant for event 2. C2 was higher in soil water, and this was significant 386 \nfor event 2 and 3. Both C1 and C2 were lower in sphagnum pore water than in base 387 \nflow and soil water. For C1\/C2, base flow was significantly higher than soil water in 388 \nall events. C1\/C2 of sphagnum pore water was at the same level as for base flow.  389 \n  In event 3, there was a clear diurnal pattern in C1 and C2, especially observed 390 \nafter the stage peak. The fluorescence peaked at 1 pm and was lowest during the night 391 \n(9 pm to 7 am). The pattern coincided with the in situ temperature variation, while it 392 \nwas inversely related to the pattern observed for absorbance (Fig. 8). 393 \n Ohno et al. (2008) investigated Fe quenching of PARAFAC-derived 394 \ncomponents. Their results could be used as basis for a crude estimate of fluorescence 395 \nquenching, as their components 1 and 2 corresponded well with C1 and C2, 396 \nrespectively. The effect on overall levels was pronounced, but the temporal patterns 397 \n 17 \nwere preserved to a high degree. Ohno et al. (2008) showed that component 1 was 398 \nmore strongly quenched than component 2. However, the estimated effect of 399 \nquenching on C1\/C2 was minor. Hence, Fe quenching seems unimportant to the 400 \ntemporal patterns in fluorescence, and will not be further discussed.   401 \n  402 \nMixing model 403 \n 404 \nMixing models for event 1 and 2 did not show any consistent patterns between 405 \nparameters (data not shown). For event 3 (Fig. 9), there was a consistent, although not 406 \nidentical, pattern in H\n+\n concentration, DOC concentration and absorbance at 254 nm. 407 \nThe curves showed a decrease in the proportion of base flow-type water at the start of 408 \nthe event and a subsequent increase coinciding with the decrease in stream stage. The 409 \nmodels based on H\n+\n and absorbance indicated lower and higher contribution of soil 410 \nwater at peak flow compared to the model based on DOC concentration, respectively. 411 \nMixing models for event 3 based on C1 and C2 were not consistent with those of the 412 \nother three parameters (Fig. 9). 413 \n  414 \nDiscussion 415 \n 416 \nEffects of events on DOC concentration 417 \n 418 \nThe higher pH and lower DOC concentration in base flow compared to soil water 419 \nindicates that the peat system in Afon Ddu is not like the system described by Clark et 420 \nal. (2007a, b), where base flow was chemically similar to soil water. Like DOC 421 \nconcentration, absorbance at 254 nm was also lower in base flow than in soil water. 422 \n 18 \nAbsorbance is generally known to be closely correlated with DOC concentration (e.g. 423 \nDobbs et al. 1972; Brandstetter et al. 1996; Korshin et al. 1997). Relatively high 424 \nbaseflow DOC concentration indicates a significant input of drainage from the peat, 425 \nwhilst the high baseflow pH demonstrates some hydrological connectivity with 426 \nunderlying base-rich bedrock and\/or mineral soil patches within the catchment.  427 \nThe increased DOC concentration, increased absorbance and decreased pH at 428 \nhigh flow can be explained by an increased contribution of soil water, due to a rising 429 \nwater table within the acrotelm and subsurface flow (Evans et al. 1999; Worrall et al. 430 \n2002). A higher similarity between soil water and stream water at high flow with 431 \nrespect to DOC concentrations was also observed by Billett et al. (2006). The change 432 \nin stream chemistry could not solely be caused by an increased input of water from 433 \nthe sphagnum layer, as this could not have explained the trend in absorbance. There 434 \nwas little evidence of dilution at peak flow. The process could thus be reasonably well 435 \ndescribed for event 3 by the applied two end-member mixing model, rather than a 436 \nthree end-member model as suggested in Worrall et al. (2002). The discrepancies 437 \nobserved between the DOC concentration, H\n+\n concentration and absorbance at 254 438 \nnm were most likely due to the lack of conservative mixing. The most reliable model 439 \nis probably the one for DOC, as H\n+\n concentration is unlikely to be conservative, and 440 \nabsorbance behaves abnormally at peak flow. The inconsistency between parameters 441 \nin the models for event 1 and 2 can probably be explained by the limited size of the 442 \nevents and small changes in stream chemistry, giving too much noise in such a crude 443 \nmodel.   444 \n 445 \nEffects of events on DOM quality 446 \n 447 \n 19 \nThe sUVa index provides a measure of the change in DOM quality expressed by 448 \ndeviation from the correlation between DOC concentration and absorbance. sUVa has 449 \nbeen shown to be positively correlated with aromaticity and molecular weight (Croué 450 \net al. 1999; Weishaar et al. 2003; Hood et al. 2005). Both sUVa and aromaticity 451 \nincrease upon biodegradation (Kalbitz et al. 2003; Saadi et al. 2006). A high sUVa is 452 \nalso associated with lower bioavailability (Fellman et al. 2008). Thus, the decrease in 453 \nsUVa at high flow indicates that the DOM released at high flow is less degraded and 454 \naromatic and of lower molecular weight. This is supported by the increase in E2\/E3, 455 \nas E2\/E3 is negatively correlated to aromaticity and molecular weight (Peuravuori and 456 \nPihlaja 1997). E2\/E3 is a more robust parameter than sUVa, giving a smoother trend. 457 \nDOC\/DON data from this study are noisy, but clearly show increases in all 458 \nthree events. Increasing DOC\/DON may be indicative of increasing aromaticity 459 \n(McKnight et al. 1997; Hood et al. 2005), because algal and microbial material has 460 \nlow DOC\/DON (McKnight et al. 1994) and low aromaticity (McKnight et al. 2001). 461 \nHowever, even the lowest DOC\/DON values observed are much higher than those 462 \nassociated with algal or microbial material (McKnight et al. 1994). Moreover, the 463 \nhighest DOC\/DON values observed correspond to the lower range of values observed 464 \nfor different litter leachates (Magill and Aber 2000). Hence, in this case it is more 465 \nlikely that increasing DOC\/DON indicates decreasing degree of degradation (Melillo 466 \net al. 1982; Qualls and Haines 1992; Currie et al. 1996; Yano et al. 2004). Thus both 467 \nabsorbance and DOC\/DON indicate that base flow is characterised by older and 468 \nprobably more degraded DOM, while soil water comprises younger, less degraded 469 \nDOM (Evans et al. 2007). 470 \nWith increased absorbance at high flow, one might expect to see a similar 471 \nresponse in fluorescence. However, unlike absorbance, fluorescence does not 472 \n 20 \ninvariably correlate well with DOC, and fluorescence relative to absorbance may vary 473 \nbetween different sources (Baker et al. 2008). In addition, fluorescing structures 474 \nconstitute only a minor part of humic molecules (Miano et al. 1988; Senesi et al. 475 \n1991). Thus, it is possible for fluorescence to decrease even if absorbance, as a bulk 476 \nparameter, increases.  477 \nThe mixing model for event 3 indicates that stream fluorescence during the 478 \nevent was not a result of mixing of soil water and base flow water, as it was for 479 \nabsorbance. For C1, soil water fluorescence was not sufficiently low to explain the 480 \ndecrease, and C2 remained approximately at base flow levels throughout the event 481 \ndespite the higher fluorescence intensity in soil water. The effect could not be 482 \nexplained by increased contribution of low fluorescence sphagnum pore water, as this 483 \ndoes not fit with the observed changes in absorbance, DOC\/DON and C1\/C2 during 484 \nthe events. Rather, the lack of consistency between fluorescence parameters and the 485 \nother parameters in the mixing models, the diurnal variation in fluorescence, and the 486 \nco-variation in fluorescence and in situ stream temperature observed in event 3, 487 \ncollectively suggest that stream fluorescence may be governed by in-stream microbial 488 \nprocesses.  489 \nIn-stream processing of DOM has been found to be an important control on 490 \nstream DOC in a similar catchment (Dawson et al. 2001). The microbial processing 491 \nprobably occurs in biofilms, as it is generally believed that this is where most 492 \nmicroorganisms in natural systems exist (Sutherland 2001). Biofilms on the stream 493 \nbed, rather than suspended aggregates in the water column tend to dominate 494 \necosystems with high downstream transport and sediment-surface-area to water-495 \nvolume ratio, as in headwaters (Battin et al. 2008). Lock and Hynes (1976) showed 496 \nthat the stream bottom, not the water itself is responsible for the major part of DOC 497 \n 21 \nremoval, and biofilms on the stream bed have been shown to remove a substantial 498 \namount of DOC (Fiebig et al. 1990; Fiebig and Lock 1991). In the Afon Ddu there 499 \nwere no indications of in-stream processing of bulk DOC. This either confirms that 500 \nonly a minor part of the DOM released is subject to such processing, or that the 501 \nspectrophotometric methods, introducing less uncertainty than the DOC analysis, are 502 \nbetter for detecting short-term variation in DOM. The in-stream processing will be 503 \nfurther covered in the next section. 504 \n  Microbial processing of DOM is limited by microbial capacities, i.e. reaction 505 \nrates (Battin et al. 2008). Hence, one can expect increased flow to give dilution of 506 \nstream fluorescence. The trends in C1 and C2 can thus be explained by dilution as the 507 \nmain control, and only some compensation by fluorescing material from the soil. This 508 \nindicates that highly fluorescing DOM in soil water is not as mobile as less 509 \nfluorescing DOM. The compensation by soil water was highest for C2, where the 510 \nlevels were higher in soil water than in base flow. The C1\/C2 ratio would not be 511 \naffected by dilution, so the downwards trend was due to the small contribution of 512 \nfluorescing material from the soil.  513 \nA decreased C1\/C2 represents a shift in peak position to higher wavelengths, 514 \nand this has been associated with higher density of aromatic rings, higher degree of 515 \naromatic substitution and conjugation, higher molecular weight, and higher 516 \nhydrophobicity (Senesi 1990; Coble et al. 1998; Sharma and Schulman 1999, p. 20-517 \n21; Wu et al. 2003).  A peak shift to higher wavelengths may also signify an increase 518 \nin the importance of humic compared to fulvic acids (Senesi 1990). The C1\/C2 ratio 519 \nthus suggests that the aromaticity and molecular weight of DOM was higher in soil 520 \nwater compared to base flow, which is opposite to the conclusion based sUVa,  E2\/E3 521 \nand DOC\/DON. However, this fits in well with the idea that the fluorescing material 522 \n 22 \nis mainly produced in-stream, which would make base flow fluorescing material 523 \nrelatively younger than that deriving from soil water, as opposed to what is the case 524 \nfor the bulk material. The overall conclusion is still that DOM released at high flow is 525 \ngenerally less degraded, as the fluorescing part constitutes only a minor part of the 526 \nDOM. 527 \n 528 \nEffects of events on in-stream processing of DOM 529 \n 530 \nAs discussed above, the diurnal pattern in fluorescence observed in event 3 appears to 531 \nreflect diurnal variation in in-stream production of fluorescing DOM. Both 532 \ntemperature and light are environmental factors that vary on a daily timescale. 533 \nTemperature has a positive effect on fluorescence, as the activity of the DOM-534 \nproducing microorganisms is stimulated by increasing temperature (Christ and David 535 \n1996; Gödde et al. 1996; Freeman et al. 2001). UV light is known to cause a decrease 536 \nin fluorescence, through so-called photo-bleaching (e.g. Skoog et al. 1996; Moran et 537 \nal. 2000; Patel-Sorrentino et al. 2004), and can be expected to co-vary with stream 538 \ntemperature, peaking at mid-day. 539 \n  To our knowledge a diurnal pattern in fluorescence has only been observed by 540 \nSpencer et al. (2007). They measured in situ fluorescence during base flow by means 541 \nof a fluorometer measuring at 370 nm excitation and over a broad emission band 542 \ncentred at 460 nm. However, whereas fluorescence in event 3 peaked at mid-day and 543 \nwas positively related to temperature, the diurnal pattern reported by Spencer et al. 544 \npeaked in the early morning (around 9 am), had a minimum in late afternoon (around 545 \n6 pm), and was negatively related to temperature. According to Spencer et al., the 546 \ndiurnal pattern was related to day-time photo-bleaching of the DOM. This is 547 \n 23 \nconfirmed by base flow data from similar in situ measurements (excitation 330 nm, 548 \nemission 450 nm) from Afon Ddu (data not shown) and another stream (Nant y 549 \nBrwyn), 2 km away on the same area of blanket peat (Fig. 10), which showed a 550 \nsimilar diurnal pattern.  551 \nWe hypothesise that during an event the diurnal fluorescence pattern is shifted, 552 \ndue to the extra input of soil water DOM represented by absorbing material. Nieto-553 \nCid et al. (2006) showed that fluorescent humic substances could be produced by 554 \nmicrobial degradation of DOM on a short (<1 day) timescale, and that the magnitude 555 \nof production was related to microbial activity. If even a small proportion of the DOM 556 \ntransported from the soil can be used by biofilm microbial communities, this could 557 \nexplain the rapid, diurnal production of fluorescent DOM. Degradation would be 558 \nexpected to peak at mid-day due to the higher temperatures, which could explain the 559 \nshift in the diurnal cycle, and also the negative relationship between fluorescence and 560 \nabsorbance in event 3. This positive effect of temperature apparently surpasses any 561 \nnegative effect of UV light at mid-day, perhaps because the cloud cover in the period 562 \nduring and after the storm event was high, and UV intensity consequently low. 563 \nAlternatively, or additionally, given the high input of DOM, photo-bleaching could 564 \nhave had a positive impact on production of fluorescing DOM, as UV radiation is 565 \nfound to increase the substrate quality, and thus the degradability, of terrestrially 566 \nderived DOM (Moran et al. 2000; Tranvik and Bertilsson 2001; Anesio et al. 2005).  567 \nThe hypothesis appears to be supported by event data from the Nant y Brwyn 568 \n(Fig. 10).  At base flow the in situ fluorescence minimum was at about 4-7 pm and 569 \npeaked in the early morning (6-8 am). In the first day of the event shown (June 18\nth\n), 570 \nthe pattern was shifted, and after the peak in discharge (June 19\nth\n) the in situ 571 \nfluorescence remained high all day until a minimum at 8 pm. In the following few 572 \n 24 \ndays in situ fluorescence continued to stay high throughout a longer part of the day, 573 \nwith a delayed minimum compared to base flow, until June 24\nth\n, when the maximum 574 \nwas again at 8 am and the minimum at 4 pm.  There was more noise in these data than 575 \nthe event data for the Afon Ddu, as the PARAFAC model involves smoothing. To 576 \ncompare, the intensities at the wavelength measured at Nant y Brwyn were extracted 577 \nfrom the event 3 EEMs (data not shown), and although they exhibited more noise, the 578 \ndiurnal pattern could still be distinguished. If the hypothesis is correct, then at least 579 \npart of the absorbing, humic DOM released during events must be rapidly processed 580 \nclose to where it was released. However, more data and a more quantitative approach 581 \nare needed to confirm this. The hypothesis implies that the production of fluorescing 582 \nDOM not only peaks at a different time of the day during and after an event, but that 583 \nthere is a general increase in fluorescence intensity. Dilution may explain why this 584 \nwas not observed.  585 \n 586 \nConclusions 587 \n 588 \nIn peatlands where base flow is mainly high pH\/low DOC ground water, events result 589 \nin increased DOC concentration due to flushing of the shallow acrotelm. The increase 590 \nin DOC is accompanied by decreased pH. The DOM released during events appears 591 \nto be less degraded, less aromatic and more bioavailable. An increased input of this 592 \nmaterial is believed to have caused stimulation of in-stream microbial communities, 593 \nproducing fluorescing metabolites. 594 \n 595 \nAbsorbance proved to be a good indicator of changes in DOM quality and an 596 \nidentification of the shift of flow paths and sources throughout an event. Fluorescence 597 \n 25 \nwas less useful in that respect, due to the apparent dominance of in-stream production. 598 \nHowever, absorbance and fluorescence data combined gave indications of short term 599 \nchanges in in-stream processing of DOM during events which have not previously 600 \nbeen observed.  601 \n 602 \nAcknowledgements 603 \n 604 \nThis work was partly funded by the EU Eurolimpacs project (the Commission of 605 \nEuropean Communities GOCE-CT-2003-505540). We thank David Williams, Simon 606 \nGrant, Annette Burden and Timothy Jones for assistance in the field; Annie Brittain 607 \nand Steve Hughes for help with the chemical analyses; David Norris for drawing the 608 \ncatchment map; Colin Stedmon for assistance in the PARAFAC analysis; and 609 \nprofessor Jan Mulder for valuable comments on the manuscript. 610 \n 611 \nReferences 612 \n 613 \nAitkenhead JA, McDowell WH (2000) Soil C:N ratio as a predictor of annual riverine 614 \nDOC flux at local and global scales. Glob Biogeochem Cycles 14(1):127-138 615 \nAitkenhead JA, Hope D, Billett MF (1999) The relationship between dissolved 616 \norganic carbon in stream water and soil organic carbon pools at different 617 \nspatial scales. Hydrol Process 13(8):1289-1302 618 \nAnesio AM, Graneli W, Aiken GR, Kieber DJ, Mopper K (2005) Effect of humic 619 \nsubstance photodegradation on bacterial growth and respiration in lake water. 620 \nAppl Environ Microbiol 71(10):6267-6275 621 \n 26 \nBaker A, Bolton L, Newson M, Spencer RGM (2008) Spectrophotometric properties 622 \nof surface water dissolved organic matter in an afforested upland peat 623 \ncatchment. Hydrol Process 22(13):2325-2336 624 \nBattin TJ, Kaplan LA, Findlay S, Hopkinson CS, Marti E, Packman AI, Newbold JD, 625 \nSabater F (2008) Biophysical controls on organic carbon fluxes in fluvial 626 \nnetworks. Nature Geosci 1(2):95-100 627 \nBillett MF, Deacon CM, Palmer SM, Dawson JJC, Hope D (2006) Connecting 628 \norganic carbon in stream water and soils in a peatland catchment. J Geophys 629 \nRes 111(G2):G02010. DOI 10.1029\/2005JG000065 630 \nBillett MF, Garnett MH, Harvey F (2007) UK peatland streams release old carbon 631 \ndioxide to the atmosphere and young dissolved organic carbon to rivers. 632 \nGeophys Res Lett 34(23):L23401. DOI 10.1029\/2007GL031797 633 \nBoyer EW, Hornberger GM, Bencala KE, McKnight DM (1997) Response 634 \ncharacteristics of DOC flushing in an alpine catchment. Hydrol Process 635 \n11(12):1635-1647 636 \nBrandstetter A, Sletten RS, Mentler A, Wenzel WW (1996) Estimating dissolved 637 \norganic carbon in natural waters by UV absorbance (254 nm). J Plant Nutr 638 \nSoil Sci 159(6):605-607 639 \nBuffam I, Galloway JN, Blum LK, McGlathery KJ (2001) A stormflow\/baseflow 640 \ncomparison of dissolved organic matter concentrations and bioavailability in 641 \nan Appalachian stream. Biogeochem 53(3):269-306 642 \nChrist MJ, David MB (1996) Temperature and moisture effects on the production of 643 \ndissolved organic carbon in a Spodosol. Soil Biol Biochem 28(9):1191-1199 644 \nChristensen JH, Hewitson B, Busuioc A, Chen A, Gao X, Held I, Jones R, Kolli RK, 645 \nKwon W-T, Laprise R, Magaña Rueda V, Mearns L, Menéndez CG, Räisänen 646 \n 27 \nJ, Rinke A, Sarr A, Whetton P (2007) Regional climate projections. In: 647 \nSolomon S, Qin D, Manning M, Chen Z, Marquis M, Averyt KB, Tignor M, 648 \nMiller HL (eds) Climate change 2007: The physical science basis. 649 \nContribution of working group I to the fourth assessment report of the 650 \nintergovernmental panel on climate change. Cambridge University Press, 651 \nCambridge, United Kingdom and New York, NY, USA 652 \nClark JM, Lane SN, Chapman PJ, Adamson JK (2007a) Export of dissolved organic 653 \ncarbon from an upland peatland during storm events: Implications for flux 654 \nestimates. J Hydrol 347(3-4):438-447 655 \nClark JM, Lane SN, Chapman PJ, Adamson JK (2007b) Link between DOC in near 656 \nsurface peat and stream water in an upland catchment. Sci Total Environ (in 657 \npress). DOI 10.1016\/j.scitotenv.2007.11.002 658 \nCoble PG, Del Castillo CE, Avril B (1998) Distribution and optical properties of 659 \nCDOM in the Arabian Sea during the 1995 Southwest Monsoon. Deep-Sea 660 \nRes Part II 45(10-11):2195-2223 661 \nCountryside Council for Wales (2008) Yr Wyddfa – Snowdon ECN Site. 662 \nhttps:\/\/weather.ccw.gov.uk\/. Cited 25 Jan 2008 663 \nCroué J-P, Violleau D, Bodaire C, Legube B (1999) Removal of hydrophobic and 664 \nhydrophilic constituents by anion exchange resin. Water Sci Technol 665 \n40(9):207-214 666 \nCurrie WS, Aber JD, McDowell WH, Boone RD, Magill AH (1996) Vertical 667 \ntransport of dissolved organic C and N under long-term N amendments in pine 668 \nand hardwood forests. Biogeochem 35(3):471-505 669 \n 28 \nDawson JJC, Bakewell C, Billett MF (2001) Is in-stream processing an important 670 \ncontrol on spatial changes in carbon fluxes in headwater catchments? Sci Total 671 \nEnviron 265(1-3):153-167 672 \nDobbs RA, Dean RB, Wise RH (1972) Use of ultraviolet absorbance for monitoring 673 \ntotal organic carbon content of water and wastewater. Water Res 6(10):1173-674 \n1180 675 \nEimers MC, Buttle J, Watmough SA (2008) Influence of seasonal changes in runoff 676 \nand extreme events on dissolved organic carbon trends in wetland- and 677 \nupland-draining streams. Can J Fish Aquat Sci 65(5):796-808 678 \nEvans CD, Freeman C, Cork LG, Thomas DN, Reynolds B, Billett MF, Garnett MH, 679 \nNorris D (2007) Evidence against recent climate-induced destabilisation of 680 \nsoil carbon from \n14\nC analysis of riverine dissolved organic matter. Geophys 681 \nRes Lett 34(7):L07407. DOI 10.1029\/2007GL029431 682 \nEvans MG, Burt TP, Holden J, Adamson JK (1999) Runoff generation and water table 683 \nfluctuations in blanket peat: evidence from UK data spanning the dry summer 684 \nof 1995. J Hydrol 221(3-4):141-160 685 \nFellman JB, D'Amore DV, Hood E, Boone RD (2008) Fluorescence characteristics 686 \nand biodegradability of dissolved organic matter in forest and wetland soils 687 \nfrom coastal temperate watersheds in southeast Alaska. Biogeochem 688 \n88(2):169-184 689 \nFiebig DM, Lock MA (1991) Immobilization of dissolved organic matter from 690 \ngroundwater discharging through the stream bed. Freshw Biol 26(1):45-55 691 \nFiebig DM, Lock MA, Neal C (1990) Soil water in the riparian zone as a source of 692 \ncarbon for a headwater stream. J Hydrol 116(1-4):217-237 693 \n 29 \nFreeman C, Evans CD, Monteith DT, Reynolds B, Fenner N (2001) Export of organic 694 \ncarbon from peat soils. Nature 412(6849):785-785 695 \nGödde M, David MB, Christ MJ, Kaupenjohann M, Vance GF (1996) Carbon 696 \nmobilization from the forest floor under red spruce in the northeastern U.S.A. 697 \nSoil Biol Biochem 28(9):1181-1189 698 \nHinton MJ, Schiff SL, English MC (1997) The significance of storms for the 699 \nconcentration and export of dissolved organic carbon from two Precambrian 700 \nShield catchments. Biogeochem 36(1):67-88 701 \nHinton MJ, Schiff SL, English MC (1998) Sources and flowpaths of dissolved organic 702 \ncarbon during storms in two forested watersheds of the Precambrian Shield. 703 \nBiogeochem 41(2):175-197 704 \nHood E, Williams MW, McKnight DM (2005) Sources of dissolved organic matter 705 \n(DOM) in a Rocky Mountain stream using chemical fractionation and stable 706 \nisotopes. Biogeochem 74(2):231-255 707 \nHope D, Billett MF, Cresser MS (1994) A review of the export of carbon in river 708 \nwater - fluxes and processes. Environ Pollut 84(3):301-324 709 \nHudson N, Baker A, Reynolds D (2007) Fluorescence analysis of dissolved organic 710 \nmatter in natural, waste and polluted waters - A review. River Res Appl 711 \n23(6):631-649 712 \nInamdar SP, O'Leary N, Mitchell MJ, Riley JT (2006) The impact of storm events on 713 \nsolute exports from a glaciated forested watershed in western New York, 714 \nUSA. Hydrol Process 20(16):3423-3439 715 \nKalbitz K, Schwesig D, Schmerwitz J, Kaiser K, Haumaier L, Glaser B, Ellerbrock R, 716 \nLeinweber P (2003) Changes in properties of soil-derived dissolved organic 717 \nmatter induced by biodegradation. Soil Biol Biochem 35(8):1129-1142 718 \n 30 \nKorshin GV, Li CW, Benjamin MM (1997) Monitoring the properties of natural 719 \norganic matter through UV spectroscopy: A consistent theory. Water Res 720 \n31(7):1787-1795 721 \nLakowicz JR (1983) Principles of fluorescence spectroscopy. Plenum Press, New 722 \nYork 723 \nLock MA, Hynes HBN (1976) The fate of \"dissolved\" organic carbon derived from 724 \nautumn-shed maple leaves (Acer saccharum) in a temperate hard-water 725 \nstream. Limnol Oceanogr 21(3):436-443 726 \nMagill AH, Aber JD (2000) Dissolved organic carbon and nitrogen relationships in 727 \nforest litter as affected by nitrogen deposition. Soil Biol Biochem 32(5):603-728 \n613 729 \nMcDowell WH, Likens GE (1988) Origin, composition, and flux of dissolved organic 730 \ncarbon in the Hubbard Brook valley. Ecol Monogr 58(3):177-195 731 \nMcKnight DM, Andrews ED, Spaulding SA, Aiken GR (1994) Aquatic fulvic acids in 732 \nalgal-rich antarctic ponds. Limnol Oceanogr 39(8):1972-1979 733 \nMcKnight DM, Harnish R, Wershaw RL, Baron JS, Schiff S (1997) Chemical 734 \ncharacteristics of particulate, colloidal, and dissolved organic material in Loch 735 \nVale Watershed, Rocky Mountain National Park. Biogeochem 36(1):99-124 736 \nMcKnight DM, Boyer EW, Westerhoff PK, Doran PT, Kulbe T, Andersen DT (2001) 737 \nSpectrofluorometric characterization of dissolved organic matter for indication 738 \nof precursor organic material and aromaticity. Limnol Oceanogr 46(1):38-48 739 \nMelillo JM, Aber JD, Muratore JF (1982) Nitrogen and lignin control of hardwood 740 \nleaf litter decomposition dynamics. Ecol 63(3):621-626 741 \nMiano TM, Sposito G, Martin JP (1988) Fluorescence spectroscopy of humic 742 \nsubstances. Soil Sci Soc Am J 52(4):1016-1019 743 \n 31 \nMoran MA, Sheldon WM, Zepp RG (2000) Carbon loss and optical property changes 744 \nduring long-term photochemical and biological degradation of estuarine 745 \ndissolved organic matter. Limnol Oceanogr 45(6):1254-1264 746 \nNeal C, Lofts S, Evans CD, Reynolds B, Tipping E, Neal M (2008) Increasing iron 747 \nconcentrations in UK upland waters. Aquat Geochem 14 (3): 263-288 748 \nNieto-Cid M, Álvarez-Salgado XA, Pérez FF (2006) Microbial and photochemical 749 \nreactivity of fluorescent dissolved organic matter in a coastal upwelling 750 \nsystem. Limnol Oceanogr 51(3):1391-1400 751 \nOhno T (2002) Fluorescence inner-filtering correction for determining the 752 \nhumification index of dissolved organic matter. Environ Sci Technol 753 \n36(4):742-746 754 \nOhno T, Amirbahman A, Bro R (2008) Parallel factor analysis of excitation-emission 755 \nmatrix fluorescence spectra of water soluble soil organic matter as basis for 756 \nthe determination of conditional metal binding parameters. Environ Sci 757 \nTechnol 42 (1): 186-192 758 \nParker CA, Barnes WJ (1957) Some experiments with spectrofluorimeters and filter 759 \nfluorimeters. Analyst 82(978):606-618 760 \nPatel-Sorrentino N, Mounier S, Lucas Y, Benaim JY (2004) Effects of UV-visible 761 \nirradiation on natural organic matter from the Amazon basin. Sci Total 762 \nEnviron 321(1-3):231-239 763 \nPeuravuori J, Pihlaja K (1997) Molecular size distribution and spectroscopic 764 \nproperties of aquatic humic substances. Anal Chim Acta 337(2):133-149 765 \nQualls RG, Haines BL (1992) Biodegradability of dissolved organic matter in forest 766 \nthroughfall, soil solution, and stream water. Soil Sci Soc Am J 56(2):578-586 767 \n 32 \nSaadi I, Borisover M, Armon R, Laor Y (2006) Monitoring of effluent DOM 768 \nbiodegradation using fluorescence, UV and DOC measurements. 769 \nChemosphere 63(3):530-539 770 \nSenesi N (1990) Molecular and quantitative aspects of the chemistry of fulvic acid 771 \nand its interactions with metal ions and organic chemicals: Part II. The 772 \nfluorescence spectroscopy approach. Anal Chim Acta 232(1):77-106 773 \nSenesi N, Miano TM, Provenzano MR, Brunetti G (1991) Characterization, 774 \ndifferentiation, and classification of humic substances by fluorescence 775 \nspectroscopy. Soil Sci 152(4):259-271 776 \nSharma A, Schulman SG (1999) Introduction to fluorescence spectroscopy. Wiley, 777 \nNew York 778 \nSkoog A, Wedborg M, Fogelqvist E (1996) Photobleaching of fluorescence and the 779 \norganic carbon concentration in a coastal environment. Mar Chem 55(3-780 \n4):333-345 781 \nSoulsby C, Rodgers P, Smart R, Dawson J, Dunn S (2003) A tracer-based assessment 782 \nof hydrological pathways at different spatial scales in a mesoscale Scottish 783 \ncatchment. Hydrol Process 17(4):759-777 784 \nSpencer RGM, Pellerin BA, Bergamaschi BA, Downing BD, Kraus TEC, Smart DR, 785 \nDahgren RA, Hernes PJ (2007) Diurnal variability in riverine dissolved 786 \norganic matter composition determined by in situ optical measurement in the 787 \nSan Joaquin River (California, USA). Hydrol Process 21(23):3181-3189 788 \nStedmon CA, Markager S (2005) Resolving the variability in dissolved organic matter 789 \nfluorescence in a temperate estuary and its catchment using PARAFAC 790 \nanalysis. Limnol Oceanogr 50(2):686-697 791 \n 33 \nStedmon, C. A. and Bro, R. 2008 Characterizing dissolved organic matter 792 \nfluorescence with parallel factor analysis: a tutorial. Limnology and 793 \nOceanography: Methods (in press) 794 \nStedmon CA, Markager S, Bro R (2003) Tracing dissolved organic matter in aquatic 795 \nenvironments using a new approach to fluorescence spectroscopy. Mar Chem 796 \n82(3-4):239-254 797 \nSutherland IW (2001) The biofilm matrix - an immobilized but dynamic microbial 798 \nenvironment. Trends Microbiol 9(5):222-227 799 \nThurman EM (1985) Organic geochemistry of natural waters. Nijhoff, Dordrecht 800 \nTranvik LJ, Bertilsson S (2001) Contrasting effects of solar UV radiation on dissolved 801 \norganic sources for bacterial growth. Ecol Lett 4(5):458-463 802 \nVogt RD, Akkanen J, Andersen DO, Bruggemann R, Chatterjee B, Gjessing E, 803 \nKukkonen JVK, Larsen HE, Luster J, Paul A, Pflugmacher S, Starr M, 804 \nSteinberg CEW, Schmitt-Kopplin P, Zsolnay A (2004) Key site variables 805 \ngoverning the functional characteristics of Dissolved Natural Organic Matter 806 \n(DNOM) in Nordic forested catchments. Aquat Sci 66(2):195-210 807 \nWeishaar JL, Aiken GR, Bergamaschi BA, Fram MS, Fujii R, Mopper K (2003) 808 \nEvaluation of specific ultraviolet absorbance as an indicator of the chemical 809 \ncomposition and reactivity of dissolved organic carbon. Environ Sci Technol 810 \n37(20):4702-4708 811 \nWorrall F, Burt TP, Jaeban RY, Warburton J, Shedden R (2002) Release of dissolved 812 \norganic carbon from upland peat. Hydrol Process 16(17):3487-3504 813 \nWu FC, Evans RD, Dillon PJ (2003) Separation and characterization of NOM by 814 \nhigh-performance liquid chromatography and on-line three-dimensional 815 \n 34 \nexcitation emission matrix fluorescence detection. Environ Sci Technol 816 \n37(16):3687-3693 817 \nYano Y, Lajtha K, Sollins P, Caldwell BA (2004) Chemical and seasonal controls on 818 \nthe dynamics of dissolved organic matter in a coniferous old-growth stand in 819 \nthe Pacific Northwest, USA. Biogeochem 71(2):197-223 820 \nZepp RG, Sheldon WM, Moran MA (2004) Dissolved organic fluorophores in 821 \nsoutheastern US coastal waters: correction method for eliminating Rayleigh 822 \nand Raman scattering peaks in excitation-emission matrices. Mar Chem 89 (1-823 \n4): 15-36 824 \n 825 \n 826 \n 827 \n 828 \n 829 \n 830 \n 831 \n 832 \n 833 \n 834 \n 835 \nFigure captions 836 \n 837 \nFig. 1 Location of the field site (left) and map of the Afon Ddu catchment (right). 838 \n 839 \n 35 \nFig. 2 Stream stage and precipitation for the whole autumn (top) and for single events 840 \n(bottom). Markers in top panel indicate time of sampling. Note different time scale for 841 \nevent 3. 842 \n 843 \nFig. 3 pH and dissolved organic carbon (DOC) concentration in stream samples, 844 \nsphagnum pore water and soil water from the three events. BF = average base flow; 845 \nSph = sphagnum pore water; MR = soil water collected by micro-rhizons; ZT5 = soil 846 \nwater collected by zero-tension lysimeter at 5 cm; ZT10 = soil water collected by 847 \nzero-tension lysimeter at 10 cm. Note different time scale for event 3. 848 \n 849 \nFig. 4 Dissolved organic carbon\/dissolved organic nitrogen (DOC\/DON) ratio in 850 \nstream samples, sphagnum pore water and soil water from the three events. BF = 851 \naverage base flow; Sph = sphagnum pore water; MR = soil water collected by micro-852 \nrhizons; ZT5 = soil water collected by zero-tension lysimeter at 5 cm; ZT10 = soil 853 \nwater collected by zero-tension lysimeter at 10 cm. Note different time scale for event 854 \n3. 855 \n 856 \nFig. 5 Absorbance at 254 nm, sUVa (absorbance at 254 nm\/DOC concentration) and 857 \nE2\/E3 (absorbance at 250 nm\/absorbance at 365 nm) in stream samples, sphagnum 858 \npore water and soil water from the three events. BF = average base flow; Sph = 859 \nsphagnum pore water; MR = soil water collected by micro-rhizons; ZT5 = soil water 860 \ncollected by zero-tension lysimeter at 5 cm; ZT10 = soil water collected by zero-861 \ntension lysimeter at 10 cm. Note different time scale for event 3. 862 \n 863 \n 36 \nFig. 6 Excitation-emission matrices of the two parallel factor analysis (PARAFAC) 864 \ngenerated components C1 (top) and C2 (bottom). The scale is emission 865 \nloading*excitation loading (i.e. bjck in equation 1). 866 \n 867 \nFig. 7 Maximum fluorescence intensity (Fmax) of component C1 and C2 and the ratio 868 \nof the two in stream samples, sphagnum pore water and soil water from the three 869 \nevents. BF = average base flow; Sph = sphagnum pore water; MR = soil water 870 \ncollected by micro-rhizons; ZT5 = soil water collected by zero-tension lysimeter at 5 871 \ncm; ZT10 = soil water collected by zero-tension lysimeter at 10 cm. Note different 872 \ntime scale for event 3. 873 \n 874 \nFig. 8 Maximum fluorescence intensity (Fmax) of component C1 and C2 in event 3 875 \nplotted with in situ temperature (top) and absorbance at 254 nm (bottom). 876 \n 877 \nFig. 9 Two end-member mixing model for event three, showing the proportion of base 878 \nflow type water needed to explain stream concentration when the other end-member is 879 \nsoil water (average of the micro-rhizon sample and the two zero-tension lysimeter 880 \nsamples). Mixing model excluding (left) and including (right) C1 and C2.  881 \n 882 \nFig. 10 Fluorescence measured in situ (excitation 330 nm, emission 450 nm) and 883 \ndischarge in Nant y Brwyn. 884 \n 885 \nFigure 1\nClick here to download high resolution image\nFigure 2\nClick here to download high resolution image\nFigure 3\nClick here to download high resolution image\nFigure 4\nClick here to download high resolution image\nFigure 5\nClick here to download high resolution image\nFigure 6\nClick here to download high resolution image\nFigure 7\nClick here to download high resolution image\nFigure 8\nClick here to download high resolution image\nFigure 9\nClick here to download high resolution image\nFigure 10\nClick here to download high resolution image\n"}