{"doi":"10.1080\/09593330802008404","coreId":"140620","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/3097","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/3097","10.1080\/09593330802008404"],"title":"A Survey of Green Burial Sites in England and Wales and an Assessment of the\nFeasibility of a Groundwater Vulnerability Tool","authors":["Kim, Kye-Hoon","Hall, Mark L.","Hart, A.","Pollard, Simon J. T."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-01-01T00:00:00Z","abstract":"Since 1994, 200 'green' or natural burial sites have been developed in the UK\nand Eire, attracting regulatory attention because of perceived risks to\ngroundwater. Here, a survey of natural burial practice in England and Wales\n(n=49 of 141 elicited) is presented, providing data on operational trends and\nsupporting the design of a groundwater vulnerability assessment tool. Natural\nburial grounds are generally small in area (< 0.8 ha), adopt a mean single\nburial depth of 1.45 m bgl and a mean plot density of ca. 1480 graves ha-1. A\nvulnerability screening tool is described that allows a desk-based evaluation of\nsites by reference to seven groundwater risk attributes. Initial feasibility is\nevaluated through application to 131 sites","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140620.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1080\/09593330802008404","pdfHashValue":"3fb1a1bec5c717f4e93facdf2879da539c0b302f","publisher":"Taylor & Francis","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/3097<\/identifier><datestamp>2017-09-01T11:58:40Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>A Survey of Green Burial Sites in England and Wales and an Assessment of the\nFeasibility of a Groundwater Vulnerability Tool<\/dc:title><dc:creator>Kim, Kye-Hoon<\/dc:creator><dc:creator>Hall, Mark L.<\/dc:creator><dc:creator>Hart, A.<\/dc:creator><dc:creator>Pollard, Simon J. T.<\/dc:creator><dc:subject>Cemetery<\/dc:subject><dc:subject>groundwater<\/dc:subject><dc:subject>pollution<\/dc:subject><dc:subject>natural burial grounds<\/dc:subject><dc:subject>risk<\/dc:subject><dc:subject>vulnerability<\/dc:subject><dc:description>Since 1994, 200 'green' or natural burial sites have been developed in the UK\nand Eire, attracting regulatory attention because of perceived risks to\ngroundwater. Here, a survey of natural burial practice in England and Wales\n(n=49 of 141 elicited) is presented, providing data on operational trends and\nsupporting the design of a groundwater vulnerability assessment tool. Natural\nburial grounds are generally small in area (< 0.8 ha), adopt a mean single\nburial depth of 1.45 m bgl and a mean plot density of ca. 1480 graves ha-1. A\nvulnerability screening tool is described that allows a desk-based evaluation of\nsites by reference to seven groundwater risk attributes. Initial feasibility is\nevaluated through application to 131 sites.<\/dc:description><dc:publisher>Taylor & Francis<\/dc:publisher><dc:date>2011-09-29T17:49:50Z<\/dc:date><dc:date>2011-09-29T17:49:50Z<\/dc:date><dc:date>2008-01-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>K-H Kim, M.L. Hall, A. Hart and S.J.T. Pollard, A Survey of Green Burial Sites in England and Wales and an Assessment of the Feasibility of a Groundwater Vulnerability Tool, Environmental Technology, Vol 29(1), January 2008. pp1-12<\/dc:identifier><dc:identifier>0959-3330<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1080\/09593330802008404<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/3097<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0959-3330","issn:0959-3330"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2008,"topics":["Cemetery","groundwater","pollution","natural burial grounds","risk","vulnerability"],"subject":["Article"],"fullText":"1A SURVEY OF GREEN BURIAL SITES IN ENGLAND AND WALES AND1\nAN ASSESSMENT OF THE FEASIBILITY OF A GROUNDWATER2\nVULNERABILITY TOOL3\n4\nK-H Kima, M.L. Hallb, A. Hartc and S.J.T. Pollardb*5\naDepartment of Environmental Horticulture, The University of Seoul, South Korea.6\nbSustainable Systems Department, School of Applied Sciences,7\nCranfield University, UK.8\ncEnvironment Agency, Science Group, Solihull, UK.9\n*Corresponding author: Sustainable Systems Department, School of Applied10\nSciences, Cranfield University, Cranfield, Bedfordshire, MK43 OAL, England,11\nTel: +44 (0)1234 754 101 e-mail: s.pollard@cranfield.ac.uk12\n13\nAbstract14\nSince 1994, 200 ‘green’ or natural burial sites have been developed in the UK and Eire,15\nattracting regulatory attention because of perceived risks to groundwater. Here, a survey of16\nnatural burial practice in England and Wales (n=49 of 141 elicited) is presented, providing data17\non operational trends and supporting the design of a groundwater vulnerability assessment tool.18\nNatural burial grounds are generally small in area (< 0.8 ha), adopt a mean single burial depth of19\n1.45 m bgl and a mean plot density of ca. 1480 graves ha-1. A vulnerability screening tool is20\ndescribed that allows a desk-based evaluation of sites by reference to seven groundwater risk21\nattributes. Initial feasibility is evaluated through application to 131 sites. We offer22\n23\n2Keywords: cemetery, groundwater, pollution, natural burial grounds, risk, vulnerability.1\n2\n3\n4\n5\nINTRODUCTION6\nThere are two principal options for the disposal of the dead in the UK: cremation or burial.7\nCremation has been preferred for 40 years and in 2003 accounted for 75% of the funerals in8\nEngland and Wales (Cremation Society of Great Britain 2003). But there is also considerable9\npressure for space in cemeteries. Furthermore, a growing demand for a more ‘natural’ way of10\nburial has lead to the development of natural or ‘green’ burial grounds. Here, graves have no11\npermanent gravestone or they posses an unobtrusive marker. Sites have a natural appearance,12\noften taking the form of a managed woodland or meadow. Since 1994, ca. 200 sites in the UK13\nand Eire have joined the Association of Natural Burial Grounds (ANBG) (Wienrich and Speyer14\n2003), the sector’s trade body.15\nThe potential for burial grounds to pollute the environment and the management of this16\nrisk is summarised by others (Pacheco et al. 1991; Janaway 1997; Dent and Knight 1998; Knight17\nand Dent 1998; Young et al. 1999; Lelliot 2002; Spongberg and Becks 2000a,b; Dent et al.18\n2004; Environment Agency 2004a, Environment Agency 2004b; Hart 2005). When bodies and19\ngrave contents (coffins, coffin liners, shrouds, clothing) decompose, the decomposition products20\nare released to the environment. The human body (ca. 70kg) is a complex matrix of organic21\n(17%w\/w protein; 17%w\/w fat and 6%w\/w carbohydrate) and inorganic (N, P, Ca, Na, Sr)22\nconstituents. Decomposition poses a microbiological hazard. In risk assessment terms, there is a23\ngrowing consensus that the principal receptor of concern for the key pollutants (NO3- and24\nNH4+(aq)) is the groundwater below the site (Pacheco et al., 1991; Knight and Dent, 1998; Lelliot,25\n2002; Buss et al., 2003; Dent, 2005).26\n3This study provides the first survey of natural burial practice in England and Wales and1\ndescribes the initial design of a groundwater vulnerability screening tool. The survey provides a2\nunique snapshot of practices in this industry and the first qualitative information on the potential3\nrisks to groundwater. Both site operators and regulators in England and Wales (local authority4\nplanning and environmental health departments and their Government consultees, including the5\nEnvironment Agency) must make decisions on the suitability of individual sites and, or,6\nrecommend site investigations where appropriate. In doing so, the first level of risk based7\ndecision making relies on screening the site against known likely hazard combinations. The8\noriginal guidance on this subject (see Environment Agency 2004c) provided a similar framework9\nwhich has been used in on some sites. At this screening stage, a full site characterisation and10\nrisk assessment of proposed burial grounds during the planning stages of their development is11\nrarely possible. As a guide to prioritising sites that merit greater attention, this study proposes a12\nrisk screening methodology and examines its initial feasibility using a desk-based trial. The costs13\nassociated with detailed subsurface assessments are often too high for small sites. In addition, for14\nextant sites there is the added reluctance of undertaking work that may disturb existing graves.15\nNevertheless, the method described here is based on bringing together existing tools such as the16\ngroundwater vulnerability maps that are widely recognised as appropriate to the screening step17\nand are central to the regulatory response to any new developments that threaten groundwater18\nquality.19\nMATERIALS AND METHODS20\n21\nStudy rationale and natural burial ground survey22\nInitially, a survey was undertaken to ascertain the state-of-the-art on natural burial grounds in23\nEngland and Wales. A questionnaire (Table 1) was distributed to burial ground managers24\nbetween April and June 2005 to characterise natural burial practice. Questionnaires were25\ndistributed to 141 members of the ANBG, the aim being to obtain a description of the source26\n4term and summarise the practices employed; data not previously compiled for England and1\nWales.2\n<Table 1>3\nThe questionnaire was designed to elicit information of the operational life (Q1), source term4\n(Q2-6), depth of burial (Q7) and burial specifications (Q8-11).5\n6\nGroundwater vulnerability screening tool design7\nFor development of the groundwater vulnerability tool, both active and planned grounds whose8\nlocation had been established were included. Site postcodes were used to extract the grid9\ncoordinates from the UK street map coordinate converter10\n(http:\/\/www.streetmap.co.uk\/gridconvert.html) and the coordinates used to reference relevant11\ndata from available spatial data sets. A baseline methodology for screening groundwater12\nvulnerability to pollution from cemeteries is described by Young et al. (1999). The parameters13\nused were: superficial deposit type and thickness, depth to water table, flow mechanism,14\npresence and type of aquifer, source protection zone category and distance from watercourses,15\nsprings and drains. Since comprehensive data for each of these parameters are not available, the16\nmethodology was adapted, as shown in Table 2.17\n<Table 2>18\nEach parameter (attribute; column 1, Table 2) was subdivided into categories representing an19\nincreasing risk to groundwater and a score assigned; 1-2 representing the least threat to20\ngroundwater and 9-10 the greatest. Scores for each attribute were equally weighted and summed21\nto provide an aggregate vulnerability score across seven attributes (Tables 2 and 3). Adaptations22\nmade to the screening tool for each of the attributes are described below. Important limitations23\nof the tool are discussed later. In some details especially because validation, in a metaphorical24\nsense, is problematic for these scientific locations.25\n51\nType and thickness of superficial deposits2\nSuperficial deposits (regoliths) are interpreted as unconsolidated deposits that occur as3\ndiscontinuous patches and larger spreads, resting on bedrock. Superficial deposit data at4\n1:50 000 was obtained from the British Geological Survey (BGS) (DiGMapGB-50 v2_11;5\nBritish Geological Survey, 2005). Additional categories of superficial deposits to those6\ndescribed by Young et al. (1999) were assigned a vulnerability score (Figure 2). The thickness7\nof the deposit was obtained from the BGS at the 1:50 000 scale from the GeoSure data set. The8\ndata is limited – it is modelled, created by interpolating values from borehole and map9\nmeasurements. The basic superficial thickness model (BSTM) for deposit thickness was used.10\nWherever bore data is unavailable, this model uses a minimum mapped thickness of material of11\n1.5 m.12\n13\nHydrology of soil type models (HOST)14\nWhile the Environment Agency holds some data on water table depth, a full national coverage is15\nnot available. Substitute data sets were therefore sought to provide an improved method for16\nassessing groundwater vulnerability. The Hydrology of Soil Types (HOST) model (Boorman et17\nal. 1995) has merit in this context because it assigns classes to soil types on the basis of their18\nhydrological response and the representative processes occurring in soil (Figure 1). The HOST19\nclasses provide an indication of the degree of protection that an overlying soil provides to20\ngroundwater. A category of risk to groundwater for each HOST class was therefore assigned21\n(Figure 2).22\n<Figure 1>23\nBriefly, the HOST model catalogues soils on the basis of their physical properties and their24\neffects on the storage and transmission of water. There are 29 HOST classes, based on 1125\n6response models, A-K (Table 2; Figure 2). Each model belongs to one of three groupings1\n(horizontal rows in Figure 2), based on whether an aquifer is present and at what depth it is likely2\nto occur: at more than 2m depth, within 2m, or no significant aquifer or groundwater present.3\n<Figure 2>4\nThe HOST model describes the dominant water movement in soils (i.e. vertical or lateral) based5\non the soil properties of depth to gleyed layer, depth to slowly permeable layer, integrated air6\ncapacity and the presence of a peaty surface layer.7\n8\nAssignment of flow mechanism values9\nThe mechanism of water movement through soil influences the relative vulnerability of the10\nunderlying groundwater to pollutants. Intergranular flow is normally slower in the unsaturated11\nzone than in the saturated zone. Water and dissolved pollutants travel downwards slowly12\nallowing filtration and attenuation and thus providing a degree of protection to groundwater13\n(Figure 1). In contrast, fissured flow enables pollutants to by-pass these attenuating processes.14\nFlow mechanism scores were assigned using the HOST model (Figure 2), reflecting the15\nspectrum of flow types from intergranular (1) to fissured (5). HOST models B and C, which16\ncontain an impermeable layer within 1m or gleyed layer at 0.4-1.0 m and a gleyed layer within17\n0.4 m respectively, represent a range of substrate hydrogeology and no single flow mechanism18\ncan be assigned (Figure 2). Fortunately, model B (HOST class 13) and C (HOST class 14)19\naccount for only 0.5% and 0.03% of land in England and Wales and none of the burial sites fell20\ninto either of these classes. Raw peaty top soils dominate the hydrology of model D (class 15;21\nFigure 2). While the underlying substrate is coarse and relatively permeable, the upper level is22\nsaturated. Model E is divided into two HOST classes, 7 and 8. Class 7 soils are made up of23\ncoarse textured sands and gravels in which by-pass flow is very uncommon; hence this class was24\nassigned a flow mechanism of 1. Class 8 was assigned a flow mechanism of 4 as it is comprised25\n7of loamy and clayey soils, but in which by-pass movement is often common via fissures and1\nmacropores.2\n3\nSource protection zones and aquifer data4\nSource protection zone (SPZ) and aquifer data, part of the groundwater vulnerability mapping5\ndata set for England and Wales, were supplied by the Environment Agency (2001). Burial6\nground coordinates were compared with the source protection zones, and where the coordinates7\nlay within zones II or III, the distance from the boundary between the two was measured using8\nArcMap™ software. The category ‘close to boundary of zones II and III’, not defined in Young9\net al. (1999), was taken to be 150 m from the boundary. The sites were scored for groundwater10\nvulnerability for these two parameters as in Table 2.11\n12\nDistances from watercourses, spring and drains13\nData on distances from drains and field are not collated on a national level. These features are14\ncritical and only identifiable through desk based research or site investigation. Distances from15\nrivers, canals and lakes at 1:50 000 scale were provided by the Environment Agency. The16\nscoring used in Young et al. (1999) was adapted: a distance of less than 30m between a burial17\nground and a river represents a high risk site. However, as the coordinates of the burial sites18\nwere generated from postcodes, the location of the sites does not have the required degree of19\nprecision to distinguish five different categories of risk. Instead, the sites were divided into three20\ncategories (Table 2): within 80 m, between 80 m and 150 m and more than 150 m from a river or21\nspring.22\nRESULTS23\n81\nSurvey of natural burial ground practice2\nTo our knowledge this is the first survey of natural burial ground practice beyond the3\nrudimentary information reported in Wienrich and Speyer (2003). Our survey of 141 sites4\nelicited 49 responses. Natural burial grounds are operated privately, or by trusts or by local5\nauthorities. Almost 60% of sites in England and Wales are local authority-run and of the 496\nrespondents, 26 were from local authorities. Members of the ANBG have all opened since 19937\nand been subject to modern planning procedures and statutory (Environment Agency)8\nconsultation on their siting. The following analysis is based on the 49 responses received.9\n10\nSite size and density of graves11\nThe area of burial grounds varied from 0.04 to 14 ha. Natural burial grounds are generally small12\nsites, with half of the sites being  0.8 ha. Only three sites are > 8 ha, the mean size being13\n1.7 ha. The mean number of potential burials per site is 2637 and the mean plot density is 147814\ngraves ha-1. The plot density is consistent with the Environment Agency’s estimated average of15\n1580 graves ha-1 and lower than the typical density for conventional cemeteries of 1975 graves16\nha-1. The burial ground with the lowest projected density of burials has 165 graves ha-1; whereas17\nthe ground with the highest density has an average of ca. 9800 graves ha-1 which appears18\nanomalous. To estimate the rate of burial per site, each of the sites were asked how many burials19\noccurred in each of the last four years (Table 1). In 2001, over 50% of burial grounds undertook20\nless than 5 burials. By 2004 this number had dropped to 40% and the percentage of sites with21\nhigher burial rates had increased (Figure 3).22\n<Figure 3>23\n9Depth of graves1\nThe majority of natural burial grounds (87%) dig graves to a single depth and inter a single2\ncoffin. By contrast, conventional cemeteries usually dig graves to inter two coffins. A survey of3\nDanescourt cemetery in Wolverhampton, UK (Environment Agency 2002) found that 90% of the4\ngraves were for two coffins, at 1.8 m below ground level (m bgl). Deeper ‘common graves’5\nmake up 2-3% of annual interments, typically extending to 2.7 m bgl to contain three coffins.6\nOn occasion graves extend to 3.4, 4.0 or 4.6m bgl, for four, five or six burials. The graves are7\nnormally filled within one year, so the source term may be treated as a single ‘large burial’8\n(Environment Agency 2004c). This survey suggests the mean burial depth in natural burial9\ngrounds is 1.45 m bgl. Whilst this is slightly deeper than the Agency model (Young et al.,10\n1999), which assumes 1.3 m bgl, it is shallower than for conventional cemeteries. This11\npotentially results in a slightly thicker layer of soil between the base of the grave and any12\nunderlying groundwater through which attenuating processes may occur, potentially lessening13\nthe potential polluting effects of the products of decomposition.14\n15\nPrior investigation and survey16\nNineteen of the responses indicated that no form of environmental site survey had been17\nconducted before the site was opened. Eighteen respondents were aware of some form of prior18\ninvestigation: in some cases a desk-based groundwater risk assessment had been conducted,19\nboreholes sunk to monitor water quality or a soil or geological survey performed; in another case20\nthe local water utility had identified suitable locations using a desk-top analysis. At six grounds,21\nrespondents were unaware whether a survey had been conducted or not, possibly because the22\nnatural burial ground was annexed to an existing, older, cemetery.23\n10\n1\nPolicies on embalming2\nThe recent development of natural burial grounds means they are unlikely to present a risk to3\ngroundwater from heavy metals employed in outdated embalming products, as these have been4\nbanned in England and Wales since 1951 (Select Committee on Environment, Transport and5\nRegional Affairs, 2000). Nevertheless, current practice is sometimes to embalm using6\nformaldehyde to arrest decay until after burial. The issue of accepting embalmed bodies for7\nburial had not arisen at three grounds, and no policy had been fixed. Fourteen of the 498\nrespondents replied that they do not accept embalmed bodies. Twenty two sites responded9\nwithout qualification that embalmed bodies are accepted, while 8 sites stated that although they10\npreferred bodies not to be embalmed, they are flexible in practice.11\n12\nCoffin types13\nOur study has adopted a premise that coffins adopted at natural burial grounds offer less14\ncontainment for the contents than conventional coffins, many of which have plastic liners. In the15\nsurvey, 33 responded that some form of discrimination was enforced. These sites described the16\ntypes of coffin they accepted as ‘biodegradable’, ‘environmentally-friendly’, ‘natural’ or17\n‘ecological’. Fourteen respondents listed the materials they accepted and these included18\nbamboo, willow, cardboard, wicker and natural fibres. Sixteen respondents were prepared to19\naccept any type of coffin, although 2 stated that the use of biodegradable coffins was20\nencouraged.21\n22\nTree cover and the interment of ashes23\nBurial site managers were asked to provide an estimation of the tree cover over the site to24\ncompare with the Agency model for water infiltration and evapotranspiration (Young et al.,25\n1999). Three of the sites had no tree cover, being meadows or pasture. Another 3 had no trees26\n11\namongst the graves, but trees surrounded burials at the edge of the site. Twelve grounds1\nestimated that 70-100% of the area of the site was covered by trees, and 8 stated that one tree2\nwas planted per grave. Fourteen sites estimated 2-40% tree cover. Six grounds made no3\nestimate, but stated that tree cover would increase over time.4\nSpace is not always planned for interring ashes. When asked about the provision of ashes5\nplots on the site, 31 of the 49 respondents had planned the potential number of plots on the site6\nand 11 replied that their site was capable of accepting the same number of ashes plots as graves;7\nboth types of internments being treated the same. Eighteen sites had no dedicated space for8\nburying ashes, although some sites commented that families were welcome to scatter ashes at the9\nsite.10\n11\nFeasibility trial of the groundwater vulnerability tool12\nWe recognise at the outset the challenge of making risk- informed decisions with incomplete13\ndata sets. This sad, regulators face the challenge of offering a sound rationals for their advice14\nwhilst operating within these constraints.15\n16\nScreening tool output17\nOf the 180 sites in England and Wales listed as members of the ANBG, 131 were identified and18\nscored using the screening tool. Fewer locations than the listed 180 were identified because19\neither no specific location existed for some planned sites, or because plans for the sites had been20\nabandoned. Site scores were aggregated across seven risk attributes: (i) superficial deposit type;21\n(ii) superficial deposit thickness; (iii) HOST classification; (iv) SPZ class; (v) aquifer type; (vi)22\nflow mechanism; and (vii) distance to river. The scoring of these attributes was normalised, each23\nattribute having a maximum score of 10 (9-10; Table 2). A maximum aggregate score of 66.524\n(mean of the highest class score of 9.5 x 7) is achievable. The minimum vulnerability score25\ntheoretically achievable is 1.5 x 7, that is 9.5.26\n12\nFor to the total set of sites investigated of particular note was the high incidence of high1\nscores (9-10) for deposit type and thickness, which results from the absence of superficial2\ndeposits. This was the case in 74 (54%) of the sites screened. Deposit type is mapped3\nthroughout the country, although it occurs as discontinuous patches. Each site is mapped onto a4\ndeposit type, although over half of the sites have no underlying deposits. For example, one site5\n(Headington, Oxford) was mapped to an area of peat deposits, although superficial deposits were6\nabsent at that location. Wherever borehole data is unavailable, the model provides a thickness of7\n1.5m. The data for 26 sites (19%) gave a thickness of 1.5m, suggesting that accurate data may8\nhave been missing for as many as 26 sites.9\nNinety sites scored 1-2 for HOST type. Only 8 burial grounds fell into the very high10\nvulnerability class. One site (Entwhistle) was of HOST model K, which has raw peaty topsoil.11\nThe superficial deposits at this site, according to the BGS data, were diamicton, defined as “clay12\nand silty clay, commonly pebbly and sandy, stiff, possibly interbedded with sand and gravel-rich13\nlenses and rare peat” (British Geological Survey, 2005). Prior to this study, we anticipated that14\nno sites would be located in Class I because the source water protection policy prohibits this type15\nof land use within zone I. This appears to be accurate. Twenty-one sites are located in source16\nprotection zones II and III, the remainder lay outside the zones. There are no underlying aquifers17\nat 30 sites; 80 sites occur over minor aquifers and 26 occur over major aquifers.18\nDetermining the significance of risk in risk scoring systems is not straightforward,19\nparticularly for multiattribute systems such as the one described here. In all such systems there20\nare the potential dangers of double counting and of assuming linear scales for individual21\nattributes. We adopted a pragmatic approach to the analysis of the data here, being primarily22\ninterested in the relative banding of vulnerability scores than the absolute values obtained which23\nare necessarily relative. Using the system developed a, ‘moderate’ score for each attribute would24\nproduce an aggregate vulnerability score of 35, whilst a ‘high’ score would produce an aggregate25\nscore of 63 and above (Table 2). In this feasibility assessment, we observed a concentration of26\n13\naggregate scores around the mid range. For illustrative purposes, the aggregate scores for the1\nhighest scoring 30 sites (n = 131) are provided in Figure 4, which summarises the distribution of2\nvulnerability scores by site identifier and attribute (note that all sites have a score >40). The3\ndistance to river, flow mechanism and aquifer type appear to be critical risk factors. Table 34\nprovides the raw data for the lowest eight scoring of these thirty sites as an illustration. We5\nconsider Figure 4 represents a series of ‘medium risk’ sites that subject to review, may warrant6\nfurther investigation on an individual site basis, initially by desk-based scrutiny of the full data7\nset and supporting assumptions in light of the fact that we are not able to yet validate the8\nfeasibility trial.9\n<Figure 4>10\n<Table 3>11\n12\nDISCUSSION13\n14\nNatural burials are on the increase in the UK and their impact on the environment is less well15\nunderstood than those from crematoria or conventional cemeteries. When consulted on new16\ndevelopment proposals, the Environment Agency advises local authorities on such sites.17\nHowever, the science of natural burial grounds and, in particular, the extent and nature of the18\npotential risks posed by bodies is not well understood. The vulnerability assessment tool19\ndesigned and trialled in this study did not suggest any high-risk sites; a reassuring and positive20\noutcome because these sites are either operational or in later stages of the planning process. This21\nsaid, the study has highlighted the incomplete nature of several national data sets and22\ndemonstrated the critical importance of statutory consultation on siting decisions. By and large,23\nthose consultations that have taken place to date on the siting of natural burial grounds would24\nappear to have been effective.25\n26\n14\nMethodological limitations1\nAll risk screening techniques, such as the one described in this study, have data limitations and2\nsimplifications embedded within them that demand scrutiny prior to their practical application.3\nThe regulator’s challenge is to offer well-reasoned and proportionate advice, often in the face of4\na paucity of data or incomplete data sets and using assumptions that despite best intention, may5\nnot be able to be validated. Whilst adoption of a precautionary approach to siting decisions6\nshould err on the side of caution, seeking desk and site investigation data to support decisions,7\nsite investigation is not always practically possible and judgements have to be made used a well-8\nreasoned rationale, hence the motivation for this study and feasibility trial.9\nScores within ranking schemes represent surrogates for the true value of the attributes10\nunder study, and the aggregation of attributes across a complex system forces a caution on11\ninterpretations of the output. This screening tool is no exception. Source protection zones are12\ncentred on approximately 2200 major abstraction sites, some of which are used for public water13\nsupplies. Individual site investigations are required to identify additional sites of abstraction14\nwhen considering new developments. An absence of data on drains and field drains is also an15\nimportant limitation. No national data on smaller or private abstractions are available for a desk-16\nbased assessment of groundwater vulnerability. However, the same methodology may be17\nemployed for a more detailed on-site groundwater vulnerability assessment for the later stages of18\nrisk assessment. An identical scoring method may be used where smaller abstractions are made19\nfrom viable aquifers.20\nA slightly different approach may be required when considering the presence of small21\nlocal wells, where water is abstracted from shallow depths. The location of such wells is also22\nunavailable on a national scale. Suitable soil types include HOST classes (Figures 1 and 2)23\nwithin those described by HOST models H-K, where there is no underlying groundwater body.24\nFor example, HOST model I has an impermeable layer within 1m and a gleyed layer between25\n0.4m-1m, and model J has a gleyed layer within 0.4m. This results in much of the infiltrating26\n15\nrain being confined to the upper levels of the soil and moving in a predominantly lateral1\ndirection, such that water is held at shallower depths. If an on-site assessment is conducted and2\nlocal wells identified, an amended scoring system is required.3\nFlow mechanism scores were assigned to HOST models. Scores were assigned solely on4\nthe basis of the method that water travels through soil, with the exception of Models H – K.5\nThese models describe soils which do not overlie any significant groundwater or aquifer. While6\nthese soils are slowly permeable or impermeable and may display fissured flow (mechanisms 47\nand 5), particularly during summer months of low rainfall, there is no underlying groundwater or8\naquifer, so assigning a high risk score to these soils does not appear to be informative. For this9\nreason, only low vulnerability scores (1-2) were assigned to these models. If an on-site risk10\nassessment was to be conducted and the presence of local wells detected in areas of HOST11\nmodels H-K, higher vulnerability scores would need to be assigned for flow mechanisms (7-8 for12\nslowly permeable substrates and 9-10 for impermeable substrates). While hydrological13\nprocesses described in the HOST models may be disrupted where the soil is disturbed for a14\ngrave, the main physical settings of the model are constant. In addition, water also infiltrates15\nsome of the ground between graves through undisturbed soil (e.g. at boundaries and services16\nareas) and the HOST models hold true for the rainfall response in this soil.17\nAssigning the distance from the river line is the most problematic parameter, as distances18\nhave been measured from a single point within the sites. For the largest sites (8 ha and larger)19\nthe accuracy of this method is poor. The area of the site needs to be plotted in order to20\naccurately measure the distance to the nearest river from the edges of the burial ground. Also,21\nthe distance from river lines was measured from the site-co-ordinates to the nearest river. The22\nshortest distance between the two points was measured without taking into account topography.23\nThis potential source of error may result in an increased estimated risk to underlying24\ngroundwater because short distances can exist between sites and rivers without there being a25\nhydraulic link between the two.26\n16\nThe use of postcodes for the assessment does not provide the highest degree of precision1\nfor the location of sites, which may produce inaccurate scoring, particularly in rural areas. Also,2\npoint data were extracted from two-dimensional mapping information to perform the assessment.3\nMapped data consist of a series of polygons of varying sizes and shapes, each of which contain4\nthe values for that area. Analysis of sites at a higher level of sophistication is possible if the area5\nof the site is used to conduct the assessment, rather than co-ordinates. Where site areas are used,6\nthe data from each polygon that intersects the site may be taken into account, providing a higher7\nlevel of information about the site. If this methodology were used as part of the initial risk8\nassessment in the planning process, the exact location and area of proposed sites would be9\nsubmitted on an ordinance survey map as part of the planning application. This would permit a10\nhigher level of accuracy in the assessment.11\nDepth to water table was one of the original parameters assessed (Young et al., 1999).12\nThis is a key parameter to consider when assessing risks to groundwater and, because this13\ninformation is not available for a desk-based study, the accuracy of our analysis remains14\nsomewhat impaired and constrained through application of the HOST scheme of water tables <15\nor > 2m depth. One methodological improvement would be to consider water tables of at least16\n2.5 m bgl, allowing for a further 1 m beyond the 1.45m mean depth observed in the survey.17\nThe standard of the modelled superficial deposits thickness data includes significant data18\ngaps and provides a simplified picture of superficial deposits.19\nTo validate the initial approach presented here, we recommend that examples of natural20\nburial grounds with the highest, median and lowest vulnerability scores be re-evaluated using21\ndata derived from site-specific measurements to determine if the results of the desk-based studies22\nreflect field observations. With this level of validation, this method could be used to screen for23\nhigh risk proposals early in the planning process. While this methodology was limited to the24\nanalysis of natural burial sites, it is equally applicable in principle to conventional cemeteries25\n17\nthough the discrepancies with respect to burial depth are an important distinction between these1\nclasses of burial ground.2\n3\n4\nCONCLUSIONS5\n6\nThis first operational survey of natural burial grounds in England and Wales provides a summary7\nof current practices and allows a comparison with conventional cemeteries. The principal8\ndistinctions are between burial depth and the number of burials per plot, coffin type and by9\ninference, the degree of containment offered by coffins used at natural burial grounds. This10\nneeds to be considered alongside the possible routine collapse of conventional coffins post-11\nburial. The coordinates of 131 of 180 natural burial grounds have been used to extract nationally12\ncompiled data on seven physical parameters including superficial deposits type and thickness,13\ndistance to river, flow mechanism and HOST (hydrology of soil type) mechanism. These14\nparameters were used to develop a groundwater vulnerability screening tool, the application of15\nwhich was trialled scored for 131 sites and, in a first approximation, used to generate16\ngroundwater vulnerability scores. Finally, we have discussed in some depth the inherent17\nlimitations of the tool. These require additional attention prior to attempts to validate the tool’s18\noutput with authentic site data from natural burial grounds.19\n20\n18\nACKNOWLEDGEMENTS1\nThe Environment Agency funded Cranfield University’s Centre for Resource Management and2\nEfficiency to undertake this work. We acknowledge the input of John Hollis, Christophe3\nSannier, Pericles Toukiloglou, Elizabeth Farmer, Gregory Arends and Tomasz Tarchalski of4\nCranfield University. Chris Moody at the Environment Agency extracted the distance from river5\nline data. The opinions expressed herein are those of the authors’ alone.6\n19\nREFERENCES1\n1. British Geological Survey DiGMap General information notes, supplied with data,2\nBritish Geological Survey, Keyworth, Nottingham, UK. (2005).3\n2. Boorman D.B., Hollis J.M. and Lilly A., (Hydrology of soil types: a hydrologically based4\nclassification of the soils of the United Kingdom. Report No. 126. Institute of5\nHydrology, Natural Environment Research Council, Wallingford, UK. (1995).6\n3. Buss S., Herbert A., Morgan P. and Thornton S., Review of ammonium attenuation in7\nsoil and groundwater. Quart. J. Engg. Geol. Hydrogeol. 37, 347–359 (2003).8\n4. Cremation Society of Great Britain (2003). Progress of cremation in the United Kingdom9\n1885-2003, available at10\nhttp:\/\/www.srgw.demon.co.uk\/CremSoc4\/Stats\/National\/Progress.html, <<accessed 16th11\nJanuary 2006>>12\n5. Dent B.B. and Knight M.J.K., Cemeteries: a special kind of landfill. The context of their13\nsustainable management. In: Groundwater: Sustainable Solutions, International14\nGroundwater Conference, International Association of, Hydrogeologists, Melbourne Feb,15\npp. 451-456 (1998).16\n6. Dent B., Forbes S. and Stuart B., Review of human decomposition processes in soil.17\nEnviron. Geol. 45, 576–585 (2004).18\n7. Dent B.B., Vulnerability and the unsaturated zone – the case for cemeteries. In:19\nProceedings “Where Waters Meet”, Joint Conference of the New Zealand Hydrological20\nSociety, International Association of, Hydrogeologists Australian Chapter) and New21\nZealand Soil Science Society, Auckland, Nov 30–Dec 2, 2005, paper A13 (2005).22\n8. Environment Agency Groundwater vulnerability maps, Environment Agency Bristol,23\nUK. (2001).24\n20\n9. Environment Agency Groundwater impact of Danescourt cemetery, Wolverhampton,1\nNational Groundwater and Contaminated Land Centre Report NC\/99\/72, Solihull, UK.2\n(2002).3\n10. Environment Agency Potential groundwater pollutants from cemeteries. Science Report.4\nPrepared by A. Hart and S Casper, National Groundwater and Contaminated Land5\nCentre, Solihull, UK. (2004a).6\n11. Environment Agency Assessing the groundwater pollution potential of cemetery7\ndevelopments, National Groundwater and Contaminated Land Centre, Solihull, UK.8\n(2004b).9\n12. Environment Agency, Amendment to ‘Pollution Potential Of Cemeteries’ Young, C.P.,10\nBlackmore K.M., Reynolds P. and Leavens A. 1999, Draft Guidance. R&D Report P223,11\nEnvironment Agency, Bristol, UK. (2004c).12\n13. Hart A., Ammonia shadow of my former self, Land Contam. Reclam., 13, 239-24313\n(2005).14\n14. Janaway RC., The decay of buried human remains and their associated materials. In:15\nHunter J., Roberts C., Martin A (eds) Studies in crime: an introduction to forensic16\narchaeology. Routledge, London, pp. 58–85 (1997).17\n15. Knight M.J. and Dent B.B., Sustainability of waste and groundwater management18\nsystems. In: Groundwater: Sustainable Solutions, Conference of the International19\nAssociation of Hydrogeologists, Melbourne, Feb., pp. 359–374 (1998).20\n16. Lelliot M., Hydrogeology, pollution and cemeteries, Teaching Earth Sciences, 27, 68-7321\n(2002).22\n17. Pacheco A., Mendes J.M.B., Martins T., Hassuda S. and Kimmelmann A.A., Cemeteries23\n– a potential risk to groundwater, Wat. Sci. Technol. 24, 97-104 (1991).24\n18. Select Committee on Environment, Transport and Regional Affairs (2000) Memorandum25\nby the Environment Agency (CEM 56) 2000 Groundwater Pollution Potential of26\n21\nCemeteries available at http:\/\/www.parliament.the-stationery-1\noffice.co.uk\/pa\/cm200001\/cmselect\/cmenvtra\/91\/91m62.htm, <<accessed 16th January,2\n2006>>.3\n19. Spongberg A., and Becks P., Inorganic soil contamination from cemetery leachate. Wat.4\nAir Soil Pollut. 117, 313-327 (2000a).5\n20. Spongberg A. and Other Becks, P., Organic contamination in soils associated with6\ncemeteries. J. Soil Contam., 9, 87-97 (2000b).7\n21. Wienrich S. and Speyer J., The Natural Death Handbook, 4th Edition. Rider, London.8\n(2003).9\n22. Young C.P., Blackmore K.M., Reynolds P and Leavens A., Pollution potential of10\ncemeteries: Draft guidance. R&D Report, Environment Agency, Bristol, UK. pp. 22311\n(1999).12\n22\nTable 11\nSample survey questionnaire2\nName and address of burial site(s):\nPostcode of actual burial site (s):\nContact name and\/or email address:\n1. When did the site open for burials?\nWere any environmental surveys done before the site was opened?\nIf so, what was the nature of these?\n2. What is the size of the burial site (acres)? (later converted to hectares)\nApproximately what proportion of this is given over to tree cover?\nAre there any intentions to expand the site?\n3. In total, how many potential i) grave plots are there on the site?\nii) ashes plots are there on the site?\n4. How many burials were there at the site in\n0-5 6-10 11-20 21-50 more\ni) 2004 □ □ □ □ □\nii) 2003 □ □ □ □ □\niii) 2002 □ □ □ □ □\niv) 2001 □ □ □ □ □\n5. How many burials in total have there been to date?\n6. Are graves dug for each coffin, or are multiple coffins interred in single graves?\nIf a mixture of both practices is employed, what proportion of single and multiple graves are dug?\n7. How deep are the graves i) for single coffins?\nii) for two coffins?\niii) for three coffins?\nI’m also trying to establish whether the policy in burial grounds is to encourage more natural practices, or if\nthe rules at burial sites are more prescriptive (and perhaps less flexible).\n8. Which coffin types does the site accept?\n9. What types of memorials are permitted on the site?\n10. What requests are made of funeral directors using the burial site?\n11. Does the site accept embalmed bodies for burial?\n3\n23\nTable 21\nAdapted groundwater vulnerability scoring methodology (adapted from Young C.P., Blackmore K.M., Reynolds P. and Leavens A. 1999)2\n3\nparameter \/ score very low\n1-2\nlow\n3-4\nmoderate\n5-6\nhigh\n7-8\nvery high\n9-10\nclay and silt clay, silt and sand clay, silt, sand and\ngravel\nsand\nsand and gravel\nabsentregolith type\nclay, silt, sand and peat\npeat\n(2-3)\nsuperficial deposits thickness >5 m 3 - 5m 3 m 0 - 3m Absent\nHOST model classification H, I, J, K\n(no significant aquifer or\ngroundwater)\nC, D A, B,\n(aquifer or groundwater\nnormally present at\n>2m depth)\nE F, G\n(aquifer or groundwater\nnormally present within 2m)\nflow mechanism 1 (inter-granular) 2 3 4 5 (fissured)\nAquifer none minor aquifer major aquifer\nSource protection zone outside zone III in zone III close to boundary of\nzones II and III\nwithin zone II within zone I\ndistance from river lines >150 m 80-150 m <80m\n24\nTable 31\nAttributes scores and aggregated total for eight sites2\nsite\nID\nsuperficial\ndeposits\ntype score\nmean\nsuperficial\ndeposits\nscore\nsuperficial\ndeposits\nthickness\nscore\nmean\nthickness\nscore\nHOST\nscore\nmean\nHOST\nscore\nSPZ\nscore\nmean\nSPZ\nscore\naquifer\nscore\nmean\naquifer\nscore\nflow\nscore\nmean\nflow\nscore\ndistance\nfrom river\nscore\nmean\ndistance\nfrom river\nscore\nmean\nscore\n64 9-10 9.5 9-10 9.5 5-6 5.5 1-2 1.5 9-10 9.5 3-4 3.5 1-2 1.5 40.5\n112 9-10 9.5 9-10 9.5 5-6 5.5 3-4 3.5 9-10 9.5 1-2 1.5 1-2 1.5 40.5\n22 7-8 7.5 7-8 7.5 9-10 9.5 1-2 1.5 5-6 5.5 7-8 7.5 1-2 1.5 40.5\n31 7-8 7.5 7-8 7.5 9-10 9.5 1-2 1.5 5-6 5.5 7-8 7.5 1-2 1.5 40.5\n87 9-10 9.5 9-10 9.5 5-6 5.5 1-2 1.5 5-6 5.5 3-4 3.5 5-6 5.5 40.5\n158 7-8 7.5 7-8 7.5 9-10 9.5 1-2 1.5 5-6 5.5 7-8 7.5 1-2 1.5 40.5\n167 7-8 7.5 7-8 7.5 9-10 9.5 1-2 1.5 5-6 5.5 7-8 7.5 1-2 1.5 40.5\n3\n4\n25\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\nFigure 2. Host classification (1-29; A-K) and flow mechanism values to viable aquifers [in squared brackets]30\nand local wells in {curved brackets} (adapted from Boorman D.B., Hollis J.M., and Lilly A.1995).31\n32\nmineral soils\nsubstrate\nhydrogeology groundwater or\naquifer\nno impermeable or\ngleyed layer within\n1.0m\nimpermeable layer\nwithin 1m or gleyed\nlayer at 0.4-1.0m\ngleyed layer within 0.4m\npeat soils\nweakly consolidated,\nmicroporous. By-pass\nflow uncommon (chalk).\n1 [3]\nweakly consolidated,\nmicroporous. By-pass\nflow uncommon\n(limestone).\n2 [3]\nweakly consolidated,\nmacroporous. By-pass\nflow uncommon.\n3 [2]\nstrongly consolidated,\nnon or slightly porous.\nBy-pass flow common.\n4 [5]\nunconsolidated,\nmacroporous. By-pass\nflow very uncommon.\n5 [1]\nunconsolidated,\nmicroporous. By-pass\nflow common.\nnormally present\nat >2m\n6 [4]\n13 B 14 C 15 D\nunconsolidated,\nmacroporous. By-pass\nflow very uncommon\n7 [1]\nunconsolidated,\nmicroporous, by-pass\nflow common\nnormally present\nat ≤2m\n8 [4]\nE\n9, 10 [4] F 11, 12 G\nslowly permeable 16 {5} 18 {5} 21 {5} 24 {5} J 26 {5}\nimpermeable (hard) 17 {5}\nH\n19 {5} 22 {5} 27 {5}\nK\nimpermeable (soft) 20 {4}\nI\n23 {4} 25 {4}\neroded peat 28\nraw peat\nno significant\ngroundwater or\naquifer\n29\nK\n26\n1\n2\nFigure 3. Number of burials per site, 2001-2004 (n= 49 responses)3\n4\n5\n0\n10\n20\n30\n40\n50\n60\n2001 2002 2003 2004\nYear\n%\nbu\nria\nls\nite\ns 0-5\n6-10\n11-20\n21-50\n50+\n27\n1\nFigure 4. Aggregated vulnerability scores and within-score distribution for 30 top scoring natural burial grounds2\n0\n10\n20\n30\n40\n50\n60\n70\n12 15 18 21 22 31 33 34 49 51 59 64 73 83 84 85 86c 87 89 92 112 126 133 145 151 158 167 172 183\nNatural burial ground identifier\nDistance from river lines\nFlow mechanism\nAquifer\nSPZ\nHOST model\nDrift thickness\nDrift type\nHigh\nMedium\nLow\nV\nul\nne\nra\nbi\nlit\ny\nsc\nor\ne\n"}