{"doi":"10.1093\/frebul","coreId":"67598","oai":"oai:eprints.lancs.ac.uk:35516","identifiers":["oai:eprints.lancs.ac.uk:35516","10.1093\/frebul"],"title":"Fleshing out the text : Lassalle’s production of Nathalie Sarraute’s Pour un oui ou pour un non.","authors":["Gomez-Cash, Olga"],"enrichments":{"references":[],"documentType":{"type":0.5555555556}},"contributors":[],"datePublished":"1999","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:35516<\/identifier><datestamp>\n      2017-11-01T00:03:42Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D50:5043<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Fleshing out the text : Lassalle’s production of Nathalie Sarraute’s Pour un oui ou pour un non.<\/dc:title><dc:creator>\n        Gomez-Cash, Olga<\/dc:creator><dc:subject>\n        PC Romance languages<\/dc:subject><dc:date>\n        1999<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:relation>\n        http:\/\/dx.doi.org\/10.1093\/frebul\/20.70.14<\/dc:relation><dc:identifier>\n        Gomez-Cash, Olga (1999) Fleshing out the text : Lassalle’s production of Nathalie Sarraute’s Pour un oui ou pour un non. French Studies Bulletin, 20 (70). pp. 14-15. ISSN 1748-9180<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/35516\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1093\/frebul\/20.70.14","http:\/\/eprints.lancs.ac.uk\/35516\/"],"year":1999,"topics":["PC Romance languages"],"subject":["Journal Article","PeerReviewed"],"fullText":"bibliographical survey of part of Mallarme's house atValvins in 1963 for the late\nCarl Barbier, there was still a copy on Mallarme's library shelves of the Diction-\nnaireportatifd.es rimes francaises, redige d'apres l'Academie par P.-A. Delanneau,\nfondateur de PInstitution Sainte Barbe (Paris: Charles Froment, 1848), xlviii +\n240 pp. (Imprimerie de A. Hiard a Meulan). A small number of pages had not\nbeen cut open (pp. 10-13,132-33).Those wishing to consult this dictionary should\nnote that some libraries, including the BNF, classify Delanneau under Lanneau.\nFLESHING OUT THE TEXT: LASSALE'S PRODUCTION OF\nSARRAUTE'S POUR UN OUIOUPOUR UNNON AT 'LE PETIT\nTHEATRE', LE THEATRE NATIONAL DE LA C0LL1NE\n(10 September-31 October 1998) OLGA GOMEZ, Ormskirk\nJacques Lassalle and his actors have enlarged upon the sparse text and theatrical\ndirections of Pour un oui ou pour un non.' Their production introduced new\nelements into the play: music, emotion, humour, a surrealist touch, a subtle play\nof lighting and a superb handling of pace. Music filled the long silences (there\nwere many more than the three in the stage directions) with which the actors\nmarked out the rift that opens out in the friendship of Hi and H2. This rift,\noccasioned by the drama of words — their intonation, violence, and reper-\ncussions, was thus given substance. Music also extended beyond the conclusion\nof the action.\nThe directions to the actors are limited, and as Rykner has noted, mainly\npertain to voice.2 H2 is required only to shrug his shoulders, to speak 'dans un\nelan', 'piteusement', and 'prenant courage' in turn, and sigh twice, and groan\nonce. To this H2 brought poignant anger and distress. Hi , who in the text is\nmerely once directed to speak softly, was initially cool, cynical, and comical. As\nwith his production of Elle est la and Le Silence at the Theatre du Vieux Colombier,3\nLassalle brought out the humorous elements of the characters' contretemps. Between\nthe two actors, the intensity, humour, and nuances of Sarraute's theatre were\nopened out. This production was a far cry from Doillon's 1988 more faithful\nblack and white TV version, where the actors portray Hi and H2 with consistent\nfurrowed brows. In this play, Hi portrayed his initial exasperation, disbelief, and\ndisdain by rolling his eyes towards the auditorium, colluding with the audience,\ngetting us to laugh with him. It was effective, pushing the humour dangerously\nfar and yet did not undermine the passion and hurt of H2's explanations.\nF., in her auburn dress and matching colour hair, and H3, similarly atonal,\nadded a surrealist touch. All the actors used slow, heavy gestures that created a\ncredible pace and space for the friends' drawn out discussion of the rift caused\nby the phrase 'C'est bien ca'.The ensuing recollection of the catalogue of sleights\nand moments of self-aggrandisement was, however, given a new ending. Hi and\nH2 played with the words ou and non (making them what Gerda Zeltner has\ncalled 'empty categories').4 However, in this production these expressions of\nnegation and affirmation also played with notional markers of a final impasse\nbetween the two.\nA genial touch was the play of lights around the window where the confronta-\ntion turns around, when Hi accuses H2 of also having his role and keeping his\n14 [70]\n at O\npen University on July 12, 2011\nfsb.oxfordjournals.org\nD\now\nnloaded from\n \ndistance by constructing the world of the 'poetic'. This window darkens as the\nplay progresses, as if evening is falling. This subtle indication of the passage of\ntime adds texture, and the strange tropistic world is made tangible. No wonder\nthe packed audience loved the production for as Proust remarked 'L'Amour,\nc'est l'espace et le temps, rendus sensibles'. However, Hi's play with the lamp on\nthe table, directing the light at one time on H2 and then on himself, seemed\nforced.\nCritical discussion on this play and Sarraute's theatrical output in general has\nconcentrated on the effects of the move from writing the tropistic space to\nstaging it, and in particular the question of the inevitable (and for Sarraute and\nsome others, regrettable) naturalism of the theatre. Sarraute's critics have argued\nthat the theatre's inherent narrativity might foreground plot and characteriza-\ntion to the detriment of the tropistic: those fragile and barely conscious aspects\nof human interaction that so easily elude the grasp of language.\nOne great difficulty is that of staging the tropistic world which is described\nimagistically. As Rothenberg argues,5 imagery in the play supplies a plot of sorts.\nRothenberg talks of three types of imagery that work along horizontal and\nvertical axes. He argues that imagery carefully articulates and highlights the\nconflict between the characters. Indeed, the imagery maps out the relationships\nbetween self and other in gradients of distance and hierarchy, providing what\nDeleuze and Guattari call 'territorialites'.6 Sarraute's tropistic world is thus\ndifficult to stage because as Minogue argues the audience of Pour un oui ou pour\nun non is taken from the 'level of realism to the virtualities of the real'.7\nThe decision to flesh out the text with an increased reliance on external action,\nmusic and light could have had the effect of overly naturalizing the play. However,\nLassalle and his actors approached their production with notable sensitivity.\nAugmenting the text with surreal touches and slow gestures, they heightened the\nunreality of the subject matter of the play. By introducing emotional realism and\nmarking the passage of time, they placed it in the real world of human inter-\nrelationships. This production seems to vindicate Rothenberg's assertion8 that\nthe strength of Sarraute's theatre is its exploration of recognizable human\nconflicts.\nThus Lassale created a sumptuous and subtle staging of the tropistic: of the\nmaterial resistance of language, of the social game of identity\/exclusion and the\nemotional gymnastics of interpersonal interaction. This is the terrain that\nSarraute's texts so excellently explore.\n1\n Nathalie Sarraute, Pour un oui ou pour un non (Paris: Gallimard, 1982).2\n Arnaud Rykner, Theatres du Nouveau Roman: Sarraute-Pinget-Duras (Paris: Jose Corn,\n1988), p. 43.\n3\n See John Phillips, 'Le Theatre de Nathalie Sarraute: Un Verbe devenu Chair', FSB, 49\n(Winter 1993), 19-21.\n4\n Gerda Zeltner, 'Quelques remarques sur \"l'art dramatique\" de Nathalie Sarraute',\nDigraphe, 32, 102-07 (P- 107).5\n John Rothenberg, 'Imagery in Sarraute's Pour un oui ou pour un non', FSB, 41 (Winter\n1991\/92), 15-17.\n6\n See Gilles Deleuze et Felix Guattari, L'Anti-CEdipe (Paris: Minuit, 1972\/73).\n7\n Valerie Minogue, 'Voices, Virtualities and Ventriloquism: Sarraute's Pour un oui ou pour un\nnon', French Studies, 49, no. 2 (April 1995), 164-77 (P- 168).\n8\n John Rothenberg, 'Distant voices or mingled ventriloquys in Sarraute's theatre?', FSB, 57\n(Winter 1995), 1-3 (p. 3).\n[70] 15\n at O\npen University on July 12, 2011\nfsb.oxfordjournals.org\nD\now\nnloaded from\n \n"}