{"doi":"10.1016\/S0032-3861(00)00739-4","coreId":"140744","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/803","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/803","10.1016\/S0032-3861(00)00739-4"],"title":"A new reactive polymer suitable for covalent immobilisation and monitoring of\nprimary amines","authors":["Piletska, Elena V.","Piletsky, Sergey A.","Subrahmanyam, S.","Turner, Anthony P. F."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2001-04-01T00:00:00Z","abstract":"A new polymer able to react with primary amines was synthesised from allyl\nmercaptan, o-phtalic dialdehyde and ethylene glycol dimethacrylate by radical\npolymerisation. Reactive thioacetale formed by allyl mercaptan and dialdehyde\ncan bind primary amino groups without additional pre-activation forming\nfluorescent isoindole complex. It gives a great opportunity to monitor binding\nand loading of the amino compounds on the reactive surface. The reactive polymer\nis found to be an effective matrix for immobilisation of the proteins and other\namino containing compounds in affinity chromatography and could be used for\ntheir detection in solution","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140744.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/S0032-3861(00)00739-4","pdfHashValue":"1d993dc025711e5417a2bb8f835aa5c6889fbfa7","publisher":"Elsevier Science B.V., Amsterdam.","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/803<\/identifier><datestamp>2011-10-21T10:58:22Z<\/datestamp><setSpec>hdl_1826_8<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>A new reactive polymer suitable for covalent immobilisation and monitoring of\nprimary amines<\/dc:title><dc:creator>Piletska, Elena V.<\/dc:creator><dc:creator>Piletsky, Sergey A.<\/dc:creator><dc:creator>Subrahmanyam, S.<\/dc:creator><dc:creator>Turner, Anthony P. F.<\/dc:creator><dc:subject>Polymerisable thioacetale<\/dc:subject><dc:description>A new polymer able to react with primary amines was synthesised from allyl\nmercaptan, o-phtalic dialdehyde and ethylene glycol dimethacrylate by radical\npolymerisation. Reactive thioacetale formed by allyl mercaptan and dialdehyde\ncan bind primary amino groups without additional pre-activation forming\nfluorescent isoindole complex. It gives a great opportunity to monitor binding\nand loading of the amino compounds on the reactive surface. The reactive polymer\nis found to be an effective matrix for immobilisation of the proteins and other\namino containing compounds in affinity chromatography and could be used for\ntheir detection in solution.<\/dc:description><dc:publisher>Elsevier Science B.V., Amsterdam.<\/dc:publisher><dc:date>2011-10-11T07:51:51Z<\/dc:date><dc:date>2011-10-11T07:51:51Z<\/dc:date><dc:date>2001-04-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>E. V. Piletska, S. A. Piletsky, S. Subrahmanyam, K. Karim and A. P. F. Turner, A new reactive polymer suitable for covalent immobilisation and monitoring of primary amines, Polymer, Volume 42, Issue 8 , April 2001, Pages 3603-3608<\/dc:identifier><dc:identifier>0032-3861<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/S0032-3861(00)00739-4<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/803<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0032-3861","0032-3861"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2001,"topics":["Polymerisable thioacetale"],"subject":["Article"],"fullText":" 1\nA new reactive polymer suitable for covalent immobilisation and monitoring \nof the primary amines. \n \nE. V. Piletska*, S. A. Piletsky, S. Subrahmanyam, A. P. F. Turner \n \nInstitute of BioScience and Technology, Cranfield University, Cranfield, Bedfordshire, \nMK43 0AL, UK. Tel: + 44(0)1234 754339 ext.3584; Fax: 01234 750907;  \nE-mail: E.Piletska@cranfield.ac.uk \n \nAbstract \nA new polymer able to react with primary amines was synthesised from allyl \nmercaptan, o-phtalic dialdehyde and ethylene glycol dimethacrylate by radical \npolymerisation. Reactive thioacetale formed by allyl mercaptan and dialdehyde can bind \nprimary amino groups without additional pre-activation forming fluorescent isoindole \ncomplex. It gives a great opportunity to monitor binding and loading of the amino \ncompounds on the reactive surface. The reactive polymer is found to be an effective \nmatrix for immobilisation of the proteins and other amino containing compounds in \naffinity chromatography and could be used for their detection in solution. \n \nKeywords: amines, immobilisation, polymerisable thioacetale \n \n_________________________________ \n*Author to whom the correspondence should be addressed \n 2\nIntroduction \nRecently a development of so-called “smart” polymers has attracted the most notice in \nbiotechnology due to their ability to “sense” the change in the environment or ability to \nchange predictably the environment characteristics. “Smart” polymers are used in bio-\nseparation and drug delivery, for the development of new biocatalists, as biomimetic \nactuators and as surfaces with switchable hydrophobic-hydrophilic properties [1]. There \nis a strong interest to “smart” polymers in ecology where environmentally sensitive \npolymer can control or even prevent the bacterial contamination of the solid surfaces in \nnon-sterile environment [2]. Food industry also creates a potentially big market for \n“smart” polymers where they can be used for selective removal of undesirable \ncomponents, separation and analyses [3]. \nThe paper presented here describes a synthesis and analysis of new “smart” \npolymers able to react with primary amines such as ammonia and amino acids, peptides, \nproteins and nucleic acids. The polymer reactivity is based on well-known reaction \nbetween primary amines, o-phtalic dialdehyde (OPA) and β-mercaptoethanol in solution \n[4]. Homologous aromatic dialdehydes such as o-phthaldialdehyde (OPA, P-2331), \nnaphthalene-2,3-dicarboxaldehyde (NDA, N-1138) and anthracene-2,3-dicarboxaldehyde \n(ADA, A-1139) are essentially nonfluorescent until reacted with a primary amine in the \npresence of excess of mercaptan, such as 2-mercaptoethanol, to yield a fluorescent \nisoindole (Figure 1). The increase in fluorescence emission permitted to monitor the \nbinding events and quantify the concentration of primary amino compounds in solution \n[5]. Heterogeneous assay based on amino containing polymer and o-phtalic dialdehyde \nwas used to monitor concentration of mercaptoethanol and sialic acid in solution [6]. \n 3\nDespite of high sensitivity achieved in those studies the necessity to use a \nmulticomponent mixture for analysis limits the method application. Recently the \nsynthesis of new polymer, which contains already two out of three components: \ndialdehyde and mercapto group, necessary for fluorescence complex formation was \ndescribed [7]. An organic soluble reactive polymer containing thioacetale was prepared \nas self-assembled layer on the transducer surface and used as a reactive “reagent-free” \ncoating for the immobilisation of the amino group-containing compound. A big variety of \nthe monomers, which can be used for tuning of the polymer properties, could bring \ndifferent practical applications. Here we describe synthesis and investigation of highly \ncross-linked polymers containing thioacetale. These materials can be used in affinity \nchromatography for protein and DNA immobilisation and in sensor technology for \ndetection of primary amines. \n \n2. Experimental \nAll compounds were obtained from commercial sources and were analytical or \nHPLC grade. Ethylene glycol dimethacrylate, acetonitrile, allyl mercaptan (AM), \nasobis(isobutyronitrile) (AIBN), horseradish peroxidase (HRP), bovine serum albumin \n(BSA), haemoglobin were purchased from Sigma. O-Phtalic dialdehyde (OPA), \ncytochrome C were from Aldrich. Bicinchonic acid (BCA micro reaction kit) was \npurchased from Pierce. Microperoxidase was bought from Biozyme Laboratories (UK). \n2.1. Preparation of the reactive polymer (RP). \nPolymer was prepared by mixing together 10 mmol (1.98 g) of ethylene glycol \ndimethacrylate, 1 mmol (134 mg) of OPA and 2 mmol (148 mg) of AM and acetonitrile \n 4\n(2 ml). Monomer mixture was thoroughly purged with nitrogen. Polymerisation was \ninitiated by adding 50 mg of AIBN and heating overnight at +80°. Polymer was ground \nand washed in acetone. Polymer particles with size 1-5 µm were collected using seaving \nand decantation. \n2.2. Fluorimetry with reactive polymer. \nThe typical experiment was performed as follows: 3 mg of RP was suspended in 3 ml of \n0.1 M sodium phosphate buffer, pH 8.0 and its excitation and emission was measured in \n3 cm3 quartz cuvette using RF-5301 PC Spectrofluorophotometer (Shimadzu, Japan). To \ninvestigate isoindole formation the aliquots of concentrated NH4OH solution was added \nto polymer solution. A change in fluorescence was recorded as function of time \n(excitation wavelength Eex=355 nm). All measurements were made in triplicate. \n2.3. Protein immobilisation. \nThe binding capacity of the polymer was demonstrated with several proteins– \nmicroperoxidase (1 kD), cytochrome C (12.4 kD), HRP (44 kD), BSA (66 kD) and \nhaemoglobin (67 kD). 10 mg of polymer was incubated with 400 µl of protein solution (5 \nmg\/ml) in 10 mM HEPES buffer, pH 8.6 for 18 hours. Protein concentration before and \nafter sorption was measured spectrophotometrically using a BCA method [8] and \ncalculated accordingly to calibration curves made for each protein. \n \n3. Results and discussion \nThe thioacetale-containing polymer was synthesised as described previously [6]. Its \nability to react with primary amines was studied by measuring change in fluorescence \nupon addition of ammonia hydroxide. Fluorescent measurements were carried out with a \n 5\npolymer suspension with the size of the particle 1-5 µm, which has a good stability in \nwater. It was found that the addition of the 23 mM of the NH4OH to the RP suspension \nincreased the excitation and emission intensity in 3 times (Figure 2). The polymer with \nbound amine had an excitation maximum at 347 nm and an emission maximum at 430 \nnm. The kinetics of isoindole formation was the same for heterogeneous and \nhomogeneous reaction (Figure 3). The fluorescence emission increased steadily during 2 \nhours. For practical purposes when faster assay is desirable the signal can be measured in \n30 minutes when its magnitude reached 70% of maximum.  \nDifferent pH and buffer concentrations were used to find optimal conditions for \nthe reaction between RP and primary amines. In reaction with NH4OH it was found that \nthe optimum pH is pH 8.0 (Figure 4). The influence of buffer concentration was less \npronounced. Practically no difference was found for buffers with 10 mM and 200 mM \nconcentrations (data not shown). \n Progressive increase in amine concentration resulted in progressive increase in \nemission intensity (Figure 5a). The calibration curve for NH4OH had a linear range at \nconcentration 1-30 mM. The same results were achieved with other small organic amino \ncontaining compounds such as glycine, creatine and adenosine phosphate (data not \nshown). \n A polymer ability to bind protein molecules was tested in the experiments with \nseveral proteins. The presence of the protein (HRP) in RP suspension also led to \nprogressive increase the fluorescence similar like in case with ammonia hydroxide \n(Figure 6). Due to large size of protein molecules the slower kinetics for this reaction in \ncomparison with low-weight organic amines was observed. It was found that the \ncalibration curve for BSA had a linear range at concentration 0.4-1 mM, which is much \nlower than limit of saturation observed for ammonia hydroxide. The reason for that lies in \n 6\nthe fact that reaction of isoindole formation is reversible and dependent on the binding \nconstant which is proportional to the number of interactions between the polymer and \nanalyte. BSA which has 59 lysine and several other active residues binds to the polymer \nmuch stronger than low-weight amines. Due to this we can explain much higher \nsensitivity of the assay for analyte able to form multipoint interactions with polymer, \nsuch as proteins and nucleic acids. \n The binding capacity of the reactive polymer was estimated by BCA method. The \nprotein concentration after sorption was compared with protein concentration before \nsorption. It was calculated that 1 g of the RP can bind 0.6 mg of the BSA, 0.55 mg \ncytochrome C, 0.2 mg microperoxidase, 0,5 mg HRP and 1 mg haemoglobin (Figure 6). \nThe binding capacity of the RP and sensitivity of the detection based on utilisation of the \nRP therefore depend on the number of amines available- a function of both the protein's \nstructure and its amino acid composition. The immobilisation rate was found comparable \nwith commercial sorbents used for protein immobilisation like activated CN Sepharose \n4B (Pharmacia, Sweden). It suggests that the polymer can be used as effective alternative \nimmobilisation matrix in affinity chromatography for immobilisation of low-weight \norganic amines, proteins and nucleic acids. \nAccordingly the elemental analysis the allyl mercaptan was included in the \npolymer for 42% from the theoretical value.  \nThe polymer described is stable and can be stored at room temperature for 6 \nmonth without loss of activity.  \n \nConclusions \nA new matrix for immobilisation of the amino-containing substances is proposed. Among \nthe advantages of its application are spontaneous immobilisation, high loading and \npossibility to evaluate and detect binding events using fluorescence measurements. Good \nstability and reasonable sensitivity make the RP a suitable material for development of \nchemical sensors with selectivity for primary amines.\n 7\n \n \nCH\nCH\nO\n O\n+   + NH2R1 SH R2 R2N\nS R1\no-Phthaldialdehyde fluorescent isoindole\nO \nOCH\nCH\nR1 SH+   \nCH\nCH\nS\nOH\nR1\n O\nThioacetal\n(I)\n(II)\nThioacetal\nO \nCH\nCH\nS\nOH\nR1\nN\nS R1\nR2R2 NH2+\n(III)\n \n \nFigure 1. Piletska et al. \n 8\n23 mM NH4OH \n15 mM NH4OH \n0 mM NH4OH \nb) \na) \n23 mM NH4OH\n15 mM NH4OH\n0 mM NH4OH \n \n \n \nFigure 2. Piletska et al. \n \n 9\n0\n0,5\n1\n1,5\n2\n2,5\n3\n0 0,25 0,5 0,75 1 1,25 1,5 1,75 2\nTime, h\nI\/\nIo\n, a\n.u\n.\n \n \nFigure 3. Piletska et al. \n 10\n \n \n0.5\n1\n1.5\n2\n2.5\n3\n5 6 7 8 9\npH\nI\/\nIo\n10\n \nFigure 4. Piletska et al. \n \n 11\n \n1\n1,2\n1,4\n1,6\n1,8\n2\n2,2\n2,4\n2,6\n2,8\n0 20 40 60 80 1\nAmmonia concentration, mM\nI\/\nIo\n, a\n.u\n.\na)\n00\n1\n1,02\n1,04\n1,06\n1,08\n1,1\n1,12\n1,14\n1,16\n0,4 0,6 0,8 1,0 1,2 1,4 1,6 1,8 2,0\nBSA concentration, mM\nI\/\nIo\n, a\n.u\n.\nb)\n \nFigure 5. Piletska et al. \n 12\n \n \nbaseline \nbaseline \nHRP 3.3 µM \n \nFigure 6. Piletska et al. \n \n 13\n \n \n0\n0,1\n0,2\n0,3\n0,4\n0,5\n0,6\n0,7\n0,8\n0,9\n1\nMi\ncro\npe\nrox\nida\nse\nCy\ntoc\nhro\nme HR\nP\nBS\nA\nHa\nem\nog\nlob\nin\nQ\nua\nnt\nity\n o\nf p\nro\nte\nin\n, m\ng\/\ng \npo\nly\nm\ner\n \nFigure 7. Piletska et al. \n 14\nFigures captions \n \nFigure 1. Interaction between dialdehyde, mercaptan and primary amine (I), thioacetal \nformation (II), formation of the fluorescent isoindole complex between thioacetal and \nprimary amine (III). R1-SH –polymerasable mercaptan (allyl mercaptan), R2-NH2 – \nprimary amine. \n \nFigure 2. Changes in the emission (a)) and excitation spectra (b)) of the RP as reaction on \npresence of ammonia. \n \nFigure 3. Kinetics of the isoindole formation in presence of the 23 mM ammonia. \n \nFigure 4. Dependence of the RP response from pH. \n \nFigure 5. Dependance of the RP emmision spectra for different amino group containing \ncompounds; a) ammonia hydroxide (concentration 1-100 mM, reaction time - 30 min), b) \nBSA (concentration 0.4-2 mM, reaction time - 30 min). \n \nFigure 6. Changes in the emission intensity of the RP (λexc 355 nm) as response for \nbinding of HRP (reaction time-18h). \n \nFigure 7. Binding capacity of reactive polymer to different proteins. \n \n 15\nLiterature \n \n1. Galaev IY, Mattiasson B. Trends in biotechnology 1999; 17 (8): 335-340. \n2. Ista LK, PerezLuna VH, Lopez GP, Applied and Environmental Microbiology 1999; \n65 (4): 1603-1609. \n3. Whitcombe MJ, Alexander C, Vulfson EN, Trends in Food Science and Technology \n1997; 8 (5): 140-145. \n4. Simons S. Jr. et al., J. Org. Chem. 1978; 43 (14): 2886-2896. \n5. Dai F, Burkert VP, Singh HN, Hinze WL. Microchemical Journal 1997; 57 (2): 166-\n198. \n6. Piletsky SA, Piletskaya EV, Yano K, Kugimiya A, Elgesma AV, Levi R, Kahlov U, \nTakeuchi T, Karube I, Panasyuk TI, El’skaya AV, Analytical Letters 1996; 29 (2): \n157-170. \n7. Piletsky SA, Piletska OV, Weston D, Cullen D, Schedler U, Turner APF. Patent \napplication No. 9909245.4, filing date 22.04.99. \n8. Osnes T, Sandstad O, Skar V, Osnes M, Kierulf P, Scandinavian journal of clinical & \nlaboratory investigation 1993; 53 (7): 757-763. \n \n \n \n \n \n \n"}