{"doi":"10.1109\/IEMDC.2005.195963","coreId":"54442","oai":"oai:eprints.lincoln.ac.uk:2581","identifiers":["oai:eprints.lincoln.ac.uk:2581","10.1109\/IEMDC.2005.195963"],"title":"A H2 PEM fuel cell and high energy dense battery hybrid energy source for an urban electric vehicle","authors":["Schofield, N","Yap, H T","Bingham, C M"],"enrichments":{"references":[{"id":967026,"title":"[2] Thematic Network on ‘Fuel Cells, Electric and Hybrid Vehicles (ELEDRIVE)’, a Network funded under Framework V, Contract No.","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":968246,"title":"A new approach to empirical electrical modelling of a fuel cell, an electrolyser or a regenerative fuel cell”,","authors":[],"date":"2004","doi":"10.1016\/j.jpowsour.2004.02.018","raw":null,"cites":null},{"id":966920,"title":"A state-of-the-art review and database of fuel cells and their application in electric vehicles useful for education needs”,","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":967981,"title":"Fuel Cell Handbook”,","authors":[],"date":"1989","doi":null,"raw":null,"cites":null},{"id":967717,"title":"Fuel Cell Systems, Technical Information,","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":967525,"title":"Hybrid energy\/power sources for electric vehicle traction systems’,","authors":[],"date":"2004","doi":"10.1109\/vppc.2005.1554530","raw":null,"cites":null},{"id":967282,"title":"Regenerative braking for all-electric and hybrid electric vehicles”, IMechE Conf. Braking","authors":[],"date":"2002","doi":"10.1504\/ijehv.2011.044370","raw":null,"cites":null},{"id":968966,"title":"The sodium\/nickel chloride (ZEBRA) battery”,","authors":[],"date":"2001","doi":"10.1016\/s0378-7753(01)00891-6","raw":null,"cites":null},{"id":969206,"title":"Time \/ s B at te ry te rm in al v o lta ge \/","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":968746,"title":"Zebra battery meets USABC goals”,","authors":[],"date":"1998","doi":"10.1016\/s0378-7753(98)00015-9","raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2005","abstract":"Electric vehicles are set to play a prominent role in addressing the energy and environmental impact of an increasing road transport population by offering a more energy efficient and less polluting drive-train alternative to conventional internal combustion engine (ICE) vehicles. Given the energy (and hence range) and performance limitations of electro-chemical battery storage systems, hybrid systems combining energy and power dense storage technologies have been proposed for vehicle applications. The paper discusses the application of a hydrogen fuel cell as a range extender for an urban electric vehicle for which the primary energy source is provided by a high energy dense battery. A review of fuel cell systems and automotive drive-train application issues are discussed, together with an overview of the battery technology. The prototype fuel cell and battery component simulation models are presented and their performance as a combined energy\/power source assessed for typical urban and sub-urban driving scenario","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/54442.pdf","fullTextIdentifier":"http:\/\/eprints.lincoln.ac.uk\/2581\/1\/schofield_2.pdf","pdfHashValue":"02800f630eae0609a5f5e27c5d58bb914c590054","publisher":"Institution of Electronic and Electrical Engineering","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lincoln.ac.uk:2581<\/identifier><datestamp>\n      2010-05-27T09:27:32Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F48:6A6163735F48363130<\/setSpec><setSpec>\n      74797065733D636F6E666572656E63655F6974656D<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lincoln.ac.uk\/2581\/<\/dc:relation><dc:title>\n        A H2 PEM fuel cell and high energy dense battery hybrid energy source for an urban electric vehicle<\/dc:title><dc:creator>\n        Schofield, N<\/dc:creator><dc:creator>\n        Yap, H T<\/dc:creator><dc:creator>\n        Bingham, C M<\/dc:creator><dc:subject>\n        H610 Electronic Engineering<\/dc:subject><dc:description>\n        Electric vehicles are set to play a prominent role in addressing the energy and environmental impact of an increasing road transport population by offering a more energy efficient and less polluting drive-train alternative to conventional internal combustion engine (ICE) vehicles. Given the energy (and hence range) and performance limitations of electro-chemical battery storage systems, hybrid systems combining energy and power dense storage technologies have been proposed for vehicle applications. The paper discusses the application of a hydrogen fuel cell as a range extender for an urban electric vehicle for which the primary energy source is provided by a high energy dense battery. A review of fuel cell systems and automotive drive-train application issues are discussed, together with an overview of the battery technology. The prototype fuel cell and battery component simulation models are presented and their performance as a combined energy\/power source assessed for typical urban and sub-urban driving scenarios<\/dc:description><dc:publisher>\n        Institution of Electronic and Electrical Engineering<\/dc:publisher><dc:date>\n        2005<\/dc:date><dc:type>\n        Conference or Workshop contribution<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/2581\/1\/schofield_2.pdf<\/dc:identifier><dc:identifier>\n          Schofield, N and Yap, H T and Bingham, C M  (2005) A H2 PEM fuel cell and high energy dense battery hybrid energy source for an urban electric vehicle.  In: Electric Machines and Drives, 2005 IEEE International Conference on, 15-15 May 2005, San Antonio, TX, USA.  <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1109\/IEMDC.2005.195963<\/dc:relation><dc:relation>\n        10.1109\/IEMDC.2005.195963<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lincoln.ac.uk\/2581\/","http:\/\/dx.doi.org\/10.1109\/IEMDC.2005.195963","10.1109\/IEMDC.2005.195963"],"year":2005,"topics":["H610 Electronic Engineering"],"subject":["Conference or Workshop contribution","PeerReviewed"],"fullText":" A H2 PEM Fuel Cell and High Energy Dense Battery Hybrid Energy \nSource for an Urban Electric Vehicle \n \nN. Schofield1#, H. T. Yap1 and C. M. Bingham2 \n \n1#School of Electrical and Electronic Engineering, University of Manchester, M60 1QD, UK. \n2Department of Electronic and Electrical Engineering, University of Sheffield, S1 3JD, UK \n# Corresponding Author \n \n \nAbstract - Electric vehicles are set to play a prominent \nrole in addressing the energy and environmental impact of \nan increasing road transport population by offering a more \nenergy efficient and less polluting drive-train alternative to \nconventional internal combustion engine (ICE) vehicles.  \nGiven the energy (and hence range) and performance \nlimitations of electro-chemical battery storage systems, \nhybrid systems combining energy and power dense storage \ntechnologies have been proposed for vehicle applications.  \nThe paper will discuss the application of a hydrogen fuel \ncell as a range extender for an urban electric vehicle for \nwhich the primary energy source is provided by a high \nenergy dense battery.  A review of fuel cell systems and \nautomotive drive-train application issues are discussed, \ntogether with an overview of the battery technology.  The \nprototype fuel cell and battery component simulation \nmodels are presented and their performance as a combined \nenergy\/power source assessed for typical urban and sub-\nurban driving scenarios. \n \n \nI. INTRODUCTION \n \n The impetus for more environmentally friendly road \nvehicles and alternative road vehicle energy conversion \nhas fostered research and development in electrically \npowered vehicles for road transport applications since \nthe late 1980’s.  This is particularly the case for medium \nto heavy-duty vehicles where some additional \npropulsion system mass is not as critical as for smaller \npassenger vehicles.  Further, in recent years, fuel cell \nsystems have also been proposed as a potential energy \ncarrier, and the most suitable alternative likely to \ndisplace petroleum based fuels during the first half of \nthis century [1,2].  Whilst there are many technical and \nresource management issues associated with the \ndisplacement of petroleum fuels for transportation, and \nthe commensurate supply infrastructure requirements, \nthis paper will discuss some of the application issues \nassociated with the implementation of hybrid energy \nsources for electric and fuel cell vehicles.  Specifically, \nthe paper will report on initial drive-train design results \nfrom a research programme investigating the utility of \nan electric Taxi supplied via a high energy dense electro-\nchemical battery and hydrogen fuel cell range extender \nfor inner city operation. \nThe aims of the research programme are to investigate \nand address the principal technical difficulties associated \nwith the future commercial application of fuel cell \ntechnologies in electric vehicle traction drive-trains.  As \nsuch, a zero emission London taxi powered via two high \npeak power (32kW), high temperature, ZEBRA batteries \nand a 6kW, hydrogen, Proton Exchange Membrane fuel \ncell (PEMFC) system, is being developed for vehicle \npower-train test evaluation, as illustrated in Fig. 1 \nshowing the vehicle and drive-train layout schematic.  \nThe prime mover for the taxi is a brushless permanent \nmagnet (pm) machine and integrated gear reduction and \ndifferential drive to the vehicle back-axle.  The pm \nmachine is controlled via a three phase voltage source \nconverter, the dc supply to which is provided by the \ntraction battery and fuel cell via a dc:dc converter.  The \nvehicle on-board hybrid energy source will allow the \nPEMFC to operate predominantly at a steady power, and \nat power levels associated with optimal fuel energy \nconversion efficiency, with the battery acting to buffer \npeak loads, recover vehicle braking energy and provide \nthe bulk energy demand.  Hence, the fuel cell operates \nprimarily in a range extension function. \n \n(a)  London Taxi\n \n  (b) Drive-train schematic \nFig.1. Hydrogen fuel cell-high energy dense battery electric London \nTaxi and drive-train layout schematic. \n \nThe paper will review fuel cell systems and discuss \nautomotive drive-train application issues, together with \nan overview of the battery technology.  The regulation \nof the traction battery and fuel cell when subject to the \ndynamic power loading illustrated in Fig. 2(b), \n \n \nZebra\nTraction\nBattery\nControl\n&\nisoln .\nCooling\nCharger\nPAS pump\nHV DC linkTraction motor,\ngear-stage and\ndifferential\nCabin\nheater\nVehicle Management Unit\nand Data Acquisition\nBrake\nvacuum\nto cabin\nheater\ncooling\ncooling\nFuel cell\nH2 tank\n12V\nAux .\n≈\n0-7803-8987-5\/05\/$20.00 ©2005 IEEE. 1793\n necessitates detailed modelling to assess the \nfunctionality of the individual components once \ninterconnected within the drive-train.  Hence, the \nprototype fuel cell and battery component simulation \nmodels are presented and their performance as a \ncombined hybrid energy source assessed for typical \ndynamic urban and sub-urban driving duty cycle \nscenarios.  It is shown that the fuel cell and battery \ncombination are complementary for such duty loading, \nextending the vehicle range whilst minimising the \ninstalled fuel cell power. \n \n \nII. VEHICLE ENERGY AND POWER REQUIREMENTS \n \nFor road vehicle applications, the on-board energy \nand power sources must satisfy the load demand of the \nvehicle traction drive-train.  The decision as to whether \nthe energy storage medium supplies all of the vehicle \nload or simply the average power requirements can \nsignificantly influence the sizing of the vehicle \nenergy\/power systems and hence system cost.  The \ndifficulty in making this assessment is in choosing the \nmost appropriate duty rating specification for the \nvehicle.  For example, Fig. 1 illustrates a typical 2.5 \ntonne urban electric vehicle, a London Taxi, which is the \nreference vehicle for the study.  The power required to \npropel the vehicle over the NEDC driving cycle, Fig. \n2(a), that comprises of 4x enhanced European \nCommission R15.04 (ECE15) urban cycles and 1x EC \nsub-urban cycle [1,2], is detailed in Table I, showing a \nwide disparity in peak-to-average power requirements, \ni.e. 17:1 and 4:1 for the urban and sub-urban profiles \nrespectively. \n \nTable I.  Vehicle power requirement. \nDriving \ncycle \nPower condition Cycle \ntime (s) \nRange \n(km) \nPower \n(kW) \nMax. motoring 70.35 \nMax. regenerating -16.16 ECE15 \nAverage \n195 1.13 \n4.21 \nMax. motoring 57.84 \nMax. regenerating -38.83 Sub-urban \nAverage \n400 6.96 \n14.57 \nNEDC Average 1180 11.47 7.72 \n \nThe data in Table I is calculated via solution of the \nvehicle kinematics [3] with the NEDC linear velocity \ndriving cycle of Fig. 2(a).  The vehicle parameter data \nfor the Taxi is given in Appendix I.  The vehicle \ndynamic power profile calculated over the NEDC \ndriving cycle is illustrated in Fig. 2(b), and used for \nsubsequent vehicle performance assessment.  There is \nalso a similar disparity in the vehicle peak-average \npower for other driving (or duty) cycles, i.e. the \nHighway fuel economy test schedule (HWFET), US \n1975 schedule (FTP75) and Japanese 11-mode test \nschedule, hence the potential to over-size the vehicle \nenergy source for single source systems, as discussed in \n[4].  Note, that whilst all sources are a source of energy, \nreference is made here to energy and power to \nemphasise the functionality of the vehicle on-board \nsources with respect to the vehicle energy management \nphilosophy. \n (a)  NEDC (4x ECE15 + sub-urban) driving cycle \n (b)  Vehicle power vs. time \nFig.2. Vehicle linear velocity and associated dynamic power \nrequirements for the London Taxi. \n \n \nIII. FUEL CELLS FOR TRANSPORTATION \n \nA.  Background \n A major advantage of fuel cell powered vehicles is the \ndevelopment of cleaner, more energy efficient cars, \ntrucks, and buses that can initially operate on \nconventional fuels via local reformation, i.e. gasoline \nand diesel, whilst enabling the technology platform for a \nfuture move to renewable and alternative fuels, i.e. \nmethanol, ethanol, natural gas, and other hydro-carbons, \nand ultimately hydrogen, a particularly significant issue \nwhen considering the infrastructure and support \nrequirements of a modern transportation network. \nWith on-board fuels other than pure hydrogen, for \nexample, natural gas, methanol and gasoline, the fuel \ncell systems could use an appropriate fuel processor to \nconvert the fuel to hydrogen.  Since the fuel cell relies \non chemistry and not combustion, local emissions from \nthis type of a system should, potentially, be much \nsmaller than emissions from the cleanest fuel \ncombustion process emissions, whilst offering the \nadvantages of an electric transmission.  However, in \ntraction systems, fuel cells have major operational \ndisadvantages in turns of their voltage regulation and \ninability to accept vehicle kinetic energy during braking \n-40\n-20\n0\n20\n40\n60\n80\n0 200 400 600 800 1000 1200\nTime (s)\nPo\nw\ner\n \n(k\nW\n)\n0\n20\n40\n60\n80\n100\n120\n140\n0 200 400 600 800 1000 1200\nTime (s)\nLi\nn\nea\nr \nv\nel\no\nci\nty\n \n(k\nm\n\/h\nr)\nECE15\nSub-urban\n1794\n [5,6], hence the consideration of a hybrid energy\/power \nsource. \nFor the taxi vehicle test platform, 2x 3kW PEM fuel \ncells have been chosen to provide a background energy \ninput, essentially acting as a vehicle range extender.  The \nfuel cells are prototype systems developed by MES-\nDEA, Switzerland [5], and are designed to realise a very \ncompact, lightweight and simple fuel stack.  The stack \nhas separate forced air flow systems for cooling and \nreaction air supply, operate close to ambient pressure on \nthe cathode for seal integrity, have a modular layout, but \nmost significantly, has no auxiliary humidification \ncomponents.  A microprocessor manages the associated \ncooling and air flow fans, steering electronics for \nmembrane hydration, main and purge valves.  Fig. 3 \nillustrates the 3kW prototype fuel cell system and \ncontrol electronics, the main specification details of \nwhich are given in Appendix I [5]. \nFig.3. Prototype fuel cell system and control electronics [5]. \n \nB.  Fuel Cell Modelling \nAs with electro-chemical batteries, fuel cells exhibit \nnon linear performance characteristics that can \nsignificantly influence vehicle drive system operation \nand component optimisation if not considered at the \nsystem design stage.  The three main fuel cell loss \nmechanisms, can be summarised as: \n• irreversible\/activation polarisation loss, \n• concentration polarisation loss , and \n• ohmic or resistance polarisation. \nThe influence of these loss mechanisms on fuel cell \nperformance is illustrated in Fig. 4, showing measured \nfuel cell voltage and power output as a function of cell \ncurrent density (or load current).  The fuel cell can be \nmodelled by a semi-empirical equation as discussed in \n[7] for which parameters are calculated through an \nidentification process with experimental data, viz.: \n \n \n(1) \n The equation terms are derived from the associated \nNernst, Tafel and Ohm’s laws, where Vcell is the fuel cell \nterminal voltage Eo is the steady open-circuit voltage, b \nis the Tafel’s parameter for oxygen reduction, J the \ncurrent density, Rint the cell ohmic resistance and k1 and \nk2 diffusion parameters.  Whilst the model is not \nuniversal with regard to the fuel cell fundamental \nchemistry, it is much simpler in form and represents the \nmain voltage loss components.  Each term in (1) is \ndominant in each region of the V-J characteristic.  In \nregion A, the cell voltage decreases drastically due to the \noxygen electrochemical activation reactions, where the \nlogarithm term has the main influence.  In region B, the \ncurve is roughly linear, i.e. essentially ohmic resistive \nlosses, and Region C corresponds to diffusion losses, i.e. \nexponential term.  The five parameters in (1) depend on \ncell temperature and gas pressures. However, for the fuel \ncell stack considered, the stack temperature is tightly \nregulated via forced ventilation and the stack pressure is \nfixed to 1.4bar.  Fig. 4 shows measured voltage \nregulation and power capacity with load current for a \n3kW MES-DEA fuel cell. \n \nFig.4.  Measured voltage and power data for \nMES-DEA H2 PEM fuel cell [2]. \n \nFig.5.  Measured fuel cell stack hydrogen-to-electrical \nenergy efficiency with output load. \n \nFor modelling purposes, implementation of (1) can be \nproblematic at zero current; hence a simpler quadratic fit \nto the measured data of Fig. 3 is used: \n \n \n(2) \nwhere Vcell is the fuel cell terminal voltage per cell, and J \nthe cell current density.  The fuel cell terminal voltage is \nused in conjunction with the measured stack fuel-to-\nelectrical conversion efficiency, as illustrated in Fig. 5, \nto simulate operation and predict performance.  Again, a \n( ) ( ) ( )Jkocell ekJRJbEV 21intln −−−=\n \n10\nk\n9\nj\n8\ni\n7\nh\n6\ng\n5\nf\n4\ne\n3\nd\n2\ncbacell\nJ k  J k  J k  J k  J k  J k             \n J k  J k  J k  J k  k  V\n+++++\n+++++=\n \n0\n10\n20\n30\n40\n50\n60\n70\n0 500 1000 1500 2000 2500 3000 3500 4000\nLoad power (W)\nSt\nac\nk \nef\nfic\nie\nn\ncy\n \n( %\n)\n0.00\n0.10\n0.20\n0.30\n0.40\n0.50\n0.60\n0.70\n0.80\n0.90\n1.00\n0.0 0.2 0.4 0.6 0.8 1.0 1.2 1.4\nCurrent density \/ Acm -2\nA\nv\ner\nag\ne \nv\no\nlta\nge\n \npe\nr \nce\nll \n\/ V\n0.00\n0.07\n0.14\n0.21\n0.28\n0.35\n0.42\n0.49\n0.56\n0.63\n0.70\nPo\nw\ner\n \no\nu\ntp\nu\nt p\ner\n \nce\nll \n\/W\ncm\nVoltage\nPower\n-\n2Activation polarisation(reaction rate loss)\nConcentration polarisation\n(gas transport loss)\nOhmic polarisation\n(resistance loss)\nPeak power\nRegion A Region B Region C\nForced air\ncooling\nElectronic\ncontrol unit\nO2 \/air inlet\nH2 inlet\nElectrical power\nconnections\n1795\n curve fit to the measured data of Fig. 5 is used in the fuel \ncell model: \n \n \n(3) \nwhere \u0001 is the fuel efficiency and P% the fuel cell per \nunit load power, and the parameter values for (2) and (3) \nare as given in Appendix I. \n \nC. Fuel Cell Operation  \nFor road vehicle applications, the fuel cell (FC) \nsystem must satisfy or contribute to the load demand of \nthe vehicle traction drive-train.  The decision as to \nwhether the FC system supplies all of the vehicle load or \nsimply the average energy requirements can \nsignificantly influence the sizing of the FC system and \nhence the FC system cost.  A vehicle supplied solely via \nfuel cells would necessitate operation at low current \ndensities (and hence over-sizing of the FC) to minimise \nthe voltage swing on the dc supply to the vehicle traction \nsystem.  Hence, the taxi vehicle considered were the \nvariation in peak-average power demand is 17:1 and 4:1 \nrespectively for urban and sub-urban driving, the fuel \ncell system would have to be rated much higher than the \npeak power specified.  Additionally, since fuel cells \ncannot accept vehicle kinetic energy during braking, \nsome form of transient power buffer can significantly \nreduce the installed fuel cell power capacity [4].  Note, \nthe time-transient response of the FC fuelling also \nfosters FC operation in a hybrid-energy source \nconfiguration. \nThere are, therefore, clear benefits in terms of FC size \nand the recovery of vehicle regenerative braking energy \nfor operation of FC systems in hybrid energy source \nconfigurations, where the FC supplies the vehicle \naverage energy, or provides a range extension\/battery \nsupport function, in combination with a peak power \nbuffer, such as supercapacitor or, as for the taxi, a higher \npower dense battery. \n \n \nIV.  VEHICLE TRACTION BATTERY \n \nA. Background \nThe ZEBRA technology is a serious candidate to \npower future electric vehicles since it not only has an \nenergy density ~2.5x that of lead acid batteries (50% \nmore than NiMH) but also has a relatively flat Peukert \ncharacteristic from 0 to 80% depth-of-discharge (DOD), \nhas good power density for acceleration and acceptance \nof regenerative energy, no maintenance, essentially \nintolerant to external temperature ambient, safety and \nfault tolerance, and, perhaps of greatest significance for \nthe automotive sector, the potential for low cost in \nvolume manufacture.  Originally developed by Beta \nR&D in the UK, the ZEBRA battery technology is now \nowned and manufactured by MES-DEA, Switzerland.  \nCommercialisation of the battery has made considerable \nprogress in recent years, particularly in the automation \nof assembly and component optimisation.  Production is \n2000 batteries per year with planned staged increases in \ncapacity to 33,000 batteries, and with space available on \nsite for a further expansion to a maximum of 100,000 \nbatteries [8].  The ZEBRA battery system has been used \nin many applications, including electric vehicles.  So far, \nthe batteries had been installed in cars, buses and vans \nfrom Mercedes, BMW, Opel, VW, Renault, Fiat, MAN, \nEvobus, IVECO, Larag and Autodromo [9]. \nFor the taxi traction system, a nominal dc link of \n550V was chosen to minimise the electrical power \ndistribution mass and fully utilise the traction inverter \nsilicon volt-ampere rating.  The dc link voltage is \nrealised via 2x Z5C traction batteries, Fig. 6, electrically \nconnected in series, details of which are given in \nAppendix I [10]. \n \nFig.6. ZEBRA Z5C Traction battery. \n \nB. Zebra Battery Simulation Model \nElectric vehicle traction duties are typified by high \npower discharge\/charge rates for vehicle acceleration \nand braking demands respectively [3,4], as illustrated by \nFig. 2(b).  Since the traction battery supplies the vehicle \ntraction drive-system, the battery voltage regulation with \nload current is an important aspect of vehicle operation \nand system performance modelling.  Simulation of the \nZEBRA battery is facilitated via a detailed analytic \nmodel employing non-linear open-circuit terminal \nvoltage and resistance characteristics derived from cell \nexperimental test data provided by Beta R&D.  Since the \nbattery dynamic current loadings are of a relatively low \nfrequency (<100Hz for the NEDC cycle), the battery \nequivalent circuit model can be simplified to that \nillustrated in Fig. 7(a).  The open-circuit terminal \nvoltage of the battery depends on battery state-of-charge \n(SoC), or discharged ampere-hour, and is found to be \nindependent of load current, Fig. 7(b).  The specified \nmaximum discharge ampere-hour (Ah) capacity is taken \nfrom the manufacturer’s nameplate capacity and \ncollaborated via a series of Peukert tests.  The battery \ninternal resistance is similarly determined from test and \nis a function of discharged Ah and charging\/discharging \ncurrent rate, Fig. 7(c). \nAs with the fuel cell model, functions for the ZEBRA \nbattery open-circuit voltage and internal resistance are \nderived from curve-fits to measured battery test data.  \nThese analytic expressions thus improve on simulation \ntime when solving multiple component drive-train \nmodels.  The curve fit equations and battery model \nparameters are given in Appendix II. \n P a  P a  P a  P a P a  a  2.5%f\n2\n%e\n1.5\n%d%c\n0.5\n%ba +++++=η\n1796\n (a) Battery equivalent circuit \n(b) Battery cell open-circuit voltage  \n(c) Battery cell internal resistance  \nFig.7.  ZEBRA Z5C battery cell equivalent circuit model and model \nparameter characteristics. \n \nC. Lead-acid Battery Simulation Model \nAs a comparison of two vehicle battery technologies \nat the initial vehicle component assessment and \nspecification stage, a similar model is implemented for a \nsealed lead-acid battery, as discussed in [4].  The lead-\nacid battery details are provided in Appendix I. \n \n \nV.  VEHICLE PERFORMANCE EVALUATION \n \nAs previously discussed, the two major operational \nproblems with fuel cell systems in electric vehicle drive-\ntrains is their poor regulation with load, Fig. 4, and \ninability to accept regenerative currents which, if \nallowed, would result in excessive chemical fatigue of \nthe stack membranes and hence reduced life-time [5].  \nConsequently, if the fuel cell system mass and volume is \nto be kept within limits commensurate with their utility \nin the drive-train, some form of peak power buffering is \nnecessary and hence a hybrid energy source for the \nvehicle. \nThe energy management strategy considered for the \ntaxi vehicle is one where the fuel cell provides a range \nextension function supplementing the battery energy, \nwhilst allowing all dynamic power demands to be taken \nby the battery.  As an assessment of the on-board energy \nsources the taxi performance was evaluated via two duty \nloading regimes, viz.: \n• repetitive ECE15 cycles, i.e. inner city driving, and \nthe more energy demanding, \n• repetitive NEDC cycles. \n \nThe battery management strategy chosen ensures \noperation within nameplate voltage and current limits, \nthe minimum voltage limit dictating actual energy \nutilisation, and hence operating time and range.  The fuel \ncell utilisation was constrained by the quoted on-board \nhydrogen storage.  However, the fuel cell stack was \nconsidered as providing a light mean supply of 2kW and \na mean supply of 4kW, hence, operating over the most \nenergy conversion efficient region of the stack, Fig. 5.  \nA number of case studies were considered; Cases 1-4 \nbeing for pure battery mode and comparing the ZEBRA \nand more common sealed lead-acid technologies; Cases \n5 and 6 assess the performance of the combined ZEBRA \nbattery and fuel cell source.  Part (i) of Table II provides \nthe test conditions and battery details for each case, \nwhilst parts (ii) and (iii) give the simulated data for the \ntwo duty cycle regimes. \n \nA. Pure battery electric mode \nFor both duty regimes, Case 1 gives results for the \nZEBRA battery, whilst Case 2 compares the lead-acid \nperformance for the same battery mass as that of the \nZEBRA, Case 3 for the same battery volume and Case 4 \nfor the same nameplate energy.  These results clearly \nhighlight the benefits of the ZEBRA battery in terms of \nmass and volume, showing an increased range of 2.4x \nbased on mass and 1.4x based on volume.  From a \nvehicle system point of view, minimisation of vehicle \non-board mass is the primary goal since this equates to \ndrive-train peak power rating.  Whilst component \nvolume is important, it is not as critical for the taxi \nexample given the available vehicle space envelope.  \nThe result of Case 4 has been included for interest, but \nsuch a mass impact would compromise the vehicle \nfunctionality by significantly limiting passenger \npayload.  It is worth noting that the lead-acid simulation \nassumed a constant battery coolant ambient of 20°C \nwhich would, in practice, necessitate a thermal \nmanagement system, figures for which are not included \nin the mass and volume audits.  Fig. 8 illustrates \nsimulated battery terminal voltage variation for the \nrepetitive NEDC duty loading, for the Zebra battery (a), \nand the lead-acid battery (b), corresponding to Cases 1 \nand 2 respectively. \n \nB. Fuel cell and battery hybrid source \nCases 5 and 6 compare vehicle performance with a \nmean fuel cell input of 2 and 4kW respectively.  The \nresults of Table II demonstrate the benefit of the \nadditional energy source in extending the vehicle range, \nin both cases by a factor of 2, making the vehicle \noperating times and range attractive for fleet taxi \nschemes. \n \nEoc\nRint\nVterminalEoc fn (SOC)\n1.8\n1.9\n2\n2.1\n2.2\n2.3\n2.4\n2.5\n2.6\n2.7\n0 5 10 15 20 25 30 35\nDischarged Ah \/ Ah\nBa\ntte\nry\n \nO\npe\nn\n-\nCi\nrc\nu\nit \nV\no\nlta\nge\n \n\/ V\n0\n5\n10\n15\n20\n25\n30\n35\n40\n0 5 10 15 20 25 30 35\nDischarge Ah \/ Ah\nIn\nte\nrn\na\nl R\ne\nsis\nta\nn\nc\ne\n \n\/ m\nI = 32.0A\n I = 16.0A\nI = 10.7A\nI = 8.0A\nI = 6.4A\n1797\n Table II.  Vehicle performance evaluation \n(i)  Test conditions \nTotal battery \nCa\nse\n \nBattery Battery \nrated \ncapacity \n(Ah) \nTotal \nbattery \nNo \nVolume \n(l) \nMass \n(kg) \n1 Z5C 66.0 2 266.4 390.0 \n2 Pb-acid 31.3 36 157.6 390.0 \n3 Pb-acid 52.9 36 266.4 658.4 \n4 Pb-acid 73.5 36 365.0 914.8 \n5 Z5C+FC 66.0 2 266.4 390.0 \n6 Z5C+FC 66.0 2 266.4 390.0 \n(ii)  Repetitive ECE15 cycles \n \nBattery Ave. FC \npower \n(kW) \nTime \nduration \n(hrs) \nRange \n(km) \n1 Z5C 0 5.79 126.7 \n2 Pb-acid 0 2.48 51.7 \n3 Pb-acid 0 4.22 87.9 \n4 Pb-acid 0 5.75 119.9 \n5 Z5C+FC 2 10.46 218.0 \n6 Z5C+FC 4 11.95 249.0 \n(iii)  Repetitive NEDC cycles \n \nBattery Ave. FC \npower \n(kW) \nTime \nduration \n(hrs) \nDistance \n(km) \n1 Z5C 0 3.42 119.8 \n2 Pb-acid 0 1.58 32.9 \n3 Pb-acid 0 2.56 89.8 \n4 Pb-acid 0 3.42 119.8 \n5 Z5C+FC 2 4.63 161.9 \n6 Z5C+FC 4 6.92 242.2 \n     \nPer cycle values Duration (s) Distance (km) \nECE15 195 1.129 \nNEDC 1180 11.471 \n \n(a) ZEBRA battery \n(b) Lead-acid battery \nFig.8.  Simulated battery terminal voltage vs. time \nfor repetitive NEDC duty cycles. \nVI.  CONCLUSIONS \n \nThe paper has reviewed fuel cell systems for \ntransportation and discussed the main application issues \nin automotive drive-trains, specifically their poor voltage \nregulation with load and inability to accept regenerative \nbraking energy.  A detailed model of a prototype fuel \ncell and ZEBRA traction battery suitable for vehicle \nperformance simulation has been presented and vehicle \nperformance assessed for various battery and fuel cell \ncombinations, and for typical dynamic urban and sub-\nurban driving duty cycle regimes.  It has been shown \nthat the fuel cell and battery combination are \ncomplementary for such duty loading, extending the \nvehicle range whilst minimising the installed fuel cell \ncapacity.  The results demonstrate the utility of \ncombining energy and power sources for electric vehicle \npropulsion. \n \nACKNOWLEDGMENTS \n \nThe authors acknowledge the support of the UK \nEngineering and Physical Science Research Council \n(EPSRC), via Grant No. GR\/S81971\/01; SEMELAB \nPLC, UK, for provision of a research studentship and \nBeta R&D, Derby, UK, for provision of test data and \ntechnical information. \n \nREFERENCES \n \n[1] N. Schofield, H.T. Yap, G. Maggetto, P. Van den Bossche, and \nJ. Van Mierlo, “A state-of-the-art review and database of fuel \ncells and their application in electric vehicles useful for \neducation needs”, Proc. 10th European Conf. on Power \nElectronics and Applications (EPE2003), CD ROM, Paper 906, \npp. 1-10, Sept. 2003. \n[2] Thematic Network on ‘Fuel Cells, Electric and Hybrid Vehicles \n(ELEDRIVE)’, a Network funded under Framework V, \nContract No. ENK6-CT-2000-20057, Project No. NNE5-1999-\n20036. \n[3] N. Schofield, C.M. Bingham, and D. Howe, “Regenerative \nbraking for all-electric and hybrid electric vehicles”, IMechE \nConf. Braking 2002, Leeds, UK, pp. 175-183, July 2002. \n[4] H.T. Yap, N. Schofield, and C.M. Bingham, “Hybrid \nenergy\/power sources for electric vehicle traction systems’, IEE \nPEMD Conference, pp. 1-6, May 2004. \n[5] MES-DEA, Fuel Cell Systems, Technical Information, \nSwitzerland, 2003. \n[6] A.J. Appleby, and F.R. Foulkes, “Fuel Cell Handbook”, Book, \nVan Nostrand Reinhold, 1989. \n[7] S. Busquet, C.E. Hubert, J. Labbe, D. Mayer, and R. \nMetkemeijer, “A new approach to empirical electrical \nmodelling of a fuel cell, an electrolyser or a regenerative fuel \ncell”, Journal of Power Sources, vol. 134, pp. 41-48, 2004. \n[8] Cord-H. Dustmann, “Zebra battery meets USABC goals”, \nJournal of Power Sources, vol. 72, pp.27-31, 1998. \n[9] J. Sudworth, “The sodium\/nickel chloride (ZEBRA) battery”, \nJournal of Power Sources, vol. 100, pp. 149-163, 2001. \n[10] Zeb5 component data, Beta R&D, Derby, UK, 2003. \n \n \n \n \n350\n400\n450\n500\n550\n600\n650\n0 5000 10000 15000\nTime \/ s\nB\nat\nte\nry\n \nte\nrm\nin\nal\n \nv\no\nlta\nge\n \n\/ V\n \n \n \n \n350\n400\n450\n500\n550\n600\n650\n700\n0 1000 2000 3000 4000 5000 6000 7000 8000 9000 10000\nTime \/ s\nB\nat\nte\nry\n \nte\nrm\nin\nal\n \nv\no\nlta\nge\n \n\/ V\n1798\n APPENDIX I:  MODEL DATA AND \nCOMPONENT SPECIFICATIONS \n \nLondon Taxi Vehicle Data \nGross vehicle weight 2500 kg \nDrag force coefficient 0.31 \nEquivalent frontal area 1.75m2 \nCoefficient of rolling resistance 0.03 \nRoad wheel radius 0.274 m \nWheel inertia 0.164 kgm2 \nTraction machine inertia 0.57x10-3 kgm2 \n \n \nMES-DEA 3.0kW prototype fuel cell system [5] \nPerformance data \nUnreg. dc output voltage range 72 - 114V \nH2 consumption at full-load 39ln\/min. (0.2kg\/h) \nMax. power output 3kW \nOpen circuit voltage per cell 0.95V \nNumber of cells per stack 120 \nActive cell area 61cm2 \nOperating conditions \nStack temperature Max. 63oC \nHydrogen pressure 0.4-0.7 bar \nAir pressure Ambient \nFuel supply Pure hydrogen, \ndead-end mode \nAmbient temperature 0  to  +35oC \nGas humidification none \nWorking cycle continuous \nCooling Force air cooled \nStack volume 410 x 305 x 235 mm \nControl unit volume 295 x 155 x 95 mm \nStack weight 9kg \nSystem weight 11kg \nVehicle on-board Hydrogen storage \nGas storage Compressed H2 at 230bar \nStorage medium 3x carbon composite cylinders \nTotal storage capability 90litres \n \n \nZEBRA Z5C battery data [9] \nType Zebra Z5C \nCapacity 66Ah \nRated energy 17.8kWh \nOpen circuit voltage 278.6V \nMax. regen voltage 335V \nMax. charging voltage 308V \nMin. voltage 186V \nMax. discharge current 224A \nWeight 195kg \nSpecific energy 91.2Wh\/kg \nSpecific power 164W\/kg \nPeak power 32kW \nThermal Loss <120W \nCooling Air \nBattery internal temperature 270 to 350°C \nAmbient temperature -40 to +70°C \nDimensions (WxLxH) 533 x 833 x 300  mm \nNumber of cells per battery 216 \nCell configuration 2 parallel strings of \n108 series cells \n \n \n \n \n \nFuel Cell Model Parameters: \nParameters for equation (2):  Parameters for equation (3): \nka 0.950602847  aa -0.000558716 \nkb -2.111185823  ab 1.196398539 \nkc 18.4080918  ac 4.580251356 \nkd -101.455289  ad -17.6473079 \nke 333.775762  ae  20.45606645 \nkf -684.4227687  af -8.028431982 \nkg 892.8408354    \nkh -737.7160864    \nki  371.7575573    \nkj  -103.5699007    \nkk 12.12124403    \n \n \nSealed lead-acid battery data \nModel HAWKER Genesis EP Series \nCell number 6 cells per module \nNominal voltage 12V (2V per cell) \nMax. voltage 13.5V open circuit (2.25V per cell) \nMax. charging voltage 16V (2.67V per cell) \nMin. voltage 10.2V (recommended, 1.7V per cell) \nMax. current 450A \nRated energy 0.1318 to 0.846kWh \nRated capacity 70Ah \nRated temperature 20°C \nMass 24.2kg \nVolume 9.79l \nDimension 331mm x 168mm x 176mm \n \n \n \nAPPENDIX II:  ZEBRA EQUIVALENT CIRCUIT MODEL \n \nThe following equations model the ZEBRA battery as a \nfunction of discharge Ampere-hour (q) and battery \nterminal supply current (i).  The equation for cell open-\ncircuit voltage is given by: \n \n \n(A1) \nFrom experimental test data, the battery internal \nresistance is found to be a complex function of discharge \nampere-hour (or SoC) and current charge\/discharge rate.  \nCurve fit functions are used to analytically model the \ninternal resistance.  However, due to highly non-linear \nrelationship, it is not possible to fit one 3-dimension \nequation to the full data set without the model losing \naccuracy.  To overcome this problem, the model uses a \nset of eleven equations determined by the current rate \nand discharge ampere-hour.  For example, for discharge \ncurrents higher than 40A, a constant resistance of Rmax-2 \nis used.  For all other regions, i.e. when discharge \ncurrent is between 0A to 40A, the appropriate resistance \nequation is chosen according to the defined conditions. \n \nThe choice of battery cell internal resistance is dictated \nby the following algorithm: \n \n \n5.225.115.0\n5.225.115.0\n1 qvqvqvqvqv\nqvqvqvqvqvv\nE\njhfdb\nkigeca\noc\n+++++\n+++++\n=\n1799\n Loop start \nif  ‘q > ahref’  then  ‘simulation stop’  else \nif  ‘i ≤ 0’  then  ‘rint = rchg’  else \nif  ‘i > 40’  then  ‘rint = rmax-2’  else \nif  ‘i ≤ 15  and  q ≤ 2’  then  ‘rint = ra0’  else \nif  ‘i > 15  and  q ≤ 2’  then  ‘rint = ra1’  else \nif  ’26 < q < 28’  then  ‘rint = rd0’  else \nif  ‘q ≤ 15  and  2 < i ≤ 28’  then  ‘rint = rb0’  else \nif  ‘q > 15  and  2 < i ≤ 5’  then  ‘rint = rb1’  else \nif  ‘q > 15  and  5 < i ≤ 22.5’  then  ‘rint = rb3’  else \nif  ‘q > 15  and  22.5 < i ≤ 28’  then  ‘rint = rb2’  else \nif  ‘q ≤ 15  and  i > 28’  then  ‘rint = rc0’  else \nif  ‘q > 15  and  i > 28’  then  ‘rint = rc1’ \nif ‘rint > rmax’  then  ‘rint = rmax’ \nLoop end \n \nHence, the equations used to calculate the cell internal \nresistance, Rint, in mΩ are: \niaqaqa\niaqaqaaR\ngfe\ndcba\nA\n1\n2\n11\n1\n2\n111\n1 1 +++\n+++\n=\n (A2) \nibqbqb\nibqbqbbR\ngfe\ndcba\nB\n0\n2\n00\n0\n2\n000\n0 1 +++\n+++\n=\n (A3) \nibqbqb\nibqbqbbR\ngfe\ndcba\nB\n1\n2\n11\n1\n2\n111\n1 1 +++\n+++\n=\n (A4) \nibqb\nibqbqbqbbR\ngf\nedcba\nB ln1\nln\n22\n2\n3\n2\n2\n222\n2 ++\n++++\n=\n \n(A5) \nibqbqb\nibqbqbqbbR\nhgf\nedcba\nB\n3\n2\n33\n3\n3\n3\n2\n333\n3 1 +++\n++++\n=\n (A6) \nicqcqcqc\nicqcqcqccR\nihgf\nedcba\nC ln1\nln\n1\n3\n1\n2\n11\n1\n3\n1\n2\n111\n1 ++++\n++++\n=\n (A7) \n \n \n( ) ( )\n22\n0\n2\n0\n2\n0\n00\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n11\n16\n1\n4\n1\n4\n\u0001\n\u0001\n\u0001\n\u0002\n\u0003\n\u0004\n\u0004\n\u0004\n\u0005\n\u0006\n+\n\u0001\n\u0001\n\u0002\n\u0003\n\u0004\n\u0004\n\u0005\n\u0006\n+\n+\n\u0001\n\u0001\n\u0001\n\u0002\n\u0003\n\u0004\n\u0004\n\u0004\n\u0005\n\u0006\n+\n+\n\u0001\n\u0001\n\u0002\n\u0003\n\u0004\n\u0004\n\u0005\n\u0006\n+\n+=\n\u0007\n\u0007\n\b\n\t\n\n\n\n\n\u000b\n\f −\n−\n\u0007\n\u0007\n\b\n\t\n\n\n\n\n\u000b\n\f −\n−\n\u0007\n\u0007\n\b\n\t\n\n\n\n\n\u000b\n\f −\n−\n−\n−\n\u0007\n\u0007\n\b\n\t\n\n\n\n\n\u000b\n\f −\n−\n\u0007\n\u0007\n\b\n\t\n\n\n\n\n\u000b\n\f −\n−\n\u0007\n\u0007\n\b\n\t\n\n\n\n\n\u000b\n\f −\n−\n\u0007\n\u0007\n\b\n\t\n\n\n\n\n\u000b\n\f −\n−\ng\nf\nd\nc\ng\nf\nd\nc\ng\nf\ng\nf\nd\nc\nd\nc\na\naq\na\naq\na\nai\na\naq\nh\na\naq\na\nai\ne\na\naq\na\naq\nb\naA\nee\nea\ne\nea\ne\nea\naR\n \n(A8) \niq\nc\niq\nc\ni\nc\nq\nc\niq\nc\ni\nc\nq\nc\ni\nc\nq\nc\ncR jihgfedcbaC 2\n0\n2\n0\n3\n0\n3\n00\n2\n0\n2\n000\n00 +++++++++=\n \n(A9) \n[ ] [ ] [ ][ ]\n[ ] [ ] [ ][ ] [ ] [ ]iqdiqdidqd\niqdidqdidqddR\njihg\nfedcbaD\nlnlnlnlnlnln\nlnlnlnlnlnln\n2\n0\n2\n0\n3\n0\n3\n0\n0\n2\n0\n2\n00000\n++++\n+++++=\n \n(A10) \n \nZebra battery model parameter values \nva 2.668550131 d0h 0.524300703 b0a 8.538290542 b2e -5.216032308 c0h -3848.834185 \nvb -2.161541495 d0i -22.38078476 b0b -0.424796912 b2f 0.002232179 c0i -11139.14849 \nvc -5.768152987 d0j -412.8784228 b0c 0.00482931 b2g -0.452954018 c0j 1204035.646 \nvd 2.47814445 a0a 8.29672091 b0d 0.035452834 b3a 7.344557606 c1a 12.19982394 \nve 6.543581931 a0b 2.654229606 b0e -0.08078068 b3b -0.226075522 c1b -1.200804369 \nvf -0.94931541 a0c 0.177295354 b0f 0.001643179 b3c -0.02883916 c1c 0.03939517 \nvg -2.50604762 a0d 0.241852423 b0g 0.00500249 b3d 0.001220193 c1d -0.000431123 \nvh 0.14455723 a0e 0.653017062 b1a 8.224355635 b3e 0.031523757 c1e 0.005384114 \nvi 0.383236649 a0f 7.390945256 b1b -0.307842076 b3f -0.10240466 c1f -0.098137889 \nvj -0.007606508 a0g 1.661911031 b1c 0.001595691 b3g 0.002643072 c1g 0.003212432 \nvk -0.020331713 a0h 2.974473025 b1d 0.053949783 b3h 0.004302133 c1h -3.50917E-05 \nd0a 100888.7072 a1a 12.8420689 b1e -0.077968772 c0a -1110.598606 c1i 0.000354365 \nd0b -84923.67774 a1b -18.48590873 b1f 0.001550886 c0b 105087.9293 Ahref 0 to 34 \nd0c -5137.577354 a1c 20.68546045 b1g 0.007381905 c0c 943.1554737 Rmax 80.0 \nd0d 23809.05796 a1d 0.03576463 b2a 481.9178496 c0d -3236953.626 Rmax-2 7.5 \nd0e 72.46775398 a1e -1.663449676 b2b -56.51569106 c0e 1695.83145 Rchg 5.0 \nd0f 2917.312426 a1f 2.272354708 b2c 2.238986889 c0f -72760.13798   \nd0g -2223.104357 a1g 0.011695949 b2d -0.029265742 c0g 32930698.08   \n \n1800\n"}