{"doi":"10.1080\/14735780802426684","coreId":"70007","oai":"oai:eprints.lancs.ac.uk:14294","identifiers":["oai:eprints.lancs.ac.uk:14294","10.1080\/14735780802426684"],"title":"Ginzburg in Harlem:History, Structure and the Politics of Primitivism.","authors":["Palladino, Paolo"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-10","abstract":"The historian Carlo Ginzburg is renowned for his critique of modern, scientific reason and his articulation of an alternative form of knowledge which he labels 'conjectural'. This form of knowledge, supposedly more attuned to the historian's interest in the singular and specific fragment, as opposed to the abstract and universal concept, is so rooted in the practices of the prehistoric hunter that Ginzburg sometimes describes it as a 'venatic' form of deduction, binding 'the human animal closely to other animal species'. In this essay, I explore the ramifications of this alternative form of knowledge, attending especially to its relationship to the modernist theme of 'primitivism'. I do so by juxtaposing Ginzburg's critical appraisal of Arthur Conan Doyle's most famous literary invention, Sherlock Holmes, and Rudolph Fisher's own literary invention, John Archer, the physician who sometimes aids criminal investigations in African American Harlem. I argue that the differences between Archer and Holmes draw attention to some troubling implications of Ginzburg's historiographical argument. Folding this analysis on itself, however, I also suggest that what might be at stake, when Ginzburg insists so troublingly on the importance of the singular, venatic trace, is the evocation of Walter Benjamin's understanding of the historical 'event'","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/70007.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/14294\/1\/GHCTC.pdf","pdfHashValue":"0797694fa102f251c9b09a98554620072fbeb9e6","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:14294<\/identifier><datestamp>\n      2018-01-24T00:04:56Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D44:4431<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Ginzburg in Harlem:History, Structure and the Politics of Primitivism.<\/dc:title><dc:creator>\n        Palladino, Paolo<\/dc:creator><dc:subject>\n        D History (General)<\/dc:subject><dc:description>\n        The historian Carlo Ginzburg is renowned for his critique of modern, scientific reason and his articulation of an alternative form of knowledge which he labels 'conjectural'. This form of knowledge, supposedly more attuned to the historian's interest in the singular and specific fragment, as opposed to the abstract and universal concept, is so rooted in the practices of the prehistoric hunter that Ginzburg sometimes describes it as a 'venatic' form of deduction, binding 'the human animal closely to other animal species'. In this essay, I explore the ramifications of this alternative form of knowledge, attending especially to its relationship to the modernist theme of 'primitivism'. I do so by juxtaposing Ginzburg's critical appraisal of Arthur Conan Doyle's most famous literary invention, Sherlock Holmes, and Rudolph Fisher's own literary invention, John Archer, the physician who sometimes aids criminal investigations in African American Harlem. I argue that the differences between Archer and Holmes draw attention to some troubling implications of Ginzburg's historiographical argument. Folding this analysis on itself, however, I also suggest that what might be at stake, when Ginzburg insists so troublingly on the importance of the singular, venatic trace, is the evocation of Walter Benjamin's understanding of the historical 'event'.<\/dc:description><dc:date>\n        2008-10<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:relation>\n        http:\/\/dx.doi.org\/10.1080\/14735780802426684<\/dc:relation><dc:identifier>\n        Palladino, Paolo (2008) Ginzburg in Harlem:History, Structure and the Politics of Primitivism. Culture, Theory and Critique, 49 (2). pp. 203-217. ISSN 1473-5784<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/14294\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1080\/14735780802426684","http:\/\/eprints.lancs.ac.uk\/14294\/"],"year":2008,"topics":["D History (General)"],"subject":["Journal Article","PeerReviewed"],"fullText":"GINZBURG IN HARLEM: HISTORY, STRUCTURE AND THE POLITICS OF PRIMITIVISM \n \n \n \n \n \n \n \n \nLast revised: 14 October 2008 \n \n \nPlease do not cite or quote without the author’s permission \n \n \n \n \n \n \n \n \n \n \n \n \n \nAcknowledgements:  \nI am grateful to Jonathan Munby for first drawing my attention to the writings of Rudolph Fisher, and to Tim \nHickman, Ethan Kleinberg, Alun Munslow, Yoke-Sum Wong and Teresa Young for their critical comments \nand advice. I am also grateful to two anonymous reviewers whose generous and very perceptive comments \nhave taught me how much more could, and should, be said about Fisher’s writings, which I have perhaps \nsacrificed for the sake of narrative focus and coherence.\nPaolo Palladino is Senior Lecturer in the Department of History at Lancaster University. His research \nfocuses on the intersection of historical and political thought with specific reference to the contemporary \ndevelopments in medicine and the life sciences. He is currently working on a book whose provisional title is \nTools for Thought: Death and the Politics of ‘Life Itself’. \n \n \nContact details: \n \nDepartment of History \nLancaster University \nLancaster LA1 4YG \nUNITED KINGDOM \n \nTel.: 01524 592793 \nFax: 01524 846102 \nP.Palladino@lancaster.ac.uk \n \n \nGINZBURG IN HARLEM: HISTORY, STRUCTURE AND THE POLITICS OF PRIMITIVISM \n \nAbstract \nThe historian Carlo Ginzburg is renowned for his critique of modern, scientific reason and his \narticulation of an alternative form of knowledge which he labels ‘conjectural’. This form of knowledge, \nsupposedly more attuned to the historian’s interest in the singular and specific fragment, as opposed to \nthe abstract and universal concept, is so rooted in the practices of the prehistoric hunter that Ginzburg \nsometimes describes it as a ‘venatic’ form of deduction, binding ‘the human animal closely to other \nanimal species’. In this essay, I explore the ramifications of this alternative form of knowledge, \nattending especially to its relationship to the modernist theme of ‘primitivism’. I do so by juxtaposing \nGinzburg’s critical appraisal of Arthur Conan Doyle’s most famous literary invention, Sherlock \nHolmes, and Rudolph Fisher’s own literary invention, John Archer, the physician who sometimes aids \ncriminal investigations in African-American Harlem. I argue that the differences between Archer and \nHolmes draw attention to some troubling implications of Ginzburg’s historiographical argument. \nFolding this analysis on itself, however, I also suggest that what might be at stake, when Ginzburg \ninsists so troublingly on the importance of the singular, venatic trace, is the evocation of Walter \nBenjamin’s understanding of the historical ‘event’. \n \nWord count: 6793 \n 1  \nIntroduction \nThe historian Carlo Ginzburg (1990) is greatly renowned for his critique of modern, scientific reason \nand his articulation of an alternative form of knowledge which he labels ‘conjectural’. This alternative \nform of knowledge, Ginzburg argues, is rooted in the practices of the prehistoric hunter, tracking its \nelusive prey: \nMan has been a hunter for thousands of years. In the course of countless chases he learned to reconstruct the \nshapes and movements of his invisible prey from tracks on the ground, broken branches, excrement, tufts of \nhair, entangled feathers, stagnating odors. He learned to sniff out, record, interpret, and classify such \ninfinitesimal traces as trails of spittle. He learned how to execute complex mental operations with lightning \nspeed, in the depth of a forest or in a prairie with its hidden dangers (102). \nConsequently, Ginzburg sometimes also describes conjectural knowledge as a ‘venatic’ (103) form of \ndeduction, which ‘binds the human animal closely to other animal species’ (125). According to \nGinzburg (1999), the fundamental importance of what then is effectively an immemorial form of \nknowledge is that it enables historians to argue against contemporary post-structuralist and \ndeconstructive critiques of language and reference that ‘knowledge (even historical knowledge) is \npossible’ (25). In this essay, I propose to explore the ramifications of this so powerful, alternative form \nof knowledge, attending especially to its relationship to the modernist theme of ‘primitivism’, that is, to \nthe modernist attempt to question dominant cultural values by recourse to that which is so temporally \ndistant and different as to be outside historical time (see also Hiller 1991). Furthermore, while \nGinzburg has insisted steadfastly and importantly on the fundamentally different ambitions of \nhistorical and literary representation, critically at issue in Ginzburg’s own, formative reading of Leo \nTolstoy’s War and Peace, he also argues that the literary imagination none the less provides powerful \ninsight into the structure of conjectural knowledge (see Ginzburg 1993). I will therefore advance the \nproposed exploration by juxtaposing, on the one hand, Ginzburg’s critical appraisal of Arthur Conan \nDoyle’s most famous literary invention, Sherlock Holmes, and, on the other hand, Rudolph Fisher’s \nown literary invention, John Archer, the African-American physician who sometimes aids criminal \ninvestigations in African-American Harlem. Such choice is not motivated by Conan Doyle’s and \nFisher’s shared, literary conjunction of medical science and the investigation of criminal misdeeeds \nalone. Fisher’s texts also are germane because they are important examples of the African-American \nliterary modernism associated with the phrase ‘Harlem Renaissance’ (see Baker 1987). Like others \nassociated with the movement, these very perceptive texts embrace the critique of modern culture and \nits pretensions, but also betray unease and ambivalence toward the celebrations of African traditions \n 2  \nthat characterised the contemporaneous cultural interventions of leading African-American \nintellectuals such as W.E.B. Du Bois, who sought to establish thereby an autonomous African-\nAmerican culture. I will argue that the consequent differences between Archer and Holmes draw \nattention to the problematic political implications of Ginzburg’s otherwise seductive evocation of a \nform knowledge that ‘binds the human animal closely to other animal species’, namely its complicity \nwith imperialism, colonialism and, ultimately, racism (see also Young 1990). Prompted, however, by \nan interestingly partial quotation of Walter Benjamin in one of Ginzburg’s most famous texts, The \nCheese and the Worms (1976), an aporia which perhaps is the trace of something more than meets the \nreader’s eye, I will also suggest that what might in fact be at stake, when Ginzburg insists so \nproblematically on the importance of the singular, venatic trace, is the evocation of Benjamin’s \nunderstanding of the historical ‘event’, whereby Benjamin could only conclude that a philosophy of \nhistory which ‘does not take into account the power to prophesy from coffee grains cannot be true \nphilosophy’ (as quoted in Scholem 1975: 77; author’s translation and emphasis).1 \n \nGinzburg and the art of detection \nThere is much at stake in weighing very seriously Carlo Ginzburg reflections on historiographical \npractice, despite the devastating philosophical critiques to which they have been subjected (see, for \nexample, La Capra, 1985). Over the past twenty and more years, Ginzburg’s rejection of modern, \ntotalising historical narratives and his articulation of an alternative, conjectural form of knowledge \nhave proved critically important not only to the revival of social historians’ political ambitions to speak \nfor the vanquished and forgotten, such as the famous Menocchio in Ginzburg’s The Cheese and the \nWorms, but also to the reassertion of historians’ distinctive mode of inquiry, one that values that \nwhich is singular and specific over the general and universal (see Magnússon 2003). Ginzburg’s \nargument has also served to further the rejection of totalising narratives within the very social sciences \nwhich shaped the emergence of modern, totalising historical narratives, in favour of ethnographic \nobservation (see Pottage 2001). In either case, however, the appropriation has not always been in \nterms to which Ginzburg himself would subscribe, insofar as, when Ginzburg speaks of the possibility \nof ‘historical knowledge’, he refers to the very same experience that modern, totalising historical \nnarratives would seek to recover. As he puts it in the closing lines to his introduction to The Cheese \nand the Worms, lines that speak directly and uncompromisingly to the historian’s political obligations: \n 3  \nTo respect [the past’s] residue of unintelligibility that resists any attempt at analysis does not mean succumbing \nto a foolish fascination for the exotic and incomprehensible. It is simply taking note of a historical mutilation of \nwhich, in a certain sense, we ourselves are the victims. ‘Nothing that has taken place should be lost to history’, \nwrote Walter Benjamin. ‘But only to redeemed humanity does the past belong in its entirety’. Redeemed and \nthus liberated (Ginzburg 1980: xxvi).. \nThe question for the historian who would not succumb ‘to a foolish fascination for the exotic and \nincomprehensible’ would then seem to be about what historiographical method might be most \nattentive to that which is singular and specific, and yet offer insight into ‘the past in its entirety’. In one \nof the earliest interventions in which he seeks to articulate a formal answer to this difficult question, \nGinzburg (1990) turns his attention to the fictional works of Arthur Conan Doyle, as well as the \ncontemporaneous, more technical works of Sigmund Freud and the art connoisseur Giovanni Morelli. \n \nAs is well known, when compared with Sherlock Holmes’ extraordinary capacity to establish both the \nidentity of the culprit and their criminal motives from the most minute irregularity, the inimitable, \nretired physician John Watson is supposed to personify the limits of scientific reason, insofar as \nWatson focuses on that which is regular and patterned, notwithstanding that the crimes to which he \nand Holmes attend are anything but regular and patterned. Although Ginzburg is greatly captivated by \nthe contrast between these two characters, it should be noted how he overlooks Watson’s pivotal role \nas retrospective narrator such that, without Watson, there could have been be no Holmesian forensic \nexploits. Ginzburg thus overlooks both the possibility that the two forms of knowledge which he \ncontrasts may in fact be intimately related and the pivotal role of language in the constitution of \nreality, the latter being something that did not wholly escape the attention of Conan Doyle (2006: 1) \nhimself, when he prefaced the opening of A Study in Scarlet (1888), in which Holmes makes his first \npublic appearance, with the mock-realist words ‘being a reprint from the reminiscences of John H. \nWatson, M.D., late of the Army Medical Department’. Nevertheless, Ginzburg goes on to trace the \nhistory of an increasing formalisation of the effectively immemorial form of knowing which Holmes is \nsupposed to personify, contrasting it with a historically specific form that emphasises abstraction and \ngeneralisation as the keys to revealing all that is hidden from human sight. If Galileo Galilei personifies \nthe latter mode of inquiry, Giulio Mancini, Galileo’s contemporary, as well as physician, naturalist and \nprototypical art connoisseur, articulates the former mode, drawing on an understanding of medical \npractice as ultimately grounded in semiosis, the reading of signs, rather than mathesis, calculation \nfrom first principles. While this understanding might be said to clarify the historical links between \n 4  \nmedicine and the divinatory practices of the ancient priestly castes, for Ginzburg, what is more \nimportant is that irregularity, the descendant of that which is anomalous and portentous, is profoundly \nsignificant because, although it captures the actor’s attention, it does so outside the controlling and \ndisciplining functions of consciousness and reason. As such, that which is deemed irregular becomes \nthe trace of the actor’s sensual encounter with the world. As Ginzburg  puts it, the ‘infinitesimal traces’, \nwhich, he argues, eventually became Morelli’s, Freud’s and Conan Doyle’s distinctive concern, ‘permit \nthe comprehension of a deeper, otherwise unattainable reality’ (101). It is worth noting at this point \nthat, if the histories of medical practice and conjectural knowledge are so intimately intertwined, \nGinzburg’s understanding of medicine as a fundamentally semiotic practice then is much closer to that \nadvanced by Georges Canguilhem, in The Normal and the Pathological (1966), than it is to that \nadvanced by the latter’s most famous disciple, Michel Foucault, in The Birth of the Clinic (1963). This \nis particularly significant insofar as Foucault, the historian who strove to challenge the very same \nHegelian and Marxist totalising histories which Ginzburg seeks to overturn, sought to question his \nmentor’s normative, ideological critique of modern medicine by radically historicising the epistemic \npractices of both medical semiotics and scientific medicine (Gutting 1989: 52-54). In other words, \naccording to Foucault, semiosis and mathesis are indeed as fundamentally different epistemic \npractices as Canguilhem maintained, but they also are equally historically specific forms of knowledge, \nthe one being no more ‘truthful’ than the other. Nevertheless, Ginzburg goes on to argue that the \nconjectural, semiotic mode of inquiry is what distinguishes the humanities and their capacity to \naccount for the realities of the human condition from the abstracting social and natural sciences, \nnoting incidentally that the mode of inquiry on which the humanities are predicated is infinitely more \ndemocratic because it values the ‘patrimony … of men and women from all social classes’ (115). \nGinzburg also argues that ‘linguistics’ is the one humanistic enterprise that has succumbed to the \nillusory and elitist attractions of ‘the powerful and terrible weapon of abstraction’ (115). He thus \ndismisses both structuralist theories of language and human action, as well as all those who have \nworked in the shadow of structuralism, including Foucault, who, in The Order of Things (1966), \nmaintained that the opposition between the singular and the universal, to which Ginzburg pays so \nmuch attention and equates all too problematically with the difference between semiosis and mathesis, \nis the product of a distinctly modern discursive enframing of that which is heterogeneous and \nmultiple.2 The adventures of Rudolph Fisher’s fictional detective, John Archer, offer a vehicle for a \nmore sustained, historically specific, as opposed to philosophical, exploration of the questions that \n 5  \nGinzburg’s argument thus poses. In other words, Archer’s adventures offer a vehicle to challenge \nGinzburg on his own terrain. \n \nRudolph Fisher in Harlem \nWhile Rudolph Fisher is largely forgotten today, despite the recent re-release of popular editions of his \nwork and occasional critical appraisals (see Soitos 1996; Gosselin 1999; and Condé 2002), in his own \nday he was an important figure in the literary development that goes by the name of the ‘Harlem \nRenaissance’, so much so that more memorable figures such as Langston Hughes recalled that ‘the \nwittiest of these New Negros of Harlem, whose tongue was flavoured with the sharpest and wittiest \nhumor, was Rudolph Fisher … who always frightened me a little, because he could think of the most \nincisively clever things to say – and I could never think of anything to answer’ (as quoted in McCluskey \n1987: xvii). The more immediately relevant biographical observation, however, is that Fisher, like \nArthur Conan Doyle, had trained to become a biomedical researcher, but, after failing to secure a \npermanent position in the College of Physicians and Surgeons at Columbia University, as researcher in \nradiation biology, he settled in nearby Harlem as a general physician, radiologist and aspiring writer. \nFisher’s career as a writer was brief, however, as he died very young, before he was ever able to achieve \nthe public recognition which many of his contemporaries thought he deserved. This said, there is \nsomething interestingly different about Fisher’s fictional physician and detective John Archer, who \nfigures in both the novel The Conjure Man Dies (1932) and the posthumously published short story \nDr. Archer’s Nose (1935). It may even explain why Hughes found Fisher as troublesome as his \nrecollections of him would seem to suggest. \n \nThe plot of The Conjure Man Dies revolves around the murder of N’Gana Frimbo. Frimbo is an \nunusual Harlemite insofar as he is the King of Buwongo who left his native country for the United \nStates, to study biology, psychology and philosophy at Harvard University, and eventually settled in \nHarlem as a conjureman, continuing in his spare time to conduct physiological experiments in altering \nthe human germplasm. Leading the official investigation is Perry Dart, the first of a handful of African-\nAmericans on the Harlem police force to have gained promotion from patrolman to detective. Working \nwith Dart is the abovementioned Archer, who, besides being the retrospective narrator of the \nunfolding investigation, also reflects on the nature of human knowledge, sometimes drawing attention \n 6  \nto the fundamental similarities between the work of a physician and a detective; as Archer puts it to \nDart: \nI am a detective … all my training and all my activities are those of a detective. The criminal I chase is as prime a \nrascal as you’ll ever find. Diseases are assailants, thieves, murderers. In each case I get, it’s my job to track \ndisease down, identify it, and arrest it. What else is diagnosis and treatment? (124). \nOf equal importance is Bubber Brown, a sanitation worker turned private investigator, who works to \nclear his unemployed partner, Jinx Jenkins, of the charge that he murdered Frimbo. Halfway into \nthese three characters’ strikingly collective investigation, which, by itself, begins to challenge the \nformal rules of the genre then epitomised by Conan Doyle’s novels, by calling into question the site of \nforensic reason, the corpse disappears and, shortly thereafter, Frimbo reappears, seated in the very \nchair where his corpse had been first found. Frimbo is unable to convince Dart and Archer that what \nthey took for his death was a state of suspended animation, and, when it is discovered that the dead \nbody found on the scene of the crime was not that of the conjureman, but that of N’Ogo Frimbo, the \nconjureman’s assistant and countryman, the conjureman is suspected of murdering his assistant, \nperhaps to obtain the human gonads he needs for his physiological experiments. In the meantime, \nFrimbo himself seeks to use his psychic abilities, which he attributes to the power of deduction in a \nthoroughly deterministic universe, to identify the murderer of his assistant and countryman, who he \nsuspects was killed mistakenly, the murderer having assumed that they were killing Frimbo for having \nused his psychic abilities to cheat a gambling operation. At the novel’s conclusion, Frimbo succeeds in \ndrawing out the murderer, but at the cost of his own life. It turns out that Frimbo’s absolutely \nunsuspected affair with his landlord’s wife, never betrayed even by Archer’s retrospective narrative \ninterventions, but perhaps by a framing musical reference to ‘I’ll Be Glad When You’re Dead, You \nRascal You’, is the cause of what eventually becomes a double murder. In The Conjure Man Dies, \nnothing ever is quite what it seems. \n \nAs the literary critic Adrienne Gosselin (1998) has noted, Fisher was so intent on playing with the \nformal rules of his chosen literary genre that, while the relationship between Archer and Dart might \nseem to parallel that between Sherlock Holmes and John Watson, especially when Archer emphasises \ncontra Dart that detection rests on attention to detail and an intuitive grasp of its significance, it is in \nfact Frimbo who embodies the synthesis of Holmesian intuition and Watsonian scientific rationality. \nConsequently, Gosselin argues, by closing The Conjure Man Dies with Frimbo’s death, Fisher becomes \n 7  \n‘the perpetrator of one of the most dastardly crimes in popular fiction … the murder of Sherlock \nHolmes’ (608). Explaining why Fisher should have opted for this narrative course has generated much \ndisagreement, most of it pivoting around the relationship between the question of ‘Africa’, on the one \nhand, and the African-American social and cultural predicament, on the other hand (see Soitos 1996; \nGosselin 1999; and Condé 2002). In light of these disagreements, Frimbo’s death is perhaps best \nunderstood as a rejection of the synthesis of African and American cultures demanded by African-\nAmerican intellectuals such as W.E.B. DuBois, who famously spoke of ‘two souls, two thoughts, two \nunreconciled strivings; two warring ideals in one dark body, whose dogged strength alone keeps it \nfrom being torn asunder’ (as quoted in Bell 1996: 94). More specifically, from the perspective of \nAfrican-American modernist critics such as Fisher, the Duboisian programme for the construction of \nan autonomous African-American culture was predicated firstly on the sovereign subject of the \nbourgeois imagination. Holmes’ extraordinary capacities, for example, reassured the late Victorian \nreader of their autonomy in an increasingly alien world, which was dominated by the very scientific \nrationality that was in fact supposed to establish their cultural, social and political hegemony (see \nKnight 1980). Such sovereignty simply was inconceivable in a world where African-Americans would \nalways be marked by race. In fact, in short stories such as High Yaller (1925), Fisher attends to the \ndynamics of ‘passing’, that is, to the dynamics of pretending to be white, noting thereby the ways in \nwhich African-Americans themselves reproduced racial differentiation within the confines of Harlem \nitself as a marker of social distinction. Furthermore, the adaptation of this bourgeois ideology in \nAfrican-American context would entail the reification of a distinctive African culture and thus further \ncomplicity with American racism. It is worth recalling that one of the markers of Holmes’ sovereignty \nwas his penchant for cocaine, despite the moral dubiety associated with the opium dens that Conan \nDoyle has Holmes visit, principally because Holmes was able to enjoy the freedom from bourgeois \nrestraint that his habit is supposed to have allowed, without however becoming dependent on the \nhabit, the marker of the Oriental opium smokers’ racial and moral inferiority (Harris 2003; see also \nMarez 1997 and Reitz 2004). Similarly, the celebration of a distinctively African culture pandered to \nthe American, urban middle classes’ search for authenticity in Harlem, brilliantly reconstructed in \nDavid Levering Lewis’ When Harlem Was in Vogue (1979), without however ever having to engage \nwith the often violent realities of modern, urban African-American life. Fisher’s rejection of this entire \nprogramme is neatly encapsulated by Du Bois’ criticism of Walls of Jericho (1928), Fisher’s semi-\nfictional, ethnographic account of African-American life in Harlem, for its failure to provide any \n 8  \nrepresentation of the Duboisian ‘talented tenth’ who would overcome the burdens of ‘double \nconsciousness’ (see Soitos 1996: 100).  \n \nReturning to The Conjure Man Dies, Fisher advances this rejection of the Duboisian programme by \nreturning to Frimbo’s physiological experiments, which aree initially passed over without any \ncomment. While these experiments were wholly orthodox in both their practice and intent (see \nSengoopta 2003; Hirschbein, 2000), and would thus seem to speak to much more than just a \npeculiarly African-American predicament, Frimbo’s fuller articulation of such intent leads Archer to \ndiagnose Frimbo as clinically paranoid. 3 More specifically, Frimbo’s ambition is to become one with \nthe entire history of the people from whom he descended by manipulating his germinal constitution \nand thus achieve freedom from all historical subjection. Almost as if to evoke Johann Wolfgang \nGoethe’s concept of the urpflanze, Frimbo argues that, \nThe germplasm … is the epitome of the past. He who can learn its use can be master of his past. And he who can \nmaster his past, that man is free (159).  \nGoethe advanced a very similar idea with respect to the development from seed to adult plant, but he \nalso acknowledged that this fuller conception of the plant, the urpflanze, was not sensually perceptible \nbecause the senses cannot capture the flow of time, only its sedimentation in specific historical \nconfigurations (Simms 2005; see also Caygill 1996). To Fisher, by way of Archer, Frimbo’s attempt to \nmaterialise and capture the flow of time is therefore a ‘delusional’ (159) ambition, be it that of a \nwealthy, exquisitely educated and perceptive African émigré who complains that he is everywhere \nreminded of his race, or that of an equally well educated physician who has to compete with the many \nunorthodox practitioners who populate Harlem. The impossibility of any mastery over one’s historical \nlocation is further reinforced by having Frimbo die in the very act of accidentally revealing the \nmurderer’s identity. Even this, however, is insufficient to reveal the murderer’s motives, as is required \nby the formal rules of detective fiction. These motives are again disclosed accidentally, when the \ndistraught landlord’s wife attacks her lover’s murderer, revealing him to be none other than the \nhusband she betrayed. The world, in other words, is far from being ruled by the intelligible, \ndeterministic laws to which Frimbo often refers in his philosophical conversations with Archer, every \nmoment instead being open to manifold, irreversible permutations. Finally, Fisher displaces the \nanthropological attention that privileged the ‘spirituals’ as the authentic African-American voice, by \nhaving Archer cast doubts on Frimbo’s recollections of his native Africa, replacing it with jazz and the \n 9  \nvoice it gives to the insurgent power of the African-American encounter with the modern city (see \nSimawe, 2001; also Baker, 1987 and Bhabha, 1994). Herein lies the importance of Brown, the street \nwise detective who discovers the assistant’s body, uses his contacts in the Harlemite underworld to \nuncover possible motives for wanting to kill the conjureman, and voices the closing lines of The \nConjure Man Dies. In these closing lines, spoken as Brown and Jenkins walk away to the sound of the \nvery same caustic song about betrayal and death, ‘I’ll Be Glad When You’re Dead, You Rascal You’, \nwith which The Conjure Man Dies opens, Brown refuses to condemn the murderer:  \nHe jes’ didn’t mean to lose his wife and his life both. Couldn’t blame him for that. Jes’ ordinary common sense \n(186).  \nWith these lines, Fisher abandons the classical narrative model, which insists on moral closure, opting \ninstead for the indeterminacy of Chester Himes’ later tales of crime in African-American Los Angeles.4 \nFisher thus begins to affirm the mutability and manifold possibilities of an inescapably fractured life. \n \nIn sum, the question of history might be said to haunt The Conjure Man Dies, but it has very little to \nsay on the matter of forensic detection, to which Carlo Ginzburg attaches so much importance. John \nArcher’s Nose, however, focuses exclusively on this topic. Here, the relationship between Archer and \nDart would appear to be much closer to the Doylesian contrast between Holmes and Watson, as they \nconfront the deadly consequences of the trade in healing potions, namely the death of an ailing child \nand another accidental murder, that of the healer’s son, Sonny, to avenge the former death. Strikingly, \nif Archer insists ultimately that ‘superstition killed Sonny’ (Fisher 1996a: 182), he once again refuses to \ncondemn those who trade in ‘superstition’, even if it entails loss of income to himself and the death of \nothers: it is all part of the fabric of life in Harlem, the place which Fisher sometimes dubbed the ‘city of \nrefuge’ (see Fisher 1996c; see also Cacioppo 2003). What is more important, however, is that, whereas \nDart’s rational reconstruction of the murder and ‘hard ball’ inquisitorial techniques fail, Archer \nidentifies the culprit and their motives by using his olfactory sense. Fisher, who, as an aspiring \nradiation biologist, could not but be aware of the mediated nature of the senses, uses this as a device to \nnote their different historical development: \n‘Odors should be restricted’, he pursued. ‘They should be captured, classified, and numbered like the lines of the \nspectrum. We let them run wild …’ \n‘Check’. \n‘And sacrifice a wealth of information. In a language of a quarter of a million words, we havn’t a single specific \ndirect denotation of a smell’. \n 10  \n‘Oh, no?’ \n‘No. Whatever you’re thinking of, it is an indirect and non-specific denotation, linking the odor in mind to \nsomething else. We are content with ‘fragrant’ and ‘foul’ or general terms of that character, or at best ‘alcoholic’ \nor ‘mouldy’, which are obviously indirect. We haven’t even such general direct terms as apply to colors – red, \ngreen, and blue. We name what we see but not what we smell’ \n‘Which is just as well’. \n‘On the contrary. If we could designate each smell by number …’ \n‘We’d know right off who killed Sonny’. \n‘Perhaps. I dare say every crime has its peculiar odor’. \n‘Old stuff. They used bloodhounds in Uncle Tom’s Cabin’. \n‘We could use one here’ (157; emphasis added).  \nBefore relating Fisher’s critical interventions with respect to primitivism to Ginzburg’s very different \nhistory of the senses, it is important to bear in mind that Fisher’s contextual detail is formally \nnecessary for the functioning of the detective novel, so that one cannot separate Fisher’s contribution \nto the genre and his reflections on the politics of history and knowledge. \n \nGinzburg in Harlem \nWhen writing about the invention of the modern anthropological project, the attempt to construct a \nscience of ‘Man’, the very project which Carlo Ginzburg would rescue from historiographical \nrelativism, Michel Foucault (1994b: 326) observed that the enterprise would always discover an \nobdurate obscurity at the heart of every schema of understanding it might develop. As he put it: \nMan and the unthought are … contemporaries. Man has not been able to describe himself as a configuration in \nan episteme without thought at the same time discovering, both in itself and outside itself, at its borders yet also \nin its very warp and woof, an element of darkness, an apparently inert density in which it is embedded. \nThe issue has long been what meaning to assign to this ‘element of darkness’, and Ginzburg’s answer is \nless than satisfactory.  \n \nFirstly, Ginzburg (1990) overlooks the ways in which generalising and particularising forms of \nknowledge are equally dependent on the training of the senses. Galileo Galilei may indeed have \nrestricted the legitimate sources of knowledge to ‘figures, numbers and movements, but not smell, nor \ntastes, nor sounds’ (108), but Ginzburg also passes too lightly over Galileo’s reference to the need for \n‘eyes on the forehead and the brain’ (207n73). Were Ginzburg to take this statement about the \n 11  \ndependence of scientific reason on an appropriately trained visual sense seriously, he would have to \nabandon his opposition between the singular and sensual, on the one hand, and the rational and \nuniversal, on the other hand. Secondly, if Alain Corbin (1986) has brilliantly illustrated the ways in \nwhich the olfactory sense is just as historically produced, it is Marcel Proust (1982: 48-51), the \nconservative critic of modernity, who famously transforms this same sense into the supreme vehicle of \nauthentic recollection (see also Sprinker 1988). Such forgetfulness about the history of the senses \ncomes at a cost, insofar as the specific ways in which the senses are organised are pregnant with \npolitical consequences: as Richard Dyer (1997) has noted, the politics of race are inseparable from a \nculture of visualisation in which to be white is to be not coloured. If Ginzburg will insist that there is \nsomething about sensual knowledge that transcends history and this is the key to historical truth, \nsomeone will have to bear the burden of representing such immemorial knowledge, for nothing can be \nknown in itself and for itself. It is Rudolph Fisher rather than Arthur Conan Doyle, the spokesman of \nrace and empire, who reminds the reader about the politics involved in the reification of the form of \nknowing which supposedly ‘binds the human animal closely to other animal species’. This has been the \ngreat burden of that creature which Henry Louis Gates (1988) has named the ‘signifyin(g) monkey’, \nand the price to be paid for the renewal of wholeness and order, the renewal of historical plenitude \nthat Ginzburg, the historian, would promise.  \n \nThis said, it is all too often overlooked, even by those attentive to the links between Ginzburg’ critical \ninterventions and the crisis of Marxist cultural theory, that Ginzburg also is the champion of the \nBenjaminian call to ‘brush history against the grain’, to undo all the work of erasure and thus recapture \nthe truth of history in its totality (as quoted in Ginzburg 1999: 248; see also Gordon 2001). \nSignificantly, this much quoted Benjaminian phrase is taken from the very same essay from which \nGinzburg borrows the phrase ‘nothing that has taken place should be lost to history … But only to \nredeemed humanity does the past belong in its entirety’ (Benjamin 1973: 246). From this Benjaminian \nperspective, in Menocchio’s moment of silence before the Inquisition, which Ginzburg famously tries \nto grasp in The Cheese and the Worms, or, returning to Ginzburg’s formative reading of Leo Tolstoy’s \nWar and Peace, in the moment in which Prince André and Pierre engage in battle at Austerlitz and \nBorodino, the singular and the totality of human experience come together (Ginzburg, 1994: 23-24). \nMoreover, if Ginzburg (1999: 98) also draws a parallel between such moments and Sergei Eisenstein’s \nmodernist cinematic aesthetic, in which the cut or interruption is supposed to offer far more than \n 12  \nmeets the eye, what is at stake is the evocation of the revolutionary ‘event’ when everything is once \nagain possible.5 To then focus, as most of the discussions of Ginzburg’s interventions have done (see \nPeltonen 2001), on the analytical difficulties they involve in connecting the singular and specific, on \nthe one hand, and, on the other hand, ‘the past in its entirety’, is to mistake questions of method and \nontology, and onto-theological questions to be more precise. On the other hand, if the Parisian \nrevolutionaries of 1830 sought to stop time by destroying the clock-towers, they, like Benjamin (1973a: \n253) who brings them to memory in the very same essay to which Ginzburg refers his readers, in his \nintroduction to The Cheese and the Worms, knew that they could not, that they too would be \nintegrated into the linear, continuous time of the modern historical imagination. Ginzburg (1994: 27) \nis no stranger to these considerations about the nature of historical time insofar as, when discussing \nthe fraught relationship between historical ‘events’ and ‘structures’, he speaks of ‘reality’ as \n‘fundamentally discontinuous and heterogeneous’.  If reality is so discontinuous and heterogeneous, \nhowever, the historical horizon of redemption to which Ginzburg also recalls his readers is \nunintelligible. At this point, the literary and historiographical imagination, which Ginzburg insists on \nkeeping apart, despite his increasing drift toward an understanding of historiography as a narrative \nexercise, merge into one as they both desperately seek to ‘stay, awaken the dead, and make whole what \nhas been smashed’ (Benjamin 1973a: 249). Of course, as Benjamin also noted, this is work for the \nMessiah. The fuller statement of the Benjaminian passage, which Ginzburg cites only partially in the \nfinal lines of his introduction to The Cheese and the Worms, is: \nA chronicler who recites events without distinguishing between major and minor ones acts in accordance with \nthe following truth: nothing that has ever happened should be regarded as lost to history. To be sure, only a \nredeemed mankind receives the fullness of its past – which is to say, only for a redeemed mankind has its past \nbecome citable in all its moments. Each moment it has lived becomes a citation à l’ordre du jour – and that day \nis Judgment Day (Benjamin 1973a: 246). \nThat Ginzburg cannot speak in such messianic terms is proof of the extraordinary hold of the scientific \nimagination, despite Ginzburg’s attempts to free historiographical practice from it, so that there is still \nsomething to learn from Fisher’s reflections on our irredeemably fractured lives, about their dangers \nand all their possibilities.6 \n 13  \nNotes \n \n1 For an introduction to Benjamin and his philosophy of history, as well as to its relevance to the contemporary problem that \nGinzburg seeks to address, see Fritsch (2005); also Osborne (1995). \n2 In this essay, the term ‘post-structuralism’ identifies those such as Foucault, who, like structuralists such as Claude Levi-\nStrauss, maintain that the relationship between sign and referent is secured by the cross-reference of signs, but, unlike \nstructuralists, maintain that the rules of cross-reference are historically variable; although they share common origins, post-\nstructuralists’ understanding of language is therefore fundamentally different to the critique of reference advanced by \ndeconstructionists such as Jacques Derrida; see McDonald (2004)). Ginzburg’s concern about post-structuralism, \ndeconstruction and their implications for historiographical practice are already evident in his introduction to the original, Italian \nversion of The Cheese and the Worms, but see also Ginzburg (1994; 1999). While the implicit historical relativism of post-\nstructuralism clearly is an anathema to Ginzburg, Ginzburg’s relationship to Levi-Strauss is more ambiguous, insofar as Levi-\nStrauss reasserts the fundamental importance of semiotics, but within the very kind of totalising, scientific framework that \nGinzburg criticises; see Ginzburg (1979: 273). \n3 Records in the Rudolph Fisher Collection, held in the John Hay Library at Brown University, suggest that, early in his career, \nFisher wrote a short story about a radiologist, The Emancipation of Science (1919), in which he explored the relationship \nbetween science, democracy and Duboisian ‘uplift’, but this short story remained unpublished and the manuscript is now \npossibly lost. Fisher’s increasing scepticism about the emancipating connotations of scientific rationality is evident in the \nprogression from The Emancipation of Science, through The South Lingers On (1925 )  to The Conjure Man Dies (1932) and Dr. \nArcher’s Nose (1935). \n4 On Himes, see Soitos, (1996: 125-178) and Rabinowitz (1988). Significantly, for all her disagreements with Soitos’ reading of \nThe Conjure Man Dies, Gosselin (1999) is equally committed to grounding a distinctive and autonomous African-American \nculture in some aspect or another of a primitive and original African culture, by suggesting that, whereas Oedipus’ search for the \ntruth, an ultimately tragic search, structures the classical detective genre, the African-American hardboiled genre is structured \nby the story of the Egyptian god Osiris, so that the narrative is less focussed on the search for the murderer than on the collective \nsearch for the redemption of the victim; see also Lock (1994). While some aspects of The Conjure Man Dies do fit, there are too \nmany aspects that are better understood as expressing deep reservations about the celebrations of all things African; see also \nCondé (2002). \n5 Benjamin is of course famous for his discussion of the revolutionary potential of the cinematic medium, especially in the hands \nof directors such as Eisenstein; see Benjamin (1973b). Although Ginzburg (1994: 26) does not draw this connection directly, he \ndoes so through the work of Siegfried Kracauer, historian and film critic. \n6 From this perspective, Ginzburg’s insistence that the oral form is more attuned to the realities of the phenomenal world than is \nthe written form recalls Martin Heidegger’s reflections on the relationship between poetry and prose, in which the loss of the \nformer was symptomatic of all that is problematic about modern culture; see Heidegger (1975). While Ginzburg seeks to \novercome the rupture in the relationship between language and the world, of which the opposition between prose and poetry is a \nsymptom, by returning to an Aristotelian understanding of rhetoric, he fails to address the ontological problem at issue, one with \nwhich language has been saddled since the Nietzschean ‘death of God’. \n 14  \nWorks Cited \nBhabha, Homi. 1994. ‘DissemiNation: Time, Narrative and the Margins of the Modern Nation’. In Bhabha. The Location  of \nCulture. London: Routledge, 139-170. \nBaker, Houston. 1987. Modernism and the Harlem Renaissance. Chicago: University of Chicago Press. \nBell, Bernard W.  1996.  ‘Genealogical Shifts in Du Bois’ Discourse on Double Consciousness as the Sign of African American \nDifference’. In Bell, Grosholz, Emily R. and Stewart, James B. (eds.). W.E.B. Dubois on Race and Culture: Philosophy, Politics \nand Poetics. New York: Routledge, 87-108. \nBenjamin, Walter. 1973a [1940]. ‘Theses on the Philosophy of History’. In Arendt, Hannah (ed.). Illuminations. London: \nFontana, 244-255. \nBenjamin, Walter. 1973b [1936]. ‘The Work of Art in the Age of Mechanical Reproduction’. In Arendt, Hannah (ed.). \nIlluminations. London: Fontana, 211-244. \nCacioppo, Marina. 2003. ‘Insider Knowledge versus Outsider Perspective in Early Italian American and African American \nDetective Stories’. In Fischer-Hornung, Dorothea and Mueller, Monika (eds.). Sleuthing Ethnicity: The Detective in Multiethnic \nCrime Fiction. Cranbury: Associated Universities Press, 23-35. \nCanguilhem,  Georges. 1991 [1966]. The Normal and the Pathological. New York: Zone Books. \nCaygill, Howard. 1996. ‘Drafts for a Metaphysics of the Gene’. In Tekhnema 3; http:\/\/tekhnema.free.fr\/3Caygill.htm (accessed 6 \nMarch 2007). \nConan Doyle,  Arthur. 2006 [1888]. A Study in Scarlet; http:\/\/sherlock-holmes.classic-literature.co.uk\/a-study-in-scarlet\/ \n(accessed 13 October 2006). \nCondé, Mary. 2002.  ‘The ‘almost bitter murmur’ in Rudolph Fisher’s The Conjure Man Dies’. In Rudolph Fisher Newsletter, \nSummer 2002. \nCorbin, Alain (1986) The Foul and the Fragrant: Odor and the French Social Imagination. Cambridge, MA.: Harvard \nUniversity Press. \nDyer, Richard. 1997. White. London. \nFisher, Rudolph. 1995 [1932]. The Conjure Man Dies. London: X Press.  \nFisher, Rudolph. 1996a [1935]. John Archer’s Nose.  In Joy and Pain. London: X Press, 148-182. \nFisher, Rudolph. 1996b [1925].  High Yaller. In Joy and Pain. London: X Press, 74-90. \nFisher, Rudolph. 1996c [1925].  City of Refuge. In Joy and Pain. London: X Press, 12-36 \nFisher, Rudolph. 1994 [1928]. The Walls of Jericho. Ann Arbor: University of Michigan Press. \nFoucault, Michel. 1994b [1966]. The Order of Things: An Archaeology of the Human Sciences. New York: Vintage Press, 1994. \nFoucault, Michel. 1994a [1963]. The Birth of the Clinic: An Archaeology of Medical Perception. New York: Vintage Press. \nFritsch,  Matthias. 2005. The Promise of Memory: History and Politics in Marx, Benjamin, and Derrida. Albany: State \nUniversity of New York Press. \nGates, Henry L. 1988. The Signifying Monkey: A Theory of African-American Literary Criticism. Oxford: Oxford University \nPress. \nGinzburg, Carlo. 1999. History, Rhetoric, and Proof. Hanover: University Press of New England. \nGinzburg, Carlo. 1994. ‘Checking the Evidence: The Judge and the Historian’. In Chandler, James, Davidson, Arnold I. and \nHarootunian, Harry (eds.). Questions of Evidence: Proof, Practice, and Persuasion across the Disciplines. Chicago: University \nof Chicago Press, 290-303. \nGinzburg, Carlo. 1993. ‘Microhistory: Two or Three Things that I Know About It’. In Critical Inquiry 20 , 10-34. \n 15  \nGinzburg, Carlo. 1990. ‘Clues: The Roots of an Evidential Paradigm’. in Myths, Emblems, Clues. London: Hutchinson, 96-125. \nGinzburg,  Carlo. 1980 [1976]. The Cheese and the Worms: The Cosmos of a Sixteenth-Century Miller. London: Rouledge & \nKegan Paul. \nGinzburg, Carlo. 1979. ‘Clues: Roots of a Scientific Paradigm’. In Theory and Society 7, 273-288. \nGordon, Robert S.C.  2001. ‘A Neo-rationalist Tendency in the Field of the Literary Intellectual in 1970s Italy: Vittorini, Sciascia, \nGinzburg’. In Journal of Modern Italian Studies 6, 249-264. \nGosselin,  Adrienne. 1999. ‘The Psychology of Uncertainty: (Re)inscribing Indeterminacy in Rudolph Fisher’s The Conjure Man \nDies’. In Other Voices, 1 ; http:\/\/www.othervoices.org\/1.3\/agosselin\/harlem.html (accessed 13 November 2006). \nGosselin, Adrienne. 1998.  ‘The World Would do Better to Ask Why is Frimbo Sherlock Holmes? Investigating Liminality in \nFisher’s The Conjure Man Dies’. In African American Review 32 , 607-619. \nGutting, Gary. 1989. Michel Foucault’s Archaeology of Scientific Reason. Cambridge: Cambridge University Press. \nHarris, Susan C. 2003. ‘Pathological Possibilities: Contagion and Empire in Doyle’s Sherlock Holmes Stories’. In Victorian \nLiterature and Culture 31, 447-466.  \nHeidegger, Martin. 1975 [1950].  ‘What Are Poets For?’. In Poetry, Language, Thought. New York: Harper & Row, 91-142. \nHiller, Susan Hiller (ed.). 1991. The Myth of Primitivism: Perspectives on Art. London: Routledge. \nHirshbein, Laura D. 2000. ‘The Glandular Solution: Sex, Masculinity and Aging in the 1920s’. In Journal of the History of \nSexuality 9, 277-304. \nKnight, Stephen. 1980. Form and Ideology in Crime Fiction. Bloomington: Indiana University Press. \nLa Capra, Dominick. 1985. History & Criticism. Ithaca: Cornell University Press. \nLewis, David L. 1997 [1979]. When Harlem Was in Vogue. London: Penguin. \nLock,  Helen. 1994. A Case of Mis-taken Indentity: Detective Undercurrents in Recent African-American Fiction. New York: \nPeter Lang. \nMarez, Curtis. 1997. ‘The Other Addict: Reflections on Colonialism and Oscar Wilde’s Opium Smoke Screen’. In English Literary \nHistory 64, 257-287.  \nMcCluskey, John (ed.). 1987. The City of Refuge: The Collected Stories of Rudolph Fisher. Columbia: University of Missouri \nPress. \nMcDonald, Henry. 2004.  ‘Language and Being: Crossroads of Modern Literary Theory and Classical Ontology’. In Philosophy \nand Social Criticism 30, 187-220.. \nMagnússon, Sigurđur G.  2003. ‘The Singularization of History : Social History and Microhistory within the Postmodern State of \nKnowledge’. In Journal of Social History 36, 701-735. \nOsborne, Peter. 1995. The Politics of Time: Modernity and the Avant-Garde. London: Verso. \nPeltonen, Matti. 2001. ‘Clues, Margins, and Monads: The Micro-Macro Link in Historical Research’. In History and Theory 40 , \n347-359. \nPottage,  Alain. 2001. ‘Persons and Things: An Ethnographic Analogy’. In Economy and Society 30, 112-138. \nProust, Marcel. 1982 [1913-1919] Remembrance of Things Past: Vol. 1: Swann's Way & Within a Budding Grove. New York: \nVintage Press. \nRabinowitz, Peter J. (1988),  ‘Chandler Comes to Harlem: Racial Politics in the Thrillers of Chester Himes’. In Rader, Barbara A.  \nand Zettler, Howard G. (eds.). The Sleuth and the Scholar: Origins, Evolution, and Current Trends in Detective Fiction. New \nYork: Greenwood Press, 19-29. \nReitz, Caroline. 2004. Detecting the Nation: Fictions of Detection and the Imperial Venture. Columbus: Ohio State University \nPress. \n 16  \nScholem,  Gershom. 1975. Walter Benjamin: Die Geschichte einer Freundschaft. Frankfurt: Suhrkamp. \nSengoopta, Chandak . 2003. ‘‘Dr Steinach Coming to Make Old Young!’: Sex Glands, Vasectomy and the Quest for Rejuvenation \nin the Roaring Twenties’. In Endeavour 27, 122-126. \nSimawe, Saadi A. (ed.). Black Orpheus: Music in African American Fiction from the Harlem Renaissance to Toni Morrison. \nNew York: Garland Press. \nSimms, Eva-Maria. 2005. ‘Goethe, Husserl, and the Crisis of the European Sciences’. In Janus Head 8: 160-172. \nSoitos, Stephen. 1996. The Blues Detective: A Study of African American Detective Fiction. Amherst: University of \nMassachusetts Press. \nSprinker,  Michael. 1998. History and Ideology in Proust: A La Recherche du Temps Perdu and the Third French Republic. \nLondon: Verso. \nYoung, Robert. 1990. White Mythologies: Writing History and the West. London: Routledge. \n"}