{"doi":"10.1016\/S0734-743X(98)00014-1","coreId":"140204","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/5499","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/5499","10.1016\/S0734-743X(98)00014-1"],"title":"A note on the behind armour effects from perforated alumina\/aluminium targets","authors":["Hazell, P. J.","Fellows, N. A.","Hetherington, J. G."],"enrichments":{"references":[{"id":37971717,"title":"A Study of Fragmentation in the Ballistic Impact of Ceramics.","authors":[],"date":"1994","doi":"10.1016\/0734-743x(94)90122-2","raw":"R. L. Woodward, W. A. Gooch, R. G. O’Donnell, W. J. Perciballi, B. J. Baxter and S. D. Pattie, A Study of Fragmentation in the Ballistic Impact of Ceramics. Int. J. Impact Engng, 15, No. 5, 605-618, (1994).","cites":null},{"id":37971718,"title":"Hypervelocity Penetration of Ceramics.","authors":[],"date":"1987","doi":"10.1016\/0734-743x(87)90036-4","raw":"S. J. Bless, Z. Rosenberg and B. Yoon, Hypervelocity Penetration of Ceramics. Int. J. Impact Engng. 5, 165-171 (1987). Int. J. Impact Engng Vol. 21, No. 7, pp. 589-595, 1998","cites":null},{"id":37971716,"title":"Impact on Ceramic Targets.","authors":[],"date":"1987","doi":"10.1115\/1.3173022","raw":"M. Mayseless, W. Goldsmith, S. P. Virostek, and S. A. Finnegan, Impact on Ceramic Targets. J. Appl. Mech. 54, 373-378 (1987).","cites":null}],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"1998-12-31T00:00:00Z","abstract":"A thin, ceramic-faced armour, separated from a thick metal block, has been\nsubjected to high-velocity impact by a 6.35 mm diameter steel sphere.\nExperimental work was carried out which compared firings into ceramic-faced\naluminium armour, separated from thick aluminium witness blocks, with firings\ninto the thick aluminium blocks alone. The depth of penetration and the area of\ndamage were measured and an estimated percentage weight saving due to the\ninclusion of the ceramic-faced armour was calculated at varying velocity. This\nnote yields useful information for the design and application of ceramic\napplique systems","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140204.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/S0734-743X(98)00014-1","pdfHashValue":"7260e70b40b2ec7ed60f48d243edded5d1c77f2f","publisher":"Elsevier Science B.V., Amsterdam.","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/5499<\/identifier><datestamp>2011-09-20T11:13:18Z<\/datestamp><setSpec>hdl_1826_13<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>A note on the behind armour effects from perforated alumina\/aluminium targets<\/dc:title><dc:creator>Hazell, P. J.<\/dc:creator><dc:creator>Fellows, N. A.<\/dc:creator><dc:creator>Hetherington, J. G.<\/dc:creator><dc:subject>impact<\/dc:subject><dc:subject>ceramic-faced armour<\/dc:subject><dc:subject>behind armour debris<\/dc:subject><dc:subject>hypervelocity<\/dc:subject><dc:description>A thin, ceramic-faced armour, separated from a thick metal block, has been\nsubjected to high-velocity impact by a 6.35 mm diameter steel sphere.\nExperimental work was carried out which compared firings into ceramic-faced\naluminium armour, separated from thick aluminium witness blocks, with firings\ninto the thick aluminium blocks alone. The depth of penetration and the area of\ndamage were measured and an estimated percentage weight saving due to the\ninclusion of the ceramic-faced armour was calculated at varying velocity. This\nnote yields useful information for the design and application of ceramic\napplique systems.<\/dc:description><dc:publisher>Elsevier Science B.V., Amsterdam.<\/dc:publisher><dc:date>2011-06-14T23:23:26Z<\/dc:date><dc:date>2011-06-14T23:23:26Z<\/dc:date><dc:date>1998-12-31T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>0734-743X<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/S0734-743X(98)00014-1<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/5499<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0734-743x","issn:0734-743X"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":1998,"topics":["impact","ceramic-faced armour","behind armour debris","hypervelocity"],"subject":["Article"],"fullText":"Int. J. Impact Engng Vol. 21, No. 7, pp. 589-595, 1998 \n 1\nA NOTE ON THE BEHIND ARMOUR EFFECTS FROM \nPERFORATED ALUMINA \/ ALUMINIUM TARGETS \n \nP.  J. HAZELL, N. A. FELLOWS and J. G. HETHERINGTON \nCranfield University, Royal Military College of Science, \n Shrivenham, Swindon, SN6 8LA, UK. \n \nSummary - A thin, ceramic-faced armour, separated from a thick metal block, has been subjected to \nhigh velocity impact by a 6.35mm diameter steel sphere. Experimental work was carried out which \ncompared firings into ceramic-faced aluminium armour, separated from thick aluminium ‘witness’ \nblocks, with firings into the thick aluminium blocks alone. The depth of penetration and the area of \ndamage were measured and an estimated percentage weight saving due to the inclusion of the ceramic-\nfaced armour was calculated at varying velocity. This note yields useful information for the design and \napplication of ceramic appliqué systems. \nNOTATION \n \na thickness of the aluminium thin plate \nc thickness of the ceramic \nr penetration depth into the aluminium block with the ceramic-faced aluminium armour \nx penetration depth into the aluminium block without the ceramic-faced aluminium armour \nAaa target area of the aluminium thin plate \nAc target area of the ceramic \nAab target area of the aluminium block \nWS weight saving due to the introduction of a ceramic-faced aluminium armour  \nρaa density of the aluminium thin plate \nρab density of the aluminium block \nρc density of the ceramic \nINTRODUCTION \nInt. J. Impact Engng Vol. 21, No. 7, pp. 589-595, 1998 \n 2\n \nIt has long been accepted that ceramic materials can play an important part in ballistic \nprotection. Their high compressive strength and low density make them ideal \ncandidates for armour systems. A limitation of using ceramic as armour is its brittle \nnature, requiring only a small fraction of the impact energy to fracture [1], and poor \nmulti-hit capability. Hence lightweight ceramic armour systems generally consist of a \nceramic tile bonded to a ductile backing plate of high specific strength. Although the \nmajority of research has focused on the prevention of perforation, an increasing \nconcern over the past few years is the effect of behind-armour debris on a structure set \nat a distance from the armour. Perforation of such armours results in small fragments \ntravelling at high velocity [2] which can cause damage to the protected structure.  \n \nThe aim of this work is to investigate the damage caused by behind-armour debris \nfrom a steel sphere perforating a ceramic-faced aluminium armour. Thick aluminium \nwitness blocks were used to assess the damage. \n \nEXPERIMENTAL SET-UP \n \nTo evaluate the performance of ceramic-faced aluminium armour, for impacts in the \nrange 700m\/s to 3000 m\/s, firings were carried out using a 7.62 mm rifle and a two \nstage light gas gun. \n \nA sabotted round was made up for firing from a standard 7.62 mm rifle to achieve \nrelatively low velocities. The sabot, which consists of an aluminium support plate and \nInt. J. Impact Engng Vol. 21, No. 7, pp. 589-595, 1998 \n 3\na polycarbonate pusher, was designed to propel the one gramme spherical steel \nprojectile used in the two-stage, light-gas gun. \n \nThe performance of the armour was assessed by comparing the damage done to an \naluminium witness block when firing with and without the armour in place. A jig was \ndesigned in order to ensure that the spacing between the armour and aluminium \nwitness block was consistent from firing to firing (Figure 1). \n \nThe ceramic-faced armour, consisting of a sheet of 4 mm alumina (Sintox FA) bonded \nto a 2 mm aluminium (5083) backing plate, was fixed into the jig so that a gap of 30 \nmm existed between the aluminium back of the armour and the aluminium (6082 T6) \nblock. To reduce edge effects [3], the ceramic armour had a target area of 100 mm by \n100 mm and the aluminium block was a 100mm cube. \n \nA screw-threaded spigot was incorporated into the jig to clamp the block to the front \nsteel plate. This steel plate had a 80mm square hole, to allow the projectile to pass \nthrough and impact the block. \n \nFigure 1: Schematic of target, aluminuim block and jig. \n \nThe material properties of the metallic materials used in the experiments are given \nbelow in Table 1. \nTable 1. \nRESULTS \n \nInt. J. Impact Engng Vol. 21, No. 7, pp. 589-595, 1998 \n 4\nTwo sets of experiments were performed using the above experimental set-up. The \nfirst set of experiments entailed firing into the ceramic-faced aluminium and \nexamining the effect on the witness block set at a distance behind the armour. The \nsecond set of experiments entailed firing into the aluminium witness block alone. \n \nDepth of Penetration Measurements \n \nBoth sets of experiments resulted in the aluminium witness block being penetrated. \nThe aluminium blocks were sectioned and the damaged zone was measured with a \ntravelling microscope. The depth of penetration (DOP) for each case is shown in \nFigure 2. \n \nFigure 2: Depth of Penetration measurements for the aluminium block with and without the ceramic-\nfaced armour. \n \nIt will be seen from Figure 2 that, for firings without the ceramic armour in place, a \nrapid drop in penetration is observed at velocities above 1800m\/s. This is due to the \nbrittle nature of the projectile used in this experimental programme. At 1509m\/s the \npost impact crater is very long and thin (Figure 3a) and the projectile is clearly \nvisible. A single fracture crosses the diameter of the sphere. At velocities above \n1800m\/s the crater is shallow (Figure 3b), with a mushroomed end and there is no \nvisible evidence of the projectile. These observations are characteristic of projectile \nbreak up and erosion.  Using Energy Dispersive X-Ray Analysis within the crater, \nsmall deposits of the projectile material were revealed on the crater wall. No \nprojectile fragments were recovered. It is interesting to note that the step change \nInt. J. Impact Engng Vol. 21, No. 7, pp. 589-595, 1998 \n 5\nobserved in Figure 2 is not mirrored in Figure 4. This indicates that on impact, the \ndiameter of the crater measured at the front surface of the aluminium block is not \ngreatly affected by the break-up of the projectile. Instead, the incoherent nature of the \nprojectile will cause the crater to mushroom as fragments separate and erode. The \nprojectiles’ penetrative ability will therefore be reduced. \n \nFigure 3a,b: Comparison of crater shape showing the effect of projectile fragmentation. \n \nSpread of Damage Measurements \n \nThe damaged zone on the aluminium witness block was observed to be approximately \ncircular and so the diameter of the zone was adopted as a measure of the spread of \ndamage. Figure 4 describes the spread of damage observed on the witness block as a \nfunction of impact velocity for each of two configurations: with and without the \nceramic-faced armour in place. \n \nFigure 4: Spread of damage measurements for the aluminium block with and without the ceramic-faced \narmour. \n \nIt can be seen from Figure 4 that, throughout the velocity range, the spread of damage \nis greater with the ceramic armour in place than without. The rate of increase with \nvelocity is also greater with the ceramic-faced armour in place. \n \nDISCUSSION \n \nInt. J. Impact Engng Vol. 21, No. 7, pp. 589-595, 1998 \n 6\nFigures 5 and 7 describe the effect on the witness block of shielding it with the \nceramic-faced armour. For depth of penetration and damaged area, a graph is plotted \nof the change in the parameter resulting from the inclusion of the ceramic-faced \narmour. \n \nFigure 5: Reduction in penetration depth resulting from inclusion of the ceramic-faced armour. \n \nAs can be seen from Figure 5, the reduction in penetration, resulting from including \nthe ceramic-faced armour, increases with increasing impact velocity up to \napproximately 1800m\/s, when, due to shattering of the projectile, a negative step \nchange occurs. Including a ceramic-faced armour, induces fragmentation even at low \nvelocities due to the high hardness and high compressive strength of the ceramic. \nClearly, if the sub-structure causes fragmentation to the projectile then the advantages \nof applying a ceramic armour are reduced. \n \nA measure of the percentage weight saving resulting from the inclusion of the \nceramic-faced armour system can be derived from Bless et al [3]. For the Aluminium \nblock alone, the required mass required to stop a projectile can be estimated by: \n \nρab abA x                                                                    (1) \nInt. J. Impact Engng Vol. 21, No. 7, pp. 589-595, 1998 \n 7\n \nAlso, the mass of the material required to stop a projectile which has perforated a \nceramic-faced armour can be approximated by: \n \nρ ρ ρc c aa aa ab abA c A a A r+ +                                          (2) \n \nIn this experimental programme Ac= Aaa=Aab, therefore the estimated % weight \nsaving achieved by including a ceramic-faced armour is given by: \n \nWS\nc a r\nx\nc aa ab\nab\n= − + +⎛⎝⎜\n⎞\n⎠⎟\n⎡\n⎣⎢\n⎤\n⎦⎥\n×1 100%ρ ρ ρρ                             (3) \n \nIt should be noted that Equation 3 provides an approximation of the % weight saving \nbecause the depth of penetration in a thick target will always be less than the \nthickness of target necessary to stop the projectile. \n \nThis relationship can be used with various appliqué systems and threat types to \ncompare performance. For this experimental programme the relationship is plotted \nagainst velocity in Figure 6. \n \nFigure 6: Percentage weight saving resulting from inclusion of the ceramic-faced armour. \n \nIncluding a ceramic-faced armour results in an effective weight saving of up to 50% \nat 1800m\/s, after which the advantage of applying such an appliqué armour is \ndramatically reduced.  \nInt. J. Impact Engng Vol. 21, No. 7, pp. 589-595, 1998 \n 8\n  \nIn contrast, Figure 7 shows the area of damage is larger with the ceramic armour in \nplace than without, due to the spread of debris. \n \n \nFigure 7: Increase in the area of damage resulting from inclusion of the ceramic-faced armour. \n \nMoreover, the difference in the area of debris spread is shown to rapidly increase with \nincreasing velocity (Figure 7). Firing into an aluminium block alone results in a \nrelatively small area of front surface damage (i.e. the area of the hole). Increasing the \nvelocity of impact on the ceramic-faced aluminium results in an increasing degree of \npetalling of the back plate and hence spread of ceramic debris (Figure 8). \n \nFigure 8a,b: Comparison of the spread of damage with and without the ceramic-faced armour. \n \nCONCLUDING REMARKS \n \nIt can be seen that the inclusion of a ceramic-faced aluminium armour separated from \nan aluminium block has reduced penetration substantially. However, this is at a cost \nof increased damage area. At high velocities the reduction in the depth of penetration \noffered by the ceramic-faced armour becomes less when, without the armour, the \nprojectile fragments on direct impact with the aluminium block. \n \nThe weight saving achieved by using ceramic-faced aluminium armour is dependent \non the velocity of impact and threat type. In this programme of study, due to projectile \nInt. J. Impact Engng Vol. 21, No. 7, pp. 589-595, 1998 \n 9\nfragmentation, the weight saving achieved was significantly lower for velocities \nabove 1800 m\/s. \n \nAcknowledgements - The authors would like to thank Mr. Peter Barton, Mr. John Crocker and Dr. \nMike Iremonger for their assistance throughout the work. This work was partially funded by Morgan \nMatroc and British Aerospace Defence Limited, Royal Ordnance Division. \n \nREFERENCES \n                                                          \n1. M. Mayseless, W. Goldsmith, S. P. Virostek, and S. A. Finnegan, Impact on \nCeramic Targets. J. Appl. Mech. 54, 373-378 (1987). \n2. R. L. Woodward, W. A. Gooch, R. G. O’Donnell, W. J. Perciballi, B. J. Baxter and \nS. D. Pattie, A Study of Fragmentation in the Ballistic Impact of Ceramics. Int. J. \nImpact Engng, 15, No. 5, 605-618, (1994). \n3. S. J. Bless, Z. Rosenberg and B. Yoon, Hypervelocity Penetration of Ceramics. Int. \nJ. Impact Engng. 5, 165-171 (1987). \nInt. J. Impact Engng Vol. 21, No. 7, pp. 589-595, 1998 \n \n 1\n \n \n \n \n \n \nFigure 1: Schematic of target, aluminuim block and jig. \n \n \n \n \n \n \nTable 1. \n \n Steel Sphere Thin Plate Witness Block \nMaterial SAE 52100 ASME 5083 ASME 6082 T6 \nDimensions (mm) Ø 6.35 100×100×2 100×100×100 \nDensity (Kg\/m3) 7810 2660 2710 \nYield Strength (MPa) 1420 145 257 \n \n \nInt. J. Impact Engng Vol. 21, No. 7, pp. 589-595, 1998 \n \n 2\n0\n5\n10\n15\n20\n25\n0 500 1000 1500 2000 2500 3000 3500\nVelocity (m\/s)\nD\nep\nth\n o\nf P\nen\net\nra\ntio\nn \n(m\nm\n)\nWithout ceramic armour\nWith ceramic armour\n \nFigure 2: Depth of Penetration measurements for the aluminium block with and without the ceramic-\nfaced armour. \n \n \n \n \n \nFigure 3: Comparison of crater shape showing the effect of projectile fragmentation. \nInt. J. Impact Engng Vol. 21, No. 7, pp. 589-595, 1998 \n \n 3\n0\n5\n10\n15\n20\n25\n30\n35\n0 500 1000 1500 2000 2500 3000 3500\nVelocity (m\/s)\nD\nia\nm\net\ner\n (m\nm\n)\nWithout ceramic armour\nWith ceramic armour\n \nFigure 4: Spread of damage measurements for the aluminium block with and without the ceramic-faced \narmour. \n \n0\n2\n4\n6\n8\n10\n12\n14\n16\n18\n20\n0 500 1000 1500 2000 2500 3000\nVelocity (m\/s)\nR\ned\nuc\ntio\nn \nin\n D\nep\nth\nof\n P\nen\net\nra\ntio\nn \n(m\nm\n)\n \nFigure 5: Reduction in penetration depth resulting from inclusion of the ceramic-faced armour. \n \nInt. J. Impact Engng Vol. 21, No. 7, pp. 589-595, 1998 \n \n 4\n \n0\n10\n20\n30\n40\n50\n60\n0 500 1000 1500 2000 2500 3000\nVelocity (m\/s)\n %\n W\nei\ngh\nt S\nav\nin\ng\n \nFigure 6: Percentage weight saving resulting from inclusion of the ceramic-faced armour. \n0\n50\n100\n150\n200\n250\n300\n350\n400\n450\n0 500 1000 1500 2000 2500 3000\nVelocity (m\/s)\nIn\ncr\nea\nse\n o\nf D\nam\nag\ne \nA\nre\na \n(m\nm\n2 )\n \nFigure 7: Increase in the area of damage resulting from inclusion of the ceramic-faced armour. \n \nInt. J. Impact Engng Vol. 21, No. 7, pp. 589-595, 1998 \n \n 5\n \nFigure 8 (a,b): Comparison of the spread of damage with and without the ceramic-faced armour. \n"}