{"doi":"10.1002\/ana.21767","coreId":"195913","oai":"oai:lra.le.ac.uk:2381\/8042","identifiers":["oai:lra.le.ac.uk:2381\/8042","10.1002\/ana.21767"],"title":"Glutamate receptor-mediated ischemic injury of premyelinated central axons","authors":["Alix, James J.P.","Fern, Robert"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-06-22","abstract":"This is the author’s submitted draft of the paper published as Annals of Neurology, 2009, 66 (5), pp. 682-693.  The definitive version is available at www3.interscience.wiley.com, Doi: 10.1002\/ana.21767Objective: Ischemic injury of axons is a feature of periventricular leukomalacia, a pathological correlate of cerebral palsy. Recent evidence suggests that axons are damaged before they receive the first layer of compact myelin. Here we examine the cellular mechanisms underlying ischemic-type injury of premyelinated central axons.\\ud\nMethods: Two-thirds of axons in the postnatal day 10 (P10) rat optic nerve are small premyelinated axons (<0.4µm in diameter), and one-third have undergone radial expansion in preparation for glial contact and the onset of myelination. Compound action potential recording and quantitative electron microscopy were used to examine the effect of modeled ischemia (oxygen-glucose deprivation) upon these two axon populations. Glutamate receptor (GluR) expression was investigated using polymerase chain reaction (PCR) and immunostaining approaches at the confocal light and ultrastructural levels.\\ud\nResults: Oxygen-glucose deprivation produced action potential failure and focal breakdown of the axolemma of small premyelinated axons at sites of contact with oligodendrocyte processes, which were also disrupted. The resulting axon loss was Ca²+- dependent, Na+- and Cl¯-independent, and required activation of N-methyl-D-aspartic acid (NMDA) and non-NMDA GluRs.  NMDA receptor expression was localized to oligodendrocyte processes at sites of contact with premyelinated axons, in addition to expression within compact myelin. No periaxonal NMDA receptor expression was observed on oligodendrocyte processes ensheathing large premyelinated axons and no protective effect of GluR block was observed in these axons.\\ud\nInterpretation: NMDA receptor-mediated injury to oligodendrocyte processes navigating along small premyelinated axons precedes damage to the underlying axon, a phenomena that is lost following radial expansion and subsequent oligodendrocyte ensheathment.National Institutes of Neurological Disorders and Stroke; Grant Number: NS44875","downloadUrl":"http:\/\/onlinelibrary.wiley.com\/doi\/10.1002\/ana.21767\/abstract","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/8042\/3\/Glutamate%20receptor.pdf","pdfHashValue":"a2ecaa2f261ed21f2d9da12570778c03f7201976","publisher":"Wiley-Blackwell","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/8042<\/identifier><datestamp>\n                2015-12-02T16:17:15Z<\/datestamp><setSpec>\n                com_2381_112<\/setSpec><setSpec>\n                com_2381_9550<\/setSpec><setSpec>\n                col_2381_113<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nGlutamate receptor-mediated ischemic injury of premyelinated central axons<\/dc:title><dc:creator>\nAlix, James J.P.<\/dc:creator><dc:creator>\nFern, Robert<\/dc:creator><dc:subject>\nAxon<\/dc:subject><dc:subject>\nIschemia<\/dc:subject><dc:subject>\nGlutamate<\/dc:subject><dc:description>\nThis is the author’s submitted draft of the paper published as Annals of Neurology, 2009, 66 (5), pp. 682-693.  The definitive version is available at www3.interscience.wiley.com, Doi: 10.1002\/ana.21767<\/dc:description><dc:description>\nObjective: Ischemic injury of axons is a feature of periventricular leukomalacia, a pathological correlate of cerebral palsy. Recent evidence suggests that axons are damaged before they receive the first layer of compact myelin. Here we examine the cellular mechanisms underlying ischemic-type injury of premyelinated central axons.\\ud\nMethods: Two-thirds of axons in the postnatal day 10 (P10) rat optic nerve are small premyelinated axons (<0.4µm in diameter), and one-third have undergone radial expansion in preparation for glial contact and the onset of myelination. Compound action potential recording and quantitative electron microscopy were used to examine the effect of modeled ischemia (oxygen-glucose deprivation) upon these two axon populations. Glutamate receptor (GluR) expression was investigated using polymerase chain reaction (PCR) and immunostaining approaches at the confocal light and ultrastructural levels.\\ud\nResults: Oxygen-glucose deprivation produced action potential failure and focal breakdown of the axolemma of small premyelinated axons at sites of contact with oligodendrocyte processes, which were also disrupted. The resulting axon loss was Ca²+- dependent, Na+- and Cl¯-independent, and required activation of N-methyl-D-aspartic acid (NMDA) and non-NMDA GluRs.  NMDA receptor expression was localized to oligodendrocyte processes at sites of contact with premyelinated axons, in addition to expression within compact myelin. No periaxonal NMDA receptor expression was observed on oligodendrocyte processes ensheathing large premyelinated axons and no protective effect of GluR block was observed in these axons.\\ud\nInterpretation: NMDA receptor-mediated injury to oligodendrocyte processes navigating along small premyelinated axons precedes damage to the underlying axon, a phenomena that is lost following radial expansion and subsequent oligodendrocyte ensheathment.<\/dc:description><dc:description>\nNational Institutes of Neurological Disorders and Stroke; Grant Number: NS44875.<\/dc:description><dc:date>\n2010-06-15T09:12:50Z<\/dc:date><dc:date>\n2010-06-15T09:12:50Z<\/dc:date><dc:date>\n2009-06-22<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nAnnals of Neurology, 2009, 66 (5), pp. 682-693<\/dc:identifier><dc:identifier>\n0364-5134<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/8042<\/dc:identifier><dc:identifier>\nhttp:\/\/onlinelibrary.wiley.com\/doi\/10.1002\/ana.21767\/abstract<\/dc:identifier><dc:identifier>\n10.1002\/ana.21767<\/dc:identifier><dc:language>\nen<\/dc:language><dc:publisher>\nWiley-Blackwell<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["0364-5134","issn:0364-5134"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":["Axon","Ischemia","Glutamate"],"subject":["Article"],"fullText":"For Peer Review\n \n \n \n \n \n \n \nGlutamate receptor-mediated ischemic injury of \npremyelinated central axons. \n \n \nJournal: Annals of Neurology \nManuscript ID: ANA-09-0029.R1 \nWiley - Manuscript type: Research Article \nDate Submitted by the \nAuthor: \n \nComplete List of Authors: Alix, James; University of Liecester, Cell Physiology and \nPharmacology \nFern, Robert; University of Liecester, Cell Physiology and \nPharmacology \nDomain: Child Neurology \nKeywords: cerebral palsy, ischemia, axon \n  \n \n \n \nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n 1 \nGlutamate receptor-mediated ischemic injury of premyelinated central axons. \n \nJames J. P. Alix and Robert Fern \nDepartment of Cell Physiology and Pharmacology, University of Leicester, Leicester, \nUK. \n \nShort Title: Ischemic injury of developing central axons \nKey Words: Axon; Ischemia; Glutamate \n \n \nFigures: 7 (+ 5 supplemental Figures) \nWords: 2999 \nPages: 21 \n \nCorresponding Author: \nDr Bob Fern \nDepartment of Cell Physiology & Pharmacology, University of Leicester, P.O. \nBox 138, University Road, Leicester, LE1 9HN, England.  \nTelephone: +44 (0) 116 252 3098  \nFax: +44 (0) 116 252 5045 \nDeleted: receptor mediated\nDeleted: + 2\nDeleted: 2900¶\nPages: 22\nPage 2 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n 2 \nAbstract \nObjective: Ischemic injury of axons is a feature of periventricular leukomalacia, a \npathological correlate of cerebral palsy. Recent evidence suggests that axons are damaged \nbefore they receive the first layer of compact myelin. We here examine the cellular \nmechanisms underlying ischemic-type injury of premyelinated central axons. \nMethods: Two thirds of axons in the post-natal day 10 rat optic nerve are small \npremyelinated axons (<0.4 µm diameter), and one third have undergone radial expansion \nin preparation for glial contact and the onset of myelination. Compound action potential \nrecording and quantitative electron microscopy were used to examine the effect of \nmodelled ischemia (oxygen-glucose deprivation) upon these two axon populations. \nGlutamate receptor expression was investigated using PCR and immuno-staining \napproaches at the confocal light and ultrastructural levels. \nResults: Oxygen-glucose deprivation produced action potential failure and focal \nbreakdown of the axolemma of small premyelinated axons at sites of contact with \noligodendrocyte processes, which were also disrupted. The resulting axon loss was Ca2+-\ndependent, Na+- and Cl--independent and required activation of NMDA and non-NMDA \nglutamate receptors. NMDA receptor expression was localized to oligodendrocyte \nprocesses at sites of contact with premyelinated axons, in addition to expression within \ncompact myelin. No peri-axonal NMDA receptor expression was observed on \noligodendrocyte processes ensheathing large premyelinated axons and no protective \neffect of glutamate receptor block was observed in these axons. \nInterpretation: NMDA receptor-mediated injury to oligodendrocyte processes navigating \nalong small premyelinated axons precedes damage to the underlying axon, a phenomena \nthat is lost following radial expansion and subsequent oligodendrocyte ensheathment.  \n \n \nDeleted: the\nDeleted: early axon damage\nDeleted: populations of axons. \nExpression of glutamate receptors\nDeleted: Ischemia\nDeleted:  both\nDeleted:  in more mature axons\nDeleted: neighbouring\nDeleted:  itself\nPage 3 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n 3 \nIntroduction \n Selective injury of developing white matter is the most frequent cause of cerebral \npalsy, the most common human birth disorder. The underlying pathology (periventricular \nleukomalacia: PVL), may feature focal necrotic damage of periventricular white matter \nand diffuse white matter injury. White matter injury may arise following hypoxia-\nischemia at birth, but the largest patient cohort suffer injury during mid-gestation1, 2. The \nmotor, sensory and cognitive deficits that characterize the lesion are associated with \ninjury to immature cells of the oligodendroglial lineage, which are susceptible to a form \nof non-NMDA-type glutamate receptor (GluR) -mediated excitotoxic injury3-8. In \naddition to non-NMDA receptors, these cells express NMDA GluRs selectively on their \nprocesses9-11, although the role of NMDA receptors in ischemic injury of myelinated \nwhite matter is controversial12-15. \n Oligodendroglial injury has been the focus of research into the cellular \nmechanisms of developing white matter injury for the past decade. However, axon \ndamage is consistently reported in histological examinations of PVL2,16,17. Axonal \nchanges include truncation of the axon cylinder18 and the formation of \"retraction balls \nand clubs\"16. Recent reports indicate that axonal injury is an early event in the formation \nof both focal and diffuse components of PVL19-21, and may be central to the evolution of \nthe injury17. Despite these considerations, almost nothing is known regarding the injury \nmechanisms operating upon premyelinated central axons. In mid-gestation telencephalic \nwhite matter that is subject to PVL, axons have an immature expression profile for \ndevelopmental markers and oligodendroglia are changing from the precursor to the \nimmature form22, 23. The first evidence of early myelination is apparent, which includes \nmyelin basic protein expression around some axons of the optic radiation23. There is \nevidence that injury to these axons during PVL can result in optic nerve hypoplasia24. \nCentral axon development has been studied in detail in the rat optic nerve (RON), where \nradial expansion corresponding to an ~3 fold increase in diameter within an ~4 day \nperiod precedes first contact by oligodendrocyte processes and the subsequent onset of \nmyelination25. The first post-mitotic oligodendrocytes appear at post-natal day 6 (P6) and \nstart to extend processes parallel to axons26-28. The first ensheathed axons appear at this \nField Code Changed\nField Code Changed\nField Code Changed\nDeleted: PVL\nDeleted:  \nDeleted: excitotoxic injury \nDeleted: PVL 2, 16, 17\nDeleted: clubs\" 16. Recent reports \nindicate that axonal injury is an early \nevent in the formation of both focal and \ndiffuse components of PVL 19-21, and may \nbe central to the evolution of the injury 17. \nDespite these considerations, almost \nnothing is known regarding the injury \nmechanisms operating upon \npremyelinated central axons. In mid-\ngestation telencephalic and periatal white \nmatter that is subject to PVL, axons have \nan immature expression profile for \ndevelopmental markers and \noligodendroglia are changing from the \nprecursor to the immature form 22, 23\nDeleted: and periatal\nDeleted:  \nDeleted: expression around axons of \nthe optic radiation \nDeleted: myelination 25\nPage 4 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n 4 \nage and correspond to the largest premyelinated axons with diameters of >=0.4 µm25. By \nP10 the first wraps of compact myelin appear, corresponding to ~1% of axon profiles \nwith ~4% of axons ensheathed but not myelinated25, at which point the axons become \nsensitive to acute ischemic injury29. We here examine the mechanisms of acute ischemic-\ntype injury at this crucial developmental point and test the significance of GluR \nexpression in the injury process. \n \nMethods \n All animal procedures conformed to UK home office regulations. RONs were \ndissected from Lister-hooded rats between P8-12. Nerves were perfused with artificial \ncerebrospinal fluid (aCSF), composition (in mM): NaCl, 126; KCl, 3; NaH2PO4, 2; \nMgSO4, 2; CaCl2, 2; NaHCO3, 26; glucose, 10; pH, 7.45, bubbled with 5% CO2 \/ 95% O2 \nand maintained at 37oC. Zero-Na+ aCSF: NMDG\/Cl, 124; KCl, 3; CaCl2, 2; MgSO4, 2; \ncholine-HCO3, 26; KH2PO4, 2; Glucose 10. Zero-Cl- aCSF: Na-cyclamate, 124; K-\ngluconate, 3; Ca gluconate, 2; MgSO4, 2; NaHCO3, 26; NaH2PO4, 2; Glucose 10. Zero-\nCa2+ aCSF: CaCl2 was omitted and 50 EGTA µM was added. Glucose was omitted from \nsolutions when oxygen-glucose deprivation (OGD) was required and the solution was \npre-bubbled with 5% CO2 \/ 95% N2 for at least 60 min. The chamber atmosphere was \nswitched to 5% CO2 \/ 95% N2 during perfusion with OGD. Osmolarity of all solutions \nwas measured and adjusted using NaCl or sucrose as required. Data are mean ± SEM, \nsignificance determined by t-test or ANOVA as appropriate. GluR antagonists were from \nTocris (UK), all other reagents were from Sigma (UK) unless stated otherwise. \n Electrophysiological recordings used the same equipment to that described \nrecently30. In brief, extracellular compound action potentials (CAPs) were evoked and \nrecorded with suction electrodes. Peak-to-peak amplitude was used to assess changes in \nthe number of unitary action potentials since CAP area can not be applied reliably to \nrecordings from neonatal nerves due to the long stimulus duration required for \nsupramaximal stimulation29. CAPs were evoked via square-wave constant current pulses \nof 150-600 µsec (Iso stim A320, WPI). The signal was amplified (Cyber Amp 320, Axon \nField Code Changed\nField Code Changed\nDeleted: diameters of >=0.4 µm 25\nDeleted: Ca2Cl,\nDeleted: Ca2-gluconate,\nDeleted: zero-Ca2+\nDeleted:  \nDeleted: times\nDeleted:  \nPage 5 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n 5 \nInstruments), subtracted from a parallel differential electrode, filtered (low pass: 800 Hz), \ndigitized (25000 Hz: 1401 mini, Cambridge Electronic Design) and displayed on a PC \nrunning Signal software (Cambridge Electronic Design). CAP loss is taken to indicate \nirreversible failure of axon function29, and is well correlated with pathological changes in \naxons such as dissolution of microtubules\/neurofilaments, disruption of mitochondria, \nloss of axoplasmic integrity and of neurofilament staining. \n For immuno-histochemistry, P10 RONs were dissected into 0.1M PBS and fixed \nin 4% paraformaldehyde for 30 min. Nerves were subsequently incubated in 0.1M PBS \nplus 20% sucrose w\/v for 5 min prior to freeze-sectioning (20 µm sections) and \nsubsequent blocking for 60 min in 0.1M PBS, 10% fetal goat serum plus 0.5% Triton-X \n100. Sections were then incubated in this solution plus primary antibody at 4o C \novernight. Antibodies raised against NR1 (1:200, Upstate), GluR4 (1:200, Upstate), \nneurofilament-200 (NF-H), neurofilament-70 (NF-L) (Chemicon; 1:200 and 1:100 \nrespectively), and CNPase (an oligodendroglial marker; Sigma; 1:100) were detected \nusing appropriate Alexa-conjugated secondary antibodies (1:1000, Cambridge \nBioscience, see10 for further details), and imaged as single planes via laser scanning \nconfocal microscopy. Primary antibody omission controls were performed and are \nincluded in the figures at appropriate points. Intensity levels of neurofilament staining \nwere assessed using mean pixel intensity levels within standard regions of interest, \nperformed using Metamorph (Universal Imaging).  \n For PCR, P10 RONs were digested in MELT (Ambion) and subjected to a triazol \nextraction. RNA was then column purified and the resulting RNA treated to remove DNA \ncontamination. The RNA was purified by extraction with phenol, pH 4.2, (Sigma) and re-\nsuspended to a concentration of 1µg\/µl.  PCR was then performed using Omniscript \n(Qiagen) according to the manufacturer's instructions. All primers were tested on whole \nbrain as a positive control, see10 for further details.  \n For electron-microscopy, P10 RONs were collected at the end of \nelectrophysiological experiments, washed in Sorenson's buffer and post-fixed in 3% \ngluteraldehyde\/Sorenson's. Nerves were then fixed with 2% osmium tetroxide and \nField Code Changed\nDeleted: -10000\nDeleted:  \nDeleted:  \nDeleted: Intensity levels \nDeleted: ntensity levels \nDeleted: by mean pix\nDeleted:  \nPage 6 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n 6 \ndehydrated prior to infiltration in epoxy. Ultrathin sections were counterstained with \nuranyl acetate and lead citrate and examined with a Jeol 100CX electron microscope. \nGlial cell processes could sometimes be identified on ultrastructural grounds6. For \nexample, the astrocyte process in Fig 6 e contains characteristic wide-bore endoplasmic \nreticulum and glycogen particles, and the oligodendrocyte process in Fig 4 e has \nmyelinated a nearby axon. Since all axons in the adult rat optic nerve are myelinated, \nnon-myelinated axons at P10 are in either an early or late stage of preparation for \nmyelination. For post-embedding immuno-labelling of NR1 (1:100), GluR2\/3 (1:50, \nUpstate) and KA2 (1:50, Upstate), primary antibody was applied to the sections overnight \nand appropriate 20 nm gold particle secondary antibodies were applied following \nwashing. Primary antibody omission controls were blank. \n For morphometric analysis and viability scoring, axons within a minimum of \nthree grid sections were outlined by hand using Image-J software (NIH) and axon area \nand perimeter were measured. Grids were selected at random and all identifiable axons \nwithin the area were included to avoid bias. Axon profiles were often far from round and \nthe closest corresponding circular diameter was calculated from the perimeter values. \nAxon viability scores were assigned blind using the following scoring system. Axons \nwere given one point for each of three well-established indicators of viability; i) the \npresence of a relatively complete axolemma, ii) the presence of normal microtubules, iii) \nthe presence of a clear and debris-free axoplasm. Axons that showed all three of these \nfeatures were therefore given a viability score of \"3\", and axons with none were given a \nscore of \"0\", with intermediate scores between this range. Examples of axon scores are \nshown in supplemental Fig 1, where a healthy axon (score of \"3\"), and degrees of injury \n(\"2\" to \"0\") are shown.  \n \nSupplemental Figure 1 near here \n \nResults \nDeleted:  \nDeleted: Fig \nDeleted: Fig \nDeleted: axons of the P10 nerve can be \nconsidered to be either \nDeleted: overnight\nDeleted: (1:100)\nPage 7 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n 7 \n Action potential conduction in the isolated P10 RON was stable for several hours \nunder control conditions, while 60 min of OGD resulted in conduction failure that was \nonly partially reversible after 60 min recovery in aCSF29 (25.6 ±4.2% CAP recovery, \nn=14 nerves, P<0.001 vs. 130 min of control perfusion; Fig 1 a-c). Injury was largely \nprevented by removing extracellular Ca2+ (84.2 ±4.2% CAP recovery, n=8 nerves, \nP<0.001 vs. injury in normal Ca2+; Fig 1 a-c), an effect confirmed at the ultrastructural \nlevel (Fig 2 d). Staining for the axonal markers NF-L and NF-H, which label small \ndiameter and larger diameter axons respectively31, was also disrupted in axons following \n60 min of OGD + 60 min recovery (Fig 1 e, f). Confocal imaging of post-OGD staining \nrevealed areas denuded of neurofilament reactivity and ball-like structures that may \ncorrespond to swollen axon regions. Staining levels were quantified to reveal a similar \ndecline in reactivity to NF-L and NH-H following the insult (Fig 1 f). \n \nFigure 1 near here \n \n Control perfused nerves had the ultrastructural features typical of this age25,27,28, \n32\n. Small (<0.4 µm diameter) and large (=>0.4 µm) premyelinated axons where separated \nby a narrow extracellular space and by glial processes (Fig 2 a \"S\" and \"L\" premyelinated \naxons respectively), with the occasional myelinated axon apparent (Fig 2 a \"Ax\"). Some \nof the large premyelinated axons were ensheathed by glial processes (Fig 2 a, \"*\"), shown \nin long-section in Fig 2 c (arrow). Mitochondria in all cell compartments had a typical \ninternal structure and showed no evidence of swelling. Following OGD, the extracellular \nspace was expanded and nondescript cellular debris was common (Fig 2 b). Many \npremyelinated axons showed a loss of microtubules and regions of axolemma breakdown  \n(Fig 2 b), and extensive disruption of glial processes was widespread (intact glial \nprocesses were only occasionally seen). In long section, regions of intense focal \npremyelinated axon disruption were seen (Fig 2 e, \"Axon\" arrow heads), generally \naligned parallel to damaged regions of neighbouring glial processes (\"gp\" arrow heads). \nIdentification of axons in post OGD micrographs was based upon the presence of \nField Code Changed\nField Code Changed\nField Code Changed\nDeleted:  \nDeleted: The injury process was largely \nnegated\nDeleted:  \nDeleted:  \nDeleted:  Note that the remaining \nidentifiable axons in Fig 2 btend to be of \nlarge diameter (=>0.4 µm).\nDeleted:  small premyelinated\nDeleted: often \nPage 8 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n 8 \nidentifiable microtubules which were sometimes rather sparse (e.g., Fig 2 e \"Axon\" \narrow). \n \nFigure 2 near here \n \n Unlike mature optic nerve axons33,34, replacing extracellular Na+ (Fig 3 a-c; \nsupplemental Fig 2) or Cl- (Fig 3 d-f) was not protective against injury. This was not due \nto any toxicity of ion substitution at this age since control ion substitutions had no \nsignificant non-reversible effect (Fig 3 a, c, d, f). This result suggests a fundamentally \ndifferent ionic basis to injury in premyelinated and myelinated axons, and rules out a \nsignificant role for Na-Ca exchange or Cl- channels in the injury process33,34. In \nparticular, Na+ replacement leads to rapid depletion of axoplasmic Na+ and block of \nreverse-mode Na-Ca exchange, a major source of Ca2+ influx in mature myelinated axons \nduring anoxia33. The finding was confirmed at the ultrastructural level where wide-scale \ndisruption of axons following OGD in zero-Na+ conditions was confirmed (supplemental \nFig 2). No changes were observed in the ultrastructure of nerves perfused with zero-Na+ \naCSF for 140 min in the absence of OGD (not shown).  \n \nFigure 3 near here \n \n Oligodendroglial GluRs are implicated in the Ca2+-dependent injury of their \nprocesses and somata3,4,9-11, while axonal expression of AMPA and kainate receptors is \nimportant for ischemic-type injury of myelinated spinal axons35,36. Block of NMDA-\nreceptors (10 µM MK-801) or non-NMDA receptors (20 µM NBQX) was protective \nagainst OGD-induced injury of premyelinated axons, as was combined block (67.9 \n±7.0% CAP recovery during combined block, n=8 nerves, P<0.001 vs. OGD alone; Fig 4 \na-d). There was complete preservation of the small premyelinated axons during combined \nField Code Changed\nField Code Changed\nField Code Changed\nField Code Changed\nDeleted: difficult. In Fig 2 e, the \ndamaged axon had retained some \nmicrotubules (\"Axon\" arrow), permitting \nits identification (note the highergain).¶\n \nDeleted:  \nDeleted:  \nDeleted:  \nDeleted:  \nDeleted: At the ultrastructural level, \nthere\nPage 9 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n 9 \nGluR block (Fig 4 e-f \"s\"), while large premyelinated axons showed lower levels of \nprotection (Fig 4 e-g, \"L\"). Note in Fig 4 g that a large diameter premyelinated axon has \nlost all axoplasmic differentiation but a glial processes wrapped around the axon is intact \n(arrow heads). \n \nFigure 4 near here \n \n In control nerves, the diameter spectra of premyelinated axons ranged between \n0.15-0.70 µm, with a peak between 0.25-0.30 µm (n = 100 axons; Fig 5 a, left). This \ncorresponds closely to earlier studies25. Following OGD, the density of recognizable \npremyelinated axons fell from 11.50 axons\/µm2 to 1.26 axons\/µm2 (P<0.001; n = 91 \naxons; Fig 5 a, right, filled bars). The loss of recognizable premyelinated axons was \nsignificantly reduced by GluR block (to 6.59 axons\/µm2), in particular in small \npremyelinated axons (Fig 5 a, right, open bars). The axon diameter spectra following \nOGD may be affected by expansion of the extracellular space and swelling of glial \nprocesses. To better assess the degree of injury within small and large premyelinated \naxons, we employed a numerical viability scoring system. The mean viability score for \nsmall premyelinated axons (<0.4 µm in diameter) and large premyelinated axons (=>0.4 \nµm in diameter) are shown in Fig 5 b. Under control conditions, the mean viability score \nof both groups of axons was close to \"3\", indicating no significant pathology. Following \nOGD the viability scores of both groups declined significantly, with the smaller axons \nshowing a significantly greater decline than the larger axons (P<0.001). Combined GluR \nblock prevented the appearance of pathology in identifiable small premyelinated axons \nbut had no comparable effect upon the larger premyelinated axons. The viability scores \nfor all premyelinated axons examined is shown in Fig 5 c-e, confirming the selective \nprotection of small premyelinated axons by GluR block.  \n \nFigure 5 near here \nField Code Changed\nDeleted: e-g \"S\"),\nDeleted:  \nDeleted: 0.1-0.7\nDeleted:  in axon density\nDeleted:  \nPage 10 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n 10 \n \n The pattern of NMDA receptor protein (Fig 6 a-c) and mRNA (Fig 6 d) \nexpression was similar in P10 RON to that reported in the P10 mouse optic nerve10. \nConfocal imaging indicated that NR1 subunit protein is colocalized with CNPase (+) \noligodendroglial processes but not with N-FH (+) axon profiles (Fig 6 a, b). GluR4 \nprotein (non-NMDA subunit) appeared primarily in CNPase (+) oligodendroglial somata \n(Supplemental Fig 3). At the ultrastructural level, intense NR1 protein reactivity was \nfound in regions where oligodendrocyte process membrane ran parallel to the axolemma \nof small premyelinated axons, in addition to expression within compact myelin as \npreviously reported9,11 (Fig 6 e-g arrows, supplemental Figs 4, 5). NR1 reactivity \nappeared to translocate from the axolemmal face of oligodendrocyte processes aligned \nalong small diameter premyelinated axons into the myelin as development progressed. \nOn no occasion was NR1 reactivity seen in the cell membrane of axons or astrocytes and \nit was unusual to see it in cell membranes of oligodendroglial somata.  \n \nFigure 6 near here \nSupplemental Figs 3-5 near here \n Perfusion with AMPA+kainate produced a small but significant fall in the CAP \n(Fig 7 a), which achieved higher significance in the presence of the AMPA \ndesensitization inhibitor cyclothiazide. Addition of NMDA to the test condition did not \nproduce any significant augmentation of this effect (Fig 7 b \"all agonists\"). Immuno-\nlocalization using an antibody against the AMPA receptor Glur2\/3 subunit revealed high \nexpression in and under myelin and in the axolemma of premyelinated axons (Fig 7 c-e). \nThe kainate receptor KA2 subunit showed more focal expression at sites within and \nunder myelin, in addition to the axolemma of premyelinated axons (Fig 7 f-i). \n \nFigure 7 near here \nField Code Changed\nDeleted:  mRNA and\nDeleted: nerve 10, with clusters of NR1 \nNMDA subunit protein reactivity \ncolocalized with CNPase (+) \noligodendroglial processes but not with \nN-FH (+) axon profiles (Fig 6 a, b). Non-\nNMDA GluR \nDeleted: , with clusters of NR1 NMDA \nsubunit protein reactivity\nDeleted: . Non-NMDA GluR \nDeleted: subunits such as GluR4 \ncolocalized primarily to\nDeleted: 2).\nDeleted:  regions of\nDeleted: were\nDeleted:  the cell membranes of\nDeleted: processes\nDeleted:  in mature white matter \nDeleted: occasion was NR1 reactivity \nseen in the cell membranes\nDeleted: 2-4\nPage 11 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n 11 \n \nDiscussion \n Recent findings suggest that the intricate morphological arrangement that forms \nbetween axons and oligodendrocyte processes during central myelination is orchestrated \nin part by vesicular-type glutamate release from axons and subsequent detection by GluR \non processes30,37,38. We have here shown NMDA receptor expression on oligodendrocyte \nprocesses, as required by this hypothesis. We have also shown that the presence of these \nNMDA receptors results in acute injury of small premyelinated axons during OGD. \nPossible mediators that might link NMDA receptor-mediated oligodendrocyte process \ninjury with axon injury include local release of intracellular potassium resulting in axon \ndepolarization and cytotoxic swelling; physical disruption of the axolemma during \noligodendrocyte process swelling and dissolution, which will also disrupt the \nextracellular matrix; release of free radicals; and release of intracellular components such \nas calpains and lipases that are likely to attack the axon directly. \n In addition to expression on oligodendrocyte processes, NMDA receptors were \nfound in early compact myelin. Similar myelin expression in mature RON can mediate \ncytotoxic Ca2+ influx9-11. As a result, NMDA receptors contribute to OGD-induced injury \nin this preparation12, although apparently not in mouse optic nerve14,15. The current \nfindings indicate that oligodendroglial processes express NMDA receptors where they \nnavigate along premyelinated axons, while expression shifts to the myelin as it is \ndeposited. NMDA receptor block failed to protect larger premyelinated axons, which is \nconsistent with loss of receptors from the axonal face of oligodendrocyte processes once \naxon ensheathment has been achieved. At this point in central axon development, injury \nmay involve the voltage-gate calcium channels transiently expressed in these large \npremyelinated axons30. \n NMDA or AMPA\/kainate receptor block was equally protective against OGD-\ninduced injury. Combined block had no additional protective effect and resulted in \nsparing of small but not large premyelinated axons. Since oligodendrocyte NMDA \nreceptors require co-activation of AMPA\/kainate receptors to overcome Mg2+-block even \nDeleted: The premyelinated central \naxons that are subject to injury during \nPVL are on the threshold of a program of \nrapid diameter expansion and axolemma \nprotein re-organization. At this point in \nthe P10 RON, oligodendroglia are \nmaturing and extending processes parallel \nto axons as voltage-gated Na-channels \nstart to cluster at sites where nodes of \nRanvier will form 26-28. Recent findings \nsuggest that formation of the intricate \nmorphological arrangement between \naxons and oligodendrocyte processes is \ndependent upon axonal vesicular-type \nglutamate release, which may co-ordinate \naxo-glial interactions via GluR on the \noligodendrocyte processes 30, 35, 36. \nPremyelinated central axons also express \nfunctional glutamate transporters 37, and \nvesicular- and transporter-mediated \nglutamate release are potential sources of \nthe extracellular glutamate responsible \nfor GluR-mediated injury of \noligodendrocyte processes described in \nthe current study. Astrocytes may also act \nas a source of ischemic glutamate release \nin developing white matter 37, 38. The \nlocalization of NMDA receptors to \noligodendrocyte processes aligned along \nthe axolemma of premyelinated axons \nindicates that Ca2+-dependent, Na+- and \nCl--independent, injury to the processes at \nthese sites precedes breakdown of the \nneighbouring axolemma. The findings \ntherefore place oligodendrocyte process \ninjury before premyelinated axon injury \nDeleted: . Premyelinated central axons \nalso express functional glutamate \ntransporters 37, and vesicular- and \ntransporter-mediated glutamate release \nare potential sources of the extracellular \nglutamate responsible for GluR-mediated \ninjury of oligodendrocyte processes \ndescribed in the current study. Astrocytes \nmay also act as a source of ischemic \nglutamate release in developing white \nmatter 37, 38. The localization of NMDA \nreceptors to oligodendrocyte processes \naligned along the axolemma of \npremyelinated axons indicates that Ca2+-\ndependent, Na+- and Cl--independent, \ninjury to the processes at these sites \nprecedes breakdown of the neighbouring \naxolemma. The findings therefore place \noligodendrocyte process injury before \npremyelinated axon injury in the \nsequence of events that result in acute \nloss of function in early developing white \nmatter during ischemia. ¶\nIn addition to expression on \noligodendrocyte processes aligned along \npremyelinated axons, NMDA receptor \nprotein was also observed in early \ncompact myelin. Similar expression in \nmyelin is seen in mature rat optic nerve \nwhere it can mediate cytotoxic Ca2+ \ninflux 9-11. Presumably as a result, NMDA \nreceptors contribute to ischemic injury in \nmyelinated rat optic nerve 12, although no \nsimilar effect is found in mouse optic \nnerve 14, 15. The current findings indicate \n... [1]\n... [2]\nPage 12 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n 12 \nduring modelled ischemia9, this is consistent with the current observation that both \nclasses of GluR are present on oligodendrocyte processes. Immuno-labelling at the light \nlevel appears to show low AMPA\/kainate receptor expression on oligodendrocyte \nprocesses10, but the current ultrastructural analysis reveals high levels of membrane \nexpression in these structures in addition to clear expression in the axolemma. \nAMPA\/kainate receptor activation produced ~10% decline in the CAP, consistent with \nexpression of functional receptors in the axolemma. Although a small contribution from \nAMPA\/kainate receptors to axonal injury cannot be ruled out by the current findings, the \nabsence of an additive effect of co-receptor block indicates that axonal non-NMDA \nGluRs are not directly involved in injury. This contrasts with the situation in mature \ncentral axons35,36, and may indicate that the axonal nanocomplexes incorporating \nAMPA\/kainate receptors and NO synthase which are involved in acute OGD-injury have \nyet to form in premyelinated white matter.  \n The results may have significant clinical ramifications, since magnesium sulphate \nis a recognized antenatal intervention associated with a decreased risk of gross motor \ndeficit in low birth weight babies39,40. While the significance of this effect requires further \ninvestigation, elevated extracellular Mg2+ will inhibit NMDA receptors in developing \nwhite matter9. The current findings raise the possibility that this prophylactic strategy \nmay prove effective at protecting small premyelinated central axons in the foetus at risk \nof cerebral palsy, while interventions designed around NMDA receptor block41,42 may \nprotect both oligodendroglial cells and their partner axons. \n \nreceptors in developing white matter9. The current findings raise the possibility that this \nprophylactic strategy may prove effective at protecting small premyelinated central axons \nin the foetus at risk of cerebral palsy, while interventions designed around NMDA \nreceptor block41,42 may protect both oligodendroglial cells and their partner axons. \n \nPage 13 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n 13 \nAcknowledgements: We wish to thank Miss Natalie Allcock for technical assistance with \nelectron microscopy and Mr Antonio Domingues for help with PCR. This work was \nsupported by the National Institutes of Neurological Disorders and Stroke (NS44875). \n \n \nPage 14 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n 14 \nFigure Legends \n \nFigure 1 \nOGD-induced injury in developing white matter. a: CAP recorded from the P10 RON \nbefore and 60 min after 60 min of OGD in normal-Ca2+ (left) and zero-Ca2+ (right) \nconditions. The times indicated correspond to the time after the start of each experiment. \nb: The mean action potential amplitude collapses during OGD and recovers partially, \nwith greater recovery in zero-Ca2+ conditions. Note the stable CAP amplitude in aCSF \n(\"Control\"). c: Mean CAP recovery from OGD showing the protective effect of zero-Ca2+ \n(applied 20 min before and removed 40 min after OGD). d: Control experiment showing \nstable recording during perfusion with the zero-Ca2+ solution. e: Disruption of \nneurofilament staining following OGD. NF-L (left), and NF-H (right) staining in control \nnerve (top) is disrupted following OGD (bottom). Note the presence of swollen axonal \nregions in the remaining NF-H (+) axons following OGD. f: The relative change in NF \nstaining intensity between control and post-OGD nerves. \"*\" = P<0.05; \"**\" = P<0.01. \nScale bars = 10 µm. \n \nFigure 2 \nUltrastructural features of the injury induced by 60 min of OGD followed by 60 min \nrecovery. a: Control perfusion for 120 min. Small (\"S\") and large (\"L\") diameter \npremyelinated axons populate the RON, with occasional myelinated axons apparent \n(\"Ax\"). Some large premyelinated axons are ensheathed by glial processes (e.g., \"*\"), \nwhile other glial processes traverse the extracellular space between axons. Note that all \naxons contain microtubules and have intact axoplasmic membranes. Oligodendrocyte cell \nbody indicated by \"Oli\". B: OGD + 60 min recovery. The extracellular space is greatly \nexpanded and intact glial processes can no longer be identified. The number of \nidentifiable premyelinated axons is much reduced. c: Control long-section micrograph, \nillustrating the arrangement of oligodendrocyte processes (arrow) extending parallel to a \nDeleted: c:\nDeleted:  and consists mainly of larger \naxons\nPage 15 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n 15 \npremyelinated axon. d: Following OGD in zero-Ca2+, premyelinated axons have a normal \nappearance. e: Long section post-OGD. A small premyelinated axon retaining a small \nnumber of microtubules (arrow) has a disrupted axoplasm throughout the section shown \nand a region of intense focal damage (arrow heads). A glial process (\"gp\") aligned next to \nthe axon is disintegrating at a similar point (arrow-heads). Scale bar a-d = 500 nm, e = \n200 nm. \n \nFigure 3 \nThe ionic-dependence of injury is novel. a (left): Representative CAP recorded before \nand after perfusion with zero-Na+ solution, note the full recovery following washout. a \n(Right): Representative example of the absence of protection against OGD by zero-Na+ \nsolution. Note the limited recovery following washout. b: Mean CAP amplitude, showing \nthe low level of recovery following OGD in zero-Na+. Note that after 20 min of zero-Na+ \nperfusion the action potential is blocked. c: Data summary for zero-Na+ experiments. d \n(left): Recordings before and after perfusion with zero-Cl- solution, note the full recovery \nfollowing washout. d (Right): Representative example of the absence of protection \nagainst OGD by zero-Cl- solution. Note the limited recovery following washout. e: Mean \nCAP amplitude, showing the low level of recovery following OGD in zero-Cl. f: Data \nsummary from zero-Cl- experiments.  \n \nFigure 4 \nGluRs mediate premyelinated axon injury. a: NMDA receptor block (MK-801) increases \nmean CAP recovery following OGD. b, c: Block of non-NMDA GluR (NBQX) has a \nsimilar effect (b), as does combined application (c). d: The extent of recovery following \nthese procedures. e, f: Small diameter premyelinated axons (\"S\") and oligodendrocyte \nprocesses (\"op\") are protected from OGD in the presence of MK-801 + NBQX, while \nlarger axons (\"L\") are not. g: A large diameter premyelinated axon has no axoplasmic \nstructures intact while a glial process wrapped around the axon is undamaged (arrow \nDeleted: mm.\nPage 16 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n 16 \nheads).  \"*\" = P<0.05; \"***\" = P<0.001.  Scale bars = 1 µm in \"e\", 400 nm in \"f\", 100 nm \nin \"g\". \n \nFigure 5 \nMorphometric analysis of OGD induced axon injury. a: The density of premyelinated \naxons (the number of axons in an area) of different diameter (the diameter that \ncorresponds to the axon perimeter) present within the P10 RON. Left: Control nerve, \nshowing a peak in diameter between 0.25-0.3 µm and a range between 0.15-0.70 µm. \nRight: The corresponding analysis for nerves exposed to OGD for 60 min followed by 60 \nmin recovery (black bars). Note the much lower density of axons indicating loss of \nidentifiable axons and expansion of the extracellular space. The corresponding analysis \nfrom nerves exposed to OGD in the presence of NBQX and MK-801 (\"GluR block') \nshows that many identifiable axons are present (white bars). b: The mean axon viability \nscore is shown for premyelinated axons below 0.4 µm in diameter (black bars) and those \nof 0.4 µm or above  (white bars). Note that following OGD, both small and large \npremyelinated axons are significantly injured, with the small premyelinated axons \neffected more than the large premyelinated axons. Following OGD in the presence of \nGluR blockers only the small premyelinated axons are significantly damaged. c-e: \nIndividual size spectra of the viability scores, showing greatly improved viability in \naxons <0.4 µm in the presence of GluR blockers. \"***\" = p<0.001 vs. control. \n \nFigure 6 \nGluRs in developing white matter. a: NR1 (green, left) and CNPase (red, middle) appear \nto be co-localized (right) using fluorescent confocal imaging. Note that the NR1 clusters \nappear orange in the overlay. b: NR1 (green, left) and NF-H (red, middle) appear poorly \nco-localized (right). Note that the NR1 clusters appear green in the overlay. c: Absence of \nstaining when NR1 antibody was omitted. d: mRNA for NMDA receptor subunits in P10 \nRON. e-g: Localization of GluR NR1 subunit at the ultrastructural level by immuno-gold \nDeleted: larger\nDeleted: e-f:\nDeleted: >0.4\nDeleted: are\nDeleted: are\nDeleted:  Scale bars = 10 µm.¶\nDeleted: ¶\nFigure 7¶\nPage 17 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n 17 \nlabelling. e: A small diameter pre-myelinated axon (\"s\") is aligned between an astrocyte \nprocess (\"ap\") and two myelinated axons (\"Ax\"). The boxed region is shown at higher \ngain to the right. Three immuno-gold beads (short arrows) are present on the junction \nbetween an oligodendroglial process (\"op\") and the small premyelinated axon. Note the \nabsence of NR1 reactivity on the astrocyte process. Also note the tubulovesicular \ncomplex apparently fusing with the axolemma at this point (\"*\"), and the NR1 reactivity \nwithin the compact myelin of a neighbouring axon (short arrow). f: An oligodendrocyte \nsomata (\"Oli\") is extending a process showing NR1 reactivity (short arrows) along a \nsmall pre-myelinated axon. Note that no reactivity is seen in the somata itself. The boxed \narea is shown at higher gain to the right and reveals NR1 reactivity on the outer edge of \nan actively myelinating oligodendrocyte process. g: Two oligodendrocyte processes \n(boxes) are navigating along small pre-myelinated axons (shown in great detail to the \nright). In both cases, NR1 reactivity is present on the axon side of the process. \"gp\" \nindicates that this glial process can  not be positively identified as an oligodendrocyte \nprocess. Scale bars = a-c: 10 µm; e-f = 500 nm.  \n \nFigure 7 \nNon-NMDA GluRs are expressed in oligodendrocyte processes and the axolemma. a-b: \nThe effect of GluR activation upon CAP amplitude in P10 rat optic nerve. a: Exposure to \n200 µM AMPA + 200 µM kainic acid in the presence of 30 µM cyclothiazide evokes a \nsmall reversible reduction in CAP amplitude. Sample CAPs are shown at the top, taken \nfrom the times indicated. Time \"1\" and \"2\" were used to calculate mean data for the \nhistogram, revealing a significant reduction in amplitude in experiments performed in \neither the presence or the absence of cyclothiazide (* = p<0.05; ** = P<0.01 vs. control; \n'n' numbers as indicated). b:  Exposure to 200 µM AMPA + 200 µM kainic acid + 1 mM \nNMDA + 50 µM glycine in the absence of Mg2+ also produced a small reversible fall in \nCAP amplitude (*** = P<0.01 vs. control; 'n' numbers as indicated; times \"1\" and \"3\" \nwere used for the histogram data). Cyclothiazide has no effect applied alone. c-i: \nLocalization of GluR 2\/3 (c-e) and KA2 (f-i) subunit at the ultrastructural level by \nDeleted: a:\nDeleted: premyelinated axon (\"S\")\nDeleted: point. b:\nDeleted: C:\nPage 18 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n 18 \nimmuno-gold labelling. c: Strong staining (short arrows) is apparent for GluR 2\/3 in a \nmyelinating axon (\"Ax\"), with gold particles present within and under the myelin (\"my\"). \nThe axon contains a mitochondria (\"mit\"). Staining is also present on the axoplasmic side \nof the axolemma (the axolemma is indicated by arrow heads) of a neighbouring small \npremyelinated axon (\"s\"). d: Gold particles largely located on the axoplasmic side of the \nmyelin of a myelinating axon. e: Three gold particles are located on the interface between \na glial processe (\"gp\") and a small pre-myelinated axon (axolemma indicated by \narrowheads). f: Immuno-labelling for KA-2 reveals focal expression associated with the \nmyelin of an actively myelinating axon. g: Focal axolemma staining of a premyelinated \naxon facing an ensheathing oligodendrocyte process (\"op\"). h: focal staining on the \naxolemma  underneath an actively myelinating oligodendrocyte process. Note the near-by \nastrocyte processes (\"ap\"). i: KA-2 reactivity in the axoplasm and axolemma of small \npremyelinating axons contacted by glial processes.  Scale = 500 nm. \n \n \nSupplementary Figure 1 \nExamples of the scoring system used for assessing axonal injury in premyelinated P10 \nRON axons. Scale bar = 1 µm. \n \nSupplementary Figure 2 \nTop: Micrograph showing the ultrastructural changes apparent in P10 RONs exposed to \n60 min OGD in zero-Na+ conditions. Examples of myelinated axons (\"Ax\") and small \n(\"S\") and large (\"L\") premyelinated axons can be seen. Note the widespread disruption of \nall axons and the typical \"bubbling\" of the inter-axonal face of the myelin. Scale bar = 1 \nµm. Bottom: Plot of CAP amplitude against time showing that prolonged reperfusion \nfollowing OGD in zero-sodium conditions does not result in additional recovery. Mean \nCAP amplitude was 32.34 ±7.3% at 190 min (n=5). \nDeleted: bars = 1 µm.\nPage 19 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n 19 \n \nSupplementary Figure 3 \nGluR subunit expression in P10 RON. a: CNPase(+) cells (red, left) and GluR4 (green, \nmiddle) co-localize (right). b: NF-H(+) axons (red, left) co-localize poorly with GluR4 \n(green; middle, right). c: NR1 (green, left) and GFAP (red, middle) expression are poorly \nco-localized (right). d: GluR4 (green, left) and GFAP (red, middle) expression are poorly \nco-localized (right). Scale bars = 10 µm.  \n \nSupplementary Figure 4 \nImmuno-electron micrograph showing NR1 reactivity in P10 RON. One contiguous \noligodendrocyte process (\"op\") expressed NR1 reactivity at several sites that are close to \nsmall diameter premyelinated axons (\"S\"), including within extensions that appear to be \nnavigating along small axons (arrows). \n \n \nSupplementary Figure 5 \nImmuno-electron micrographs showing NR1 reactivity in early compact myelin in P10 \nRON. Note that reactivity is present either within the myelin itself or on the outer surface \nas layers are being added. Scale bars = 500 nm.  \nDeleted: axons. \nPage 20 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n 20 \n \nReferences \n \n1. Back SA, Rivkees SA. Emerging concepts in periventricular white matter injury. \nSemin Perinatol. 2004;28:405-414 \n2. Volpe JJ. Neurology of the newborn. Philadelphia: W.B. Saunders Company, \n1995 \n3. Fern R, Moller T. Rapid ischemic cell death in immature oligodendrocytes: a fatal \nglutamate release feedback loop. J Neurosci. 2000;20:34-42 \n4. Follett PL, Rosenberg PA, Volpe JJ, Jensen FE. NBQX attenuates excitotoxic \ninjury in developing white matter. J Neurosci. 2000;20:9235-9241 \n5. Back SA, Han BH, Luo NL et al. Selective vulnerability of late oligodendrocyte \nprogenitors to hypoxia-ischemia. J Neurosci. 2002;22:455-463 \n6. Wilke S, Salter MG, Thomas R et al. Mechanism of acute ischemic injury of \noligodendroglia in early myelinating white matter: the importance of astrocyte \ninjury and glutamate release. J. Neurol. Exp. Neuropath. 2004;63:872-881 \n7. Matute C, Alberdi E, Ibarretxe G, Sanchez-Gomez MV. Excitotoxicity in glial \ncells. Eur J Pharmacol. 2002;447:239-246 \n8. Follett PL, Deng W, Dai W et al. Glutamate receptor-mediated oligodendrocyte \ntoxicity in periventricular leukomalacia: a protective role for topiramate. J \nNeurosci. 2004;24:4412-4420 \n9. Karadottir R, Cavelier P, Bergersen LH, Attwell D. NMDA receptors are \nexpressed in oligodendrocytes and activated in ischaemia. Nature. \n2005;438:1162-1166 \n10. Salter MG, Fern R. NMDA Receptors are Expressed in Developing \nOligodendrocyte Processes and Mediate Injury. Nature. 2005;438:1167-1171 \n11. Micu I, Jiang Q, Coderre E et al. NMDA receptors mediate calcium accumulation \nin myelin during chemical ischaemia. Nature. 2006;439:988-992 \n12. Bakiri Y, Hamilton NB, Karadottir R, Attwell D. Testing NMDA receptor block \nas a therapeutic strategy for reducing ischaemic damage to CNS white matter. \nGlia. 2008;56:233-240 \n13. McCarran WJ, Goldberg MP. White matter axon vulnerability to AMPA\/kainate \nreceptor-mediated ischemic injury is developmentally regulated. J Neurosci. \n2007;27:4220-4229 \n14. Tekkok SB, Ye Z, Ransom BR. Excitotoxic mechanisms of ischemic injury in \nmyelinated white matter. J Cereb Blood Flow Metab. 2007;27:1540-1552 \n15. Baltan S, Besancon EF, Mbow B et al. White matter vulnerability to ischemic \ninjury increases with age because of enhanced excitotoxicity. J Neurosci. \n2008;28:1479-1489 \n16. Banker B, Larrocher J-C. Periventricular leukomalacia of infancy: a form of \nneonatal anoxic encephalopathy. Arch Neurol. 1962;7:386-410 \n17. Dammann O, Hagberg H, Leviton A. Is periventricular leukomalacia an \naxonopathy as well as an oligopathy? Pediatr Res. 2001;49:453-457 \nPage 21 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n 21 \n18. Marin-Padilla M. Developmental neuropathology and impact of perinatal brain \ndamage. II: white matter lesions of the neocortex. J Neuropathol Exp Neurol. \n1997;56:219-235 \n19. Haynes RL, Billiards SS, Borenstein NS et al. Diffuse Axonal Injury in \nPeriventricular Leukomalacia as Determined by Apoptotic Marker Fractin. \nPediatr Res. 2008 \n20. Hirayama A, Okoshi Y, Hachiya Y et al. Early immunohistochemical detection of \naxonal damage and glial activation in extremely immature brains with \nperiventricular leukomalacia. Clin Neuropathol. 2001;20:87-91 \n21. Deguchi K, Oguchi K, Matsuura N et al. Periventricular leukomalacia: relation to \ngestational age and axonal injury. Pediatr Neurol. 1999;20:370-374 \n22. Haynes RL, Borenstein NS, Desilva TM et al. Axonal development in the cerebral \nwhite matter of the human fetus and infant. J Comp Neurol. 2005;484:156-167 \n23. Back SA, Luo NL, Borenstein NS et al. Late oligodendrocyte progenitors \ncoincide with the developmental window of vulnerability for human perinatal \nwhite matter injury. J Neurosci. 2001;21:1302-1312 \n24. Jacobson L, Hellstrom A, Flodmark O. Large cups in normal-sized optic discs: a \nvariant of optic nerve hypoplasia in children with periventricular leukomalacia. \nArch Ophthalmol. 1997;115:1263-1269 \n25. Hildebrand C, Waxman SG. Postnatal differentiation of rat optic nerve fibers: \nelectron microscopic observations on the development of nodes of Ranvier and \naxoglial relations. J Comp Neurol. 1984;224:25-37 \n26. Rasband MN, Peles E, Trimmer JS et al. Dependence of nodal sodium channel \nclustering on paranodal axoglial contact in the developing CNS. J Neurosci. \n1999;19:7516-7528 \n27. Skoff RP, Price DL, Stocks A. Electron microscopic autoradiographic studies of \ngliogenesis in rat optic nerve. II. Time of origin. J Comp Neurol. 1976;169:313-\n334 \n28. Skoff RP, Price DL, Stocks A. Electron microscopic autoradiographic studies of \ngliogenesis in rat optic nerve. I. Cell proliferation. J Comp Neurol. 1976;169:291-\n312 \n29. Fern R, Davis P, Waxman SG, Ransom BR. Axon conduction and survival in \nCNS white matter during energy deprivation: a developmental study. J \nNeurophysiol. 1998;79:95-105 \n30. Alix JJ, Dolphin AC, Fern R. Vesicular apparatus, including functional calcium \nchannels, are present in developing rodent optic nerve axons and are required for \nnormal node of Ranvier formation. J Physiol. 2008;586:4069-4089 \n31. Sanchez I, Hassinger L, Sihag RK et al. Local control of neurofilament \naccumulation during radial growth of myelinating axons in vivo. Selective role of \nsite-specific phosphorylation. J Cell Biol. 2000;151:1013-1024 \n32. Vaughn JE. An electron microscopic analysis of gliogenesis in rat optic nerves. Z \nZellforsch Mikrosk Anat. 1969;94:293-324 \n33. Stys PK, Waxman SG, Ransom BR. Ionic mechanisms of anoxic injury in \nmammalian CNS white matter: role of Na+ channels and Na(+)-Ca2+ exchanger. \nJ Neurosci. 1992;12:430-439 \nPage 22 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n 22 \n34. Malek SA, Coderre E, Stys PK. Aberrant chloride transport contributes to \nanoxic\/ischemic white matter injury. J Neurosci. 2003;23:3826-3836 \n35. Ouardouz M, Coderre E, Basak A et al. Glutamate receptors on myelinated spinal \ncord axons: I. GluR6 kainate receptors. Ann Neurol. 2009;65:151-159 \n36. Ouardouz M, Coderre E, Zamponi GW et al. Glutamate receptors on myelinated \nspinal cord axons: II. AMPA and GluR5 receptors. Ann Neurol. 2009;65:160-166 \n37. Ziskin JL, Nishiyama A, Rubio M et al. Vesicular release of glutamate from \nunmyelinated axons in white matter. Nat Neurosci. 2007;10:321-330 \n38. Kukley M, Capetillo-Zarate E, Dietrich D. Vesicular glutamate release from \naxons in white matter. Nat Neurosci. 2007;10:311-320 \n39. Marret S, Doyle LW, Crowther CA, Middleton P. Antenatal magnesium sulphate \nneuroprotection in the preterm infant. Semin Fetal Neonatal Med. 2007;12:311-\n317 \n40. Rouse DJ, Hirtz DG, Thom E et al. A randomized, controlled trial of magnesium \nsulfate for the prevention of cerebral palsy. N Engl J Med. 2008;359:895-905 \n41. Manning SM, Talos DM, Zhou C et al. NMDA receptor blockade with \nmemantine attenuates white matter injury in a rat model of periventricular \nleukomalacia. J Neurosci. 2008;28:6670-6678 \n42. Fontaine RH, Olivier P, Massonneau V et al. Vulnerability of white matter \ntowards antenatal hypoxia is linked to a species-dependent regulation of \nglutamate receptor subunits. Proc Natl Acad Sci U S A. 2008;105:16779-16784 \n \n \nDeleted: \nPage 23 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\nPage 11: [1] Deleted Robert Fern 4\/23\/2009 1:20:00 PM \nThe premyelinated central axons that are subject to injury during PVL are on the \nthreshold of a program of rapid diameter expansion and axolemma protein re-\norganization. At this point in the P10 RON, oligodendroglia are maturing and extending \nprocesses parallel to axons as voltage-gated Na-channels start to cluster at sites where \nnodes of Ranvier will form 26-28. Recent findings suggest that formation of the intricate \nmorphological arrangement between axons and oligodendrocyte processes is dependent \nupon axonal vesicular-type glutamate release, which may co-ordinate axo-glial \ninteractions via GluR on the oligodendrocyte processes 30, 35, 36. Premyelinated central \naxons also express functional glutamate transporters 37, and vesicular- and transporter-\nmediated glutamate release are potential sources of the extracellular glutamate \nresponsible for GluR-mediated injury of oligodendrocyte processes described in the \ncurrent study. Astrocytes may also act as a source of ischemic glutamate release in \ndeveloping white matter 37, 38. The localization of NMDA receptors to oligodendrocyte \nprocesses aligned along the axolemma of premyelinated axons indicates that Ca2+-\ndependent, Na+- and Cl--independent, injury to the processes at these sites precedes \nbreakdown of the neighbouring axolemma. The findings therefore place oligodendrocyte \nprocess injury before premyelinated axon injury in the sequence of events that result in \nacute loss of function in early developing white matter during ischemia.  \n In addition to expression on oligodendrocyte processes aligned along \npremyelinated axons, NMDA receptor protein was also observed in early compact \nmyelin. Similar expression in myelin is seen in mature rat optic nerve where it can \nmediate cytotoxic Ca2+ influx 9-11. Presumably as a result, NMDA receptors contribute to \nischemic injury in myelinated rat optic nerve 12, although no similar effect is found in \nmouse optic nerve 14, 15. The current findings indicate that NMDA receptor expression is \nhigh on oligodendroglial processes navigating along premyelinated axons but shifts to the \nmyelin as it is deposited, possible becoming trapped in the lamella. The absence of \nprotection of larger premyelinated axons by NMDA receptor block indicates that NMDA \nreceptors are not restricted to the axonal face of the oligodendrocyte process membrane \nonce it has ensheathed the axon cylinder. At this point in central axon development, \ninjury may involve the voltage-gate calcium channels recently documented in this axon \nPage 24 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\npopulation 30. The mechanism of small premyelinated axon injury following GluR-\nmediated disintegration of neighbouring oligodendrocyte process will be difficult to \ndissect from the process injury itself. Possible mediators include local release of \nintracellular potassium onto the axolemma resulting in depolarization and cytotoxic \nswelling; physical disruption of the axolemma during oligodendrocyte process swelling \nand dissolution, which will also disrupt the extracellular matrix; release of free radicals \ncapable of damaging the axolemma; and release of intracellular components such as \ncalpains and lipases likely to attack the axon directly. \n In addition to NMDA GluRs on their processes, developing oligodendroglia \nexpress non-NMDA receptors that can mediate toxic Ca2+-influx during ischemic \nconditions 3-7. The current findings support the view that these receptors are expressed \nmainly on the somata 10. Block of either NMDA or non-NMDA GluRs provided a similar \ndegree of protection from ischemic conditions. This may reflect the significant degree of \nMg2+-block of oligodendrocyte NMDA receptors 9 \n \nPage 11: [2] Deleted Robert Fern 4\/23\/2009 1:20:00 PM \n. Premyelinated central axons also express functional glutamate transporters 37, and \nvesicular- and transporter-mediated glutamate release are potential sources of the \nextracellular glutamate responsible for GluR-mediated injury of oligodendrocyte \nprocesses described in the current study. Astrocytes may also act as a source of ischemic \nglutamate release in developing white matter 37, 38. The localization of NMDA receptors \nto oligodendrocyte processes aligned along the axolemma of premyelinated axons \nindicates that Ca2+-dependent, Na+- and Cl--independent, injury to the processes at these \nsites precedes breakdown of the neighbouring axolemma. The findings therefore place \noligodendrocyte process injury before premyelinated axon injury in the sequence of \nevents that result in acute loss of function in early developing white matter during \nischemia.  \n In addition to expression on oligodendrocyte processes aligned along \npremyelinated axons, NMDA receptor protein was also observed in early compact \nmyelin. Similar expression in myelin is seen in mature rat optic nerve where it can \nPage 25 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\nmediate cytotoxic Ca2+ influx 9-11. Presumably as a result, NMDA receptors contribute to \nischemic injury in myelinated rat optic nerve 12, although no similar effect is found in \nmouse optic nerve 14, 15. The current findings indicate that NMDA receptor expression is \nhigh on oligodendroglial processes navigating along premyelinated axons but shifts to the \nmyelin as it is deposited, possible becoming trapped in the lamella. The absence of \nprotection of larger premyelinated axons by NMDA receptor block indicates that NMDA \nreceptors are not restricted to the axonal face of the oligodendrocyte process membrane \nonce it has ensheathed the axon cylinder. At this point in central axon development, \ninjury may involve the voltage-gate calcium channels recently documented in this axon \npopulation 30. The mechanism of small premyelinated axon injury following GluR-\nmediated disintegration of neighbouring oligodendrocyte process will be difficult to \ndissect from the process injury itself. Possible mediators include local release of \nintracellular potassium onto the axolemma resulting in depolarization and cytotoxic \nswelling; physical disruption of the axolemma during oligodendrocyte process swelling \nand dissolution, which will also disrupt the extracellular matrix; release of free radicals \ncapable of damaging the axolemma; and release of intracellular components such as \ncalpains and lipases likely to attack the axon directly. \n In addition to NMDA GluRs on their processes, developing oligodendroglia \nexpress non-NMDA receptors that can mediate toxic Ca2+-influx during ischemic \nconditions 3-7. The current findings support the view that these receptors are expressed \nmainly on the somata 10. Block of either NMDA or non-NMDA GluRs provided a similar \ndegree of protection from ischemic conditions. This may reflect the significant degree of \nMg2+-block of oligodendrocyte NMDA receptors 9, requiring cell depolarization via non-\nNMDA receptors before toxic Ca2+ influx can proceed. This may have significant clinical \nramifications, since magnesium sulphate is a recognized antenatal intervention associated \nwith a decreased risk of gross motor deficit in low birth weight babies 39. While the \nsignificance of this effect requires further investigation, elevated extracellular Mg2+ will \ninhibit NMDA receptors in developing white matter 9. The current findings raise the \npossibility that this prophylactic strategy may prove effective at protecting small \npremyelinated central axons in the foetus at risk of cerebral palsy. \nPage 26 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n \n \n \nPage 27 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n  \n \n \nFigure 1 \nOGD-induced injury in developing white matter. a: CAP recorded from the P10 RON before and 60 \nmin after 60 min of OGD in normal-Ca2+ (left) and zero-Ca2+ (right) conditions. The times \nindicated correspond to the time after the start of each experiment. b: The mean action potential \namplitude collapses during OGD and recovers partially, with greater recovery in zero-Ca2+ \nconditions. Note the stable CAP amplitude in aCSF (\"Control\"). c: Mean CAP recovery from OGD \nshowing the protective effect of zero-Ca2+ (applied 20 min before and removed 40 min after OGD). \nd: Control experiment showing stable recording during perfusion with the zero-Ca2+ solution. e: \nDisruption of neurofilament staining following OGD. NF-L (left), and NF-H (right) staining in control \nnerve (top) is disrupted following OGD (bottom). Note the presence of swollen axonal regions in the \nremaining NF-H (+) axons following OGD. f: The relative change in NF staining intensity between \ncontrol and post-OGD nerves. \"*\" = P<0.05; \"**\" = P<0.01. Scale bars = 10 µm. \n \nPage 28 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n \n77x190mm (600 x 600 DPI)  \n \nPage 29 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n \n  \n \n \nFigure 2 \nUltrastructural features of the injury induced by 60 min of OGD followed by 60 min recovery. a: \nControl perfusion for 120 min. Small (\"S\") and large (\"L\") diameter premyelinated axons populate \nthe RON, with occasional myelinated axons apparent (\"Ax\"). Some large premyelinated axons are \nensheathed by glial processes (e.g., \"*\"), while other glial processes traverse the extracellular space \nbetween axons. Note that all axons contain microtubules and have intact axoplasmic membranes. \nOligodendrocyte cell body indicated by \"Oli\". B: OGD + 60 min recovery. The extracellular space is \ngreatly expanded and intact glial processes can no longer be identified. The number of identifiable \npremyelinated axons is much reduced. c: Control long-section micrograph, illustrating the \narrangement of oligodendrocyte processes (arrow) extending parallel to a premyelinated axon. d: \nFollowing OGD in zero-Ca2+, premyelinated axons have a normal appearance. e: Long section post-\nOGD. A small premyelinated axon retaining a small number of microtubules (arrow) has a disrupted \nPage 30 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\naxoplasm throughout the section shown and a region of intense focal damage (arrow heads). A glial \nprocess (\"gp\") aligned next to the axon is disintegrating at a similar point (arrow-heads). Scale bar \na-d = 500 nm, e = 200 nm. \n \n \n154x215mm (600 x 600 DPI)  \n \nPage 31 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n \n  \n \n \n \nFigure 3 \nThe ionic-dependence of injury is novel. a (left): Representative CAP recorded before and after \nperfusion with zero-Na+ solution, note the full recovery following washout. a (Right): \nRepresentative example of the absence of protection against OGD by zero-Na+ solution. Note the \nlimited recovery following washout. b: Mean CAP amplitude, showing the low level of recovery \nfollowing OGD in zero-Na+. Note that after 20 min of zero-Na+ perfusion the action potential is \nblocked. c: Data summary for zero-Na+ experiments. d (left): Recordings before and after perfusion \nwith zero-Cl- solution, note the full recovery following washout. d (Right): Representative example \nof the absence of protection against OGD by zero-Cl- solution. Note the limited recovery following \nwashout. e: Mean CAP amplitude, showing the low level of recovery following OGD in zero-Cl. f: \nData summary from zero-Cl- experiments.  \n \n \n94x93mm (600 x 600 DPI)  \n \nPage 32 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n \n  \n \n \nFigure 4 \nGluRs mediate premyelinated axon injury. a: NMDA receptor block (MK-801) increases mean CAP \nrecovery following OGD. b, c: Block of non-NMDA GluR (NBQX) has a similar effect (b), as does \ncombined application (c). d: The extent of recovery following these procedures. e, f: Small diameter \npremyelinated axons (\"S\") and oligodendrocyte processes (\"op\") are protected from OGD in the \npresence of MK-801 + NBQX, while larger axons (\"L\") are not. g: A large diameter premyelinated \naxon has no axoplasmic structures intact while a glial process wrapped around the axon is \nundamaged (arrow heads).  \"*\" = P<0.05; \"***\" = P<0.001.  Scale bars = 1 µm in \"e\", 400 nm in \n\"f\", 100 nm in \"g\". \n \n \n88x155mm (600 x 600 DPI)  \nPage 33 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n \nPage 34 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n \n  \n \n \n \nFigure 5 \nMorphometric analysis of OGD induced axon injury. a: The density of premyelinated axons (the \nnumber of axons in an area) of different diameter (the diameter that corresponds to the axon \nperimeter) present within the P10 RON. Left: Control nerve, showing a peak in diameter between \n0.25-0.3 µm and a range between 0.15-0.70 µm. Right: The corresponding analysis for nerves \nexposed to OGD for 60 min followed by 60 min recovery (black bars). Note the much lower density \nof axons indicating loss of identifiable axons and expansion of the extracellular space. The \ncorresponding analysis from nerves exposed to OGD in the presence of NBQX and MK-801 (\"GluR \nblock') shows that many identifiable axons are present (white bars). b: The mean axon viability \nscore is shown for premyelinated axons below 0.4 µm in diameter (black bars) and those of 0.4 µm \nor above  (white bars). Note that following OGD, both small and large premyelinated axons are \nPage 35 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\nsignificantly injured, with the small premyelinated axons effected more than the large \npremyelinated axons. Following OGD in the presence of GluR blockers only the small premyelinated \naxons are significantly damaged. c-e: Individual size spectra of the viability scores, showing greatly \nimproved viability in axons <0.4 µm in the presence of GluR blockers. \"***\" = p<0.001 vs. control. \n \n \n112x179mm (600 x 600 DPI)  \n \nPage 36 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n \n  \n \n \nFigure 6 \nGluRs in developing white matter. a: NR1 (green, left) and CNPase (red, middle) appear to be co-\nlocalized (right) using fluorescent confocal imaging. Note that the NR1 clusters appear orange in the \noverlay. b: NR1 (green, left) and NF-H (red, middle) appear poorly co-localized (right). Note that \nthe NR1 clusters appear green in the overlay. c: Absence of staining when NR1 antibody was \nomitted. d: mRNA for NMDA receptor subunits in P10 RON. e-g: Localization of GluR NR1 subunit at \nthe ultrastructural level by immuno-gold labelling. e: A small diameter pre-myelinated axon (\"s\") is \naligned between an astrocyte process (\"ap\") and two myelinated axons (\"Ax\"). The boxed region is \nshown at higher gain to the right. Three immuno-gold beads (short arrows) are present on the \njunction between an oligodendroglial process (\"op\") and the small premyelinated axon. Note the \nabsence of NR1 reactivity on the astrocyte process. Also note the tubulovesicular complex \napparently fusing with the axolemma at this point (\"*\"), and the NR1 reactivity within the compact \nPage 37 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\nmyelin of a neighbouring axon (short arrow). f: An oligodendrocyte somata (\"Oli\") is extending a \nprocess showing NR1 reactivity (short arrows) along a small pre-myelinated axon. Note that no \nreactivity is seen in the somata itself. The boxed area is shown at higher gain to the right and \nreveals NR1 reactivity on the outer edge of an actively myelinating oligodendrocyte process. g: Two \noligodendrocyte processes (boxes) are navigating along small pre-myelinated axons (shown in great \ndetail to the right). In both cases, NR1 reactivity is present on the axon side of the process. \"gp\" \nindicates that this glial process can  not be positively identified as an oligodendrocyte process. Scale \nbars = a-c: 10 µm; e-f = 500 nm.  \n \n \n76x182mm (600 x 600 DPI)  \n \nPage 38 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\n \n  \n \n \nFigure 7 \nNon-NMDA GluRs are expressed in oligodendrocyte processes and the axolemma. a-b: The effect of \nGluR activation upon CAP amplitude in P10 rat optic nerve. a: Exposure to 200 µM AMPA + 200 µM \nkainic acid in the presence of 30 µM cyclothiazide evokes a small reversible reduction in CAP \namplitude. Sample CAPs are shown at the top, taken from the times indicated. Time \"1\" and \"2\" \nwere used to calculate mean data for the histogram, revealing a significant reduction in amplitude in \nexperiments performed in either the presence or the absence of cyclothiazide (* = p<0.05; ** = \nP<0.01 vs. control; 'n' numbers as indicated). b:  Exposure to 200 µM AMPA + 200 µM kainic acid + \n1 mM NMDA + 50 µM glycine in the absence of Mg2+ also produced a small reversible fall in CAP \namplitude (*** = P<0.01 vs. control; 'n' numbers as indicated; times \"1\" and \"3\" were used for the \nhistogram data). Cyclothiazide has no effect applied alone. c-i: Localization of GluR 2\/3 (c-e) and \nKA2 (f-i) subunit at the ultrastructural level by immuno-gold labelling. c: Strong staining (short \narrows) is apparent for GluR 2\/3 in a myelinating axon (\"Ax\"), with gold particles present within and \nunder the myelin (\"my\"). The axon contains a mitochondria (\"mit\"). Staining is also present on the \naxoplasmic side of the axolemma (the axolemma is indicated by arrow heads) of a neighbouring \nsmall premyelinated axon (\"s\"). d: Gold particles largely located on the axoplasmic side of the \nmyelin of a myelinating axon. e: Three gold particles are located on the interface between a glial \nprocesse (\"gp\") and a small pre-myelinated axon (axolemma indicated by arrowheads). f: Immuno-\nlabelling for KA-2 reveals focal expression associated with the myelin of an actively myelinating \naxon. g: Focal axolemma staining of a premyelinated axon facing an ensheathing oligodendrocyte \nprocess (\"op\"). h: focal staining on the axolemma  underneath an actively myelinating \noligodendrocyte process. Note the near-by astrocyte processes (\"ap\"). i: KA-2 reactivity in the \naxoplasm and axolemma of small premyelinating axons contacted by glial processes.  Scale = 500 \nPage 39 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\nnm. \n \n \n203x179mm (600 x 600 DPI)  \n \n \nPage 40 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\nPage 41 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\nPage 42 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\nPage 43 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\nPage 44 of 45\nJohn Wiley & Sons\nAnnals of Neurology\nFor Peer Review\nPage 45 of 45\nJohn Wiley & Sons\nAnnals of Neurology\n"}