{"doi":"10.1109\/TAP.2004.841274","coreId":"66728","oai":"oai:dro.dur.ac.uk.OAI2:288","identifiers":["oai:dro.dur.ac.uk.OAI2:288","10.1109\/TAP.2004.841274"],"title":"On wave boundary elements for radiation and scattering problems with piecewise constant impedance.","authors":["Perrey-Debain,  E.","Trevelyan,  J.","Bettess,  P."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-02","abstract":"Discrete methods of numerical analysis have been used successfully for decades for the solution of problems involving wave diffraction, etc. However, these methods, including the finite element and boundary element methods, can require a prohibitively large number of elements as the wavelength becomes progressively shorter. In this paper, a new type of interpolation for the wave field is described in which the usual conventional shape functions are modified by the inclusion of a set of plane waves propagating in multiple directions. Including such a plane wave basis in a boundary element formulation is found in this paper to be highly successful. Results are shown for a variety of scattering\/radiating problems from convex and nonconvex obstacles on which are prescribed piecewise constant Robin conditions. Notable results include a conclusion that, using this new formulation, only approximately three degrees of freedom per wavelength are required","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66728.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/288\/1\/288.pdf","pdfHashValue":"75e8b9e0d28c44ad068134621bb55093daa5c760","publisher":"IEEE","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:288<\/identifier><datestamp>\n      2011-05-24T15:55:06Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        On wave boundary elements for radiation and scattering problems with piecewise constant impedance.<\/dc:title><dc:creator>\n        Perrey-Debain,  E.<\/dc:creator><dc:creator>\n        Trevelyan,  J.<\/dc:creator><dc:creator>\n        Bettess,  P.<\/dc:creator><dc:description>\n        Discrete methods of numerical analysis have been used successfully for decades for the solution of problems involving wave diffraction, etc. However, these methods, including the finite element and boundary element methods, can require a prohibitively large number of elements as the wavelength becomes progressively shorter. In this paper, a new type of interpolation for the wave field is described in which the usual conventional shape functions are modified by the inclusion of a set of plane waves propagating in multiple directions. Including such a plane wave basis in a boundary element formulation is found in this paper to be highly successful. Results are shown for a variety of scattering\/radiating problems from convex and nonconvex obstacles on which are prescribed piecewise constant Robin conditions. Notable results include a conclusion that, using this new formulation, only approximately three degrees of freedom per wavelength are required. <\/dc:description><dc:subject>\n        Boundary integral equation<\/dc:subject><dc:subject>\n         Helmholtz Equation<\/dc:subject><dc:subject>\n         Plane waves<\/dc:subject><dc:subject>\n         Wave scattering<\/dc:subject><dc:subject>\n         High-frequency<\/dc:subject><dc:subject>\n         Diffraction problems<\/dc:subject><dc:subject>\n         Partition.<\/dc:subject><dc:publisher>\n        IEEE<\/dc:publisher><dc:source>\n        IEEE transactions on antennas and propagation, 2005, Vol.53(2), pp.876-879 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2005-02<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:288<\/dc:identifier><dc:identifier>\n        issn:0018-926X<\/dc:identifier><dc:identifier>\n        doi:10.1109\/TAP.2004.841274<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/288\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1109\/TAP.2004.841274<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/288\/1\/288.pdf<\/dc:identifier><dc:rights>\n        ©2005 IEEE. Personal use of this material is permitted. However, permission to reprint\/republish this material for advertising or promotional purposes or for creating new collective works for resale or redistribution to servers or lists, or to reuse any copyrighted component of this work in other works must be obtained from the IEEE.\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0018-926X","0018-926x"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2005,"topics":["Boundary integral equation","Helmholtz Equation","Plane waves","Wave scattering","High-frequency","Diffraction problems","Partition."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n27 May 2008\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nPerrey-Debain, E. and Trevelyan, J. and Bettess, P. (2005) ’On wave boundary elements for radiation and\nscattering problems with piecewise constant impedance.’, IEEE transactions on antennas and propagation., 53\n(2). pp. 876-879.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1109\/TAP.2004.841274\nPublisher’s copyright statement:\n2005 IEEE. Personal use of this material is permitted. However, permission to reprint\/republish this material for\nadvertising or promotional purposes or for creating new collective works for resale or redistribution to servers or lists,\nor to reuse any copyrighted component of this work in other works must be obtained from the IEEE.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n876 IEEE TRANSACTIONS ON ANTENNAS AND PROPAGATION, VOL. 53, NO. 2, FEBRUARY 2005\nwall width is properly selected, the fundamental resonant frequency of\ninner triangular PIFA can be coupled with the resonance that is intro-\nduced by the V-slot, and consequently a wide-band operation is ob-\ntained in the higher frequency band. A large operating bandwidth of\n36% has been demonstrated. In addition, the radiation patterns across\nthe entire operating bands are also measured; the antenna gain is about\n4 and 4.3 dBi for the lower and higher frequency bands, respectively.\nREFERENCES\n[1] K. L. Wong, M. C. Pan, and W. H. Hsu, “Single-feed dual-frequency\ntriangular microstrip antenna with a V-shaped slot,” Microwave Opt.\nTechnol. Lett., vol. 20, pp. 133–134, Jan. 1999.\n[2] T. Huynh and K. F. Lee, “Single-layer single-patch wideband microstrip\nantenna,” Electron. Lett., vol. 31, pp. 1310–1312, Aug. 1995.\n[3] K. M. Luk, K. F. Lee, and W. L. Tam, “Circular U-slot patch with di-\nelectric superstrate,” Electron. Lett., vol. 33, pp. 1001–1002, Jun. 1997.\n[4] P. Salonen, M. Keskilammi, and M. Kivikoski, “Single-feed dual-band\nplanar inverted-F antenna with U-shaped slot,” IEEE Trans. Antennas\nPropag., vol. 48, pp. 1262–1264, Aug. 2000.\n[5] , “Dual-band and wide-band PIFAwith U- andmeanderline-shaped\nslots,” in IEEE Trans. Antennas Propag. Symp. Dig., vol. 2, Jul. 2001,\npp. 8–13.\n[6] D. Nashaat, H. A. Elsadek, and H. Ghali, “A wideband compact shorted\nrectangular microstrip patch antenna with U-shaped slot,” in IEEE\nTrans. Antennas Propagat. Symp. Dig., vol. 2, Jun. 2003, pp. 22–27.\n[7] Y. X. Guo, K. M. Luk, K. F. Lee, and R. Chair, “A quarter-wave\nU-shaped patch antenna with two unequal arms for wideband and\ndual-frequency operation,” IEEE Trans. Antennas Propag., vol. 50, pp.\n1082–1087, Aug. 2002.\n[8] K. Ogawa and T. Uwano, “A diversity antenna for very small 800-MHz\nband portable telephones,” IEEE Trans. Antennas Propag., vol. 42, pp.\n1342–1345, Sep. 1994.\n[9] Y. Yoshimura, “A microstripline slot antenna,” IEEE Trans. Microwave\nTheory Tech., vol. MTT-20, pp. 760–762, Nov. 1972.\nOnWave Boundary Elements for Radiation and Scattering\nProblems With Piecewise Constant Impedance\nEmmanuel Perrey-Debain, Jon Trevelyan, and Peter Bettess\nAbstract—Discrete methods of numerical analysis have been used suc-\ncessfully for decades for the solution of problems involvingwave diffraction,\netc. However, these methods, including the finite element and boundary el-\nement methods, can require a prohibitively large number of elements as\nthe wavelength becomes progressively shorter. In this paper, a new type\nof interpolation for the wave field is described in which the usual conven-\ntional shape functions are modified by the inclusion of a set of plane waves\npropagating in multiple directions. Including such a plane wave basis in\na boundary element formulation is found in this paper to be highly suc-\ncessful. Results are shown for a variety of scattering\/radiating problems\nfrom convex and nonconvex obstacles on which are prescribed piecewise\nconstant Robin conditions. Notable results include a conclusion that, using\nthis new formulation, only approximately three degrees of freedom per\nwavelength are required.\nIndex Terms—Boundary integral equation, Helmholtz equation,\nimpedance, plane waves, wave scattering.\nManuscript received November 5, 2003; revised July 22, 2004. This work\nwas supported by the EPSRC, under Grant GR\/N09879.\nE. Perrey-Debain is with the Department of Mathematics, University of Man-\nchester, Manchester M13 9PL, U.K. (e-mail: emmanuel@maths.man.ac.uk).\nJ. Trevelyan and P. Bettess are with the School of Engineering, University of\nDurham, Durham DH1 3LE, U.K.\nDigital Object Identifier 10.1109\/TAP.2004.841274\nI. INTRODUCTION\nIt is well known that the use of discrete (frequency domain) numer-\nical methods for the solution of the Helmholtz equation is limited to\nproblems in which the wavelength under consideration is not small in\ncomparison with the domain size. The limitation arises because con-\nventional elements, based on polynomial shape functions, can reliably\ncapture only a limited portion of the sinusoidal waveform. A commonly\nquoted rule of thumb requires eight to ten nodes per full wavelength.\nIt can quickly be seen that problems involving large domains and short\nwaves may require impracticably large computational resources. This\napplies to both finite element and boundary element simulations.\nFollowing earlier predictions of de La Bourdonnaye [1] and the par-\ntition of unity method introduced by Melenk and Babus˘ka [2], it has\nbeen found that drastic progress can be made by including the essen-\ntial wave character of the wave field in the element formulation. To be\nmore precise, we assume that the solution can be written as a finite sum\nof terms like ai(r) exp(i\u0014\u0018i \u0001r)where the point r belongs either to the\npropagative domain\n in a finite element volume discretization scheme\n(see, for example, [3] and [4]) or its boundary \r = @\n in a boundary el-\nement discretization scheme arising from integral equations. Functions\nai(r) are “slowly” varying functions compactly supported and vectors\n\u0018i, which define the wave directions, are of unit amplitude. In [5], we\ngive details of the implementation of the method in a boundary element\ncontext and investigate its accuracy and numerical characteristics, in-\ncluding the condition number of the resulting systemmatrix. Numerical\nscattering results on simple geometries showed that this new formula-\ntion can provide extremely accurate results at a relatively low cost (up\nto eight digits accuracy with only four variables per wavelength) [6],\n[7] and allows the frequency range to be extended by a factor of three\nto four for bidimensional problems.\nIn this paper, we deal with more complicated situations in which\npart of the scatterer can be radiating and\/or absorbing as well. We\nshow, through various numerical examples, that the “wave boundary\nelements” method remains very efficient and should have, we hope, a\nsignificant impact on the modeling of shortwave problems in many dif-\nferent fields.\nII. FORMULATION\nWe consider a two-dimensional obstacle of general shape with\nsmooth boundary in an infinite propagative medium impinged upon\nby a time-harmonic wave \binc. By using the direct formulation via\nthe Green second identity, the 2-D Helmholtz equation is reformulated\ninto a boundary integral equation on the boundary \r as follows (the\nusual e\u0000i!t time-dependence is adopted):\n1\n2\n\b(r) +\n\r\nrG(r; r0) \u0001 n\b(r0)d\r(r0)\n\u0000\n\r\nG(r; r0)r\b(r0) \u0001 n d\r(r0) = \binc(r) (1)\nwhere n is the normal unit vector at point r0 directed into the obstacle,\nG is the free-space Green function G(r; r0) = (i=4) H0(\u0014jr \u0000 r0j),\nwhere H0 is the Hankel function of the first kind of order zero, and\ni =\np\u00001. \u0014 is the wavenumber given by \u0014 = 2\u0019=\u0015, where \u0015 is\nthe wavelength. Along the boundary are imposed the following general\nimpedance boundary conditions of the form:\nr\b \u0001 n = i\u000b\b + \f on \r (2)\nwhere \u000b; \f are two complex-valued functions defined on the boundary.\nIn the acoustic case, \b is the velocity potential and \u000b is called the sur-\n0018-926X\/$20.00 © 2005 IEEE\nIEEE TRANSACTIONS ON ANTENNAS AND PROPAGATION, VOL. 53, NO. 2, FEBRUARY 2005 877\nface admittance, which is absorbing if <e(\u000b) \u0015 0. In the electromag-\nnetic case, the Dirichlet problem (respectively, Neumann) corresponds\nto TM (respectively, TE) electromagnetic scattering.\nWe consider obstacles whose boundaries admit the parameterization\n\r : r = r(s); s 2 [0; 2\u0019] (3)\nwhere s is the curvilinear abscissa. We assume throughout that \u000b and\n\f are piecewise constant such that\n\u000b(s) = \u000bj ; s 2]sj ; sj+1[ (4)\n\f(s) = \fj ; s 2]sj ; sj+1[ (5)\nfor some 0 = s1 < s2 < \u0001 \u0001 \u0001 < sn < sn+1 = 2\u0019. On each subdo-\nmain r(s); s 2]sj ; sj+1[, we define the basis function \bqj as a prop-\nagative plane wave of unit direction \u0018q modulated by the conventional\nquadratic shape functions\n\bqj (r) =\n1\n2\n\u001e1j;q \u001e\n2\nj;q \u001e\n3\nj;q\nt(t\u0000 1)\n2(1\u0000 t2)\nt(t+ 1)\nexp(i\u0014\u0018q \u0001 r) (6)\nwhere f\u001eej;qge=1;2;3 represent the basis function coefficients. The pa-\nrameter t is defined over [\u00001,1] and varies linearly with the curvilinear\nabscissa s as t = (2s\u0000 sj \u0000 sj+1)=(sj+1 \u0000 sj).\nThe solution space is constructed by introducing Q plane waves\npropagating in various directions evenly distributed over the unit circle\n\u0018q = (cos(q2\u0019=Q); sin(q2\u0019=Q)), so that we can write the solution of\n(1) in the compact form\n\b(r) =\nn\nj=1\nQ\nq=1\n\bqj (r); r 2 \r: (7)\nThe boundary element r(s)s <s<s is expected to span over many\nwavelengths and is named “wave boundary element.” The integral for-\nmulation (1) is enforced by point-matching at points regularly dis-\ntributed over the boundary line. Irregular frequency effects are avoided\nusing Schenck’s method [9]. For more details concerning implementa-\ntion and integration schemes, one can refer to [5]. In the next section,\nwe assess the efficiency of the method for both convex and nonconvex\nobstacles.\nIII. RESULTS\nOur first numerical tests concern radiating and scattering by the unit\ncircle r(\u0012) = (cos \u0012; sin \u0012), for which analytic solutions can be ob-\ntained via Fourier series. For the sake of simplicity, we restrict our-\nselves to a regular subdivision sj = \u0012j = (j \u0000 1)2\u0019=n and we con-\nsider an incident plane wave propagating in the direction d\n\binc(r) = exp(i\u0014d \u0001 r): (8)\nLet us assume that d = (1; 0). In the exterior region (r \u0015 1), the\nanalytical solution can be expanded in polar coordinates as\n\bana(r; \u0012) =\nm\n(AmHm(\u0014r) + i\nmJm(\u0014r))e\nim\u0012 (9)\nwhereHm and Jm are, respectively, Hankel and Bessel functions of the\nfirst kind of orderm. Now, let \u000b^m and \f^m be the Fourier components\nof, respectively, \u000b and \f. We call v the nth root of unity v = ei2\u0019=n.\nStraighforward calculations then yield\n\u000b^0 =\n1\nn\nn\nj=1\n\u000bj (10)\n\u000b^m =\ni(1\u0000 vm)\n2\u0019m\nn\nj=1\n\u000bjv\n\u0000jm; m 6= 0 (11)\nand similarly for \f^m. Injecting (9) in (2) yields the following (infinite)\nsystem for the unknown coefficients Am:\np\n(i\u000b^m\u0000pHp(\u0014) + \u0014H\n0\np(\u0014)\u000emp)Ap\n= \u0000\np\n\u000b^m\u0000pi\np+1 Jp(\u0014)\u0000 i\nm\u0014J 0m(\u0014)\u0000 \f^m (12)\nwhere \u000e is the Kronecker symbol and the prime denotes differentiation\nwith respect to the argument. For numerical reasons, it is strongly ad-\nvised to consider the variable Bp = Hp(\u0014)Ap so that the impedance\nmatrix coefficients\nZmp = i\u000b^m\u0000p + \u0014\nH 0p(\u0014)\nHp(\u0014)\n\u000emp\nremain bounded. When p\u001d \u0014, asymptotic forms for Hankel functions\nare used [10].\nObviously, the series (9) is convergent only in the least square sense\nand relatively “poor” convergence is expected at the discontinuity\npoints \u0012j [this is even more the case for components \u000b^m; \f^m whose\nmagnitude decreases only as O(m\u00001)]. Nevertheless, this is not a\nmajor issue here since in our applications we are interested in “engi-\nneering accuracy” (say, in the range 0.1–1%).\nPerformances of the method are conveniently summarized in Table I.\nThe first two rows are concerned with the radiation from the unit circle\nof 50\u0015 width. The error is measured in the L2-norm as\n\"2 =\n\r\nj\b(r)\u0000 \bana(r)j2 d\r(r)\n\r\nj\bana(r)j2 d\r(r)\n1=2\n: (13)\nWe can note that these values are overestimated since the analytical\nsolution is not accurate. It could be useful to develop a better formula\nthan the “slowly” converging Fourier series (9). In this regard, one can\nrefer to [11] for a rigourous numerical treatment for acoustic scattering\nin half-plane by a surface of piecewise constant impedance. On the\nlast column is shown the average discretization level (i.e., the number\nof degrees of freedom per wavelength). The corresponding graphs of\nthe magnitude j\bj along the boundary line are plotted in Figs. 2 and\n3. The agreement is excellent and differences between curves are not\ndiscernible. In example (ii), one can see the presence (or not) of the\nabsorbers.\nTest (iii) shows the efficiency of the wave boundary elements when\ndealing with a pure scattering problem. Indeed, 2.8 variables per wave-\nlength are sufficient to get three to four digit accuracy results. One can\nsee in Fig. 4 some stationary waves occuring at the vicinity of the junc-\ntions sj . These effects are absent when the impedance is constant on\nthe surface of the obstacle.\nIn order to give a fair comparison with other methods, the scattering\nexample (iii) has been tested with two other kinds of approximation\nschemes (see Table II). Note that in both formulations, the exact map-\nping (3) is considered so that errors are not influenced by the geometry\ndescription. When using the conventional quadratic shape functions,\nat least ten variables per wavelength are needed to get accuracy below\n1%. Obviously, if one is only interested in the far-field pattern then\n878 IEEE TRANSACTIONS ON ANTENNAS AND PROPAGATION, VOL. 53, NO. 2, FEBRUARY 2005\nFig. 1. Geometry of the obstacles considered in our calculations.\nTABLE I\n5 TESTED CONFIGURATIONS (\u0015 = 0:04 AND z = 1 + i). (*) ZERO VALUES ARE NOT ON DISPLAY\nFig. 2. Surface “current” magnitude j\bj for test (i).\nfive variables per wavelength could be sufficient. As clearly shown, the\ncomplexity can be reduced by a factor 2 if the reduced potential\b=\binc\n(instead of \b) is taken as the unknown (see similar treatments in [8],\n[12], and [13] and recent developments of the method in [14]). When\ndealing with the specific case of the scattering by smooth convex nonra-\nFig. 3. Surface “current” magnitude j\bj for test (ii).\ndiating obstacles with constant surface admittance, this “reduced” for-\nmulation is known as stemming from asymptotic theory and leads to a\nO(\u00141=3) complexity [8], [7]. In the current case, the performances of-\nfered by this latter are significantly affected due to discontinuity effects\nand our “wave boundary element” method remains competitive.\nIEEE TRANSACTIONS ON ANTENNAS AND PROPAGATION, VOL. 53, NO. 2, FEBRUARY 2005 879\nFig. 4. Surface “current” magnitude j\bj for test (iii).\nTABLE II\nCOMPARISON WITH OTHER KINDS OF APPROXIMATION SCHEME FOR TEST (iii)\nIn test (iv), we increase the difficulty by considering a nonconvex\nreflector whose shape is illustrated in Fig. 1 and given by the following\nparameterization:\nr(s) = ([cos s+ 10 cos 2s\u0000 10]=10; sin s); s 2 [0; 2\u0019]: (14)\nThe illuminated zone s 2 [\u0019=2; 3\u0019=2] is covered with an absorbing\nlayer \u000b2 = \u000b3 = 100(1\u0000 i). In the shadow zone, the admittance is set\nto zero. Three calculations have been carried out with, respectively, 90,\n100, and 120 directions. On Fig. 5 are plotted the magnitude of the\npotential and differences between curves are hardly noticeable. The\nglobal L2-error between these three sets of results is estimated to be\nbelow 0.1%. One can observe standing waves of very small magnitude\nin the “silent” zone \u000010\u000e \u0014 s(deg) \u0014 10\u000e.\nTest (v) deals with the same obstacle and an incident wave travelling\nin the opposite direction d = (\u00001; 0). Here again, results obtained are\nof very good quality even in the shadow region, and the stability of our\nmethod is clearly shown in these examples.\nIV. CONCLUSION\nThis paper has presented some tests illustrating the numerical per-\nformance of the wave boundary elements method for the solution of the\nHelmholtz equation. The potential is expressed in nodal form as the am-\nplitude of some artificial plane waves travelling in various directions.\nFig. 5. Surface “current” magnitude j\bj for test (iv) [curve labeled a with\nd = (1; 0)] and test (v) [curve labeled b with d = (\u00001;0)].\nThe modulation of this plane wave basis, provided by the polynomial\nshape functions, gives the boundary solution. The method is applicable\nfor convex and nonconvex scatterers on the surface of which are im-\nposed general Robin conditions. In practical terms, the method is ex-\npected to provide three to four digit accuracy of results with a relatively\nlow discretization level of three variables per wavelength.\nREFERENCES\n[1] A. de La Bourdonnaye, “Convergence of the approximation of wave\nfunctions by oscillatory functions in the high frequency limit,” C. R.\nAcad. Sci. Paris, ser. I, vol. 318, pp. 765–768, 1994.\n[2] J. M. Melenk and I. Babus˘ka, “The partition of unity method,” Int. J.\nNumer. Meth. Eng., vol. 40, pp. 727–758, 1997.\n[3] O. Laghrouche, P. Bettess, and R. J. Astley, “Modeling of short diffrac-\ntion wave problems using approximating system of plane waves,” Int. J.\nNumer. Meth. Eng., vol. 54, pp. 1501–1533, 2002.\n[4] P. Ortiz and E. Sanchez, “An improved partition of unity finite element\nmodel for diffraction problems,” Int. J. Numer. Meth. Eng., vol. 50, pp.\n2727–2740, 2000.\n[5] E. Perrey-Debain, J. Trevelyan, and P. Bettess, “Planewave interpolation\nin direct collocation boundary element method for radiation and wave\nscattering: Numerical aspects and applications,” J. Sound Vib., vol. 261,\nno. 5, pp. 839–858, 2003.\n[6] , “Using wave boundary elements in BEM for high frequency scat-\ntering,” in Proc. 3rd U.K. Conf. Boundary Integral Methods, Brighton,\nU.K., Sep. 2001, pp. 119–128.\n[7] , “Numerical aspects of single wave basis boundary elements for\nacoustic scattering,” in Proc. 4th U.K. Conf. Boundary Integral Methods,\nSalford, U.K., Sep. 2003, pp. 77–86.\n[8] T. N. Abboud, J.-C. Nédélec, and B. Zhou, “Méthodes des équations\nintégrales pour les hautes fréquences,” C. R. Acad. Sci. Paris, ser. I, vol.\n318, pp. 165–170, 1994.\n[9] H. A. Schenck, “Improved integral formulation for acoustic radiation\nproblems,” J. Acoust. Soc. Amer., vol. 44, pp. 41–58, 1968.\n[10] Handbook of Mathematical Functions, 10th ed., National Bureau of\nStandards, U.S. Government Printing Office, Washington, DC, 1972.\n[11] S. N. Chandler-Wilde, S. Langdon, and L. Ritter, “A high wavenumber\nboundary element method for an acoustic scattering problem,” Phil.\nTrans. Roy. Soc. London A, vol. 362, pp. 647–671, 2004.\n[12] K. R. Aberegg and A. F. Peterson, “Application of the integral equa-\ntion-asymptotic phase method to dimensional scattering,” IEEE Trans.\nAntennas Propag., vol. 43, no. 5, pp. 534–537, May, 1995.\n[13] J. M. James, “A contribution to scattering calculation for small wave-\nlengths—The high frequency panel method,” IEEE Trans. Antennas\nPropag., vol. 38, no. 10, pp. 1625–1630, Oct. 1990.\n[14] O. P. Bruno, C. A. Geuzaine, J. A. Monro, and F. Reitich, “Prescribed\nerror tolerances within fixed computational times for scattering prob-\nlems of arbitrarily high frequency: The convex case,” Phil. Trans. Roy.\nSoc. London A, vol. 362, pp. 629–645, 2004.\n"}