{"doi":"10.1111\/j.1365-2575.2010.00360.x","coreId":"96366","oai":"oai:eprints.lse.ac.uk:30029","identifiers":["oai:eprints.lse.ac.uk:30029","10.1111\/j.1365-2575.2010.00360.x"],"title":"Collective agility, paradox and organizational improvisation: the development of a particle physics grid","authors":["Zheng, Yingqin","Venters, Will","Cornford, Tony"],"enrichments":{"references":[{"id":17284250,"title":"A Field Study of the Software Design Process for Large Systems.&quot;","authors":[],"date":"1988","doi":"10.1145\/50087.50089","raw":"Curtis,  B.,  H.  Krasner,  and  Iscoe  N.  &quot;A  Field  Study  of  the  Software  Design  Process  for  Large Systems.&quot; Communications of the ACM (31:11) 1988, pp1268-1287 Dahlbom, B., and Mathiassen, L. Computers in Context: The Philosophy and Practice of Systems Design, Malden, USA, 1993.","cites":null},{"id":17284243,"title":"A Garbage Can Model of Organisational Choice,&quot;","authors":[],"date":"1972","doi":null,"raw":"Cohen,  M.D.,  et  al.  &quot;A  Garbage  Can  Model  of  Organisational  Choice,&quot;  Administrative  Science Quarterly (17:1), 1972, pp. 1-25.","cites":null},{"id":17284231,"title":"A Grid for Particle Physics - from Testbed to Production,&quot; GridPP,","authors":[],"date":"2004","doi":null,"raw":"Britton, D., Clark, P., Coles, J., Colling, D., Doyle, A., Fisher, S.M., Irving, A.C., Jensen, J., McNab, A. and Newbold, D. &quot;A Grid for Particle Physics - from Testbed to Production,&quot; GridPP, 2004.","cites":null},{"id":17284284,"title":"A Rational Design Process: How and Why To Fake It,&quot;","authors":[],"date":"1986","doi":"10.1109\/tse.1986.6312940","raw":"Parnas,  D.,  and  Clements,  P.  &quot;A  Rational  Design  Process:  How  and  Why  To  Fake  It,&quot;  IEEE Transaction of software engineering, 1986, pp 346-357.","cites":null},{"id":17284216,"title":"A Reappraisal of Structured Analysis: Design in an Organisational Context,&quot;","authors":[],"date":"1993","doi":"10.1145\/130226.148055","raw":"Bansler,  J.,  and  Bodker,  K.  &quot;A  Reappraisal  of  Structured  Analysis:  Design  in  an  Organisational Context,&quot; ACM transactions on Information Systems (11:2), April 1993, pp 165-193.","cites":null},{"id":17284215,"title":"A Review of the Methodologies Movement&quot;,","authors":[],"date":"1993","doi":"10.1057\/jit.1993.38","raw":"Avgerou, C. and T. Cornford, &quot;A Review of the Methodologies Movement&quot;, Journal of Information Technology(5) 1993, pp. 277-286.","cites":null},{"id":17284230,"title":"A spiral model of software development and enhancement,&quot;","authors":[],"date":"1988","doi":"10.1109\/2.59","raw":"Boehm, B. &quot;A spiral model of software development and enhancement,&quot; Computer (21:5), May 1988, pp 61-72.","cites":null},{"id":17284238,"title":"A Theory of Information Systems Based on Improvisation,&quot;","authors":[],"date":"1999","doi":null,"raw":"Ciborra, C. &quot;A Theory of Information Systems Based on Improvisation,&quot; In Rethinking Management Information Systems, W. Currie and B. Galliers (eds.), Oxford University Press, Oxford, 1999, pp. 136-155.","cites":null},{"id":17284259,"title":"Agility in Software Development,&quot;","authors":[],"date":"2002","doi":null,"raw":"Highsmith, J. &quot;Agility in Software Development,&quot; In Agile Software Development Ecosystems, J. Highsmith (ed.) Addison Wesley Professional, 2002.","cites":null},{"id":17284269,"title":"Aligning IT Components to Achieve Agility in Globally Distributed System Development,&quot;","authors":[],"date":"2006","doi":"10.1145\/1164394.1164419","raw":"Lee, O.-K., Banerjee, P., Lim, K.H., Kumar, K., Hillegersberg, J.v., and Wei, K.K. &quot;Aligning IT Components  to  Achieve  Agility  in  Globally  Distributed  System  Development,&quot; Communications of the ACM (49:10) 2006, pp 49-54.","cites":null},{"id":17284290,"title":"Amethodical Systems Development: The Deferred Meaning of Systems Development Methods,&quot; Accounting,","authors":[],"date":"2000","doi":"10.1016\/s0959-8022(99)00009-0","raw":"Truex, D., Baskerville, R. and Travis J. &quot;Amethodical Systems Development: The Deferred Meaning of  Systems  Development  Methods,&quot;  Accounting,  Management  and  Information  Technology (10), 2000, pp. 53-79.","cites":null},{"id":17284223,"title":"Artful Planning&quot;,","authors":[],"date":"2006","doi":"10.1057\/palgrave.ejis.3000622","raw":"Baskerville, R.L. &quot;Artful Planning&quot;, European Journal of Information Systems (15), 2006, pp.113-115.","cites":null},{"id":17284246,"title":"Basics of Qualitative Research,","authors":[],"date":"2008","doi":"10.1177\/1094428108324514","raw":"Corbin, J., and Strauss, A. Basics of Qualitative Research, Sage, Los Angeles, 2008.","cites":null},{"id":17284289,"title":"Beamtimes and Lifetimes: The World of High Energy Physicists,","authors":[],"date":"1988","doi":"10.1063\/1.2810632","raw":"Traweek, S. Beamtimes and Lifetimes: The World of High Energy Physicists, Harvard University Press, London, 1988.","cites":null},{"id":17284268,"title":"Between Transient Constructs and Persistent Structures: Designing Systems in Action,&quot;","authors":[],"date":"1999","doi":"10.1016\/s0963-8687(00)00031-7","raw":"Lanzara,  G.F.  &quot;Between  Transient  Constructs  and  Persistent  Structures:  Designing  Systems  in Action,&quot; Journal of Strategic Information Systems (8), 1999, pp. 331-349.","cites":null},{"id":17284244,"title":"Building a National Health IT system from the Middle Out',","authors":[],"date":"2009","doi":"10.1197\/jamia.m3183","raw":"Coiera, E, 'Building a National Health IT system from the Middle Out', Journal of American Medical Information Association, 16(3), 2009, pp271-273.","cites":null},{"id":17284273,"title":"Business Agility and Diffusion of Information Technology,&quot;","authors":[],"date":"2006","doi":"10.1057\/palgrave.ejis.3000610","raw":"Mathiassen,  L.,  and  Pries-Heje,  J.  &quot;Business  Agility  and  Diffusion  of  Information  Technology,&quot; European Journal of Information Systems (15) 2006, pp 116-119.","cites":null},{"id":17284275,"title":"C,,&quot;Organisational Improvisation and Learning: A Field Study,&quot;","authors":[],"date":"2001","doi":"10.2307\/2667089","raw":"Miner, A.S., Bassoff, P. Moorman, C,,&quot;Organisational Improvisation and Learning: A Field Study,&quot; Administrative Science Quarterly (46), 2001, pp. 304-337.","cites":null},{"id":17284234,"title":"Cloud computing and emerging IT platforms: Vision, hype, and reality for delivering computing as the 5th utility,","authors":[],"date":"2009","doi":"10.1016\/j.future.2008.12.001","raw":"Buyya, R., Yeo, C.S., Venugopal, S. Broberg, J. and Brandic, I. Cloud computing and emerging IT platforms:  Vision,  hype,  and  reality  for  delivering  computing  as  the  5th  utility,  Future Generation Computer Systems, 25(6) 2009, pp. 599-616.","cites":null},{"id":17284218,"title":"Coda: Creativity and Improvisation in Jazz and Organisations: Implications for Organisational Learning,&quot;","authors":[],"date":"1998","doi":"10.1287\/orsc.9.5.605","raw":"Barrett,  F.J.  &quot;Coda:  Creativity  and  Improvisation  in  Jazz  and  Organisations:  Implications  for Organisational Learning,&quot; Organisation Science (9:5), 1998, pp. 605-622.","cites":null},{"id":17284261,"title":"Cognition in the Wild,","authors":[],"date":"1995","doi":"10.2307\/3034455","raw":"Hutchins, E. Cognition in the Wild, the MIT Press, Cambridge, MA, 1995.","cites":null},{"id":17284304,"title":"Collective Mind in Organisations: Heedful Interrelating on Flight Decks,&quot;","authors":[],"date":"1993","doi":"10.2307\/2393372","raw":"Weick, K.E., and Roberts, K.H. &quot;Collective Mind in Organisations: Heedful Interrelating on Flight Decks,&quot; Administrative Science Quarterly (38), 1993, pp. 357-381.","cites":null},{"id":17284262,"title":"Computing at CERN: The Mainframe Era,&quot;","authors":[],"date":"2004","doi":null,"raw":"Jones, C. &quot;Computing at CERN: The Mainframe Era,&quot; CERN Courier (44:7), 2004, pp. 32-35.","cites":null},{"id":17284291,"title":"Deep Structure or Emergence Theory: Contrasting Theoretical Foundations for Information Systems Development,&quot;","authors":[],"date":"1998","doi":"10.1046\/j.1365-2575.1998.00029.x","raw":"Truex,  D.P.,  and  Baskerville,  R.  &quot;Deep  Structure  or  Emergence  Theory:  Contrasting  Theoretical Foundations for Information Systems Development,&quot; Information Systems Journal (8), 1998, pp. 99-118.","cites":null},{"id":17284274,"title":"Dynamic Capabilities in Small Software Firms: A Sense-andresponse Approach,&quot;","authors":[],"date":"2007","doi":"10.1109\/tem.2007.900782","raw":"Mathiassen, L., and Vainio, A.M. &quot;Dynamic Capabilities in Small Software Firms: A Sense-andresponse Approach,&quot; IEEE Transaction of Engineering Management (54:3) 2007.","cites":null},{"id":17284214,"title":"Editorial: ‘Lots done, more to do’: the current state of agile systems development research.&quot;","authors":[],"date":"2009","doi":"10.1057\/ejis.2009.27","raw":"Abrahamsson, P., K. Conboy et al. &quot;Editorial: ‘Lots done, more to do’: the current state of agile systems development research.&quot; European Journal of Information Systems (18), 2009, pp. 281-284.","cites":null},{"id":17284296,"title":"Enactment Processes in Organisations,&quot;","authors":[],"date":"2001","doi":null,"raw":"Weick, K.E. &quot;Enactment Processes in Organisations,&quot; In Making Sense of the Organization, K. E. Weick (ed.) Blackwell, Malden, MA, 2001.","cites":null},{"id":17284283,"title":"Enterprise Agility and the Enabling Role of Information Technology,&quot;","authors":[],"date":"2006","doi":"10.1057\/palgrave.ejis.3000600","raw":"Overby,  E.,  Bharadwaj,  A.,  and  Sambamurthy,  V.  &quot;Enterprise  Agility  and  the  Enabling  Role  of Information Technology,&quot; European Journal of Information Systems (15:2) 2006.","cites":null},{"id":17284267,"title":"Epistemic Cultures: How the Sciences Make Knowledge,","authors":[],"date":"1999","doi":"10.2307\/2653984","raw":"Knorr-Cetina, K. Epistemic Cultures: How the Sciences Make Knowledge, Harvard University Press, Cambridge, MA, 1999.","cites":null},{"id":17284272,"title":"Exploring paradox: Toward a more comprehensive guide,&quot;","authors":[],"date":"2000","doi":"10.2307\/259204","raw":"Lewis,  M. &quot;Exploring  paradox: Toward  a  more  comprehensive  guide,&quot;  Academy  of  Management Review (25:1) 2000, pp. 760-776.","cites":null},{"id":17284258,"title":"Exploring the Empty Spaces of Organising: How Improvisational Jazz Helps Redescribe Organisational Structure,&quot;","authors":[],"date":"1999","doi":"10.1177\/0170840699201004","raw":"Hatch, M.J. &quot;Exploring the Empty Spaces of Organising: How Improvisational Jazz Helps Redescribe Organisational Structure,&quot; Organisation Studies (20:1), 1999, pp. 75-100.","cites":null},{"id":17284226,"title":"Extreme Programming Explained Addison-Wesley, Upper Sadle River,","authors":[],"date":"2005","doi":null,"raw":"Beck, K., and Andres, C. Extreme Programming Explained Addison-Wesley, Upper Sadle River, NJ, 2005.","cites":null},{"id":17284241,"title":"From Control to Drift: The Dynamics of Global Information Infrastructures,","authors":[],"date":"2000","doi":null,"raw":"Ciborra, C., Braa, K., Cordella, A., Dahlbom, B., Failla, A., Hanseth, O., Hepsø, V., Ljungberg, J., Monteiro, E., and Simon, K.A., From Control to Drift: The Dynamics of Global Information Infrastructures, Oxford University Press, 2000.","cites":null},{"id":17284254,"title":"Globally distributed software development and pair programming”,","authors":[],"date":"2006","doi":"10.1145\/1164394.1164421","raw":"Flor, N.V. “Globally distributed software development and pair programming”, Communication of ACM, 49(10), 2006 pp.57-58.","cites":null},{"id":17284224,"title":"High-speed software development practices: What works, what doesn’t.,&quot;","authors":[],"date":"2006","doi":"10.1109\/mitp.2006.86","raw":"Baskerville,  R.,  Ramesh,  B.,  Pries-Heje,  J.,  and  Levine,  L.  &quot;High-speed  software  development practices: What works, what doesn’t.,&quot; IEEE IT Professional (8) 2006, pp 29-36.","cites":null},{"id":17284301,"title":"Improvisation as a Mindset for Organisational Analysis,&quot;","authors":[],"date":"1998","doi":"10.1287\/orsc.9.5.543","raw":"Weick, K.E. &quot;Improvisation as a Mindset for Organisational Analysis,&quot; Organisation Science (9:5), 1998, pp. 543-555.","cites":null},{"id":17284247,"title":"Improvisation in Action,&quot;","authors":[],"date":"1998","doi":"10.1287\/orsc.9.5.593","raw":"Crossan, M.M. &quot;Improvisation in Action,&quot; Organisation Science (9:5), 1998, pp. 593-599.","cites":null},{"id":17284217,"title":"Improvisation in Information Systems Development,&quot;","authors":[],"date":"2004","doi":"10.1007\/1-4020-8095-6_34","raw":"Bansler,  J.P.,  and  Havn,  E.C.  &quot;Improvisation  in  Information  Systems  Development,&quot;  Information Systems  Research:  Relevant  Theory  and  Informed  Practice  (IFIP  8.2),  Kluwer  Academic Publishers, Manchester, UK, 2004, pp. 631-646.","cites":null},{"id":17284253,"title":"Improvisation in small software organisations,&quot;","authors":[],"date":"2000","doi":"10.1109\/52.877872","raw":"Dyba, T. &quot;Improvisation in small software organisations,&quot; IEEE Software (Sept\/Oct) 2000, pp 82-87.","cites":null},{"id":17284281,"title":"Improvising Organisational Transformation over Time: A Situated Change Perspective,&quot;","authors":[],"date":"1996","doi":"10.1287\/isre.7.1.63","raw":"Orlikowski,  W.  &quot;Improvising  Organisational  Transformation  over  Time:  A  Situated  Change Perspective,&quot; Information Systems Research (7:1), 1996, pp. 63-92.","cites":null},{"id":17284239,"title":"In the Mood for Knowledge: A new study of improvisation,&quot; in:","authors":[],"date":"2001","doi":null,"raw":"Ciborra,  C.U.  &quot;In  the  Mood  for Knowledge:  A  new  study  of improvisation,&quot; in:  Social  Study  of Information  Technology  Workshop  London  School  of  Economics  and  Political  Science, London, 2001.","cites":null},{"id":17284294,"title":"Introducing Pegasus: An Ethnographic Research Project Studying the Use of Grid Technologies by the UK Particle Physics Community,&quot;","authors":[],"date":"2006","doi":null,"raw":"Venters, W., and Cornford, T. &quot;Introducing Pegasus: An Ethnographic Research Project Studying the Use of Grid Technologies by the UK Particle Physics Community,&quot; Proceedings of the National e-Science Center Conference, Manchester, 2006.","cites":null},{"id":17284235,"title":"IT Artifacts, and High Reliability Organisations: A Case of Constructing a Radical Architecture”. Sprouts: Working Papers on Information Environments, Systems and Organisations,","authors":[],"date":"2004","doi":null,"raw":"Carlo,  J.L.,  Lyytinen,  K.  &  Boland,  R.J.,  “Systemic  Risk,  IT  Artifacts,  and  High  Reliability Organisations: A Case of Constructing a Radical Architecture”. Sprouts: Working Papers on Information Environments, Systems and Organisations, 4(2) 2004.","cites":null},{"id":17284271,"title":"J.A.“Ambidextrous coping strategies in globally distributed software development projects”.","authors":[],"date":"2006","doi":"10.1145\/1164394.1164417","raw":"Lee,  G.,  DeLone,  W.  &  Espinosa,  J.A.“Ambidextrous  coping  strategies  in  globally  distributed software development projects”. Communications of the ACM, 49(10), 2006, pp.35-40.","cites":null},{"id":17284306,"title":"Learning Immediate Historic Learned Improvisation environmental turbulence","authors":[],"date":"1998","doi":null,"raw":"Paradoxes of Learning Immediate  Historic Learned Improvisation environmental turbulence (Moorman and Miner, 1998, Ciborra, 1996) task uncertainty (Miner et al., 2001) task complexity (Hutchins, 1995, Weick and Roberts, 1993) organizational memory (Ackerman and Halverson, 1998; Moorman and Miner, 1998; Weick, 1998) Routines (Hutchins, 1995, Weick and Roberts, 1993) Practicing (Moorman and Miner, 1998; Weick, 1998) Spontaneity  Reflexivity Reflective Spontaneity convergence of planning and execution (Moorman and Miner, 1998) drop your tools (Weick, 1993a) trial and error, bricolage (Lanzara, 1999) retrospective sense-making (Weick, 1993b) ex-post interpretation (Lanzara, 1999) transient constructs (Lanzara, 1999) Paradoxes of Organizing Unfolding  Planning Planned Agility  “unfolding ontology” (Knorr-Cetina, 1999) “unfolding circumstances” (Ciborra, 1999) “the spontaneous” (Weick, 1998) drifting (Ciborra, et al., 2000), flow (Hatch, 1999) visions (Hatch, 1999, Mintzberg and McHugh, 1985, Hutchins, 1991, Weick, 1993b) plan to improvise (Miner et al., 2001) artful planning (Baskerville, 2006) a sense of urgency (Crossan, 1998, Hutchins, 1991, Mirvis, 1998) Practices  Structure Structured Chaos organized anarchy (Cohen et al., 1972) knowing in practice (Orlikowski, 2000) fractures, discoutinuities, inconsistencies (Lanzara, 1999) ambiguity (Hatch, 1999) minimal structure (Cunha et al., 1999) collateral structure (Cunha et al., 1999) aesthetic of imperfection (Weick, 1999) “experimental culture” (Cunha et al., 1999) pro-innovation culture (Miner, et al., 2001; Mirvis, 1998; Weick, 1998) Paradoxes of Belonging Individuals  Collectivity Collective Individuality individual skills (Brown and Duguid, 1991; Mirvis, 1998) creativity (Barrett, 1998; Hatch, 1999; Kamoche, et al., 2003) group cohesion (Hutchins, 1995; Weick and Roberts, 1993) facilitative leadership (Crossan, 1998) trust and kinship (Crossan, 1998, Weick, 1993a) fluid communication (Orlikowski, 1996, Miner et al., 2001) Anxiety anxiety (Cunha, et al., 1999; Mirvis, 1998) moods (Ciborra, 2001) emotionality (Hatch, 1999) sense of urgency (Crossan, 1998, Hutchins, 1991, Mirvis, 1998) Confidence individual skills (Brown and Duguid, 1991; Mirvis, 1998) aesthetic of imperfection (Weick, 1999) prideful wariness (LaPorte 1996) Anxious Confidence","cites":null},{"id":17284288,"title":"Managing strategic contradictions: A top management model for managing innovation streams,&quot; Organisation Science","authors":[],"date":"2005","doi":"10.1287\/orsc.1050.0134","raw":"Smith, W.K., and Tushman, M.L. &quot;Managing strategic contradictions: A top management model for managing innovation streams,&quot; Organisation Science (16:5) 2005.","cites":null},{"id":17284292,"title":"Networks of Innovation&quot;,","authors":[],"date":"2002","doi":"10.1093\/acprof:oso\/9780199269051.001.0001","raw":"Tuomi, I &quot;Networks of Innovation&quot;, Oxford University Press, Oxford, 2002.","cites":null},{"id":17284249,"title":"Organisational improvisation: What, when, how and why,&quot;","authors":[],"date":"1999","doi":"10.1111\/1468-2370.00017","raw":"Cunha, M.P.e., Cunha, J.V.d., and Kamoche, K. &quot;Organisational improvisation: What, when, how and why,&quot; International Journal of Management Reviews (1:3) 1999, pp 299-341.","cites":null},{"id":17284299,"title":"Organisational Redesign as Improvisation,&quot; In Organisational Change and Redesign: Ideas and Insights for Improving Performance,","authors":[],"date":"1993","doi":null,"raw":"Weick, K.E. &quot;Organisational Redesign as Improvisation,&quot; In Organisational Change and Redesign: Ideas and Insights for Improving Performance, G. P. Huber and W. H. Glick (eds.), Oxford University Press, New York, 1993b, pp. 346-379.","cites":null},{"id":17284227,"title":"Organisations: A dialectical view,&quot;","authors":[],"date":"1977","doi":null,"raw":"Benson, J.K. &quot;Organisations: A dialectical view,&quot; Administrative Science Quarterly (22) 1977.","cites":null},{"id":17284305,"title":"Organising and the Process of Sensemaking,&quot;","authors":[],"date":"1999","doi":"10.1287\/orsc.1050.0133","raw":"Weick,  K.  E.  Sutcliffe,  K.  M.  Obstfeld,  D.  &quot;Organising  and  the  Process  of  Sensemaking,&quot; Organisation Science (16:4), 1999, pp. 409-421 Williams, L., and Cockburn, A. &quot;Agile Software Development: It's About Feedback and Change,&quot; IEEE (June), 2003.","cites":null},{"id":17284260,"title":"Organising Work by Adaptation,&quot;","authors":[],"date":"1991","doi":null,"raw":"Hutchins, E. &quot;Organising Work by Adaptation,&quot; Organisation Science (2:1), 1991, pp. 14-39.","cites":null},{"id":17284264,"title":"Persistent problems and practices in information systems development,&quot;","authors":[],"date":"2007","doi":"10.1111\/j.1365-2575.2007.00222.x","raw":"Kautz, K., Madsen, S., and Nørbjerg, J. &quot;Persistent problems and practices in information systems development,&quot; Information Systems Journal (17) 2007, pp 217-239.","cites":null},{"id":17284252,"title":"Programming-in-the large versus programming-in-the-small&quot;.","authors":[],"date":"1975","doi":"10.1145\/800027.808431","raw":"DeRemer,  Frank  and  Kron,  Hans,  &quot;Programming-in-the  large  versus  programming-in-the-small&quot;. Proceedings  of  the  international  conference  on  Reliable  software:  114--121,  Los  Angeles, California: ACM, 1975.","cites":null},{"id":17284286,"title":"Scaling Agile Methods”.","authors":[],"date":"2003","doi":"10.1109\/ms.2003.1207448","raw":"Reifer, D.J., Maurer, F. and Erdogmus, H., “Scaling Agile Methods”. IEEE Software, July\/August 2003, pp. 12-14.","cites":null},{"id":17284287,"title":"Shaping Agility through Digital Options: Reconceptualizing the Role of","authors":[],"date":"2003","doi":null,"raw":"Sambamurthy,  V.,  Bharadwaj,  A.  and  Grover,  V.  “Shaping  Agility  through  Digital  Options: Reconceptualizing the Role of Information Technology in Contemporary Firms” MIS Quarterly (27), 2003, pp.237-263.","cites":null},{"id":17284219,"title":"Short Cycle Time Systems Development&quot;","authors":[],"date":"2004","doi":"10.1111\/j.1365-2575.2004.00171.x","raw":"Baskerville, R. and Pries-Heje, J. &quot;Short Cycle Time Systems Development&quot; Information Systems Journal (14:3), 2004, pp. 237-264.","cites":null},{"id":17284277,"title":"Strategy Formation in an Adhocracy,&quot;","authors":[],"date":"1985","doi":"10.2307\/2393104","raw":"Mintzberg,  H.,  and  McHugh,  A.  &quot;Strategy  Formation  in  an  Adhocracy,&quot;  Administrative  Science Quarterly (30), 1985, pp. 160-197.","cites":null},{"id":17284251,"title":"Structured Analysis and Systems Specification Yourdon - Prentice-Hall Software,","authors":[],"date":"1978","doi":null,"raw":"DeMarco, T. Structured Analysis and Systems Specification Yourdon - Prentice-Hall Software, New York, 1978.","cites":null},{"id":17284237,"title":"Surface of Emergence in Systems Development,&quot;","authors":[],"date":"2005","doi":"10.1057\/palgrave.ejis.3000519","raw":"Chae, B., and Poole, M.S. &quot;Surface of Emergence in Systems Development,&quot; European Journal of Information Systems (14) 2005, pp 19-36.","cites":null},{"id":17284225,"title":"Systems without method: the impact of new technologies on information systems projects,&quot; in: The impact of computer supported technologies on information systems","authors":[],"date":"1992","doi":null,"raw":"Baskerville, R., Travis, J., and Truex, D. &quot;Systems without method: the impact of new technologies on information  systems  projects,&quot;  in:  The  impact  of  computer  supported  technologies  on information systems development, K.E. Kendall, K. Lyytinen and J.I. DeGross (eds.), NorthHolland,, Amsterdam, 1992, pp. 241-269.","cites":null},{"id":17284302,"title":"The Aesthetic of Imperfection in Orchestras and Organisations,&quot; in:","authors":[],"date":"1999","doi":null,"raw":"Weick,  K.E.  &quot;The  Aesthetic  of  Imperfection  in  Orchestras  and  Organisations,&quot;  in:  Readings  in Organisation Science, M.P. Cunha and C.A. Marques (eds.), ISPA., Lisbon, 1999.","cites":null},{"id":17284256,"title":"The Agile Manifesto,&quot; Software Development","authors":[],"date":"2001","doi":null,"raw":"Fowler, M., and Highsmith, J. &quot;The Agile Manifesto,&quot; Software Development (August), 2001.","cites":null},{"id":17284255,"title":"The Anatomy of the Grid: Enabling Scalable Virtual Organisations,&quot;","authors":[],"date":"2001","doi":"10.1109\/ccgrid.2001.923162","raw":"Foster,  I.,  et  al.  &quot;The  Anatomy  of  the  Grid:  Enabling  Scalable  Virtual  Organisations,&quot;  The International Journal of High Performance Computing Applications (15:3), 2001, pp. 200-222.","cites":null},{"id":17284298,"title":"The Collapse of Sensemaking in Organisations: The Mann Gulch Disaster,&quot;","authors":[],"date":"1993","doi":"10.2307\/2393339","raw":"Weick,  K.E.  &quot;The  Collapse  of  Sensemaking  in  Organisations:  The  Mann  Gulch  Disaster,&quot; Administrative Science Quarterly (38), 1993a, pp. 628-652.","cites":null},{"id":17284257,"title":"The Constitution of Society: Outline of the Theory of Structuration,","authors":[],"date":"1984","doi":"10.1086\/228358","raw":"Giddens,  A.  The  Constitution  of  Society:  Outline  of  the  Theory  of  Structuration,  Polity  Press, Cambridge, 1984.","cites":null},{"id":17284279,"title":"The Convergence of Planning and Execution: Improvisation in New Product Development,&quot;","authors":[],"date":"1998","doi":"10.2307\/1251740","raw":"Moorman, C., and Miner, A.S. &quot;The Convergence of Planning and Execution: Improvisation in New Product Development,&quot; Journal of Marketing (62:3), 1998, pp. 1-20.","cites":null},{"id":17284280,"title":"The Fiction of Methodological Development: a Field Study of Information Systems Development,&quot;","authors":[],"date":"1999","doi":"10.1108\/09593849910267224","raw":"Nandhakumar, J., and Avison, D.E. &quot;The Fiction of Methodological Development: a Field Study of Information Systems Development,&quot; Information Technology & People (12:2) 1999, pp.176-191.","cites":null},{"id":17284293,"title":"The Future of Open Source&quot;.","authors":[],"date":"2005","doi":"10.5210\/fm.v0i0.1471","raw":"Tuomi, I &quot;The Future of Open Source&quot;. In Wynants, M. and Cornelis, J (eds) &quot;How Open is the Future?&quot;, VUB Brussels University Press, Brussels, pp. 429-459, 2005.","cites":null},{"id":17284248,"title":"The Improvising Organization: Where Planning Meets Opportunity,&quot;","authors":[],"date":"1996","doi":"10.1016\/s0090-2616(96)90011-x","raw":"Crossan, M.M., H.W. Lane, R.E. White, L. Klus &quot;The Improvising Organization: Where Planning Meets Opportunity,&quot; Organisation Dynamics (24:4), 1996, pp. 20-35.","cites":null},{"id":17284240,"title":"The Labyrinths of Information,","authors":[],"date":"2002","doi":"10.1093\/acprof:oso\/9780199275267.001.0001","raw":"Ciborra, C. The Labyrinths of Information, Oxford University Press, 2002.","cites":null},{"id":17284285,"title":"The Mangle of Practice: Time, Agency and Science,","authors":[],"date":"1989","doi":"10.7208\/chicago\/9780226668253.001.0001","raw":"Pickering, A. The Mangle of Practice: Time, Agency and Science, University Of Chicago Press,1995 Poole, M.S., and Van de Ven, A.H. &quot;Using Paradox to Build Management and Organisation Theories,&quot; The Academy of Management Review (14:4), 1989, pp. 562-578.","cites":null},{"id":17284233,"title":"The Mythical Man-Month,","authors":[],"date":"1979","doi":"10.1145\/800027.808439","raw":"Brooks, F. The Mythical Man-Month, Addison-Wesley, New York. DeRemer, Frank; 1979 Brown, J.S. and Duguid, P. &quot;Organisational Learning and Communities-of-Practice: Toward a Unified View  of  Working,  Learning,  and  Innovation,&quot;  Organisation  Science,  Special  Issue: Organisational Learning: Papers in Honor of (and by) James G., (2: 1), 1991, pp. 40-57.","cites":null},{"id":17284236,"title":"The Paradoxes of Knowledge Management: An Eastern Philosophical Perspective,&quot;","authors":[],"date":"2006","doi":"10.1016\/j.infoandorg.2005.06.003","raw":"Chae, B., and Bloodgood, J.M. &quot;The Paradoxes of Knowledge Management: An Eastern Philosophical Perspective,&quot; Information and Organisation (16) 2006, pp 1-26.","cites":null},{"id":17284295,"title":"The Resource Based View and Information Systems Research: Review, Extension and Suggestions for Future Research&quot;.","authors":[],"date":"2004","doi":null,"raw":"Wade, M., and Hulland, J. &quot;The Resource Based View and Information Systems Research: Review, Extension and Suggestions for Future Research&quot;. MIS Quarterly, (28:1), 2004, pp. 107-138.","cites":null},{"id":17284276,"title":"The structuring of organisations,&quot; in: The Strategy Process: European Edition,","authors":[],"date":"1995","doi":null,"raw":"Mintzberg,  H. &quot;The structuring  of  organisations,&quot; in: The  Strategy  Process:  European  Edition,  H. Mintzberg, J.B. Quinn and S. Ghoshal (eds.), Prentice Hall Europe, Hertfordshire, 1995, pp. 350-371.","cites":null},{"id":17284228,"title":"Thinking In Jazz: The Infinite Art of Improvisation,","authors":[],"date":"1994","doi":"10.7208\/chicago\/9780226044521.001.0001","raw":"Berliner, P.F., Thinking In Jazz: The Infinite Art of Improvisation, the University of Chicago Press, 1994.","cites":null},{"id":17284245,"title":"Toward a Conceptual Framework of Agile Methods: A Study of Agility in Different Disciplines,&quot;","authors":[],"date":"2004","doi":"10.1145\/1029997.1030005","raw":"Conboy, K., and Fitzgerald, B. &quot;Toward a Conceptual Framework of Agile Methods: A Study of Agility in Different Disciplines,&quot; Proceedings of the WISER'04, Newport Beach, California, 2004.","cites":null},{"id":17284263,"title":"Towards a Theory of Organisational Improvisation: Looking Beyond the Jazz Metaphor,&quot;","authors":[],"date":"2003","doi":"10.1046\/j.1467-6486.2003.00410.x","raw":"Kamoche,  K.,  Cunha,  M.P.E.,  and  Vieira  da  Cunha,  J.  &quot;Towards  a  Theory  of  Organisational Improvisation: Looking Beyond the Jazz Metaphor,&quot; Journal of Management Studies (40) 2003, pp. 2023-2051.","cites":null},{"id":17284282,"title":"Using Technology and Constituting Structures: A Practice Lens for Studying Technology in Organisations,&quot;","authors":[],"date":"2000","doi":"10.1287\/orsc.11.4.404.14600","raw":"Orlikowski,  W.J.  &quot;Using  Technology  and  Constituting  Structures:  A  Practice  Lens  for  Studying Technology in Organisations,&quot; Organisation Science (11:4), 2000, pp. 404-428.","cites":null},{"id":17284278,"title":"Variations on a Theme: Practice Improvisation,&quot;","authors":[],"date":"1998","doi":"10.1287\/orsc.9.5.586","raw":"Mirvis, P.H. &quot;Variations on a Theme: Practice Improvisation,&quot; Organisation Science (9:5), 1998, pp. 586-592.","cites":null},{"id":17284229,"title":"Weaving the Web,","authors":[],"date":"1997","doi":null,"raw":"Berners-Lee, T., and Fischetti, M. Weaving the Web, Harper, San Francisco, CA, 1997.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2011-07","abstract":"This paper examines systems development in a global collaborative community of high-energy physics and offers insights and implications for agile systems development in other large scale and distributed settings. The paper studies the ongoing construction of the UK's computing grid for particle physics (GridPP), a grid that is itself part of the world's largest grid, the Large Hadron Collider Computing Grid. We observe in this project a collective, agile and distributed performance through which the Grid is constructed. We express this through the concept of ‘collective agility’ which captures a large distributed performance rather than the more conventional sense of agility as small-group and deliberate systems development practices. The collective agility of GridPP is analysed as a process of ‘enacted emergence’ expressed through the dynamics of six improvisation paradoxes","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/96366.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/30029\/1\/Collective_agility_%28LSERO%29.pdf","pdfHashValue":"6027ce9419d1b9076d5d6e00d8bf4ff9c7cccf8e","publisher":"Wiley-Blackwell","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:30029<\/identifier><datestamp>\n      2012-06-06T16:55:44Z<\/datestamp><setSpec>\n      74797065733D43454E54524553:4C53455F52435F496E666F5F537973<\/setSpec><setSpec>\n      74797065733D4445505453:4C53452D4D414E<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/30029\/<\/dc:relation><dc:title>\n        Collective agility, paradox and organizational improvisation: the development of a particle physics grid<\/dc:title><dc:creator>\n        Zheng, Yingqin<\/dc:creator><dc:creator>\n        Venters, Will<\/dc:creator><dc:creator>\n        Cornford, Tony<\/dc:creator><dc:subject>\n        H Social Sciences (General)<\/dc:subject><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        This paper examines systems development in a global collaborative community of high-energy physics and offers insights and implications for agile systems development in other large scale and distributed settings. The paper studies the ongoing construction of the UK's computing grid for particle physics (GridPP), a grid that is itself part of the world's largest grid, the Large Hadron Collider Computing Grid. We observe in this project a collective, agile and distributed performance through which the Grid is constructed. We express this through the concept of ‘collective agility’ which captures a large distributed performance rather than the more conventional sense of agility as small-group and deliberate systems development practices. The collective agility of GridPP is analysed as a process of ‘enacted emergence’ expressed through the dynamics of six improvisation paradoxes.<\/dc:description><dc:publisher>\n        Wiley-Blackwell<\/dc:publisher><dc:date>\n        2011-07<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/30029\/1\/Collective_agility_%28LSERO%29.pdf<\/dc:identifier><dc:identifier>\n          Zheng, Yingqin and Venters, Will and Cornford, Tony  (2011) Collective agility, paradox and organizational improvisation: the development of a particle physics grid.  Information Systems Journal, 21 (4).  pp. 303-333.  ISSN 1350-1917     <\/dc:identifier><dc:relation>\n        http:\/\/onlinelibrary.wiley.com\/journal\/10.1111\/(ISSN)1365-2575<\/dc:relation><dc:relation>\n        10.1111\/j.1365-2575.2010.00360.x<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/30029\/","http:\/\/onlinelibrary.wiley.com\/journal\/10.1111\/(ISSN)1365-2575","10.1111\/j.1365-2575.2010.00360.x"],"year":2011,"topics":["H Social Sciences (General)","QC Physics"],"subject":["Article","PeerReviewed"],"fullText":"  \nYingqin Zheng, Will Venters, Tony Cornford\nCollective agility, paradox and \norganizational improvisation: the \ndevelopment of a particle physics grid \n \nArticle (Accepted version) \n(Refereed) \nOriginal citation: \nZheng, Yingqin and Venters, Will and Cornford, Tony (2011) Collective agility, paradox and \norganizational improvisation: the development of a particle physics grid. Information systems \njournal. \n \nDOI: 10.1111\/j.1365-2575.2010.00360.x\n \n© 2011 Wiley\n \nThis version available at: http:\/\/eprints.lse.ac.uk\/30029\/\n \nAvailable in LSE Research Online: November 2010 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, \nincorporating any revisions agreed during the peer review process.  Some differences between \nthis version and the published version may remain.  You are advised to consult the publisher’s \nversion if you wish to cite from it. \n  1 \nCOLLECTIVE AGILITY, PARADOX AND ORGANISATIONAL IMPROVISATION: \nTHE DEVELOPMENT OF A PARTICLE PHYSICS GRID \n \nYingqin Zheng, De Montfort University, yzheng@dmu.ac.uk \nWill Venters, London School of Economics, w.venters@lse.ac.uk \nTony Cornford, London School of Economics, t.cornford@lse.ac.uk \n \nAbstract \nThis paper examines systems development in a global collaborative community of high energy physics \nand offers insights and implications for agile systems development in other large scale and distributed \nsettings. The paper studies the ongoing construction of the UK’s computing grid for particle physics \n(GridPP), a grid that is itself part of the world’s largest grid, the Large Hadron Collider Computing \nGrid (LHC). We observe in this project a collective, agile and distributed performance through which \nthe Grid is constructed. We express this through the concept of “collective agility” which captures a \nlarge distributed performance rather than the more conventional sense of agility as small-group and \ndeliberate systems development practices. The collective agility of GridPP is analysed as a process of \n“enacted emergence” expressed through the dynamics of six improvisation-paradoxes.  \nKey words: collective agility, improvisation, paradox, grid computing, particle physics  \n \n \n  2 \n \n1. Introduction \nMuch recent innovation in systems development has sought to legitimise a more fluid, exploratory and \nresponsive style (Baskerville and Pries-Heje, 2004; Baskerville et al., 2006; Baskerville et al., 1992; \nFowler and Highsmith, 2001; Truex et al., 2000). These moves away from traditional formalism in \nsystems development methodologies (e.g. Boehm 1988; DeMarco 1978) echo the long-standing \nobservation from the field that traditional methodologies are neither effectively nor extensively used \n(Avgerou and Cornford, 1993, Bansler and Bodker, 1993), but often “faked” (Parnas and Clements, \n1986) and used as a “fiction” to help create a sense of coherence in day-to-day activities \n(Nandhakumar and Avison, 1999). Such observations have caused some to rethink the status of \nmethod and methodology in systems development. Ciborra (2002), for example, asks us to “suspend \nthe belief that behind the messy everyday reality there is a geometric universe”. Similarly, Truex and \nassociates argue that “amethodical” development (Truex et al., 2000) can better appreciate and support \ninnovation and organisational change, adaptation and experimentation, as well as exploiting new \nopportunities and accidents. If we understand organisational landscapes to be emergent or enacted \n(Weick, 2001, Weick, 1993b), and that technology is created ‘in-practice’ (Orlikowski, 2000), it \nmakes sense to argue that the way we develop information systems should support a strong contextual \ncontingency and allow for improvisational action and bricolage (Bansler and Havn, 2004).  \nAgile Systems Development \nMany contemporary systems development practices are oriented towards speed, responsiveness and \nflexibility. These practices have been given names such as “high speed software development” \n(Baskerville et al., 2006), “short-cycle time systems development” (Baskerville and Pries-Heje, 2004), \n“web-based system development” (Kautz et al., 2007), and most influentially, agile systems \ndevelopment (Conboy and Fitzgerald, 2004; Fowler and Highsmith, 2001; Highsmith, 2002). Agile \ndevelopment has established a large research literature in the past few years, and an extensive \nfollowing within the practitioner community, based on principles characterised by quickness, lightness \nand nimbleness (Highsmith, 2002) and on values such as collaboration, communication, simplicity and \ncourage (Beck and Andres, 2005). The practitioner literature includes many versions such as rapid \nprototyping or quick releases, placing emphasis from predefined procedures, specification and \nsystematic methods (Beck and Andres, 2005; Highsmith, 2002; Williams and Cockburn, 2003). But \nmost studies of agile development still focus on micro behaviour and related processes in designing \nand delivering software, and less attention is paid to organisational cultures, institutional conditions \nand environmental constraints (Abrahamsson et al., 2009). This is surprising since, from the days of \nBrooks’ classic ‘The Mythical Man Month’ (1979) and DeRamer and Kron’s (1975) concept of \n‘programming in the large’, it has been acknowledged that systems are developed within an \n  3 \norganisational environment, which is as significant in shaping the character of the project and its \noutcomes as any particular practices. There is thus a need to develop a better understanding of the \nimplementation of agility at the organisational level (Abrahamsson et al., 2009) acknowledging \nexplicit linkages to institutional and cultural settings. \nLarge-scale systems development projects in particular are known to face many challenges as they \nspan institutional and cultural settings. Curtis et al. (1988) suggest that the three most salient and \ninterrelated problems they face are: thin spread of application domain knowledge; fluctuating and \nconflicting requirements and; communication and coordination breakdowns. To adopt a style of agile \nsystems development in such settings entails particular difficulties (Reifer et al., 2003), including \ncommunication, lack of control and lack of trust (Ramesh et al., 2006). The strategies proposed to \n‘scale-up’ agile development include developing collaboration tools (Flor, 2006), aligning IT \ncomponents (Lee et al., 2006), and managing carefully the balance between flexibility and rigour (Lee, \nDeLone and Espinosa, 2006). Yet few attempts have been made to directly theorise agility and \ndistributed organisational dynamics.  \nThe LCG Project \nIn this paper we study an emergent form of agile practice within a specific and distinctive large scale \nand distributed organisational context – the Large Hadron Collider Computing Grid (LCG) - one of \nthe world’s largest computing grids. This started development in 2001 and was formally put into use \nin 2010. The organisational context of the LCG, reflecting that of particle physics (Knorr-Cetina, \n1999; Traweek, 1988), is highly distributed with 170 computing centres in 34 countries. Mobilising to \nbuild this Grid was a grand systems development challenge in technical, organisational, political and \nhuman terms; an example of large scale system development on a global basis and one which, as we \nwill argue, seemed to exhibit a quality of agility. Thus we observed fluid practices that serve as a \ncontinuous response to external and internal changes, and continual acts of trial and error matched \nwith pragmatic problem-solving approaches. Bricolage and ad hoc activities dominate the day-to-day \nand there is minimal, though vital, use of formal methodologies and centralised control. The people \ninvolved, mostly physicists or physicist-programmers, take pride not in methodological rigour but in \ntheir pragmatic approach to “make it work”. As a large distributed project, LCG has faced challenges \nas mentioned above, and yet their response has not been to employ rationalistic approaches or \nconstraining tool-sets as most of the authors above propose, but rather to respond by maintaining their \ncommitment to a flexible and fluid approach – to agility.  \nThe Concept of Agility \nThe literature on agility reflects two common approaches. The first sees agility as empirically \nvalidated small group methods and practices. The second sees agility as an organisational capability \n  4 \n(Sambamurthy et al. 2003; Lee et al., 2006; Mathiassen and Pries-Heje, 2006), for example, a firms’ \nsense-and-respond capabilities, or dynamic capabilities (Williams and Cockburn 2003), or the \norganisational capability to learn, to explore and to exploit knowledge (Mathiassen and Vainio, 2007; \nOverby et al., 2006). We develop a third and distinct perspective, what we call collective agility seen \nas a “structuring property” (Giddens, 1984) of a collective, instantiated in improvisational behaviour \nof individuals and groups and in their social interactions. In other words, collective agility is an \nattribute emergent from the day-to-day practices of social actors. We thus explore agility as a \nperformance (Ciborra, 1999; Dyba, 2000). \nIt is important to make clear the ontological distinction implied by a focus on capability or \nperformance: capability refers to the potential for achievement that an organisation has as it draws \nupon its resources, human, institutional and material, a concept linked to the resource based view of \nthe firm and core competencies (Wade and Hulland, 2004). In contrast, a performance is an enactment \nwithin a context that can create, apply and sustain capabilities. Put another way, capabilities are not \nunderstood here as something held prior to a performance, rather they are the medium and outcome of \nit. The performative ontology (Pickering, 1995) adopted here sees agility as what social actors do \nwhen engaging with uncertainty and complexity, and as sustained by collective agency over time and \nspace. Our focus is not a description of agile behaviour or its precursors but on the performance of \ncollective agility that embodies the LCG project. The emphasis is on agility’s emergence from \ndisparate practices embedded in the organisational and cultural context. In simpler terms, it is not just \nthat agile system development can be sustained in particular supportive organisational or cultural \ncontexts, but that a context or culture may itself demand (at times) and create a certain type of agile \nperformance.  \nOrganisational Improvisation and Paradoxes \nTo unpack the complexities of collective agility as an organisational performance, we draw upon the \nliterature of organisational improvisation (Cunha et al., 1999; Weick, 1998) with a focus on collective, \ncollaborative and coordinated improvisational activity. Improvisation is essentially an individual or \nsmall group practice, immediate and situated, whereas the agility we study is that which emerges from \na collective performance - an organisational improvisation. This literature is reviewed and organised \nfrom the perspective of paradox (Mirvis 1998). It has been frequently noted that innovations such as \nshort cycle time development or agile methods involve tensions and paradoxical elements, for \nexample, learning to “plan not to plan” (Baskerville, 2006) or to achieve a “disciplined messiness” \n(Highsmith, 2002) and Baskerville’s (2006) calls for a rejection of polar distinctions between concepts \nlike planning and serendipity, or discipline and creativity. The concept of paradox is not intended to \nsuggest logical impossibility or irresolvable conflict; rather paradox provides a means of presenting \nand analysing productive tensions, dynamics, and motivating challenges of systems development. In \nconstructing a set of improvisation-paradoxes and applying them in the analysis, we reveal the \n  5 \nembracing and balancing of such paradoxical elements as a key to understanding agility within \ndistributed collaborative system development.  \nIn summary, this paper introduces collective agility, a concept developed from a paradoxical \nperspective, to describe a particular genre of organisational performance. The rest of the paper is \norganised as follows. Section 2 further develops the conceptual constructs, i.e. the improvisation-\nparadoxes, from the literature of organisational improvisation. Research methodology and case \ndescription can be found in Sections 3 and 4. Section 5 presents an in-depth analysis of the case using \nthe improvisation-paradoxes, extended to discussions and implications in Section 6. Section 7 \nconcludes the article. \n2. Improvisation Paradoxes and Enacted Emergence \nExisting research on organisational improvisation mostly considers it as a creative group performance \nwith little formal planning and minimal central control, like a jazz performance (Barrett, 1998, Hatch, \n1999) or improvisational theatre (Crossan, 1998). Cunha et al (1999) define improvisation as “the \nconception of action as it unfolds, by an organisation and\/or its members, drawing on available \nmaterial, cognitive, affective and social resources”. This definition emphasises two aspects. First, the \nconvergence in time of conception and execution (Moorman and Miner, 1998), or “real-time \nplanning” (Miner et al., 2001). This resonates strongly with the basic notion of agility as quickness, \nlightness, and nimbleness (Highsmith, 2002). Second, bricolage – the aspect of finding solutions from \navailable rather than optimal resources – which is often implied or used interchangeably with \nimprovisation (Weick 1993a, 1993b, Ciborra, 2002).  \nWithin the field of information systems, ideas of improvisation and bricolage have often been used to \ncritique the dominant ontology of planning and control and the pervasive normative tendencies that \nfollow (Ciborra, 1999, 2002, Lanzara, 1999, Orlikowski, 1996). Organisational improvisation \nliterature does not deny or negate the value of such concepts, but suggests that it is in the tension and \ninteraction between these and their opposites: structure and change, order and chaos, control and \nfreedom, that creative attitudes, innovative outcomes, and productive practices may be found. The \nperformative view of agility adopted here reveals the “tensions and oppositions between well-founded, \nwell-reasoned, and well-supported alternative explanations of the same phenomenon” (Poole and Van \nde Ven, 1989). Thus we draw on the established tradition of paradox as a dialectical device to examine \ncomplex situations and to build theory (Lewis, 2000; Poole and Van-de-Ven, 1989; Smith and \nTushman, 2005). Lewis (2000) describes three categories of paradoxes prevalent in organisational \nstudies – learning (old\/new), organising (control\/flexibility), and belonging (self\/other). We use these \nthree categories to synthesise the literature on organisational improvisation and propose a set of \nimprovisation-paradoxes. Table 1 presents the six constructed improvisation-paradoxes with examples \nof the concepts they are based on. These concepts are highlighted in italic in the following elaboration \n  6 \nof the improvisation-paradoxes. \n[Insert Table 1 about here] \nParadoxes of Learning \nParadoxes of learning arise from the tension between old and new, “the struggle between the comfort \nof the past and the uncertainty of the future”, which are fundamental to processes of innovation, \ntransformation and sensemaking (Lewis, 2000). On this basis, we identify two pairs of paradoxes of \nlearning: Learned Improvisation, i.e. improvisation drawing on past experience and situated within \nenvironmental constraints; and Reflective Spontaneity, making sense by ex-post interpretation and \nrationalisation.  \n- Learned Improvisation: This paradox is related to the tension between the immediate (the here-\nand-now environment and context) and the historic (the understood, interpreted, documented and \nremembered past). “Learning requires using, critiquing, and often destroying past understandings and \npractices to construct new and more complicated frames of references” (Lewis, 2000). For example, \njazz musicians recall music that has been performed and learn from it (Berliner, 1994). Improvisation \nis often a response to task uncertainty, and environmental turbulence (Moorman and Miner, 1998). \nUnexpected and “unplanned-for” (Miner et al., 2001) occurrences or tasks can arise inside the \ncollective too (Cunha et al., 1999), for example, when task complexity seems to be beyond the scope \nof rational planning, accumulated knowledge or predetermined method (Hutchins, 1995). \nOrganisational improvisation can also be linked to deliberate innovation – for example, visions which \narticulate a gap between reality and possibility can induce actions which are partly planned yet \nsignificantly emergent (Mintzberg and McHugh, 1985) and improvised (Crossan et al., 1996).  \nTo cope with uncertainties and complexities of the environment, context or task, people need to draw \nupon a repertoire of organisational memories, “learned ways of thinking and behaving” (Moorman \nand Miner, 1998). The paradox of Learned Improvisation thus also reflects the tension between the \nreliance on “habits of thought” and routines (Hutchins, 1995, Weick and Roberts, 1993) and a will to \ndepart from organisational traditions and norms (Cunha et al., 1999) – to drop your tools (Weick, \n1993a). This balance is intricate, as successful improvisations are often based on accumulated \nknowledge and experience from extensive practicing in the past (Moorman and Miner, 1998). The \nconstruct of “history” here is also related to collective understanding and organisational culture, e.g. in \nour case, the experimental culture of particle physics. \n- Reflective Spontaneity: “Reflective spontaneity” is a paradox expressing ad hoc experimentation \n(spontaneity) and post hoc recovering of rationalisation by the collective, Weick’s retrospective \nsensemaking (Weick, 1993a). Improvisers often have no choice but to engage with the situation with \nno time for thorough reflection, and the significance of the action is often only (re)discovered after the \n  7 \nevent. As Weick (1998) suggests, “to improve memory is to gain retrospective access to a greater \nrange of resources”. Retrospective sensemaking (Weick, 1993a) can thus provide order, purpose, and \ncoherence (Barrett, 1998) to practices of trial-and-error or bricolage (Lanzara, 1999). Meaning can \narise from ex-post interpretation and sensemaking by a number of dispersed agents, rather than from \nex ante planning and implementation by a central designer (ibid.). Such sensemaking can be facilitated \nby transient constructs (ibid), such as “makeshift artefacts, recombinant routines … ephemeral \norganisations, disposable symbols, fugitive meanings” than can sustain some continuity and stability. \nMilestones and deadlines, for example, may serve these purposes. Thus, at the macro-level, an \nunfolding improvisational performance and the reflections on it, give rise to an emergent order (Miner \net al., 2001) which in turn can be drawn upon by others (Orlikowski, 2000).  \nParadoxes of Organising \nParadoxes of organising reflect tensions between control and flexibility (Lewis, 2000), formal and \ninformal, integration and differentiation (Chae and Bloodgood, 2006), denoting “an ongoing process \nof equilibrating opposing forces that encourage commitment, trust, and creativity while maintaining \nefficiency, discipline, and order” (Lewis, 2000). Two paradoxes from the literature are summarised \nhere as Planned Agility and Structured Chaos. The former underlines the tension between the \ndeliberate action of planning and the uncontrolled processes of drifting and unfolding; the latter refers \nto the tension between chaotic day-to-day practices and minimal structures. \n- Planned Agility: As Weick (1998) puts it, “improvisation is a mixture of the pre-composed and the \nspontaneous”. Miner et al. (2001) suggests that organisations can plan to improvise and routinise \nprocesses to stimulate improvisation, without the actual content of the improvisation being planned in \nadvance. This is related to what Baskerville (2006) refers to as artful planning. Degrees of planning \nfor improvisation encompasses two aspects; clearly articulated goals (Barrett, 1998; Crossan et al., \n1996; Orlikowski, 1996), and milestones and action deadlines (Cunha et al., 1999). Clearly articulated \ngoals can provide a sense of direction and shared vision, often operating via culture or ideology \n(Mintzberg, 1995; Weick, 1993b), and serve as a ‘magnetic field’ which, without prescribing \nindividual action, is strongly normative in shaping such action (Cunha et al., 1999). Short-term \nmilestones and deadlines build a sense of momentum and urgency (e.g. Crossan, 1998; Hutchins, \n1991; Mirvis, 1998) and sustain a “state of flow” (Hatch, 1999). They provide opportunities to keep \ntrack of the variations between dispersed innovative actions and priorities within the collective goal. In \nother words, even though day-to-day practices may be unplanned, ad hoc, and drifting (Ciborra et al., \n2000), minimal strategic planning and management can ensure that this is oriented towards the goal.  \n- Structured Chaos: Organisational improvisation might be seen as a form of “organised anarchy” \ncharacterised by problematic preferences, unclear technology, and fractured participation (Hutchins, \n1991, Cohen et al., 1972). Cunha et al (1999) suggest “minimal structure” to express the controls \n  8 \ndesired to achieve improvisations that progress (Crossan, 1998; Orlikowski, 1996; Weick, 1998). \nMinimal structure refers to a shared sense of rules, norms and identity among members of a \ncommunity of practice (Brown and Duguid, 1991), and which can be drawn upon by members to \nmediate their knowing-in-practice (Orlikowski, 2000), yet allow them to depart from canonical \npractices and initiate changes. A collateral structure provides non-intrusive support to learning \ncommunities allowing space for fluid and interpretative practices to take place across boundaries of \ngroups (Cunha et al., 1999).  \nMinimal and collateral structures allow the cultivation of an experimental culture (Cunha et al., 1999) \nor pro-innovation culture (Miner et al., 2001; Mirvis, 1998; Weick, 1998), which nurture individuality \nthrough features such as tolerance to error (Barrett, 1998; Crossan, 1998; Hatch, 1999). Weick \nproposes an “aesthetic of imperfection” as an important condition for improvisation, based on an \n“estimate of the degree of organisation and form that could have been extracted retrospectively from \nthe materials at hand, given that they were generated by a fallible human being acting publicly under \ntime pressure, with fallible tools” (1999). Lanzara (1999) similarly talks of fractures, discontinuities, \ninconsistencies, deviations from current routines and puzzling or random behaviours in innovative \nprocesses. Yet imperfection and murkiness can embody evolutionary opportunities for novel practices \nand forms, and lead to further productive combinations and transformations.  \nParadoxes of Belonging \nParadoxes of belonging emerge “because actors strive for both self-expression and collective \naffiliation” (Lewis, 2000). This tension is particularly distinctive in improvisational activity, because \nby nature members of an improvisational collective tend to be self-driven, intelligent and creative \npeople, yet they also have an acute appreciation that success relies on collaborative effort. It is through \ntrust and mutual support that they acquire confidence and strength in face of pressure and challenges. \nWe adopt under this category Mirvis’ (1998) Collective Individuality and Anxious Confidence, \nenriching them by linking them to organisational improvisation literature and theory. \n- Collective individuality: Creativity and individual skills (Barrett, 1998; Hatch, 1999; Kamoche et \nal., 2003) may be encouraged and supported, but individual freedom is inevitably bound by a level of \ngroup cohesion in order to achieve a collective goal, especially when task complexity is beyond the \ncognitive capacity of any individual (Hutchins, 1995; Weick and Roberts, 1993). As Weick (1998) \nputs it, “discussions of improvisation in groups are built on images of call and response, give and take, \ntransitions, exchange, complementing, negotiating a shared sense of the beat, offering harmonic \npossibilities to someone else, preserving continuity of mood, and cross-fertilisation”. Facilitative \nleadership (Barrett, 1998; Crossan, 1998), trust (Crossan, 1998; Weick, 1993a), and fluid \ncommunication (Miner et al., 2001; Orlikowski, 1996) nurture group performance. Such emotional ties \ndo not have to stem from self-disclosed intimacy but from shared actions, “hanging out” and a sense of \n  9 \nmembership in the collective (Barrett, 1998).  \n- Anxious confidence: Emotional ties also serve to provide a “safety-net” for members of a collective \nto cope with anxiety, or to deal with the affective element in their performance (Cunha et al., 1999). \nCiborra (2001) considers improvisation itself as a mood and contrasts it with conventional moods of \nthe systems development context such as panic or boredom, both of which fog vision and conceal \npossibilities for action. Mirvis (1998) suggests “anxious confidence” as the means to live with the \nambiguity, complexity, and challenges of working in an improvisational collective. Similarly, LaPorte \n(1996) (cited by Weick et al., 1999) speaks of ‘prideful wariness’ when discussing air traffic \ncontrollers. While Mirvis focuses mostly on individual capability and confidence, confidence is not \nonly experienced through individual knowledge and skills (Hutchins, 1991; Moorman and Miner, \n1998; Orlikowski, 1996) but also in aspects of organisational cultures, such as a history of innovation \nand “aesthetics of imperfection” (Weick, 1999), which can be drawn upon as “learned ways of \nthinking and behaving” (Moorman and Miner, 1998). \nParadoxes and Enacted Emergence \nThe improvisation paradoxes explored above embody a sense of tensions found in an agile \nperformance, particularly in a distributed context. To capture the dynamic duality we adopt two of \nPoole and Van de Ven’s (1989) four modes of working with paradoxes – to first accept the paradox \nand use them constructively, and then introduce a new term or concept to resolve the paradox. In this \nspirit we propose the term “enacted emergence” to portray a paradoxical and agile performance that is \nboth constructive and emergent.  \nIndeed, it is often pointed out that information systems development is an emergent socio-technical \nactivity (Baskerville and Pries-Heje, 2004; Chae and Poole, 2005; Orlikowski, 1996; Truex and \nBaskerville, 1998). The improvisation-paradoxes developed here juxtapose and reveal the seemingly \nopposite elements of such improvisation, and can reveal the tension between environment and history, \nspontaneity and reflexivity, unfolding and planning, practices and structure, individual and collective, \nand anxiety and confidence. These elements are bound together in a constant mutual constitution. \nEnacting elements on one side of Table 1 give rise to elements on the other side, for example, high \nlevel planning, direction, and minimal structure provides the support, freedom and safety-net for \npeople to explore through trial-and-error, improvise, and innovate. Seen the other way, seemingly \ndisorderly and chaotic day-to-day practices can produce order, direction and meaning through \nretrospective sensemaking. Individuals encouraged to embrace their individuality and thinking free \ncultivate a culture of democratic meritocracy, while a high level of creativity and competence, as well \nas common goals can inspire trust, commitment and voluntarism.  \nCollective agility is then a phenomenon of enacted emergence in the sense that, while rooted in \ncreative human agency, i.e. the improvisational practices (including the dimensions of planning, \n  10 \norganising and structuring) of knowledgeable and reflective social actors (individuals and teams), \nagility is an attribute of the distributed collective that emerges from the paradoxes and exists as a \ncombination of intended and unintended consequences of these activity. In the following sections, we \nexamine in detail how the particle physics community enact these improvisation-paradoxes and sustain \na level of collective agility. \n3. Research Methodology \nThe Large Hadron Collider Computing Grid (LCG) provides a distinctive case of distributed systems \ndevelopment (Venters and Cornford, 2006). This work focuses on the UK’s component of the project \n– GridPP. Core data collection took place from 2006 to 2008 and included participant observations of \nweekly meetings, various UK and international GridPP workshops and meetings, and relevant \nconferences. We had full access to the GridPP main documentation, and subscribed to its main mailing \nlists. \nForty eight semi-structured qualitative interviews of between one and one and a half hours were \nundertaken at universities across the UK and at CERN in Geneva. Table 2 provides details of the \nresearch activities undertaken while Table 3 shows a summary of the principal interviewees. Sampling \nwas based on functional groups of GridPP, starting from the Project Management Board (PMB) for an \noverview, then proceeding to representatives from the three main activity areas: applications, \nmiddleware and infrastructure. Another group of interviewees were users from the LHC experiments, \nmany of whom were involved in some development activities. We interviewed managers and technical \nexperts of the LCG at CERN to contextualise our observations. This showed that the practices of \nGridPP were not unique to the UK but have roots in an international Particle Physicist culture. When \nnecessary, interviewees were revisited. Interviews were audio-recorded, transcribed and coded for \nanalysis using the Atlas.Ti software, though not rigidly so as to avoid being restricted by the software. \nData analysis was closely integrated with theoretical development in an iterative process, one feeding \ninto the other.  \n[Insert Table 2 about here] \n[Insert Table 3 about here] \nWe identify three stages of data analysis. The first was open coding of the data, labelling aspects of the \nproject, practices, and emerging ideas (Table 4 shows an example). This exercise, combined with the \nembedded understanding acquired by the researchers from secondary material and during participant \nobservation, provided an appreciation of the complexity of the project and gave a sense of the tensions \ninherent in such work. For example, experimental physicists were not always keen to follow \nprocedures. Similarly, while there might seem to be prevalent adhocracy and frequent fire-fighting, the \nproject was unified in their confidence that the system would work. With these broad ideas in mind, \n  11 \nour theoretical exploration led us to the literature of organisational improvisation, which has a strong \nresonance with the data, and already entails a paradoxical dimension (Weick, 1998). This process \ngives rise to a draft analytical framework of improvisation-paradoxes. \n[Insert Table 4 about here] \nIn the second round of data analysis, we used the conceptual constructs of the improvisation-\nparadoxes as categories to set up and iteratively refine code families in a way similar to axial coding in \ngrounded theory (Corbin and Strauss, 2008). These codes were presented in a network view, and \nrelationships between the codes were identified. But relationships were not understood as indicating \ncausality. These “networks” were verified and modified against further observations and interviews. \nThis was an iterative process until the key conceptual constructs were sufficiently refined and \nsaturated. We verified our findings with a survey, not reported here, which largely confirmed the \nthemes.  \nIn summary, the analysis reported here is the result of iterative reflections and ongoing discussions \nwithin the research team and with GridPP members, rather than a narrow machine-derived account – \nour own engagement with organisational improvisation and sensemaking. While all the quotes given \nhere are taken from interview transcripts, the ideas have also been significantly reinforced by informal \nconversations and participant observations. \nThis is not to say that the GridPP community is unified in their opinions. Tensions, conflicts and \ndifferent views are inevitable in any undertaking of this scale. Nevertheless, the research attempts to \ncapture the distinctive features of GridPP, and this account has been broadly supported by three \nGridPP PMB members who were presented with the key findings of this paper.  \n4. The Particle Physics Grid  \nIn April 2010 the Large Hadron Collider (LHC) particle accelerator at CERN, the European \nLaboratory for Particle Physics, started again after a problematic public launch in 2009. The LHC \ncollides Hadron particles at energies close to those of the Big Bang in a search for the elusive ‘Higgs-\nBoson’ particle believed to be responsible for matter having mass. These collisions will produce data \nfor the four LHC experiments. Since the Higgs-Boson is conjectured to be extremely difficult to find -\nlikened to searching for a “needle in twenty million haystacks”, the number of collisions, and the \nsubsequent data produced, is vast. The LHC envisages producing 15 million gigabytes of data a year - \nequivalent to a DVD every 15 seconds or 1% of 2006 global information production (Lee et al., 2006). \nTo store and analyse this data the LHC requires the equivalent of 100,000 PCs spread across the globe \nand working as a Grid (Britton et al., 2004).  \nA grid from a technical perspective is a computing platform for coordinated resource sharing and \n  12 \nproblem solving suitable in data-intensive and compute-intensive applications (Foster et al., 2001). A \ngrid connects and coordinates diverse distributed and heterogeneous computing resources, presenting \nitself to users as though it was a single resource.  \n[Insert Figure 1 about here] \nThe GridPP project started in 2001 and has two main activities: developing software to allow users to \nsubmit computing jobs to the LCG, and developing and operating the UK’s component of LCG. \nGridPP is involved in developing applications and middleware (the grid's ‘operating system’) as well \nas providing technical infrastructure including storage and processing units. As shown in Figure 1, the \nLCG has a hierarchically tiered structure, with Tier 0 at CERN, Tier 1s consisting of the national IT \ncentres in each of the major countries involved in the project, and Tier 2s being the regional centres in \neach country. GridPP consists of the Rutherford Appleton Laboratory (RAL) as the Tier 1 centre, and \nfour Tier 2 centres, each coordinating a number of institutes in their region. \n[Insert Figure 2 about here] \nGridPP is managed, as with the wider LCG, by what one interviewee described as a “democratic \nmeritocracy”. Figure 2 shows GridPP’s management structure which is best described as a network \nthan any sort of hierarchy. The PMB is the heart of the network coordinating the project. It provides \nquarterly reports to the Collaboration Board which consists of representatives from the 19 institutes. \nThe participating institutes enter the collaboration not under any legal obligation, but bound by a \nMemorandum of Understanding which specifies the amount of resources and the level of service that \neach site is expected to provide, and the funding and support they will receive from GridPP in return. \nThis document serves as a “gentlemen’s agreement” and there are no formal lines of authority between \nGridPP and the member institutes other than this collaborative relationship. Decisions are made on a \ndemocratic or consensual basis and implemented by influence and persuasion.  \nDeveloping LCG has been seen from the start as a highly distributed, complex and poorly defined \nsystems development challenge. Cutting edge hardware and software is used, new software standards \nhave to be negotiated, and middleware along with a wide range of supporting software, developed in a \nrange of countries and programming languages. LCG is developed with close involvement of members \nof the user community who exerts strong influence and pressure for the completion of a working \nsystem, which has to be achieved with limited time and resources.  \nThe system development practices used within GridPP broadly coincide with the general principles of \nagile methods; “individuals and interactions over processes and tools; working software over \ncomprehensive documentation; customer collaboration over contract negotiation; and responding to \nchange over following a plan” (Fowler and Highsmith, 2001). A technical expert with experience of \nGridPP described it as a “bottom-up approach”.  \n  13 \nThe systems development practices observed in this case are similar to those described by Baskerville \nand Pries-Heje (2004) as “short cycle time systems development”. Table 5 compares similarities and \ndifferences between the practices observed in the two studies. The final column of the table indicates \nunderlying organisational implications related to the identified practices. Beyond these similarities \nwith other agile or short-cycle development projects, some challenges and characteristics of LCG and \nGridPP are distinctive, in particular, the scale of the system and the distributed nature of its own \nenvironment raises demands for scalability and interoperability. For example, LCG draws on several \nregional grids in Europe, North America and Scandinavia each using different middleware stacks. \nWithin the European project, the middleware is modularised and its components developed in a \nvariety of programming languages. Middleware releases are tested in small-scale pre-production \nsystems but they tend to be problematic when implemented across the whole system. The Grid \ntherefore evolves as advanced users actively engage in using, testing and reporting problems. System \ndevelopment cycles are not only simultaneous or overlapping activities of development, testing and \nuse, but also include complete parallel solutions which compete with each other. Finally, there are \ntensions around whether the Grid should be generic enough for other communities of users (which it is \nin part funded to be), or whether it should be tailored to particle physics (the main users and \ndevelopers); and tensions between the powers of system administrators of local sites, who might wish \nto prioritise the needs of their local institute, and the requirements of the LHC experiments. \n[Insert Table 5 about here] \n5. Enacting Paradoxes \nThe enactment perspective proposed by Weick (1977) suggests that organisations “construct” their \nenvironment before they “respond” to it or try to control it, and this can be understood as a process of \ninteracting and sensemaking. Enactment embodies this sense of action and of creation. In this case, the \nparticle physicists “reconstruct” the task of building a new distributed technology as one that they are \nlargely familiar with – a distributed experimental collaboration – and it is seen as just another task that \nthey have to complete in order to achieve the shared goal – doing new physics.  \nAs introduced above, we frame the systems development activity in GridPP as an organisational \nimprovisation that is animated by various tensions. We present our analysis, drawing on \nimprovisation-paradoxes but in a slightly different sequence to Lewis. In this case we see the nature of \nthe grid development as being fundamentally driven by a sense of belonging and start with this \nconcept. We then move to paradoxes of organising and conclude with learning. \n5.1 Belonging to GridPP \nThere is a sense of a strong community bond among GridPP members, which we express in the \nconcept of collective individuality (Table 1 & 6). Most members of GridPP are particle physicists or \n  14 \nhave a physics background. One consequence is that members are motivated by both a shared history \nand a shared goal. This goal is not to build a grid, but to discover new physics. They work for the same \nvision despite strong competition between similar experiments. As commented by one interviewee,  \n“I said I was proud of being a particle physicist, this is because particle physicists always get \nthe job done; by and large because they are driven by one fundamental thing. They want their \nexperiment to work when the beam gets into the accelerator, okay? And that transcends \neverything else they do. ”  \nCoupled with the shared goal is a high level of trust as shown very clearly from the interviews:  \n“Everyone trusts each other to be doing the best they can… That fundamental trust drives our \nparticle physics group. ”  \n“You have to trust that people will step up… and do the dirty work as well as doing the \nglamorous work.” \nParticle physicists have been encultured above all to respect intellectual capacity (Traweek, 1988). \nWith a high level of trust, people generally enjoy a high level of autonomy at work, usually without \nclear instructions or strict supervision. Individuals will try to solve a problem, develop software, write \na document, not because their line manager told them to, but because they felt that it was something \nuseful to do. Individuals are driven by individual motivations – but they also desire that their \ncontribution be recognised as valuable. Key technologies in particle physics have emerged in this \nmanner – with the main analysis system for storing particle physics events (called “Root”) began with \none developer trying to solve a problem in a new way without institutional support, similar to their \ndevelopment of the Web. As one senior CERN employee who shared an office with Tim Berners-Lee \nrecounted:  \n“Tim had the freedom from this hierarchy, to spend a bit of time investigating something \nwhich was of interest to him and nobody else here said – ‘oh it’s a waste of time, never mind’. \nHe was working on remote procedure calls, and out of it popped the web”. \nWith members based in disparate institutes, it is important to develop social and emotional bonds \namong individual members. The deployment team provides a good example.  \n“We have to work very well together as a team, in order for GridPP to be successful. And … \nit's quite a complicated structure - there are multiple channels of communication, some of \nwhich are duplicated some of which are contradictory, and there are all sorts of ways in \nwhich information flows. And anything that you can do to oil the cogs of the machine is going \nto help. ... And I think for us to socialise together is a very important thing.”  \n“Going to the pub” when and wherever they meet is one aspect of this since it “fosters a bond” \nbetween people and allows them to discuss their frustrations caused by the size and complexity of the \nproject. During such social occasions work is invariably discussed, people “let off steam” and \n  15 \nnegotiations are made. These social meetings are sporadic and between them the constant \ncommunication through video conferencing, email, messaging lists, blogs and instant messaging \ncontinue. Relationships develop between parties who have never met. Many attend the regular video-\nconference meetings simply to get a feel for the “mood” and a sense of connection – often having the \nmeeting running on their computer while undertaking other tasks. \nCommunication supports a mood of anxious confidence (Tables 1 & 6), that mediates the pressure of \nthe LHC switch-on and of showing the UK in a good light among the worldwide particle physics \ncommunity. Along the way GridPP has to face many unplanned-for occurrences and environmental \nturbulence in funding, human resources, external and internal technological changes, hardware and \nsoftware configurations, technical requirements from the experiments, computer market conditions, \nand other institutional and political factors. Indeed, the project is “committed to something that it isn’t \nquite funded” (PMB member) and in March 2007 were allocated only 70% of the anticipated funding \nfor Phase 3 (2007 to 2011), which resulted in support posts being cut. Nevertheless, the collaboration \nremains committed, engaged, and always “just about” on top of things. They may appear to be \nconstantly fire-fighting, discovering problems, managing crises, and negotiating solutions. But almost \neverybody in the collaboration who we interviewed held a firm belief that the Grid will work; maybe \nnot perfectly, but it will work.  \nA significant source of their confidence thus resides in a belief in the individual skill, competence and \npragmatic creativity of physicists, as well as high energy physics’ formative context of collaboration. \nWhile GridPP employs people from other fields, the majority come from this “elite science” (Traweek, \n1988) which is highly competitive to enter. When asked about the likely success of LCG, a technical \ncoordinator boils it down to cleverness:  \n“…because we are very clever people, we have a very clear and determined goal, we will \nmake it work”.  \nAnother source of confidence resides in the community’s long history of success in computing. CERN \nfor example accepted the problems of working with pre-production supercomputers from the days of \nthe CDC 6600 through to the CRAY X-MP (Jones, 2004). Later they pioneered work on the Web \n(Berners-Lee and Fischetti, 1997), shifted early to use Open-source (Linux) server-farms, all driven by \nthe need to do physics. Grid computing, it seems, is just another minor computing waypoint on the \nroute to the truth about the universe. Equally importantly, the particle physics community enjoys an \norganisational culture which appreciates “the aesthetic of imperfection” (Weick, 1999) and accepts \nfailed attempts as part of a bigger process, fostering the confidence of individual innovators.  \n5.2 Organising GridPP \nPlanned agility (Table 1 & 7) refers to planning to improvise and preparing for change. In GridPP it is \nrecognised that ad hoc practices have to be supported by some financial planning, risk management, \nproject milestones and resource allocation mechanisms. For this reason extensive Gantt charts and \nschedules are produced, often in a preparation for research funding council reviews, but also serving \nas a minimal structure for the project. While a project manager was only appointed on the insistence of \nan IT industry representative sitting on the Oversight Committee, and the PMB finally settled on \nappointing a particle physicist (and “friend” of GridPP) to the post, this role is now accepted as crucial \n  16 \nto keeping the project on track. This is not however to say that the PM role focuses on traditional \nproject management. Considering GridPP as in its essence “experimental” and undertaking “green-\nfield research”, the PMB focuses on supporting and justifying change as at the core of their minimal \nplanning process.  \n“We wanted to establish the fact that we had the right to change our deliverables. So we set \nup this project map and we set up the formality of change forms. So this was to formalise our \nfreedom to change the project … yes, we had a set of milestones but you know, we had a \nmechanism to change them because we have to be responsive. ”  \nAlthough schedules are constantly in flux, the project seeks never to lose sight of where they are and \nwhere they are heading.  \n“…people are looking at the overall targets of where people are trying to get to, rather than \nmonitoring people on a daily or weekly basis. So we're looking for overall trends more than \nvery small time-based ones.”  \nThe project maps and schedules, change forms, and quarterly reports are tools designed to achieve \nvarious paradoxical goals; to display rationalised order, to acquire legitimacy, to cope with changes \nand to support or legitimise spontaneity. They also provide impetus to carry the project forward, even \nif the plan is tentative and has to be made real through day-to-day sense-making and actions. This \nproactive mode of management is combined with a reactive mode of daily trouble-shooting: \n“We do everything we can in terms of advanced planning, so we have a staggered \nprogramme of sites in migrating, things like this. But ultimately what dominates is when we \nhave done something that has gone wrong, or something has broken, or something doesn’t \nwork in experiments, or something like this, and we have to try and solve that.” \nIn other words, there is a plan to improvise, routinised processes to stimulate improvisation and \nobservation of their own improvisational activities (Miner et al., 2001). As one of the technical \ncoordinators described, with an extended metaphor, \n“You need your head in the clouds to see the big picture, but you very much need your feet on \nthe ground because you have to put one foot in front of the other, and day to day we keep \nputting one foot in front of the other….”  \nStructured chaos (Tables 1 & 7) means providing a minimal structure to support improvisation. \nGridPP is a collaboration of institutes who work together under a Memorandum of Understanding. \nManagement in GridPP does not rely on vertical lines of command, and while there is an extensive \nstructure of management boards, committees, and technical groups, they serve more as communication \nchannels than hierarchies of authority. Managerial roles in the collaboration serve most of the time as \nrepresentatives, spokesperson, or coordinating facilitators, and when decisions (e.g. financial \nplanning) have to be made centrally at the PMB, such decisions are open to scrutiny by the full \ncollaboration. Most importantly, there is enormous respect to the technical knowledge at the grass-root \nlevel. As one previous group leader stated:  \n“There’s no strict hierarchy […] the group leader doesn’t get to say what to do.… We \n  17 \nrecognise it’s the younger people that are much smarter and they’re going to be making the \npapers … So it’s kind of a federation, club… of smart academics who all want to do it and \neveryone trusts each other to be doing the best they can for the experiment. And that \nfundamental trust drives our particle physics group.”  \nDifferent solutions often compete with each other within the collaboration for a while until one of \nthem wins by forming more alliances or others die in a natural course e.g. due to technical failures, \nlow up-take, lack of funding or other circumstances. The technical systems then emerge from \n“contests of unfolding” (Knorr-Cetina, 1999): \n“The cream comes to the top. Things that work win out and that’s how we worked it. (…) \nNobody knew what the right approach was so you try several approaches and some win, some \nlose.”   \nThe “natural selection” of technical solutions, as described by members of GridPP, allows elements of \nthe Grid to emerge from dispersed and localised practices without an arbitrary or centrally imposed \ndecision-making process. Although the middleware is developed by a European Grid development \nproject (EGEE) centrally coordinated at CERN, it is modularised and each of the components is \nprototyped, released, deployed, tested, and improved in an evolutionary manner. Beyond this core \nsoftware there are often parallel technical solutions found in the project, such as some components of \nthe middleware, or other software packages developed locally to help deploy, monitor, or manage \naspects of the Grid. The Grid environment thus consists of a mixture of “ecosystems”, in which \nmultiple technical solutions co-exist and even compete. Political influence and vested interests are \nreflected in such competition, but do not dictate outcomes. This is not to say that politics does not \nexist, but it is dispersed and mediated, and the influence of powerful actors is often dissipated, or \ncontingent on sound technical judgment. As an interviewee commented  \n“Nobody, no matter, even if they were the most politically powerful person in EGEE, can \nforce a broken piece of software to be deployed, because they will lose their political influence \nif they do that.” \n5.3 Learning to perform \nLearned improvisation (Tables 1 & 8) refers to drawing upon past experience to cope with \nuncertainties and complexity of the present. The need to improvise in LCG stems from the innovative \nand exploratory nature of the task: the process has to be trial-and-error since nobody knows what \nexactly the end product will look like or what issues will emerge along the way. Moreover, the \ncomplexity, scale and distribution of the project means no one person can have a clear idea of the \nwhole system (Hutchins, 1991); requirements cannot be pre-specified in detail; architectures are \nconjectures, and even the one centrally designed piece of technology, the middleware, has to be \nmodularised and released gradually rather than in a big-bang manner.  \nReliance on externally produced hardware and software also creates challenges by, exposing external \ntechnological perturbations. Relying on the EGEE to provide the middleware, GridPP face an ongoing \nprocess of learning and adapting to immature software, and making it work at each individual site. For \n  18 \nexample an undocumented change in the firmware of a set of hard-disks included an error that had \nsignificant repercussions for GridPP as they struggled to isolate this irregular error among terabytes of \ndistributed storage. Similarly the release of a new version of the Scientific Linux operating system (on \nwhich LCG runs) created demands from some computer centres to upgrade GridPP to this new version \nparticularly where computing resources were shared with other disciplines. Yet EGEE’s software only \nran on an even earlier version. Further issues occurred when some centres purchased 64bit rather than \n32bit systems, requiring two different distributions of the software.  \nThe response to this of those involved is not to control, predict or formalise, but rather to respond \npragmatically and creatively at the time, drawing on the down-to-earth and creative approaches \nembedded in particle physics tradition (Lewis, 2000). As Dahlbom and Mathiassen (1993) describe, \ndevelopers “have to interact with the environment, accept the openness of the problem and the system \nto be developed, take into account the preferences and beliefs of problem owners and users, deal with \nthe economical and political climate of the project, and keep in step with the changes in the kind of \ntechnologies on which the project is dependent”. Developers should be “scientific investigators” rather \nthan “economic agents” (ibid.). Indeed, particle physicists clearly bring their identity as “scientific \ninvestigators” into computing.  \n“I think the people who come from a physics background are ultimately more pragmatic in \ncomputing. They see the computing as a tool to get a job done. And if it requires you to wrap \nsellotape around it to get it to work, then they will wrap sellotape around it… the physicists \nare happier with an ad hoc solution just to get the job done and push them through.”  \nOne of the resources that GridPP draws upon is their identity as physicists, and as noted the \ncollaboration is designed as a physics experiment. The tradition of large scale globally distributed \ncollaborations (the ATLAS experiment, one of four at the LHC, has over two thousand members) and \nworking on a distributed basis is well established and provides a solid basis for improvisation in the \nGrid development project. Such collaborations include students, technicians, engineers and physicists. \nYet they have learnt at project management level how to organise collaborations to be pragmatic and \ndrive towards solutions. In other words, the ability to improvise is the result of years of experience and \nlearning. Such improvisation itself constitutes a further process of exploration and reflection which \nfeeds into the organisational capability to improvise.  \nReflexive spontaneity (Tables 1 & 8) indicates recovering meaning from improvisation retrospectively. \nThe seemingly spontaneous practices at the low level are balanced by a level of reflexivity maintained \nby continuous and extensive communication flows. Particle physics collaborations are managed by \nwhat Knorr-Cetina (1999) refers to as “a fine grid of discourse”, channelling individual knowledge \ninto the collaboration and providing it with a sort of “distributed cognition”. This web of \ncommunication includes a complex structure of boards, committees, and working groups which \nregularly hold meetings including online virtual meeting. For example, the PMB meeting takes place \n  19 \nonline every Monday where they discuss the status of the project and make action plans. The \nDeployment Team meets online on Tuesdays where they discuss technical issues. There are many \nother meetings taking place virtually or face-to-face during the week. Wikis, web pages and blogs are \nconsultation points during the meetings. More importantly, members of GridPP subscribe to various \nmailing lists that carry constant exchanges of up-to-date information on problems and emerging \nsolutions.  \nSuch extensive communications embody both mutual monitoring and proactive sensemaking. It lies \nwithin the monitoring, accounting, and making sense of the behaviour and performance of the system. \nTargets of service levels and regular data transfer exercises test the reliability and robustness of the \nsystems hardware and software. Much GridPP discussions in meetings revolve around the results of \nsuch tests and monitoring statistics. Interpreting the statistics is not straightforward or free of \ncontroversy. One often hears remarks like “we have to understand what is causing this phenomenon” \nor “find out what is behind the data”. In other words, retrospective sensemaking is an inherent and \nnatural component in their process of system development. There is a “humming” of the collaboration, \ntalking “with itself, about itself” (Knorr-Cetina, 1999), which maintains a constant collective \nreflexivity, as “the monitored character of the ongoing flow of social life” (Giddens, 1984).  \n6. Discussions and Implications \nWe examine above the characteristics of the collaborative performance of GridPP that enable them to \nachieve distributed and scaled agility. Improvisation-paradoxes have been used to make sense of the \nway that the Grid is developed. In this section we reflect on the case material, draw implications for \nthe wider discourse of agile systems development and provide some suggestions for those engaged in \nother distributed systems developments. \nWith multiple objectives and system development rationales in the community, the construction of \nGrid technology is a constant engagement and negotiation between a structured process and \namethodical practices (Truex et al., 2000). Long term goals, shared aims, preset deliverables, regular \nmonitoring and proactive political legitimisation are entangled with an “unfolding ontology” (Knorr-\nCetina, 1999), elements of which include: pragmatic outlook, fragmented and ad hoc practices, \nbricolage and improvised solutions, post hoc rationalisation, as well as contested interests, internal \ncompetitions, and democratic decision making - “a dialectic of resistance and accommodation” \n(Benson, 1977, Pickering, 1995).  \nThe particle physicists, while not strictly following any pre-defined agile methods are aware of the \nchallenges they face and have made deliberate and substantial effort to achieve a suitable development \nprocess. In other words, the agility seen here is not just an unintended consequence of loose coupling, \na culture of improvisation and bricolage, intelligence, trust and pragmatism. Rather it is a performance \nby knowledgeable actors who draw upon and enact certain properties of the distributed collaboration, \n  20 \nsuch as minimal structure, flexible planning, extensive communication and social bonding, all serving \nto generate coherence, facilitate mutual understanding, promote sensemaking, and to coordinate \ndistributed work. The agency and knowledgeability of members of the project are central in this \nprocess. While no one serves as the mastermind of the project, the interaction and coordination among \nthem give rise to a “collective mindfulness” (Carlo et al., 2004) with “a rich awareness of \ndiscriminatory detail and a capacity for action” (Weick et al., 1999). It takes real effort to maintain this \ncollective mindfulness, without which distributed agility would not be possible or sustainable. \nTherefore, while agility can be described as an emergent property of the distributed collaboration, such \nemergence is very much enacted, involving degrees of deliberation and reflection, and instantiated in \nday-to-day practices.  \nWhat implications should we draw from our analysis of this case of “collective agility”? What is \npresented may not be an ideal form of distributed agile systems development – after all it is not in a \ncommercial environment or facing immediate safety critical concerns such as in health care or air \ntraffic control. Yet there is a lot we can learn. From the perspective of organisational performance, \ncollective agility is about accepting what is unpredictable and uncontrollable, while actively enacting \nthose organisational dimensions that generate capabilities to perform under such circumstances. Table \n9 presents examples of organisational practices from the case that could be useful to practitioners who \nshare the interest in what it takes to “be agile”. In the sections below, we explore further by asking the \nquestions of when, what, who, where and how is such case-specific collective agility performed. Our \nimplications should be taken in the round – we see each as part of a cumulative recommendation for \nthose engaged in similar practices rather than an isolated concept.  \nWhen is collective agility performed? \nAgility is indicated when faced with environmental turbulences, uncertainties, and an innovative or \nexploratory task, as is the case with GridPP. Yet organisational improvisations come with risks and, \nfor example, may not be the most efficient or effective way to tackle certain problems, despite being \npreferred by a community drawing on their past success. The particle physics community’s tradition of \nexperimental scientific investigation and pragmatic problem-solving means an agile approach is \n“natural” rather than contrived, yet this may also means it is “assumed” rather than “considered”. \nOver-reliance on improvisation can also lead to an amplification of unexpected events and crises, self-\ngenerating a negative spiral of uncertainties and complexities (Cunha et al., 1999). Communities \nengaging in large scale and distributed systems development are thus faced with the challenge of \ngetting the appropriate mixture of improvisation and structure. As expressed by the concept of learned \nimprovisation, we argue agility can (to degrees) be learnt. Communities accustomed to more formal \nmanagement approaches are not incapable of achieving agile performance. On the contrary, our \nresearch suggests, organisations with established routines and strong cultures to draw upon might be \nbetter equipped to improvise than those without. But this needs cultivation of the space and motivation \n  21 \nto diverge from or reinterpret established routines. Collective agility is performed when some “tools \nare dropped” (Weick, 1993a), and surprise, risk and wonder are accepted in the community. \nWhat is (the spirit of) collective agility? \nWe argue here that collective agility is supported by a sustained mood of anxious confidence. Anxiety \nstems from the nature of innovative tasks, and in the sense of urgency, pressure and demand for speed \nin problem solving. A successful innovative community needs a countervailing level of confidence \nwhich can stem from strong individual skills and experience under demanding conditions, as well as a \nhistory of technical success as well as appropriate social settings. This confidence can arise in part \nfrom an appreciation for the “aesthetics of imperfection”. An atmosphere of experimentation, trust, \nshared goal, and emotional bonds provides individuals and groups with confidence to make mistakes, \nin the knowledge that failures are legitimate and can contribute to the cause of the community. \nWho undertakes collective agility?  \nThe competence of the people, the level of determination and motivation, and how well the group gets \non, were identified by GridPP members as the most positive aspects of the project. Performing \ncollective agility poses a high demand on individual skills and mental attitudes. Like most professional \ndomains, recruits are expected to be self-motivated, good communicators and able to work in a \ncollaborative environment. Distinctively though, GridPP prefers people who are familiar with the \ninstitutional culture of the particle physics community, and who are thus motivated to step up and do \nthe dirty work when necessary without explicit instruction or reward. The level of commitment, \ndevotion and voluntarism appear higher than one might observe in some commercial contexts. While \nindividuals certainly have personal career interests at stake, many express a sense of pride in working \nfor a higher cause, perhaps explaining their willingness to undertake unpopular tasks when needed.  \nWhere does collective agility happen? \nThe literature suggests that both improvisation and agility are more easily performed in small groups, \nsuch as a jazz ensemble or small development teams. Our case shows agility is possible in a large and \ndistributed group, when the “ambience” is right, although achieving this is itself a major challenge \n(see also Ramesh et al., 2006). Community bonds can alleviate many difficulties but require effort to \nmaintain. Even though GridPP members are accustomed to virtual meetings and a large number of \nemails, they still emphasise the importance of face-to-face communication, and travel extensively to \nmeet up. Being reliant on delivery from many remote partners without the authority over them is often \na source of frustration, thus the ability to exert gentle pressure, to persuade and to negotiate are \nimportant elements in coordinating a collective performance. Meanwhile, barriers of communication \nor an overload of information can also create inefficiencies in a non-hierarchical community. \n  22 \nHow is collective agility performed? \nAs has been repeated throughout the paper, agility requires a mental attitude to, in the words of one \ninterviewee, “let go of control”, yet this does not mean anarchy. High level planning and a minimal \nstructure are required. For GridPP this consists of alignment with goals of doing new physics, a clear \norientation towards the LHC objectives, a shared culture among participants, and a carefully crafted \nminimal structure of project management, and communication channels to allow local “clusters of \nexpertise” to interact. Improvisation at the local level is complimented by structuring at the distributed \nlevel to maintain cohesiveness across the project and to create a sense of community among the \nindependent-thinking actors. Finally organisational improvisation comes with risks. The lack of formal \nplanning and reflexivity may mean that exploitation of novel ideas and knowledge is limited despite a \ngreat deal of exploration, thus creating “opportunity traps”. \n7. Conclusions \nThis paper considers agile system development practice from the perspective of organisational \nperformance, reflecting an understanding that systems development processes and activities cannot be \ndiscussed in a vacuum but must be considered in terms of how, in given contexts, they become \nembodied within a set of roles, attitudes and working practices adopted by people – as a performance. \nFrom this case study we observe that the LHC-Grid unfolds in a constant negotiation and mediation \nbetween design and bricolage (‘working things out’), between planning and improvisation, and \nbetween enough success and tolerable and instructive failure. Drawing on previous work on paradox \nwe use a set of improvisation-paradoxes as a framework to examine system development practices \nwithin this distributed development context. This framework, and the attention to collective \nperformance, enables us to elaborate and explore elements often pushed to the background in \ndiscussions of system development, such as environmental conditions, individual skills, professional \ncultures, organisational structures, communication patterns, and interpersonal relationships. The case \nstudy demonstrates in this community of science known to be most rationalistic and analytical, \nsystems development is actually more like an “art” – visionary, experiential, passionate, agile and \nemergent.  \nThis study has limitations and thus suggests some future research directions. First the context of \nGridPP is clearly distinctive. Experimental physics offers an environment that in many ways embraces \nan agile approach. Studies in other contexts that explore similar themes would be useful, for example \nin the various projects around the world that are developing national health care information \ninfrastructures (Coiera, 2009), or those developing systems for the cloud (Buyya et al, 2009). This \nwork might also suggest some comparison with the ways in which the Internet and its core systems \nand services have developed using a ‘community centric’ development model, as well as some aspects \nof the open source model (Tuomi, 2002, 2005). While the context and outcomes in such domains are \nrather different, the performative analysis seems to have strong resonance. We also acknowledge that \n  23 \nthe period of this study was one of development and testing rather than of operations and the phase \nchange may have significant consequence on the approach to system development. Indeed, towards \nthe end of the study reported here, there were signs that could indicate a greater emphasis on a more \nstructured approach within the LCG.  \nDespite the limitations discussed above, the contributions from this research are, we believe, \nsignificant.  \nFirst we provide a conceptualisation of agility (collective agility) that differs substantially from the \nmore common concerns with agile methods and behaviour, or with an organisation’s agile potential or \ncapabilities. In contrast, we adopt a performative ontology and develop an understanding of agility \nthrough the concept of enacted emergence. Agility for us is an expression of what people do or \nachieve, rather than what they might do or capabilities they hold. We argue that collective agility, as \nan organisational performance, emerges from collective enactment of certain qualities and processes in \nthe distributed community.  \nSecond, we derive six improvisation-paradoxes from the literature and use them to give a stronger \nconceptualisation to the work of GridPP members as they negotiate the contradictory pressures for \norder and innovation. These paradoxes are used to underline the dynamics of the agile performance; as \nan expression of, and (to a degree) the resolution of, fundamental tensions. It is the mutual constitution \nof elements in tension that allow agility to emerge. \nThird, we offer a contribution to practice by drawing implications from the case, presented as the \nwhen, what, who, where and how of collective agility, and covering both useful practices identified \nand risks to be aware of. These recommendations highlight the means by which collective agility \nmight be achieved and maintained, and offer insights for other domains attempting to construct large-\nscaled distributed infrastructure in an agile fashion. For example, Ramesh et al. (2006) assert that \ndistributed agility faces the challenge of communication, lack of control and lack of trust. Our study \nsuggests that these may not be causes but symptoms of a broader failing to understand the nature of \nagility within such a context. Thus to managers who want to achieve some of the attributes of a \ncollective agile performance, we suggest that communication, control and trust cannot be isolated \nfrom more complex and comprehensive efforts to support and cultivate an innovative culture within \nthe distributed community, and require reflection on questions of balance among the various \nparadoxical tensions embedded.  \nFinally the ‘enacted emergence’ of collective agility highlights the need for ongoing performances - \nagility is not a “per project” or even less, “per phase” activity and cannot be achieved by a top-down \n“change programme”. Rather it is a performance that is reflective of multiple collective organisational \npractices. Hence, achieving it must be a long-term aspiration requiring attention and adjustments over \ntime, and like other institutional practices, collective agility may be fragile and easily broken. For \nLCG it might be that the future would be different, and that contractual relationships and a reliance on \n  24 \ntechnical and managerial rationality would prevail once the LHC data begins to flow in bulk. What is \nclear is that many domains where large scale distributed systems are under development can learn \nfrom this case and the paradoxical nature of collective agility.  \nReferences \nAbrahamsson, P., K. Conboy et al. \"Editorial: ‘Lots done, more to do’: the current state of agile \nsystems development research.\" European Journal of Information Systems (18), 2009, pp. 281-\n284. \nAvgerou, C. and T. Cornford, \"A Review of the Methodologies Movement\", Journal of Information \nTechnology(5) 1993, pp. 277-286. \nBansler, J., and Bodker, K. \"A Reappraisal of Structured Analysis: Design in an Organisational \nContext,\" ACM transactions on Information Systems (11:2), April 1993, pp 165-193. \nBansler, J.P., and Havn, E.C. \"Improvisation in Information Systems Development,\" Information \nSystems Research: Relevant Theory and Informed Practice (IFIP 8.2), Kluwer Academic \nPublishers, Manchester, UK, 2004, pp. 631-646. \nBarrett, F.J. \"Coda: Creativity and Improvisation in Jazz and Organisations: Implications for \nOrganisational Learning,\" Organisation Science (9:5), 1998, pp. 605-622. \nBaskerville, R. and Pries-Heje, J. \"Short Cycle Time Systems Development\" Information Systems \nJournal (14:3), 2004, pp. 237-264. \nBaskerville, R.L. \"Artful Planning\", European Journal of Information Systems (15), 2006, pp.113-115. \nBaskerville, R., Ramesh, B., Pries-Heje, J., and Levine, L. \"High-speed software development \npractices: What works, what doesn’t.,\" IEEE IT Professional (8) 2006, pp 29-36. \nBaskerville, R., Travis, J., and Truex, D. \"Systems without method: the impact of new technologies on \ninformation systems projects,\" in: The impact of computer supported technologies on \ninformation systems development, K.E. Kendall, K. Lyytinen and J.I. DeGross (eds.), North-\nHolland,, Amsterdam, 1992, pp. 241-269. \nBeck, K., and Andres, C. Extreme Programming Explained Addison-Wesley, Upper Sadle River, NJ, \n2005. \nBenson, J.K. \"Organisations: A dialectical view,\" Administrative Science Quarterly (22) 1977. \nBerliner, P.F., Thinking In Jazz: The Infinite Art of Improvisation, the University of Chicago Press, \n1994. \nBerners-Lee, T., and Fischetti, M. Weaving the Web, Harper, San Francisco, CA, 1997. \nBoehm, B. \"A spiral model of software development and enhancement,\" Computer (21:5), May 1988, \npp 61-72. \nBritton, D., Clark, P., Coles, J., Colling, D., Doyle, A., Fisher, S.M., Irving, A.C., Jensen, J., McNab, \nA. and Newbold, D. \"A Grid for Particle Physics - from Testbed to Production,\" GridPP, 2004. \nBrooks, F. The Mythical Man-Month, Addison-Wesley, New York. DeRemer, Frank; 1979  \nBrown, J.S. and Duguid, P. \"Organisational Learning and Communities-of-Practice: Toward a Unified \n  25 \nView of Working, Learning, and Innovation,\" Organisation Science, Special Issue: \nOrganisational Learning: Papers in Honor of (and by) James G., (2: 1), 1991, pp. 40-57. \nBuyya, R., Yeo, C.S., Venugopal, S. Broberg, J. and Brandic, I. Cloud computing and emerging IT \nplatforms: Vision, hype, and reality for delivering computing as the 5th utility, Future \nGeneration Computer Systems, 25(6) 2009, pp. 599-616. \nCarlo, J.L., Lyytinen, K. & Boland, R.J., “Systemic Risk, IT Artifacts, and High Reliability \nOrganisations: A Case of Constructing a Radical Architecture”. Sprouts: Working Papers on \nInformation Environments, Systems and Organisations, 4(2) 2004.  \nChae, B., and Bloodgood, J.M. \"The Paradoxes of Knowledge Management: An Eastern Philosophical \nPerspective,\" Information and Organisation (16) 2006, pp 1-26. \nChae, B., and Poole, M.S. \"Surface of Emergence in Systems Development,\" European Journal of \nInformation Systems (14) 2005, pp 19-36. \nCiborra, C. \"A Theory of Information Systems Based on Improvisation,\" In Rethinking Management \nInformation Systems, W. Currie and B. Galliers (eds.), Oxford University Press, Oxford, 1999, \npp. 136-155.  \nCiborra, C.U. \"In the Mood for Knowledge: A new study of improvisation,\" in: Social Study of \nInformation Technology Workshop London School of Economics and Political Science, \nLondon, 2001. \nCiborra, C. The Labyrinths of Information, Oxford University Press, 2002. \nCiborra, C., Braa, K., Cordella, A., Dahlbom, B., Failla, A., Hanseth, O., Hepsø, V., Ljungberg, J., \nMonteiro, E., and Simon, K.A., From Control to Drift: The Dynamics of Global Information \nInfrastructures, Oxford University Press, 2000. \nCohen, M.D., et al. \"A Garbage Can Model of Organisational Choice,\" Administrative Science \nQuarterly (17:1), 1972, pp. 1-25. \nCoiera, E, 'Building a National Health IT system from the Middle Out', Journal of American Medical \nInformation Association, 16(3), 2009, pp271-273. \nConboy, K., and Fitzgerald, B. \"Toward a Conceptual Framework of Agile Methods: A Study of \nAgility in Different Disciplines,\" Proceedings of the WISER'04, Newport Beach, California, \n2004.  \nCorbin, J., and Strauss, A. Basics of Qualitative Research, Sage, Los Angeles, 2008. \nCrossan, M.M. \"Improvisation in Action,\" Organisation Science (9:5), 1998, pp. 593-599. \nCrossan, M.M., H.W. Lane, R.E. White, L. Klus \"The Improvising Organization: Where Planning \nMeets Opportunity,\" Organisation Dynamics (24:4), 1996, pp. 20-35. \nCunha, M.P.e., Cunha, J.V.d., and Kamoche, K. \"Organisational improvisation: What, when, how and \nwhy,\" International Journal of Management Reviews (1:3) 1999, pp 299-341. \nCurtis, B., H. Krasner, and Iscoe N. \"A Field Study of the Software Design Process for Large \nSystems.\" Communications of the ACM (31:11) 1988, pp1268-1287 \nDahlbom, B., and Mathiassen, L. Computers in Context: The Philosophy and Practice of Systems \n  26 \nDesign, Malden, USA, 1993. \nDeMarco, T. Structured Analysis and Systems Specification Yourdon - Prentice-Hall Software, New \nYork, 1978. \nDeRemer, Frank and Kron, Hans, \"Programming-in-the large versus programming-in-the-small\". \nProceedings of the international conference on Reliable software: 114--121, Los Angeles, \nCalifornia: ACM, 1975. \nDyba, T. \"Improvisation in small software organisations,\" IEEE Software (Sept\/Oct) 2000, pp 82-87. \nFlor, N.V. “Globally distributed software development and pair programming”, Communication of \nACM, 49(10), 2006 pp.57-58.  \nFoster, I., et al. \"The Anatomy of the Grid: Enabling Scalable Virtual Organisations,\" The \nInternational Journal of High Performance Computing Applications (15:3), 2001, pp. 200-222. \nFowler, M., and Highsmith, J. \"The Agile Manifesto,\" Software Development (August), 2001.  \nGiddens, A. The Constitution of Society: Outline of the Theory of Structuration, Polity Press, \nCambridge, 1984. \nHatch, M.J. \"Exploring the Empty Spaces of Organising: How Improvisational Jazz Helps Redescribe \nOrganisational Structure,\" Organisation Studies (20:1), 1999, pp. 75-100. \nHighsmith, J. \"Agility in Software Development,\" In Agile Software Development Ecosystems, J. \nHighsmith (ed.) Addison Wesley Professional, 2002. \nHutchins, E. \"Organising Work by Adaptation,\" Organisation Science (2:1), 1991, pp. 14-39. \nHutchins, E. Cognition in the Wild, the MIT Press, Cambridge, MA, 1995. \nJones, C. \"Computing at CERN: The Mainframe Era,\" CERN Courier (44:7), 2004, pp. 32-35. \nKamoche, K., Cunha, M.P.E., and Vieira da Cunha, J. \"Towards a Theory of Organisational \nImprovisation: Looking Beyond the Jazz Metaphor,\" Journal of Management Studies (40) 2003, \npp. 2023-2051. \nKautz, K., Madsen, S., and Nørbjerg, J. \"Persistent problems and practices in information systems \ndevelopment,\" Information Systems Journal (17) 2007, pp 217-239. \nKnorr-Cetina, K. Epistemic Cultures: How the Sciences Make Knowledge, Harvard University Press, \nCambridge, MA, 1999. \nLanzara, G.F. \"Between Transient Constructs and Persistent Structures: Designing Systems in \nAction,\" Journal of Strategic Information Systems (8), 1999, pp. 331-349. \nLee, O.-K., Banerjee, P., Lim, K.H., Kumar, K., Hillegersberg, J.v., and Wei, K.K. \"Aligning IT \nComponents to Achieve Agility in Globally Distributed System Development,\" \nCommunications of the ACM (49:10) 2006, pp 49-54. \nLee, G., DeLone, W. & Espinosa, J.A.“Ambidextrous coping strategies in globally distributed \nsoftware development projects”. Communications of the ACM, 49(10), 2006, pp.35-40.  \nLewis, M. \"Exploring paradox: Toward a more comprehensive guide,\" Academy of Management \nReview (25:1) 2000, pp. 760-776. \nMathiassen, L., and Pries-Heje, J. \"Business Agility and Diffusion of Information Technology,\" \n  27 \nEuropean Journal of Information Systems (15) 2006, pp 116-119. \nMathiassen, L., and Vainio, A.M. \"Dynamic Capabilities in Small Software Firms: A Sense-and-\nresponse Approach,\" IEEE Transaction of Engineering Management (54:3) 2007. \nMiner, A.S., Bassoff, P. Moorman, C,,\"Organisational Improvisation and Learning: A Field Study,\" \nAdministrative Science Quarterly (46), 2001, pp. 304-337. \nMintzberg, H. \"The structuring of organisations,\" in: The Strategy Process: European Edition, H. \nMintzberg, J.B. Quinn and S. Ghoshal (eds.), Prentice Hall Europe, Hertfordshire, 1995, pp. \n350-371. \nMintzberg, H., and McHugh, A. \"Strategy Formation in an Adhocracy,\" Administrative Science \nQuarterly (30), 1985, pp. 160-197. \nMirvis, P.H. \"Variations on a Theme: Practice Improvisation,\" Organisation Science (9:5), 1998, pp. \n586-592. \nMoorman, C., and Miner, A.S. \"The Convergence of Planning and Execution: Improvisation in New \nProduct Development,\" Journal of Marketing (62:3), 1998, pp. 1-20. \nNandhakumar, J., and Avison, D.E. \"The Fiction of Methodological Development: a Field Study of \nInformation Systems Development,\" Information Technology & People (12:2) 1999, pp.176-\n191. \nOrlikowski, W. \"Improvising Organisational Transformation over Time: A Situated Change \nPerspective,\" Information Systems Research (7:1), 1996, pp. 63-92. \nOrlikowski, W.J. \"Using Technology and Constituting Structures: A Practice Lens for Studying \nTechnology in Organisations,\" Organisation Science (11:4), 2000, pp. 404-428. \nOverby, E., Bharadwaj, A., and Sambamurthy, V. \"Enterprise Agility and the Enabling Role of \nInformation Technology,\" European Journal of Information Systems (15:2) 2006. \nParnas, D., and Clements, P. \"A Rational Design Process: How and Why To Fake It,\" IEEE \nTransaction of software engineering, 1986, pp 346-357. \nPickering, A. The Mangle of Practice: Time, Agency and Science, University Of Chicago Press,1995  \nPoole, M.S., and Van de Ven, A.H. \"Using Paradox to Build Management and Organisation Theories,\" \nThe Academy of Management Review (14:4), 1989, pp. 562-578. \nRamesh, B., Cao, L., Mohan, K. and Xu, P. “Can Distributed Software Development Be Agile”, \nCommunications of the ACM, 49(10), 2006, pp.41- 46.  \nReifer, D.J., Maurer, F. and Erdogmus, H., “Scaling Agile Methods”. IEEE Software, July\/August \n2003, pp. 12-14. \nSambamurthy, V., Bharadwaj, A. and Grover, V. “Shaping Agility through Digital Options: \nReconceptualizing the Role of Information Technology in Contemporary Firms” MIS Quarterly \n(27), 2003, pp.237-263.  \nSmith, W.K., and Tushman, M.L. \"Managing strategic contradictions: A top management model for \nmanaging innovation streams,\" Organisation Science (16:5) 2005. \nTraweek, S. Beamtimes and Lifetimes: The World of High Energy Physicists, Harvard University \n  28 \nPress, London, 1988. \nTruex, D., Baskerville, R. and Travis J. \"Amethodical Systems Development: The Deferred Meaning \nof Systems Development Methods,\" Accounting, Management and Information Technology \n(10), 2000, pp. 53-79. \nTruex, D.P., and Baskerville, R. \"Deep Structure or Emergence Theory: Contrasting Theoretical \nFoundations for Information Systems Development,\" Information Systems Journal (8), 1998, pp. \n99-118. \nTuomi, I \"Networks of Innovation\", Oxford University Press, Oxford, 2002. \nTuomi, I \"The Future of Open Source\". In Wynants, M. and Cornelis, J (eds) \"How Open is the \nFuture?\", VUB Brussels University Press, Brussels, pp. 429-459, 2005. \nVenters, W., and Cornford, T. \"Introducing Pegasus: An Ethnographic Research Project Studying the \nUse of Grid Technologies by the UK Particle Physics Community,\" Proceedings of the National \ne-Science Center Conference, Manchester, 2006.  \nWade, M., and Hulland, J. \"The Resource Based View and Information Systems Research: Review, \nExtension and Suggestions for Future Research\". MIS Quarterly, (28:1), 2004, pp. 107-138. \nWeick, K.E. \"Enactment Processes in Organisations,\" In Making Sense of the Organisation, K. E. \nWeick (ed.) Blackwell, 1977.  \nWeick, K.E. \"The Collapse of Sensemaking in Organisations: The Mann Gulch Disaster,\" \nAdministrative Science Quarterly (38), 1993a, pp. 628-652. \nWeick, K.E. \"Organisational Redesign as Improvisation,\" In Organisational Change and Redesign: \nIdeas and Insights for Improving Performance, G. P. Huber and W. H. Glick (eds.), Oxford \nUniversity Press, New York, 1993b, pp. 346-379. \nWeick, K.E. \"Improvisation as a Mindset for Organisational Analysis,\" Organisation Science (9:5), \n1998, pp. 543-555. \nWeick, K.E. \"The Aesthetic of Imperfection in Orchestras and Organisations,\" in: Readings in \nOrganisation Science, M.P. Cunha and C.A. Marques (eds.), ISPA., Lisbon, 1999. \nWeick, K.E. \"Enactment Processes in Organisations,\" In Making Sense of the Organization, K. E. \nWeick (ed.) Blackwell, Malden, MA, 2001. \nWeick, K.E., and Roberts, K.H. \"Collective Mind in Organisations: Heedful Interrelating on Flight \nDecks,\" Administrative Science Quarterly (38), 1993, pp. 357-381. \nWeick, K. E. Sutcliffe, K. M. Obstfeld, D. \"Organising and the Process of Sensemaking,\" \nOrganisation Science (16:4), 1999, pp. 409-421 \nWilliams, L., and Cockburn, A. \"Agile Software Development: It's About Feedback and Change,\" \nIEEE (June), 2003.  \n  29 \nParadoxes of Learning \n \nImmediate Historic \nLearned \nImprovisation \nenvironmental turbulence (Moorman and Miner, \n1998, Ciborra, 1996) \ntask uncertainty (Miner et al., 2001)  \ntask complexity (Hutchins, 1995, Weick and \nRoberts, 1993) \n \n \norganizational memory (Ackerman and \nHalverson, 1998; Moorman and Miner, 1998; \nWeick, 1998) \nRoutines (Hutchins, 1995, Weick and Roberts, \n1993) \nPracticing (Moorman and Miner, 1998; Weick, \n1998) \n \nSpontaneity Reflexivity \nReflective \nSpontaneity \nconvergence of planning and execution \n(Moorman and Miner, 1998)  \ndrop your tools (Weick, 1993a) \ntrial and error, bricolage (Lanzara, 1999) \nretrospective sense-making (Weick, 1993b) \nex-post interpretation (Lanzara, 1999)  \ntransient constructs (Lanzara, 1999)  \n \nParadoxes of Organizing \n Unfolding Planning \nPlanned Agility “unfolding ontology” (Knorr-Cetina, 1999) \n“unfolding circumstances” (Ciborra, 1999) \n“the spontaneous” (Weick, 1998) \ndrifting (Ciborra, et al., 2000),  \nflow (Hatch, 1999) \nvisions (Hatch, 1999, Mintzberg and McHugh, \n1985, Hutchins, 1991, Weick, 1993b) \nplan to improvise (Miner et al., 2001) \nartful planning (Baskerville, 2006) \na sense of urgency (Crossan, 1998, Hutchins, \n1991, Mirvis, 1998) \n \n Practices Structure \nStructured \nChaos \norganized anarchy (Cohen et al., 1972) \nknowing in practice (Orlikowski, 2000) \nfractures, discoutinuities, inconsistencies \n(Lanzara, 1999) \nambiguity (Hatch, 1999) \n \n \nminimal structure (Cunha et al., 1999) \ncollateral structure (Cunha et al., 1999) \naesthetic of imperfection (Weick, 1999) \n“experimental culture” (Cunha et al., 1999) \npro-innovation culture (Miner, et al., 2001; \nMirvis, 1998; Weick, 1998) \nParadoxes of Belonging \n Individuals Collectivity \nCollective \nIndividuality \nindividual skills (Brown and Duguid, 1991; \nMirvis, 1998) \ncreativity (Barrett, 1998; Hatch, 1999; Kamoche, \net al., 2003) \n \ngroup cohesion (Hutchins, 1995; Weick and \nRoberts, 1993) \nfacilitative leadership (Crossan, 1998)  \ntrust and kinship (Crossan, 1998, Weick, \n1993a)  \nfluid communication (Orlikowski, 1996, Miner \net al., 2001) \n Anxiety \nanxiety (Cunha, et al., 1999; Mirvis, 1998) \nmoods (Ciborra, 2001) \nemotionality (Hatch, 1999) \nsense of urgency (Crossan, 1998, Hutchins, 1991, \nMirvis, 1998)  \nConfidence \nindividual skills (Brown and Duguid, 1991; \nMirvis, 1998) \naesthetic of imperfection (Weick, 1999) \nprideful wariness (LaPorte 1996) \nAnxious \nConfidence \nTable 1. Tensions and Paradoxes in Organizational Improvisation \n  \n  30 \n \nResearch Methods Examples Data Collection \nSemi-structured interviews Members of GridPP, middleware developers, \nmembers of LCG at CERN, physicist users… \nAudio-recorded, \ntranscribed, coded \nParticipant \nobservations  \nVirtual \nmeetings \nweekly GridPP PMB meetings  \nweekly deployment team meetings \nAudio-recorded, notes \ntaken, not transcribed \nFace-to-face \nmeetings \nGridPP collaboration meetings, PMB face-to-face \nmeetings, deployment team face-to-face meetings,  \nMany audio-recorded, \nnotes taken, not \ntranscribed \nSite visits GridPP site readiness review Notes taken \nSecondary data GridPP publications, GridPP documents, GridPP \nwebsite, wiki, blogs, mailing lists Frequent consultation \nTable 2. Details of research activities.  \n  \nRoles of Interviewees Number Notes \nGridPP PMB members 12 Including project leaders, representatives of all other major boards, and liaisons with other partners. \nGridPP technical experts 15 e.g. Tier 1 manager, Tier 2 manager, technical coordinator, deployment, sys-admins, other software developers \nActive physicists 9 Often overlapping with other roles \nMiddleware developers 5 Based in the UK and CERN \nLCG technical experts 11 e.g. LCG Grid deployment, experiment integrator, other \nsoftware developers \nTable 3. Details of interviews. \n  \n  31 \nQuotations Interviewee Codes \n \nI’m trying not to use the word senior to imply there’s a real hierarchy. I \nmean people get promoted to be professor or whatever but it really hasn’t \nnothing to do with the way it works, okay? That’s internal to the university. \nSo um, those people that you know, formally might seem more senior, this is \nrelevant, their peers with people like [XXXX] and you know, really rely on \npeople like that to make it work technically. So they’re fully trusted to just \nget on with it in the deployment board. Okay? So it’s a fairly flat structure \nreally. There’s no, there’s no company-like structure of management board \nsets policy and another group sets something else and then you know, down \nthe bottom, people do what they’re told. It’s nothing like that at all.  \n \nSo I was going to come at it from the physicists' point of view to start with \nbecause it's very important for the physicists because there's so many things \nthat they have to do in order to be able to interpret something that's been true \nin the data, that they have to trust what other people have done. And this is \neven more so when you have such big detectors as the LHC ones. \n \nAnd if you go into these big bang mode where it takes you two years to put \nthis into production, particularly in a community which is as unstable as this \nis, as uncertain as this is, where changing the beam, which is something \ntotally out of our control, can have implications everywhere, this is not the \nright policy. And you have to be much more agile in the trends in software \nengineering and agile in programming, and I am sure you know all about \nthat. And here you do have to do that. \n \nMember of \nProject \nManagement \nBoard  \n \n \n \n \n \n \n \nGridPP \ntechnical \nexpert (based \nin the UK) \n \n \nLCG \ntechnical \nexpert (based \nat CERN) \n \n[collaboration] \n[democratic \nmeritocracy] \n[flat structure] \n[mutual respect]  \n  \n \n \n \n \n \n[trust] \n[PP history and \nculture] \n \n \n \n[agility] \n[pragmatism] \nTable 4. Example of quotations and coding   \n  32 \nShort cycle time \nsystem development  \nCompared to system development practices \nin our case \nOrganizational Implications \nCauses:  \nVague requirement  \nLack of experience \nTime pressure \n \n \nYes. Vague requirements because it involves \nnew technology and new experiments. \nYes \nYes  \nOther causes:  \nFaced with enormous uncertainties and \nenvironmental turbulence. \nScale \nExisting culture of the particle physics \ncommunity favours exploration, trial-and-error, \nand bricolage. \nA collective attitude to deal with \nuncertainty and ambiguity; \nCapability of organizational \nlearning; \n \nCapability to work under great \npressure; \nDistributed management \nDrawing upon organizational \nmemories \nSystem development practices:   \nPrototyping Yes. “rapid prototyping” \nResult: documentation can’t catch up with the \nspeed of changes.  \nExploration, spontaneity \nRelease orientation Yes, “fast development”, “nightly build” and \n“monthly release” \nIncremental changes \nTailored methods Yes, or no explicit use of methodology or \nmethods. \nFlexibility \nCoding your way out Yes, “hacking” Pragmatism \nParallel development Yes Coordination, negotiation, \npersuasion \nFixed architecture No. Driven by user requirements, which also \nevolve. \nA common goal and shared vision \nComponents based \ndevelopment and use \nYes. Particularly necessary due to the \ndistributed model.  \nCoordination  \nTool dependence Yes but mostly self-developed.  \nDependence on good \npeople \nYes, very much so. Democratic meritocracy, weak \nauthority, high autonomy \nCustomer involvement Yes. Power users use and test the system from \nvery early on. The experiments develop \napplications to run on the Grid, with heavy \ninteractions. Developers select power users as \nguinea pigs, and cultivate their user \ncommunities.  \nLearning, community building, \ninformal communications \nMaintenance ignored No, but it is problematic.   \nQuality is negotiable Yes “Aesthetics of imperfection”, \npragmatism \n Other practices: \nParallel solutions competing against each other. \n \nFederated structure \nTable 5 Comparing characteristics of systems development practices with those of “short cycle time \nsystem development” presented by Baskerville and Pries-Heje (2004). \n  \n  33 \n \n \nIndividuality \n- Intelligence \n- Autonomous \n- Freedom at work \n- Improvisation \nCollective Individuality \nCommunity bonds among free-\nthinking individuals \nCollectivity \n- Shared goal of physics \n- Emphasis on hanging out \n- Facilitative leadership \n- High level of trust \n- Hanging out \n \nAnxiety \n- Uncertainties \n- Unreliable software \n- Pressure from CERN and from \nusers \n- Funding shortage \nAnxious Confidence \nConfidence as a \ncapability to handle \nanxiety \nConfidence \n- Cleverness \n- “It will work” \n- History\/organizational memory \n- Aesthetic of imperfection \nTable 6 Paradoxes of belonging in GridPP \n \nUnfolding \n- Adhocracy \n- Constant changes and adaptation \n- Exploration \n- Flux \nPlanned Agility  \nPlanning to improvise; \npreparing for changes \nPlanning \n- Common goal\/shared vision \n- Memorandum of Understanding \n- Deliverables \n- Milestones \n- Project map \n- Quarterly reports \nPractices \n- Bottom-up approach \n- Competition \n- Democratic discussions \n- Natural selection of parallel \ntechnical solutions  \n- Transparency \nStructured Chaos \nProviding minimal \nstructure to support \nimprovisation \nStructure \n- Charismatic leadership \n- Collateral structure \n- Limited hierarchical command or \nauthoritative management \n \n Table 7 Paradoxes of organizing in GridPP \n  34 \n \n \nEnvironment\/Present \n- Complexity of the Grid (multiple \nGrids, multiple groups of users) \n- Technological uncertainties \n- Time constraints (pressure of speed) \nLearned Improvisation \nDrawing upon past experience \nto handle uncertainties & \ncomplexities of the present \nHistory\/Culture \n- Pragmatic approach \n- Computing expertise\/successes in PP  \n- Tradition of distributed collaboration \nin experiments \n \nSpontaneity \n- Agility \n- Fast, incremental changes \n- Short cycle development \n- Trial and error \n \nReflective Spontaneity \nRecovering meaning from \nactions retrospectively \nReflexivity\/Learning \n- Active informal face-to-face \ncommunication \n- Mailing lists, blogs, wiki,  \n- Frequent multiple meetings, on site and \nvirtual \n- Testing and monitoring \nTable 8: Paradoxes of learning in GridPP \n \n \n \n- Draw upon past experience to handle new tasks; \n- Continuous reflection and learning; \n- Extensive communications within and between different groups, with an emphasis on face-to-face \ninformal communication; \n- Work with power users; cultivate user communities; \n- Project leader articulates clear vision and shared goals; \n- Use high level milestones and deliverables to create momentum, but be ready to change them; \n- Share knowledge by mailing lists, wiki, blogs, etc; \n- Cultivate community bonding and shared identity; \n- Develop trust, loyalty and mutual support; \n- Motivate and rely on good people; \n- Maintain high level of transparency within the project; \n- Allow mistakes and unsuccessful explorations; \n- Allow parallel solutions to compete with each other when resources permit; it might be a faster and safer \nway of achieving a goal. \nTable 9. Key organisational practices in GridPP \n  35 \n \n \n \nProject  \nManagement  \nBoard \nOversight  \nCommittee  \nCollaboration  \nBoard \n(Institutes) \nDeployment  \nBoard \nUser Board \n(Experiments) \nProvision Utilisation \nReview \nAction \nDeployment \nTeam \nTier-1 Board \nTier-2 Board \n Figure 2. Organizational chart of GridPP (Adapted graph from the GridPP website) \nArrows: formal communication \nchannels.  \nDotted line arrows: occasional formal \ncommunications \n Scot  France \n… \nLondon Tier2 \nDurham \nTier 0 \nTier 1 \nNational centres \nTier 2 \nRegional groups \nTier 3 \nInstitutes \nCERN Computer Centre \nScotGrid NorthGrid SouthGrid \nItaly USA \nEdinburgh \nGermany \nFigure 1. Infrastructure of LCG (Including GridPP) \nGridPP \nGlasgow \nRAL,UK \n"}