{"doi":"10.1080\/0020717042000297199","coreId":"196087","oai":"oai:lra.le.ac.uk:2381\/8250","identifiers":["oai:lra.le.ac.uk:2381\/8250","10.1080\/0020717042000297199"],"title":"Nonlinear regulation in constrained input discrete-time linear systems","authors":["Turner, Matthew C.","Postlethwaite, Ian"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-10","abstract":"The use of composite linear and non-linear feedback laws for the control of constrained input discrete-time linear systems is re-examined. By making use of the delta operator formulation of a discrete-time system, an apparent restriction on the magnitude of the non-linear control law is removed, and the similarities between the continuous and discrete-time solutions to the problem are elucidated. In order to develop the results, unconstrained systems are treated initially, but it is shown that, locally, the sufficient conditions for the stabilization of such systems are actually equivalent to those for the stabilization of the corresponding constrained systems","downloadUrl":"http:\/\/www.informaworld.com\/smpp\/content~db=all?content=10.1080\/0020717042000297199.","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/8250\/3\/delta_rev.pdf","pdfHashValue":"f3fa42d9079851628b9c8496585a993ed80ff4de","publisher":"Taylor & Francis","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/8250<\/identifier><datestamp>\n                2016-01-05T09:28:33Z<\/datestamp><setSpec>\n                com_2381_171<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_835<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nNonlinear regulation in constrained input discrete-time linear systems<\/dc:title><dc:creator>\nTurner, Matthew C.<\/dc:creator><dc:creator>\nPostlethwaite, Ian<\/dc:creator><dc:description>\nThe use of composite linear and non-linear feedback laws for the control of constrained input discrete-time linear systems is re-examined. By making use of the delta operator formulation of a discrete-time system, an apparent restriction on the magnitude of the non-linear control law is removed, and the similarities between the continuous and discrete-time solutions to the problem are elucidated. In order to develop the results, unconstrained systems are treated initially, but it is shown that, locally, the sufficient conditions for the stabilization of such systems are actually equivalent to those for the stabilization of the corresponding constrained systems.<\/dc:description><dc:date>\n2010-07-19T15:25:37Z<\/dc:date><dc:date>\n2010-07-19T15:25:37Z<\/dc:date><dc:date>\n2004-10<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nInternational Journal of Control, 2004, 77 (15), pp. 1330-1342.<\/dc:identifier><dc:identifier>\n0020-7179<\/dc:identifier><dc:identifier>\nhttp:\/\/www.tandfonline.com\/doi\/abs\/10.1080\/0020717042000297199<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/8250<\/dc:identifier><dc:identifier>\n10.1080\/0020717042000297199<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\nThis is the author's final draft of the paper  published as International Journal of Control, 2004, 77 (15), pp. 1330-1342.  The final version is available from http:\/\/www.informaworld.com\/smpp\/content~db=all?content=10.1080\/0020717042000297199.  Doi: 10.1080\/0020717042000297199<\/dc:rights><dc:publisher>\nTaylor & Francis<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["0020-7179","issn:0020-7179"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2004,"topics":[],"subject":["Article"],"fullText":"Nonlinear Regulation in Constrained Input Discrete-time Linear\nSystems\nMatthew C. Turner\n\u0000\nI. Postlethwaite †\nDept. of Engineering, University of Leicester, Leicester, LE1 7RH, U.K.\nAugust 3, 2004\nAbstract\nThe use of composite linear and nonlinear feedback laws for the control of constrained input discrete-\ntime linear systems is re-examined. By making use of the delta operator formulation of a discrete-time\nsystem, an apparent restriction on the magnitude of the nonlinear control law is removed, and the similarities\nbetween the continuous and discrete-time solutions to the problem are elucidated. In order to develop the\nresults, unconstrained systems are treated initially, but it is shown that, locally, the sufficient conditions for\nthe stabilisation of such systems are actually equivalent to those for the stabilisation of the corresponding\nconstrained systems.\n1 Introduction\nSeveral recent papers have discussed the use of novel and\/or nonlinear feedback control to improve performance\nin systems which are, apart from a saturation element at their input, otherwise linear. One of the first of these\nwas a piecewise linear LQ control law proposed by Wredenhagen & Belanger (1994), which used a piecewise\nlinear state-feedback to increase the feedback gain as the system state approached the origin. This was extended\nby De Dona et al. (2000) who allowed the control law to saturate to reduce conservatism in the design. Another,\nmore popular, technique is that of anti-windup, where a compensator specifically designed to counteract the\nphenomena of saturation becomes active when the control signal starts to saturate. In addition to these methods\nis the low-and-high gain technique, which built upon the work of the low-gain technique (Lin & Saberi (1993))\nto improve performance in saturated systems, without compromising stability.\nBy the end of the 1990’s the low-and-high gain technique, which was introduced in Lin & Saberi (1995) for the\ncontrol of an n’th order integrator chain, was well established as a technique for controlling systems subject to\n\u0001\nAuthor to whom correspondance should be addressed. Tel.: +44 (0)116 2522548, E-mail: mct6@sun.engg.le.ac.uk\n†Tel.: +44 (0)116 2522547, E-mail: IXP@le.ac.uk\n1\n2control constraints. In Saberi et al. (1996) it was demonsrated that such a control strategy could be used to ensure\nsemi-global asymptotic stability in globally null controllable 1 continuous-time systems; in Lin et al. (1998) the\nmethod was extended to allow tracking objectives to be incorporated into the control law; and, more recently\nin Lin et al. (2000), the technique was extended to discrete-time systems. One of the appealing aspects of this\ntechnique was that the control law was simple to construct and was, commonly, purely linear.\nIn Lin et al. (1998) a nonlinear control law was advocated for performance improvement in constrained input\nsecond order linear systems. The idea was similar to that used in low-and-high gain control, except that to\nthe linear low gain constituent of the control law was added a nonlinear control law, instead of a linear high\ngain control law. This had the advantage of ensuring that the damping ratio of the closed loop system tended,\nasymptotically, to zero. This methodology was extended in Turner et al. (2000) to multivariable systems of\narbitrary order. At about the same time, Lin et al. (2000) proposed a nonlinear control law for discrete-time\nlinear systems, which could prove semi-global stabilisation (for globally null controllable systems) and account\nfor tracking objectives in a given exo-system. In addition, recent work on observer-based synthesis of composite\nnonlinear control laws and their application to hard-disk servo systems has been contributed by Chen et al.\n(2003).\nHowever, although the approach given in Lin et al. (2000) was correct and rigorous it seemed to have mild\ndeficiencies in two areas:\n1. Strangely, the choice of the high gain control was restricted to be bounded by two i.e. ρ \u0000\u0002\u0001 0 \u0003 2 \u0004 . In the\ncorresponding papers of Lin et al. (1998) and Turner et al. (2000), the only restrictions of ρ \u0005 ρ \u0006 x \u0003 t \u0007 was\nthat it be locally Lipschitz in x and piecewise continuous in t (For the tracking case, as discussed in Turner\net al. (2000), it must also be uniformly bounded) to ensure existence of solutions. In other words, for\nthe discrete time version, the nonlinear control was bounded by 2; in the continuous time versions of the\nformulae it was free to be chosen arbitrarily large.\n2. No link was made between the sampling period and the nonlinear control law. In practice this could be\nuseful to the control engineer.\nIn this paper, we show how to remove the above “restriction” 2 by using the delta operator formulation of discrete\ntime systems, and we also address point 1 by discussing some possible selections of the nonlinear control law.\nFurthermore, due to the advantage of the delta operator unifying many continuous and discrete results, we are\nable to prove that the discrete time results will reduce to those of the continuous time results as the sampling\n1A continuous time linear system is described as being globally null controllable if it is stabilisable and all of its eigenvalues are\nlocated in the closed left-half complex plane; a discrete time linear system is globally null controllable if it is stabilisable and all of its\neigenvalues are located within the closed unit circle in the complex plane.\n2This restriction is only ‘apparent’ because it arises from the shift operator formulation of the problem; it is not any intrinsic property.\n3frequency approaches infinity. Interestingly, but perhaps not surprisingly, the sampling period is central to the\nallowable class of nonlinear control laws which are guaranteed to achieve stabilisation, which addresses point 2.\nThe paper is organised as follows. In section 2 we introduce the class of systems which we consider and collect\nsome relevant results from the theory of delta operators. Section 3 presents some results for unconstrained sys-\ntems, that is systems without a saturation on the control, which are useful as a primer for the constrained results\npresented in Section 4. Section 5 complements the earlier results by discussing observer based implementations\nof the state-feedback results.The results of the paper are demonstrated on a simple example is Section 6 and in\nsection 7 we offer our conclusions.\n2 Problem Formulation\n2.1 Systems under consideration\nThe main system we consider is the following finite dimensional linear time invariant system\nδx \u0005 Ax \u0000 Bsat \u0006 u \u0007 \u0003 A \u0000\u0002\u0001 n \u0003 n \u0003 B \u0000\u0004\u0001 n \u0003 m (1)\nwhere x \u0000\u0004\u0001 n is the state vector and u \u0000\u0002\u0001 m is the control input. Throughout the paper it is assumed that \u0006 A \u0003 B \u0007\nis stabilisable. The saturation function is defined as\nsat \u0006 u \u0007 \u0005\n\u0005\u0006\n\u0006\n\u0006\n\u0006\n\u0006\n\u0006\n\u0007\nsat1 \u0006 u1 \u0007\nsat2 \u0006 u2 \u0007\n.\n.\n.\nsatm \u0006 um \u0007\n\b\n\t\n\t\n\t\n\t\n\t\n\t\n\u000b\n(2)\nwhere sati \u0006 ui \u0007 \u0005 sign \u0006 ui \u0007 min \f\u000e\r ui \r \u0003 u¯i \u000f . Defining the compact set\n\u0010\n: \u0005\u0011\f u : \r u \r\u0013\u0012 u¯\n\u000f\n(3)\nwhere \r\u0015\u0014\u0016\r denotes componentwise magnitude and \u0012 denotes compenentwise inequality, we have that sat \u0006 u \u0007 \u0005\nu \u0003\u0018\u0017 u\n\u0000\n\u0010\n.\nThe operator δx is defined, as usual, by\nδx : \u0005\u001a\u0019\nffflfi\nx ffi t \u001f ∆  \"! x ffi t  \n∆ if ∆ # 0\nx˙ if ∆ \u0005 0\n(4)\n4where ∆ \u0000 0 is the sample period. Obviously as ∆ approaches zero, we recover the continuous time results. It is\ntrivial to verify that the delta-operator system (1) can be expressed as the shift-operator system\nx \u0006 k \u0000 1 \u0007 \u0005 \u0006 I \u0000 ∆A \u0007 x \u0006 k \u0007 \u0000 ∆Bsat \u0006 u \u0006 k \u0007 \u0007 (5)\nwhere k \u0005 t∆. As noted by many authors (see for example, Middleton & Goodwin (1990)), the delta operator\noften provides superior numerical properties, particularly for high order systems and high sampling rates, and\nunifies continuous and discrete results.\n2.2 Stability for Systems described using the Delta Operator\nA good reference for this subject is the book by Middleton & Goodwin (1990) (see particularly Chapter 8),\nbut here we expand on some of the definitions given there to accommodate the local and global stabilisation\nproblems we consider in this paper. Consider the, possibly nonlinear, system\nδx \u0005 f \u0006 x \u0003 t \u0007 \u0003 x \u0006 0 \u0007 \u0005 x0 \u0003 x \u0000\u0004\u0001 n \u0003 f \u0006 0 \u0003 t \u0007 \u0005 0 (6)\nDefinition 1 (Asymptotic stability) The system (6) is said to be locally asymptotically stable if x \u0006 t \u0007\u0002\u0001 0 as\nt \u0001 ∞ for all x0 \u0000\u0004\u0003 \u0005 \u0001 n . If \u0003 \u0005 \u0001 n then it is said to be globally asymptotically stable.\nDefinition 2 (Exponential Stability) The system (6) is said to be locally exponentially stable if there exist pos-\ntive scalars, µ and ν , such that \u0006 x \u0006 t \u0007 \u0006\u0002\b µe ! νt \u0006 x0 \u0006 for all x0 \u0000\t\u0003 \u0005 \u0001 n and all t # 0. If \u0003 \u0005 \u0001 n then it is said\nto be globally exponentially stable.\nSemi-global stabilisation, which is not explicitly addressed in this paper, is achieved when \u0003 can be chosen\narbitrarily large, but not equal to \u0001 n .\nDefinition 3 (Lyapunov Stability) The system (6) is said to be locally Lyapunov stable if there exists some\nfunction V \u0006 x \u0003 t \u0007 # 0 such that δV \u0006 x \u0003 t \u0007\u0002\b 0, for all x \u0000\n\u0003 \u0005 \u0001 n . If \u0003 \u0005 \u0001 n , the system is described as being\nglobally Lyapunov stable. Furthermore, if δV \u0006 x \u0003 t \u0007\f\u000b 0 , it is asymptotically stable.\nWe would like to give conditions under which the stronger form of stability, namely exponential stability, can\nbe proved for δ -operator systems. These are well-known for continuous time systems; here we present a lemma\nwhich proves the same conditions are valid for δ -operator discrete time systems.\nLemma 1 Consider the system (6) and assume that there exists a Lyapunov function, V \u0006 x \u0007 # 0 and postive\nscalars µi, such that\nµ1 \u0006 x \u0006 2 \b V \u0006 x \u0007\r\b µ2 \u0006 x \u0006 2 \u0003 \u0017 x\n\u0000\u000e\u0003 (7)\nδV \u0006 x \u0007\r\b\u0010\u000f µ3 \u0006 x \u0006 2 \u0003 \u0017 x\n\u0000\u000e\u0003 (8)\n5then the origin of the system (6) is locally exponentially stable, with domain of attraction \u0003 .\nProof:. The proof is given in the appendix as it closely follows the continuous time proof and the details are not\nof central interest to the paper. \u0000\u0001\u0000\n2.3 Modified Lyapunov Equations\nFor continuous time systems, the standard Lyapunov equation is described by\nLc \u0006 P \u0007 : A \u0002 P \u0000 PA \u0005 \u000f Q \u000b 0 (9)\nIf A is Hurwitz stable and Q # 0, equation (9) will have a unique postive definite solution, P # 0. Such an\nequation arises from studying the stability of the origin of the system x˙ \u0005 Ax, and is obtained by evaluating the\nbehaviour of the time derivative of V \u0006 x \u0007 : \u0005 x\n\u0002\nPx along the trajectories of the system. The necessary and sufficient\ncondition for stability is that ˙V \u0006 x \u0007 \u0005 x\n\u0002\n\u0006 A\n\u0002\nP \u0000 PA \u0007 x \u000b 0.\nWhen considering the stability of the origin of the system δx \u0005 f \u0006 x \u0007 a slightly modified Lyapunov method is\nused. For some positive definite function V \u0006 x \u0007 # 0 we require that the δV \u0006 x \u0007 \u000b 0. For the system δx \u0005 Ax a\nnecessary and sufficient condition for this is that, for the function V \u0006 x \u0007 \u0005 x\n\u0002\nPx # 0 we have\nδV \u0006 x \u0007 \u0005\n\u0001\nx \u0006 t \u0000 ∆ \u0007 \u0004\n\u0002\nP \u0001 x \u0006 t \u0000 ∆ \u0007 \u0004 \u000f x \u0006 t \u0007\n\u0002\nPx \u0006 t \u0007\n∆\n(10)\n\u0005\n\u0001\nx \u0006 t \u0000 ∆ \u0007 \u000f x \u0006 t \u0007 \u0004\n\u0002\nP \u0001 x \u0006 t \u0000 ∆ \u0007 \u000f x \u0006 t \u0007 \u0004 \u0000 2 \u0001 x \u0006 t \u0000 ∆ \u0007 \u000f x \u0006 t \u0007 \u0004\n\u0002\nPx \u0006 t \u0007\n∆ (11)\n\u0005 δx \u0006 t \u0007 \u0002 P∆δx \u0006 t \u0007 \u0000 2δx \u0006 t \u0007 \u0002 Px \u0006 t \u0007 (12)\n\u000b 0 (13)\nSubstituting for δx \u0006 t \u0007 , for the system δx \u0005 Ax, this condition becomes\nδV \u0006 x \u0007 \u0005 x \u0002 \u0006 A \u0002 P \u0000 PA \u0000 ∆A \u0002 PA \u0007 x \u000b 0 (14)\nSo the stability of the system δx \u0005 Ax reduces to whether we can find a positive definite solution to the modified\nLyapunov equation\nLd \u0006 P \u0007 : \u0005 A \u0002 P \u0000 PA \u0000 ∆A \u0002PA \u0005 \u000f Q \u000b 0 (15)\nNote that as the sampling frequency approaches infinity we have Ld \u0006 P \u0007 \u0001 Lc \u0006 P \u0007 . As pointed out in Middleton\n& Goodwin (1990), a unique positive definite solution to equation (15) exists if and only if the eigenvalues, λ i,\nof A satisfy\n6∆\n2\n\r λi \r 2 \u0000 ℜ \u0006 λi \u0007 \u000b 0 (16)\nor, equivalently, that the matrix\n\u0006 I \u000f\n∆\n2\nA \u0007 ! 1A (17)\nis Hurwitz. These are precisely the conditions required for a discrete-time linear system in delta-operator form to\nbe asymptotically (equivalently, exponentially) stable. Thus if A is described as ‘stable’ we will take it to mean\nthat the conditions (16) and (17) hold, and, equivalently, that for some Q # 0 there exists a P # 0 which satisfies\nthe modified Lyapunov equation (15). Note that we cannot call A ‘Hurwitz’ or ‘Schur’ as the δ -operator stability\nis a hybrid of continuous and shift-operator stability.\n3 Unconstrained Nonlinear Control\nWe consider the system (1) except we assume that the saturation function has been replaced with the identity\noperator, i.e.\nδx \u0005 Ax \u0000 Bu \u0003 A \u0000 \u0001 n \u0003 n \u0003 B \u0000\u0004\u0001 n \u0003 m (18)\nAs in the nonlinear control strategy of Lin et al. (1998) and Turner et al. (2000) we consider combining a linear\ncontrol, uL with a nonlinear control uN , viz\nu \u0005 uL \u0000 uN (19)\nwhere uL \u0005 Fx has been designed such that ˜A : \u0005 A \u0000 BF is stable in the sense that, for some Q # 0, there exists\na unique positive definite solution, P # 0, to the modified Lyapunov equation\n˜A \u0002 P \u0000 P ˜A \u0000 ∆ ˜A \u0002 P ˜A \u0005 \u000f Q (20)\nWe then construct the nonlinear portion of the control law as\nuN \u0005 \u000f ρ \u0006 x \u0003 t \u0007 B \u0002 P \u0006 I \u0000 ∆ ˜A \u0007 x (21)\nwhere ρ \u0006 x \u0003 t \u0007 \u0000 0 is some well-defined function which ensures that solutions to the dynamic equations (18) exist\nwith control law (19) applied. In practice, a function with a locally Lipschitz-like growth condition in x can be\n7used. To be precise, we call ρ \u0006 \u0014 \u0007 well-defined whenever it ensures that a unique solution exists to the appropriate\nfeedback equations. The following is the main result of the section:\nTheorem 1 Consider the system (18) with the control law (19) applied. Assume that uL \u0005 Fx is such that\nequation (20) is satisfied and that uN is given by equation (21). Then the origin of (18) is globally exponentially\nstable for all well-defined ρ \u0006 x \u0003 t \u0007 such that\n0 \b ρ \u0006 x \u0003 t \u0007\f\b 2∆ \r \rB\n\u0002\nP \u0006 ∆ \u0007 B \r \r \u0003 \u0017 x \u0003 t (22)\nProof: Note that the system (18) with the control law (19) applied can be written as\nδx \u0005 ˜Ax \u000f ρ \u0006 x \u0003 t \u0007 BB \u0002 P \u0006 I \u0000 ∆ ˜A \u0007 x (23)\nNow consider V \u0006 x \u0007 \u0005 x\n\u0002\nPx # 0 and note that as this function is radially unbounded, if we can prove that δV \u0006 x \u0007 \b\n\u000f φ \u0006 x \u0006 2, for a positive scalar φ , we will have proved global exponential stability.\nFrom equation (12) we have that\nδV \u0006 x \u0007 \u0005 δx \u0006 t \u0007 \u0002 P∆δx \u0006 t \u0007 \u0000 2δx \u0006 t \u0007 \u0002 Px \u0006 t \u0007 (24)\nSubstituting for δx, we obtain\nδV \u0006 x \u0007 \u0005 x \u0002 \u0006 ˜A \u0002 P \u0000 P ˜A \u0000 ∆ ˜A \u0002 P ˜A \u0007 x \u000f ρ \u0006 x \u0003 t \u0007 x \u0002 \u0001B \u0002 P \u0006 I \u0000 ∆ ˜A \u0007 \u0004 \u0002 \u0001B \u0002 P \u0006 I \u0000 ∆ ˜A \u0007 \u0004 x\n\u0000 ∆ρ2 \u0006 x \u0003 t \u0007 \u0001 B \u0002 P \u0006 I \u0000 ∆ ˜A \u0007 \u0004 B \u0002 PB \u0001B \u0002 P \u0006 I \u0000 ∆ ˜A \u0007 \u0004 x (25)\n\u0005 x \u0002 \u0006 ˜A \u0002 P \u0000 P ˜A \u0000 ∆ ˜A \u0002 P ˜A \u0007 x\n\u0000 x \u0002\n\u0001B \u0002 P \u0006 I \u0000 ∆ ˜A \u0007 \u0004 \u0002 \u0006 \u000f 2ρ \u0006 x \u0003 t \u0007 I \u0000 ∆ρ2 \u0006 x \u0003 t \u0007 B \u0002 PB \u0007 \u0001B \u0002 P \u0006 I \u0000 ∆ ˜A \u0007 \u0004 x (26)\n\b \u000f λmin \u0006 Q \u0007 \u0006 x \u0006 2\n\u0000 x \u0002\n\u0001B \u0002 P \u0006 I \u0000 ∆ ˜A \u0007 \u0004 \u0002 \u0006 \u000f 2ρ \u0006 x \u0003 t \u0007 I \u0000 ∆ρ2 \u0006 x \u0003 t \u0007 B \u0002 PB \u0007 \u0001B \u0002 P \u0006 I \u0000 ∆ ˜A \u0007 \u0004 x (27)\nNote that a sufficient condition for δV \u0006 x \u0007\f\b \u000f φ \u0006 x \u0006 2 is that\n2ρ \u0006 x \u0003 t \u0007 \u0000 ∆ρ2 \u0006 x \u0003 t \u0007 B \u0002 PB \u0003 \u0017 x \u0003 t (28)\nwhich holds if\n82 \u0000 ∆ρ \u0006 x \u0003 t \u0007 \u0006 B \u0002 PB \u0006 \u0003 \u0017 x \u0003 t (29)\nwhich is precisely the condition given in the theorem.\n\u0000\u0001\u0000\n3.1 Relations with the continuous time result\nAlthough not stated explicitly in Lin et al. (1998) or Turner et al. (2000), it is easy to verify, in the case of a\ncontinuous time system\nx˙ \u0005 Ax \u0000 Bu (30)\nwhich results from letting ∆ \u0001 0, that a control law of the form (19), which ensures global exponential stability\nof the origin, only requires the following restriction on ρ \u0006 x \u0003 t \u0007 : it should be globally Lipschitz in x and piecewise\ncontinuous in t. This is required in order to guarantee existence and uniqueness of solutions and in fact is captured\nby our earlier assumption that “ρ \u0006 x \u0003 t \u0007 should be well-defined and must ensure that solutions to the differential\nequation (18) exist and are unique”. Thus ρ \u0006 x \u0003 t \u0007 can be arbitrarily large, in contrast to Theorem 1 which imposes\nanother condition, namely that \u0017 x \u0003 t, ρ \u0006 x \u0003 t \u0007 satisfies the bound in equation (22). This is somwhat less restricitve\nthan given in Lin et al. (2000) where ρ \u0006 x \u0003 t \u0007 \u0000 \u0001 0 \u0003 2 \u0004 , but it is still dependent on the sample period, ∆. We shall\nprove that as ∆ \u0001 0 this restriction is removed, that is, the discrete-time results approach the continuous time\nresults, but before we do that we need the following lemma\nLemma 2 Consider the modified Lyapunov equation\n˜A \u0002 P \u0006 ∆ \u0007\u000e\u0000 P \u0006 ∆ \u0007 ˜A \u0000 ∆ ˜A \u0002 P \u0006 ∆ \u0007 ˜A \u0005 \u000f Q (31)\nwhere \u0006 I \u0000 ∆2 ˜A \u0007\n! 1\n˜A is Hurwitz and Q # 0. Then P \u0006 ∆ \u0007 is a monotonically increasing function of ∆.\nProof: Differentiating equation (31) with respect to ∆ yields\n˜A \u0002\ndP\nd∆ \u0000\ndP\nd∆\n˜A \u0000 ∆ ˜A \u0002 dPd∆\n˜A \u0000 ˜A \u0002 P ˜A \u0005 0 (32)\nDefining P∆ : \u0005 dP \u0002 d∆ and rearranging we have\n˜A \u0002 P∆ \u0000 P∆ ˜A \u0000 ∆ ˜A \u0002 P∆ ˜A \u0005 \u000f ˜A \u0002 P ˜A \u000b 0 (33)\nUsing the transformation ¯A \u0005 \u0006 I \u0000 ∆2 ˜A \u0007\n! 1\n˜A this can be re-written as\n9¯A \u0002 P∆ \u0000 P∆ ¯A \u0005 \u000f ¯A \u0002 P ¯A (34)\nNow as we have assumed that ¯A is Hurwitz, it follows that P, the solution of (31) is positive definite. Hence the\nright hand side of (34) is negative definite. We know from the theory of Lyapunov equations (see Zhou et al.\n(1996), chapter 3) that as ¯A is Hurwitz and the right hand side is negative definite, the solution P∆ is unique and\npositive definite. This proves that P \u0006 ∆ \u0007 is monotonically increasing as a function of ∆.\n\u0000\u0001\u0000\nWe can now use Lemma 2 to prove the following corollary\nCorollary 1 Consider the system (18) under the same control as described in Theorem 1. Then the bound on\nρ \u0006 x \u0003 t \u0007 , which guarantees the system to be stable, is a monotonically decreasing function of the sampling period,\n∆. In the limit as ∆ \u0001 0 the system is globally exponentially stable for all well-defined ρ \u0006 x \u0003 t \u0007\f\u0000 0 \u0003 \u0017 x \u0003 t.\nProof: From Theorem 1 we have that the system is stable for all well-defined, postive ρ \u0006 x \u0003 t \u0007 such that\n0 \b ρ \u0006 x \u0003 t \u0007\f\b 2∆ \u0006 B\n\u0002\nP \u0006 ∆ \u0007 B \u0006 \u0003 \u0017 x \u0003 t (35)\nIf we can prove that the right hand side is a monotonically decreasing function of ∆ it will follow that the bound\non ρ \u0006 x \u0003 t \u0007 will become larger as ∆ becomes smaller (i.e. p \u0006 x \u0003 t \u0007 is a monotonically decreasing function of ∆).\nNote the right hand side will be monotonically decreasing as a function or ∆ if and only if\n∆ \u0006 B \u0002 P \u0006 ∆ \u0007 B \u0006 (36)\nis monotonically increasing as a function of ∆. A sufficient (but not necessary) condition for this is that P \u0006 ∆ \u0007 is\na monotonically non-decreasing function of ∆. Recall that we have assumed that \u0006 I \u0000 ∆2 ˜A \u0007\n! 1\n˜A is Hurwitz, so an\napplication of Lemma 2 proves that P \u0006 ∆ \u0007 is monotonically increasing. It is now straightforward to see that as ∆\napproaches zero, the bound on ρ \u0006 x \u0003 t \u0007 \u0000 0 becomes infinite. \u0000\u0001\u0000\nIn effect we have unified the continuous and discrete time results with this corollary: as the sampling frequency\napproaches infinity, the bound on the magnitude of ρ \u0006 x \u0003 t \u0007 disappears and we recover the continuous time results,\nwhere no bound is present. It is interesting to note the interplay between the magnitude of ρ \u0006 x \u0003 t \u0007 and the\nsampling period, which appears to be clearer with the delta operator than the shift operator. Consider the case\nwhen ρ \u0006 x \u0003 t \u0007 \u0005 ρ is a pure linear gain and hence the control law is completely linear. It is quite natural to expect\nthere to be limit on the magnitude of ρ , as too large a ρ would drive the eigenvalues of the closed-loop system\noutside the stability region. However, it is also obvious that this stability region enlarges as ∆ becomes smaller,\nmaking it clear that a larger value of ρ can be used for smaller sampling periods. See Figure 1.\n10\nImaginary\nReal\n1\/∆\nStability Region\n \nEffect of\ntoo large\nonρ\npoles\nFigure 1: Effect of sample period and large linear ρ on system stability\n4 Constrained Nonlinear Control\nWe next consider the original saturated class of systems, which motivated this work, as described in equation\n(1). Again we assume the control law applied is given by (19) with uL and uN given as in the previous section.\nThe control strategy is identical to the previous section and the system is the same with the exception of the\nsaturation nonlinearity at the plant input.\nWe make no assumptions about the location of the eigenvalues of the matrix, A, which necessarily forces our\nresults to be local, rather than global. It is well known for continuous time systems that only Hurwitz-stable\nsystems can be globally stabilised using linear control laws, although those systems with eigenvalues on the\nimaginary axis are able to be semi-globally stablised by linear control laws. Similar results are available for\ndiscrete-time systems. We choose to consider only local stabilisation as it does not restrict the location of the\nopen-loop system’s eigenvalues (global stabilisation is straightforward to prove and semi-global stabilisation is\nleft for future research). For some recent results on local stabilisation of constrained-input linear systems see,\nfor example, (Hu et al.2001) and (Gomes da Silva Jr & Tarbouriech2001).\nOur first result for constrained systems is given under an added restriction, although later we shall show how this\ncan be removed.\nTheorem 2 Consider the system (1) and the control law described in Theorem 1. Then the origin of (1) is locally\nexponentially stable in a domain \u0000 \u0005 \f x : x\n\u0002\nPx \b c\n\u000f\nfor all well-defined ρ \u0006 x \u0003 t \u0007 such that\n0 \b ρ \u0006 x \u0003 t \u0007\f\b min\n\u0001\n2γi\n∆αi \u0006 B \u0002 PB \u0006\n\u0003\n2\n∆ \u0006 B\n\u0002\nPB \u0006\u0003\u0002\n\u0003 \u0017 i \u0003 \u0017 x \u0003 t (37)\nwhere\n11\nγi : \u0005 uN \u0000 i (38)\nαi : \u0005 \u000f uL \u0000 i \u0000 sati \u0006 uL \u0000 uN \u0007 (39)\nand c is the largest positive scalar such that x \u0000 \u0000 \u0001 \rFx \r\u0013\u0012 u¯\nProof: First note that system 1 with the control (19) can be written as\nδx \u0005 ˜Ax \u0000 B \u0006 \u000f uL \u0000 sat \u0006 uL \u0000 uN \u0007 \u0007 (40)\nNext consider the Lyapunov function V \u0006 x \u0007 \u0005 x\n\u0002\nPx # 0 and δV \u0006 x \u0007 in the set \u0000 .\nδV \u0006 x \u0007 \u0005 δx \u0002 P∆δx \u0000 2δx \u0002 Px (41)\nIf we can prove for all x \u0000 \u0000 that δV \u0006 x \u0007\r\b \u000f φ \u0006 x \u0006 2 then, \u0000 will be positively invariant and the origin of (1) will\nbe locally exponentially stable. Substituting for δx in the above equation yields\nδV \u0006 x \u0007 \u0005 x \u0002 \u0006 ˜A \u0002 P \u0000 P ˜A \u0000 ∆ ˜A \u0002 P ˜A \u0007 x \u0000\n2x \u0002 \u0001B \u0002 P \u0006 I \u0000 ∆ ˜A \u0007 \u0004 \u0002 \u0001 \u000f uL \u0000 sat \u0006 uL \u0000 uN \u0007 \u0004 \u0000\n∆ \u0001 \u000f uL \u0000 sat \u0006 uL \u0000 uN \u0007 \u0004 \u0002 B \u0002 PB\n\u0001\n\u000f uL \u0000 sat \u0006 uL \u0000 uN \u0007 \u0004 (42)\n\b \u000f λmin \u0006 Q \u0007 \u0006 x \u0006 2 \u0000 2x \u0002 \u0001B \u0002 P \u0006 I \u0000 ∆ ˜A \u0007 \u0004 \u0002 \u0001 \u000f uL \u0000 sat \u0006 uL \u0000 uN \u0007 \u0004 \u0000\n∆ \u0006 B \u0002 PB \u0006 \u0001 \u000f uL \u0000 sat \u0006 uL \u0000 uN \u0007 \u0004 \u0002\n\u0001\n\u000f uL \u0000 sat \u0006 uL \u0000 uN \u0007 \u0004 (43)\nA sufficient condition for this to be negative definite arises if\n2x \u0002 \u0001 B \u0002 P \u0006 I \u0000 ∆ ˜A \u0007 \u0004 \u0002i\n\u0001\n\u000f uL \u0000 sat \u0006 uL \u0000 uN \u0007 \u0004 i \u0000 ∆ \u0006 B \u0002 PB \u0006\n\u0001\n\u000f uL \u0000 sat \u0006 uL \u0000 uN \u0007 \u0004 \u0002i\n\u0001\n\u000f uL \u0000 sat \u0006 uL \u0000 uN \u0007 \u0004 i \b 0 \u0003 \u0017 i (44)\nIt remains to prove that this is the case if the bound given in the theorem is met. As in Turner et al. (2000), define\nthe sets:\n\u0002\n: \u0005 \f i : \r ui \r \b u¯i\n\u000f\n(45)\n\u0003\n: \u0005 \f i : ui # u¯i\n\u000f\n(46)\n\u0004\n: \u0005 \f i : ui \u000b \u000f u¯i\n\u000f\n(47)\n12\nwhich correspond to the controls remaining unsaturated, becoming saturated at their upper limit and being satu-\nrated at their lower limit. First consider i \u0000\n\u0002\n. In this case, the analysis is carried out in exactly the same way\nas for the unconstrained case and we have that a sufficient condition for stability is that\nρ \u0006 x \u0003 t \u0007\r\b 2\n∆ \u0006 B\n\u0002\nPB \u0006\n(48)\nSecondly, asssume that i \u0000\n\u0003\n. This implies that\nsati \u0006 uL \u0000 uN \u0007 \u0005 u¯i\n\u0001\n\u000f uL \u0000 i \u0000 sati \u0006 uL \u0000 uN \u0007 \u0005 αi \u0000 0 (49)\nas \r uL \r \b u¯ in \u0000 . This fact also implies that, as sati \u0006 uL \u0000 uN \u0007 \u0005 u¯i, uN \u0000 i # 0. This in turn implies that\n\u000f ρ \u0006 x \u0003 t \u0007 \u0001B \u0002 P \u0006 I \u0000 ∆ ˜A \u0007 x \u0004 i \u0005 γi # 0\n\u0001\n\u0001B \u0002 P \u0006 I \u0000 ∆ ˜A \u0007 x \u0004 i \u0005 \u000f βi \b 0 (50)\nas ρ \u0006 x \u0003 t \u0007\r\u0000 0. This results in\n2x \u0002 \u0001B \u0002 P \u0006 I \u0000 ∆ ˜A \u0007 \u0004 \u0002i\n\u0001\n\u000f uL \u0000 sat \u0006 uL \u0000 uN \u0007 \u0004 i \u0000 ∆ \u0006 B \u0002 PB \u0006\n\u0001\n\u000f uL \u0000 sat \u0006 uL \u0000 uN \u0007 \u0004 \u0002i\n\u0001\n\u000f uL \u0000 sat \u0006 uL \u0000 uN \u0007 \u0004 i (51)\n\u0005 \u000f 2αiβi \u0000 α2i ∆ \u0006 B \u0002 PB \u0006 (52)\nfor all i \u0000\n\u0003\n. This is negative semi-definite if\n2βi \u0000 αi∆ \u0006 B \u0002 PB \u0006 (53)\nMultiplying by ρ \u0006 x \u0003 t \u0007 # 0 on both sides yields\n2ρ \u0006 x \u0003 t \u0007 βi \u0000 αiρ \u0006 x \u0003 t \u0007 ∆ \u0006 B \u0002 PB \u0006 (54)\nNoting that βiρ \u0006 x \u0003 t \u0007 \u0005 γi, this can be stated as the condition\nρ \u0006 x \u0003 t \u0007\r\b 2γi\n∆αi \u0006 B \u0002 PB \u0006\n(55)\nwhich is the bound given in the theorem. Exactly the same bound is obtained for i \u0000\n\u0004\n, with the derivation\nbeing carried out symmetrically to the above derivation for i \u0000\n\u0003\n. So, if we assume that the bound given in the\ntheorem is satisfied, it follows that\n13\n2x \u0002 \u0001 B \u0002 P \u0006 I \u0000 ∆ ˜A \u0007 \u0004 \u0002i\n\u0001\n\u000f uL \u0000 sat \u0006 uL \u0000 uN \u0007 \u0004 i \u0000 ∆ \u0006 B \u0002 PB \u0006\n\u0001\n\u000f uL \u0000 sat \u0006 uL \u0000 uN \u0007 \u0004 \u0002i\n\u0001\n\u000f uL \u0000 sat \u0006 uL \u0000 uN \u0007 \u0004 i \b 0\u0017 i\n\u0000\n\u0002\u0001\u0000 \u0003\u0002\u0000 \u0004\n(56)\nand hence δV \u0006 x \u0007 \b \u000f λmin \u0006 Q \u0007 \u0006 x \u0006 2 which implies postive invariance of \u0000 and local exponential stability of the\norigin of (1). \u0000\u0001\u0000\nWe shall now show that the conditions for local stability of the origin of (1) are in fact excatly the same as for\nglobal stabilty of the unconstrained case. To do this we have to prove that\nmin\n\u0001\n2γi\n∆αi \u0006 B \u0002 PB \u0006\n\u0003\n2\n∆ \u0006 B\n\u0002\nPB \u0006 \u0002\n\u0005\n2\n∆ \u0006 B\n\u0002\nPB \u0006\n(57)\nEssentially we must prove that γi \u0002 αi \u0000 1 \u0003 \u0017 i. The next lemma shows that this is indeed the case.\nLemma 3 Consider γi and αi as defined in Theorem 2. Then γi \u0002 αi \u0000 1 \u0003 \u0017 i.\nProof: Obviously we have that\nγi\nαi\n\u0000 1 \u0003 \u0017 i \u0003\nαi\nγi\n\b 1 \u0003 \u0017 i (58)\nBy the definitions of αi and γi, this holds if, and only if,\n\r \u000f uL \u0000 i \u0000 sati \u0006 uL \u0000 uN \u0007 \r \u000f \r uN \u0000 i \r \b 0 (59)\nWe now prove this is true for the three different cases\n1. For i \u0000\n\u0002\n, it is trivial to prove that αi \u0002 γi \b 1 \u0017 i\n\u0000\n\u0002\n.\n2. For i \u0000\n\u0003\n, first assume that\nsign \u0006 \u000f uL \u0000 i \u0007\u0005\u0004\u0005 sign \u0006 sati \u0006 uL \u0000 uN \u0007 \u0007 (60)\nNow, for scalars, recall that \r p \u0000 q \r \u0005\u0011\r p \r \u000f \r q \r if sign \u0006 p \u0007\u0006\u0004\u0005 sign \u0006 q \u0007 and \r p \r \u0000 \r q \r . So, as we are considering\nthe set \u0000 , and because \r sati \u0006 uN \u0000 uL \u0007 \r\u0013# \r uL \u0000 i \r , it follows that\n\r \u000f uL \u0000 i \u0000 sati \u0006 uN \u0000 uL \u0007 \r \u000f \r uN \u0000 i \r \u0005 \r sati \u0006 uN \u0000 uL \u0007 \r \u000f \r uN \u0000 i \r \u000f \r uL \u0000 i \r (61)\nwhich is always negative, which in turn implies the result of the lemma ( γ i \u0002 αi \u0000 1 \u0003 \u0017 i \u0000\n\u0003 ).\nNext assume that\n14\nsign \u0006 \u000f uL \u0000 i \u0007 \u0005 sign \u0006 sati \u0006 uL \u0000 uN \u0007 \u0007 (62)\nThis implies that \r uN \u0000 i \r \u0000 \r uL \u0000 i \r (as sati \u0006 uL \u0000 uN \u0007 \u0005 u¯i # 0). So we have, for ψi \u0006 \u0014 \u0007 \u0000 \u0001 0 \u0003 1 \u0004 ,\n\r \u000f uL \u0000 i \u0000 sati \u0006 uN \u0000 uL \u0007 \r \u000f \r uN \u0000 i \r \u0005 \r \u000f uL \u0000 i \u0000 ψi \u0006 \u0014 \u0007 \u0006 uN \u0000 uL \u0007 \r \u000f \r uN \u0000 i \r (63)\n\u0005 \r \u0006 ψi \u0006 \u0014 \u0007 \u000f 1 \u0007 uL \u0000 i \u0000 ψi \u0006 \u0014 \u0007 uN \u0000 i \r \u000f \r uN \u0000 i \r (64)\n\b \r \u0006 ψi \u0006 \u0014 \u0007 \u000f 1 \u0007 uL \u0000 i \r \u0000 \rψi \u0006 \u0014 \u0007 uN \u0000 i \r \u000f \r uN \u0000 i \r (65)\n\b \r \u0006 ψi \u0006 \u0014 \u0007 \u000f 1 \u0007 \r \r uN \u0000 i \r \u0000 \rψi \u0006 \u0014 \u0007 \r \r uN \u0000 i \r \u000f \r uN \u0000 i \r (66)\n\u0005 \r uN \u0000 i \r \u000f \rψi \u0006 \u0014 \u0007 \r \r uN \u0000 i \r \u0000 \rψi \u0006 \u0014 \u0007 \r \r uN \u0000 i \r \u000f \r uN \u0000 i \r (67)\n\u0005 0 (68)\nwhich again implies the result of the lemma (for i \u0000 \u0003 ).\n3. For i \u0000\n\u0004\na symmetric argument to the case for i \u0000\n\u0003\ncan be used to establish the result of the lemma.\n\u0000 \u0000\n.\nApplying this lemma to the result of Theorem 2, gives us a cleaner version of the theorem which we give below:-\nTheorem 3 Consider the system (1) and the control law described in Theorem 1. Then the origin of (1) is locally\nexponentially stable in a domain \u0000 \u0005 \f x : x\n\u0002\nPx \b c\n\u000f\nfor all well-defined ρ \u0006 x \u0003 t \u0007 such that\n0 \b ρ \u0006 x \u0003 t \u0007 \b 2∆ \u0006 B\n\u0002\nPB \u0006\n\u0003 \u0017 x \u0003 t (69)\nwhere c is the largest positive scalar such that x \u0000 \u0000 \u0001 \rFx \r\u0013\u0012 u¯.\nTherefore, the sufficient conditions for guaranteeing global exponential stability of the origin in the uncon-\nstrained case, are also sufficient conditions for guaranteeing local exponential stability for the constrained case.\nAs with the unconstrained case, as the sample period becomes smaller, the upper bound on ρ \u0006 x \u0003 t \u0007 becomes\nlarger. In the limit, as with many results based on delta-operators, the discrete-time results converge to the\ncorresponding continuous time results.\n5 Observer Based Results\nIt was proved in Saberi et al. (1996) that, using a specially structured observer, the state-feedback results guar-\nanteeing stability for constrained input linear systems could be recovered. Similarly in Lin et al. (2000), it was\n15\nproved that, using a deadbeat observer, the state-feedback results could also be recovered for discrete-time linear\nsystems. In this section we shall prove that by using an arbitrary, stable observer that our state-feedback results\ncan be recovered when state measurement is not possible. Following the convention adopted in the previous\nsection, we first consider the unconstrained case, then we consider the constrained case.\n5.1 Unconstrained observer-based regulation\nWe consider the system\nδx \u0005 Ax \u0000 Bu\ny \u0005 Cx (70)\nwhere \u0006 A \u0003 B \u0007 is assumed to be stabilisable, and \u0006 C \u0003 A \u0007 is assumed to be detectable. Here we assume that only an\noutput measurement is available, namely y \u0005 Cx and introduce the observer based controller for the regulation\nof the above system:\nδ xˆ \u0005 Axˆ \u0000 Bu \u0000 L \u0006 y \u000f yˆ \u0007\nyˆ \u0005 Cxˆ (71)\nThe control law now uses the observed states for feedback to the system and hence is given by\nu \u0005 uL \u0000 uN (72)\nuL : \u0005 Fxˆ \u0003 uN : \u0005 \u000f ρ \u0006 x \u0003 t \u0007 B \u0002 P \u0006 I \u0000 ∆ ˜A \u0007 xˆ (73)\nwhere, as before, we assume that ˜A : \u0005 A \u0000 BF is stable and P # 0 satisfies the Lyapunov equation (20). In\naddition we assume that A \u0000 LC is stable (which is always possible as \u0006 C \u0003 A \u0007 is detectable).\nNote that the observer (71) and the control law (72) - (73) can be combined to give the system\nδ xˆ \u0005 Axˆ \u0000 Bu \u0000 LC \u0006 x \u000f xˆ \u0007\nu \u0005 Fxˆ \u000f ρ \u0006 x \u0003 t \u0007 B \u0002 P \u0006 I \u0000 ∆ ˜A \u0007 xˆ (74)\nUsing the change of variable x˜ \u0005 x \u000f xˆ we can combine the obsever (74) with the system (70) to obtain\n16\n\u0005\n\u0007\nδx\nδ x˜\n\b\n\u000b\n\u0005\n\u0005\n\u0007\n˜A \u000f ρ \u0006 x \u0003 t \u0007 BB\n\u0002\nP \u0006 I \u0000 ∆ ˜A \u0007 \u000f BF \u0000 ρ \u0006 x \u0003 t \u0007 BB\n\u0002\nP \u0006 I \u0000 ∆ ˜A \u0007\n0 A \u000f LC\n\b\n\u000b\n\u0005\n\u0007\nx\nxˆ\n\b\n\u000b (75)\nIt is well known that if the origin of this system is asymptotically stable we have stability of the origin of the\norginal system (70) and that the observer error, x˜ will asypmtotically decay to zero. With this in mind, the\nfollowing theorem is the main result of the section.\nTheorem 4 Consider the sytem described by (70) and (71) with the control law given by equations (72) and\n(73). Then the origin of the system (75) is globally exponentially stable for all well-defined ρ \u0006 x \u0003 t \u0007 which satisfy\n0 \b ρ \u0006 x \u0003 t \u0007\r\b 2∆ \u0006 B\n\u0002\nP \u0006 ∆ \u0007 B \u0006 (76)\nProof: For convenience, let us define:\nA1 \u0006 ρ \u0007 : \u0005 ˜A \u000f ρ \u0006 x \u0003 t \u0007 BB \u0002 P \u0006 I \u0000 ∆ ˜A \u0007 (77)\nA2 \u0006 ρ \u0007 : \u0005 \u000f BF \u0000 ρ \u0006 x \u0003 t \u0007 BB \u0002 P \u0006 I \u0000 ∆ ˜A \u0007 (78)\nThen we can write (75) as\n\u0005\n\u0007\nδx\nδ x˜\n\b\n\u000b\n\u0005\n\u0005\n\u0007\nA1 \u0006 ρ \u0007 A2 \u0006 ρ \u0007\n0 A \u000f LC\n\b\n\u000b\n\u0005\n\u0007\nx\nxˆ\n\b\n\u000b (79)\nNow we choose as a Lyapunov function candidate\nV \u0006 x \u0003 x˜ \u0007 \u0005\n\u0005\n\u0007\nx\nx˜\n\b\n\u000b\n\u0002\n\u0005\n\u0007\nP \u0006 ∆ \u0007 0\n0 β ˜P \u0006 ∆ \u0007\n\b\n\u000b\n\u0005\n\u0007\nx\nx˜\n\b\n\u000b (80)\n\u0005 x \u0002 P \u0006 ∆ \u0007 x \u0000 β x˜ \u0002 ˜P \u0006 ∆ \u0007 x˜ # 0 (81)\nwhere β # 0 is a scalar we shall define later and P \u0006 ∆ \u0007 # 0 and ˜P \u0006 ∆ \u0007 # 0 solve the Lyapunov equations\n˜A \u0002 P \u0000 P ˜A \u0000 ∆ ˜A \u0002 P ˜A \u0005 \u000f Q1 (82)\n\u0006 A \u000f LC \u0007 \u0002 ˜P \u0000 ˜P \u0006 A \u000f LC \u0007\u000e\u0000 ∆ \u0006 A \u000f LC \u0007 \u0002 ˜P \u0006 A \u000f LC \u0007 \u0005 \u000f Q2 (83)\n17\nNow note that V \u0006 x \u0003 x˜ \u0007 is radially unbounded and hence if δV \u0006 x \u0003 x˜ \u0007 \b \u000f φ \u0006 \u0001 x\n\u0002\nx˜\n\u0002\n\u0004\n\u0002\n\u0006\n2 we have proved exponential\nstability of the origin of (75). Evaluating δV \u0006 x \u0007 we obtain\nδV \u0006 x \u0007 \b \u0006 A1x \u0000 A2x˜ \u0007 \u0002 P∆ \u0006 A1x \u0000 A2x˜ \u0007\u000e\u0000 2 \u0006 A1x \u0000 A2x˜ \u0007 \u000f βλmin \u0006 Q2 \u0007 \u0006 x˜ \u0006 2 (84)\n\u0005 x \u0002 \u0006 A \u00021P∆A1 \u0000 A \u00021P \u0000 PA1 \u0007 x \u0000 2x \u0002 \u0006 A \u00021P∆A2 \u0000 PA2 \u0007 x˜ \u0000 x˜ \u0002 \u0006 A \u00022PA2 \u0007 x˜ (85)\nNow, for some α # 0 we have that\n2x \u0002 \u0006 A \u00021P∆A2 \u0000 PA2 \u0007 x˜ \b αx \u0002 \u0006 A \u00021P∆A2 \u0000 PA2 \u0007 \u0002 \u0006 A \u00021P∆A2 \u0000 PA2 \u0007 x \u0000 α\n! 1\n\u0006 x˜ \u0006 2 (86)\nSo we have that\nδV \u0006 x \u0007 \b x \u0002 \u0001 \u0006 A \u00021P∆A1 \u0000 A \u00021P \u0000 PA1 \u0000 α \u0006 A \u00021P∆A2 \u0000 PA2 \u0007 \u0002 \u0006 A \u00021P∆A2 \u0000 PA2 \u0007 \u0004 x \u0000\nx˜ \u0002\n\u0001\nα ! 1I \u0000 ∆A \u00022PA2 \u000f βλmin \u0006 Q2 \u0007 I \u0004 x˜ (87)\n\b x \u0002\n\u0001\n\u0006 A \u00021P∆A1 \u0000 A \u00021P \u0000 PA1 \u0000 α \u0006 A \u00021P∆A2 \u0000 PA2 \u0007 \u0002 \u0006 A \u00021P∆A2 \u0000 PA2 \u0007 \u0004 x \u0000\n\u0001\nα ! 1 \u0000 ∆ \u0006 A \u00022PA2 \u0006 \u000f βλmin \u0006 Q2 \u0007 \u0004 \u0006 x˜ \u0006 2 (88)\nLet us choose β such that\nβ # α\n! 1\n\u0000 ∆ \u0006 A\n\u00022PA2 \u0006\nλmin \u0006 Q2 \u0007\n(89)\nThen a sufficient condition for δV \u0006 x \u0007 \u000b 0 is that\nA \u00021P∆A1 \u0000 A \u00021P \u0000 PA1 \u0000 α \u0006 A \u00021P∆A2 \u0000 PA2 \u0007 \u0002 \u0006 A \u00021P∆A2 \u0000 PA2 \u0007\r\u000b 0 (90)\nAs we can choose α arbitrarily small, but not zero, this will always hold providing\nL1 : \u0005 A \u00021P∆A1 \u0000 A \u00021P \u0000 PA1 \u000b 0 (91)\nTo find under what conditions this is true, note that, using the definition of A1, L1 can be written as\nL1 \u0005 x \u0002 \u0006 ˜A \u0002 P \u0000 P ˜A \u0000 ∆ ˜A \u0002 P ˜A \u0007 x \u000f 2ρ \u0006 x \u0003 t \u0007 x \u0002 \u0006 I \u0000 ∆ ˜A \u0007 \u0002 PBB \u0002 P \u0006 I \u0000 ∆ ˜A \u0007 x \u0000\nρ2 \u0006 x \u0003 t \u0007 ∆x \u0002 \u0006 I \u0000 ∆ ˜A \u0007 \u0002 PBB \u0002 PBB \u0002 P \u0006 I \u0000 ∆ ˜A \u0007 x (92)\n\b \u000f x \u0002 Q1x \u0000 \u0006 ρ2 \u0006 x \u0003 t \u0007 ∆ \u0006 B \u0002 PB \u0006 \u000f 2ρ \u0006 x \u0003 t \u0007 \u0007 \u0006 B \u0002 P \u0006 I \u0000 ∆ ˜A \u0007 x \u0006 2 (93)\n18\nA sufficient condition for this to be negative definite is precisely the condition given in the theorem. This proves\nthe theorem.\n\u0000\u0001\u0000\n.\nThis result proves that, with any stabilising observer, we can recover the stabilisation results obtainable with\nstate feedback. Of course, for comparable transient reponse, we may wish to pick a suitable type of observer,\nalthough the choice of this will depend on the application and is beyond the scope of this paper.\nOnce again, notice that if we allow the sampling frequency to become infinite, ρ \u0006 x \u0003 t \u0007 can be chosen arbitrarily\nlarge, which is exactly what we expect from the continuous time results (although for nonlinear ρ \u0006 x \u0003 t \u0007 this was\nnot actually proven in either Turner et al. (2000) or Lin et al. (1998)).\n5.2 Constrained observer-based regulation\nWe now enforce the added restriction that our control input is to be saturated, that is we consider the system:\nδx \u0005 Ax \u0000 Bsat \u0006 u \u0007 (94)\ntogether with the observer based controller\nδ xˆ \u0005 Axˆ \u0000 Bsat \u0006 u \u0007 \u000f LC \u0006 x \u000f xˆ \u0007 (95)\nu \u0005 Fxˆ \u000f ρ \u0006 x \u0003 t \u0007 B \u0002 P \u0006 I \u0000 ∆A \u0007 xˆ (96)\nUsing the control law (96), our system (94) becomes\nδx \u0005 ˜Ax \u000f BFx˜ \u0000 B \u0001 sat \u0006 uL \u0000 uN \u0007 \u000f uL \u0004 (97)\nwhere uL : \u0005 Fxˆ and uN : \u0005 \u000f ρ \u0006 x \u0003 t \u0007 B \u0002 P \u0006 I \u0000 ∆ ˜A \u0007 xˆ. Letting x˜ : \u0005 x \u000f xˆ, we can combine (97) with (95)-(96)\nto obtain\nδx \u0005 ˜Ax \u000f BFx˜ \u0000 B \u0001 sat \u0006 uL \u0000 uN \u0007 \u000f uL \u0004 (98)\nδ x˜ \u0005 \u0006 A \u000f LC \u0007 x˜ (99)\nThe following theorem is the main result of the section\nTheorem 5 Consider the system (98)-(99). Then the origin of (98)-(99) is locally exponentially stable in a\ndomain \u0000 \u0005 \f \u0006 x \u0003 x˜ \u0007 : V \u0006 x \u0003 x˜ \u0007\f\b c\n\u000f\nfor all well-defined ρ \u0006 x \u0003 x˜ \u0003 t \u0007 such that\n19\n0 \b ρ \u0006 x \u0003 x˜ \u0003 t \u0007\r\b 2\nα ! 12 \u0000 ∆ \u0006 B \u0002 PB \u0006\n\u0003 \u0017 i \u0003 \u0017 x \u0003 t (100)\nwhere\nV \u0006 x \u0003 xˆ \u0007 \u0005 x \u0002 Px \u0000 β x˜ \u0002 ˜Px˜ (101)\nα2 and β are some positive constants, c is the largest positive real such that \u0006 x \u0003 x˜ \u0007 \u0000 \u0000 \u0001 \rFxˆ \r \u0012 u¯, and P and ˜P\nsatisfy the Lyapunov equations (82) and (83).\nProof: Temporarily, we shall denote z : \u0005 B \u0001 sat \u0006 uL \u0000 uN \u0007 \u000f uL \u0004 . Now choose (101) as a Lyapunov function and\nconsider δV \u0006 x \u0007 along the trajectories of the system (98)-(99) in the set \u0000 .\nδV \u0006 x \u0007 \b \u0001 ˜Ax \u000f BFx˜ \u0000 z \u0004 \u0002 P∆ \u0001 ˜Ax \u000f BFx˜ \u0000 z \u0004\n2 \u0001 ˜Ax \u000f BFx˜ \u0000 z \u0004 \u0002 Px \u000f βλmin \u0006 Q2 \u0007 \u0006 x˜ \u0006 2 (102)\n\u0005 x \u0002 \u0006 ˜A \u0002 P∆ ˜A \u0007 x \u0000 2x \u0002 \u0006 ˜A \u0002 P∆BF \u000f PBF \u0007 x˜\n2x \u0002 \u0006 I \u0000 ∆ ˜A \u0007 \u0002 Pz \u0000 ∆x˜ \u0002 F \u0002 BPBFx˜ \u0000 ∆z \u0002 Pz\n2x˜ \u0002 \u0006 F \u0002 B \u0002 P∆ \u0007 z \u000f βλmin \u0006 Q2 \u0007 \u0006 x˜ \u0006 2 (103)\n\b x \u0002\n\u0001\n\u000f Q1 \u0000 α1F \u0002 B \u0002 P \u0006 I \u0000 ∆ ˜A \u0002 \u0007 \u0002 \u0006 I \u0000 ∆ ˜A \u0002 \u0007 PBF \u0004 x \u0000 2x \u0002 \u0006 I \u0000 ∆ ˜A \u0007 \u0002 Pz\n\u0000 z \u0002 P∆z \u0000 1\nα2\n\u0006 z \u0006 2 \u0000\n\u0001\n\u000f λmin \u0006 Q2 \u0007 β \u0000 ∆ \u0006 F \u0002 B \u0002 PBF \u0006 \u0000\n1\nα1\n\u0000 α2 \u0006 F \u0002 B \u0002 P∆ \u0006\n2\n\u0004 \u0006 x˜ \u0006 2 (104)\nNow let us choose Q1 \u0003 Q2 and β such that, for the (yet to be chosen) postive scalars, α1 and α2, we have\nλmin \u0006 Q1 \u0007\u001a# α1 \u0006 \u0006 I \u0000 ∆ ˜A \u0002 \u0007 PBF \u0006 2 (105)\nλmin \u0006 Q2 \u0007 β # ∆ \u0006 F \u0002 B \u0002 PBF \u0006 \u0000\n1\nα1\n\u0000 α2 \u0006 F \u0002 B \u0002 P∆ \u0006\n2 (106)\nWith these choices, a sufficient condition for δV \u0006 x \u0007 \b \u000f φ \u0006 \u0001 x\n\u0002\nx˜\n\u0002\n\u0004\n\u0002\n\u0006\n2 (which implies positive invariance of \u0000\nand local exponential stability of the origin of (98)-(99)) is for\n2x \u0002 P \u0006 I \u0000 ∆ ˜A \u0002 \u0007 Pz \u0000 1\nα2\n\u0006 z \u0006 2 \u0000 z \u0002 P∆z \b 0 (107)\nSubstituting for z and re-arranging we have that the above inequality holds if\n2x \u0002 \u0006 I \u0000 ∆ ˜A \u0002 \u0007 PB \u0001 sat \u0006 uL \u0000 uN \u0007 \u000f uL \u0004 \u0000 \u0006\n1\nα2\n\u0000 ∆ \u0006 B \u0002 PB \u0006 \u0007 \u0006 sat \u0006 uL \u0000 uN \u0007 \u000f uL \u0006\n2\n\b 0 (108)\n20\nIn turn, this inequality holds if\n2 \u0001 x \u0002 \u0006 I \u0000 ∆ ˜A \u0002 \u0007 PB \u0004 i\n\u0001\nsati \u0006 uL \u0000 uN \u0007 \u000f uL \u0000 i \u0004 \u0000 \u0006\n1\nα2\n\u0000 ∆ \u0006 B \u0002 PB \u0006 \u0007 \u0006 sati \u0006 uL \u0000 uN \u0007 \u000f uL \u0000 i \u0006\n2\n\b 0 (109)\nfor all i \u0000 \f 1 \u0003 \u0014 \u0014 \u0014 \u0003 m\n\u000f\n.\nSimilar to the case of Theorem 2, this transpires to be the case if ρ \u0006 x \u0003 x˜ \u0003 t \u0007 is such that\nρ \u0006 x \u0003 x˜ \u0003 t \u0007\r\b min\n\u0000\n2\nα ! 12 \u0000 ∆ \u0006 B \u0002 PB \u0006\n\u0003\n2\nα ! 12 \u0000 ∆ \u0006 B \u0002 PB \u0006\n\u0014\nγi\nαi \u0001\n(110)\nHowever, from Lemma 3 we now that γi \u0002 αi \u0000 1 \u0003 \u0017 i. So the condition reduces to that given in the theorem.\n\u0000\u0001\u0000\nRemark. Note that this is similar to the state feedback case, except we do not quite recover the unconstrained\nresults. This is due to the presence of the term α ! 12 in the denominator of the right hand side of inequality (100).\nHowever, note that α2 can be chosen arbitrarily large, so to all intents and purposes, the unconstrained results\nare effectively recovered: α2 is purely a product of the proof we have presented and in fact does not play an\nimportant role in the results.\n6 Example\n6.1 One state system\nFor simplicity we consider a first order system with continuous-time state-space representation\nx˙ \u0005 x \u0000 sat \u0006 u \u0007 (111)\nwhere the saturation limit, u¯ has been chosen as unity.\nA state-feedback control law which places the pole of the continuous time systems at s \u0005 \u000f 5, is given by u \u0005 \u000f 6x,\ni.e. F \u0005 \u000f 6. We consider two sample periods, ∆ \u0005 0 \u0014 1 and ∆ \u0005 0 \u0014 01 and calculate bounds on ρ \u0006 x \u0003 t \u0007 based on\nthese sample periods using the results in the earlier sections of the paper:\nρ∆ \u0002 0 \u0003 1 \u0006 x \u0003 t \u0007\f\b 140 \u0014 16 ρ∆ \u0002 0 \u0003 01 \u0006 x \u0003 t \u0007\f\b 1940 \u0014 00 (112)\nFor simplicity we shall choose ρ as a constant with a value of its upper bound, that is a ‘high gain’:\nρ∆ \u0002 0 \u0003 1 \u0006 x \u0003 t \u0007 \u0005 140 \u0014 16 ρ∆ \u0002 0 \u0003 01 \u0006 x \u0003 t \u0007 \u0005 1940 \u0014 00 (113)\n21\nAs the continuous time system is unstable, it has a bounded region of attraction and, for any sample period, this\nwill also be the case for the discretised systems. As this is a one-state system, the ellipsoidal Lyapunov level sets\nreduce to a simple interval and given a linear control law of F \u0005 \u000f 6 it is simple to calculate that values of x such\nthat the linear law does not saturate are given by \r x \r \b 0 \u0014 16673 (regardless of the sample period).\n0 0.5 1 1.5 2 2.5 3 3.5 4\n−0.1\n0\n0.1\n0.2\nO\nut\npu\nt \n0 0.5 1 1.5 2 2.5 3 3.5 4\n−1\n−0.5\n0\n0.5\nSa\ntu\nra\nte\nd \nco\nnt\nro\nl \n0 0.5 1 1.5 2 2.5 3 3.5 4\n−0.5\n0\n0.5\n1\n1.5\nAd\ndi\ntio\nna\nl c\non\ntro\nl\nTime − seconds\nFigure 2: Response of system with 0.1 second sample period: with unaugmented control, uL, (dashed line) and\ncomposite control, uL \u0000 uN (solid line)\nFigure 2 shows the responses of the system discretised with a sample period of ∆ \u0005 0 \u0014 1 seconds. The barely\nvisible dashed lines show the response of the system without a ‘high-gain’ parameter ρ . Note that, as predicted,\nthe control law does not saturate and the state is regulated to the origin. The solid lines, which largely obscure\nthe dashed lines, show the response when the high gain feedback is added as calculated by equation (21). As the\nsample period is quite large, the bound on ρ prevents the ‘high gain’ control law from having a large gain; thus\nthe effect of this high gain control is negligible.\nFigure 3 shows the responses of the system discretised with a sample period of ∆ \u0005 0 \u0014 01 seconds. The dashed\nlines again show the responses of the system without a high gain parameter added. When the high gain parameter\nis included (solid lines), the state is regulated to the origin much faster than before. Consistently, the control effort\nhas increased and now the control signal spends some time in saturation. This more aggressive behaviour can be\nattributed to the presence of the high gain control law which, as the sample period is now smaller than before, is\nof a larger magnitude and consequently has a significant impact on the system’s behaviour.\nFigure 4 shows the response of the system discretised with ∆ \u0005 0 \u0014 1 seconds. As before the dashed lines show\nthe responses of the system without a high gain parameter. The solid lines now show the responses with the\nhigh gain parameter taken from that calculated for the system with a sample time of ∆ \u0005 0 \u0014 01, which of course\nviolates the bounds on ρ for the more slowly sampled system. It is therefore not surprising that the high gain\ncontrol law causes the system to limit cycle (this can be seen more clearly when system is simulated for longer\n3For realistic systems with more states, the ellipsoidal estimates given in Theorems 3 and 5 must be used\n22\n0 0.5 1 1.5 2 2.5 3 3.5 4\n0\n0.05\n0.1\n0.15\n0.2\nO\nut\npu\nt \n0 0.5 1 1.5 2 2.5 3 3.5 4\n−1\n−0.5\n0\nSa\ntu\nra\nte\nd \nco\nnt\nro\nl \n0 0.5 1 1.5 2 2.5 3 3.5 4\n0\n10\n20\n30\n40\nAd\ndi\ntio\nna\nl c\non\ntro\nl\nTime − seconds\nFigure 3: Response of system with 0.01 second sample period: with unaugmented control, uL, (dashed line) and\ncomposite control, uL \u0000 uN (solid line)\n0 0.5 1 1.5 2 2.5 3 3.5 4\n−0.1\n0\n0.1\n0.2\n0.3\nO\nut\npu\nt \n0 0.5 1 1.5 2 2.5 3 3.5 4\n−1\n−0.5\n0\n0.5\n1\nSa\ntu\nra\nte\nd \nco\nnt\nro\nl \n0 0.5 1 1.5 2 2.5 3 3.5 4\n−20\n0\n20\n40\nAd\ndi\ntio\nna\nl c\non\ntro\nl\nTime − seconds\nFigure 4: Response of system with 0.1 second sample period but large uN : with unaugmented control, uL,\n(dashed line) and composite control, uL \u0000 uN (solid line)\nperiods of time).\n6.2 Discussion\nThe above example gives a simple exposition of some of the ideas in this paper, but its simplicity does occlude\nseveral aspects which would have to be considered in a more realistic design.\nConservatism. The domain of attraction of the system is estimated, very conservatively in general, using hyper-\nellipoidsal regions \u0000 . The first source of conservatism is that these ellipsoids, which are described in Theorems\n3 and 5, are calculated such that the nominal ‘low gain’ linear control does not saturate (The oversaturation of\nDe Dona et al. (2000) is an alternative to this). The second source of conservatism is that an ellipsoid is often not\ntopologically similar to the actual domain of attraction, sometimes allowing only a ‘small’ ellipsoid to estimate\n23\nthe domain of attraction. A better approximation of the domain of attraction is given by a polytopic region,\nalthough the calculation of such is typically much more expensive in computation - see Gomes da Silva Jr &\nTarbouriech (1999).\nChoice of ρ \u0006 x \u0003 t \u0007 . In the example, we chose ρ \u0006 x \u0003 t \u0007 as the largest constant satisfying the bound (69). However,\nthe choice for ρ \u0006 x \u0003 t \u0007 is quite wide. Lin et al. (1998) and Turner et al. (2000) propose alternative, nonlinear,\nchoices for ρ \u0006 x \u0003 t \u0007 for continuous time systems. This is relatively easy to adapt to the delta operator systems\nwe consider here. Given a continuous time nonlinear parameter, ρc \u0006 x \u0003 t \u0007 , and if the bound on ρ \u0006 \u0014 \u0003 \u0014 \u0007 given by\ninequality (69) is ρ¯ , then an appropriate choice for ρ \u0006 x \u0003 t \u0007 for the delta-operator systems we consider here would\nbe\nρ \u0006 x \u0003 t \u0007 \u0005 min \f ρc \u0006 x \u0003 t \u0007 \u0003 ρ¯\n\u000f\n(114)\n7 Conclusion\nThis paper has re-examined the problem of nonlinear regulation in discrete-time linear systems subject to input\nsaturation. The main contribution of the paper shows how the delta operator formulation of the problem allows\na reconciliation between continuous and discrete-time results for this class of systems. This is in addition to the\nnumerical advantages which the delta operator has over the shift operator (see Middleton 1990).\nOne of the useful, and anticipated, implications of the work is that the continuous time results of Lin et al.\n(1998) and Turner et al. (2000) seem relatively straightforward to transfer to discrete-time systems. In particular\nthe choice of ρ \u0006 x \u0003 t \u0007 is fairly easy to construct from continuous time ideas; this was not the case for the shift-\noperator work of Lin et al. (2000). Although Lin et al. (1998) and Turner et al. (2000) examine tracking rather\nthan regulation, the continuous time results of these papers again appears rather straightforward to transfer to\ndiscrete-time systems using the delta-operator formulation given here, and could be the subject of future work.\nThe results presented in this paper allow for a nonlinear control law of the form\nuN \u0005 ρ \u0006 \u0014 \u0007 B \u0002 P \u0006 I \u0000 ∆ ˜A \u0007 (115)\nHowever, it is possible to prove that similar results can be obtained for a matrix version of the nonlinear param-\neter, viz\nuN \u0005 R \u0006 \u0014 \u0007 B \u0002 P \u0006 I \u0000 ∆ ˜A \u0007 \u0003 R \u0006 \u0014 \u0007 \u0005 diag \u0000 ρ1 \u0006 \u0014 \u0007 \u0003 \u0014 \u0014 \u0014 \u0003 ρm \u0006 \u0014 \u0007\u0002\u0001 (116)\nThe theorems for this case become a little more complex (see Theorem 3’s counterpart in Appendix B), as do the\nproofs, with the central condition being replaced by a maximum over all ρ i \u0006 \u0014 \u0007 . However, as indicated in Turner\n24\net al. (2000), a matrix R \u0006 \u0014 \u0007 is often preferable to a scalar in the case of multivariable systems when inter-axis\ncoupling is an issue.\nComposite control laws for constrained systems have already been considered in hard-disk applications (Chen et\nal. (2003)) and have proven to be useful. Further future work could seek to widen the scope of composite control\nlaws to more complex multivariables systems and, for the implementation of these control laws, the results of\nthis paper should provide a useful guide.\nReferences\nChen, B.M., Lee, T.H., Peng, K. & Venkataramanan, V. (2003), ‘Composite nonlinear feedback control for\nlinear systems with actuatorsaturation: theory and an application’, IEEE Transactions on Automatic Control\n48(3), 427–439.\nDe Dona, J.A., Moheimani, S.O.R. & Goodwin, G.C. (2000), ‘Robust combined PLC\/LHG controller with\nallowed over-saturation of the input signal’, Proc. American Control Conference pp. 750–751.\nGomes da Silva Jr, J.M. & Tarbouriech, S. (1999), ‘Polyhedral regions of local stability for linear discrete-time\nsystems with saturating controls’, IEEE Transactions on Automatic Control 44(11), 2081–2085.\nGomes da Silva Jr, J.M. & Tarbouriech, S. (2001), ‘Local stabilisation of discrete-time linear systems with\nsaturating controls: an LMI based approach.’, IEEE Transactions on Automatic Control 46(1), 119–125.\nHu, T., Lin, Z. & Qiu, L. (2001), ‘Stabilisation of exponentially unstable linear systems with saturating actua-\ntors’, IEEE Transactions on Automatic Control 46, 973–979.\nLin, Z. & Saberi, A. (1993), ‘Semi-global exponential stabilisation of linear systems subject to input saturation\nvia linear feedbacks’, Systems and Control Letters pp. 225–239.\nLin, Z. & Saberi, A. (1995), ‘A semi-global low and high gain design technique for linear systems with input\nsaturation - Stabilisation and Disturbance rejection’, International Journal of Robust and Nonlinear Control\n5, 381–398.\nLin, Z., Pachter, M. & Banda, Siva (1998), ‘Toward tracking improvement - nonlinear feedback for linear sys-\ntems’, International Journal of Control 70(1), 1–11.\nLin, Z., Saberi, A., Stoorvogel, A.A. & Mantri, R. (2000), ‘An improvement to the low gain design for discrete-\ntime linear systems in the presence of actuator saturation nonlinearity’, International Journal of Robust and\nNonlinear Control 10(10), 117–135.\nMiddleton, R.H. & Goodwin, G.C. (1990), Digital Control and Estimation: a unified approach, Prentice-Hall,\nEnglewood Cliffs, New Jersey.\n25\nSaberi, A., Lin, Z. & Teel, A.R. (1996), ‘Control of linear systems with saturating actuators’, IEEE Transactions\non Automatic Control 41(3), 368–378.\nTurner, M.C., Postlethwaite, I. & Walker, D.J. (2000), ‘Nonlinear tracking control for multivariable constrained\ninput linear systems’, International Journal of Control 73(12), 1160–1172.\nWredenhagen, G.F. & Belanger, B. (1994), ‘Piecewise Linear LQ Control for Constrained Input Systems’, Au-\ntomatica 30(3), 403–416.\nZhou, K., Doyle, J.C. & Glover, K. (1996), Robust and Optimal Control, Prentice-Hall, Englewood Cliffs, New\nJersey.\nA Proof of Lemma 1\nIn abuse of notation, let us denote V \u0006 x \u0006 t \u0007 \u0007 as V \u0006 t \u0007 and V \u0006 x \u0006 t \u0000 ∆ \u0007 \u0007 as V \u0006 t \u0000 ∆ \u0007 . From the definitions in the\nstatement of the lemma we have that, for all x \u0000\u0004\u0003 ,\nδV \u0006 t \u0007 \b \u000f µ3 \u0002 µ2V \u0006 t \u0007 \u0003 (117)\nV \u0006 t \u0000 ∆ \u0007 \u000f V \u0006 t \u0007 \b \u000f ∆µ3 \u0002 µ2V \u0006 t \u0007 \u0003 (118)\nV \u0006 t \u0000 ∆ \u0007 \b \u0006 1 \u000f ∆µ3 \u0002 µ2 \u0007 V \u0006 t \u0007 (119)\n\b\n\u0001\nexp \u000f \u0006 ∆µ3 \u0002 µ2 \u0007 \u0004 V \u0006 t \u0007 (120)\n\b\n\u0001\nexp \u000f \u0006 ∆µ3 \u0002 µ2 \u0007 \u0004 µ2 \u0006 x \u0006 t \u0007 \u0006 2 (121)\n\u0001\n\u0006 x \u0006 t \u0000 ∆ \u0007 \u0006 \b \u0001 exp \u000f \u0006 ∆µ3 \u0002 2µ2 \u0007 \u0004\u0001\u0000 µ2 \u0002 µ1 \u0006 x \u0006 t \u0007 \u0006 (122)\nWhich proves exponential stability as defined in Definition 2.\n\u0000 \u0000\nB Matrix nonlinear parameter\nThe following is an alternative to Theorem 3 when the control law is replaced by\nuN \u0005 \u000f R \u0006 x \u0003 t \u0007 B \u0002 P \u0006 I \u0000 ∆ ˜A \u0007 x (123)\nwhere\nR \u0006 x \u0003 t \u0007 \u0005 diag \u0006 ρ1 \u0006 x \u0003 t \u0007 \u0003 \u0014 \u0014 \u0014 \u0003 ρm \u0006 x \u0003 t \u0007 \u0007 ρi \u0000 0 \u0017 i\n\u0000\n\f 1 \u0003 \u0014 \u0014 \u0014 \u0003 m\n\u000f\n(124)\n26\nTheorem 6 Consider the system (1) and the control law u \u0005 uL \u0000 uN where uL \u0005 Fx, F is such that equation\n(20) is satisfied and uN is defined by equations (123) and (124). Then the origin of (1) is locally exponentially\nstable in a domain \u0000 \u0005 \f x : x\n\u0002\nPx \b c\n\u000f\nfor all well-defined R \u0006 x \u0003 t \u0007 such that\nmax\ni \u0000 x \u0000 t\nρi \u0006 x \u0003 t \u0007 \b\n2\n∆ \u0006 B\n\u0002\nPB \u0006\n(125)\nwhere c is the largest positive scalar such that x \u0000 \u0000 \u0001 \rFx \r\u0013\u0012 u¯.\n"}