{"doi":"10.1179\/1362171810Y.0000000029","coreId":"140378","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/5730","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/5730","10.1179\/1362171810Y.0000000029"],"title":"Measuring the process efficiency of controlled gas metal arc welding processes","authors":["Pepe, Nuno","Egerland, Stephan","Colegrove, Paul A.","Yapp, David","Leonhartsberger, Andreas","Scotti, Ameirico"],"enrichments":{"references":[{"id":37938268,"title":"Advanced Welding Processes',","authors":[],"date":"2006","doi":"10.1533\/9781845691707","raw":"J. Norrish: 'Advanced Welding Processes', 2006, Cambridge, England, Woodhead Publishing Limited.","cites":null},{"id":37938264,"title":"Advances in Gas Metal Arc Welding and Application to Corrosion Resistant Alloy Pipes',","authors":[],"date":"2010","doi":null,"raw":"N. C. Pepe: 'Advances in Gas Metal Arc Welding and Application to Corrosion Resistant Alloy Pipes', 2010, PhD Thesis, Cranfield University.","cites":null},{"id":37938265,"title":"Arc power and efficiency in gas tungsten arc welding of aluminium',","authors":[],"date":"2005","doi":"10.1179\/174329305x37033","raw":"G. M. D. Cantin and J. A. Francis: 'Arc power and efficiency in gas tungsten arc welding of aluminium', Science and Technology of Welding and Joining, 2005, 10, 200-210.","cites":null},{"id":37938269,"title":"Control of short circuiting in MIG welding',","authors":[],"date":null,"doi":"10.1080\/09507116.2011.590662","raw":"P. Broughton and G. J. MacGregor: 'Control of short circuiting in MIG welding', Welding Research International, 1974, 4, 31-53.","cites":null},{"id":37938267,"title":"Effective heat input in pulsed gas metal arc welding with solid wire electrodes', Welding Journal,","authors":[],"date":"1991","doi":null,"raw":"M. R. Bosworth: 'Effective heat input in pulsed gas metal arc welding with solid wire electrodes', Welding Journal, 1991, 70, 111s-117s.","cites":null},{"id":37938263,"title":"Fuerschbach: 'GTA welding efficiency: calorimetric and temperature field measurements', Welding Journal,","authors":[],"date":"1989","doi":null,"raw":"W. H. Giedt, L. N. Tallerico and P. W. Fuerschbach: 'GTA welding efficiency: calorimetric and temperature field measurements', Welding Journal, 1989, 68, 28s-32s.","cites":null},{"id":37938276,"title":"Heat Transfer, 7th Edition',","authors":[],"date":"1990","doi":null,"raw":"J. P. Holman: 'Heat Transfer, 7th Edition', 1990, San Francisco, McGraw Hill. Time [s] 0 50 100 150 200 To ta l W eight [g] Normal vaporization rate Vaporization from welding temperature Vaporization from room temperature Mass of the Specimens [g] 0 200 400 600 800 1000 Loss of N [ g]","cites":null},{"id":37938274,"title":"Investigations of GMAW plasma by optical emission spectroscopy', Plasma Sources Sci.","authors":[],"date":"2007","doi":"10.1088\/0963-0252\/16\/4\/019","raw":"S. Zielińska, K. Musioł, K. Dzierga, S. Pellerin, F. Valensi, C. De Izarra and F. Briand: 'Investigations of GMAW plasma by optical emission spectroscopy', Plasma Sources Sci. Technol., 2007, 16, 832-838.","cites":null},{"id":37938258,"title":"Knorovsky: 'A study of melting efficiency in plasma arc and gas tungsten arc welding', Welding Journal,","authors":[],"date":"1991","doi":"10.3403\/00245046u","raw":"P. W. Fuerschbach and G. A. Knorovsky: 'A study of melting efficiency in plasma arc and gas tungsten arc welding', Welding Journal, 1991, 70, 287s-297s.","cites":null},{"id":37938257,"title":"Measurement and calculation of arc power and heat transfer efficiency in pulsed gas metal arc welding',","authors":[],"date":"2003","doi":"10.1179\/136217103225005642","raw":"A. Joseph, D. Harwig, D. F. Farson and R. Richardson: 'Measurement and calculation of arc power and heat transfer efficiency in pulsed gas metal arc welding', Science and Technology of Welding and Joining, 2003, 8, 400-406.","cites":null},{"id":37938273,"title":"Metal vapour causes a central minimum in arc temperature in gas-metal arc welding through increased radiative emission',","authors":[],"date":"2010","doi":"10.1088\/0022-3727\/43\/2\/022001","raw":"M. Schnick, U. Füssel, M. Hertel, A. Spille-Kohoff and A. B. Murphy: 'Metal vapour causes a central minimum in arc temperature in gas-metal arc welding through increased radiative emission', J. Phys. D, 2010, 43.","cites":null},{"id":37938262,"title":"Nunes: 'Arc efficiency of plasma arc welding',","authors":[],"date":"1998","doi":null,"raw":"D. M. Evans, D. Huang, J. C. McClure and A. C. Nunes: 'Arc efficiency of plasma arc welding', Weld J (Miami Fla), 1998, 77, 53-s.","cites":null},{"id":37938271,"title":"Predictions of weld pool profiles using plasma physics',","authors":[],"date":"2007","doi":"10.1088\/0022-3727\/40\/1\/r01","raw":"M. Tanaka and J. J. Lowke: 'Predictions of weld pool profiles using plasma physics', J. Phys. D, 2007, 40, R1-R23.","cites":null},{"id":37938275,"title":"Stationary GMAW-P weld metal deposit spreading',","authors":[],"date":"2009","doi":"10.1179\/136217109x441173","raw":"Y. C. Lim, D. F. Farson, M. H. Cho and J. H. Cho: 'Stationary GMAW-P weld metal deposit spreading', Science and Technology of Welding and Joining, 2009, 14, 626-635.","cites":null},{"id":37938270,"title":"The CMT - Process - A Revolution in welding technology',","authors":[],"date":"2005","doi":null,"raw":"A. Schierl: 'The CMT - Process - A Revolution in welding technology', Weld. World, 2005, 49, 38.","cites":null},{"id":37938266,"title":"The welding process impact on residual stress and distortion',","authors":[],"date":"2009","doi":"10.1179\/136217109x406938","raw":"P. A. Colegrove, C. Ikeagu, A. Thistlethwaite, S. W. Williams, T. Nagy, W. Suder, S. Steuwer and T. Pirling: 'The welding process impact on residual stress and distortion', Science and Technology of Welding & Joining, 2009, 14, 717-725.","cites":null},{"id":37938259,"title":"Thermal efficiency of arc welding processes',","authors":[],"date":"1995","doi":null,"raw":"J. N. DuPont and A. R. Marder: 'Thermal efficiency of arc welding processes', Weld J (Miami Fla), 1995, 74, 406-s.","cites":null},{"id":37938256,"title":"Welding Metallurgy',","authors":[],"date":"2003","doi":"10.1002\/0471434027","raw":"S. Kou: 'Welding Metallurgy', 461; 2003, New York, USA, Wiley-Interscience.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2011-07-31T00:00:00Z","abstract":"The thermal or process efficiency in gas metal arc welding (GMAW) is a crucial\ninput to numerical models of the process and requires the use of an accurate\nwelding calorimeter. In this paper, the authors compare a liquid nitrogen\ncalorimeter with an insulated box calorimeter for measuring the process\nefficiency of Fronius cold metal transfer, Lincoln surface tension transfer and\nRapidArc, Kemppi FastRoot and standard pulsed GMAW. All of the controlled dip\ntransfer processes had a process efficiency of ∼85% when measured with the\nliquid nitrogen calorimeter. This value was slightly higher when welding in a\ngroove and slightly lower for the RapidArc and pulsed GMAW. The efficiency\nmeasured with the insulated box calorimeter was slightly lower, but it had the\nadvantage of a much smaller random err","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140378.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1179\/1362171810Y.0000000029","pdfHashValue":"dc14a216420a047887bc48e78bb04a5ed7812952","publisher":null,"rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/5730<\/identifier><datestamp>2012-06-15T12:48:42Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Measuring the process efficiency of controlled gas metal arc welding processes<\/dc:title><dc:creator>Pepe, Nuno<\/dc:creator><dc:creator>Egerland, Stephan<\/dc:creator><dc:creator>Colegrove, Paul A.<\/dc:creator><dc:creator>Yapp, David<\/dc:creator><dc:creator>Leonhartsberger, Andreas<\/dc:creator><dc:creator>Scotti, Ameirico<\/dc:creator><dc:description>The thermal or process efficiency in gas metal arc welding (GMAW) is a crucial\ninput to numerical models of the process and requires the use of an accurate\nwelding calorimeter. In this paper, the authors compare a liquid nitrogen\ncalorimeter with an insulated box calorimeter for measuring the process\nefficiency of Fronius cold metal transfer, Lincoln surface tension transfer and\nRapidArc, Kemppi FastRoot and standard pulsed GMAW. All of the controlled dip\ntransfer processes had a process efficiency of ∼85% when measured with the\nliquid nitrogen calorimeter. This value was slightly higher when welding in a\ngroove and slightly lower for the RapidArc and pulsed GMAW. The efficiency\nmeasured with the insulated box calorimeter was slightly lower, but it had the\nadvantage of a much smaller random erro<\/dc:description><dc:date>2011-08-01T23:08:31Z<\/dc:date><dc:date>2011-08-01T23:08:31Z<\/dc:date><dc:date>2011-07-31T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>N. Pepe, S. Egerland, P.A. Colegrove, D. Yapp, A. Leonhartsberger, A. Scotti, Measuring the process efficiency of controlled gas metal arc welding processes, Science and Technology of Welding & Joining, Volume 16, Number 5, July 2011 , Pages 412-417.<\/dc:identifier><dc:identifier>1362-1718<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1179\/1362171810Y.0000000029<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/5730<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1362-1718","1362-1718"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2011,"topics":[],"subject":["Article"],"fullText":"  \n \nMeasuring the Process Efficiency of Controlled Gas Metal Arc \nWelding Processes \n \nBy Nuno Pépe\n1\n, Stephan Egerland\n2\n, Paul A. Colegrove\n1\n, David Yapp\n1\n, and Andreas \nLeonhartsberger\n2\n and Americo Scotti\n3 \n \n1\nCranfield University, Cranfield, Bedfordshire MK43 0AL, United Kingdom \n \n2\nFRONIUS International GmbH, Welding Technology Division, Buxbaumstrasse 2, A-4600 \nWels Austria \n \n3\nMechanical Engineering Faculty, Federal University of Uberlandia, Campus Santa Monica, \n38400-902 Uberlandia, MG, Brazil \n 2 \nAbstract \n \nThe thermal or process efficiency in Gas Metal Arc Welding (GMAW) is a crucial input to \nnumerical models of the process, and requires the use of an accurate welding calorimeter. In \nthis paper we compare a liquid nitrogen calorimeter with an insulated box calorimeter for \nmeasuring the process efficiency of Fronius CMT, Lincoln STT and Rapid Arc, Kemppi \nFastRoot and standard pulsed GMAW.  All the controlled dip transfer processes had a process \nefficiency of around 85% when measured with the liquid nitrogen calorimeter.   \nThis value was slightly higher when welding in a groove and slightly lower for the RapidArc \nand pulsed GMAW. The efficiency measured with the insulated box calorimeter was slightly \nlower, but it had the advantage of much smaller random error. \n 3 \n1 Introduction \nWhen undertaking numerical modelling of a welding process it is important to know the \nprocess efficiency and to understand how this varies with the welding waveform and weld \ngeometry. The process efficiency, η can be calculated with the following equation1: \nnom\nweld\nQ\nQ\n  (1) \nwhere \nQweld is the calorimetric energy input to the plate; \nQnom is the nominal energy input from the power supply, i.e. arc energy. \n \nAlthough a number of methods can be used to calculate the nominal energy input from the \npower supply, the most accurate method is\n2\n: \ndtVIQ\nweldt\nnom\n0\n  (2) \nwhere: \nV is the voltage at the arc; \nI is the current; \nt is the time \ntweld is the total time to make the weld. \n \nWhen this is divided by the duration of the weld, it is often called the ‘average instantaneous \npower’. \n \nThe weld arc power input to the plate is commonly measured with the Seebeck calorimeter\n3-6\n \nwhich calculates the heat loss from an insulated box. The box is closed after welding and \nwater is subsequently used to cool it down to room temperature. The temperature difference \nbetween the inlet and outlet water flows is measured and integrated to give an estimate of the \ntotal energy input to the plate. Although it is claimed that the method is accurate to within 1% \nonce the sample is in the calorimeter\n4\n, each measurement can take up to six hours\n6\n and the \nheat losses that occur prior to the sample being put into the calorimeter need to be considered. \nMore recently, a number of authors have used a liquid nitrogen calorimeter\n7-10\n, since \nmeasurements can be made much more rapidly. After completing the weld, the plate is rapidly \ninserted into a Dewar containing liquid nitrogen and the amount of liquid boiled off is \nmeasured. By knowing the vaporisation energy of liquid nitrogen, the calorimetric energy \ninput to the plate can be determined with: \n \nvRTW Tweld LmmQ   (3) \n \nwhere: \nΔmWT is the mass loss when the sample is cooled from welding temperature to the \nliquid nitrogen boiling temperature; \nΔmRT is the mass loss when cooling the same plate from room temperature to the \nliquid nitrogen boiling temperature. \nLv is the latent heat of vaporisation for liquid nitrogen which equals 199.5 J\/g. \n \nIn the final method used by Cantin and Francis\n11\n the weld is performed in an insulated box \nand the final stabilised temperature of the welded plates and backing bar is measured. The \ncalorimetric energy input to the plate is found by: \n 4 \ne eT\nT\nT\nT\npbbpwwweld dTTcmdTTcmQ\n0 0\n  (4) \nwhere: \nmw,mb = Mass of the workpiece and backing bar respectively; \npbpw cc , = Specific heat of the workpiece and backing bar respectively; \nT = Temperature; \nT0,Te = initial and equilibrium temperatures. \n \nOne disadvantage common to all of the above methods are the uncontrolled heat losses which \noccur. Some examples are the heat losses which occur prior to insertion into the calorimeter \nor prior to the calorimeter being sealed. The dry calorimeter method described above also has \nthe problem of the heat losses through the insulated box. A method which overcomes these \nproblems is to back calculate the value from a numerical model\n12\n. Although this method \novercomes this problem, there are other problems with this method such as the uncertainty in \nthermocouple measurements, material properties and in particular the boundary condition \nwhich exists between the sample and the backing bar. \n \nThese methods have been applied to a variety of processes including Gas Tungsten Arc \nWelding (GTAW) \n3,4,6,11\n, Gas Metal Arc Welding (GMAW) \n4,7,8,10,13\n, and Plasma Arc \nWelding\n3,4\n. The process efficiency for consumable electrode processes is generally about 10-\n20% higher than non-consumable processes\n4\n. Different authors have reported widely varying \nvalues of process efficiency for GMAW which is the subject of this investigation. Although \nmost articles claim it lies between 80-90%\n4,10,13\n, some articles have reported values as low as \n70%\n7,8\n.  \n \nAlthough there are different transfer modes in GMAW, the ones relevant to this article are \nspray, pulsed, dip (sometimes called short circuiting) and controlled dip transfer which are \ndescribed in Norrish\n14\n.  Spray transfer occurs at large currents and wire feed speeds and \ninvolves a continuous stream of small diameter droplets.  Pulsed transfer is characterised by a \npulsed current waveform and a droplet is detached with each pulse.  The droplet has a similar \nsize to the wire diameter and the process has low levels of spatter.  Dip transfer occurs when \nthe currents and voltages are generally low and the wire ‘dips’ into the weld pool.  Without \nelectronic control of the power supply, the short circuit causes a significant increase in current, \nwhich results in an explosive rupture of the wire and high levels of spatter.  A number of \npower supply manufacturers have developed methods for overcoming this problem based on \nthe early work of Broughton and MacGregor\n15\n which involve detecting and reducing the \ncurrent before the short circuit occurs.  Examples are Lincoln Surface Tension Transfer (STT), \nand Kemppi FastROOT, and as the name suggests metal is transferred to the weld pool by \nsurface tension.  All these processes have low levels of heat input.  Fronius have developed a \nprocess based on the work of Huismann\n16\n called Cold Metal Transfer (CMT)\n17\n which \ncombines controlled dip transfer with an oscillating wire motion and it is claimed that this \npower supply has an even lower heat input.  One final power supply which is relevant to this \nwork is Lincoln RapidArc where there is sufficient current during arcing to cause spray \ntransfer.  Although it is claimed that short circuiting occurs in this process, an extensive \ninvestigation by Pepe\n10\n indicated no evidence for this, and the process was characterised by \npulsed spray transfer.   \n \nWhen comparing the process efficiency of the different transfer modes, investigators have \nfound little difference between constant voltage and pulsed transfer\n7,13\n.  However two articles \n 5 \nhave reported that the efficiency with dip or STT (controlled dip) modes is significantly \nhigher – up to 95%8,13. \n \nOne of the interesting questions raised about process efficiency measurements is what \nhappens to the energy which is not transferred to the workpiece? The heat losses will be in the \nform of either evaporation of the weld metal, radiation, convection or conduction from the \nwelding torch. Obtaining accurate values of each of these contributions is difficult. Dupont et \nal.\n4\n claimed that the losses from the weld pool and surrounding area combined accounted for \nonly 1-2%. Presumably the remaining heat losses (10-20%) come from arc radiation. This is \nsupported by the theoretical work of Tanaka and Lowke\n18\n who claimed that 18% of the heat \nloss was from arc radiation and a further 5% came from conduction and radiation from the \ntungsten cathode in GTAW. \n \nThis still does not explain the approximately 10-20% difference in process efficiency \nmeasured between consumable and non-consumable processes. Dupont and Marder\n4\n claimed \nthat the higher efficiency in GMAW is because the electrode heating is added to the heat of \nthe process, while in GTAW this heat is lost in the torch. However, if the heat loss from the \nelectrode in GTAW is about 5% as claimed by Tanaka and Lowke\n18\n a further explanation is \nrequired. This may be provided by the difference in arc temperature between GMAW and \nGTAW. Interestingly, few measurements have been made of the arc temperature in GMAW, \nand it has often been assumed that temperatures similar to GTAW (up to 20,000 K under the \nelectrode) are obtained\n19. Recent arc temperature measurements by Zielińska et al.20 indicate \nthat this may not be the case and that a peak temperature of 13000 K may occur in GMAW.  \nIt was postulated that this lower temperature was due to the cooling effect of iron vapour from \nthe wire. The reduced radiation losses from the lower temperature arc may explain the higher \nefficiency of GMAW.  Finally, numerical investigations such as those of Lim et al.\n21\n state that \nenergy transfer to the welded plate is from the both the arc and the liquid metal transfer from \nthe wire.  To the author’s knowledge no investigations have examined the efficiencies of \nthese individual contributions. \n \nIn this paper we aim to better understand the process efficiency of controlled dip transfer \nGMAW processes and compare them with a standard pulsed GMAW process. In addition, a \nliquid nitrogen calorimeter is compared with an insulated box calorimeter to determine the \nmost effective method for measuring the process efficiency. \n2 Experimental \n2.1 Liquid nitrogen calorimeter \nIn the experiments we used mild steel EN 440 G3Si1 - S355JR of size 100x200x2 mm. Prior \nto welding the surface of each of the plates was ground and degreased with acetone. The filler \nmetal used was 1 mm diameter EN 10025 – S355JR with a shielding gas mixture containing \n20% CO2 and 80% Ar. The plates were clamped away from the weld with aluminium clamps. \n \nThree trials were performed with the liquid nitrogen calorimeter. In the first trial we \ninvestigated the effect of the welding duration time on the process efficiency. The trial used \nthe Fronius Cold Metal Transfer (CMT)\n17\n process. The standard synergic line for this material \nwas used with a wire-feed speed of 7.8 m min\n-1\n, a welding speed of 0.5 m min\n-1\n and a contact \ntip to work distance of 13.5 mm.  The welding duration time was varied between 5 and 24 \nseconds. In the second trial, the delay time between completing the weld and inserting the \nsample in the liquid nitrogen Dewar was varied. The delay time is required to unclamp the \nplate and transfer it to the Dewar and the average time for this operation under normal \n 6 \nconditions was about 5 seconds. These tests varied the delay time between 5 and 900 seconds, \nwhile keeping the welding time constant at 10 seconds. \n \nThe third trial involved a comparison between the Fronius CMT, Lincoln RapidArc and STT \nand Kemppi FastROOT processes.  These trials used wire-feed speeds between 3 and 9.4 m \nmin\n-1\n, a contact tip to work distance of 13.5 mm, welding speeds between 0.2 and 0.8 m min\n-1\n \nand a welding time of approximately 10 seconds. \n \nIn all the welding trials, the arc voltage was measured at the contact tip, and the current was \nmeasured by a LEM PR1030 probe attached to the power cable which gave an output voltage \nwhich is proportional to the current.  A Yokagawa oscilloscope was used to record \ninstantaneous values of arc voltage and current (via the probe), and wire-feed speed (via a \ntachometer) at a sampling rate of 5000 Hz. The energy input from the power supply was \ncalculated with equation (2). \n \nThe liquid nitrogen was contained in a Statebourne Cryogenics Dewar which was 150 mm in \ndiameter and 297 mm in height. The Dewar was always filled to less than 75% capacity \nwhich avoided liquid nitrogen being lost due to splashing. The weight loss due to liquid \nnitrogen vaporization was measured using a Salter Brecknell B220 scale and was used to \ncalculate ΔmWT and ΔmRT (see equation (3)). Typical plots of the change in mass of the \nDewar due to normal vaporisation, and welding and room temperature samples is shown in \nFig. 1(a). Note that the mass loss due to normal vaporisation is accounted for in the \ncalculations.  Rather than doing a separate test for each room temperature sample it is possible \nto determine a calibration curve which relates the nitrogen mass loss to the mass of the \nspecimen, which is shown in Fig. 1(b). \n2.2 Insulated box calorimeter \nThe base material used for the experiments was S235 J2 and two material sizes were used for \nthe analysis. The first, which was used for the bead on plate (BOP) experiments was 250 mm \nlong, 50 mm wide and 5 mm thick.  The other sample which was used for the square groove \n(SG) experiments had the same overall dimensions except the thickness was 12 mm, and it \nhad the machined slot which is shown in Fig. 2(a). All samples were sandblasted prior to \nwelding, except for two of the SG samples where the original milled condition was used to \ndetermine the effect of different reflectivity. \n \nThe filler wire used for the trials was 1.0 mm diameter G3Si1 (DIN EN 440). Argon with \n18% CO2 was used for the shielding gas which had a flowrate of 12 l min\n-1\n. The contact tip to \nwork distance was 12 mm for all welds and the torch was mounted normal to the plate surface.  \nSynergic lines were used for both the pulsed and CMT processes, and the wirefeed speed was \nset to 8 m min\n-1\n for all welds, and the travel speed to 0.6 m min\n-1\n. For the 210 mm length \nwelds the duration of each weld was 21 seconds. The welding conditions were repeated 3 \ntimes for the BOP welds and 2 times for each of the SG welds. The energy input to the plate \nwas calculated with equation (2), and the arc voltage (at the contact tip) and current (via an \nLEM probe) were measured with a Tektronix DPO 4034 oscilloscope. \n \nThe calorimeter design is similar to that reported in Cantin and Francis\n11\n and is shown in Fig. \n2(b,c). The steel plates are attached to a large copper block, and a cover is placed over the top \nof the weld (see Fig. 2(c)). Three thermocouples are used to measure the temperature of the \ncopper block, and are placed at the beginning, middle and end of the block.  The inside of the \ncalorimeter is constructed from polyurethane foam which is coated with self-adhesive \naluminium foil. The foil is used to reflect the radiant heat back into the calorimeter to reduce \n 7 \nheat loss.  Although there will be some heat loss with the device, both the specific heat and \nthermal conductivity of the polyurethane are very low. \n \nThe calorimetric energy input to the plate is calculated with equation (4).  Since the total \ntemperature rise is usually relatively small 20-30\no\nC, constant values of specific heat were \nused and multiplied by the temperature difference before and after welding. A value of \n484 J kg\n-1\nK\n-1\n was used for the specific heat of S235 and a value of 388 J kg\n-1\nK\n-1\n was used for \nthe copper backing bar. Both these values were obtained from unpublished sources, but are \nsimilar to those reported in Holman\n22\n. The total mass of the steel and copper components was \nmeasured with an accurate scale. \n3 Results and discussion \n3.1 Liquid nitrogen calorimeter \nThe results from the trial that investigated the effect of the welding time are shown in Fig. \n3(a). Although there is a large amount of scatter in the results (±8%), they indicate that the \nprocess efficiency reduces with increasing welding time. The reduction in efficiency is caused \nby conduction from the sample into the jig, as well as convection from the sample after it is \nwelded.  An exponential curve has been fit to the data since it will asymptote to an efficiency \nof 0% for infinite weld times.  Note however that for the range of weld duration times \ninvestigated in this study the relationship is approximately linear.  Indeed, process efficiency \nis reduced by 12% after a 25 second weld compared with one that (theoretically) takes 0 \nseconds. A similar plot showing the effect of the delay time between completing welding and \ninserting the specimen into the liquid nitrogen Dewar is shown in Fig. 3(b). This plot \ndemonstrates how increased delay times reduce the calculated process efficiency. Thus, to \ncalculate the actual process efficiency it is necessary to subtract the errors due to both the \nwelding and delay times. For a 10 second weld the welding time error is approximately 3% \nand for a 5 second delay, the delay time error is 2%. Hence the total error is 5%, which is \napplied to the results in the welding process comparison in Fig. 3(c).  Although the results are \nshown as a function of the arc power, the influence of this parameter is weak.  In similar \ninvestigations, DuPont and Marder\n4\n found little effect of the current on the process efficiency, \nwhile Bosworth\n13\n found a small reduction with increasing burn-off.  Of more interest is the \ndifference in efficiency between the processes which indicate that the STT, FastROOT and \nCMT processes have a process efficiency of around 85%, while the RapidArc process has the \nlowest efficiency of 78%. \n \nThe relatively low process efficiency of the RapidArc process is a surprising result. As stated \npreviously, the peak current is sufficient to induce spray transfer. Indeed, Pepe\n10\n showed that \nthe peak current was in excess of 400 Amps compared to 250-350 for the other processes.  In \naddition, the arc voltage is 2-4 volts greater which can also lead to lower process efficiencies \ndue to the greater arc length as demonstrated by Bosworth\n13\n.  Finally, it should be noted that \nthe efficiencies in Fig. 3(c) are plotted against the average arc power, rather than the \ninstantaneous arc power.  Most articles in the literature report processes which are in steady-\nstate so the average and instantaneous powers are identical. \n3.2 Insulated Box Calorimeter \nA typical plot of the temperature versus time from the thermocouples in the insulated box \ncalorimeter is shown in Fig. 4.  As is demonstrated by this plot, the temperature reaches a \nsteady state value about 200-300 seconds after welding.  The slope of this curve was \nmeasured after the system reached steady state and indicated a temperature drop of \n 8 \napproximately 0.21\no\nC every 100 seconds, which corresponds to a heat loss rate of about 5.3 \nW. This value was used to adjust the subsequent calculations for the energy input to the plate. \n \nA plot of the calorimetric power input and average instantaneous power is shown in Fig. 5(a).  \nThe error bars in this plot and the subsequent one indicate the spread in the experimental data, \nrather than the standard deviation due to insufficient data.  The plot of the powers shows how \nthe CMT process has approximately 35-40% lower average instantaneous power than the \ncomparable GMAW-P process for the same wire-feed speed.  Secondly, there is an increase in \nthe average instantaneous power with the SG geometry which is more noticeable for the \nGMAW-P process. This could be due to the greater thermal losses which occur with this \ngeometry, and the synergic power supply compensates by increasing the power input. There \nwas no significant difference between the milled and sandblasted surface preparations in \neither the calorimetric power input or the average instantaneous power. Hence the surface \ncondition has little effect in terms of increasing the absorption. Note that this is to be expected \nif the welding temperature oxidises the surface in the vicinity of the arc. \n \nThe process efficiencies are shown in Fig. 5(b) and include average values from the liquid \nnitrogen calorimeter. These results indicate a relatively small difference in process efficiency \nbetween the GMAW-P and CMT processes. This finding contradicts Bosworth\n13\n who \ninvestigated dip transfer and found an efficiency of 94% compared with 85% for the standard \nprocess. Similarly Hsu et al.\n8\n found that the process efficiency of dip and Surface Tension \nTransfer modes was 85% compared with 73% for the standard process. In pure short-\ncircuiting mode there is no electronic control of the power supply which reduces the current \nwhen the short-circuit occurs. Therefore a considerable amount of the heating will occur \nresistively, without the corresponding radiation heat loss. In CMT (and STT) there is very \nlittle resistive heating due to the current being electronically reduced during short circuiting.  \nTherefore the heat is provided predominantly with the arc which has the associated radiation \nheat loss. Hence it is not surprising that the efficiencies are similar to the GMAW-P process.  \nThe 7-9% difference in efficiency between the BOP and SG welds is significant and indicates \nthat this radiation heat loss is now being captured by the walls of the groove. This is in \nagreement with the findings of Bosworth\n13\n. \n3.3 Comparison between the calorimetric methods \nIrrespective of the method used, accurate measurements of weld process efficiency are \ndifficult and fraught with both systematic and random errors. Unless the systematic errors are \naccounted for, this can lead to underestimates of the actual process efficiency.  Only the CMT \nprocess is common to both calorimetric methods with the liquid nitrogen method giving an \naverage value of 88% and the insulated box method giving a value of 81%. One reason for the \nlower value with the insulated box method is that although an error was included for the \nconductive heat losses from the box, this did not include a value based on the duration time \nlike the first set of experiments (Fig. 3(a)).  This loss would capture the effects of convection \nwhich were not adequately accounted for.   Overall, the efficiencies measured in this work are \nconsistent with researchers who claim that the efficiency for GMAW is between 80 and \n90%\n4,6,13\n. \n \nBoth calorimetric methods are considerably faster than the Seebeck calorimeter with the \nliquid nitrogen measurement taking about a minute and the insulated box calorimeter taking 5 \nto 6 minutes. One particular advantage with the insulated box calorimeter is the much smaller \nrandom error. Although only 2 or 3 experiments were undertaken for each condition, the error \nwas less than ±1.5%. This contrasts with up to ±8% error in measurements with the liquid \nnitrogen calorimeter. The main disadvantage of the insulated box calorimeter is that it \n 9 \nrequires a reasonably accurate prediction of the specific heat for the materials being welded. \nThis may be difficult to obtain for exotic materials. \n4 Conclusions \nIn this paper we demonstrated how both the liquid nitrogen and insulated box calorimeters \ncan be used to measure the process efficiency of various controlled GMAW processes.  It was \ndemonstrated that: \n The causes of systematic error need to be estimated and included in the calculations. \n All the controlled dip transfer processes measured with the liquid nitrogen calorimeter \nhad a process efficiency around 85%.  This compared with 78% for the Lincoln \nRapidArc process.  It was postulated that the lower efficiency of this process was due \nto the higher peak current and\/or voltage which causes spray transfer. \n The process efficiency of Fronius CMT, was only marginally greater (3%) than \nGMAW-P when measured by the insulated box calorimeter. \n Welding in a groove increased the process efficiency to around 90% since much of the \nradiation heat loss was absorbed by the side walls. \n The welding efficiency for the CMT process was lower (7%) when measured with the \ninsulated box calorimeter compared with the liquid nitrogen calorimeter.  It was \nsuggested that this may be due to the absence of the welding duration time error in the \ninsulated box calculations. \n Both calorimetric methods are considerably faster than the Seebeck calorimeter.  The \ninsulated box calorimeter has the advantage of much less random error than the liquid \nnitrogen calorimeter. \n5 Acknowledgements \nThe authors would like to thank BP for their financial support of this work as well as \nFRONIUS International GmbH, Wels Austria, which provided the facilities to perform the \ninsulated box experiments. In addition the authors wish to thank Mr. B. Brooks, Mr. F. \nNielsen, Mr H. Hackl, Mr W. Stieglbauer, Mr A. Leonhartsberger, Mr G. Miessbacher and Dr. \nA. Eder for their support and guidance. \n6 References \n1. S. Kou: 'Welding Metallurgy', 461; 2003, New York, USA, Wiley-Interscience.  \n2. A. Joseph, D. Harwig, D. F. Farson and R. Richardson: 'Measurement and calculation of \narc power and heat transfer efficiency in pulsed gas metal arc welding', Science and \nTechnology of Welding and Joining, 2003, 8, 400-406.  \n3. P. W. Fuerschbach and G. A. Knorovsky: 'A study of melting efficiency in plasma arc and \ngas tungsten arc welding', Welding Journal, 1991, 70, 287s-297s.  \n4. J. N. DuPont and A. R. Marder: 'Thermal efficiency of arc welding processes', Weld J \n(Miami Fla), 1995, 74, 406-s.  \n5. D. M. Evans, D. Huang, J. C. McClure and A. C. Nunes: 'Arc efficiency of plasma arc \nwelding', Weld J (Miami Fla), 1998, 77, 53-s.  \n6. W. H. Giedt, L. N. Tallerico and P. W. Fuerschbach: 'GTA welding efficiency: calorimetric \nand temperature field measurements', Welding Journal, 1989, 68, 28s-32s.  \n7. A. Joseph, D. Harwig, D. F. Farson and R. Richardson: 'Measurement and calculation of \narc power and heat transfer efficiency in pulsed gas metal arc welding', Science and \nTechnology of Welding and Joining, 2003, 8, 400-406.  \n8. C. Hsu and P. Soltis: Proc. ASM Proceedings of the International Conference: Trends in \nWelding Research, 369-374.  \n 10 \n9. D. Yapp and N. C. Pepe: Proc. IIW Commission IV, XII and SG212 Intermediate Meeting, \nFjerritslev, Denmark, 22nd - 24th April, 2008, .  \n10. N. C. Pepe: 'Advances in Gas Metal Arc Welding and Application to Corrosion Resistant \nAlloy Pipes', 2010, PhD Thesis, Cranfield University.  \n11. G. M. D. Cantin and J. A. Francis: 'Arc power and efficiency in gas tungsten arc welding \nof aluminium', Science and Technology of Welding and Joining, 2005, 10, 200-210.  \n12. P. A. Colegrove, C. Ikeagu, A. Thistlethwaite, S. W. Williams, T. Nagy, W. Suder, S. \nSteuwer and T. Pirling: 'The welding process impact on residual stress and distortion', Science \nand Technology of Welding & Joining, 2009, 14, 717-725.  \n13. M. R. Bosworth: 'Effective heat input in pulsed gas metal arc welding with solid wire \nelectrodes', Welding Journal, 1991, 70, 111s-117s.  \n14. J. Norrish: 'Advanced Welding Processes', 2006, Cambridge, England, Woodhead \nPublishing Limited.  \n15. P. Broughton and G. J. MacGregor: 'Control of short circuiting in MIG welding', Welding \nResearch International, 1974, 4, 31-53.  \n16. G. Huismann: 6-8.  \n17. A. Schierl: 'The CMT - Process - A Revolution in welding technology', Weld. World, \n2005, 49, 38.  \n18. M. Tanaka and J. J. Lowke: 'Predictions of weld pool profiles using plasma physics', J. \nPhys. D, 2007, 40, R1-R23.  \n19. M. Schnick, U. Füssel, M. Hertel, A. Spille-Kohoff and A. B. Murphy: 'Metal vapour \ncauses a central minimum in arc temperature in gas-metal arc welding through increased \nradiative emission', J. Phys. D, 2010, 43.  \n20. S. Zielińska, K. Musioł, K. Dzierga, S. Pellerin, F. Valensi, C. De Izarra and F. Briand: \n'Investigations of GMAW plasma by optical emission spectroscopy', Plasma Sources Sci. \nTechnol., 2007, 16, 832-838.  \n21. Y. C. Lim, D. F. Farson, M. H. Cho and J. H. Cho: 'Stationary GMAW-P weld metal \ndeposit spreading', Science and Technology of Welding and Joining, 2009, 14, 626-635.  \n22. J. P. Holman: 'Heat Transfer, 7th Edition', 1990, San Francisco, McGraw Hill.  \n \n 11 \nTime [s]\n0 50 100 150 200\nTo\nta\nl W\ne\nig\nh\nt  \n[g\n]\n7600\n7700\n7800\n7900\n8000\n8100\n8200\n8300\nNormal vaporization rate\nVaporization from welding temperature\nVaporization from room temperature\n \nMass of the Specimens [g]\n0 200 400 600 800 1000\nL\no\ns\ns\n o\nf \nN\n2\n [\ng\n]\n0\n50\n100\n150\n200\n250\n300\n350\n \nFig. 1 (a) Comparison between the normal vaporisation rate of liquid nitrogen with vaporisation from the \nwelding and room temperature samples; and (b) correlation between the mass of the specimen and the amount of \nliquid nitrogen evaporated for samples initially at room temperature. \n \n \na \nb \nY = 0.3747 X \nr2=0.9992  \n 12 \n \n \n \n \n \n \nFig. 2 (a) Dimensions of the groove; (b) calorimeter design showing the inside of the insulated box with the \ncopper block; and (c) schematic showing how the calorimeter works while welding. \nb \nc \na \n 13 \n \nWelding Time [s]\n0 5 10 15 20 25\nP\nro\nc\ne\ns\ns\n E\nff\nic\nie\nn\nc\ny\n [\n%\n]\n50\n60\n70\n80\n90\n100\n \nLog (Delay Time) [s]\n1 10 100 1000\nP\nro\nc\ne\ns\ns\n  \nE\nff\nic\nie\nn\nc\ny\n  \n[%\n]\n0\n20\n40\n60\n80\n100\n \nArc Power [W]\n1000 2000 3000 4000 5000 6000\nP\nro\nc\ne\ns\ns\n E\nff\nic\nie\nn\nc\ny\n [\n%\n]\n50\n60\n70\n80\n90\n100\nCMT\nSTT\nFastROOT\nRapidArc\n \nFig. 3 Effect of (a) welding duration time; (b) delay time and (c) welding process on the \nprocess efficiency. \na \nb \nc \n 14 \n \nTime [s]\n0 200 400 600 800\nT\ne\nm\np\ne\nra\ntu\nre\n [\n°C\n]\n0\n10\n20\n30\n40\n50\n60\n70\nCentre\nFinish\nStart\nAmbient\n \nFig. 4 Temperature measurements from a CMT BOP weld. \n \n 15 \n \nP\n-G\nM\nA\nW\n B\nO\nP\n I\nB\nP\n-G\nM\nA\nW\n S\nG\n I\nB\nC\nM\nT\n B\nO\nP\n I\nB\nC\nM\nT\n S\nG\n I\nB\nC\nM\nT\n S\nG\n-m\nill\ne\nd\n I\nB\nA\nrc\n P\no\nw\ne\nr \n[k\nW\n]\n0\n1\n2\n3\n4\n5\n6\nCalorimetric Power Input\nAverage Instantaneous Power\n \n \nFig. 5 (a) Calorimetric power input and average instantaneous power and (b) process efficiency for the different \ngeometries, power supplies and measurement methods.  Note IB = insulated box and LN = liquid nitrogen. \n \n \nb \na \n"}