{"doi":"10.1258\/jhsrp.2010.009115","coreId":"215292","oai":"oai:eprints.lse.ac.uk:28968","identifiers":["oai:eprints.lse.ac.uk:28968","10.1258\/jhsrp.2010.009115"],"title":"Difficulties of tracing health research funded by the European Union","authors":["Ernst, Kelly","Irwin, Rachel","Galsworthy, Michael J.","McKee, Martin","Charlesworth, Kate","Mismar, Matthias"],"enrichments":{"references":[],"documentType":{"type":null}},"contributors":[],"datePublished":"2010-07","abstract":"Objective: European Union (EU) information from research projects, including key findings, should be available on the European Commission's Community Research and Development Information Service (CORDIS) database. We describe the results of the Health Research for Europe (HR4E) project which aimed to synthesize results of health research from the EU's Fifth and Sixth Framework Programmes (FP5 and FP6) of research. Methods: Screening of titles and abstracts of all projects funded within FP5 and FP6 to identify health-related projects followed by allocation of such projects to one of the 47 themes of the European Union's Health Portal. Extraction of key findings relevant for policy and practice from data on the CORDIS database and, in a subset of 182 projects selected from five themes, attempted contact with project co-ordinators to obtain missing information. Results: The information held on CORDIS was inadequate, with many fields not completed. Data were rarely updated after the project had been funded. Of the 182 attempts to contact co-ordinators, useful information was obtained in only 17% of cases, with many contact details missing or unverifiable. Conclusions: CORDIS does not meet its stated objectives of facilitating and disseminating EU research. There is a clear need to review the systems designed to manage the CORDIS platfor","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"The Royal Society of Medicine Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:28968<\/identifier><datestamp>\n      2017-05-04T09:35:26Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/28968\/<\/dc:relation><dc:title>\n        Difficulties of tracing health research funded by the European Union<\/dc:title><dc:creator>\n        Ernst, Kelly<\/dc:creator><dc:creator>\n        Irwin, Rachel<\/dc:creator><dc:creator>\n        Galsworthy, Michael J.<\/dc:creator><dc:creator>\n        McKee, Martin<\/dc:creator><dc:creator>\n        Charlesworth, Kate<\/dc:creator><dc:creator>\n        Mismar, Matthias<\/dc:creator><dc:subject>\n        R Medicine (General)<\/dc:subject><dc:subject>\n        HJ Public Finance<\/dc:subject><dc:subject>\n        RA Public aspects of medicine<\/dc:subject><dc:description>\n        Objective: European Union (EU) information from research projects, including key findings, should be available on the European Commission's Community Research and Development Information Service (CORDIS) database. We describe the results of the Health Research for Europe (HR4E) project which aimed to synthesize results of health research from the EU's Fifth and Sixth Framework Programmes (FP5 and FP6) of research. Methods: Screening of titles and abstracts of all projects funded within FP5 and FP6 to identify health-related projects followed by allocation of such projects to one of the 47 themes of the European Union's Health Portal. Extraction of key findings relevant for policy and practice from data on the CORDIS database and, in a subset of 182 projects selected from five themes, attempted contact with project co-ordinators to obtain missing information. Results: The information held on CORDIS was inadequate, with many fields not completed. Data were rarely updated after the project had been funded. Of the 182 attempts to contact co-ordinators, useful information was obtained in only 17% of cases, with many contact details missing or unverifiable. Conclusions: CORDIS does not meet its stated objectives of facilitating and disseminating EU research. There is a clear need to review the systems designed to manage the CORDIS platform<\/dc:description><dc:publisher>\n        The Royal Society of Medicine Press<\/dc:publisher><dc:date>\n        2010-07<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n          Ernst, Kelly and Irwin, Rachel and Galsworthy, Michael J. and McKee, Martin and Charlesworth, Kate and Mismar, Matthias  (2010) Difficulties of tracing health research funded by the European Union.  Journal of Health Services Research and Policy, 15 (5).  pp. 133-136.  ISSN 1355-8196     <\/dc:identifier><dc:relation>\n        http:\/\/jhsrp.rsmjournals.com\/<\/dc:relation><dc:relation>\n        10.1258\/jhsrp.2010.009115<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/eprints.lse.ac.uk\/28968\/","http:\/\/jhsrp.rsmjournals.com\/","10.1258\/jhsrp.2010.009115"],"year":2010,"topics":["R Medicine (General)","HJ Public Finance","RA Public aspects of medicine"],"subject":["Article","PeerReviewed"],"fullText":null}