{"doi":"10.1016\/j.ctrv.2006.12.004","coreId":"191416","oai":"oai:lra.le.ac.uk:2381\/855","identifiers":["oai:lra.le.ac.uk:2381\/855","10.1016\/j.ctrv.2006.12.004"],"title":"Modulation of response to cancer chemotherapeutic agents by diet constituents: is the available evidence sufficiently robust for rational advice for patients?","authors":["D'Incalci, M.","Steward, William P.","Gescher, Andreas J."],"enrichments":{"references":[{"id":44627825,"title":"A phase I study of vitamin E, 5-fluorouracil and leucovorin for advanced malignancies. Invest New Drugs","authors":[],"date":"2001","doi":null,"raw":"Blanke CD Stipanov M, Morrow J, et al. A phase I study of vitamin E, 5-fluorouracil and leucovorin for advanced malignancies. Invest New Drugs 2001; 19:21-27.","cites":null},{"id":44627835,"title":"Antioxidants and cancer therapy: a systematic review.","authors":[],"date":"2004","doi":null,"raw":"Ladas EJ, Jacobsen JS, Kennedy DD, Teel, K, Fleischauer A, Kelly KM. Antioxidants and cancer therapy: a systematic review. J Clin Onc 2004; 22: 517-28.","cites":null},{"id":44627821,"title":"Assessment of dietary questionnaire in cancer patients receiving cytotoxic chemotherapy.","authors":[],"date":"2005","doi":null,"raw":"Meyerhardt JA, Heseltine D, Campos H, Holmes MD, Willett DC, Winer EP, Enzinger PC, Bunnell CA, Kulke MH, Fuchs CS. Assessment of dietary questionnaire in cancer patients receiving cytotoxic chemotherapy. J Clin Oncol 2005; 23: 8453-60.","cites":null},{"id":44627840,"title":"Cancer prevention with dietary phytochemicals.","authors":[],"date":"2003","doi":"10.1038\/nrc1189","raw":"Surh YJ. Cancer prevention with dietary phytochemicals. Nature Rev Cancer 2003; 3:768-780.","cites":null},{"id":44627829,"title":"Cardioprotection in patients undergoing chemo- and\/or radiotherapy for neoplastic disease. A pilot study.","authors":[],"date":"1996","doi":"10.1536\/ihj.37.353","raw":"Wagdi P, Fluri M, Aeschbacher B, et al. Cardioprotection in patients undergoing chemo- and\/or radiotherapy for neoplastic disease. A pilot study. Jpn Heart J 1996; 37: 353-359.","cites":null},{"id":44627827,"title":"Clinical and pharmacological investigation of the effects of alpha-tocopherol on adriamycin cardiotoxicity.","authors":[],"date":"1982","doi":"10.1111\/j.1749-6632.1982.tb31279.x","raw":"Legha SS, Wang YM, Mackay B et al. Clinical and pharmacological investigation of the effects of alpha-tocopherol on adriamycin cardiotoxicity. Ann NY Acad Sci 1982; 393:411-418.","cites":null},{"id":44627842,"title":"Comprehensive analysis of UGT1A polymorphisms predictive for pharmacokinetics and treatment outcome in patients with non-small-cell lung cancer treated with irinotecan and cisplatin.","authors":[],"date":"2006","doi":"10.1200\/jco.2005.03.0239","raw":"Han JY, Lim HS, Shin ES, Yoo YK, Park YH, Lee JE, Jang IN, Lee DH, Lee JS. Comprehensive analysis of UGT1A polymorphisms predictive for pharmacokinetics and treatment outcome in patients with non-small-cell lung cancer treated with irinotecan and cisplatin. J Clin Oncol 2006; 24: 2237-2244.","cites":null},{"id":44627843,"title":"Cruciferae interact with the UGT1A1*28 polymorphism to determine serum bilirubin levels in humans.","authors":[],"date":"2005","doi":null,"raw":"Peterson S, Bigler, J, Horner NK, Potter JD, Lampe JW. Cruciferae interact with the UGT1A1*28 polymorphism to determine serum bilirubin levels in humans. J Nutr 2005; 135: 1051-1055.","cites":null},{"id":44627818,"title":"Effect of vitamin B12, folate, and dietary supplements on breast carcinoma chemotherapy – induced mucositis and neutropenia. Cancer","authors":[],"date":"2004","doi":"10.1002\/cncr.20484","raw":"Branda RF, Naud SJ, Brooks EM, Chen Z, Muss H. Effect of vitamin B12, folate, and dietary supplements on breast carcinoma chemotherapy – induced mucositis and neutropenia. Cancer 2004; 101: 1058-64.","cites":null},{"id":44627833,"title":"Grapefruit juice and potential drug interactions. Consult Pharm","authors":[],"date":"2003","doi":null,"raw":"Hare JT, Elliott DP. Grapefruit juice and potential drug interactions. Consult Pharm 2003; 18: 466-472.","cites":null},{"id":44627828,"title":"High dose alpha-tocopherol as a preventive of doxorubicin-induced alopecia. Cancer Ther Rep","authors":[],"date":"1986","doi":null,"raw":"Perez JE, Macchiavelli M, Leone BA, et al. High dose alpha-tocopherol as a preventive of doxorubicin-induced alopecia. Cancer Ther Rep 1986; 70: 1213-1214.","cites":null},{"id":44627820,"title":"High folate diets and brest cancer survival in a prospective cohort study. Nutr Cancer","authors":[],"date":"2002","doi":"10.1207\/s15327914nc4402_03","raw":"Sellers TA, Alberts SR, Vierkant RA, Grabrick DM, Cerhan JR, Vachon CM, Olson JE, Kushi LH, Potter JD. High folate diets and brest cancer survival in a prospective cohort study. Nutr Cancer 2002, 44: 139-44.","cites":null},{"id":44627823,"title":"Neuroprotective effect of vitamin E supplementation in patients treated with cisplatin chemotherapy.","authors":[],"date":"2003","doi":"10.1016\/s0959-8049(01)81826-8","raw":"Pace A, Savarese A, Picardo M, Maresca V, Pacetti U, Del Monte G, Biroccio A, Leonetti C, Jandola B, Cognetti F, Bove L. Neuroprotective effect of vitamin E supplementation in patients treated with cisplatin chemotherapy. J Clin Oncol 2003; 21: 927-31.","cites":null},{"id":44627838,"title":"Nutritional interventions and outcome in patients with cancer or preinvasive lesions: systematic review.","authors":[],"date":"2006","doi":"10.1093\/jnci\/djj263","raw":"Davies AA, Smith GD, Harbord R, Bekkering GE, Sterne JAC, Beynon R, Thomas S. Nutritional interventions and outcome in patients with cancer or preinvasive lesions: systematic review. J Natl Cancer Inst 2006; 98: 961-73.","cites":null},{"id":44627831,"title":"Prevention of chemotherapy and radiation toxicity with glutamine. Cancer Treat Rev","authors":[],"date":"2003","doi":"10.1016\/s0305-7372(03)00133-6","raw":"Savarese DMF, Savy G, Vahdat L, Wischmeyer PE, Corey B. Prevention of chemotherapy and radiation toxicity with glutamine. Cancer Treat Rev 2003; 29:501-","cites":null},{"id":44627826,"title":"Prospective study of tocopherol prophylaxis for anthracycline cardiac toxicity. Current Ther Res","authors":[],"date":"1980","doi":null,"raw":"Weitzman SS, Lorell B, Carey RW et al. Prospective study of tocopherol prophylaxis for anthracycline cardiac toxicity. Current Ther Res 1980; 28: 682-686.","cites":null},{"id":44627830,"title":"Protective role of selenium against the toxicity of multi-drug chemotherapy in patients with ovarian cancer. Pharmazie","authors":[],"date":"2000","doi":null,"raw":"Sieja K. Protective role of selenium against the toxicity of multi-drug chemotherapy in patients with ovarian cancer. Pharmazie 2000; 55:958-959.","cites":null},{"id":44627841,"title":"Selective modulation of the therapeutic efficacvy of anticancer drugs by selenium containing compounds against human tumor xenografts. Clinical Cancer Res","authors":[],"date":"2004","doi":"10.1158\/1078-0432.ccr-03-0268","raw":"Cao S, Durrani FA, Rustum YM. Selective modulation of the therapeutic efficacvy of anticancer drugs by selenium containing compounds against human tumor xenografts. Clinical Cancer Res 2004; 10, 2561-2569.","cites":null},{"id":44627839,"title":"Selenium supplementation may increase the efficacy of cetuximab in metastatic colorectal cancer patients. Med Hypoth","authors":[],"date":"2005","doi":"10.1016\/j.mehy.2004.11.041","raw":"Altundag K, Silay YS, Altundag O, Ygitbasi OG, Gundeslioglu O, Gunduz M. Selenium supplementation may increase the efficacy of cetuximab in metastatic colorectal cancer patients. Med Hypoth 2005; 64:1162-5.","cites":null},{"id":44627822,"title":"Supplementation with antioxidant micronutrients and chemotherapy-induced toxicity in cancer patients treated with cisplatin-based chemotherapy: a randomised double-blind, placebo-controlled study.","authors":[],"date":"2004","doi":"10.1016\/j.ejca.2004.02.029","raw":"Weijl NI, Elsendoorn TJ, Lentjes EGWM, Hopman GD, Wipkink-Bakker A, Zwinderman AH, Cleton FJ, Osanto S. Supplementation with antioxidant micronutrients and chemotherapy-induced toxicity in cancer patients treated with cisplatin-based chemotherapy: a randomised double-blind, placebo-controlled study. Eur J Cancer 2004; 40: 1713-23.","cites":null},{"id":44627824,"title":"The protective role of selenium on the toxicity of cisplatin-contained chemotherapy regimen in cancer patients. Biol Trace Elem Res","authors":[],"date":"1997","doi":"10.1007\/bf02785304","raw":"Hu YJ, Chen Y, Zhang YQ, et al. The protective role of selenium on the toxicity of cisplatin-contained chemotherapy regimen in cancer patients. Biol Trace Elem Res 1997; 56:331-334.","cites":null},{"id":44627844,"title":"Toward a core nutraceutical program for cancer management. Integr Cancer Ther","authors":[],"date":"2006","doi":null,"raw":"McCarthy MF, Block KI. Toward a core nutraceutical program for cancer management. Integr Cancer Ther 2006; 5:150-171. Adria, cyclophos, bleo, vincr, procarb, prednis, dacarb, vinblast, VP16 [40] Glutamin Paclitaxel, anthracyclins [42]","cites":null},{"id":44627837,"title":"Use of antioxidants during chemotherapy and radiotherapy should be avoided.","authors":[],"date":"2005","doi":"10.3322\/canjclin.55.5.319","raw":"D’Andrea GM. Use of antioxidants during chemotherapy and radiotherapy should be avoided. CA Cancer J Clin 2005; 55: 319-21.","cites":null}],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2007-02-27","abstract":"This is the authors' final draft of the paper published as Cancer Treatment Reviews, 2007, 33(3), pp. 223-9, DOI: 10.1016\/j.ctrv.2006.12.004Background: Patients who are diagnosed with cancer want advice on how they may alter their diet or which diet supplements they should take to augment chemotherapy.\\ud\nMethods: We conducted a review of the literature mostly from the last 15 years on\\ud\nthe interaction between dietary constituents and antineoplastic therapy in preclinical\\ud\nrodent models and in clinical trials.\\ud\nResults: Studies have explored the effect of predominantly antioxidant vitamins and\\ud\nfolate on efficacy or toxicity mediated by cisplatin and anthracyclins. Cisplatin\\ud\ntoxicity in rodents was ameliorated by vitamin E. The design of clinical studies of\\ud\ndietary agents in combination with cytotoxic agents has been very heterogeneous and\\ud\nresults have been inconclusive.\\ud\nConclusions: Whilst preclinical experiments hint at a potential benefit of certain\\ud\ndietary agents, the evidence emanating from clinical studies does not allow firm\\ud\nconclusions to be made. Future studies should explore physiological doses of dietary\\ud\nagent and include pharmacokinetic and pharmacodynamic measurements","downloadUrl":"http:\/\/hdl.handle.net\/2381\/855","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/855\/1\/MNdietrev.pdf","pdfHashValue":"d14267c0d255f50538c42a87d35f226950c9a115","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/855<\/identifier><datestamp>\n                2017-01-24T15:51:03Z<\/datestamp><setSpec>\n                com_2381_162<\/setSpec><setSpec>\n                com_2381_9550<\/setSpec><setSpec>\n                col_2381_163<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nModulation of response to cancer chemotherapeutic agents by diet constituents: is the available evidence sufficiently robust for rational advice for patients?<\/dc:title><dc:creator>\nD'Incalci, M.<\/dc:creator><dc:creator>\nSteward, William P.<\/dc:creator><dc:creator>\nGescher, Andreas J.<\/dc:creator><dc:description>\nThis is the authors' final draft of the paper published as Cancer Treatment Reviews, 2007, 33(3), pp. 223-9, DOI: 10.1016\/j.ctrv.2006.12.004<\/dc:description><dc:description>\nBackground: Patients who are diagnosed with cancer want advice on how they may alter their diet or which diet supplements they should take to augment chemotherapy.\\ud\nMethods: We conducted a review of the literature mostly from the last 15 years on\\ud\nthe interaction between dietary constituents and antineoplastic therapy in preclinical\\ud\nrodent models and in clinical trials.\\ud\nResults: Studies have explored the effect of predominantly antioxidant vitamins and\\ud\nfolate on efficacy or toxicity mediated by cisplatin and anthracyclins. Cisplatin\\ud\ntoxicity in rodents was ameliorated by vitamin E. The design of clinical studies of\\ud\ndietary agents in combination with cytotoxic agents has been very heterogeneous and\\ud\nresults have been inconclusive.\\ud\nConclusions: Whilst preclinical experiments hint at a potential benefit of certain\\ud\ndietary agents, the evidence emanating from clinical studies does not allow firm\\ud\nconclusions to be made. Future studies should explore physiological doses of dietary\\ud\nagent and include pharmacokinetic and pharmacodynamic measurements.<\/dc:description><dc:date>\n2007-09-06T14:21:33Z<\/dc:date><dc:date>\n2007-09-06T14:21:33Z<\/dc:date><dc:date>\n2007-02-27<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nCancer Treatment Reviews, 2007, 33(3), pp. 223-9.<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/855<\/dc:identifier><dc:identifier>\nhttp:\/\/www.sciencedirect.com\/science\/article\/pii\/S0305737207000060<\/dc:identifier><dc:identifier>\n10.1016\/j.ctrv.2006.12.004<\/dc:identifier><dc:language>\nen<\/dc:language><dc:publisher>\nElsevier<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":[],"subject":["Article"],"fullText":"1Article type: review \n \nModulation of response to cancer chemotherapeutic agents by diet \nconstituents – is the available evidence sufficiently robust for rational \nadvice for patients? \n \nM D’Incalci1, WP Steward2 & AJ Gescher2\n1Department of  Oncology, Istituto di Ricerche Farmacologiche “Mario Negri”, \nMilan, Italy; 2Cancer Biomarkers and Prevention Group, Department of Cancer \nStudies, University of Leicester, UK \n \nAddress for  correspondence: Maurizio D’Incalci, Department of Oncology, Istituto \ndi Ricerche Farmacologiche “Mario Negri”, Via Eritrea 62, 20157 Milan, Italy, \nphone: +39-02-39014473, fax: +39-02-3546277, e-mail: dincalci@marionegri.it \n2Abstract \nBackground: Patients who are diagnosed with cancer want advice on how they may \nalter their diet or which diet supplements they should take to augment chemotherapy.  \nMethods: We conducted a review of the literature mostly from the last 15 years on \nthe interaction between dietary constituents and antineoplastic therapy in preclinical \nrodent models and in clinical trials.  \nResults: Studies have explored the effect of predominantly antioxidant vitamins and \nfolate on efficacy or toxicity mediated by cisplatin and anthracyclins. Cisplatin \ntoxicity in rodents was ameliorated by vitamin E. The design of clinical studies of \ndietary agents in combination with cytotoxic agents has been very heterogeneous and \nresults have been inconclusive. \nConclusions: Whilst preclinical experiments hint at a potential benefit of certain \ndietary agents, the evidence emanating from clinical studies does not allow firm \nconclusions to be made. Future studies should explore physiological doses of dietary \nagent and include pharmacokinetic and pharmacodynamic measurements. \n \nKeywords: Diet, cytotoxic therapy, drug interaction  \n3Introduction \nAfter a diagnosis of cancer, patients are highly motivated to seek information about \ndiet and dietary supplement use.  Studies of women with breast cancer indicate that a \nmajority of them are interested in altering their diet to aid therapy [1]. Whilst \noncologists often face patients’ questions as to which dietary measure, if indeed any, \nmight support their therapeutic strategies, evidence-based information, which may \nhelp formulate such dietary advice, is scarce. In the absence of robust scientific \ninformation patients easily fall victim to unscientific propaganda. In principle there \nmight be dietary agents the use of which might be encouraged, because they, in \nconcert with drugs, may help to reduce tumour growth, and agents which should best \nbe avoided, because they may counteract antineoplastic drug activity. Here we review \npreclinical and clinical information published within the past two decades describing \nthe impact of diet constituents on antineoplastic therapy. The aim of the commentary \nis to pinpoint strategies designed to identify diet constituents worthy of further clinical \nevaluation to augment chemotherapy. The commentary focuses on discreet diet-\nderived chemical entities rather than intact food matrices, which, as variable mixtures \nof numerous bioactive components, confound robust and reproducible \npharmacological characterization. Literature describing potential intrinsic \nantineoplastic activity of dietary compounds [2] is excluded, and the commentary is \nnot a comprehensive review the literature. Most of the published information \navailable deals with vitamins, antioxidants and folic acid, which are arguably among \nnutritional supplements used most frequently by the general public.   \n \n4Nutritional status of cancer patients \nThe nutritional status in cancer patients can be compromised by the disease itself, e.g. \nby cancer–related cachexia. Poor nutritional status in such patients has been linked \nwith poor prognosis [3].  It is conceivable that poor prognosis may be related to the \ndetrimental impact of malnutrition on the efficacy, toxicity or pharmacokinetics of \nantineoplastic drugs. Nutritional imbalance in cancer patients has been well \ndocumented.  The effect of selenium and zinc supplementation was evaluated in \nmalnourished patients with gastro-intestinal or oesophageal cancer, who received \nchemotherapy [4].  Prior to commencement of therapy, serum concentrations of \nselenium and zinc were significantly lower than those in control (non-cancer) patients. \nIn contrast, serum copper concentrations were elevated over those in controls. In this \nstudy the nutritional status of 70% of the patients on supplements did not deteriorate, \nwhilst it worsened in 80% of patients on un-supplemented diet. In a case study \ninvolving lung cancer patients, 64% displayed serum vitamin C levels below the \nthreshold associated with development of scurvy [5].  In contrast, surgically resected \nlung cancer tissues contained higher levels of vitamin C compared with normal \nadjacent tissue [6]. Several studies reported that patients with advanced cancer have \nlow folic acid levels [7-12]. All these imbalances may conceivably impact \ndetrimentally on chemotherapy (vide infra). Vice versa nutritional intervention can \nprobably improve prognosis. Consistent with this notion, a cross sectional study in \npatients with non-small cell lung cancer suggested that supplemental vitamin intake \nwas associated with an increase in long-term survival from a median of 11 months in \nnon-users of supplements to 41 months in supplement users [13].   \n \n5Effect of diet constituents on chemotherapy: preclinical evidence  \nThe influence of diet constituents on the response to antineoplastic drugs can occur on \ndifferent levels, affecting either drug efficacy, toxicity and\/or pharmacokinetics. Table \n1 provides examples of interventions, which have been shown to augment efficacy or \nreduce toxicity of cytotoxic chemotherapy in rodents. \n \nModulators of drug metabolism \nAn instructive example of a diet constituent which alters the pharmacokinetics of a \ncytotoxic agent is provided by dimethyl fumarate, a dietary metabolite of fumaric acid \nfound in fruits and vegetables [14]. Dimethyl fumarate induces NADPH:quinone \noxidoreductase I (NQO-1). When added to the diet at 0.3%, it increased NQO-1 \nactivity in tumor tissue of nude mice bearing the HCT116 cell tumour. Mitomycin C \nis activated to a cytotoxic species via catalysis by reducing enzymes such as NQO-1. \nIn mice, which received mitomycin C together with dimethyl fumarate, tumors were \nsignificantly smaller than those in mice on mitomycin C only, yet dimethyl fumarate \ndid not increase host toxicity.  \n \nAntioxidants \nExamples of dietary antioxidants are vitamins A, C and E, selenium and flavonoids \nsuch as quercetin and genistein. In several in vitro and animal studies the hypothesis \nhas been tested that antioxidants benefit patients receiving chemotherapy. In principle \ntwo opposing mechanistic arguments could be advanced supporting or refuting this \nnotion. On the one hand, antioxidants might protect cancer cells against the oxidative \ndamage induced by chemotherapy, which would mitigate against their use. On the \nother hand they may enhance drug-induced cytotoxicity by blocking reactive oxidant \n6species. Reactive oxidant species generated by cancer cells or by cytotoxic agents \n[15] are thought to decrease cell proliferation rate, prolonging the G1 phase of the cell \ncycle and consequently rendering cells less susceptible to cytotoxic drug attack. \nAntioxidants might counteract this unwanted inhibitory effect of oxidative stress on \ncell proliferation. Evidence supporting the former notion is provided by the finding \nthat \u0001-tocopherol (vitamin E) inhibited reactive oxygen generation and blocked \ncisplatin-induced apoptosis in human-derived breast cancer cells [16]. In contrast, \nPrasad et al [17] showed that 5-FU, bleomycin, adriamycin, cis-platin or sodium \nbutyrate combined with the dietary antioxidants vitamin C and E, A or beta-carotene \ninhibited the growth of murine neuroblastoma cells more potently than the \nantineoplastic agents alone. In another study dietary supplementation with vitamin C \nin rats, which received cisplatin, failed to significantly reduce cisplatin-induced \nkidney toxicity or oxidative DNA damage as reflected by urinary levels of 8-OHdG, \neven though a trend towards protection was observed [18].  The whole-body toxicity \nof high-dose cis-platin in mice bearing human melanoma was reduced by \ncoadministration of vitamin E without compromising antitumour activity [19]. This \nprotection was accompanied by an antioxidant effect as reflected by polyunsaturated \nfatty acids and thiobarbituric acid-reactive substances in kidneys and liver.  In a \nreview evidence emanating from rodent studies was presented suggesting that \nantioxidant vitamins A and C, coenzyme Q, flavonoids from herbs, olive oil or \nselenium can ameliorate the cardiac toxicity associated with adriamycin [20]. The \npharmacodynamic parameters studied were cardiomyopathy and oxidative stress. \nWhilst tentative evidence for protection against adriamycin-induced cardiotoxicity \nwas observed in some studies, results were negative in most.  \n \n7Folate \nThe interaction between nutritional folate and anticancer drug response has received \nconsiderable attention. In an early investigation, mice bearing the P388 lymphocytic \nleukaemia were significantly more sensitive to 5-FU, cytosine arabinoside, 6-\nmercaptopurine or methotrexate, when these drugs were administered together with, \nor subsequent to, a large dose of folate [21]. More recently mice bearing the C3H \nmammary carcinoma on a low folate diet were shown to suffer 3000-fold more \ntoxicity, as measured by lethality, after treatment with lometrexol, an antipurine \nantifolate, than control animals on normal folate [22]. In this study lometrexol caused \nhardly any efficacy in terms of tumor growth inhibition in the low-folate mice. In \ncontrast, supplementation of the diet with folate improved efficacy and ameliorated \ntoxicity. The effect of folate supplementation on toxicity exerted by \ncyclophosphamide or 5-FU was studied in rats [23]. Protocols included a folate-free \ndiet, or a diet with folate-containing cereal, or a low folate diet (2mg folate\/kg diet) or \nhigh folate treatment (dietary folate plus 50 mg\/kg ip daily). Whole body toxicity \nexerted by cyclophosphamide as reflected by the LD50 was lower for the cereal diet \ngroup than the other groups. With respect to 5-FU toxicity, there was no significant \neffect of the low folate diet in comparison to the folate-free diet. However 5-FU \ncaused more severe anaemia, azotemia and leukopaenia in the high-folate group than \nin the other groups, suggesting that excessive amounts of folic acid may be \ndeleterious. In a study using ApcMin mice, a model of familial adenomous polyposis, \nwhich develop adenomas in the small intestine, folate depletion enhanced the efficacy  \nof 5-FU in reducing polyp numbers [24].   \n \n8Other micronutrients, fatty acids and sugars \n Amelioration of toxicity caused by methotrexate in rats was achieved with zinc \n(1g\/kg diet) or growth factors derived from bovine cheese, or a combination of the \ntwo [25]. Animals received these agents for 7 days before and during treatment with \nmethotrexate at 2.5 mg\/kg daily for 3 days. Intervention with the dietary agents \nsignificantly reduced intestinal damage consequent to methotrexate therapy.  \nDocosahexanoic acid is a n-3 fatty acids, for which several beneficial health claims \nhave been advanced. The hypothesis was tested that it can increase the activity of \narabinosylcytosine in mice bearing the L1210 leukaemia [26]. Mice, which received \narabinosylcytosine together with modest amounts of docosahexanoic acid  (1.5% in \nthe diet, average intake 1.8 g\/kg\/day), displayed a significantly longer life span than \nmice on arabinosylcytosine only. However a higher intake of fatty acid (4.5g\/kg\/day) \nresulted in a detrimental effect, as borne out by shorter survival time and increased \ntumor burden compared to mice on arabinosylcytosine alone. This finding indicates \nthe existence of defined concentration windows, which determine the efficacy of \ndietary compounds, whilst higher concentrations can lead to detrimental effects. \nThere is also information on the effect on cancer chemotherapy of modification of the \ndiet with sugars. The effect of oligofructose or inulin was studied in mice bearing a \nmurine liver tumour [27]. Consumption of these sugars with the diet at 15% until the \nend of the study potentiated the therapeutic efficacy of a range of cytotoxic drugs \ngiven as a single dose. \n \n9Effect of diet constituents on chemotherapy: clinical evidence \nRetrospective studies \n In several recent studies of the influence of dietary supplements on outcomes from \ncancer chemotherapy, consumption of supplements was probed for by food frequency \nquestionnaires.  In one such study a total of 178 patients with small cell lung cancer \nwere enrolled, of whom 60% reported the use of vitamin and mineral supplements  \n[28].  The relative risk of death in the supplement cohort was 0.63, thus more \nfavourable than in patients who did not take the supplements. A second survival \nanalysis of the same patients, in which an alternative definition of vitamin\/mineral \nconsumption was used, showed only a non-significant trend towards improvement of \nsurvival by vitamin\/mineral use. The supplements did not affect quality of life in this \nstudy.  \nIn a historical cohort study 90 patients with early stage breast cancer who had \nconsumed high doses of combinations of vitamins, minerals and other antioxidants \nconcurrent with standard chemotherapy, were compared with 180 matched controls, \nwho received chemotherapy only [29].  Patients on supplements displayed worse \nbreast cancer-specific survival and disease-free survival than the control group. \nIn breast cancer patients, who recorded consumption of multivitamin preparations by \nquestionnaire, blood levels of folate and vitamin B12 levels were measured [30].  The \ndecrease in neutrophil count caused by cytotoxic chemotherapy seemed to be \nameliorated by ingestion of dietary supplements. But women with serum folate levels  \n>20ng\/mL exhibited a greater decrease in neutrophil count after chemotherapy than \nwomen with lower folate levels. This result is consistent with the preclinical data, \nwhich suggests potential detrimental modulation by excessive folate of cytotoxic \nchemotherapy (vide supra).      \n10\n In another study the hypothesis was tested that high folate intake can diminish the \neffectiveness of breast cancer chemotherapy [31]. Women who participated in the \nIowa Women’s Health Study, estimated their folate intake by questionnaire during a \n14 year patient follow-up. High folate intake was not associated with poor survival, \nsupporting the notion that folate supplementation does not detrimentally affect breast \ncancer chemotherapy. \nThe potential usefulness of dietary questionnaire to assess dietary intake of \ncarotenoids, toxopherols and fatty acids has been validated in cancer patients \nreceiving chemotherapy [32]. Data obtained by questionnaire correlated satisfactorily \nwith biomarkers measured in plasma samples.    \n \nProspective studies \nAmong the dietary agents which have been explored in prospective clinical trials to \nmodulate cancer chemotherapy vitamins and antioxidants predominate (Table 2). The \nspectrum of results obtained in these studies encompasses detrimental outcome, lack \nof effect as well as hint of benefit, as is illustrated in the following by examples:  \nCancer patients on cisplatin received supplementation with vitamin C (1g), vitamin E \n(400g) and selenium (100 µg) contained in a beverage twice daily beginning 7 days \nprior to the onset of chemotherapy until 3 weeks after cessation of therapy [33]. \nSupplementation failed to affect the incidence of cis-platin-mediated nephrotoxity and \nototoxity significantly. A slight benefit of supplementation was intimated in patients \nwith the highest plasma levels of antioxidants, who experienced significantly less loss \nof high-tone hearing.  In a clinical antioxidant study involving patients with mainly \nlung cancer, all of whom received cisplatin chemotherapy [34], 14 patients ingested \nvitamin E (330mg\/day) prior to cisplatin, and supplement intake was continued for 3 \n11\nmonths after termination of cytotoxic therapy. The control group (14 patients) \nreceived chemotherapy only. Vitamin E decreased the incidence of peripheral \nneurotoxicity, and the neurotoxicity score based on clinical and neuro-physiological \nparameters was significantly lower in patients on vitamin E than in the control group. \nIn an accompanying preclinical experiment, vitamin E failed to adversely affect the \nantitumour efficacy of cisplatin in nude mice bearing the human M14 melanoma. \nSelenium administration reduced cisplatin-induced nephrotoxicity in the acute stages \nbut not over the long term [35]. A phase I trial of 5-FU and leucovorin with high-dose \nvitamin E in patients with advanced disease failed to show therapeutic benefit or \nreduced toxicity [36].  In five studies, in which the ability of vitamin E containing \nsupplements to protect patients receiving anthracyclin-based therapy against cardiac \ntoxicity or alopecia was studied, the supplement did not confer any benefit  [37-41].   \nSupplementation of the diet with amino acids is common. Glutamine, an amino acid \nthat acts as a substrate for nucleotide synthesis in dividing cells, is the most abundant \namino acid in blood and constitutes 60% of the free amino acid pool in skeletal \nmuscle. As cancer patients often suffer from glutamine depletion, attempts have been \nmade to supplement their diet with the aim to ameliorate the incidence or severity of \nmucositis caused by chemotherapy, diarrhea associated with irinotecan, neurotoxicity \nelicited by paclitaxel and anthracycline cardiotoxicity. A review of this work [42] \nsuggests that glutamine at doses of up to 30 g daily given for several days can indeed  \ndecrease drug toxicity.  \nA well-known example of a group of dietary constituents capable of interfering with \nthe metabolism of drugs, are grapefruit flavonoids. They block the activity of \ncytochrome P450 3A4 isoenzyme in the intestinal wall thereby preventing the \npresystemic first–pass metabolism of a wide variety of drugs [43]. An influence of \n12\ngrapefruit on the disposition of anticancer drugs such as taxol has to our knowledge \nnot yet been published.  \n \nWhat advice for cancer patients? \nReviewing the pertinent literature certainly supports the notion that, in spite of the \ninterest which diet and dietary supplements continue to elicit among the general \npublic, evidence permitting rational advice to patients remains weak. The studies \ndescribed above suggest that supplementation with low dose selenium or folate may \nbe worthy of further clinical investigation in patients who are deficient of these \nnutrients. A recent systematic review of antioxidant use and cancer therapy [44] \ndeduced that inconsistencies in study design, timing of observation\/ intervention, \nintervention protocol, malignancy and anticancer regimens preclude definitive \nconclusions to be drawn as to the effect of therapy on patients’ antioxidant status or of \nantioxidant intervention on therapy. D’Andrea [45] came to a similar conclusion after \nsummarizing the evidence supporting the usefulness of antioxidant supplements in the \nreduction of host toxicity of cytotoxic chemotherapy or radiotherapy. A recent \nanalysis of potential benefit of nutritional intervention for outcome of patients with \ncancer or preinvasive lesion [46] concludes that robust evidence is lacking for \nimprovement of patient survival or disease prognosis by dietary modification. This \nreport emphasizes the paucity of the scientific basis for nutritional advice to cancer \npatients, and the pharmacological analysis with respect to dietary supplements \npresented here is consistent with that notion. Carefully conducted studies exemplified \nby Pace et al [42], who investigated cisplatin in combination with vitamin E, will \npermit a better assessment of the role specific dietary supplements may be able to \nplay. The situation is tantalizing with respect to therapy with novel molecularly \n13\ntargeted agents. Relevant information of the effect of dietary supplements on the \nefficacy or unwanted effects of such therapies is virtually non-existent. In the light of \nthe emerging multi-facetted effects of diet constituents on cellular signalling cascades \nit is conceivable that they counteract or synergize with agents such as kinase \ninhibitors. Consistent with this hypothesis, supplementation with selenium has \nrecently been hypothesized to increase the efficacy of cetuximab in metastatic \ncolorectal cancer via decreasing COX-2 and PGE-2 in malignant tissues [47].  \n \n14\nStudying potential interactions \nHow should we design investigations of interactions between antineoplastic drugs and \ndiet constituents? Firstly we need more information on mechanisms of dietary \nconstituents which may be pertinent to drug toxicity or efficacy. Nutritional \npharmacology is a subject in its infancy, but the interest of health providers and \nbiomedical researchers has recently grown considerably, as illustrated by the fact that \nthere is now a journal specifically devoted to this topic (“Molecular Nutrition and \nFood Research”).  More and more diet constituents are being scrutinized in terms of \ntheir ability to interfere with oncogenic pathways [48]. It might be appropriate to \ncomplement studies of anticarcinogenic properties of dietary agents in cells in vitro \nwith those of mechanisms pertinent to antineoplastic drug response\/toxicity. The \nemerging disciplines of nutritrional genomics and proteomics will improve the \nmethodologies required to optimise the acquisition and rationalization of pertinent \nmechanistic insights. Testing of combinations in rodent models should be governed \nby a mechanism-led rationale based on results of in vitro experiments. Studies in \nrodents in vivo should be conducted in those models, which in the past have \nconvincingly predicted efficacy or toxicity in humans of the antineoplastic agent \nunder study. A recent paper on the role of 5-methylselenocysteine and seleno-L-\nmethionine in the response of nude mice bearing human colorectal tumour xenografts \nto irinotecan, 5-FU, oxaliplatin, cisplatin and doxorubicin [49] constitutes a suitable \nexample of a thorough preclinical investigation of the modulation of cytotoxic \ntherapeutic efficacy by dietary constituents, even though the authors refrained from \ninvestigation of mechanisms or pharmacodynamics. Ultimately clinical studies of \ndietary agents should be designed based on relevant preclinical data, and they should \npreferably employ doses which resemble dietary doses of these agents, to minimize \n15\nthe chance of unwanted effects mediated by “mega” doses, as exemplified above at \nthe preclinical level for folate [29] and fatty acids [26]. Clinical studies should also \ninclude, if possible, measurement of pharmacokinetics and pharmacodynamics of the \ndiet constituent, in order to enable rational interpretation of pharmacological and\/or \ntoxicological effects or their absence. In contemporary cancer chemotherapy, \npharmacogenetics plays an increasingly important role. Irinotecan provides an \ninstructive example. A recent comprehensive analysis explored polymorphisms in \nuridine diphosphate-glucuronyl transferase (UGT) enzymes in patients with non-\nsmall-cell lung cancer treated with irinotecan [50].  The authors suggest that certain \nUGT genotypes may be associated with irinotecan efficacy and\/or toxicity, as they \nregulate the rate of glucuronidation of SN-38, the active metabolite of irinotecan. \nDietary cruciferae such as broccoli, citrus fruits or onions contain agents which can \nincrease the activity of UGT isoenzymes [51]. These two findings, when juxtaposed, \nshould alert oncologists to the possibility of pharmacokinetic interactions between \ndietary cruciferae and irinotecan, which seem worthy of clinical evaluation.   \nRecently a carefully formulated nutraceutical supplement programme with \nantiangiogenic properties has been described and suggested to potentially improve the \nefficacy of cytotoxic therapy [52].  Components of this diet are eicosapentanoic acid-\nrich fish oil, epigallocatchin-3-gallate (from green tea), selenium, glycine, and \nsilymarin (milk thistle extract). Ultimately this type of approach involving \nstandardized food components, if based on robust science, seems logical and \ndesirable. However at present nutraceutical supplement combinations are likely to \nmeet scientific scepticism, as the current level of knowledge of the multiple \npharmacological properties of complicated mixtures is insufficient to allow a rational \njudgement to be made as to the therapeutic situation, in which they may be beneficial. \n16\nAcknowledgement  \nThe authors thank Stefania Filippeschi for help with the references, and the UK \nMedical Research Council, the US National Cancer Institute Chemoprevention \nBranch, Cancer Research UK and the Italian Association for Cancer Research for \nresearch support and sponsorship. \n \n17\nReferences \n1. Denmark-Wahnefried W, Peterson B, McBride C et al. Current health behaviours \nand readiness to pursue life-style changes among men and women diagnosed with \nearly stage prostate and breast carcinomas. Cancer 2000; 88:674-84. \n2. D’Incalci MC, Steward WP & Gescher AJ. Use of cancer chemopreventive \nphytochemicals as antineoplastic agents.  Lancet Oncol 2005; 6:899-904. \n3. van Bokhorst-de van der Schuer MAE, van Leeuwen PA, Kuik DJ, et al. The impact \nof nutritional status on the prognoses of patients with advanced head and neck cancer. \nCancer 1999; 86:519-27. \n4. Federico A, Iodice P, Federico P, et al. Effects of selenium and zinc supplementation \non nutritional status in patients with cancer of digestive tract. Eur J Clin Nutr 2001: \n55: 293-7. \n5. Anthony HM, Schorah CJ. Severe hypovitaminosis C in lung cancer patients : the \nutilization of vitamin C in surgical repair and lymphocyte-related host resistance. Brit \nJ Cancer 1982; 46: 354-67. \n6. Krasner N, Dymrock IW. Ascorbic acid deficiency in malignant diseases: a clinical \nand biochemical study. Brit J Cancer 1974; 30: 142-5. \n7. Rao PBR, Lagerloef B, Einhorn J, Reizenstein P. Low serum folic acid in \nmalignancy. Lancet 1963; 1:1192-3. \n8. Hoogstraten B, Herman B, Gilbert H. Serum folate and serum vitamin B12 in \npatients with malignant haematological diseases. Cancer Res 1965; 25: 1933-8. \n9. Magnus EM. Folate activity in serum and red cells of patients with cancer.  Cancer \nRes 1967; 27:490-7. \n18\n10. Pufulete M, Al-Ghnaniem R, Leather AJ et al. Folate status, genomic DNA \nhypomethylation, and risk of colorectal adenoma and cancer: a case control study. \nGastroenterology 2003; 124: 1240-8. \n11. Almadori G, Bussu F, Galli J et al. Serum folate, homocysteine levels in head and \nneck squamous cell carcinoma. Cancer 2002; 94: 1006-11.  \n12. Kato I, Dnistrian AM, Schwartz M et al. Serum folate, homocysteine and colorectal \ncancer risk in women: a nested case-control study. Brit J Cancer 1999; 79: 1917-22. \n13. Jatoi A, Daly BDT, Kramer G, Mason JB. A cross-sectional study of vitamin intake \nin postoperative non-small cell lung cancer patients. J Surg Oncol 1998; 68:231-6. \n14. Begleiter A, Leith MK, Thliveris JA, Digby T. Dietary induction of NQO1 \nincreases the antitumour activity of mitomycin C in human colon tumours in vivo. \nBrit J Cancer 2004; 91:16. \n15. Concklin KA. Dietary antioxidants during cancer chemotherapy: impact on \nchemotherapeutic effectiveness and development of side effects. Nutr Cancer 2000; \n37: 1-18. \n16. Salganik RI. The benefits and hazards of antioxidants: controlling apoptosis and \nother protective mechanisms in cancer patients and the human population. J Am Coll \nNutr 2001; 20: 464S-72S, 473S-75S. \n17. Prasad KN, Kumar A, Kochupillai V, Cole WC. High doses of multiple antioxidant \nvitamins: essential ingredients in improving the efficacy of standard cancer therapy. J \nAm Coll Nutr 1999; 18: 13-25. \n18. De Martinis BS, Bianchi MLP. Effect of vitamin C supplementation against \ncisplatin-induced toxicity and oxidative DNA damage in rats. Pharmacol Res 2001; \n44: 317-20. \n19\n19. Leonetti C, Biroccio A, Gabellini C et al Alph-tocopherol protects against \ncisplatin-induced toxicity withpout interfering with antitumor efficacy. Int J Cancer \n2003; 104:243-50.  \n20. Quiles JL, Huertas JR, Battino M, Mataix J, Ramirez-Tortosa MC. Antioxidant \nnutrients and adriamycin toxicity. Toxicol 2003; 180:79-95. \n21. Parchure M, Ambaye RY, Gokhale SV. Combination of anticancer agents with folic \nacid in the treatment of murine leukaemia P388. Chemotherapy 1984; 30: 119-24. \n22. Mendelsohn LG, Gates SB, Habeck LL et al. The role of dietary folate in \nmodulation of folate receptor expression, folylglutamate synthetase activity abnd the \nefficacy and toxicity of lometrexol. Adv Enzyme Reg 1996; 36:365-81. \n23. Branda RF, Chen Z, Brooks EM, Naud SJ, Trainer TD, McCormack JJ. Diet \nmodulates the toxicity of cancer chemotherapy in rats. J Lab Clin Med 2002; 140: \n358-68 \n24. Tucker JM, Davis C, Kitchens ME et al. Response to 5-fluorouracil chemotherapy \nis modified by dietary folic acid deficiency in Apc(Min\/+) mice. Cancer Lett 2002; \n187:153-62.  \n25. Tran CD, Howarth GS, Coyle P, Philcox JC, Rofe AM, Butler RN. Dietary \nsupplementation with zinc and a growth factor extract derived from bovine cheese \nwhey imporves methotrexate-damage rat intestine. Am J Clin Nutr 2003; 77: 1296-\n303.  \n26. Cha MC, Meckling KA, Stewart C. Dietary docosahexaenoic acid levels influence \nthe outcome of arabinosylcytosine chemotherapy in L1210 leukemic mice. Nutr \nCancer 2002; 44:176-81. \n27. Taper HS, Roberfroid MB. Nontoxic potentiation of cancer chemotherapy  by \ndietary oligofructose or inulin. Nutr Cancer 2000; 38:1-5. \n20\n28. Jatoi A, Williams BA, Marks R, Nichols FC, Aubry MC, Wampfler J, Yang P. \nExploring vitamin and mineral supplementation and purported clinical effects in \npatients with small cell lung cancer: results from the Mayo Clinic lung cancer cohort. \nNutr Cancer 2005; 51: 7-12. \n29. Lesperance ML, Olivotto IA, Forde N et al. Megadose vitamins and minerals in the \ntreatment of non-metastatic breast cancer: an historical cohort study. Breast Cancer \nRes Treat 2002; 76: 137-43. \n30. Branda RF, Naud SJ, Brooks EM, Chen Z, Muss H. Effect of vitamin B12, folate, \nand dietary supplements on breast carcinoma chemotherapy – induced mucositis and \nneutropenia. Cancer 2004; 101: 1058-64. \n31. Sellers TA, Alberts SR, Vierkant RA, Grabrick DM, Cerhan JR, Vachon CM, Olson \nJE, Kushi LH, Potter JD. High folate diets and brest cancer survival in a prospective \ncohort study. Nutr Cancer 2002, 44: 139-44. \n32. Meyerhardt JA, Heseltine D, Campos H, Holmes MD, Willett DC,  Winer EP, \nEnzinger PC, Bunnell CA, Kulke MH, Fuchs CS. Assessment of dietary questionnaire \nin cancer patients receiving cytotoxic chemotherapy. J Clin Oncol 2005; 23: 8453-60.  \n33. Weijl NI, Elsendoorn TJ, Lentjes EGWM, Hopman GD, Wipkink-Bakker A, \nZwinderman AH, Cleton FJ, Osanto S. Supplementation with antioxidant \nmicronutrients and chemotherapy-induced toxicity in cancer patients treated with cis-\nplatin-based chemotherapy: a randomised double-blind, placebo-controlled study. Eur \nJ Cancer 2004;  40: 1713-23. \n34. Pace A, Savarese A, Picardo M, Maresca V, Pacetti U, Del Monte G, Biroccio A, \nLeonetti C, Jandola B, Cognetti F, Bove L. Neuroprotective effect of vitamin E \nsupplementation in patients treated with cisplatin chemotherapy. J Clin Oncol 2003; \n21: 927-31. \n21\n35. Hu YJ, Chen Y, Zhang YQ, et al. The protective role of selenium on the toxicity \nof cisplatin-contained chemotherapy regimen in cancer patients. Biol Trace Elem Res \n1997; 56:331-334. \n36. Blanke CD Stipanov M, Morrow J, et al. A phase I study of vitamin E, 5-\nfluorouracil and leucovorin for advanced malignancies. Invest New Drugs 2001; \n19:21-27. \n37. Weitzman SS, Lorell B, Carey RW et al. Prospective study of tocopherol \nprophylaxis for anthracycline cardiac toxicity. Current Ther Res 1980; 28: 682-686. \n38. Legha SS, Wang YM, Mackay B et al. Clinical and pharmacological investigation \nof the effects of alpha-tocopherol on adriamycin cardiotoxicity. Ann NY Acad Sci \n1982; 393:411-418. \n39. Perez JE, Macchiavelli M, Leone BA, et al. High dose alpha-tocopherol as a \npreventive of doxorubicin-induced alopecia. Cancer Ther Rep 1986; 70: 1213-1214. \n40. Wagdi P, Fluri M, Aeschbacher B, et al. Cardioprotection in patients undergoing \nchemo- and\/or radiotherapy for neoplastic disease. A pilot study. Jpn Heart J 1996; \n37: 353-359. \n41. Sieja K. Protective role of selenium against the toxicity of multi-drug chemotherapy \nin patients with ovarian cancer. Pharmazie 2000; 55:958-959.  \n42. Savarese DMF, Savy G, Vahdat L, Wischmeyer PE, Corey B. Prevention of \nchemotherapy and radiation toxicity with glutamine. Cancer Treat Rev 2003; 29:501-\n13. \n43. Hare JT, Elliott DP. Grapefruit juice and potential drug interactions. Consult Pharm \n2003; 18: 466-472. \n44. Ladas EJ, Jacobsen JS, Kennedy DD, Teel, K, Fleischauer A, Kelly KM. \nAntioxidants and cancer therapy: a systematic review. J Clin Onc 2004; 22: 517-28. \n22\n45. D’Andrea GM. Use of antioxidants during chemotherapy and radiotherapy \nshould be avoided. CA Cancer J Clin 2005; 55: 319-21. \n46. Davies AA, Smith GD, Harbord R, Bekkering GE, Sterne JAC, Beynon R, Thomas \nS. Nutritional interventions and outcome in patients with cancer or preinvasive \nlesions: systematic review. J Natl Cancer Inst 2006; 98: 961-73.  \n47. Altundag K, Silay YS, Altundag O, Ygitbasi OG, Gundeslioglu O, Gunduz M. \nSelenium supplementation may increase the efficacy of cetuximab in metastatic \ncolorectal cancer patients. Med Hypoth 2005; 64:1162-5. \n48. Surh YJ. Cancer prevention with dietary phytochemicals. Nature Rev Cancer 2003; \n3:768-780.  \n49. Cao S, Durrani FA, Rustum YM. Selective modulation of the therapeutic efficacvy \nof anticancer drugs by selenium containing compounds against human tumor \nxenografts. Clinical Cancer Res 2004; 10, 2561-2569. \n50. Han JY, Lim HS, Shin ES, Yoo YK, Park YH, Lee JE, Jang IN, Lee DH, Lee JS. \nComprehensive analysis of UGT1A polymorphisms predictive for pharmacokinetics \nand treatment outcome in patients with non-small-cell lung cancer treated with \nirinotecan and cisplatin. J Clin Oncol 2006; 24: 2237-2244. \n51. Peterson S, Bigler, J, Horner NK, Potter JD, Lampe JW. Cruciferae interact with the \nUGT1A1*28 polymorphism to determine serum bilirubin levels in humans. J Nutr \n2005; 135: 1051-1055. \n52. McCarthy MF, Block KI. Toward a core nutraceutical program for cancer \nmanagement. Integr Cancer Ther 2006; 5:150-171. \n23\nTable 1.  Beneficial effects of dietary agents administered with anticancer drugs in \nrodents \n \nDietary agent \n \nCytotoxic drug Effecta Reference \n \nDimethylfumarate  \n \nMitomycin \n \ne, colorectal \n \n[14] \nVit C, E, A \n \nVit E \n \n5-FU, bleo, adria \n \ncisplatin \n \ne, neuroblastoma \n \nt, mice \n [17] \n \n[18] \nVit A, C \ncoenzyme Q, \nselenium \nAdria \n \nt, cardiac    [20] \n \nDietary folate \n \n5-FU \nCycloposphamide  \n \nt, whole body \n \n[23] \n \nZinc \n \nMethotrex \n \nt, intestinal \n \n[25] \n \nDocohexanoic acid Arabinosyl-cytosin \n \ne, murine \nleukaemia \n \n[26] \n \na e = increased efficacy, t = decreased toxicity \n \n24\nTable 2.  Dietary agents used in prospective clinical trials to aid cytotoxic therapy \n \nDietary agent Cytotoxic drug Reference \n \nVit E \n \n5-FU \n \n[36] \nVit E \n \nAdria, vincr, bleo, 5-FU, \nmitomycin, procarb, \nmethotrex \n \n[37] \nVit E \n \n5-FU, adria, cyclophos [38] \nVit E \n \nDoxorub, vincr, 5-FU, \ncyclophos, cisplatin \n \n[39] \nVit E \n \nCisplatin [34] \nVit C,E, selenium \n \nCisplatin [33] \nSelenium \n \nCisplatin [35] \nSelenium, vit C, E; \u0003-\ncarotene \n \nCisplatin, cyclophos [41] \nVit C, E \n \nAdria, cyclophos, bleo, \nvincr, procarb, prednis, \ndacarb, vinblast, VP16 \n \n[40] \nGlutamin Paclitaxel, anthracyclins [42] \n \n"}