{"doi":"10.1371\/journal.pone.0005557","coreId":"177192","oai":"oai:aura.abdn.ac.uk:2164\/770","identifiers":["oai:aura.abdn.ac.uk:2164\/770","10.1371\/journal.pone.0005557"],"title":"Red wine polyphenols prevent metabolic and cardiovascular alterations associated with obesity in Zucker fatty rats (Fa\/Fa)","authors":["Agouni, Abdelali","Lagrue-Lak-Hal, Anne-Hélène","Mostefai, Hadj Ahmed","Tesse, Angela","Mulder, Paul","Rouet, Philippe","Desmoulin, Franck","Heymes, Christophe","Martínez, Maria Carmen","Andriantsitohaina, Ramaroson"],"enrichments":{"references":[{"id":4900,"title":"A diet supplemented with husks of Plantago ovata reduces the development of endothelial dysfunction, hypertension, and obesity by affecting adiponectin and TNF-alpha in obese Zucker rats.","authors":[],"date":"2005","doi":null,"raw":"Galisteo M, Sanchez M, Vera R, Gonzalez M, Anguera A, et al. (2005) A diet supplemented with husks of Plantago ovata reduces the development of endothelial dysfunction, hypertension, and obesity by affecting adiponectin and TNF-alpha in obese Zucker rats. J Nutr 135: 2399–2404.","cites":null},{"id":4899,"title":"Age-dependent changes in blood pressure and arterial reactivity in obese Zucker rats.","authors":[],"date":"2003","doi":"10.1016\/j.ejphar.2003.08.003","raw":"Subramanian R, MacLeod KM (2003) Age-dependent changes in blood pressure and arterial reactivity in obese Zucker rats. Eur J Pharmacol 477: 143–152.","cites":null},{"id":4872,"title":"Beneficial effects of Provinols: cardiovascular system and kidney.","authors":[],"date":"2006","doi":null,"raw":"Pechanova O, Rezzani R, Babal P, Bernatova I, Andriantsitohaina R (2006) Beneficial effects of Provinols: cardiovascular system and kidney. Physiol Res 55 Suppl 1: S17–30.","cites":null},{"id":4871,"title":"Cellular mechanisms of the protective effect of polyphenols on the neurovascular unit in strokes.","authors":[],"date":"2006","doi":"10.2174\/187152506778520691","raw":"Curin Y, Ritz MF, Andriantsitohaina R (2006) Cellular mechanisms of the protective effect of polyphenols on the neurovascular unit in strokes. Cardiovasc Hematol Agents Med Chem 4: 277–288.","cites":null},{"id":4905,"title":"Characterization of endothelium-derived relaxing factors released by bradykinin in human resistance arteries.","authors":[],"date":"1997","doi":"10.1038\/sj.bjp.0701169","raw":"Ohlmann P, Martinez MC, Schneider F, Stoclet JC, Andriantsitohaina R (1997) Characterization of endothelium-derived relaxing factors released by bradykinin in human resistance arteries. Br J Pharmacol 121: 657–664. Polyphenols and Obesity PLoS ONE | www.plosone.org 8 May 2009 | Volume 4 | Issue 5 | e5557","cites":null},{"id":4882,"title":"Chronic treatment with red wine polyphenol compounds mediates neuroprotection in a rat model of ischemic cerebral stroke.","authors":[],"date":"2008","doi":null,"raw":"Ritz MF, Ratajczak P, Curin Y, Cam E, Mendelowitsch A, et al. (2008) Chronic treatment with red wine polyphenol compounds mediates neuroprotection in a rat model of ischemic cerebral stroke. J Nutr 138: 519–525.","cites":null},{"id":4896,"title":"Consumption of red wine polyphenols reduces the susceptibility of low-density lipoproteins to oxidation in vivo.","authors":[],"date":"1998","doi":null,"raw":"Nigdikar SV, Williams NR, Griffin BA, Howard AN (1998) Consumption of red wine polyphenols reduces the susceptibility of low-density lipoproteins to oxidation in vivo. Am J Clin Nutr 68: 258–265.","cites":null},{"id":4902,"title":"Effects of red wine polyphenols on postischemic neovascularization model in rats: low doses are proangiogenic, high doses anti-angiogenic.","authors":[],"date":"2007","doi":"10.1096\/fj.06-7782com","raw":"Baron-Menguy C, Bocquet A, Guihot AL, Chappard D, Amiot MJ, et al. (2007) Effects of red wine polyphenols on postischemic neovascularization model in rats: low doses are proangiogenic, high doses anti-angiogenic. Faseb J 21: 3511–3521.","cites":null},{"id":4866,"title":"Endothelial function: cardiac events.","authors":[],"date":"2005","doi":"10.1161\/01.CIR.0000153339.27064.14","raw":"Lerman A, Zeiher AM (2005) Endothelial function: cardiac events. Circulation 111: 363–368.","cites":null},{"id":4892,"title":"Flavonoids: a class of modulators with bifunctional interactions at vicinal ATPand steroid-binding sites on mouse P-glycoprotein.","authors":[],"date":"1998","doi":"10.1073\/pnas.95.17.9831","raw":"Conseil G, Baubichon-Cortay H, Dayan G, Jault JM, Barron D, et al. (1998) Flavonoids: a class of modulators with bifunctional interactions at vicinal ATPand steroid-binding sites on mouse P-glycoprotein. Proc Natl Acad Sci U S A 95: 9831–9836.","cites":null},{"id":4887,"title":"Influence of visceral obesity and liver fat on vascular structure and function in obese subjects.","authors":[],"date":"2009","doi":"10.1038\/oby.2009.81","raw":"Sturm W, Sandhofer A, Engl J, Laimer M, Molnar C, et al. (2009) Influence of visceral obesity and liver fat on vascular structure and function in obese subjects. Obesity (Silver Spring).","cites":null},{"id":4875,"title":"Insulin and obesity in the Zucker genetically obese rat ‘‘fatty’’.","authors":[],"date":"1972","doi":"10.1210\/endo-90-5-1320","raw":"Zucker LM, Antoniades HN (1972) Insulin and obesity in the Zucker genetically obese rat ‘‘fatty’’. Endocrinology 90: 1320–1330.","cites":null},{"id":4869,"title":"Insulin resistance and endothelial dysfunction: the road map to cardiovascular diseases.","authors":[],"date":"2006","doi":"10.1002\/dmrr.634","raw":"Cersosimo E, DeFronzo RA (2006) Insulin resistance and endothelial dysfunction: the road map to cardiovascular diseases. Diabetes Metab Res Rev 22: 423–436.","cites":null},{"id":4888,"title":"Insulin resistance and the endothelium.","authors":[],"date":"2004","doi":"10.1016\/j.amjmed.2004.02.042","raw":"Hsueh WA, Lyon CJ, Quinones MJ (2004) Insulin resistance and the endothelium. Am J Med 117: 109–117.","cites":null},{"id":4865,"title":"Insulin resistance. A multifaceted syndrome responsible for NIDDM, obesity, hypertension, dyslipidemia, and atherosclerotic cardiovascular disease.","authors":[],"date":"1991","doi":"10.2337\/diacare.14.3.173","raw":"DeFronzo RA, Ferrannini E (1991) Insulin resistance. A multifaceted syndrome responsible for NIDDM, obesity, hypertension, dyslipidemia, and atherosclerotic cardiovascular disease. Diabetes Care 14: 173–194.","cites":null},{"id":4868,"title":"Is insulin resistance atherogenic? Possible mechanisms.","authors":[],"date":"2006","doi":"10.1016\/j.atherosclerosissup.2006.05.002","raw":"Defronzo RA (2006) Is insulin resistance atherogenic? Possible mechanisms. Atheroscler Suppl 7: 11–15.","cites":null},{"id":4878,"title":"Leptin receptor missense mutation in the fatty Zucker rat.","authors":[],"date":"1996","doi":"10.1038\/ng0596-18","raw":"Phillips MS, Liu Q, Hammond HA, Dugan V, Hey PJ, et al. (1996) Leptin receptor missense mutation in the fatty Zucker rat. Nat Genet 13: 18–19.","cites":null},{"id":4890,"title":"Long-term resveratrol administration reduces metabolic disturbances and lowers blood pressure in obese Zucker rats.","authors":[],"date":"2009","doi":"10.1016\/j.bcp.2008.11.027","raw":"Rivera L, Moron R, Zarzuelo A, Galisteo M (2009) Long-term resveratrol administration reduces metabolic disturbances and lowers blood pressure in obese Zucker rats. Biochem Pharmacol 77: 1053–1063.","cites":null},{"id":4867,"title":"Metabolic syndrome and endothelial dysfunction.","authors":[],"date":"2005","doi":"10.1007\/s11906-005-0080-6","raw":"Fornoni A, Raij L (2005) Metabolic syndrome and endothelial dysfunction. Curr Hypertens Rep 7: 88–95.","cites":null},{"id":4893,"title":"Modulation of multidrug resistance protein 1 (MRP1\/ABCC1) transport and atpase activities by interaction with dietary flavonoids.","authors":[],"date":"2001","doi":null,"raw":"Leslie EM, Mao Q, Oleschuk CJ, Deeley RG, Cole SP (2001) Modulation of multidrug resistance protein 1 (MRP1\/ABCC1) transport and atpase activities by interaction with dietary flavonoids. Mol Pharmacol 59: 1171–1180.","cites":null},{"id":4873,"title":"Nitric oxide production and endothelium-dependent vasorelaxation induced by wine polyphenols in rat aorta.","authors":[],"date":"1997","doi":"10.1097\/00005344-199902000-00011","raw":"Andriambeloson E, Kleschyov AL, Muller B, Beretz A, Stoclet JC, et al. (1997) Nitric oxide production and endothelium-dependent vasorelaxation induced by wine polyphenols in rat aorta. Br J Pharmacol 120: 1053–1058.","cites":null},{"id":4863,"title":"Obesity as a medical problem.","authors":[],"date":"2000","doi":"10.1038\/sj.ijo.0801291","raw":"Kopelman PG (2000) Obesity as a medical problem. Nature 404: 635–643.","cites":null},{"id":4898,"title":"Obesity\/insulin resistance is associated with endothelial dysfunction. Implications for the syndrome of insulin resistance.","authors":[],"date":"1996","doi":"10.1172\/JCI118709","raw":"Steinberg HO, Chaker H, Leaming R, Johnson A, Brechtel G, et al. (1996) Obesity\/insulin resistance is associated with endothelial dysfunction. Implications for the syndrome of insulin resistance. J Clin Invest 97: 2601–2610.","cites":null},{"id":4874,"title":"Pathophysiology of insulin resistance in human disease.","authors":[],"date":"1995","doi":"10.1016\/S0899-9007(96)00380-2","raw":"Reaven GM (1995) Pathophysiology of insulin resistance in human disease. Physiol Rev 75: 473–486.","cites":null},{"id":4877,"title":"Phenotype-linked amino acid alteration in leptin receptor cDNA from Zucker fatty (fa\/fa) rat.","authors":[],"date":"1996","doi":"10.1006\/bbrc.1996.0691","raw":"Iida M, Murakami T, Ishida K, Mizuno A, Kuwajima M, et al. (1996) Phenotype-linked amino acid alteration in leptin receptor cDNA from Zucker fatty (fa\/fa) rat. Biochem Biophys Res Commun 222: 19–26.","cites":null},{"id":4895,"title":"Purple grape juice improves endothelial function and reduces the susceptibility of LDL cholesterol to oxidation in patients with coronary artery disease.","authors":[],"date":"1999","doi":"10.1161\/01.CIR.100.10.1050","raw":"Stein JH, Keevil JG, Wiebe DA, Aeschlimann S, Folts JD (1999) Purple grape juice improves endothelial function and reduces the susceptibility of LDL cholesterol to oxidation in patients with coronary artery disease. Circulation 100: 1050–1055.","cites":null},{"id":4891,"title":"Red wine consumption improves insulin resistance but not endothelial function in type 2 diabetic patients.","authors":[],"date":"2005","doi":"10.1016\/j.metabol.2004.09.010","raw":"Napoli R, Cozzolino D, Guardasole V, Angelini V, Zarra E, et al. (2005) Red wine consumption improves insulin resistance but not endothelial function in type 2 diabetic patients. Metabolism 54: 306–313.","cites":null},{"id":4901,"title":"Red wine polyphenols cause endothelium-dependent EDHF-mediated relaxations in porcine coronary arteries via a redox-sensitive mechanism.","authors":[],"date":"2003","doi":"10.1016\/j.bbrc.2003.09.028","raw":"Ndiaye M, Chataigneau T, Andriantsitohaina R, Stoclet JC, Schini-Kerth VB (2003) Red wine polyphenols cause endothelium-dependent EDHF-mediated relaxations in porcine coronary arteries via a redox-sensitive mechanism. Biochem Biophys Res Commun 310: 371–377.","cites":null},{"id":4904,"title":"Red wine polyphenols induce EDHF-mediated relaxations in porcine coronary arteries through the redox-sensitive activation of the PI3-kinase\/Akt pathway.","authors":[],"date":"2004","doi":"10.1016\/j.bbrc.2003.09.028","raw":"Ndiaye M, Chataigneau T, Chataigneau M, Schini-Kerth VB (2004) Red wine polyphenols induce EDHF-mediated relaxations in porcine coronary arteries through the redox-sensitive activation of the PI3-kinase\/Akt pathway. Br J Pharmacol 142: 1131–1136.","cites":null},{"id":4903,"title":"Red wine polyphenols prevent angiotensin II-induced hypertension and endothelial dysfunction in rats: role of NADPH oxidase.","authors":[],"date":"2006","doi":"10.1016\/j.cardiores.2006.05.022","raw":"Sarr M, Chataigneau M, Martins S, Schott C, El Bedoui J, et al. (2006) Red wine polyphenols prevent angiotensin II-induced hypertension and endothelial dysfunction in rats: role of NADPH oxidase. Cardiovasc Res 71: 794–802.","cites":null},{"id":4883,"title":"Red wine polyphenols prevent cardiovascular alterations in L-NAME-induced hypertension.","authors":[],"date":"2004","doi":"10.1016\/j.yjmcc.2007.03.291","raw":"Pechanova O, Bernatova I, Babal P, Martinez MC, Kysela S, et al. (2004) Red wine polyphenols prevent cardiovascular alterations in L-NAME-induced hypertension. J Hypertens 22: 1551–1559.","cites":null},{"id":4894,"title":"Red wine, dealcoholized red wine, and especially grape juice, inhibit atherosclerosis in a hamster model.","authors":[],"date":"2001","doi":"10.1016\/S0021-9150(00)00625-0","raw":"Vinson JA, Teufel K, Wu N (2001) Red wine, dealcoholized red wine, and especially grape juice, inhibit atherosclerosis in a hamster model. Atherosclerosis 156: 67–72.","cites":null},{"id":4889,"title":"Resveratrol, a red wine antioxidant, possesses an insulin-like effect in streptozotocin-induced diabetic rats.","authors":[],"date":"2006","doi":"10.1152\/ajpendo.00487.2005","raw":"Su HC, Hung LM, Chen JK (2006) Resveratrol, a red wine antioxidant, possesses an insulin-like effect in streptozotocin-induced diabetic rats. Am J Physiol Endocrinol Metab 290: E1339–1346.","cites":null},{"id":4886,"title":"Severe hepatic and peripheral insulin resistance as evidenced by euglycemic clamps in genetically obese fa\/fa rats.","authors":[],"date":"1986","doi":"10.1210\/endo-118-2-674","raw":"Terrettaz J, Assimacopoulos-Jeannet F, Jeanrenaud B (1986) Severe hepatic and peripheral insulin resistance as evidenced by euglycemic clamps in genetically obese fa\/fa rats. Endocrinology 118: 674–678.","cites":null},{"id":4885,"title":"Sonic hedgehog carried by microparticles corrects endothelial injury through nitric oxide release.","authors":[],"date":"2007","doi":"10.1096\/fj.07-8079com","raw":"Agouni A, Mostefai HA, Porro C, Carusio N, Favre J, et al. (2007) Sonic hedgehog carried by microparticles corrects endothelial injury through nitric oxide release. Faseb J 21: 2735–2741.","cites":null},{"id":4897,"title":"The coexistence of nocturnal sustained hypoxia and obesity additively increases cardiac apoptosis.","authors":[],"date":"2008","doi":"10.1152\/japplphysiol.00152.2007","raw":"Lee SD, Kuo WW, Bau DT, Ko FY, Wu FL, et al. (2008) The coexistence of nocturnal sustained hypoxia and obesity additively increases cardiac apoptosis. J Appl Physiol 104: 1144–1153.","cites":null},{"id":4870,"title":"The effects of plant flavonoids on mammalian cells: implications for inflammation, heart disease, and cancer.","authors":[],"date":"2000","doi":null,"raw":"Middleton E Jr, Kandaswami C, Theoharides TC (2000) The effects of plant flavonoids on mammalian cells: implications for inflammation, heart disease, and cancer. Pharmacol Rev 52: 673–751.","cites":null},{"id":4864,"title":"The perils of portliness: causes and consequences of visceral adiposity.","authors":[],"date":"2000","doi":"10.2337\/diabetes.49.6.883","raw":"Montague CT, O’Rahilly S (2000) The perils of portliness: causes and consequences of visceral adiposity. Diabetes 49: 883–888.","cites":null},{"id":4876,"title":"The Zucker fatty rat as a genetic model of obesity and hypertension.","authors":[],"date":"1989","doi":"10.1161\/01.HYP.13.6.896","raw":"Kurtz TW, Morris RC, Pershadsingh HA (1989) The Zucker fatty rat as a genetic model of obesity and hypertension. Hypertension 13: 896–901.","cites":null},{"id":4884,"title":"Vascular effects of red wine polyphenols in chronic stress-exposed Wistar-Kyoto rats.","authors":[],"date":"2006","doi":"10.1016\/j.yjmcc.2007.03.296","raw":"Puzserova A, Csizmadiova Z, Andriantsitohaina R, Bernatova I (2006) Vascular effects of red wine polyphenols in chronic stress-exposed Wistar-Kyoto rats. Physiol Res 55 Suppl 1: S39–47.","cites":null},{"id":4879,"title":"Wine polyphenols decrease blood pressure, improve NO vasodilatation, and induce gene expression.","authors":[],"date":"2001","doi":"10.1161\/01.HYP.38.2.159","raw":"Diebolt M, Bucher B, Andriantsitohaina R (2001) Wine polyphenols decrease blood pressure, improve NO vasodilatation, and induce gene expression. Hypertension 38: 159–165.","cites":null},{"id":4880,"title":"Wine polyphenols improve cardiovascular remodeling and vascular function in NOdeficient hypertension.","authors":[],"date":"2002","doi":"10.1016\/s0022-2828(02)90923-5","raw":"Bernatova I, Pechanova O, Babal P, Kysela S, Stvrtina S, et al. (2002) Wine polyphenols improve cardiovascular remodeling and vascular function in NOdeficient hypertension. Am J Physiol Heart Circ Physiol 282: H942–948.","cites":null},{"id":4881,"title":"Wine polyphenols induce hypotension, and decrease cardiac reactivity and infarct size in rats: involvement of nitric oxide.","authors":[],"date":"2004","doi":"10.1038\/sj.bjp.0705833","raw":"Ralay Ranaivo H, Diebolt M, Andriantsitohaina R (2004) Wine polyphenols induce hypotension, and decrease cardiac reactivity and infarct size in rats: involvement of nitric oxide. Br J Pharmacol 142: 671–678.","cites":null}],"documentType":{"type":1}},"contributors":["University of Aberdeen, School of Biological Sciences","University of Aberdeen, Medicine, Medical Sciences & Nutrition, Institute of Medical Sciences"],"datePublished":"2009-05-18","abstract":"Peer reviewedPublisher PD","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:aura.abdn.ac.uk:2164\/770<\/identifier><datestamp>\n                2018-01-02T00:02:32Z<\/datestamp><setSpec>\n                com_2164_618<\/setSpec><setSpec>\n                com_2164_362<\/setSpec><setSpec>\n                com_2164_330<\/setSpec><setSpec>\n                com_2164_644<\/setSpec><setSpec>\n                com_2164_365<\/setSpec><setSpec>\n                com_2164_705<\/setSpec><setSpec>\n                col_2164_645<\/setSpec><setSpec>\n                col_2164_619<\/setSpec><setSpec>\n                col_2164_706<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nRed wine polyphenols prevent metabolic and cardiovascular alterations associated with obesity in Zucker fatty rats (Fa\/Fa)<\/dc:title><dc:creator>\nAgouni, Abdelali<\/dc:creator><dc:creator>\nLagrue-Lak-Hal, Anne-Hélène<\/dc:creator><dc:creator>\nMostefai, Hadj Ahmed<\/dc:creator><dc:creator>\nTesse, Angela<\/dc:creator><dc:creator>\nMulder, Paul<\/dc:creator><dc:creator>\nRouet, Philippe<\/dc:creator><dc:creator>\nDesmoulin, Franck<\/dc:creator><dc:creator>\nHeymes, Christophe<\/dc:creator><dc:creator>\nMartínez, Maria Carmen<\/dc:creator><dc:creator>\nAndriantsitohaina, Ramaroson<\/dc:creator><dc:contributor>\nUniversity of Aberdeen, School of Biological Sciences<\/dc:contributor><dc:contributor>\nUniversity of Aberdeen, Medicine, Medical Sciences & Nutrition, Institute of Medical Sciences<\/dc:contributor><dc:subject>\nanimals<\/dc:subject><dc:subject>\nblood glucose<\/dc:subject><dc:subject>\nblood pressure<\/dc:subject><dc:subject>\nblotting, western<\/dc:subject><dc:subject>\nechocardiography<\/dc:subject><dc:subject>\nelectron spin resonance spectroscopy<\/dc:subject><dc:subject>\nenzyme activation<\/dc:subject><dc:subject>\nflavonoids<\/dc:subject><dc:subject>\nfructosamine<\/dc:subject><dc:subject>\nlipid metabolism<\/dc:subject><dc:subject>\nlipids<\/dc:subject><dc:subject>\nmesenteric arteries<\/dc:subject><dc:subject>\nNADPH oxidase<\/dc:subject><dc:subject>\nnitric oxide<\/dc:subject><dc:subject>\nnitric oxide synthase type III<\/dc:subject><dc:subject>\nobesity<\/dc:subject><dc:subject>\nphenols<\/dc:subject><dc:subject>\nrats<\/dc:subject><dc:subject>\nrats, Zucker<\/dc:subject><dc:subject>\nsuperoxides<\/dc:subject><dc:subject>\nwine<\/dc:subject><dc:subject>\nR Medicine<\/dc:subject><dc:subject>\nR<\/dc:subject><dc:description>\nPeer reviewed<\/dc:description><dc:description>\nPublisher PDF<\/dc:description><dc:date>\n2010-10-19T08:28:21Z<\/dc:date><dc:date>\n2010-10-19T08:28:21Z<\/dc:date><dc:date>\n2009-05-18<\/dc:date><dc:type>\nJournal article<\/dc:type><dc:identifier>\nAgouni , A , Lagrue-Lak-Hal , A-H , Mostefai , H A , Tesse , A , Mulder , P , Rouet , P , Desmoulin , F , Heymes , C , Martínez , M C & Andriantsitohaina , R 2009 , ' Red wine polyphenols prevent metabolic and cardiovascular alterations associated with obesity in Zucker fatty rats (Fa\/Fa) ' PLoS ONE , vol 4 , no. 5 , e5557 . DOI: 10.1371\/journal.pone.0005557<\/dc:identifier><dc:identifier>\n1932-6203<\/dc:identifier><dc:identifier>\nPURE: 904421<\/dc:identifier><dc:identifier>\nPURE UUID: 76b93bab-f0fa-40c7-ae07-dfc400f9a7fe<\/dc:identifier><dc:identifier>\nPubMed: 19440378<\/dc:identifier><dc:identifier>\nScopus: 65949113140<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2164\/770<\/dc:identifier><dc:identifier>\nhttp:\/\/dx.doi.org\/10.1371\/journal.pone.0005557<\/dc:identifier><dc:language>\neng<\/dc:language><dc:relation>\nPLoS ONE<\/dc:relation><dc:format>\n8<\/dc:format>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:1932-6203","1932-6203"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["PLoS ONE"],"year":2009,"topics":["animals","blood glucose","blood pressure","blotting, western","echocardiography","electron spin resonance spectroscopy","enzyme activation","flavonoids","fructosamine","lipid metabolism","lipids","mesenteric arteries","NADPH oxidase","nitric oxide","nitric oxide synthase type III","obesity","phenols","rats","rats, Zucker","superoxides","wine","R Medicine","R"],"subject":["Journal article"],"fullText":"Red Wine Polyphenols Prevent Metabolic and\nCardiovascular Alterations Associated with Obesity in\nZucker Fatty Rats (Fa\/Fa)\nAbdelali Agouni1,2,3.¤, Anne-He´le`ne Lagrue-Lak-Hal1,2,3., Hadj Ahmed Mostefai1,2,3, Angela Tesse1,2,3,\nPaul Mulder4, Philippe Rouet5,6, Franck Desmoulin5,6, Christophe Heymes7, Maria Carmen Martı´nez1,2,3,\nRamaroson Andriantsitohaina1,2,3*\n1 INSERM, U771, Angers, France, 2CNRS UMR, 6214, Angers, France, 3Universite´ d’Angers, Angers, France, 4 INSERM, U644, Rouen, France, 5 INSERM, U858, Toulouse,\nFrance, 6Universite´ Paul Sabatier, Institut Fe´de´ratif de Recherche 31, Toulouse, France, 7 INSERM, U689, Paris, France\nAbstract\nBackground: Obesity is associated with increased risks for development of cardiovascular diseases. Epidemiological studies\nreport an inverse association between dietary flavonoid consumption and mortality from cardiovascular diseases. We\nstudied the potential beneficial effects of dietary supplementation of red wine polyphenol extract, ProvinolsTM, on obesity-\nassociated alterations with respect to metabolic disturbances and cardiovascular functions in Zucker fatty (ZF) rats.\nMethodology\/Principal Findings: ZF rats or their lean littermates received normal diet or supplemented with ProvinolsTM\nfor 8 weeks. ProvinolsTM improved glucose metabolism by reducing plasma glucose and fructosamine in ZF rats. Moreover,\nit reduced circulating triglycerides and total cholesterol as well as LDL-cholesterol in ZF rats. Echocardiography\nmeasurements demonstrated that ProvinolsTM improved cardiac performance as evidenced by an increase in left ventricular\nfractional shortening and cardiac output associated with decreased peripheral arterial resistances in ZF rats. Regarding\nvascular function, ProvinolsTM corrected endothelial dysfunction in aortas from ZF rats by improving endothelium-\ndependent relaxation in response to acetylcholine (Ach). ProvinolsTM enhanced NO bioavailability resulting from increased\nnitric oxide (NO) production through enhanced endothelial NO-synthase (eNOS) activity and reduced superoxide anion\nrelease via decreased expression of NADPH oxidase membrane sub-unit, Nox-1. In small mesenteric arteries, although\nProvinolsTM did not affect the endothelium-dependent response to Ach; it enhanced the endothelial-derived\nhyperpolarizing factor component of the response.\nConclusions\/Significance: Use of red wine polyphenols may be a potential mechanism for prevention of cardiovascular and\nmetabolic alterations associated with obesity.\nCitation: Agouni A, Lagrue-Lak-Hal A-H, Mostefai HA, Tesse A, Mulder P, et al. (2009) Red Wine Polyphenols Prevent Metabolic and Cardiovascular Alterations\nAssociated with Obesity in Zucker Fatty Rats (Fa\/Fa). PLoS ONE 4(5): e5557. doi:10.1371\/journal.pone.0005557\nEditor: Carlo Polidori, University of Camerino, Italy\nReceived March 3, 2009; Accepted April 20, 2009; Published May 18, 2009\nCopyright: \u0001 2009 Agouni et al. This is an open-access article distributed under the terms of the Creative Commons Attribution License, which permits\nunrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.\nFunding: This work was supported by institutional grants from Fonds Europeen pour le Developpement Regional (nu 8891), CNRS, INSERM and University of\nAngers. R.A. was supported by a Contrat d’Interface INSERM. A.A. is recipient of a doctoral fellowship from French Education Ministry. A.H.L. and M.H.A. are\nrecipients of post-doctoral and doctoral fellowships from Conseil Regional du Pays de la Loire, respectively. The funders had no role in study design, data\ncollection and analysis, decision to publish, or preparation of the manuscript.\nCompeting Interests: The authors have declared that no competing interests exist.\n* E-mail: ramaroson.andriantsitohaina@univ-angers.fr\n¤ Current address: Institute of Biological and Environmental Sciences, University of Aberdeen, Aberdeen, Scotland, United Kingdom\n. These authors contributed equally to this work.\nIntroduction\nObesity is a fast growing problem that is reaching epidemic\nproportions worldwide, and is associated with an increased risk of\npremature death [1]. Individuals with a central deposition of\nadipose tissue display elevated cardiovascular morbidity and\nmortality, including stroke, congestive heart failure, myocardial\ninfarction and cardiovascular death, and this is independent of the\nassociation between obesity and other cardiovascular risk factors\n[2]. Obesity, in particular abdominal obesity, was pointed out as a\nprimary contributor to acquired insulin resistance, as increasing\nadiposity is correlated with impaired insulin action [3]. Endothelial\ndysfunction, an independent predictor of cardiovascular events\n[4], has been consistently associated with obesity and the\nmetabolic syndrome [5] in a complex interplay with insulin\nresistance [6]. Deficiency of endothelial nitric oxide (NO) is\nbelieved to be the primary defect that links insulin resistance and\nendothelial dysfunction [7].\nEpidemiological studies report an inverse association between\ndietary polyphenol consumption and mortality from cardiovascu-\nlar diseases [8]. In the past decade, red wine polyphenolic\ncompounds, including ProvinolsTM, have been shown to exert\nnumerous biological effects that might participate in cardio- and\nvasculo-protection. Polyphenols possess anti-aggregatory platelet\nPLoS ONE | www.plosone.org 1 May 2009 | Volume 4 | Issue 5 | e5557\nactivity, antioxidant and free radical scavenging properties [9,10].\nFurthermore, red wine and its polyphenolic constituents possess\nlipid- and lipoprotein-lowering effects [9]. Moreover, ProvinolsTM\nis a powerful vasodilator through the generation of NO and can\nact on the expression of genes protective of the cardiovascular\nsystem [11]. Due to these pleiotropic properties, polyphenols may\nbe good candidates to correct metabolic and cardiovascular\nalterations associated with obesity and metabolic syndrome.\nIn the present work, we studied the potential beneficial effects of\ndietary supplementation of the red wine polyphenol extract,\nProvinolsTM, in an experimental model of obesity and metabolic\nsyndrome with an emphasis on glucose and lipid metabolisms,\ncardiac and endothelial functions. Of particular interest is to study\nthe cellular pathways related to nitrosative and oxidative stresses in\nblood vessels. For this purpose, we used the Zucker fatty (ZF) rat, a\nwidely used animal model of obesity and type 2 diabetes, which\npresents many of the human metabolic syndrome features such as\ninsulin resistance, dyslipidemia, hyperinsulinemia [12,13] and, in\nsome colonies, hypertension that develops by 4–5 months of age\n[14]. On the other hand, their lean littermates are insulin-sensitive,\nnormoinsulinemic, normotensive, and have normal lipid profiles\nand glucose tolerance. Furthermore, this model presents a loss of\nfunctional mutation in the leptin receptor [15,16].\nMethods\nAnimals and experimental protocol\nThe university of Angers ethical committee approved the\npresent protocol. All animal studies were carried out using\napproved institutional protocols and were conformed the Guide\nfor the Care and Use of Laboratory Animals published by US National\nInstitutes of Health (NIH Publication No. 85-23, revised 1996).\nTwenty-four ZF rats and twelve of their lean littermate non-obese\nrats (Charles River; L’Arbresle, France) received for eight weeks\neither a control diet or a diet containing ProvinolsTM (Socie´te´\nFranc¸aise de Distilleries; Vallon Pont d’Arc, France) at the dose of\n20 mg\/kg\/day. The dose of ProvinolsTM was described to induce\ncardiovascular effects, including improvement of endothelial\nfunction [17] and prevention of the increase in blood pressure in\nNO-deficient hypertensive rats [18] and protection of both cardiac\nischemia [19] and stroke [20]. Eight weeks of treatment has been\nreported to protect against deleterious effects of hypertension [21]\nand chronic-stress exposure [22].\nMeasurement of blood pressure\nBlood pressure was measured using the tail-cuff technique\nweekly. Each rat was trained to the tail-cuff technique for 2 days\nbefore each measurement recorded with a Physiograph Desk\nModel and an Electro-Sphygmomanometer (BIOSEB; Paris,\nFrance). Five separate measurements were made on conscious\nrats for systolic blood pressure and heart rate determinations.\nEchocardiographic examination\nTransthoracic echocardiography was performed using an ATL-\nHDI 5500 ultrasound machine equipped with a 8-MHz imaging\ntransducer in rats anesthetized with pentobarbital sodium (50 mg\/\nkg ip). Briefly, a two-dimensional short axis view of the left\nventricle was obtained at the level of the papillary muscle in order\nto record M-mode tracings. Diastolic left ventricular dimension\n(LVDd) and systolic left ventricular dimension (LVDs) were\nmeasured by the American Society of Echocardiology leading-\nedge method from at least 3 consecutive cardiac cycles. Doppler\ncardiac output was calculated by the following formula: Cardiac\noutput = 6D2\/46IVTAo, where D represents the diameter of\nthe aortic left ventricular outflow tract and IVTAo the velocity-\ntime integral in the left ventricular outflow tract. Also, total arterial\nperipheral resistances were calculated from blood pressure and\ncardiac output.\nCirculating parameters measurement\nRats were anesthetized with isoflurane and blood was harvested\nfrom abdominal aorta. The plasma was separated for circulating\nglucose, fructosamine, total cholesterol, low density lipoprotein\n(LDL)-cholesterol, high density lipoprotein (HDL)-cholesterol,\ntriglycerides, creatinin, and uric acid analysis (technical platform\nof Toulouse Midi-Pyre´ne´es GenopoleH IFR31; Toulouse, France).\nVascular reactivity\nAortic and small mesenteric artery (SMA) rings (1.5–2 mm long)\nwere obtained from ZF and lean rats having received ProvinolsTM\nor a vehicle. Then, they were mounted on a wire myograph\n(Danish MyoTechnology, Aarhus, Denmark) filled with physio-\nlogical salt solution (PSS) as previously described [23]. Endothe-\nlium-dependent vasodilatation in response to acetylcholine (Ach,\n1 nM to 10 mM) was studied in aortas and SMA with functional\nendothelium pre-contracted with the thromboxane A2 agonist (9,\n11-dideoxy-11a, 9a-epoxymethanoprostaglandin F2-a) U46619\n(Sigma-Aldrich; St. Quentin, Fallavier, France) at 80% of their\nmaximal response. In SMA from ZF rats the different components\nof the vaso-relaxation were determined as follows: the NO-\ndependent dilation was measured in the presence of a non selective\ncyclo-oxygenase (COX) inhibitor, indomethacin, (INDO,\n100 mM; Sigma-Aldrich), apamin (100 nM; Sigma-Aldrich) and\ncharybdotoxin (50 nM; Sigma-Aldrich). The endothelium-derived\nhyperpolarizing factor (EDHF) component was assessed in the\npresence of the NO synthase inhibitor Nv-Nitro-L-arginine methyl\nester (L-NAME, 100 mM; Sigma-Aldrich) and INDO (100 mM).\nNitric oxide (NO) and superoxide anion (O2\n2)\ndetermination by electron paramagnetic resonance (EPR)\nAortas, carotid arteries and SMA were dissected and incubated\nfor NO production for 30 min in Krebs–Hepes buffer containing:\nBSA (20.5 g\/L), CaCl2 (3 mM) and L-Arginine (0.8 mM) (Sigma-\nAldrich). NaDETC (1.5 mM) and FeSO4.7H2O (1.5 mM) (Sigma-\nAldrich) were separately dissolved under argon gas bubbling in\n10 mL volumes of ice-cold Krebs–Hepes buffer. These were\nrapidly mixed to obtain a pale yellow-brown opalescent colloid\nFe(DETC)2 solution (0.4 mM), which was used immediately. The\ncolloid Fe(DETC)2 solution was added to vessels and incubated for\n45 minutes at 37uC. Then, arteries were immediately frozen in\nplastic tubes using liquid N2. NO measurement was performed on\na table-top x-band spectrometer Miniscope (Magnettech, MS200;\nBerlin, Germany). Recordings were made at 77uK, using a Dewar\nflask. Instrument settings were 10 mW of microwave power, 1 mT\nof amplitude modulation, 100 kHz of modulation frequency, 150 s\nof sweep time and 3 scans. Signals were quantified by measuring\nthe total amplitude, after correction of baseline as done previously\n[23]. Values are expressed in unit\/mg weight of dried tissue.\nFor O2\n2 spin-trapping, aortas, carotid arteries and SMA were\ndissected and allowed to equilibrate in deferoxamine-chelated\nKrebs-Hepes solution containing 1-hydroxy-3methoxycarbonyl-\n2,2,5,5-tetramethylpyrrolidin (CMH, Noxygen; Denzlingen, Ger-\nmany) (500 mM), deferoxamin (25 mM, Sigma-Aldrich) and\nDETC (5 mM, Sigma-Aldrich) under constant temperature\n(37uC) for 60 minutes. Then, they were frozen in liquid N2 and\nanalyzed in a Dewar flask by EPR. Values are expressed in unit\/\nmg weight of dried tissue.\nPolyphenols and Obesity\nPLoS ONE | www.plosone.org 2 May 2009 | Volume 4 | Issue 5 | e5557\nWestern Blotting\nAorta was dissected, homogenized and lysed. Proteins (80 mg)\nwere separated on 10% SDS-PAGE. Blots were probed with anti-\nendothelial NOS (eNOS), anti-phospho-eNOS Ser 1177, anti-\nphospho-eNOS Thr 495 (Cell Signaling; Beverly, MA), anti-\ncaveolin-1 (BD Biosciences; San Jose, CA), Mn-superoxide\ndismutase (SOD), Cu\/Zn-SOD, extracellular (Ec)-SOD (Stressgen\nBiotechnologies Corporation; Victoria, Canada), anti-gp91phox\n(Nox-2; BD Biosciences), anti-Nox-1 and anti-Nox-4 antibodies.\nData analysis\nData are expressed as mean6SEM, and n represents the\nnumber of experiences. Statistical analyses were performed using a\none way analysis of variance (ANOVA), and Mann-Whitney U\ntests or ANOVA for repeated measures and subsequent Bonfer-\nroni post hoc test. P,0.05 was considered to be statistically\nsignificant.\nResults\nProvinolsTM improve circulating parameters in ZF rats\nZF rats weighed significantly more than their lean controls and\nProvinolsTM treatment did not affect body weight of either group\n(data not shown).\nAs expected, ZF rats exhibited high glucose and fructosamine\nlevels compared to their lean littermates (Figure 1A, 1B).\nInterestingly, ProvinolsTM normalized both glycemia and fructo-\nsamine levels in ZF rats, suggesting an improvement in whole-\nbody glucose homeostasis [24]. In addition, ZF rats displayed a\nhigh circulating level of total cholesterol (Figure 1C) as well as an\nelevated ratio between LDL- and HDL-cholesterol (Figure 1D)\ncompared to lean rats. Interestingly, these two parameters were\nsignificantly improved by the ProvinolsTM treatment in ZF rats.\nMoreover, ZF rats exhibited high levels of circulating triglycerides\ncompared to lean littermates (Figure 1E), and ProvinolsTM\ntreatment significantly reduced triglyceride level in these animals.\nFigure 1. ProvinolsTM improve metabolic parameters in ZF rats. Circulating levels of glucose (A), fructosamine (B), total cholesterol (C), ratio\nbetween LDL- and HDL-cholesterol (D), triglygerides (E), creatinin (F) and uric acid (G) were evaluated in fasting plasma of rats. Values are\nmeans6SEM (n=11–12). *P,0.05, **P,0.01, ***P,0.001 Zucker fatty (ZF) rats vs. lean rats; #P,0.05, ###P,0.001 ZF+ProvinolsTM rats vs. ZF rats.\ndoi:10.1371\/journal.pone.0005557.g001\nPolyphenols and Obesity\nPLoS ONE | www.plosone.org 3 May 2009 | Volume 4 | Issue 5 | e5557\nFinally, we observed that ZF rats exhibited increased levels of\ncreatinin (Figure 1F) and uric acid (Figure 1G) compared to their\nlean controls, and while ProvinolsTM did bit affect the uric acid\nlevels, it reduced the creatinin levels to those measured in lean\ncontrols (Figure 1F).\nProvinolsTM improve cardiac parameters in ZF rats\nWe investigated the structure and function of the left ventricle of\nZF compared to their lean littermates by echocardiography and\nassessed the effect of ProvinolsTM (Figure 2). We found that ZF rats\ndisplayed a reduced diastolic left ventricular dimension (LVDd)\n(Figure 2A) compared to lean controls, even though the systolic left\nventricular dimension (LVDs) remained the same (Figure 2B).\nInterestingly, ProvinolsTM reduced LVDs without affecting LVDd\nin ZF rats compared to the lean littermates (Figure 2A and 2B), and\nthus, increased left ventricular fractional shortening.\nMoreover, we observed that although the ZF rats presented no\ndifference in cardiac output compared to lean rats (Figure 2C);\nthey exhibited a decreased fraction of ejection (Figure 2D).\nImportantly, ProvinolsTM enhanced cardiac output in ZF rats\n(Figure 2C) and increased the fraction of ejection (Figure 2D) in\ncomparison to their controls.\nIn addition, we found that ProvinolsTM significantly decreased\narterial peripheral resistance in ZF rats (Figure 2E), while the systolic\nblood pressure remained the same in both groups of rats (Figure 2F).\nProvinolsTM improve endothelial function in both aortas\nand small mesenteric arteries (SMA) from ZF rats\nEndothelial dysfunction, which is a key early factor in the\ndevelopment of atherosclerosis and a predictor of cardiovascular\nevents, has been found in patients with obesity and metabolic\nsyndrome [5,25]. Thus, we evaluated the endothelial function in\nboth conductance (aorta) and resistance (SMA) arteries from ZF\nrats and evaluated the potential protective effect of ProvinolsTM.\nAs shown in Figure 3A, aortic rings from ZF rats had reduced\nendothelium-dependent vasodilator responses to Ach compared to\naortic rings from lean controls. Interestingly, ProvinolsTM\nsignificantly corrected this impairment in endothelium-dependent\nrelaxation in aortas from ZF rats (Figure 3A).\nIn SMA, endothelium-dependent relaxation was the same in all\nfour groups (Figure 3B). To get further insight in the component\nthat may be affected upon ProvinolsTM treatment, we analyzed the\neffect of pharmacological inhibitors in SMA from ZF rats only.\nInterestingly, while ProvinolsTM did not affect the NO-component\nof the response to Ach agonist (Figure 3C), it markedly enhanced\nits EDHF-component in SMA taken from ZF rats (Figure 3D)\ncompared to non-treated ZF rats.\nAltogether, these findings indicate that ProvinolsTM improve\nendothelial function in aortas from ZF rats and in SMA in\nresponse to pharmacological stimuli.\nProvinolsTM increase arterial NO release in ZF rats by\nactivating eNOS\nGiven the important role of NO in the mediation of\nendothelium-dependent relaxation in vessels, we evaluated here\nthe molecular pathways implicated to its production upon\nProvinolsTM treatment in different arteries.\nTreatment of ZF rats with ProvinolsTM increased NO production\nin aorta (Figure 4A), carotid artery (Figure 4B) and SMA\n(Figure 4C), suggesting that the improvement in endothelial\nFigure 2. ProvinolsTM improve cardiac function in ZF rats. Echocardiography measurements of diastolic left ventricular dimension (LVDd),\nsystolic left ventricular dimension (LVDs), cardiac output and fraction of ejection (A–D). Systolic blood pressure was evaluated using tail-cuff\ntechnique (E). Total arterial peripheral resistances were calculated from blood pressure and cardiac output (F). Values are means6SEM (n=6).\n*P,0.05 Zucker fatty (ZF) rats vs. lean rats; #P,0.05 ZF+ProvinolsTM rats vs. ZF rats.\ndoi:10.1371\/journal.pone.0005557.g002\nPolyphenols and Obesity\nPLoS ONE | www.plosone.org 4 May 2009 | Volume 4 | Issue 5 | e5557\nfunction observed in these arteries is associated with a higher bio-\navailability of NO. In order to assess the mechanism(s) of NO\nrelease, we studied the NO signaling pathway in rat aorta. Although\nthe ProvinolsTM treatment did not modify either expression\n(Figure 4D) nor phosphorylation of eNOS at the inhibitor site\n(Thr 495, Figure 4E), it significantly enhanced its phosphorylation at\nthe activator site (Ser 1177, Figure 4F), suggesting that ProvinolsTM\nenhanced eNOS activity. Importantly, ProvinolsTM reduced\nexpression of caveolin-1 (Figure 4G), a protein known to inactivate\neNOS by cell membrane sequestration.\nProvinolsTM decrease arterial O2\n2 release in ZF rats by\ndecreasing the expression of the Nox-1 subunit of\nNADPH oxidase\nOxidative stress, which is one of the causative factors of\nendothelial dysfunction, is thought to play a major role in the\noccurrence and complications of obesity and metabolic syndrome\n[26]. Hence, we evaluated the vascular production of O2\n2 in ZF\nrats and its modulation by ProvinolsTM treatment.\nEPR study demonstrated that ProvinolsTM significantly reduced\nO2\n2 production in aorta (Figure 5A), carotid arteries (Figure 5B)\nand SMA (Figure 5C) from ZF rats, indicating a decrease in\noxidative stress favorable to an increase in NO bio-availability.\nWe evaluated the expression of membrane subunits of NADPH\noxidase (Nox-1, Nox-2 and Nox-4), a major source of cellular O2\n2,\nin aortas from ZF rats. ProvinolsTM treatment reduced the\nexpression of Nox-1 subunit (Figure 5D) without affecting that of\nNox-2 or Nox-4 (Figure 5E, 5F). To evaluate the effect of\nProvinolsTM on the vascular capacity to dismutate O2\n2, we\nexamined expression of different isoforms of superoxide dismutase\n(SOD). ProvinolsTM did not significantly modify Mn-SOD, Cu\/\nZn-SOD or Ec-SOD expressions (Figure 5G–5I).\nDiscussion\nIn the present study, we demonstrate that ProvinolsTM leads to an\nimprovement of glucose and lipid metabolism in ZF rats, enhances\ncardiac function and decreases peripheral resistance. In addition,\nProvinolsTM improves endothelium-dependent relaxation in both\naorta and SMA from ZF rats and this is accompanied with an\nincrease of vascular NO production and with a decrease of O2\n2\nrelease, resulting in an increase of NO bioavailability. These effects\nare associated with an increase in eNOS activity, and a decrease in\ncaveolin-1 expression, in addition to a decreased expression of Nox-\n1 NADPH oxidase subunit. Interestingly, these results show that\nProvinolsTM leads to an overall improvement of obesity-associated\nalterations, including glucose and lipid metabolism, as well as\nendothelial and cardiac functions, by mechanisms not related to\nthose linked to a decrease of body weight gain in ZF rats.\nHere, we provide evidence that ProvinolsTM treatment was\neffective in acting on the parameters linked to insulin resistance\nFigure 3. ProvinolsTM improve endothelial function in ZF rats. Acetylcholine (Ach)-induced relaxation in rat aorta (A), small mesenteric\narteries (SMA) (B), SMA in the presence of inhibitors of EDHF and COX components (C) (apamine, APA; charybdotoxin, CTX; indomethacin, INDO), SMA\nin the presence of inhibitors of NO and COX components (D) (INDO, L-NAME). Results are expressed as a percentage of relaxation. Values are\nmeans6SEM (n= 6). *P,0.05, ***P,0.001 Zucker fatty (ZF) rats vs. lean rats; #P,0.05, ###P,0.001 ZF+ProvinolsTM rats vs. ZF rats.\ndoi:10.1371\/journal.pone.0005557.g003\nPolyphenols and Obesity\nPLoS ONE | www.plosone.org 5 May 2009 | Volume 4 | Issue 5 | e5557\n(glucose and fructosamine levels) in ZF rats compared to their lean\nlittermates. These effects most likely reduced the deleterious\nconsequences of increased glycaemia, including the formation of\nadvanced glycosylated end products that not only increase oxidative\nstress but also induce endothelial dysfunction. In accordance with\nthe present study, other compounds, such as resveratrol, present in\nred wine exhibit hypoglycaemic effects in streptozotocin-induced\ndiabetic rats [27] and in obese ZF rats [28]. Moreover, Napoli et al.\n[29] showed that red wine consumption improves insulin resistance\nin type 2 diabetic patients.\nWith regard to lipid lowering properties of ProvinolsTM, the\npresent study shows that ProvinolsTM reduced circulating\ntriglycerides and total cholesterol levels, as well as the ratio\nbetween LDL- and HDL-cholesterol in ZF rats compared to lean\ncontrols. Some animal studies suggest that polyphenols may\nreduce cholesterol absorption due to the interaction of these\ncompounds with cholesterol carriers and transporters present\nacross the brush border membrane [30,31]. Very recently, Rivera\net al. [28] have shown that long-term resveratrol administration\nreduces plasma cholesterol and triglyceride levels in ZF rats. Also,\nVinson et al. [32] reported that red wine polyphenol compounds\nor grape juices reduce the plasma concentration of lipids in\nhamsters. This is consistent with the study in humans, in which\nshort-term ingestion of purple grape juice has been shown to\nreduce LDL susceptibility to oxidation in patients with coronary\nartery disease [33]. Indeed, consumption of red wine also reduces\nLDL oxidation leading to limited plaque formation in humans\n[34]. LDL oxidation was not assessed here but we clearly\ndemonstrated that ProvinolsTM improves the balance between\nLDL- and HDL-cholesterol in obese rats.\nIn regards to the structure and function of the left ventricle of\nZF rats, we showed that ProvinolsTM reduced the LVDs without\naffecting the LVDd and thus improved fractional shortening. Lee\nand coworkers [35] suggested that ZF rats exhibited reduced\nLVDs and LVDd compared to their lean littermates; however, the\nfractional shortening was not different amongst the two groups.\nThe improvement in LVDs and fractional shortening induced by\nProvinolsTM was also accompanied with an increase in fraction of\nejection and cardiac output, illustrating an improvement in systolic\nfunction. In addition, ProvinolsTM reduced total arterial periph-\neral resistance leading to the absence of modification in blood\npressure. Altogether, these findings highlight the beneficial effects\nof ProvinolsTM on cardiac function inasmuch cardiomyopathic\nchanges are noted in obesity although it cannot be isolated and\nattributed to any specific factor, such as volume overload,\noxidative stress, blood pressure changes, or other unclear factors.\nEndothelial dysfunction and hypertension are closely related to\nobesity and\/or insulin resistance [36]. Although many studies\nreported that the endothelium-dependent relaxation in response to\nAch is paradoxically preserved or even enhanced in ZF rats\nrelative to their lean littermates [37], impaired Ach-induced\nvasodilatation has also been described [38]. Numerous investiga-\ntions have indicated that red wines, grape juices, red wine\npolyphenolic and grape skin extracts are potent endothelium-\ndependent vasodilators [9,10,39]. Herein, we demonstrated that\nthe Ach-induced relaxation was impaired in aortas from ZF rats\ncompared to lean controls, and importantly was completely\ncorrected by ProvinolsTM treatment. This improvement in\nendothelial function was attributable to the increase in NO bio-\navailability as given by the concomitant increase in NO and\ndecrease in O2\n2 releases in vessels taken from ProvinolsTM-treated\nZF rats compared to non-treated ZF rats. In accordance with our\nprevious study [40], ProvinolsTM treatment enhanced activity of\neNOS and decreased the expression of caveolin-1, a protein\nknown to sequestrate eNOS. In addition, we showed here that\nProvinolsTM decreases NADPH oxidase Nox-1 subunit expression,\nleading to a decrease in O2\n2 release from aorta. In agreement with\nour data, Sarr et al. [41] reported that red wine polyphenols\nprevented the angiotensin II-induced expression of Nox-1 subunit\nin rat aorta.\nFigure 4. ProvinolsTM increase NO vascular release in vessels from ZF rats. NO production in aorta (A), carotid arteries (B) and small\nmesenteric arteries (C) from Zucker fatty (ZF) and ZF+ProvinolsTM rats. Values are expressed as units of amplitude (A)\/mg weight of dried tissue (dw).\nWestern blots revealing expression of eNOS (D), phosphorylation of eNOS at Thr495 (E), and NOS Ser1177 (F) and expression of caveolin-1 (G) in aorta\nexpressed as arbitrary units (A.U.). (n=6). *P,0.05, **P,0.01 vs. ZF rats.\ndoi:10.1371\/journal.pone.0005557.g004\nPolyphenols and Obesity\nPLoS ONE | www.plosone.org 6 May 2009 | Volume 4 | Issue 5 | e5557\nOf note is that increased EDHF component was highlighted in\nresponse to Ach-induced vasodilatation (chemical stimulation),\nalthough no difference among the groups has been observed in\nSMA. Blockade of COX and EDHF components using INDO\nand charybdotoxin plus apamin, reduced the response to Ach in\nboth groups of ZF rats to the same extent, even though the bio-\navailability of NO was increased in vessels from ProvinolsTM-\ntreated animals, suggesting that the amount of NO released in\nnon-treated ZF rats is sufficient to induce the maximal effect.\nInterestingly, when the NO and COX components were inhibited\nusing INDO and L-NAME, the endothelium-dependent relaxa-\ntion in response to Ach was decreased in ZF versus ProvinolsTM-\ntreated ZF rats suggesting that ProvinolsTM treatment increases\nEDHF-mediated relaxation in SMA. Previous studies have shown\nthat red wine polyphenols induced EDHF-dependent relaxation in\nporcine coronary arteries [39,42]. These results underlined an\nincreased EDHF contribution on Ach response upon ProvinolsTM\nafter blockade of both NO and COX pathways as a possible\ncompensatory mechanism in the same way to those shown in our\nprevious studies in human resistance arteries [43].\nThe treatment of metabolic diseases and obesity-related\ncomplications are currently based on the treatment of their\nindividual components, e.g. hypertension and insulin resistance.\nDue to the multi-factorial properties of ProvinolsTM, they may be\na good candidate for prevention and treatment of metabolic\nsyndrome and reduction of cardiovascular risk. Our present study\nprovides strong evidence for beneficial effects of red wine\npolyphenols on both, vascular and cardiac functions in ZF rats,\nsuggesting that they may therefore be of therapeutic benefit in the\nfuture and may represent a new class of medicinal products against\nobesity-associated diseases.\nAcknowledgments\nWe thank A. Dequesne (technical platform of Toulouse Midi-Pyre´ne´es\nGenopoleH IFR31) for technical assistance in biochemistry analysis.\nFigure 5. ProvinolsTM reduce O2\n2 vascular release in vessels from ZF rats. O2\n2 production in aorta (A), carotid arteries (B) and small\nmesenteric arteries (C) from Zucker fatty (ZF) and ZF+ProvinolsTM rats. Values are expressed as units of amplitude (A)\/mg weight of dried tissue (dw).\nWestern blots revealing expression of Nox-1 (D), Nox-2 (E), Nox-4 (F), Mn-SOD (G), Cu\/Zn-SOD (H) and Ec-SOD (I) in aorta expressed as arbitrary units\n(A.U.). (n=6). *P,0.05, **P,0.01 vs. ZF rats.\ndoi:10.1371\/journal.pone.0005557.g005\nPolyphenols and Obesity\nPLoS ONE | www.plosone.org 7 May 2009 | Volume 4 | Issue 5 | e5557\nAuthor Contributions\nConceived and designed the experiments: RA. Performed the experiments:\nAA AHLLH HAM AT PM PR FD MCM. Analyzed the data: AA\nAHLLH RA. Contributed reagents\/materials\/analysis tools: AA AHLLH\nCH. Wrote the paper: AA RA.\nReferences\n1. Kopelman PG (2000) Obesity as a medical problem. Nature 404: 635–643.\n2. Montague CT, O’Rahilly S (2000) The perils of portliness: causes and\nconsequences of visceral adiposity. Diabetes 49: 883–888.\n3. DeFronzo RA, Ferrannini E (1991) Insulin resistance. A multifaceted syndrome\nresponsible for NIDDM, obesity, hypertension, dyslipidemia, and atherosclerotic\ncardiovascular disease. Diabetes Care 14: 173–194.\n4. Lerman A, Zeiher AM (2005) Endothelial function: cardiac events. Circulation\n111: 363–368.\n5. Fornoni A, Raij L (2005) Metabolic syndrome and endothelial dysfunction. Curr\nHypertens Rep 7: 88–95.\n6. Defronzo RA (2006) Is insulin resistance atherogenic? Possible mechanisms.\nAtheroscler Suppl 7: 11–15.\n7. Cersosimo E, DeFronzo RA (2006) Insulin resistance and endothelial\ndysfunction: the road map to cardiovascular diseases. Diabetes Metab Res\nRev 22: 423–436.\n8. Middleton E Jr, Kandaswami C, Theoharides TC (2000) The effects of plant\nflavonoids on mammalian cells: implications for inflammation, heart disease, and\ncancer. Pharmacol Rev 52: 673–751.\n9. Curin Y, Ritz MF, Andriantsitohaina R (2006) Cellular mechanisms of the\nprotective effect of polyphenols on the neurovascular unit in strokes. Cardiovasc\nHematol Agents Med Chem 4: 277–288.\n10. Pechanova O, Rezzani R, Babal P, Bernatova I, Andriantsitohaina R (2006)\nBeneficial effects of Provinols: cardiovascular system and kidney. Physiol Res 55\nSuppl 1: S17–30.\n11. Andriambeloson E, Kleschyov AL, Muller B, Beretz A, Stoclet JC, et al. (1997)\nNitric oxide production and endothelium-dependent vasorelaxation induced by\nwine polyphenols in rat aorta. Br J Pharmacol 120: 1053–1058.\n12. Reaven GM (1995) Pathophysiology of insulin resistance in human disease.\nPhysiol Rev 75: 473–486.\n13. Zucker LM, Antoniades HN (1972) Insulin and obesity in the Zucker genetically\nobese rat ‘‘fatty’’. Endocrinology 90: 1320–1330.\n14. Kurtz TW, Morris RC, Pershadsingh HA (1989) The Zucker fatty rat as a\ngenetic model of obesity and hypertension. Hypertension 13: 896–901.\n15. Iida M, Murakami T, Ishida K, Mizuno A, Kuwajima M, et al. (1996)\nPhenotype-linked amino acid alteration in leptin receptor cDNA from Zucker\nfatty (fa\/fa) rat. Biochem Biophys Res Commun 222: 19–26.\n16. Phillips MS, Liu Q, Hammond HA, Dugan V, Hey PJ, et al. (1996) Leptin\nreceptor missense mutation in the fatty Zucker rat. Nat Genet 13: 18–19.\n17. Diebolt M, Bucher B, Andriantsitohaina R (2001) Wine polyphenols decrease\nblood pressure, improve NO vasodilatation, and induce gene expression.\nHypertension 38: 159–165.\n18. Bernatova I, Pechanova O, Babal P, Kysela S, Stvrtina S, et al. (2002) Wine\npolyphenols improve cardiovascular remodeling and vascular function in NO-\ndeficient hypertension. Am J Physiol Heart Circ Physiol 282: H942–948.\n19. Ralay Ranaivo H, Diebolt M, Andriantsitohaina R (2004) Wine polyphenols\ninduce hypotension, and decrease cardiac reactivity and infarct size in rats:\ninvolvement of nitric oxide. Br J Pharmacol 142: 671–678.\n20. Ritz MF, Ratajczak P, Curin Y, Cam E, Mendelowitsch A, et al. (2008) Chronic\ntreatment with red wine polyphenol compounds mediates neuroprotection in a\nrat model of ischemic cerebral stroke. J Nutr 138: 519–525.\n21. Pechanova O, Bernatova I, Babal P, Martinez MC, Kysela S, et al. (2004) Red\nwine polyphenols prevent cardiovascular alterations in L-NAME-induced\nhypertension. J Hypertens 22: 1551–1559.\n22. Puzserova A, Csizmadiova Z, Andriantsitohaina R, Bernatova I (2006) Vascular\neffects of red wine polyphenols in chronic stress-exposed Wistar-Kyoto rats.\nPhysiol Res 55 Suppl 1: S39–47.\n23. Agouni A, Mostefai HA, Porro C, Carusio N, Favre J, et al. (2007) Sonic\nhedgehog carried by microparticles corrects endothelial injury through nitric\noxide release. Faseb J 21: 2735–2741.\n24. Terrettaz J, Assimacopoulos-Jeannet F, Jeanrenaud B (1986) Severe hepatic and\nperipheral insulin resistance as evidenced by euglycemic clamps in genetically\nobese fa\/fa rats. Endocrinology 118: 674–678.\n25. Sturm W, Sandhofer A, Engl J, Laimer M, Molnar C, et al. (2009) Influence of\nvisceral obesity and liver fat on vascular structure and function in obese subjects.\nObesity (Silver Spring).\n26. Hsueh WA, Lyon CJ, Quinones MJ (2004) Insulin resistance and the\nendothelium. Am J Med 117: 109–117.\n27. Su HC, Hung LM, Chen JK (2006) Resveratrol, a red wine antioxidant,\npossesses an insulin-like effect in streptozotocin-induced diabetic rats.\nAm J Physiol Endocrinol Metab 290: E1339–1346.\n28. Rivera L, Moron R, Zarzuelo A, Galisteo M (2009) Long-term resveratrol\nadministration reduces metabolic disturbances and lowers blood pressure in\nobese Zucker rats. Biochem Pharmacol 77: 1053–1063.\n29. Napoli R, Cozzolino D, Guardasole V, Angelini V, Zarra E, et al. (2005) Red\nwine consumption improves insulin resistance but not endothelial function in\ntype 2 diabetic patients. Metabolism 54: 306–313.\n30. Conseil G, Baubichon-Cortay H, Dayan G, Jault JM, Barron D, et al. (1998)\nFlavonoids: a class of modulators with bifunctional interactions at vicinal ATP-\nand steroid-binding sites on mouse P-glycoprotein. Proc Natl Acad Sci U S A 95:\n9831–9836.\n31. Leslie EM, Mao Q, Oleschuk CJ, Deeley RG, Cole SP (2001) Modulation of\nmultidrug resistance protein 1 (MRP1\/ABCC1) transport and atpase activities\nby interaction with dietary flavonoids. Mol Pharmacol 59: 1171–1180.\n32. Vinson JA, Teufel K, Wu N (2001) Red wine, dealcoholized red wine, and\nespecially grape juice, inhibit atherosclerosis in a hamster model. Atherosclerosis\n156: 67–72.\n33. Stein JH, Keevil JG, Wiebe DA, Aeschlimann S, Folts JD (1999) Purple grape\njuice improves endothelial function and reduces the susceptibility of LDL\ncholesterol to oxidation in patients with coronary artery disease. Circulation 100:\n1050–1055.\n34. Nigdikar SV, Williams NR, Griffin BA, Howard AN (1998) Consumption of red\nwine polyphenols reduces the susceptibility of low-density lipoproteins to\noxidation in vivo. Am J Clin Nutr 68: 258–265.\n35. Lee SD, Kuo WW, Bau DT, Ko FY, Wu FL, et al. (2008) The coexistence of\nnocturnal sustained hypoxia and obesity additively increases cardiac apoptosis.\nJ Appl Physiol 104: 1144–1153.\n36. Steinberg HO, Chaker H, Leaming R, Johnson A, Brechtel G, et al. (1996)\nObesity\/insulin resistance is associated with endothelial dysfunction. Implica-\ntions for the syndrome of insulin resistance. J Clin Invest 97: 2601–2610.\n37. Subramanian R, MacLeod KM (2003) Age-dependent changes in blood\npressure and arterial reactivity in obese Zucker rats. Eur J Pharmacol 477:\n143–152.\n38. Galisteo M, Sanchez M, Vera R, Gonzalez M, Anguera A, et al. (2005) A diet\nsupplemented with husks of Plantago ovata reduces the development of\nendothelial dysfunction, hypertension, and obesity by affecting adiponectin\nand TNF-alpha in obese Zucker rats. J Nutr 135: 2399–2404.\n39. Ndiaye M, Chataigneau T, Andriantsitohaina R, Stoclet JC, Schini-Kerth VB\n(2003) Red wine polyphenols cause endothelium-dependent EDHF-mediated\nrelaxations in porcine coronary arteries via a redox-sensitive mechanism.\nBiochem Biophys Res Commun 310: 371–377.\n40. Baron-Menguy C, Bocquet A, Guihot AL, Chappard D, Amiot MJ, et al. (2007)\nEffects of red wine polyphenols on postischemic neovascularization model in\nrats: low doses are proangiogenic, high doses anti-angiogenic. Faseb J 21:\n3511–3521.\n41. Sarr M, Chataigneau M, Martins S, Schott C, El Bedoui J, et al. (2006) Red\nwine polyphenols prevent angiotensin II-induced hypertension and endothelial\ndysfunction in rats: role of NADPH oxidase. Cardiovasc Res 71: 794–802.\n42. Ndiaye M, Chataigneau T, Chataigneau M, Schini-Kerth VB (2004) Red wine\npolyphenols induce EDHF-mediated relaxations in porcine coronary arteries\nthrough the redox-sensitive activation of the PI3-kinase\/Akt pathway.\nBr J Pharmacol 142: 1131–1136.\n43. Ohlmann P, Martinez MC, Schneider F, Stoclet JC, Andriantsitohaina R (1997)\nCharacterization of endothelium-derived relaxing factors released by bradykinin\nin human resistance arteries. Br J Pharmacol 121: 657–664.\nPolyphenols and Obesity\nPLoS ONE | www.plosone.org 8 May 2009 | Volume 4 | Issue 5 | e5557\n"}