{"doi":"10.1007\/s00410-009-0460-z","coreId":"15384","oai":"oai:dro.dur.ac.uk.OAI2:7502","identifiers":["oai:dro.dur.ac.uk.OAI2:7502","10.1007\/s00410-009-0460-z"],"title":"Geochemical and Sr-O isotopic constraints on magmatic differentiation at Gede volcanic complex, west Java, Indonesia.","authors":["Handley, H.K.","Macpherson, C.G.","Davidson, J.P."],"enrichments":{"references":[{"id":889196,"title":"(2008a) Untangling differentiation in arc lavas: constraints from unusual minor and trace element variations at Salak Volcano, Indonesia. Chem Geol 255:360-376","authors":[],"date":"2000","doi":"10.1016\/j.chemgeo.2008.07.007","raw":null,"cites":null},{"id":889198,"title":"A routine method for the dissolution of geological samples for the analysis of REE and trace elements via ICP-MS. Plasma Source Mass Spectrometry. Spec Pub Royal Soc Chem 221-230. )Supplementary Table 1. Modal proportions of mineral phases","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":889197,"title":"Long-term performance characteristics of a plasma ionisation multi-collector mass spectrometer (PIMMS): the ThermoFinnigan Neptune. Plasma Source Mass Spectrometry. Spec Pub Royal Soc Chem","authors":[],"date":"2003","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-06-01","abstract":"The Gede Volcanic Complex (GVC) of the Sunda island arc (West Java, Indonesia) consists of multiple volcanic centres and eruptive groups with complex magmatic histories. We present new petrological, mineralogical, whole-rock major and trace element and Sr–O isotopic data to provide constraints on the relative importance of fractional crystallisation and magma mixing in petrogenesis, as well as on the role and nature of the arc crust. Banded juvenile scoria from Young and Old Gede provide unequivocal evidence for the (late-stage) interaction of distinct magmas at Gede volcano. However, the relatively small-degree compositional zoning observed in plagioclase phenocrysts of all eruptive groups (up to ~20 mol% An) may be attributed to physical changes in magma properties (e.g. P, T, and PH2O) rather than changes in melt composition. Major element and trace element variations within each eruptive series are inconsistent with magmatic evolution through simple mixing processes. Instead, mixing of variably fractionated magma batches is suggested to account for the significant scatter in some element variation diagrams. No correlation is observed between textural complexity and\/or mineral disequilibrium and whole-rock geochemistry. REE data and geochemical modelling indicate that fractional crystallisation involving amphibole in the mid- to lower crust, and fractionation of plagioclase, clinopyroxene, Fe–Ti oxide ± olivine ± orthopyroxene provide strong control on the geochemical evolution of GVC rocks. Two-pyroxene geothermobarometry provides pre-eruption crystallisation temperatures of 891–1,046°C and pressures of 3.4–6.5 kbar, equivalent to ~13–24 km depth beneath the volcanoes (mid- to lower crust). Low, mantle-like clinopyroxene δ18O values of GVC lavas and poor correlation of Sr isotope ratios with indices of differentiation precludes significant assimilation of isotopically distinct crust during magmatic differentiation. Therefore, we suggest that the geochemical character of the moderately thick West Javan arc crust is relatively immature compared to typical continental crust. Trace element ratios and strontium isotopes show that the magmatic source composition of the older geographical units, Gegerbentang and Older Quaternary, is distinct from the other GVC groups. \\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/15384.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/7502\/1\/7490.pdf","pdfHashValue":"5276f15e21042a88d00028bde5f2c980ed12684f","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:7502<\/identifier><datestamp>\n      2010-11-08T14:05:18Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Geochemical and Sr-O isotopic constraints on magmatic differentiation at Gede volcanic complex, west Java, Indonesia.<\/dc:title><dc:creator>\n        Handley, H.K.<\/dc:creator><dc:creator>\n        Macpherson, C.G.<\/dc:creator><dc:creator>\n        Davidson, J.P.<\/dc:creator><dc:description>\n        The Gede Volcanic Complex (GVC) of the Sunda island arc (West Java, Indonesia) consists of multiple volcanic centres and eruptive groups with complex magmatic histories. We present new petrological, mineralogical, whole-rock major and trace element and Sr–O isotopic data to provide constraints on the relative importance of fractional crystallisation and magma mixing in petrogenesis, as well as on the role and nature of the arc crust. Banded juvenile scoria from Young and Old Gede provide unequivocal evidence for the (late-stage) interaction of distinct magmas at Gede volcano. However, the relatively small-degree compositional zoning observed in plagioclase phenocrysts of all eruptive groups (up to ~20 mol% An) may be attributed to physical changes in magma properties (e.g. P, T, and PH2O) rather than changes in melt composition. Major element and trace element variations within each eruptive series are inconsistent with magmatic evolution through simple mixing processes. Instead, mixing of variably fractionated magma batches is suggested to account for the significant scatter in some element variation diagrams. No correlation is observed between textural complexity and\/or mineral disequilibrium and whole-rock geochemistry. REE data and geochemical modelling indicate that fractional crystallisation involving amphibole in the mid- to lower crust, and fractionation of plagioclase, clinopyroxene, Fe–Ti oxide ± olivine ± orthopyroxene provide strong control on the geochemical evolution of GVC rocks. Two-pyroxene geothermobarometry provides pre-eruption crystallisation temperatures of 891–1,046°C and pressures of 3.4–6.5 kbar, equivalent to ~13–24 km depth beneath the volcanoes (mid- to lower crust). Low, mantle-like clinopyroxene δ18O values of GVC lavas and poor correlation of Sr isotope ratios with indices of differentiation precludes significant assimilation of isotopically distinct crust during magmatic differentiation. Therefore, we suggest that the geochemical character of the moderately thick West Javan arc crust is relatively immature compared to typical continental crust. Trace element ratios and strontium isotopes show that the magmatic source composition of the older geographical units, Gegerbentang and Older Quaternary, is distinct from the other GVC groups. \\ud\n<\/dc:description><dc:subject>\n        Crustal contamination<\/dc:subject><dc:subject>\n         Fractional crystallisation<\/dc:subject><dc:subject>\n         Geochemistry<\/dc:subject><dc:subject>\n         Magma mixing<\/dc:subject><dc:subject>\n         Sunda arc.<\/dc:subject><dc:publisher>\n        Springer<\/dc:publisher><dc:source>\n        Contributions to mineralogy and petrology, 2010, Vol.159(6), pp.885-908 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2010-06-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:7502<\/dc:identifier><dc:identifier>\n        issn:0010-7999<\/dc:identifier><dc:identifier>\n        issn: 1432-0967<\/dc:identifier><dc:identifier>\n        doi:10.1007\/s00410-009-0460-z<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7502\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1007\/s00410-009-0460-z<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7502\/1\/7490.pdf<\/dc:identifier><dc:rights>\n        The original publication is available at www.springerlink.com<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":[" 1432-0967","0010-7999","issn: 1432-0967","issn:0010-7999"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":["Crustal contamination","Fractional crystallisation","Geochemistry","Magma mixing","Sunda arc."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n29 October 2010\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nHandley, H.K. and Macpherson, C.G. and Davidson, J.P. (2010) ’Geochemical and Sr-O isotopic constraints\non magmatic differentiation at Gede volcanic complex, west Java, Indonesia.’, Contributions to mineralogy\nand petrology., 159 (6). pp. 885-908.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1007\/s00410-009-0460-z\nPublisher’s copyright statement:\nThe original publication is available at www.springerlink.com\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 1 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n 10 \n 11 \nGeochemical and Sr-O isotopic constraints on magmatic 12 \ndifferentiation at Gede Volcanic Complex (GVC), West Java, 13 \nIndonesia 14 \n 15 \nHeather K. Handley\n*\n, Colin G. Macpherson, Jon P. Davidson\n \n16 \nDepartment of Earth Sciences, Durham University, Durham, DH1 3LE, UK. 17 \n 18 \n 19 \n 20 \n 21 \n 22 \n 23 \n 24 \n 25 \n 26 \n 27 \n 28 \n 29 \n*Corresponding author. GEMOC Key Centre, Department of Earth and Planetary Sciences, 30 \nMacquarie University, Sydney, NSW 2109 Australia. Telephone: +61 2 9850 4405. Fax: +61 31 \n2 9850 8943. Email: hhandley@science.mq.edu.au 32 \nManuscript\nClick here to download Manuscript: HHandley_revised_Text.doc\n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 2 \nAbstract 1 \nThe Gede Volcanic Complex (GVC) of the Sunda island arc (West Java, Indonesia) consists 2 \nof multiple volcanic centres and eruptive groups with complex magmatic histories. We 3 \npresent new petrological, mineralogical, whole-rock major and trace element, and Sr-O 4 \nisotopic data to provide constraints on the relative importance of fractional crystallisation and 5 \nmagma mixing in petrogenesis, as well as on the role and nature of the arc crust. Banded 6 \njuvenile scoria from Young and Old Gede provide unequivocal evidence for the (late-stage) 7 \ninteraction of distinct magmas at Gede volcano. However, the relatively small-degree 8 \ncompositional zoning observed in plagioclase phenocrysts of all eruptive groups (up to ~20 9 \nmol% An) may be attributed to physical changes in magma properties (e.g. P, T, and PH2O) 10 \nrather than changes in melt composition. Major element and trace element variations within 11 \neach eruptive series are inconsistent with magmatic evolution through simple mixing 12 \nprocesses. Instead, mixing of variably fractionated magma batches is suggested to account for 13 \nthe significant scatter in some element variation diagrams. No correlation is observed 14 \nbetween textural complexity and\/or mineral disequilibrium and whole-rock geochemistry. 15 \nREE data and geochemical modelling indicate that fractional crystallisation involving 16 \namphibole in the mid- to lower crust, and fractionation of plagioclase, clinopyroxene, Fe-Ti 17 \noxide ± olivine ± orthopyroxene provide strong control on the geochemical evolution of GVC 18 \nrocks. Two-pyroxene geothermobarometry provides pre-eruption crystallisation temperatures 19 \nof 891-1046ºC and pressures of 3.4-6.5 kbar, equivalent to ~13-24km depth beneath the 20 \nvolcanoes (mid- to lower crust). Low, mantle-like clinopyroxene 18O values of GVC lavas 21 \nand poor correlation of Sr isotope ratios with indices of differentiation precludes significant 22 \nassimilation of isotopically distinct crust during magmatic differentiation. Therefore, we 23 \nsuggest that the geochemical character of the moderately thick West Javan arc crust is 24 \nrelatively immature compared to typical continental crust. Trace element ratios and strontium 25 \nisotopes show that the magmatic source composition of the older geographical units, 26 \nGegerbentang and Older Quaternary, is distinct from the other GVC groups. 27 \n 28 \nKey words 29 \ncrustal contamination, fractional crystallisation, geochemistry, magma mixing, Sunda arc 30 \n 31 \nIntroduction 32 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 3 \nArc lavas display a wide variation in composition, which reflects both the composition of the 1 \nprimary magma from which they originated and the multitude of differentiation processes 2 \nmagmas experience en route to the Earth‟s surface. Among the latter processes, fractional 3 \ncrystallisation (Ewart 1982; Foden 1983; Gerbe et al. 1992), crustal contamination (Davidson 4 \net al. 1987; Hildreth and Moorbath 1988; Davidson and Harmon 1989) and magma mixing 5 \n(Gamble et al. 1999; Tepley et al. 2000) are commonly called upon to explain geochemical 6 \nvariation in arc lavas. Constraints upon the relative importance of differentiation processes at 7 \nindividual volcanoes are essential before the characteristics of the source can be investigated. 8 \nThe Sunda arc, formed by subduction of the Indo-Australian Plate beneath the 9 \nEurasian Plate, includes around 80% of Indonesia‟s active volcanoes - many of which have 10 \nproduced eruptions that have had significant impact on local and global environments (e.g. 11 \nToba, Krakatau and Tambora). However, despite an apparently simple tectonic setting, 12 \nunderstanding magma genesis and evolution at the Sunda arc is complicated by along-arc 13 \nchanges in the composition and thickness of the overriding Eurasian plate (Hamilton 1979).  14 \nGVC in West Java has been largely overlooked by petrologists and geochemists 15 \nstudying petrogenesis of Sunda arc volcanoes. This is surprising considering the active Gede 16 \nVolcano (from which the complex derives its name) is one of the most prominent in West 17 \nJava and is located in close proximity (~70 km) to the densely populated capital, Jakarta. 18 \nFurthermore, to the east of GVC researchers have argued that the dominant crustal 19 \ncomponent identified in magma genesis is provided by the subducting slab (i.e. source 20 \ncontamination) (Edwards 1990; Gerbe et al. 1992; Turner and Foden 2001; Gertisser and 21 \nKeller 2003; Handley et al. 2007; cf. Chadwick et al. 2007), while to the west of GVC, He 22 \n(Gasparon and Varne 1998), Nd (Turner and Foden 2001) and Sr (Handley et al. 2008a) 23 \nisotopic investigations reveal the importance of shallow-level crustal contamination. 24 \nTherefore, GVC is in an ideal location to investigate contributions from the arc crust in 25 \nvolcanic petrogenesis and conclusions from this study will help elucidate the nature of the 26 \nlocal arc crust. This paper presents new data on the petrography, mineralogy, geochemistry 27 \nand Sr-O isotopic composition of GVC volcanic products. Textural and chemical information 28 \nof phenocrysts is integrated with major, trace element and isotopic data to provide constraints 29 \non the relative roles of fractional crystallisation and magma mixing, as well as the role and 30 \npossible nature of the arc crust. These questions are fundamental to understanding the 31 \nfunctioning of magmatic systems. 32 \n 33 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 4 \nGeological setting 1 \nGVC is located in West Java within the Quaternary volcanic front of the Sunda arc (Fig. 1 2 \ninset). The Sunda arc forms the western part of the Indonesian subduction zone system and 3 \nformed as a result of the northward subduction of the Indo-Australian Plate beneath the 4 \nEurasian Plate. A detailed tectonic description of the area is given by Hamilton (1979). GVC 5 \nis dominated by the twin stratovolcanoes of Gede (2958 m), the only active volcano of the 6 \ncomplex, and Pangrango (3019 m), an extinct volcano to the northwest (Fig. 1). Gede is 7 \ndivided morphologically and stratigraphically into Old and Young Gede (Situmorang and 8 \nHadisantono 1992). The remnant crater rim (50-200m high) of Old Gede is marked by 9 \nGunung Gumuruh (Fig. 1). This crater, now truncated by Young Gede in the north-west, is 10 \nthe largest (~1600m in diameter) and oldest crater at Gede. The volcanic deposits of Old 11 \nGede are exposed on the south-eastern slope of Gede and form a deeply dissected 12 \nmorphology. Young Gede consists of several smaller craters (Sela, Ratu, Lanang, Wadon and 13 \nBaru) contained within the 1km wide, steep-walled (200m) Gede crater. Most of the eruptive 14 \ndeposits of Young Gede are confined in relatively narrow belts, extending north-east and 15 \nsouth-west of the summit due to the topographic highs of Pangrango-Masigit and Old Gede in 16 \nthe northwest and southeast, respectively. The heavily forested Pangrango volcano is 17 \nconstructed on the north-east rim of a large caldera\/collapse structure (Gunung Masigit, Fig. 18 \n1) which is open to the south-west. The Gegerbentang Complex consists of a series of eroded 19 \nvolcanoes situated to the north of Gede and is relatively older than both Gede and Pangrango 20 \n(Fig. 1). The oldest deposits of Quaternary volcanic material (Older Quaternary Volcanic 21 \ngroup) are exposed to the east and south west of Gede (Besar and Koncana respectively, Fig. 22 \n1). Basement rocks of the complex and surrounding area are dominated by Tertiary aged 23 \nvolcanogenic and marine sediments (Effendi et al. 1998). Around 20 small eruptions of short 24 \nduration have been reported from Gede volcano since the mid-18th century. Pyroclastic flows 25 \nwere generated during a larger eruption in 1840. More recently, a brief ash ejection occurred 26 \nin 1957 (VSI) and at the end of April 1991 a series of volcanic earthquake swarms were 27 \nrecorded (VSI). Kawah Lanang and Kawah Wadon are the most active craters at present, 28 \nshowing signs of hydrothermal activity. 29 \n 30 \nSample selection and grouping 31 \nThe diverse range of volcanic rocks and volcanic related products from the GVC include: 32 \nlava, pyroclastic flow, air fall, debris flow and lahar deposits. Sample material collected for 33 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 5 \ngeochemical analysis was limited to fresh samples of lava flows and juvenile scoria from 1 \npyroclastic flow deposits. The generally low LOI values for most samples (Table 1) and lack 2 \nof visible alteration in rock samples and thin sections (except in a few specimens) confirm the 3 \nsamples are fresh. In this study the eruptive products of Young Gede are grouped into Young 4 \nGede Kawah Ratu (those sourced from Kawah Ratu) and Young Gede Other Vents (sourced 5 \nfrom the Gede crater in general) due to uncertainty in the provenance of some samples and 6 \nthe distinction of these two groups on the geological map of the Gede Volcanic Complex 7 \n(Situmorang and Hadisantono 1992). Here the term Pangrango refers to all units of the 8 \nPangrango-Masigit centres and likewise, Gegerbentang, refers to all volcanic units within the 9 \nGegerbentang complex. The relative stratigraphy of the volcanic centres and eruptive groups 10 \nis shown on the inset diagram in Fig. 1. On the basis of Ba\/La and Zr\/Nb trace element ratios 11 \nversus \n87\nSr\/\n86\nSr isotopes (Figs. 2a and b) volcanic rocks from Gegerbentang and the Older 12 \nQuaternary volcanics group are thought to represent a different geochemical source 13 \ncomposition and therefore these samples are highlighted (by contour lines) in subsequent 14 \nscatter diagrams. The analytical techniques used are given in the Supplementary data section. 15 \n 16 \nResults 17 \nPetrography 18 \nThe volcanic products of GVC have not been previously described. Therefore, this section 19 \nwill focus on the petrography and mineralogy of each eruptive centre (in stratigraphical order 20 \nfrom the youngest to oldest) highlighting textural features which may contribute to the 21 \nunderstanding of petrogenesis at GVC. Basaltic andesite is the most common rock type 22 \nerupted and basalts are largely restricted to eruptives of Pangrango and Gegerbentang. The 23 \nmajority of GVC rocks contain similar mineral assemblages of plagioclase, clinopyroxene 24 \nand Fe-Ti oxide ± orthopyroxene ± olivine. Petrographic summaries of Gede lavas are given 25 \nin Supplementary Table 1 and mineral data are found in Supplementary Tables 2-6. 26 \nVolcanic rocks from the Kawah Ratu centre of Young Gede (YGKR) consist of 27 \nbasaltic andesites and andesites and contain a mineral assemblage of plagioclase, 28 \nclinopyroxene, orthopyroxene and Ti-magnetite, set within a very fine-grained groundmass of 29 \nplagioclase, Fe-Ti oxide and devitrified glass. The Kawah Ratu eruptives are dominantly 30 \nseriate in texture and contain the most textural complexity of all groups. Oscillatory zoning, 31 \nsieve textures and concentric bands of melt inclusions are observed in a large number of 32 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 6 \nplagioclase phenocrysts and microphenocrysts. More than half of the samples of this group 1 \ncontain anhedral orthopyroxene phenocrysts mantled by clinopyroxene. 2 \nRocks erupted from the Other Vents Group at Young Gede are dominated by basaltic 3 \nandesites, with minor andesites and contain an identical mineral assemblage to the Kawah 4 \nRatu rocks, with the exception of olivine instead of orthopyroxene phenocrysts in a few 5 \nbasaltic andesite samples. Rocks of this group display mainly porphyritic textures and are 6 \ngenerally less phenocryst rich than Kawah Ratu volcanic rocks and the plagioclase 7 \nphenocrysts are texturally less complex. Many of the rocks sampled of this group are highly 8 \nvesicular juvenile scoria of pyroclastic flow deposits, which contain a very fine-grained 9 \ngroundmass of devitrified glass and plagioclase, or plagioclase, oxide and pyroxene. These 10 \nsamples show evidence of magma mingling between dark, less evolved material and lighter 11 \nmore evolved material (described in more detail below). Xenoliths of igneous origin are 12 \npresent in some Young Gede samples (see below). 13 \nThe basaltic andesites and andesites of Old Gede are dominantly porphyritic to seriate 14 \nin texture. In the basaltic andesites, plagioclase, clinopyroxene and titanomagnetite are 15 \naccompanied either by olivine, orthopyroxene or in a few cases both (suggestive of mineral 16 \ndisequilibrium). Olivine is not present in the andesites. The volcanic products of Old Gede 17 \ncontain lower modal abundances of ferromagnesian minerals compared to those of Young 18 \nGede (Supplementary Table 1). The very fine- to fine-grained groundmass contains 19 \nplagioclase and oxide ± pyroxene. Magma mingling textures are also observed in juvenile 20 \nscoria of pyroclastic flow deposits of this group (see below). 21 \nEruptives from Pangrango consist of basalts and basaltic andesites. Most of these 22 \nlavas are strikingly porphyritic in hand specimen, containing large (up to ~1.2 cm) euhedral 23 \nclinopyroxene phenocrysts. The rocks are seriate in texture and mineral assemblages 24 \ncomprise plagioclase, clinopyroxene, Ti-magnetite with either olivine (in the basalts) or 25 \northopyroxene (in the basaltic andesites). The phenocrysts are set in a fine-grained 26 \ngroundmass of plagioclase, clinopyroxene ± olivine. Some of the orthopyroxene phenocrysts 27 \nare mantled by clinopyroxene. 28 \nMost rocks from Gegerbentang display seriate textures of plagioclase, clinopyroxene, 29 \northopyroxene, with minor Ti-magnetite and rare olivine, in a very fine-, to fine-grained 30 \ngroundmass of plagioclase and oxide ± pyroxene. 31 \nIt has proved difficult to obtain fresh samples from the Older Quaternary units; 32 \nchlorite is commonly observed replacing ferromagnesian minerals in these rocks and LOI 33 \nvalues are generally higher than those of other GVC rocks (0.35-0.91 wt%, Table 1). The 34 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 7 \nrocks contain the typical GVC mineral assemblage of plagioclase, clinopyroxene, 1 \northopyroxene and Ti-magnetite. Minor hornblende is present within one sample, where it 2 \nhas been altered to biotite. 3 \n 4 \nMineral characteristics and chemistry 5 \nPlagioclase 6 \nSubhedral to euhedral plagioclase dominates the modal phase assemblage of all GVC rocks. 7 \nOscillatory zoning, sieve textures and concentric bands of melt inclusions are present in a 8 \nlarge number of phenocrysts within all groups but particularly within Kawah Ratu rocks    9 \nsuggesting complex histories of these phenocrysts. In some Kawah Ratu samples, sieve-10 \ntextured phenocryst cores are surrounded by clear rims of plagioclase. A large number of 11 \nplagioclase phenocrysts in Young Gede and Old Gede rocks have irregular\/patchy, pale 12 \nbrown, isotropic glass inclusions. Resorbed cores are present in occasional plagioclase 13 \nphenocrysts from Pangrango and Kawah Ratu. 14 \nPlagioclase phenocrysts of GVC rocks display a broad range in composition from 15 \n~An45-An95 and are displayed in Figs. 3a-c. In the Young Gede Kawah Ratu rocks, 16 \ncompositions are more restricted in the basaltic andesites (An68-86) than in the andesites (An49-17 \n83, Figs. 3b and c, respectively), which display highly variable core, mid and rim anorthite 18 \ncontents. Plagioclase phenocrysts and groundmass An compositions in the basaltic andesites 19 \nof the Young Gede Other Vents group display an extremely restricted range and are 20 \nnoticeably higher than those in other GVC groups (above 81 mol% with the exception of one 21 \nrim sample, Fig. 3b), including the basalts from Pangrango (Fig. 3a). Plagioclase cores of the 22 \nandesites lie within the range of basaltic andesite plagioclase cores of the Young Gede Other 23 \nVents group. However, mid and rim compositions extend to significantly lower Anorthite 24 \ncontent (An44). Plagioclase compositions cover a relatively broad range in both the basaltic 25 \nandesite and andesites of Old Gede (Figs. 3b and c). Rim analyses of plagioclase in the 26 \nbasaltic andesites display a wide variation and extend to much higher An contents than 27 \ngroundmass analyses (An52-57, Fig. 3b). Plagioclase compositions in rocks from Gegerbentang 28 \nextend from moderate to high anorthite contents (An59-90) with a reasonably wide range in 29 \ncore and rim composition when compared with mid sections of phenocrysts (Fig. 3b). In the 30 \nOlder Quaternary group, compositions are reasonably An poor (47-63 mol%) and phenocryst 31 \ncores possess some of the lowest An contents (47-49 mol%) of GVC, with rim and mid 32 \nsections displaying generally higher An contents (52-63 and 47-60 mol% respectively, Fig. 33 \n3c). 34 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 8 \nCompositional variations in An content from the core to rim of individual plagioclase 1 \nphenocrysts are shown in Figs. 3d-f (open squares) and highlight reverse or normal zoning 2 \ntrends (see arrows Fig. 3d). The majority of GVC rocks display increases or decreases of ≤10 3 \nmol% An. All core- to rim variation amplitudes are within 20 mol% An, apart from the 4 \nYGOV andesite (Fig. 3f), where the difference between the core to rim is ~40 mol% An 5 \n(normal zoning). Reverse zoning trends showing greater than 10 mol% An variation between 6 \ncore and rim are only observed for the Older Quaternary andesite (Fig. 3f). The range in 7 \nplagioclase core compositions within each sample is relatively limited (~1-10 mol% An) 8 \nexcept for basaltic andesites of Old Gede and Gegerbentang and a YGKR andesite, which 9 \ndisplay variations between adjacent plagioclase cores of ~20-25 mol% An. 10 \n 11 \nClinopyroxene 12 \nClinopyroxene (augite) is the most abundant ferromagnesian mineral (by modal volume) in 13 \nGVC rocks, found in all samples accompanied by either olivine or orthopyroxene and very 14 \noccasionally both (indicating mineral disequilibrium in the latter case). Phenocrysts are 15 \ntypically subhedral to euhedral and most exhibit simple twining, although oscillatory zoning 16 \nis observed in some crystals. The phenocrysts display a broad range in size from 17 \nmicrophenocryst to ~1.2 cm. Large (0.5-1.2cm) phenocrysts are characteristic of the 18 \nPangrango basalts. Clinopyroxene phenocrysts of slightly smaller dimensions are featured in 19 \nthe volcanic products of Gegerbentang. Several clinopyroxene phenocrysts of the Young 20 \nGede Other Vent group contain anhedral glass inclusions, similar to those seen in plagioclase 21 \nphenocrysts of the same group. 22 \n Most of the eruptive groups display a fairly restricted range in clinopyroxene 23 \ncomposition (Figs. 4a-i). The basaltic andesites of the Young Gede Other Vent group display 24 \nthe greatest within-group variation (En38-45Wo38-45Fs12-20, Fig. 4c) and contrast with the 25 \nhighly restricted range in plagioclase composition observed in this group (Fig. 3b). The 26 \nPangrango basalts do not possess the most Ca-rich or Fe-poor clinopyroxene compositions, as 27 \nmight be expected in the least evolved (lowest SiO2) rocks analysed from GVC (Fig. 4f). 28 \nPigeonite (En55Wo25Fs20) was present in a 4 mm glomerocryst\/cumulate xenolith in an Older 29 \nQuaternary Volcanic group lava (Fig. 4i). 30 \n 31 \nOrthopyroxene 32 \nOrthopyroxene phenocrysts are less abundant than clinopyroxene in GVC rocks, and are 33 \ngenerally smaller in size. They are subhedral to euhedral, except when mantled by 34 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 9 \nclinopyroxene, where they are typically anhedral to subhedral. Mantling of orthopyroxene is 1 \ncommonly observed in GVC rocks, especially in some of the basaltic andesites and all of the 2 \nandesites of the Young Gede Kawah Ratu group. No obvious correlation is observed between 3 \nthe degree and type of plagioclase compositional zoning (and the magnitude of plagioclase 4 \ncore composition variability) and the presence or absence of mantled orthopyroxene (Fig. 3d-5 \nf). For example, samples with normally-zoned plagioclase showing only a small difference in 6 \nAn mol% between core to rim (YGKR basaltic andesite, Fig 3e) and samples characterised 7 \nby significant reversely-zoned plagioclase (Older Quaternary andesite, Fig 3f) both contain 8 \northopyroxene mantled by clinopyroxene. 9 \nThere is little distinction between orthopyroxene compositions in the basaltic 10 \nandesites and andesites within most eruptive series. Orthopyroxene enclosed within 11 \nclinopyroxene in the basaltic andesites of the Young Gede Kawah Ratu and Other Vents 12 \ngroups (Figs. 4a and c) lie among the higher Mg orthopyroxene compositions (En68 and En70 13 \nrespectively) of both groups (En62-69 and En64-71). Orthopyroxene mantled by clinopyroxene 14 \nin the basaltic andesites of Pangrango possess identical compositions to those not shrouded 15 \nby clinopyroxene (Fig. 4g). Orthopyroxene compositions in the Old Gede group (Figs. 4d and 16 \ne) are comparable to those measured in similarly evolved rocks of Young Gede (both 17 \ngroups). 18 \n 19 \nOlivine 20 \nOlivine displays a limited presence in GVC volcanic rocks, restricted to a small number of 21 \nbasalts and basaltic andesites. The anhedral and occasionally embayed olivine phenocrysts 22 \nare typically smaller than pyroxene and plagioclase phenocrysts within the same samples 23 \nfrom the Young Gede Other Vents group. In one sample from Old Gede (G07) olivine is the 24 \ndominant ferromagnesian phase (Supplementary Table 1) and occurs as large subhedral 25 \ncrystals. In other Old Gede samples olivine phenocrysts are small, anhedral and co-exist with 26 \northopyroxene. Olivine is a major component of the ferromagnesian mineral assemblage in 27 \nbasalts from Pangrango, constituting ~8-12 % of the modal volume.  Most crystals are small, 28 \ncommonly with rounded edges, and sometimes occur as inclusions within clinopyroxene. 29 \nOlivine is only observed in one sample from Gegerbentang, characterised by small anhedral 30 \nphenocrysts, some showing evidence of resorption. 31 \n Olivine compositions are displayed in Fig. 5. Forsterite (Fo) contents of olivines in 32 \nbasaltic andesites of the Young Gede Other Vent group (Fo70-72) are higher than Fo contents 33 \nin any other GVC group, consistent with the high (most primitive) An contents of plagioclase 34 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 10 \nphenocrysts (Fig. 3b) of this group. Fo contents of the Pangrango basalts are less magnesium-1 \nrich than those in the more evolved rocks of Young Gede. 2 \n 3 \nFe-Ti oxide 4 \nFe-Ti oxide (titanomagnetite) occurs as phenocrysts, inclusions within ferromagnesian 5 \nminerals (dominantly clinopyroxene) and as a groundmass phase in most GVC rocks. 6 \nTitanomagnetite is typically subhedral and constitutes a small percentage of the modal rock 7 \nvolume (~1-3%). Subhedral titanomagnetite phenocrysts are relatively more abundant in the 8 \nOlder Quaternary Volcanic group compared with the majority of GVC rocks (Supplementary 9 \nTable 1) and have higher than average Ti contents. Relatively high Ti contents are also 10 \nobserved in titanomagnetite phenocrysts in Pangrango lavas (Supplementary Table 6). 11 \n 12 \nXenoliths 13 \nXenoliths are generally uncommon in GVC rocks. Angular clasts of igneous material ~1mm 14 \nto 2cm in size are observed within the Young Gede Other Vents group, particularly within 15 \njuvenile scoria of pyroclastic flow deposits (e.g. G51, G01A). The most abundant type 16 \nconsists of large plagioclase and orthopyroxene phenocrysts, within a fine- to medium-17 \ngrained groundmass of plagioclase, orthopyroxene and oxide. The holocrystalline clasts, 18 \ndisplay sharp contacts with the host rock and can be removed relatively easily from the host 19 \nmatrix. 20 \nA different type of igneous xenolith, dominated by tabular plagioclase (with melt-21 \ninclusions), amphibole and elongate pyroxene was found in G18 (Old Gede). The amphibole 22 \nis heavily altered, especially at crystal edges where a thick rim of opaque oxide has formed. 23 \nThe contact between the host and the (0.5 x 0.8cm) xenolith is irregular and slightly diffuse.   24 \nA cumulate xenolith was found within Pangrango sample G16. The oval-shaped 25 \ncumulate is ~0.5cm in diameter and composed of relatively large, generally interlocking 26 \nplagioclase and pyroxene (orthopyroxene and minor clinopyroxene) crystals, with minor 27 \ninterstitial pyroxene. There is no obvious reaction rim at the contact between the cumulate 28 \nxenolith and the host lava. 29 \n 30 \nEstimation of pre-eruptive temperature and pressure conditions 31 \nPre-eruptive crystallisation temperatures and pressures were estimated using the two-32 \npyroxene approach detailed in Putirka (2008). A summary of the results and calculation 33 \nconditions are given in Table 1. Magmatic temperatures were calculated according to the 34 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 11 \nmethod of Brey and Köhler (1990) and Equation 36 of Putrika (2008). A significant number 1 \nof pyroxene pairs for many individual samples did not give acceptable equilibrium values 2 \n(KD(Fe-Mg)\n(cpx-opx)\n = 1.09 ± 0.14) and therefore these results were excluded. An indication of 3 \nthe percentage of „in equilibrium‟ two-pyroxene combinations of each sample is given in 4 \nTable 1. For three samples (G23, G51 and G49) none of the pyroxene pairs gave acceptable 5 \nKD(Fe-Mg)\n(cpx-opx)\n values. This may indicate the incorporation of antecrysts or xenocrysts by 6 \nthe magma or operation of magma mixing processes in these samples. G23 and G49 do in 7 \nfact display textural disequilibrium features (orthopyroxene mantled by clinopyroxene, Table 8 \n1) and G51 displays evidence of magma mingling (Fig. 6). For „in equilibrium‟ pyroxene 9 \npairs, temperatures lie between 891-1014ºC (Brey and Köhler, 1990) and 962-1046ºC 10 \n(Equation 36, Putrika, 2008). Two-pyroxene crystallisation pressures were calculated using 11 \nEquation 39 of Putrika (2008) and gave pressures between 3.4-6.5 kbar, equating to depths 12 \nbelow the volcano of ~13-24 km. There are no significant differences in pre-eruptive pressure 13 \nconditions between geographic groups. However, the most recent eruptives (Young Gede 14 \nKawah Ratu) give the widest range in crystallisation depth (~10km). 15 \n 16 \nMagma mingling 17 \nSeveral juvenile scoria samples from pyroclastic flow deposit units of Young Gede (Kawah 18 \nRatu and Other Vents) and Old Gede show evidence for the mingling of distinct magmas. 19 \nThe vesicular juvenile scoria is composed of dark grey\/black material with irregularly shaped 20 \nlenses or bands of lighter, pale-grey material. The majority of juvenile scoria from Young 21 \nGede are composed of the dark component (Fig. 6a, G36B & G51), while the samples from 22 \nOld Gede are variably banded with more equal shares of both light and dark layers (Fig. 6c, 23 \nG13). The dark bands contain phenocrysts of sub- to euhedral plagioclase, clinopyroxene and 24 \ntitanomagnetite and anhedral to subhedral olivine. The lighter layers contain the same 25 \nmineral assemblage but with orthopyroxene substituted for olivine. Both layers display 26 \nporphyritic textures (Fig. 6e) and oscillatory zoning and sieve textures in plagioclase 27 \nphenocrysts. The contact between the two layers is always irregular in detail (Fig. 6e) and 28 \nranges from sharp to diffuse, indicating that mixing may have occurred in some samples. The 29 \nYoung Gede juvenile scoria (G36B and G51) possess small, angular xenolith clasts 30 \n(described above), which display sharp contacts with the host rock. 31 \nCompositions of plagioclase and pyroxene phenocrysts in the light and dark layers of 32 \nsample G51 are plotted in Fig. 6b. Anorthite contents of plagioclase in the dark layer are high 33 \nand restricted between An80-90. Plagioclase compositions in the light layer of G51 overlap 34 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 12 \nwith those in the dark layer in the core (An80-90) but mid and rim sections extend to much 1 \nlower An contents (~An45). Clinopyroxene compositions in the light layer of G51 (Fig. 6b) 2 \nare relatively Fe-rich compared to those measured in the dark layer with the exception of one 3 \nphenocryst, which plots between the light layer data points. Plagioclase core compositions in 4 \nG11 (a dark juvenile scoria sample from the same locality as G13) display high (An80) and 5 \nlow (An60) An core contents, with comparably high and low An content in the respective rims 6 \n(Fig. 6d). 7 \n 8 \nMajor element data 9 \nMajor element data are given in Table 2 and presented in Fig. 7. GVC rocks possess 10 \nintermediate silica contents (~51-63 wt %). Low MgO contents in the basalts (~4-5 wt %) 11 \nsuggest that these samples are fractionated and do not represent primary basalts. Major 12 \nelement trends are similar for most of the Gede Complex groups (Figs. 7a-h); negative 13 \ncorrelations against silica are displayed for Fe2O3, MgO, CaO and TiO2, and positive 14 \ncorrelations are generally observed for K2O and Na2O. The data show considerable scatter for 15 \nAl2O3 and P2O5 versus SiO2. Volcanic rocks of Young Gede (both groups) display the 16 \ngreatest range in silica content (52-62 wt %). The Young Gede Other Vents group cluster at 17 \n~55 wt % SiO2 and display relatively poor correlations of major elements with SiO2. The 18 \nPangrango lavas are among the least evolved samples collected from the complex and 19 \npossess the highest TiO2 contents, up to ~1.2 wt % (Fig. 7g). Eruptives of Gegerbentang 20 \ncluster towards the lower silica end of the GVC array and possess slighter higher P2O5 21 \ncontent compared to other GVC rocks of comparable silica content (Fig. 7h). 22 \n 23 \nTrace element geochemistry 24 \nVariations of selected trace elements with SiO2 are presented in Fig. 8. GVC rocks display 25 \nincreases with increasing silica of most LILE (e.g. Ba (Fig. 8a), Rb and here including Th and 26 \nU), LREE (e.g. La, Fig. 8b) and some HFSE (Zr and Hf, not shown). Nb exhibits a very poor 27 \npositive correlation (Fig. 8d). Elements that behave compatibly in most arc magmas, such as 28 \nvanadium and nickel display reasonable (Fig. 8e) to poor (Fig. 8c) negative correlations with 29 \nSiO2 in GVC rocks. Ni contents are extremely low (~1-17ppm) in GVC rocks and further 30 \nconfirm their highly fractionated character. Y, Yb, Sr, Pb and Eu data display considerable 31 \nscatter and remain essentially constant over the range in silica content (e.g. Figs. 8f-h). There 32 \nis little distinction in trace element variations of the separate eruptive groups. 33 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 13 \n 1 \nSr isotope data 2 \nWhole-rock Sr isotope data are listed in Table 3 and displayed in Figs. 2, 9a and 10.\n 87\nSr\/\n86\nSr 3 \nisotope ratios of volcanic rocks from the Gede Volcanic Complex span a fairly wide range 4 \n(0.704508-0.705540) compared to other Javan volcanoes (e.g. Ijen Volcanic Complex in East 5 \nJava, Handley et al. 2007). The Older Quaternary samples possess the most primitive Sr 6 \nisotope ratios, while Pangrango volcanic rocks possess the highest \n87\nSr\/\n86\nSr ratios of GVC. Sr 7 \nisotope ratios of rocks from Young and Old Gede and Gegerbentang generally overlap and 8 \nform a sub-horizontal array between Pangrango and the Older Quaternary volcanic rocks 9 \n(Fig. 9a). The Young Gede Other Vent samples display a broad range in Sr isotope ratios 10 \nover a fairly small range (~2%) in silica. Within-group Sr isotope ratios do not display 11 \nsignificant correlation with indices of differentiation; however the complex as a whole 12 \ndisplays a slight negative correlation with SiO2 (Fig. 9a). Although it is beyond the scope of 13 \nthis paper, it is important to note that based on Ba\/La and Zr\/Nb ratios versus Sr isotope data 14 \n(Figs. 2a and b), the two oldest volcanic groups, Gegerbentang and the Older Quaternary 15 \nVolcanics are derived from a magma source of different geochemical composition to the 16 \nother volcanic groups of GVC. 17 \n 18 \nOxygen isotope data 19 \nOxygen isotope data are listed in Table 4 and displayed in Figs. 9b and 10. Mineral separates 20 \nof olivine, clinopyroxene and plagioclase from GVC lavas possess relatively restricted 18O 21 \nvalues ranging from +5.32 to +5.42 ‰ (n = 3), +5.52 to +5.94‰ (n = 12) and +6.07‰ (n = 22 \n1), respectively. The majority of the GVC data lie within error (2SD) of 18O values 23 \nmeasured in mantle olivine (+5.18 ±0.28‰, n = 76) and clinopyroxene (+5.57 ±0.32‰, n = 24 \n57) (Mattey et al. 1994; Ionov et al. 1994, Fig. 10a). Differences in 18O values between 25 \ncoexisting clinopyroxene and olivine (cpx-ol) and plagioclase and clinopyroxeneplag-cpx) at 26 \nGVC are 0.30-0.44‰ and 0.44‰, respectively, suggesting isotopic equilibrium at typical 27 \nmagmatic temperatures for andesite liquids. (Macpherson and Mattey 1998; Macpherson et 28 \nal. 1998). 18O values from the GVC are slightly higher than 18O clinopyroxene values 29 \nreported for Galunggung and Salak (Harmon and Gerbe 1992; Handley et al. 2008a) in West 30 \nJava and Ijen Volcanic Complex in East Java (Handley et al. 2007, Fig. 10) but lie within the 31 \nrange of both clinopyroxene (+5.18 to +7.04‰) and olivine (+4.92 to +5.59‰) 18O values 32 \nreported for the Banda arc (Vroon et al. 2001). 18O values do not appear to show significant 33 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 14 \ndistinctions between different eruptive centres (Figs. 9b and 10) and do not correlate with 1 \nindices of differentiation (Fig. 9b). 2 \n 3 \nDiscussion  4 \nDifferentiation of magma 5 \nFractional crystallisation 6 \nThe predominance of basaltic andesites, low MgO and extremely low Ni contents in basalts 7 \nof the GVC indicate that the lavas erupted are significantly fractionated. To quantitatively test 8 \nwhether fractional crystallisation of the mineral assemblage observed in GVC rocks is 9 \naccountable for the major element variations observed (Fig. 7), least squares modelling was 10 \nemployed. Because GVC includes several large volcanic centres, the aims of modelling are 2 11 \nfold: 1) To determine whether fractional crystallisation can explain major element variation 12 \nwithin each eruptive series. 2) To establish whether the eruptive series of Gede volcano 13 \n(Young Gede Kawah Ratu, Young Gede Other Vents and Old Gede) may be genetically 14 \nrelated by the process of fractional crystallisation. 15 \nLeast squares modelling of GVC major element data utilises the XLFRAC 16 \nprogramme of Stormer and Nicholls (1978). Summaries of least squares modelling results are 17 \ngiven in Table 5. Fractional crystallisation models from the least evolved (lowest SiO2) to the 18 \nmost evolved (highest SiO2) rocks within each eruptive group yield good to excellent results, 19 \nwith r2 values less than or equal to 0.1 (models 1-11, Table 5). These models suggest that 20 \nwithin-group major element variation can be explained by the fractional crystallisation of 21 \nplagioclase, clinopyroxene, Fe-Ti oxide, plus olivine or orthopyroxene from the most basic 22 \nend-members within each eruptive group with a maximum degree of crystallisation of 50% 23 \n(model 10). However, from the basic to evolved members of the Young Gede Other Vents 24 \ngroup models requires the addition of 8.6% plagioclase during fractionation of 25 \nclinopyroxene, orthopyroxene and oxide. 26 \n The second objective of least squares modelling is to see if major element variation 27 \nbetween Gede volcano sub-units may be explained through crystal fractionation. Models 12-28 \n14 show that excellent r2 values of <0.06 are obtained, especially in models using the most 29 \nbasic Old Gede sample as parent to the most evolved Young Gede Kawah Ratu and Other 30 \nCentre lavas (models 12 and 13, r2 = 0.03). However, both of these models require the 31 \naddition, rather than removal, of a small percentage of clinopyroxene. Using the mineral 32 \nphase proportions given by model 10 (Table 5), fractionation curves from the least evolved 33 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 15 \n(lowest SiO2) Young Gede Kawah Ratu sample (G23) have been calculated and are plotted 1 \non Fig. 7 (FC G23). In most cases, excluding TiO2 (Fig. 7g), the model curves fit the Young 2 \nGede Kawah Ratu and general GVC array well, acknowledging data scatter in Al2O3 and 3 \nP2O5 versus SiO2. 4 \nTo test the conclusions of least squares analysis and investigate whether the 5 \nconcentrations of trace elements in GVC rocks are controlled by fractional crystallisation of 6 \nthe same mineral assemblage, forward modelling of trace element concentrations was 7 \nconducted using the Rayleigh fractionation equation: Cl = CoF\n(D-1)\n, where Cl and Co represent 8 \nthe concentration of an element in the daughter and parental liquids respectively, F is the 9 \nfraction of liquid remaining and D is the bulk distribution coefficient. The results and model 10 \nparameters are given in Fig. 8. The fractionation curves produced (FC G23) show variable 11 \nsuccess in fitting the array of the GVC data. The best fits are observed for the incompatible 12 \nelements Ba and La (e.g. Figs. 8a and b) and Nb (Fig. 8d). Acceptable results are noted for V. 13 \nHowever, poor fits are observed for other elements. This is largely a consequence of the 14 \nscatter in the data in Figs. 8c and f-h. 15 \nSeveral models have proposed that the geochemical diversity exhibited by arc lavas is 16 \ncontrolled by crystallisation in the mid- to lower crust and that phenocryst textural 17 \ncomplexity is subsequently acquired in the upper crust (e.g. Hildreth and Moorbath 1988; 18 \nAnnen et al. 2006). Based on REE ratios, amphibole fractionation at depth (mid- to lower 19 \ncrust) is thought to exert major control on magmatic differentiation in arc volcanoes and at 20 \nGVC (Davidson et al. 2007). Mid- to lower crustal crystallisation pressures calculated for 21 \nGVC pyroxenes (Table 1) and the presence of an amphibole-bearing xenolith in an Old Gede 22 \nlava (G18) give support for amphibole-involved fractionation at depth beneath the GVC. 23 \nRecent work by Brophy (2008) suggests that mid- to upper crustal hornblende-bearing basalt 24 \nfractionation will produce steadily increasing LREE abundances but constant and then 25 \ndecreasing HREE abundances, like those observed for GVC lavas in Figs. 8b and 8h. To 26 \ninvestigate whether fractionation of amphibole better explains the major and trace element 27 \ncharacteristics of GVC rocks, fractionation trends for amphibole (FC Amph) are plotted in 28 \nFigs. 7 and 8. Overall, magmatic evolution by amphibole fractionation is no more acceptable 29 \nfor reproducing major (e.g. Figs. 7d, e and g) and trace element trends (Fig. 8) than the 30 \nfractionating phase assemblage observed in the rocks (FC G23). For some elements, the GVC 31 \ndata lie between fractionation curves for amphibole and the observed mineral assemblage in 32 \nthe rock, suggesting that the data may be explained by a combination of both processes (e.g. 33 \nFigs. 7a, c and g, and 8f and h). 34 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 16 \n 1 \nMagma mixing  2 \nMagma mixing is important in the evolution of many arc magmas (e.g. Eichelberger et al. 3 \n2000; Tepley et al. 2000) and in magmatic evolution at volcanoes of the Sunda arc (Slamet, 4 \nReubi et al., 2003; Batur, Reubi and Nicholls 2004; Krakatau, Mandeville et al. 1996; 5 \nMerapi, Camus et al. 2000). Mingled scoria in volcanic rocks of Young Gede and Old Gede 6 \nprovide unequivocal evidence for the interaction of distinct magmas at GVC (Fig. 6). The 7 \nquestion then arises whether or not magma mixing imparts a recognisable influence or 8 \ncontrol on element concentrations? Petrographic features in GVC rocks such as reverse 9 \nzoning, sieve textured and resorbed cores in plagioclase phenocrysts, variation in coexisting 10 \nplagioclase core compositions, mantling of orthopyroxene by clinopyroxene and 11 \njuxtaposition of olivine with orthopyroxene indicate that closed-system crystal fractionation 12 \nmay be an over-simplistic model for magmatic evolution at GVC. Furthermore, least squares 13 \nmodelling of major element data required the addition of plagioclase or clinopyroxene in 14 \nsome models (Table 5). However, minor zoning and resorption features in plagioclase are not 15 \nstrict evidence for magma mixing, such textures are likely to result from changes in P, T, and 16 \nPH2O (e.g. Pearce and Kolisnik, 1990; Ginibre et al. 2002 and references therein). Similarly, 17 \nsieve-textured plagioclase are commonly interpreted to be produced by magma mixing but 18 \nexperimental data have shown that these textures can also be produced by decompression or 19 \nheating (Nelson and Montana 1992; Johannes et al. 1994). In most GVC rocks, the amplitude 20 \nof An mol% variation observed in: 1) plagioclase cores of the same rock and, 2) reversely 21 \nzoned plagioclase is small (within 20 mol% An, Fig. 3), obviating the necessity of magma 22 \nmixing. Mantling of orthopyroxene by clinopyroxene in GVC rocks may result from an 23 \nincrease in temperature due to the influx of more primitive magma, but can also be created by 24 \nconvective self-mixing (Couch et al. 2001). Alternatively, mantled orthopyroxene may be 25 \nantecrystic and entrained by the magma during transit to the surface. The Mg content of 26 \nmantled orthopyroxenes in basaltic andesites of Young Gede lie among the highest Mg 27 \northopyroxene compositions observed in the rocks (Figs. 4a and c). 28 \nTo help assess the extent to which magma mixing can account for the geochemical 29 \ndiversity of the lavas, an example mixing line (MM) is plotted on Figs. 7 and 8, between the 30 \nleast- and most evolved Young Gede Kawah Ratu rocks (G23-G39). Rocks of this group 31 \nwere chosen as they show the greatest textural complexity. For major elements (except TiO2 32 \nand P2O5, Figs. 7g and h) and some trace elements (those showing incompatible behaviour 33 \nduring differentiation) the magma mixing (MM) and fractional crystallisation trends (FC 34 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 17 \nG23) are extremely similar, and indistinguishable from each other in some cases (Figs. 7f and 1 \n8b). The horizontal magma mixing trend produced for Ni versus SiO2 (Fig. 8c) can account 2 \nfor the constant Ni content observed over a range in SiO2 (cf. the fractionation trend). 3 \nHowever, the mixing line itself does not provide a reasonable fit to the rest of the Kawah 4 \nRatu data or GVC data as a whole. 5 \nIn plots of the form A\/B versus 1\/B, mixing is controlled by the concentration of the 6 \ndenominator in the ratio. Consequently, plots of this type provide a simple check to see if 7 \ndata are consistent with binary mixing as data should form a linear array (Vogel 1982; 8 \nLangmuir et al. 1978). La and Nd concentrations increase with differentiation in GVC rocks 9 \n(e.g. Fig. 8b) and so a plot of La\/Nd versus 1\/Nd should indicate whether or not the 10 \nsystematic variation with SiO2 is consistent with mixing. Fig. 11a shows poor linearity within 11 \neach eruptive group and within the GVC data as a whole and is, therefore, inconsistent with 12 \nsimple mixing processes. The solid lines labelled 1, 2 and 3 in Fig. 11a show several mixing 13 \ntrends between members of the same stratigraphical group (see figure caption for details) to 14 \ngive examples of potential mixing lines. The relatively evolved compositions of both the light 15 \nand dark components in banded juvenile scoria of Old Gede (57 wt% and 59 wt% SiO2, 16 \nrespectively) also suggest that simple binary mixing, at least of these components, is an 17 \nunrealistic model for explaining the geochemical variation observed within this group 18 \n(mixing line 3, Fig. 11a). Furthermore, distinct plagioclase core compositions (Fig 6) are 19 \nobserved in similar sized phenocrysts within the dark, more basic component (G11) of the 20 \nmingled rocks, indicating that the parental magma to the basic lava may have experienced 21 \nmingling and mixing with other magma prior to the clear evidence for magma mingling 22 \nobserved in G13. Fractional crystallisation trends FC23 and FC20 (see figure caption for 23 \ndetails) and amphibole fractionation (FC Amph) are also incapable of accounting for the 24 \ngeneral data array (Fig. 11a). Thus neither fractional crystallisation nor mixing alone is 25 \ncapable of explaining the chemical evolution of GVC magma. 26 \nTo investigate the relationship between geochemistry and petrological complexity 27 \nGVC samples are classified according to their petrological features e.g. presence of xenoliths, 28 \nmantled orthopyroxene, magma mingling and coexistence of olivine and orthopyroxene in 29 \nFigs. 11b (La\/Nd versus 1\/Nd) and c (Ni versus SiO2). Ni versus SiO2 was chosen for its 30 \npotential to identify samples with the most evidence for mixing (i.e. similar Ni content over a 31 \nwide range in SiO2) from those controlled by fractional crystallisation. Both figures show that 32 \nthere is no obvious link between indicators of petrological complexity\/disequilibrium and 33 \nwhole-rock geochemical data in GVC lavas and juvenile scoria. 34 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 18 \nIn summary, the scatter in major and trace element data preclude control via simple 1 \nmixing processes. However, multiple magma mixing and mingling events may play a role in 2 \nmodifying the chemical composition of magma during magmatic evolution. Geochemical 3 \nevolution most likely reflects a combination of fractional crystallisation (of amphibole at 4 \ndepth and the mineral assemblage observed in the rocks) and magma mixing processes, 5 \nwhere multiple fractionation trends and mixing end-members are required. 6 \n 7 \nCrustal contamination 8 \nThere is substantial evidence from island arc volcanoes (Thirlwall and Graham 1984; 9 \nDavidson et al. 1987; Ellam and Harmon 1990; Thirlwall et al. 1996; Macpherson et al. 1998; 10 \nHandley et al. 2008b) for the contamination of primary magmas by arc crust. Contamination 11 \nis also thought to be an important process in the western Sunda arc (Gasparon et al. 1994; 12 \nGasparon and Varne 1998; Chadwick et al. 2007) and responsible for modifying isotope 13 \nratios of lavas at Sangeang Api volcano in the eastern Sunda arc (Turner et al. 2003). 14 \nThe incorporation of crustal material during crustal differentiation may generate 15 \ncorrelations of isotope ratios with indices of differentiation (e.g. SiO2, Rb) in volcanic rock 16 \ndata (e.g. Davidson et al. 2005). However, this assumes that the contaminant will have an 17 \nisotopic composition distinct from that of magmas ascending from the mantle. Relatively 18 \nlittle is known about the composition of the arc crust in West Java. It is hypothesised that 19 \nWest Java is built upon pre-Tertiary, continental-type basement (Hutchinson 1989; Metcalfe 20 \n1996; Soeria-Atmadja et al. 1998; Hoffmann-Rothe et al. 2001). Hamilton (1979) suggests 21 \nthat the crust in West Java may consist of relatively immature continental crust, ophiolite 22 \nslivers and older volcanic rocks. Crustal contamination involving these materials may be 23 \ndifficult to detect. Meta-sedimentary\/continental-type crustal xenoliths have not been 24 \ndiscovered in any GVC units (only clasts of igneous origin are observed) further highlighting 25 \nthe difficulty of identifying „crustal‟ contributions in arc lavas. The relatively wide range in 26 \nSr isotope ratios of volcanic rocks from the GVC could be the result of the assimilation of arc 27 \ncrust. However, there are no clear correlations between Sr and O isotope ratios and SiO2 28 \nwithin the individual eruptive groups (Fig. 9). There is a slight correlation in the data set as a 29 \nwhole, with the most evolved samples (Older Quaternary) possessing the most primitive 30 \nradiogenic isotope compositions and the least evolved rocks (Pangrango) display the least 31 \nprimitive Sr isotopic compositions (Fig. 9a). The weak correlation observed is the reverse 32 \ntrend of that expected by the assimilation of continental-type crust during fractional 33 \ncrystallisation (AFC, DePaolo 1981), which typically generates positive correlations between 34 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 19 \n87\nSr\/\n86\nSr ratios and SiO2, e.g. Lesser Antilles (Davidson 1987). It is similar however, to the 1 \ntrend observed in Alicudi lavas in Italy (Peccerillo et al. 2004) where the most mafic magmas 2 \ndisplay the most „contaminated‟ isotope signatures. The authors suggest that the higher 3 \ntemperature and lower viscosity of the basalts enables assimilation of a greater volume of 4 \ncrust (relative to the more evolved magmas). The isotopic variation observed at GVC may 5 \nalso be the result of isotopic heterogeneity of the source. To help address the issue of crustal 6 \nversus source contamination 18O and 87Sr\/86Sr isotope data can be utilised. 7 \n A large contrast exists between the low 18O values of the mantle (+5.57  0.32‰, 8 \nMattey et al. 1994; Ionov et al. 1994) and the generally high and variable 18O values (often 9 \n> +10‰, Davidson and Harmon 1989) of upper crustal materials, due to low temperature 10 \ninteraction with H2O in the latter. Therefore, the combination of oxygen and radiogenic 11 \nisotope ratios (e.g. \n87\nSr\/\n86\nSr) can help diagnose involvement of the crust in magma genesis 12 \n(James 1981; Davidson et al. 2005). The inset diagram of Fig. 10b shows the different 13 \ncurvatures expected for crustal contamination (mixing crust with basalt during magma 14 \nevolution) and source contamination (mixing sediment into a mantle source prior to 15 \nproduction of primary basalt, Davidson et al. 2005) that result from the significant difference 16 \nin Sr\/O ratios of mantle and mantle-derived basalt. The GVC data are displaced from mantle 17 \nvalues towards higher \n87\nSr\/\n86\nSr isotope ratios, but clinopyroxene 18O values of GVC lavas 18 \nare relatively homogeneous (+5.52 to +5.94‰) and low, lying in the region of mantle values 19 \n(Fig. 10a). In Fig. 10b the GVC data generally lie along a mixing curve representing 20 \ncontamination of the mantle source by a high 18O, high 87Sr\/86Sr component, in this case 21 \nsediment (see figure caption for end member compositions). It is therefore unlikely that the 22 \nlavas have been contaminated by young or old continental-type material. Ophiolitic material, 23 \ni.e. oceanic crust, displays a wide range in oxygen isotope ratios due to interaction between 24 \nbasaltic rocks and seawater over a wide range of temperatures (Muehlenbachs 1986). 25 \nTherefore, if interaction with oceanic basement had been a significant process at GVC we 26 \nmay predict greater scatter in 18O values than observed. Similarly, a wide range of oxygen 27 \nisotope ratios may develop in the mafic to intermediate edifices and roots of Sunda arc 28 \nmagmatism that pre-dates GVC. 29 \n  In summary, mantle-like clinopyroxene 18O values of GVC lavas suggest negligible 30 \ninput of high 18O crustal rocks during differentiation. Most variation in Sr isotope ratios of 31 \nGVC lavas is therefore proposed to arise from variations in source compositions\/components. 32 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 20 \nThis conclusion is similar to those reached in studies of other Sunda arc volcanoes (Gerbe et 1 \nal. 1992; Elburg et al. 2002). 2 \n 3 \nSummary and conclusion  4 \nWhole-rock major and trace element compositions within each eruptive series at GVC are the 5 \nresult of a complex interplay of fractional crystallisation (at variable degrees and depths) and 6 \ninferred multiple-mixing events. Mid- to heavy-REE data and an amphibole-bearing xenolith 7 \nprovide support for significant magmatic differentiation in the mid- to lower crust via 8 \nfractional crystallisation involving amphibole. Coexisting pyroxene pairs estimate that 9 \nfractionation takes place at temperatures of 891-1046ºC and pressures of 3.4-6.5 kbar, 10 \nequivalent to ~13-24km depth beneath the volcanoes. Fractional crystallisation of the mineral 11 \nassemblage observed in the rocks (plagioclase + clinopyroxene + titanomagnetite ± olivine ± 12 \northopyroxene) can largely account for the geochemical variation observed at GVC and most 13 \nlikely plays a role in modifying the composition (to differing degrees) of each magma batch. 14 \nWhole-rock geochemical data are inconsistent with simple (binary) magma mixing processes. 15 \nHowever, multiple mixing events cannot be excluded and may explain the significant scatter 16 \nobserved in variation diagrams. 17 \n The degree of petrological complexity in GVC volcanic rocks is highly variable 18 \nwithin and between each eruptive group, indicative of complex magmatic histories. No 19 \nsimple correlation is observed between disequilibrium features in GVC rocks, such as the 20 \ndegree and type of plagioclase compositional zoning (and the magnitude of plagioclase core 21 \ncomposition variability) and the presence or absence of clinopyroxene overgrowths on 22 \northopyroxene. The relatively small changes in mol% An observed in compositional zoning 23 \nof plagioclase phenocrysts in GVC rocks may be caused by changes in P, T, and PH2O in the 24 \nupper crustal magmatic system rather than changes in melt composition. However, banded 25 \njuvenile scoria provide strong evidence for the (late-stage) interaction of distinct magmas at 26 \nGede volcano (Young and Old Gede groups) and suggest that magma „mixing‟ may be an 27 \nimportant eruption-triggering mechanism. The relationship between petrological and 28 \ngeochemical evidence for mixing is not straightforward at GVC. No obvious link is noted 29 \nbetween indicators of petrological complexity\/disequilibrium (e.g. presence of xenoliths, 30 \nmantled orthopyroxene, magma mingling and coexistence of olivine and orthopyroxene) and 31 \nwhole-rock geochemical data. For a greater understanding of textural and chemical 32 \nrelationships in GVC volcanic rocks, and to place better constraints on the importance of 33 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 21 \nmixing processes for magmatic evolution, further study would benefit from high-resolution 1 \nmajor- and trace-element mineral profiling, backscattered electron imaging (e.g. Ginibre et al. 2 \n2002) and fine-scale Sr isotope plagioclase profiling (e.g. Davidson and Tepley 1997). 3 \nLow, mantle-like clinopyroxene 18O values of GVC lavas suggest negligible input of 4 \nhigh 18O crustal materials during magmatic differentiation. Poor correlation of Sr isotope 5 \nratios with indices of differentiation of GVC rocks precludes significant assimilation of 6 \nmature continental-type crust with magma beneath the complex. This contrasts with 7 \nconclusions reached by Gasparon et al. (1994) who proposed that the upper-crust is the 8 \ndominant source responsible for the „crustal‟ geochemical and isotopic signatures observed in 9 \nwestern Sunda arc lavas. This implies that the relatively thick (compared to East Java) West 10 \nJavan arc crust is relatively immature and any deep-seated (shallow contamination is not 11 \nconsistent with O-isotope data) crustal contamination evades detection probably due to the 12 \nsimilar geochemical characteristics shared by the crust and ascending magma. These 13 \nconclusions are consistent with the geochemical characteristics of the crustal contaminant 14 \nacting in AFC at neighbouring Salak (Handley et al. 2008a). However, this does not truly rule 15 \nout the possibility that continental-type material constitutes part of the crust beneath all of 16 \nWest Java, just that it is not required to explain the geochemical variation observed in GVC 17 \nlavas and volcanic rocks of other West Javan arc-front volcanoes. Instead, stable and 18 \nradiogenic isotopes indicate that „crustal‟ geochemical and isotopic characteristics arise in 19 \nGVC rocks as a result of contamination of the mantle source. Mantle wedge contamination is 20 \nalso proposed in studies of other Sunda arc volcanoes (Gerbe et al. 1992; Elburg et al. 2002; 21 \nGertisser and Keller 2003; Handley et al. 2007). Based on correlations of trace element ratios 22 \nwith strontium isotopes the magmatic source composition of the older geographical units, 23 \nGegerbentang and Older Quaternary, is distinct from the younger eruptives of Pangrango and 24 \nGede volcanoes. 25 \n 26 \nAcknowledgements 27 \nWe thank Akhmad Zaennudin and his colleagues at the Volcanic Survey of Indonesia in 28 \nBandung for the invaluable logistical help and guidance in the field. For technical support 29 \nand analytical assistance our thanks go to: Geoff Nowell, Chris Ottley and Dave Sales at 30 \nDurham University; Dave Plant at the University of Manchester; Dave Lowry at Royal 31 \nHolloway University of London; Godfrey Fitton and Dodie James at the University of 32 \nEdinburgh. The manuscript was significantly improved by the detailed editorial comments of 33 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 22 \nT. Grove and two anonymous reviewers. This project was funded by a Natural Environment 1 \nResearch Council studentship (NER\/S\/A\/2001\/06127) and supported by the SE Asia 2 \nResearch Group at Royal Holloway, University of London. 3 \n 4 \nReferences 5 \nAnnen C, Blundy JD, Sparks RSJ (2006) The genesis of intermediate and silicic magmas in 6 \ndeep crustal hot zones. J Petrol 47:505-539. 7 \nBottazzi P, Tiepolo M, Vanucci R, Zanetti A, Brumm R, Foley SF, Oberti R (1999) Distinct 8 \nsite preferences for heavy and light REE in amphibole and the prediction of 9 \nAmph\/LDREE. Contrib Mineral Petrol 137:36-45. 10 \nBrey GP, Köhler T (1990) Geothermobarometry in four-phase lherzolites II. New 11 \nthermobarometers, and practical assessment of existing thermobarometers. J Petrol 12 \n31:1353-1378. 13 \nBrophy JG (2008) A study of rare earth element (REE)-SiO2 variations in felsic liquids 14 \ngenerated by basalt fractionation and amphibolite melting: a potential test for 15 \ndiscriminating between the two different processes. Contrib Mineral Petrol 156:337-16 \n357. 17 \nCamus G, Gourgaud A, Mossand-Berthommier P, Vincent PM (2000) Merapi (Central Java, 18 \nIndonesia): an outline of the structural and magmatological evolution with a special 19 \nemphasis to the major pyroclastic events. J Volcanol Geotherm Res 100:139-163. 20 \nChadwick JP, Troll VR, Ginibre C, Morgan D, Gertisser R, Waight TE, Davidson JP (2007) 21 \nCarbonate Assimilation at Merapi Volcano, Java, Indonesia: Insights from Crystal 22 \nIsotope Stratigraphy. J Petrol 48:1793-1812. 23 \nCouch S, Sparks RSJ, Carroll MR (2001) Mineral disequilibrium in lavas explained by 24 \nconvective self-mixing in open magma chambers. Nature 411:1037-1039. 25 \nDavidson JP (1987) Crustal contamination versus subduction zone enrichment: Examples 26 \nfrom the Lesser Antilles and implications for mantle source compositions of island arc 27 \nvolcanic rocks. Geochim Cosmochim Acta 51:2185-2198. 28 \nDavidson JP, Dungan MA, Ferguson KM, Colucci MT (1987) Crust-magma interactions and 29 \nthe evolution of arc magmas: The San Pedro-Pellado volcanic complex, southern 30 \nChilean Andes. Geology 15:443-446. 31 \nDavidson JP, Hora JM, Garrison JM, Dungan MA (2005) Crustal forensics in arc magmas. J 32 \nVolcanol Geotherm Res 140:157-170. 33 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 23 \nDavidson JP, Harmon RS (1989) Oxygen isotope constraints on the petrogenesis of volcanic 1 \narc magmas from Martinique, Lesser Antilles. Earth Planet Sci Lett 95:255-270. 2 \nDavidson JP, Tepley III FJ (1997) Recharge in volcanic systems; evidence from isotope 3 \nprofiles of phenocrysts. Science 275:826-829. 4 \nDavidson J, Turner S, Handley H, Macpherson C, Dosseto A (2007) Amphibole “sponge” in 5 \narc crust? Geology 35:787-790. 6 \nDePaolo DJ (1981) Trace element and isotopic effects of combined wallrock assimilation and 7 \nfractional crystallization. Earth Planet Sci Lett 53:189-202. 8 \nDowall DP, Nowell GM, Pearson DG (2003) Chemical pre-concentration procedures for 9 \nhigh-precision analysis of Hf-Nd-Sr isotopes in geological materials by plasma 10 \nionisation multi-collector mass spectrometry (PIMMS) techniques. Plasma Source Mass 11 \nSpectrometry. Spec Pub Royal Society of Chemistry 321-337. 12 \nEdwards CMH (1990) Petrogenesis of tholeiitic, calc-alkaline and alkaline volcanic rocks, 13 \nSunda arc, Indonesia. PhD Thesis, Royal Holloway, University of London. 14 \nEffendi AC, Kusnama, Hermanto B (1998) Geological map of the Bogor quadrangle, Java. 15 \nVolcanological Survey of Indonesia. 16 \nEichelberger JC, Chertkoff DG, Dreher ST, Nye CJ (2000) Magmas in collision: Rethinking 17 \nchemical zonation in silicic magmas. Geology 28:603-606. 18 \nElburg M, van Bergen M, Hoogewerff J, Foden J, Vroon P, Zulkarnain I, Nasution A (2002) 19 \nGeochemical trends across an arc-continent collision zone: magma sources and slab-20 \nwedge transfer processes below the Pantar Strait volcanoes, Indonesia. Geochim 21 \nCosmochim Acta 66:2771-2789. 22 \nEllam RM, Harmon RS (1990) Oxygen isotope constraints on the crustal contribution to the 23 \nsubduction-related magmatism of the Aeolian Islands, southern Italy. J Volcanol 24 \nGeotherm Res 44:105-122. 25 \nEwart A (1982) The mineralogy and petrology of Tertiary-Recent orogenic volcanic rocks: 26 \nwith special reference to the andesitic-basaltic compositional range. In: Thorpe RS (Ed.) 27 \nAndesites: Orogenic Andesites and Related Rocks. Wiley, Chichester 525-548. 28 \nFoden JD (1983) The petrology of the calcalkaline lavas of Rindjani volcano, East Sunda arc: 29 \na model for island arc petrogenesis. J Petrol. 24:98-130. 30 \nGamble JA, Wood CP, Price RC, Smith IEM, Stewart RB, Waight T (1999) A fifty year 31 \nperspective of magmatic evolution on Ruapehu Volcano, New Zealand: verification of 32 \nopen system behaviour in an arc volcano. Earth Planet Sci Lett 170:301-314. 33 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 24 \nGasparon M, Hilton DR, Varne R (1994) Crustal contamination processes traced by helium 1 \nisotopes: Examples from the Sunda arc, Indonesia. Earth Planet Sci Lett 126:15-22. 2 \nGasparon M, Varne R (1998) Crustal assimilation versus subducted sediment input in west 3 \nSunda arc volcanics: an evaluation. Mineral Petrol 64:89-117. 4 \nGerbe M-C, Gouraud A, Sigmarsson O, Harmon RS, Joron J-L, Provost A (1992) 5 \nMineralogical and geochemical evolution of the 1982-1983 Galunggung eruption 6 \n(Indonesia). Bull Volcanol 54:284-298. 7 \nGertisser R, Keller J (2003) Trace element and Sr, Nd, Pb and O isotope variations in 8 \nmedium-K and high-K volcanic rocks from Merapi Volcano, Central Java, Indonesia: 9 \nevidence for the involvement of subducted sediments in Sunda Arc magma genesis. J 10 \nPetrol 44:457-489. 11 \nGinibre C, Wörner G, Kronz A (2002) Minor- and trace-element zoning in plagioclase: 12 \nimplications for magma chamber processes at Parinacota volcano, northern Chile. 13 \nContrib Mineral Petrol 143:300-315. 14 \nHamilton WB (1979) Tectonics of the Indonesian region. U.S. Geological Survey 15 \nProfessional Paper reprinted with corrections, 1981 and 1985 1078:345. 16 \nHandley HK, Davidson JP, Macpherson CG (2008a) Untangling differentiation in arc lavas: 17 \nconstraints from unusual minor and trace element variations at Salak Volcano, 18 \nIndonesia. Chem Geol 255:360-376 19 \nHandley HK, Macpherson CG, Davidson JP, Berlo K, Lowry D (2007) Constraining fluid 20 \nand sediment contributions to subduction-related magmatism in Indonesia: Ijen 21 \nVolcanic Complex, Indonesia. J Petrol 48:1155-1183. 22 \nHandley HK, Turner S, Smith IEM, Stewart RB, Cronin SJ (2008b) Rapid timescales of 23 \ndifferentiation and evidence for crustal contamination at intra-oceanic arcs: 24 \nGeochemical and U-Th-Ra-Sr-Nd isotopic constraints from Lopevi Volcano, Vanuatu, 25 \nSW Pacific. Earth Planet Sci Lett 273:184-194. 26 \nHarmon RS, Gerbe MC (1992) The 1982-83 eruption at Galunggung volcano, Java 27 \n(Indonesia): oxygen isotope geochemistry of a zoned magma chamber. J Petrol 33:585-28 \n609. 29 \nHildreth W, Moorbath S (1988) Crustal contributions to arc magmatism in the Andes of 30 \nCentral Chile. Contrib Mineral Petrol 98:455-489. 31 \nHoffmann-Rothe A, Ritter O, Haak V (2001) Magnetotelluric and geomagnetic modelling 32 \nreveals zones of very high electrical conductivity in the upper crust of Central Java. 33 \nPhysics of the Earth and Planetary Interiors 124:131-151. 34 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 25 \nHutchinson CS (1989) Geological evolution of South-east Asia. Oxford Monographs on 1 \nGeology and Geophysics 13:368pp. 2 \nIonov DA, Harmon RS, France-Lanord C, Greenwood B, Ashchepkov IV (1994) Oxygen 3 \nisotope composition of garnet and spinel peridotites in the continental mantle: Evidence 4 \nfrom the Vitim xenolith suite, southern Siberia. Geochim Cosmochim Acta 58:1463-5 \n1470. 6 \nJames DE (1981) The combined use of oxygen and radiogenic isotopes as indicators of 7 \ncrustal contamination. Ann Rev Earth Planet Sci 9:311-344. 8 \nJohannes W, Koepke J, Behrens H (1994) Partial melting reactions of plagioclases and 9 \nplagioclase-bearing systems. In Parson I (ed) Feldspars and their reactions. Kluwer, 10 \nDordrecht, pp 161-194. 11 \nLangmuir CH, Voche RD, Hanson GN, Hart SR (1978) A general mixing equation with 12 \napplications to Icelandic basalts. Earth Planet Sci Lett 37:380-392. 13 \nMacpherson CG, Gamble JA, Mattey DP (1998) Oxygen isotope geochemistry of lavas from 14 \nan oceanic to continental arc transition, Kermadec-Hikurangi margin, SW Pacific. Earth 15 \nPlanet Sci Lett 160:609-621. 16 \nMacpherson CG, Mattey DP (1998). Oxygen isotope variations in Lau Basin lavas. Chem 17 \nGeol 144:177-194. 18 \nMandeville CW, Carey S, Sigurdsson H (1996) Magma mixing, fractional crystallisation and 19 \nvolatile degassing during the 1883 eruption of Krakatau volcano, Indonesia. J Volcanol 20 \nGeotherm Res 74:243-274. 21 \nMattey D, Lowry D, Macpherson C (1994) Oxygen isotope composition of mantle peridotite. 22 \nEarth Planet Sci Lett 128:231-241. 23 \nMetcalfe I (1996) Pre-Cretaceous evolution of SE Asian terranes. Geol Soc Spec Pub 106:97-24 \n122. 25 \nMuehlenbachs K (1986) Alteration of the oceanic crust and the \n18\nO history of seawater. 26 \nReviews in Mineralogy 16:425-444.  27 \nNelson ST, Montana A (1992) Sieve-textured plagioclase in volcanic rocks produced by 28 \nrapid decompression. Am Mineral 77:1242-1249. 29 \nPearce TH, Kolisnik AM (1990). Observations of plagioclase zoning using interference 30 \nimaging. Earth-Sci Rev 29:9-26. 31 \nPeccerillo A, Dallai L, Frezzotti ML, Kempton PD (2004) Sr-Nd-Pb-O isotopic evidence for 32 \ndecreasing crustal contamination with ongoing magma evolution at Alicudi volcano 33 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 26 \n(Aeolian arc, Italy): implications for style of magma-crust interaction and for mantle 1 \nsource compositions. Lithos 78:217-233. 2 \nPutirka K (2008). Thermometers and Barometers for Volcanic Systems. In: Putirka K, Tepley 3 \nF (Eds.), Minerals, Inclusions and Volcanic Processes, Reviews in Mineralogy and 4 \nGeochemistry, Mineralogical Soc. Am. 69:61-120. 5 \nReubi O, Nicholls IA (2004) Magmatic evolution at Batur volcanic field, Bali, Indonesia: 6 \npetrological evidence for polybaric fractional crystallisation and implications for 7 \ncaldera-forming eruptions. J Volcanol Geotherm Res 138:345-369. 8 \nReubi O, Nicholls IA, Kamenetsky VS (2003) Early mixing and mingling in the evolution of 9 \nbasaltic magmas: evidence from phenocryst assemblages, Slamet Volcano, Java, 10 \nIndonesia. J Volcanol Geotherm Res 119:255-274. 11 \nSchön JH (2004). Physical properties of rocks: fundamentals and principles of petrophysics. 12 \nin: Helbig K, Treitel S (eds) 18, Elsevier, UK, 583p. 13 \nSitorus K (1990) Volcanic stratigraphy and geochemistry of the Idjen Caldera Complex, East 14 \nJava, Indonesia, MSc thesis, University of Wellington, New Zealand. 15 \nSitumorang T, Hadisantono RD (1992) Geological map of Gede Volcano, Cianjur, West 16 \nJava. Volcanic Survey of Indonesia. 17 \nSoeria-Atmadja R, Suparka S, Abdullah C, Noeradi D, Sutanto (1998). Magmatism in 18 \nwestern Indonesia, the trapping of the Sumba Block and the gateways to the east of 19 \nSundaland. Journal of Asian Earth Sciences 16:1-12. 20 \nStormer JC Jr, Nicholls J (1978) XLFRAC; a program for the interactive testing of magmatic 21 \ndifferentiation models. Computers & Geosciences 4:143-159. 22 \nTepley FJ III, Davidson JP, Tilling RI, Arth JG (2000) Magma mixing, recharge and eruption 23 \nhistories recorded in plagioclase phenocrysts from El Chichon, Mexico. J Petrol 24 \n41:1397-1411. 25 \nThirlwall MF, Graham AM (1984) Evolution of high-Ca, high-Sr C-series basalts from 26 \nGrenada, Lesser Antilles: the effects of intra-crustal contamination. J Geol Soc London 27 \n141:427-445. 28 \nThirlwall MF, Graham AM, Arculus RJ, Harmon RS, Macpherson CG (1996) Resolution of 29 \nthe effects of crustal assimilation, sediment subduction, and fluid transport in island arc 30 \nmagmas: Pb-Sr-Nd-O isotope geochemistry of Grenada, Lesser Antilles. Geochim 31 \nCosmochim Acta 60:4785-4810. 32 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 27 \nTurner S, Foden J (2001) U, Th and Ra disequilibria, Sr, Nd and Pb isotope and trace element 1 \nvariations in Sunda arc lavas: predominance of a subducted sediment component. 2 \nContrib Mineral Petrol 142:43-57. 3 \nTurner S, Foden J, George R, Evans P, Varne R, Elburg M, Jenner G (2003) Rates and 4 \nprocesses of potassic magma evolution beneath Sangeang Api volcano, East Sunda Arc, 5 \nIndonesia. J Petrol 44:491-515. 6 \nVogel TA (1982) Magma mixing in the acidic-basic complex of Ardnamurchan; implications 7 \non the evolution of shallow magma chambers. Contrib Mineral Petrol 79:411-423. 8 \nVroon PZ, Lowry D, van Bergen MJ, Boyce AJ, Mattey DP (2001) Oxygen isotope 9 \nsystematics of the Banda arc: Low 18O despite involvement of subducted continental 10 \nmaterial in magma genesis. Geochim Cosmochim Acta 65:589-609. 11 \nVSI: Volcanic Survey of Indonesia. http:\/\/www.vsi.esdm.go.id\/volcanoes\/ 12 \n 13 \nFigure Captions 14 \nFig. 1. Topographic sketch map of the Gede Volcanic Complex (GVC) showing the 15 \ndistribution of rock samples and corresponding data symbols used in subsequent figures (see 16 \ninset for details). Selected rivers are shown by dashed lines. Solid lines with tick marks 17 \nhighlight volcanic craters and escarpments. Gumuruh is the remnant of the Old Gede Crater. 18 \nGede represents both Young Gede eruptive groups (Kawah Ratu and Other Vents). Inset 19 \ndiagram shows the location of Gede (large black triangle) in West Java, in relation to major 20 \ncentres of population (grey fill) and other Quaternary volcanoes (small black triangles). The 21 \nrelative stratigraphic age of each volcanic centre is also shown. 22 \n 23 \nFig. 2. a) Ba\/La  versus \n87\nSr\/\n86\nSr and b) Zr\/Nb versus \n87\nSr\/\n86\nSr highlighting heterogeneity in 24 \nmagmatic source composition (arrow labelled SH) for different geographic groups of GVC. 25 \n 26 \nFig. 3. a-c) Plagioclase analyses of volcanic rocks from the GVC separated by eruptive group 27 \n(YGKR, Young Gede Kawah Ratu; YGOV, Young Gede Other Vents; OG, Old Gede; PAN, 28 \nPangrango; Geg, Gegerbentang; OQ, Older Quaternary volcanics) and rock type. d-f) mol% 29 \nAn differences between plagioclase core and rim (open squares) of similar sized phenocrysts 30 \n(~500-800 μm in diameter) of selected samples, and mol% An differences in plagioclase core 31 \ncompositions within individual samples (stars). Also shown are samples containing 32 \northopyroxene mantled by clinopyroxene (filled circles). 33 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 28 \n 1 \nFig. 4. Analyses of pyroxene phenocrysts in GVC lavas and juvenile scoria. Dashed 2 \nlines represent 10% increments. 3 \n 4 \nFig. 5. Analyses of olivine phenocrysts in basalt from Pangrango and basaltic andesites of 5 \nYoung Gede (Kawah Ratu and Other Vents) and Gegerbentang. 6 \n 7 \nFig. 6. Details of magma mingling in GVC rocks. a) photograph of juvenile scoria from 8 \npyroclastic flow deposits of the Young Gede Other Vents group. b) plagioclase and pyroxene 9 \nanalyses in mingled juvenile scoria sample G51. „dark‟ and „light‟ correspond to the layer 10 \nfrom which they were analysed. c) photograph of juvenile scoria from pyroclastic flow 11 \ndeposits of Old Gede. d) plagioclase core, mid and rim compositions in the dark section of 12 \nG11. e) micrograph showing detail of the contact between the light and dark layers in 13 \nmingled juvenile scoria sample G13. 14 \n 15 \nFig. 7. Major element variation diagrams for GVC rocks. Model fractionation curves (FC) are 16 \nshown for 100% amphibole fractionation (FC Amph) from GVC basaltic andesite (G23) 17 \nusing the hornblende mineral composition for 8 kbar and 1000 °C of Rapp and Watson 18 \n(1995), and for fractionation of the mineral assemblage proportions suggested by least 19 \nsquares modelling for model 10 in Table 5: 0.66 Plag, 0.16 Cpx, 0.10 Ol, 0.07 Fe-Ti oxide 20 \n(FC G23) using mineral data from Supplementary Tables 2-6. Tick marks on fractionation 21 \ncurves indicate the degree of magmatic crystallisation in 10% increments. MM is a magma 22 \nmixing line between Young Gede Kawah Ratu rocks G23 and G39. 23 \n 24 \nFig. 8. Selected trace element variations with SiO2 for GVC rocks. See Fig. 7 for details of 25 \nmodel fractionation curves FC Amph and FC G23, and magma mixing line MM. FC G23 26 \nmineral partition coefficients are given in Supplementary Table 7. Amphibole partition 27 \ncoefficients are taken from Bottazzi et al. (1999). Tick marks on fractionation curves indicate 28 \nthe degree of magmatic crystallisation in 10% increments. 29 \n 30 \nFig. 9. Variation of: a) Sr isotope ratios and b) O isotope ratios with SiO2 for GVC rocks. 31 \nArrows labelled SH, AFC and FC indicate the hypothesised data trends related to: 32 \nheterogeneity in the mantle source (SH), combined assimilation and fractional crystallisation 33 \n(AFC) and fractional crystallisation (FC). AFC trends can be positive or negative depending 34 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \n40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \n64 \n65 \n \n 29 \non the Sr isotope ratio of the assimilated material (e.g. continental versus oceanic crust, 1 \nrespectively). 2 \n 3 \nFig. 10. a) 18O (clinopyroxene) versus 87Sr\/86Sr (whole rock) for GVC lavas showing within-4 \ngroup 18O and 87Sr\/86Sr relationships. Mantle range of clinopyroxene (5.57 ± 0.32 ‰) from 5 \nMattey et al. (1994) and Ionov et al. (1994). Java clinopyroxene 18O data: Galunggung 6 \n(Harmon and Gerbe 1992); Banda arc (Vroon et al. 2001); IVC (Handley et al. 2007) and 7 \nSalak (Handley et al. 2008a). b) Plot of 18O (clinopyroxene) versus 87Sr\/86Sr (bulk rock) for 8 \nGVC lavas. A simple mixing curve is plotted between sediment and depleted mantle source 9 \nto illustrate that GVC lavas are consistent with „source contamination‟ rather than „crustal 10 \ncontamination‟. Tick marks indicate the amount of sediment added to the mantle source. Data 11 \nused in mixing calculation: Bulk sediment Sr = 450 ppm; O = 50.2 wt %, \n87\nSr\/\n86\nSr = 0.7156; 12 \n18O = 18.7‰ (Vroon et al. 2001). Depleted mantle source: Sr = 12.94 ppm; O = 43.8 wt %, 13 \n87\nSr\/\n86\nSr = 0.7026 (Vroon et al. 2001 and references therein); 18O = 5.57‰ (Mattey et al. 14 \n1994; Ionov et al. 1994). Inset diagram shows the expected data trends for „crustal‟ versus 15 \n„source‟ contamination. 16 \n 17 \nFig. 11. a) La\/Nd versus 1\/Nd for GVC rocks classified by eruptive group (symbols as in Fig. 18 \n1) showing that the GVC data are not consistent with simple binary mixing or closed-system 19 \nfractional crystallisation. Model fractionation curves FC Amph and FC G23 as in Figs. 7 and 20 \n8. Model fractionation curve from end member G20 (FC G20) uses mineral proportions 21 \nsuggested by least squares modelling for model 7 in Table 5: 0.44 Plag, 0.06 Cpx, 0.34 Ol, 22 \n0.15 Fe-Ti oxide and mineral data from G20 (Supplementary Tables 2-6). Solid lines labelled 23 \n1, 2 and 3 represent mixing lines between rock samples G23-G39 (Young Gede Kawah 24 \nRatu), G20-G18 (Young Gede Other Vents) and G11-G14 (Old Gede), respectively. b) La\/Nd 25 \nversus 1\/Nd for GVC rocks with textural information highlighted (symbols as in c). c) Ni 26 \nvesus SiO2 for GVC rocks with textural information highlighted 27 \nFig_1\nClick here to download high resolution image\n10\n12\n14\n16\n18\n20\n22\n0.7043 0.7048 0.7053 0.7058\nB\na\n\/L\na\n87Sr\/86Sr\nYGKR\nYGOV\nOld Gede\nPangrango\nGegerbentang\nOlder Quat. volc.\na)source\nheterogeneity\n16\n18\n20\n22\n24\n26\n28\n30\n0.7043 0.7048 0.7053 0.7058\nZ\nr\/\nN\nb\n87Sr\/86Sr\nb)source\nheterogeneity\nFig_2\nClick here to download line figure: Fig_2.xls\nFig_3\nClick here to download high resolution image\nFig_4\nClick here to download high resolution image\nFig_5\nClick here to download high resolution image\nFig_6\nClick here to download high resolution image\n15\n16\n17\n18\n19\n20\n21\n22\n50 55 60 65\nA\nl 2\nO\n3\na)\nFC Amph\nFC G23\nMM\n4\n5\n6\n7\n8\n9\n10\n11\n12\n50 55 60 65\nF\ne\n2\nO\n3\nYoung Gede KR\nYoung Gede OV\nOld Gede\nPangrango\nGegerbentang\nOlder Quat. volcs.\nb)\nFC G23\nFC Amph\nMM\n0\n1\n2\n3\n4\n5\n6\n50 55 60 65\nM\ng\nO\nc)\nFC G23\nFC Amph\nMM\n4\n5\n6\n7\n8\n9\n10\n11\n50 55 60 65\nC\na\nO\nd)\nFC G23\nFC Amph\nMM\n2.0\n2.5\n3.0\n3.5\n4.0\n4.5\n50 55 60 65\nN\na\n2\nO\ne)\nFC G23\nFC Amph\nMM\n0.5\n1.0\n1.5\n2.0\n2.5\n50 55 60 65\nK\n2\nO\nf)\nFC G23\nFC Amph\nMM\n0.5\n0.6\n0.7\n0.8\n0.9\n1.0\n1.1\n1.2\n50 55 60 65\nT\niO\n2\nSiO2\ng)\nFC G23\nFC Amph\nMM\n0.05\n0.10\n0.15\n0.20\n0.25\n0.30\n0.35\n50 55 60 65\nP\n2\nO\n5\nSiO2\nh)\nFC G23\nFC Amph\nMM\nFig_7\nClick here to download line figure: Fig_7.xls\n250\n300\n350\n400\n450\n500\n50 55 60 65\nS\nr\nf)\nFC Amph\nFC G23\nMM\n125\n175\n225\n275\n325\n375\n50 55 60 65\nB\na\nYoung Gede KR\nYoung Gede OV\nOld Gede\nPangrango\nGegerbentang\nOlder Quat. Volc.\na)\nFC Amph\nFC G23\nMM\n3\n3.5\n4\n4.5\n5\n5.5\n6\n6.5\n7\n7.5\n8\n50 55 60 65\nN\nb\nd)\nFC Amph\nFC G23\nMM\n1.8\n2.3\n2.8\n3.3\n50 55 60 65\nY\nb\nh)\nSiO2\nFC Amph\nFC G23\nMM\n8\n10\n12\n14\n16\n18\n20\n22\n50 55 60 65\nL\na\nb)\nFC Amph\nFC G23\nMM\n0\n50\n100\n150\n200\n250\n300\n350\n50 55 60 65\nV\ne)\nFC Amph\nFC G23\nMM\n0.9\n1.1\n1.3\n1.5\n1.7\n50 55 60 65\nE\nu\ng)\nSiO2\nFC Amph\nFC G23\nMM\n0\n2\n4\n6\n8\n10\n12\n14\n16\n18\n50 55 60 65\nN\ni\nSiO2\nFC G23\nFC Amph\nc)\nMM\nFig_8\nClick here to download line figure: Fig_8.xls\n0.7044\n0.7046\n0.7048\n0.7050\n0.7052\n0.7054\n0.7056\n50 52 54 56 58 60 62\n8\n7\nS\nr\/\n8\n6\nS\nr\nSiO2\nYoung Gede KR Young Gede OV\nOld Gede Pangrango\nGegerbentang Older Quat. volc.\na)\nFC\nAFC (low 87Sr\/86Sr) \nAFC (high 87Sr\/86Sr) \nSH\n5.4\n5.5\n5.6\n5.7\n5.8\n5.9\n6.0\n6.1\n50 52 54 56 58 60 62\nd\n1\n8\nO\n (\nc\np\nx\n)\nSiO2\nb)\nFig_9\nClick here to download line figure: Fig_9.xls\nFig_10\nClick here to download high resolution image\n0.6\n0.7\n0.8\n0.9\n1.0\n0.03 0.05 0.07\nL\na\n\/N\nd\n1\/Nd\na)\nFC G23\nFC G20\nFC Amph\n1\n2\n3\n0\n2\n4\n6\n8\n10\n12\n14\n16\n18\n50 55 60 65\nN\ni\nSiO2\nGVC\nopx mantled by cpx\nol and opx\nmingled\nxenolith\nc)\n0.6\n0.7\n0.8\n0.9\n1.0\n0.03 0.05 0.07\nL\na\n\/N\nd\n1\/Nd\nb)\nFig_11\nClick here to download line figure: Fig_11.xls\nTable 1. Estimated average temperatures and pressures for GVC magma using the two-pyroxene approach\nStratigraphic Brey and Kohler (1990) Putirka (2008) Putirka (2008) equivalent depth\nGroup B\/BA\/A Sample T(ºC) Eqn 36, T(ºC) Eqn 39, P(kbar) (km) n(eqm) n(comb) % in eqm Mantled\nYGKR BA G41 955 1008 3.4 13 4 16 25 N\nYGKR BA G23 - - - - 0 32 0 Y\nYGKR A G22 891 962 5.5 21 3 20 15 Y\nYGKR A G40 958 1046 6.1 23 8 24 33 N\nYGOV BA G44 995 1018 5.0 19 18 42 43 Y\nYGOV BA G51 - - - - 0 4 0 N\nOG BA G37A 951 998 4.5 17 1 14 7 N\nOG BA G48\na\n969 1005 5.6 21 8 12 67 N\nOG A G17 937 984 6.5 24 1 12 8 N\nPang BA G24 991 1033 4.8 18 10 20 50 Y\nGeg BA G27 1014 1026 6.0 22 7 12 58 N\nOQ A G49 - - - - 0 52 0 Y\nAverage All 984 1023 5.5 20 60 260 23\nn(eqm) = number of two-pyroxene combinations in each sample in equilibrium. Test for equilibrium: KD (Fe-Mg)  should be 1.09 ± 0.14.\nn(comb) = number of two-pyroxene combinations tried in each sample.\nMantled = observed overgrowths of clinopyroxene on orthopyroxene: Y, yes; N, no.\nEquation 39 uses equation 36 for the temperature input. Calculated pressure for pyroxenes +\/- 2.8 kbar (Putirka, 2008).\na \nother petrographic disequilibrium texture observed: coexistence of olivine and opx.\nB, basalt; BA, baslatic andesite; A, andesite.\nThe conversion of pressures to depths is obtained by solving (iteratively) the coupled system:\nwhere ρ 0  is a reference density at surface conditions (i.e. T 0 , P 0 ), α  the coefficient of thermal expansion [K\n-1\n], and β  the compressibility \n[Pa-1]. Integration is performed from surface downwards. Representative values for all parameters are taken from Schön (2004).\n)()()( 00000 PPTTz  \n\nz\ndzzgzP\n0\n)()( \nTable_1\nClick here to download table: Table_1.xls\nTable 2. Major and trace element data of GVC volcanic rocks Table 2 continued. Major and trace element data of GVC volcanic rocks Table 2 continued. Major and trace element data of GVC volcanic rocks\nSample G01A G01B G03 G04 G06 G07 G10 G11 G14 G15 G16 G17 G18 G19 G20 G21 G22 Sample G23 G24 G25 G26 G27 G28 G29 G30 G31 G32 G33 G35 G36A G36B G37A G38 G39 G40 Sample G41 G42 G43 G44 G45 G46 G47 G48 G49 G51 G52 G53 G54 G55 G57 G58\nSiO2 55.04 54.86 55.21 56.10 55.54 56.27 55.11 56.70 59.03 59.58 51.48 61.11 59.39 55.49 53.98 55.05 59.47 SiO2 52.52 54.87 59.29 53.60 52.93 54.43 51.66 51.56 56.06 54.33 53.23 50.56 54.71 54.81 56.17 55.36 62.01 57.45 SiO2 54.45 54.28 55.59 55.09 57.56 54.96 58.90 54.76 59.85 55.39 58.81 58.94 58.17 54.78 60.77 60.69\nAl2O3 18.34 18.53 18.41 18.83 20.65 19.43 20.17 18.04 17.49 20.55 19.41 17.72 17.76 20.02 17.05 18.77 17.34 Al2O3 19.19 18.61 17.55 18.89 19.65 18.63 19.33 18.56 21.15 19.63 19.35 19.29 18.52 18.63 20.91 18.76 17.46 18.46 Al2O3 20.04 20.20 19.09 19.76 19.32 19.97 17.95 18.79 17.15 18.33 17.29 17.17 17.84 19.51 17.30 17.11\nFe2O3 8.35 8.30 8.18 8.10 7.22 7.78 7.66 8.19 6.93 4.71 10.50 6.57 6.96 7.61 10.33 8.22 7.19 Fe2O3 9.07 9.42 6.94 9.85 9.65 9.55 10.04 10.34 6.65 8.71 9.59 10.56 8.18 8.29 6.51 8.61 6.13 8.14 Fe2O3 7.97 7.99 8.01 7.91 7.25 8.09 7.32 9.08 7.18 8.20 7.36 7.14 7.55 8.69 6.60 6.45\nMgO 3.98 4.06 3.95 3.63 2.36 2.50 2.86 3.73 2.93 1.24 4.21 2.54 3.03 2.87 5.22 3.61 3.13 MgO 4.51 3.64 2.97 3.88 3.51 3.49 4.59 4.98 2.03 2.93 3.70 4.89 4.01 4.11 2.03 3.33 2.52 3.01 MgO 3.21 3.29 3.59 3.09 2.72 3.13 2.75 3.69 2.79 3.97 3.02 3.02 2.84 3.09 2.41 2.71\nCaO 8.78 8.92 8.79 8.10 8.70 7.60 8.23 8.08 7.06 7.13 9.26 6.15 7.27 8.38 7.50 8.72 7.23 CaO 9.86 8.43 7.16 8.83 8.97 8.69 9.38 9.67 8.79 8.61 8.76 9.78 8.95 8.91 8.53 7.67 6.22 7.66 CaO 8.99 8.95 8.44 8.35 7.98 8.85 6.94 7.74 6.28 8.75 6.79 6.68 6.62 7.39 6.82 6.52\nNa2O 2.97 2.96 2.99 3.01 3.53 3.91 3.12 2.94 3.11 3.51 2.77 3.34 3.22 3.14 2.61 3.07 3.21 Na2O 2.75 3.07 3.21 3.09 3.07 3.11 2.82 2.70 3.41 3.28 3.05 2.94 2.89 2.93 3.28 3.08 3.37 3.18 Na2O 3.09 3.04 2.98 3.08 3.16 3.07 3.31 2.89 3.40 2.96 3.20 3.33 3.45 3.12 2.64 2.54\nK2O 1.36 1.32 1.37 1.35 1.06 1.45 1.18 1.41 1.67 1.44 1.18 1.53 1.73 1.27 1.29 1.02 1.74 K2O 0.91 1.05 1.76 0.93 0.89 1.01 0.81 1.19 1.13 1.00 0.87 0.92 1.30 1.32 1.38 1.14 1.84 1.26 K2O 1.25 1.23 1.31 1.20 1.38 1.06 1.37 1.13 1.78 1.38 1.59 1.98 1.87 1.10 1.35 1.33\nTiO2 0.91 0.91 0.90 0.81 0.81 0.83 0.80 0.81 0.70 0.55 1.08 0.62 0.71 0.79 0.94 0.80 0.74 TiO2 0.90 0.87 0.72 0.89 0.95 0.91 0.96 1.06 0.70 0.79 0.92 1.15 0.91 0.90 0.72 0.85 0.64 0.77 TiO2 0.81 0.81 0.79 0.81 0.73 0.83 0.78 0.91 0.72 0.90 0.76 0.76 0.73 0.93 0.79 0.80\nMnO 0.15 0.15 0.15 0.14 0.14 0.16 0.15 0.15 0.14 0.11 0.20 0.14 0.14 0.15 0.19 0.16 0.14 MnO 0.17 0.19 0.14 0.20 0.19 0.20 0.18 0.18 0.14 0.19 0.19 0.18 0.14 0.15 0.13 0.17 0.13 0.17 MnO 0.15 0.15 0.15 0.16 0.14 0.15 0.14 0.17 0.14 0.15 0.13 0.15 0.15 0.16 0.13 0.09\nP2O5 0.14 0.14 0.14 0.17 0.22 0.24 0.19 0.15 0.14 0.18 0.18 0.17 0.14 0.19 0.16 0.16 0.14 P2O5 0.13 0.23 0.14 0.23 0.28 0.29 0.21 0.18 0.20 0.29 0.26 0.15 0.13 0.14 0.18 0.19 0.15 0.19 P2O5 0.16 0.16 0.16 0.19 0.18 0.17 0.20 0.18 0.17 0.13 0.15 0.14 0.22 0.20 0.13 0.13\nLOI 0.09 0.15 0.16 0.05 -0.07 -0.02 0.80 0.04 0.89 0.95 -0.15 0.32 -0.20 0.18 0.89 0.47 0.00 LOI 0.07 -0.17 -0.08 -0.23 -0.05 -0.21 -0.13 -0.40 -0.11 0.02 0.20 -0.43 0.22 0.05 0.51 0.97 -0.19 -0.14 LOI 0.17 0.19 -0.15 0.48 -0.09 0.07 0.18 0.78 0.35 0.23 0.91 0.50 0.65 1.21 1.40 1.64\nTotal 100.10 100.29 100.24 100.29 100.16 100.16 100.26 100.24 100.08 99.94 100.12 100.21 100.15 100.08 100.16 100.05 100.32 Total 100.08 100.21 99.79 100.16 100.04 100.10 99.86 100.02 100.16 99.78 100.12 100.00 99.96 100.23 100.35 100.12 100.27 100.14 Total 100.29 100.27 99.97 100.12 100.33 100.34 99.83 100.12 99.80 100.38 100.00 99.81 100.08 100.17 100.34 100.01\nSc 30 30 31 20 18 18 17 21 17 9 29 13 19 16 27 22 20 Sc 30 21 19 20 19 19 26 32 13 13 19 36 30 30 14 20 13 17 Sc 20 21 21 18 15 21 16 24 17 29 20 15 10 17 22 18\nTi 5467 5556 5898 4909 5017 5455 4939 4406 3878 3518 6683 3465 4256 4316 5814 4957 4621 Ti 5712 5496 4567 5898 6132 5682 6156 6713 4633 4501 5706 7636 5688 5113 4160 5556 3554 5065 Ti 5353 5401 5425 5443 4070 5257 5149 5976 4645 5011 4382 3812 3710 4873 5221 4124\nV 238 246 255 167 135 137 132 185 146 61 245 115 158 130 228 201 173 V 257 192 167 192 166 152 221 259 108 151 184 316 252 262 128 193 119 147 V 193 198 185 151 150 193 137 228 151 252 184 159 120 191 118 107\nCr 17.4 18.2 17.4 9.9 4.0 3.2 8.8 14.0 11.4 2.2 6.2 3.7 6.2 14.6 26.5 5.1 8.4 Cr 8.3 2.6 6.6 5.6 10.2 4.6 12.6 10.9 1.5 2.6 10.4 15.6 17.3 17.9 1.2 4.6 10.9 2.5 Cr 3.0 3.3 10.1 11.0 2.8 3.1 10.4 5.3 13.1 16.1 13.3 11.8 3.9 1.9 21.9 23.8\nMn 1185 1185 1046 1154 1154 1162 1216 1224 1115 751 1603 1162 1076 1208 1557 1324 1162 Mn 1371 1557 1146 1820 1781 1619 1541 1518 1022 1549 1541 1688 1200 1200 1092 1200 1053 1216 Mn 1076 1076 1115 1169 1146 1247 1053 1200 1169 1185 1131 1100 1107 1239 945 666\nCo 24 25 26 22 17 19 19 23 19 8 29 15 19 18 31 22 19 Co 29 24 19 25 22 21 28 32 15 20 24 33 26 26 16 22 15 18 Co 23 23 24 22 17 21 17 25 18 25 20 18 17 21 16 15\nNi 15.6 13.0 7.4 11.2 5.5 1.3 7.6 9.8 7.5 2.2 6.1 4.2 5.2 8.9 17.0 6.1 4.9 Ni 8.0 4.8 4.1 5.6 5.4 3.6 9.3 9.6 0.8 3.9 7.3 8.6 7.9 9.1 2.7 2.6 7.7 1.9 Ni 4.3 3.0 7.0 6.7 3.8 4.4 5.5 3.0 7.3 8.6 7.8 7.1 5.6 2.8 5.6 7.4\nCu 12 15 16 54 52 63 48 25 38 11 72 17 21 49 50 21 23 Cu 48 42 25 39 24 80 36 104 35 41 42 73 14 15 40 36 41 28 Cu 50 49 49 59 34 45 22 40 43 14 35 32 8 49 16 16\nZn 76 76 70 77 77 85 67 77 71 56 95 68 69 70 88 82 75 Zn 81 89 74 79 79 88 87 96 77 89 88 84 77 77 71 79 60 65 Zn 70 72 75 67 72 77 62 86 70 74 85 59 52 79 64 64\nGa 18 19 19 19 20 21 19 18 18 19 21 18 18 19 18 19 18 Ga 19 20 19 20 20 20 20 20 21 21 20 21 19 19 21 20 17 18 Ga 20 21 20 20 19 20 19 20 18 18 18 16 16 20 17 16\nRb 49.6 49.0 50.4 53.4 36.0 54.3 46.7 57.0 70.2 54.2 34.1 58.5 62.1 50.7 57.3 37.0 66.2 Rb 32.4 38.7 68.8 31.9 34.0 39.1 30.9 45.8 45.0 35.1 30.4 30.0 48.8 49.8 55.0 43.4 77.0 48.6 Rb 48.4 48.3 54.6 50.1 52.6 38.7 52.7 35.9 56.1 51.5 52.8 63.9 55.6 40.0 47.6 43.8\nSr 323 319 334 331 397 336 357 287 285 407 301 317 302 337 280 362 307 Sr 354 353 316 406 438 422 397 302 367 405 423 326 324 301 342 351 309 370 Sr 346 347 366 376 334 347 386 358 342 297 306 283 382 320 221 199\nY 22 22 23 25 24 31 26 25 26 26 32 22 23 25 24 21 24 Y 21 27 24 26 30 30 24 30 31 26 24 27 22 23 29 27 23 26 Y 26 25 26 27 25 24 26 26 26 23 27 22 23 28 27 25\nZr 108 107 108 122 102 130 128 128 151 149 116 142 117 124 120 100 138 Zr 80 114 143 98 103 125 83 110 138 103 91 82 108 110 138 122 146 126 Zr 113 113 119 131 128 96 144 108 132 109 115 100 122 118 22 19\nNb 4.22 4.18 4.20 4.85 4.26 5.37 4.78 4.72 5.39 5.82 5.25 5.90 4.92 4.73 4.47 3.98 5.09 Nb 3.46 5.27 5.22 4.45 5.82 6.98 4.53 4.96 5.52 5.49 4.99 3.72 4.15 4.21 5.85 4.91 5.57 4.83 Nb 4.67 4.61 4.90 4.79 5.35 3.95 5.60 4.59 5.29 4.22 5.07 4.98 5.73 4.97 7.64 7.54\nCs 3.33 3.31 3.24 2.59 1.68 3.89 3.44 3.91 4.77 3.88 2.55 1.99 2.11 2.59 4.19 2.39 4.41 Cs 2.28 1.44 4.55 0.91 1.52 1.11 1.78 1.01 2.31 1.61 1.27 0.84 3.27 3.29 4.24 3.26 2.69 2.08 Cs 3.51 3.48 1.87 3.45 2.27 2.23 1.79 1.84 1.54 3.34 3.18 1.52 1.20 3.35 1.85 1.97\nBa 250 247 249 254 216 267 238 266 320 317 242 315 313 237 229 211 318 Ba 183 233 330 179 177 212 168 212 210 223 188 160 245 250 307 251 364 245 Ba 238 235 242 228 279 217 265 231 308 254 334 320 356 266 250 250\nLa 13.6 13.4 13.6 14.7 12.7 15.1 13.8 15.0 17.7 18.2 14.4 16.5 15.7 12.6 10.9 12.0 16.4 La 10.4 15.0 17.2 12.9 14.6 17.1 12.5 13.5 13.9 17.1 14.5 9.8 13.3 13.7 17.7 15.2 20.2 15.0 La 13.4 13.4 14.5 13.8 17.0 12.7 16.0 14.0 20.4 13.8 19.2 17.9 20.5 16.5 19.0 19.1\nCe 28.6 28.5 28.7 32.1 27.8 33.0 30.8 32.1 37.4 39.1 31.5 34.5 32.4 28.1 27.2 26.0 34.3 Ce 22.6 32.8 35.9 28.8 32.0 38.6 27.7 29.9 30.5 36.3 31.7 22.2 28.2 29.1 36.9 32.1 41.1 32.0 Ce 29.1 29.1 30.5 30.8 36.3 26.8 35.3 30.3 38.8 29.2 38.6 35.8 40.8 33.5 39.2 39.2\nPr 3.78 3.76 3.78 4.31 3.94 4.55 4.26 4.24 4.89 5.10 4.40 4.49 4.19 3.87 3.39 3.52 4.44 Pr 3.07 4.51 4.61 4.09 4.74 5.38 3.98 4.17 4.31 5.05 4.59 3.22 3.76 3.86 5.04 4.52 5.22 4.44 Pr 4.01 3.97 4.17 4.25 4.82 3.71 4.83 4.12 5.60 3.84 4.96 4.54 5.26 4.76 4.97 4.89\nNd 16.1 16.4 16.4 18.5 17.9 20.2 18.7 18.2 20.5 21.6 20.0 18.9 17.5 17.1 15.3 15.2 18.6 Nd 13.8 19.9 19.1 18.5 21.5 24.2 18.1 18.8 19.4 22.0 20.7 15.0 16.2 16.7 21.6 19.8 21.0 19.5 Nd 17.5 17.5 18.0 18.6 20.7 16.4 21.0 18.2 23.3 16.6 20.8 18.7 21.6 20.8 20.5 20.1\nSm 3.76 3.80 3.79 4.32 4.19 4.78 4.37 4.16 4.60 4.67 4.96 4.08 3.92 4.09 3.82 3.50 4.05 Sm 3.34 4.53 4.22 4.30 5.04 5.47 4.21 4.72 4.70 4.80 4.70 3.89 3.80 3.86 4.84 4.47 4.38 4.47 Sm 4.10 4.13 4.07 4.40 4.53 3.83 4.84 4.19 4.94 3.84 4.52 4.01 4.52 4.71 4.37 4.31\nEu 1.06 1.07 1.07 1.17 1.26 1.38 1.25 1.14 1.17 1.30 1.33 1.15 1.04 1.24 1.13 1.08 1.05 Eu 1.04 1.32 1.08 1.34 1.51 1.54 1.30 1.25 1.36 1.47 1.42 1.21 1.06 1.09 1.35 1.26 1.12 1.24 Eu 1.17 1.15 1.14 1.24 1.23 1.16 1.29 1.21 1.29 1.08 1.20 1.10 1.30 1.34 1.14 1.12\nGd 3.98 4.09 3.99 4.48 4.36 5.06 4.68 4.39 4.69 4.67 5.35 4.03 3.98 4.23 4.07 3.64 4.10 Gd 3.60 4.69 4.28 4.46 5.11 5.44 4.37 5.16 5.02 4.69 4.76 4.35 4.00 4.08 5.06 4.72 4.21 4.55 Gd 4.25 4.24 4.20 4.55 4.49 4.14 4.66 4.34 4.74 3.99 4.63 4.11 4.33 4.97 4.56 4.65\nTb 0.63 0.63 0.63 0.71 0.69 0.82 0.74 0.69 0.73 0.73 0.88 0.62 0.64 0.69 0.68 0.59 0.65 Tb 0.58 0.75 0.68 0.68 0.81 0.84 0.68 0.83 0.82 0.72 0.73 0.73 0.64 0.65 0.78 0.75 0.65 0.73 Tb 0.69 0.69 0.68 0.73 0.71 0.65 0.74 0.71 0.75 0.63 0.73 0.62 0.65 0.78 0.77 0.76\nDy 3.71 3.77 3.74 4.15 4.03 4.91 4.34 4.05 4.30 4.15 5.25 3.67 3.66 4.10 4.05 3.46 3.81 Dy 3.44 4.38 3.93 4.17 4.73 4.87 3.96 4.93 4.91 4.06 4.10 4.42 3.75 3.78 4.54 4.40 3.71 4.23 Dy 4.07 4.05 3.98 4.36 4.10 3.85 4.21 4.20 4.31 3.72 4.30 3.72 3.79 4.55 4.56 4.40\nHo 0.77 0.78 0.77 0.86 0.83 1.03 0.89 0.85 0.89 0.85 1.09 0.75 0.76 0.84 0.84 0.73 0.80 Ho 0.72 0.91 0.81 0.86 1.00 1.00 0.82 1.02 1.03 0.83 0.85 0.93 0.77 0.79 0.96 0.93 0.76 0.88 Ho 0.86 0.85 0.83 0.90 0.83 0.81 0.85 0.87 0.88 0.77 0.90 0.76 0.79 0.95 0.94 0.88\nEr 2.07 2.11 2.12 2.30 2.27 2.82 2.45 2.29 2.43 2.34 2.99 2.10 2.09 2.33 2.33 2.01 2.19 Er 1.96 2.50 2.24 2.39 2.71 2.76 2.24 2.78 2.85 2.24 2.25 2.56 2.09 2.12 2.63 2.55 2.05 2.43 Er 2.33 2.33 2.29 2.48 2.26 2.20 2.25 2.40 2.45 2.10 2.48 2.07 2.16 2.57 2.46 2.31\nTm 0.32 0.33 0.33 0.36 0.36 0.44 0.38 0.35 0.39 0.37 0.46 0.33 0.32 0.37 0.38 0.31 0.34 Tm 0.30 0.40 0.35 0.38 0.42 0.43 0.34 0.43 0.45 0.35 0.34 0.39 0.32 0.33 0.40 0.39 0.32 0.38 Tm 0.36 0.36 0.35 0.38 0.36 0.35 0.35 0.37 0.39 0.33 0.38 0.33 0.34 0.39 0.38 0.36\nYb 2.02 2.05 2.09 2.27 2.26 2.84 2.44 2.28 2.46 2.40 2.92 2.15 2.07 2.35 2.41 2.01 2.20 Yb 1.92 2.55 2.25 2.39 2.72 2.77 2.15 2.66 2.87 2.23 2.15 2.49 2.05 2.09 2.57 2.55 2.09 2.41 Yb 2.34 2.33 2.24 2.48 2.24 2.18 2.28 2.36 2.52 2.05 2.47 2.07 2.25 2.50 2.38 2.21\nLu 0.33 0.34 0.34 0.37 0.37 0.47 0.41 0.38 0.40 0.40 0.48 0.36 0.34 0.39 0.40 0.33 0.37 Lu 0.31 0.42 0.36 0.40 0.47 0.46 0.36 0.43 0.47 0.37 0.35 0.41 0.33 0.34 0.43 0.43 0.34 0.41 Lu 0.38 0.39 0.38 0.42 0.37 0.36 0.37 0.39 0.41 0.34 0.42 0.35 0.38 0.41 0.39 0.36\nHf 2.90 2.92 2.94 3.29 2.72 3.46 3.43 3.45 4.08 3.91 3.22 3.71 3.21 3.38 3.27 2.66 3.64 Hf 2.20 3.04 3.77 2.65 2.79 3.28 2.27 3.04 3.68 2.76 2.49 2.33 2.91 2.96 3.62 3.25 3.84 3.35 Hf 3.07 3.02 3.21 3.46 3.39 2.64 3.85 2.90 3.61 2.94 3.25 2.93 3.27 3.22 0.75 0.69\nTa 0.35 0.33 0.34 0.38 0.31 0.41 0.35 0.38 0.44 0.43 0.40 0.44 0.40 0.35 0.34 0.30 0.41 Ta 0.26 0.37 0.43 0.29 0.35 0.43 0.30 0.37 0.40 0.35 0.31 0.26 0.33 0.33 0.43 0.36 0.45 0.36 Ta 0.35 0.34 0.35 0.35 0.39 0.29 0.41 0.33 0.39 0.33 0.39 0.39 0.42 0.36 0.63 0.60\nPb (total) 10.5 10.3 10.4 11.4 7.2 13.0 6.6 12.8 14.2 13.6 11.7 11.3 9.5 10.4 7.5 8.8 12.6 Pb (total) 8.3 18.1 12.9 5.1 6.7 12.2 8.2 14.4 9.9 7.7 8.9 5.1 10.4 10.7 13.9 9.9 11.9 8.6 Pb (total) 11.1 11.0 10.3 10.7 10.1 9.7 12.3 10.1 8.8 10.5 8.4 7.1 5.8 12.3 9.4 8.8\nTh 5.48 5.47 5.53 5.78 3.73 5.46 5.40 6.21 7.68 6.46 5.50 6.24 6.61 5.30 5.23 4.10 7.15 Th 3.45 4.50 7.43 3.73 3.32 4.14 3.14 5.16 4.64 4.32 3.41 3.21 5.34 5.51 6.06 4.82 8.10 5.08 Th 4.82 4.78 5.47 5.29 5.61 3.96 5.46 4.36 7.43 5.60 9.34 8.93 8.77 4.99 6.28 5.56\nU 1.22 1.20 1.23 1.33 0.88 1.32 1.22 1.41 1.75 1.46 1.16 1.39 1.50 1.23 1.25 0.92 1.63 U 0.78 1.06 1.70 0.86 0.80 1.01 0.74 1.17 1.09 1.00 0.82 0.73 1.18 1.24 1.44 1.12 1.82 1.19 U 1.15 1.13 1.26 1.25 1.29 0.93 1.28 0.99 1.54 1.27 1.83 1.76 1.75 1.15 0.60 0.51\nTable_2\nClick here to download table: Table_2.xls\nTable 3. Whole-rock Sr isotope\ndata of GVC volcanic rocks\nSample\n87\nSr\/\n86\nSrm 2SE\nG01A 0.705325 0.000009\nG01B 0.705288 0.000009\nG10 0.705004 0.000010\nG16 0.705540 0.000012\nG17 0.704990 0.000009\nG18 0.705143 0.000009\nG19 0.704980 0.000013\nG20 0.705088 0.000011\nG21 0.705118 0.000008\nG22 0.705140 0.000011\nG23 0.705268 0.000011\nG25 0.705117 0.000010\nG26 0.704882 0.000011\nG28 0.705056 0.000011\nG30 0.705393 0.000013\nG33 0.704997 0.000008\nG35 0.705358 0.000009\nG36A 0.705318 0.000012\nG40 0.705070 0.000010\nG42 0.705207 0.000009\nG44 0.705001 0.000009\nG46 0.705201 0.000012\nG49 0.704735 0.000008\nG51 0.705294 0.000012\nG52 0.704508 0.000009\nG55 0.705057 0.000009\nm = measured\n2SE: 2*standard internal error\nTable_3\nClick here to download table: Table_3.xls\nTable 4. Oxygen isotope data\n(d\n18\nO) of GVC mineral separates\nCPX OL PLAG\nG01A 5.69 5.39\nG16 5.91\nG17 5.60\nG25 5.72\nG26 5.63 6.07\nG30 5.78 5.42\nG35 5.76 5.32\nG33 5.68\nG40 5.55\nG42 5.52\nG44 5.81\nG46 5.94\nCPX, clinopyroxene; OL, olivine; \nPLAG, plagioclase.\nTable_4\nClick here to download table: Table_4.xls\nTable 5. Results of least squares major element modelling\nModel SiO2 range Sr\n2\nPlag Cpx Ol Opx Ox %C\n1 G29 GEG G28 GEG 52-54 0.07 26.1 1.51 9 2.23 39\n2 G29 GEG G32 GEG 52-54 0.09 23.8 3.46 9.2 2.45 39\n3 G35 PAN G31 PAN 51-56 0.07 26 7.79 8.05 3.61 45\n4 G35 PAN G24 PAN 51-55 0.10 31.7 5.42 6.47 2.95 47\n5 G48 OG G17 OG 55-61 0.09 25.9 0.57 8.34 3.34 38\n6 G48 OG G15 OG 55-60 0.05 14.9 2.96 9.89 3.54 31\n7 G20 YGOV G18 YGOV 54-59 0.03 8.79 1.27 6.74 3.01 20\n8 G36A YGOV G18 YGOV 55-59 0.06 15.7 4.2 2.83 1.94 25\n9 G20 YGOV G19 YGOV 54-55 0.10 8.56 3.37 5.17 1.15 1\n10 G23 YGKR G39 YGKR 53-62 0.08 33.3 8.1 5.16 3.89 50\n11 G23 YGKR G22 YGKR 53-60 0.06 29.7 5.8 4.75 3.12 43\n12 G48 OG G39 YGKR 55-62 0.03 27.6 0.47 9.15 3.66 40\n13 G48 OG G18 YGOV 55-59 0.03 20.3 2.63 7.73 2.89 28\n14 G23 YGKR G15 OG 53-60 0.06 22.6 11.1 5.4 3.95 43\nSiO2 range in wt %\nC% = degree of crystallisation\nPlag, plagioclase; Cpx, clinopyroxene; Ol, olivine; Opx, orthopyroxene; Ox, Fe-Ti oxide.\nGEG, Gegerbentang; PAN, Pangrango; OG, Old Gede; YGO, Young Gede Other Vents; YGKR, \nYoung Gede Kawah Ratu \nBold font indicates the addition rather than removal of a particular phase.  \nThe mineral phases considered in modelling are limited to those observed as phenocrysts in either\n the parent or daughter rocks.\nParent Daughter\nTable_5\nClick here to download table: Table_5.xls\nAnalytical techniques \nMineral analyses were performed on carbon-coated polished thin sections of selected \nGVC volcanic rocks using a Cameca SX 100 electron microprobe at the University of \nManchester NERC facility. The accelerating voltage was 15kV and beam current was \n2nA. Detection limits based on counting statistics (wt%) for Al, Mg, K, Ca, Ti are \n0.01 or lower, Na, Si, Cr, Ni are around 0.03, while Fe is slightly higher around 0.08. \nElement precision is dependant on the mineral being analysed but was typically better \nthan 1% for Ca, Ti, Si, Al and Mg, between 1-2% for Fe, 2.7% for Ni and around 4% \nfor Na, K, Mn and Cr. \nMajor element contents of GVC whole-rock samples were determined on \nfused glass discs produced by the Fusion method (spectroflux 105) using the \nAutomated Philips PW2404 X-ray fluorescence spectrometer at the University of \nEdinburgh. In-house rock standards were used to calibrate the machine and monitor \naccuracy and precision during analysis. \nTrace element concentrations of GVC rock powders were determined on the \nPerkinElmer ELAN 6000 quadrupole ICP-MS at Durham University following the \nanalytical procedure and instrument operating conditions described by Ottley et al. \n(2003). Multiple analyses of procedural blanks (3 per batch), in-house standards and \ninternational reference materials (W2, BHVO-1, AGV1, BE-N and BIR1) during each \nsession e.g. at the start, mid-way and at the end of a run, allowed any drift in the \ninstrument calibration to be detected. Reproducibility (internal and external) of \nstandard values on the ELAN were better than 5% relative standard deviation. \nPreparation of whole rock powders for Sr isotope analysis was undertaken in \nthe Arthur Holmes Isotope Geology Laboratory (AHIGL) at Durham University. The \nseparation procedure for Sr follows that detailed by Handley et al. (2008a). Sr isotope \nratios were determined on the AHIGL ThermoElectron Neptune Multi-collector \nPlasma Mass Spectrometer (MC-ICP-MS).  Details of instrument operating conditions \nare presented in Nowell et al. (2003) and Dowall et al. (2003). Instrumental mass bias \nwas corrected for using a 88Sr\/86Sr ratio of 8.375209 (the reciprocal of the 86Sr\/88Sr \nratio of 0.1194). Data quality was monitored over several analytical sessions by \nregular analysis of standard reference materials during each run. The reproducibility \nof the 87Sr\/86Sr ratios for NBS 987 standard solutions in each of the individual \nanalytical sessions is better than 21 ppm in all cases. Blank samples processed (at \nAnalytical Techniques\nClick here to download Electronic supplementary material: Analytical Techniques.pdf\nleast 2 per sample batch) were analysed by ICP-MS on the PerkinElmer ELAN 6000 \nquadrupole at Durham University. Total analytical blanks for Sr were below 1.2 ng \n(typically <300 pg). These values are insignificant considering the quantity of Sr \nprocessed from the volcanic rocks (30-66 μg). \nOxygen isotope analyses of mineral separates (~10mg per sample) were \ndetermined by laser-fluorination at Royal Holloway, University of London using an \nanalytical procedure following that of Macpherson et al. (2000). In-house standard \nvalues of SC olivine 2 and GMG II during the period of study were within 0.01‰ of \naccepted values: +5.24‰ ± 0.04 (1σ, n = 6) and +5.69‰ ± 0.08 (1σ, n = 15), \nrespectively. Oxygen yields were slightly low, but consistent over the individual \nsessions: 93% for plagioclase (n = 1), between 92-94% (n = 12) for clinopyroxene and \nbetween 98-100% for olivine (n = 3). Replicate analyses of plagioclase and \nclinopyroxene throughout the study were within 0.09‰ and 0.04‰ respectively. \nOxygen results are reported as per mil deviations relative to the standard mean ocean \nwater (V-SMOW) standard. \n \nReferences \nHandley HK, Davidson JP, Macpherson CG (2008a) Untangling differentiation in arc \nlavas: constraints from unusual minor and trace element variations at Salak \nVolcano, Indonesia. Chem Geol 255:360-376 \nMacpherson CG, Hilton DR, Mattey DP, Sinton JM (2000). Evidence for an 18O-\ndepleted mantle plume from contrasting 18O\/16O ratios of back-arc lavas from \nthe Manus Basin and Mariana Trough. Earth Planet Sci Lett 176:171-183. \nNowell GM, Pearson DG, Ottley CJ, Schweiters J (2003) Long-term performance \ncharacteristics of a plasma ionisation multi-collector mass spectrometer \n(PIMMS): the ThermoFinnigan Neptune. Plasma Source Mass Spectrometry. \nSpec Pub Royal Soc Chem 307-320. \nOttley CJ, Pearson DG, Irvine GJ (2003) A routine method for the dissolution of \ngeological samples for the analysis of REE and trace elements via ICP-MS. \nPlasma Source Mass Spectrometry. Spec Pub Royal Soc Chem 221-230. \n \n)Supplementary Table 1. Modal proportions of mineral phases in GVC volcanic rocks\nG01A G01B G04 G06 G07 G08 G09 G10\nOl 3.2 4.1 - 1.2 8.5 11.8 11.1 -\nOpx - - 5.2 3.1 - - - 1.1\nCpx 8.3 9.8 10.7 6.9 3.2 3.1 7.3 4.9\nPlag 26.5 31.2 44.3 57.3 64.8 31.7 57.7 31.3\nOx 1.5 - 0.8 3.1 1.2 1.5 1.9 0.8\nHbl - - - - - - - -\nBio - - - - - - - -\nGM 60.5 54.9 39.0 28.4 22.3 51.9 22.0 61.9\nG13(light) G13(dark) G15 G16 G17 G18 G19 G20\nOl - 3.9 - 8.8 - - - -\nOpx 3.8 3.2 4.3 1.1 12.1 8.2 4.5 3.2\nCpx 10.8 8.7 2.8 13.3 6.3 10.6 7.2 16.2\nPlag 38.4 41.3 53.9 53.8 39.5 42.3 30.4 27.6\nOx 2.4 1.8 1.8 2.2 2.8 2.8 1.1 2.7\nHbl - - - - - - - -\nBio - - - - - - - -\nGM 44.6 41.1 37.2 20.8 39.3 36.1 56.8 50.3\nG21 G22 G24 G25 G26 G27 G28 G29\nOl - - - - 3.7 - - 10.9\nOpx 3.4 5.3 7.2 9.2 2.1 6.2 5.3 -\nCpx 13.6 11.0 19.5 11.2 19.7 8.5 15.6 14.1\nPlag 52.8 48.4 37.1 41.5 31.7 41.4 29.7 50.4\nOx 1.5 3.2 4.0 2.2 3.8 3.7 2.1 1.3\nHbl - - - - - - - -\nBio - - - - - - - -\nGM 28.7 32.1 32.2 35.9 39.0 40.2 47.3 23.3\nG30 G31 G32 G33 G35 G36A G36B G37A\nOl 8.3 - - - 12.2 10.4 7.6 -\nOpx - 3.2 3.1 7.2 - - - 3.1\nCpx 22.4 14.3 14.8 10.5 9.1 19.2 17.1 5.4\nPlag 34.9 35.3 35.3 41.3 34.4 27.7 21.7 31.3\nOx 2.1 3.1 2.8 2.4 1.3 1.4 1.3 1.9\nHbl - - - - - - - -\nBio - - - - - - - -\nGM 32.3 44.1 44.0 38.6 43.0 41.3 52.3 58.3\nG37B G38 G39 G40 G41 G42 G43 G44\nOl - - - - - - - -\nOpx 3.2 6.3 12.4 18.2 10.4 20.2 4.9 10.0\nCpx 7.3 11.0 9.0 10.2 7.3 5.7 17.0 6.1\nPlag 39.5 32.3 45.2 34.1 46.3 39.5 37.3 25.7\nOx 0.9 1.2 2.7 2.7 0.5 1.3 1.2 1.1\nHbl - - - - - - - -\nBio - - - - - - - -\nGM 49.1 49.2 30.7 34.8 35.5 33.3 39.6 57.1\nG45 G46 G47 G48 G49 G50A G51(dark G51(light)\nOl - - - 3.2 - - 3.2 -\nOpx 0.8 0.5 3.1 2.1 4.2 4.9 - 0.5\nCpx 4.2 5.3 3.5 4.8 6.2 2.3 17.1 1.1\nPlag 44.6 38.5 44.2 34.7 42.7 37.4 30.6 11.8\nOx 2.3 3.2 1.6 1.1 3.2 1.2 3.0 0.5\nHbl - - - - - - - -\nBio - - - - - - - -\nGM 48.1 52.5 47.6 54.1 43.7 54.2 46.1 86.1\nG52 G53 G54 G55 G56 G57 G58\nOl - - - 0.5 0.5 - -\nOpx 2.1 3.2 2.1 0.9 6.1 12.1 7.2\nCpx 8.7 6.9 13.4 2.1 3.2 4.0 16.8\nPlag 63 42.6 48.2 17.5 51.7 59.6 45.7\nOx 2 3.1 4.3 2.3 4.1 1.1 1.0\nHbl 0.5 - - - - - -\nBio - - - 0.4 - - -\nGM 23.7 44.2 32.0 76.3 34.4 23.2 29.3\nModal phase volume (%) established from point-counting between 200 and 300 points per\nsample for microphenocrysts (100-300mm) and phenocrysts (>300mm).\nOl, olivine; Opx, orthopyroxene; Cpx, clinopyroxene; Plag, plagioclase; Ox, Fe-Ti oxide;\nHbl, hornblende; Bio, biotite; GM, groundmass.\nSupplementary_Table_1\nClick here to download Electronic supplementary material: Supplementary_Table_1.pdf\nSupplementary Table 2. Representative plagioclase mineral data\nSample G01B G01B G01B G01B G11 G11 G11 G11 G11 G22 G22 G22 G23\nGrain P1 P1 P1 GM P2 P2 P4 P4 P4 P2 P2 P2 P1\nPosition C M R C R C M R C M R\nSiO2 43.43 44.08 44.84 47.03 48.25 47.47 53.68 53.04 54.80 47.25 46.67 48.93 48.31\nTiO2 0.02 0.01 0.02 0.03 0.02 0.02 0.03 0.05 0.03 0.03 0.03 0.03 0.03\nAl2O3 34.45 33.91 33.44 32.29 31.61 31.73 28.40 28.44 27.31 32.13 32.70 31.03 31.77\nCr2O3 0.02 0.01 0.01 0.01 0.00 0.00 0.00 0.00 0.01 0.00 0.01 0.01 0.00\nMgO 0.04 0.04 0.06 0.08 0.10 0.06 0.05 0.06 0.07 0.03 0.04 0.06 0.08\nCaO 19.48 19.36 18.51 17.03 16.74 16.65 12.51 12.74 11.43 16.74 17.29 15.74 16.41\nMnO 0.00 0.00 0.00 0.00 0.00 0.00 0.02 0.00 0.00 0.02 0.00 0.00 0.00\nFeO 0.48 0.42 0.57 0.80 0.73 0.65 0.60 0.59 0.62 0.53 0.47 0.65 0.65\nNiO 0.00 0.02 0.00 0.00 0.00 0.01 0.01 0.00 0.01 0.01 0.00 0.01 0.00\nNa2O 0.73 0.87 1.36 2.12 2.06 2.33 4.44 4.30 4.97 2.30 1.94 2.87 2.56\nK2O 0.01 0.01 0.03 0.06 0.17 0.06 0.27 0.27 0.30 0.08 0.05 0.09 0.05\nTotal 98.65 98.72 98.83 99.44 99.67 98.97 100.01 99.50 99.55 99.12 99.21 99.42 99.87\nSi 8.18 8.29 8.41 8.74 8.92 8.84 9.76 9.70 9.98 8.79 8.68 9.05 8.91\nAl 7.65 7.52 7.40 7.07 6.88 6.96 6.08 6.13 5.86 7.04 7.17 6.76 6.90\nFe(ii) 0.08 0.07 0.09 0.12 0.11 0.10 0.09 0.09 0.09 0.08 0.07 0.10 0.10\nCa 3.93 3.90 3.72 3.39 3.31 3.32 2.44 2.50 2.23 3.34 3.45 3.12 3.24\nNa 0.27 0.32 0.49 0.76 0.74 0.84 1.57 1.52 1.76 0.83 0.70 1.03 0.92\nK 0.00 0.00 0.01 0.01 0.04 0.01 0.06 0.06 0.07 0.02 0.01 0.02 0.01\nMg 0.01 0.01 0.02 0.02 0.03 0.02 0.01 0.02 0.02 0.01 0.01 0.02 0.02\nTotal 20.12 20.11 20.13 20.11 20.03 20.10 20.01 20.02 20.00 20.11 20.09 20.09 20.10\nAn 93.57 92.44 88.17 81.35 80.94 79.51 59.92 61.16 54.99 79.68 82.89 74.80 77.74\nAb 6.37 7.51 11.68 18.33 18.06 20.17 38.52 37.31 43.30 19.85 16.84 24.68 21.95\nOr 0.06 0.05 0.15 0.32 1.00 0.32 1.56 1.53 1.71 0.46 0.27 0.52 0.30\nSample G23 G23 G23 G24 G24 G26 G26 G26 G30 G30 G30 G30 G30\nGrain P3 P4 P4 P1 P1 P1 P1 GM P1 P1 P1 P2 P2\nPosition R C-M R C M C R C M R C R\nSiO2 48.13 47.63 48.86 51.40 50.48 48.73 50.93 52.52 48.48 46.27 49.11 48.38 50.36\nTiO2 0.05 0.03 0.06 0.00 0.04 0.03 0.05 0.05 0.04 0.04 0.04 0.04 0.06\nAl2O3 30.95 31.52 30.80 28.84 28.93 30.76 29.27 28.77 31.45 32.31 30.21 31.15 28.98\nCr2O3 0.01 0.00 0.00 0.00 0.01 0.00 0.01 0.00 0.01 0.00 0.01 0.00 0.02\nMgO 0.10 0.07 0.25 0.08 0.08 0.06 0.05 0.06 0.07 0.07 0.10 0.08 0.08\nCaO 16.00 16.49 15.60 13.08 13.49 15.20 13.77 12.82 16.00 16.53 14.83 15.88 13.71\nMnO 0.00 0.00 0.02 0.00 0.01 0.00 0.01 0.00 0.03 0.02 0.00 0.02 0.00\nFeO 0.73 0.58 0.82 0.59 0.60 0.72 0.95 0.86 0.56 0.52 0.74 0.67 0.90\nNiO 0.00 0.00 0.00 0.00 0.00 0.01 0.00 0.00 0.00 0.01 0.00 0.00 0.02\nNa2O 2.78 2.47 2.81 4.22 3.94 3.18 3.87 4.54 2.77 2.35 3.24 2.64 3.83\nK2O 0.07 0.06 0.17 0.18 0.16 0.10 0.16 0.22 0.12 0.09 0.17 0.12 0.25\nTotal 98.81 98.85 99.38 98.38 97.74 98.77 99.07 99.85 99.50 98.21 98.45 98.98 98.19\nSi 8.97 8.88 9.05 9.53 9.44 9.07 9.41 9.60 8.97 8.70 9.16 8.99 9.40\nAl 6.80 6.92 6.72 6.30 6.38 6.75 6.38 6.20 6.85 7.16 6.64 6.82 6.38\nFe(ii) 0.11 0.09 0.13 0.09 0.09 0.11 0.15 0.13 0.09 0.08 0.12 0.10 0.14\nCa 3.20 3.29 3.10 2.60 2.70 3.03 2.73 2.51 3.17 3.33 2.96 3.16 2.74\nNa 1.01 0.89 1.01 1.52 1.43 1.15 1.39 1.61 0.99 0.86 1.17 0.95 1.38\nK 0.02 0.01 0.04 0.04 0.04 0.02 0.04 0.05 0.03 0.02 0.04 0.03 0.06\nMg 0.03 0.02 0.07 0.02 0.02 0.02 0.01 0.02 0.02 0.02 0.03 0.02 0.02\nTotal 20.13 20.11 20.11 20.10 20.10 #REF! 20.13 #REF! 20.11 20.16 20.12 20.08 20.13\nAn 75.78 78.42 74.66 62.51 64.82 72.14 65.66 60.22 75.64 79.10 70.98 76.35 65.51\nAb 23.85 21.27 24.36 36.46 34.28 27.31 33.42 38.55 23.69 20.39 28.04 22.96 33.08\nOr 0.37 0.31 0.98 1.03 0.90 0.54 0.91 1.23 0.67 0.51 0.98 0.68 1.42\nSample G48 G48 G48 G51 L G51 L G51 L G51 L G51 L G51 L G51 D G51 D G51 D G51 D\nGrain P4 P4 P5 P2 P2 P2 P3 P3 P3 P4 P4 P5 GM\nPosition C R R C M R C M R C R R R\nSiO2 54.41 53.07 51.48 46.37 46.96 51.85 44.98 52.66 56.15 45.11 45.15 44.92 45.31\nTiO2 0.06 0.02 0.00 0.02 0.02 0.03 0.03 0.04 0.04 0.04 0.03 0.03 0.04\nAl2O3 28.24 28.89 30.44 32.13 31.97 29.41 33.52 27.37 26.34 33.66 32.59 33.45 33.61\nCr2O3 0.00 0.00 0.01 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.01 0.00\nMgO 0.06 0.08 0.08 0.04 0.03 0.04 0.03 0.05 0.05 0.06 0.06 0.05 0.05\nCaO 11.94 12.54 14.26 17.19 16.75 13.50 18.69 11.46 10.00 18.61 17.83 18.43 18.55\nMnO 0.00 0.00 0.02 0.00 0.00 0.00 0.00 0.00 0.00 0.01 0.00 0.00 0.02\nFeO 0.76 0.73 0.72 0.42 0.55 0.51 0.63 0.57 0.52 0.54 0.85 0.56 0.66\nNiO 0.00 0.02 0.01 0.00 0.00 0.01 0.00 0.01 0.00 0.01 0.00 0.00 0.00\nNa2O 4.85 4.42 3.65 2.06 2.32 3.99 1.28 4.83 5.78 1.26 1.54 1.31 1.23\nK2O 0.30 0.21 0.12 0.08 0.08 0.20 0.03 0.28 0.43 0.02 0.02 0.02 0.03\nTotal 100.63 99.98 100.79 98.31 98.68 99.54 99.18 97.25 99.32 99.31 98.08 98.78 99.50\nSi 9.83 9.66 9.34 8.71 8.78 9.50 8.41 9.83 10.21 8.42 8.53 8.43 8.44\nAl 6.01 6.20 6.51 7.11 7.04 6.35 7.39 6.02 5.64 7.40 7.26 7.40 7.38\nFe(ii) 0.12 0.11 0.11 0.07 0.09 0.08 0.10 0.09 0.08 0.08 0.13 0.09 0.10\nCa 2.31 2.44 2.77 3.46 3.35 2.65 3.75 2.29 1.95 3.72 3.61 3.70 3.70\nNa 1.70 1.56 1.28 0.75 0.84 1.42 0.46 1.75 2.04 0.46 0.56 0.48 0.44\nK 0.07 0.05 0.03 0.02 0.02 0.05 0.01 0.07 0.10 0.00 0.01 0.00 0.01\nMg 0.02 0.02 0.02 0.01 0.01 0.01 0.01 0.01 0.01 0.02 0.02 0.01 0.01\nTotal 20.04 20.04 20.06 20.12 20.13 20.05 20.12 20.06 20.03 20.10 20.12 20.11 20.09\nAn 56.67 60.34 67.89 81.83 79.60 64.41 88.85 55.83 47.66 89.00 86.42 88.50 89.13\nAb 41.64 38.48 31.41 17.74 19.93 34.45 10.98 42.53 49.88 10.89 13.46 11.38 10.71\nOr 1.68 1.19 0.70 0.43 0.46 1.14 0.18 1.64 2.46 0.10 0.12 0.11 0.16\nGrain: P, phenocryst; GM, groundmass. \nSpot: C, core; M, mid point; R, rim.\nAn, anorthite; Ab, albite; Or, orthoclase.\nStructural formula based on 32 oxygens.\nSupplementary_Table_2\nClick here to download Electronic supplementary material: Supplementary_Table_2.pdf\nSupplementary Table 3. Representative clinopyroxene mineral data\nSample G01B G01B G01B G01B G01B G11 G11 G11 G17 G17 G17 G22 G22\nGrain P2 P2 P3 P3 GM P1 P2 INC (Plag P3) P1 P1 P1 P1 P1\nPosition C R C R C M R C R\nSiO2 50.99 49.97 51.30 50.93 48.84 50.48 50.95 50.78 50.95 50.11 49.59 51.58 50.59\nTiO2 0.51 0.73 0.61 0.67 0.80 0.63 0.58 0.53 0.44 0.64 0.61 0.27 0.55\nAl2O3 2.01 3.04 2.46 2.77 4.03 2.22 2.19 2.43 1.94 2.53 2.83 1.17 2.31\nCr2O3 0.00 0.02 0.00 0.00 0.05 0.00 0.00 0.00 0.00 0.01 0.00 0.00 0.00\nFe2O3 4.56 4.66 3.33 3.72 5.37 3.25 2.51 2.43 3.70 3.78 4.41 3.13 3.71\nFeO 4.38 3.79 5.44 4.82 3.57 10.55 10.60 10.60 7.69 8.35 8.03 7.92 6.52\nMnO 0.26 0.20 0.26 0.24 0.21 0.46 0.45 0.44 0.49 0.42 0.44 0.47 0.35\nMgO 15.84 15.10 15.34 15.23 14.82 13.61 13.50 13.12 13.92 13.97 13.56 14.15 14.44\nCaO 21.39 22.00 21.61 21.88 21.61 18.71 19.23 19.63 20.80 19.48 19.83 21.09 20.89\nNa2O 0.25 0.28 0.25 0.27 0.27 0.36 0.36 0.35 0.36 0.40 0.39 0.28 0.35\nK2O 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00\nNiO 0.02 0.03 0.01 0.00 0.00 0.01 0.00 0.00 0.01 0.02 0.00 0.01 0.00\nTotal 100.20 99.81 100.61 100.54 99.56 100.29 100.37 100.30 100.30 99.70 99.68 100.05 99.71\nSi 1.91 1.88 1.91 1.90 1.85 1.91 1.92 1.92 1.92 1.90 1.89 1.95 1.91\nAl 0.09 0.13 0.11 0.12 0.18 0.10 0.10 0.11 0.09 0.11 0.13 0.05 0.10\nFe(ii) 0.14 0.12 0.17 0.15 0.11 0.33 0.33 0.33 0.24 0.26 0.25 0.25 0.20\nFe(iii) 0.13 0.13 0.09 0.10 0.15 0.09 0.07 0.07 0.10 0.11 0.13 0.09 0.10\nCr 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00\nTi 0.01 0.02 0.02 0.02 0.02 0.02 0.02 0.02 0.01 0.02 0.02 0.01 0.02\nMn 0.01 0.01 0.01 0.01 0.01 0.01 0.01 0.01 0.02 0.01 0.01 0.01 0.01\nMg 0.88 0.85 0.85 0.84 0.83 0.77 0.76 0.74 0.78 0.79 0.77 0.80 0.81\nCa 0.86 0.89 0.86 0.87 0.88 0.76 0.78 0.80 0.84 0.79 0.81 0.85 0.85\nNa 0.02 0.02 0.02 0.02 0.02 0.03 0.03 0.03 0.03 0.03 0.03 0.02 0.03\nTotal 4.04 4.04 4.03 4.03 4.05 4.03 4.02 4.02 4.03 4.03 4.04 4.03 4.03\nWo 42.61 44.59 43.48 44.13 44.23 38.61 39.78 40.76 42.38 40.30 41.04 42.64 42.73\nEn 43.93 42.59 42.96 42.73 42.19 39.10 38.85 37.91 39.46 40.21 39.06 39.80 41.11\nFs 13.46 12.82 13.56 13.14 13.58 22.29 21.37 21.33 18.16 19.49 19.90 17.56 16.16\nSample G17 G17 G17 G23 G23 G23 G23 G23 G23 G26 G26 G26 G30\nGrain P1 P1 P1 P1 P1 P2 P2 P4* P4* P1 P2 P2 P1\nPosition C M R C R C R R C R C\nSiO2 50.95 50.11 49.59 49.88 50.43 50.18 50.25 49.77 49.84 49.31 49.14 49.26 49.52\nTiO2 0.44 0.64 0.61 0.75 0.60 0.67 0.78 0.57 0.73 0.75 0.88 0.65 0.84\nAl2O3 1.94 2.53 2.83 3.53 3.10 2.80 2.71 2.85 3.29 3.33 4.06 3.19 3.42\nCr2O3 0.00 0.01 0.00 0.00 0.00 0.00 0.00 0.01 0.01 0.00 0.00 0.01 0.01\nFe2O3 3.70 3.78 4.41 4.31 4.37 4.26 3.67 2.69 4.92 5.17 4.71 5.19 4.35\nFeO 7.69 8.35 8.03 4.37 4.74 5.81 6.80 7.19 4.70 5.12 5.55 5.76 5.89\nMnO 0.49 0.42 0.44 0.26 0.18 0.34 0.34 0.31 0.29 0.35 0.35 0.39 0.32\nMgO 13.92 13.97 13.56 14.69 15.62 15.30 14.90 14.07 15.03 14.70 14.24 14.96 14.61\nCaO 20.80 19.48 19.83 22.06 20.94 20.22 20.19 20.27 21.18 20.71 20.81 19.70 20.58\nNa2O 0.36 0.40 0.39 0.27 0.26 0.28 0.26 0.31 0.29 0.31 0.34 0.30 0.29\nK2O 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00\nNiO 0.01 0.02 0.00 0.01 0.03 0.00 0.00 0.01 0.00 0.01 0.00 0.02 0.00\nTotal 100.30 99.70 99.68 100.12 100.20 99.81 100.61 98.05 100.26 99.77 100.08 99.44 99.83\nSi 1.92 1.90 1.89 1.87 1.88 1.89 1.89 1.91 1.87 1.87 1.85 1.87 1.87\nAl 0.09 0.11 0.13 0.16 0.14 0.12 0.12 0.13 0.15 0.15 0.18 0.14 0.15\nFe(ii) 0.24 0.26 0.25 0.14 0.15 0.18 0.21 0.23 0.15 0.16 0.17 0.18 0.18\nFe(iii) 0.10 0.11 0.13 0.12 0.12 0.12 0.10 0.08 0.14 0.15 0.13 0.15 0.12\nCr 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00\nTi 0.01 0.02 0.02 0.02 0.02 0.02 0.02 0.02 0.02 0.02 0.02 0.02 0.02\nMn 0.02 0.01 0.01 0.01 0.01 0.01 0.01 0.01 0.01 0.01 0.01 0.01 0.01\nMg 0.78 0.79 0.77 0.82 0.87 0.86 0.84 0.80 0.84 0.83 0.80 0.85 0.82\nCa 0.84 0.79 0.81 0.89 0.84 0.82 0.81 0.83 0.85 0.84 0.84 0.80 0.83\nNa 0.03 0.03 0.03 0.02 0.02 0.02 0.02 0.02 0.02 0.02 0.03 0.02 0.02\nTotal 4.03 4.03 4.04 4.04 4.04 4.04 4.03 4.02 4.04 4.05 4.04 4.05 4.03\nWo 42.38 40.30 41.04 44.94 42.29 41.07 41.19 42.63 42.92 42.29 42.95 40.31 42.22\nEn 39.46 40.21 39.06 41.65 43.88 43.25 42.31 41.18 42.36 41.75 40.90 42.60 41.72\nFs 18.16 19.49 19.90 13.40 13.82 15.68 16.50 16.18 14.72 15.96 16.15 17.09 16.05\nSample G30 G35 G35 G35 G35 G40 G40 G40 G48 G48 G48 G51 L G51 D\nGrain P2 P1 P2 P3 P3 P1 P2 P3 P1 P2 P3 P1 P2\nPosition C C R M\nSiO2 48.03 49.57 49.65 50.38 50.83 49.32 49.84 48.43 51.18 51.27 51.31 50.73 50.97\nTiO2 0.99 0.83 0.97 0.70 0.69 0.53 0.55 0.61 0.67 0.54 0.47 0.49 0.45\nAl2O3 4.99 4.00 3.66 2.80 1.86 2.60 2.38 2.88 2.10 2.73 2.56 1.42 1.92\nCr2O3 0.01 0.01 0.01 0.01 0.00 0.00 0.00 0.02 0.02 0.02 0.00 0.00 0.01\nFe2O3 5.34 4.58 3.95 3.83 3.37 4.68 3.64 5.23 2.86 2.27 2.39 3.71 3.53\nFeO 5.40 4.98 6.30 6.58 6.84 8.29 7.92 8.17 9.74 10.10 10.75 7.82 9.06\nMnO 0.21 0.21 0.31 0.30 0.34 0.44 0.38 0.46 0.47 0.43 0.45 0.42 0.40\nMgO 13.75 14.64 14.41 15.00 15.25 13.37 14.14 13.28 14.30 13.51 13.37 14.20 13.59\nCaO 20.68 21.11 20.41 19.88 20.16 19.66 19.71 19.03 19.30 19.76 19.58 20.45 20.42\nNa2O 0.37 0.37 0.39 0.39 0.26 0.37 0.29 0.38 0.30 0.40 0.36 0.29 0.32\nK2O 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00\nNiO 0.00 0.00 0.00 0.01 0.01 0.00 0.00 0.02 0.02 0.00 0.01 0.02 0.01\nTotal 99.77 100.30 100.05 99.87 99.59 99.25 98.85 98.50 100.94 101.05 101.25 99.53 100.68\nSi 1.82 1.86 1.87 1.90 1.92 1.89 1.91 1.88 1.92 1.92 1.92 1.93 1.92\nAl 0.22 0.18 0.16 0.12 0.08 0.12 0.11 0.13 0.09 0.12 0.11 0.06 0.09\nFe(ii) 0.17 0.15 0.20 0.21 0.21 0.26 0.25 0.26 0.30 0.31 0.33 0.25 0.28\nFe(iii) 0.15 0.13 0.11 0.11 0.09 0.13 0.10 0.15 0.08 0.06 0.07 0.10 0.10\nCr 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00\nTi 0.03 0.02 0.03 0.02 0.02 0.02 0.02 0.02 0.02 0.02 0.01 0.01 0.01\nMn 0.01 0.01 0.01 0.01 0.01 0.01 0.01 0.01 0.01 0.01 0.01 0.01 0.01\nMg 0.78 0.82 0.81 0.84 0.86 0.77 0.81 0.77 0.80 0.75 0.75 0.81 0.76\nCa 0.84 0.85 0.82 0.80 0.81 0.81 0.81 0.79 0.77 0.79 0.79 0.83 0.83\nNa 0.03 0.03 0.03 0.03 0.02 0.03 0.02 0.03 0.02 0.03 0.03 0.02 0.02\nTotal 4.05 4.04 4.03 4.03 4.05 4.04 4.03 4.05 4.04 4.04 4.03 4.03 4.03\nWo 43.22 43.36 42.23 40.79 40.91 40.73 40.76 39.81 39.29 40.89 40.33 41.59 41.57\nEn 40.01 41.86 41.49 42.82 43.04 38.55 40.70 38.67 40.52 38.90 38.32 40.18 38.49\nFs 16.78 14.78 16.28 16.40 16.05 20.71 18.54 21.53 20.20 20.21 21.35 18.23 19.93\nGrain: P, phenocryst; GM, groundmass; INC, inclusion (mineral included within is stated in parentheses);\n*mantling orthopyroxene.\nSpot: C, core; M, mid point; R, rim.\nWo, wollastonite; En, enstatite; Fs, ferrosilite\nStructural formula based on 6 oxygens.\nSupplementary_Table_3\nClick here to download Electronic supplementary material: Supplementary_Table_3.pdf\nSupplementary Table 4. Representative orthopyroxene mineral data\nSample G11 G11 G17 G17 G22 G22 G22 G23 G23 G24 G24 G24 G24\nGrain P1 P2 P1 P2 P1 P2 P3 P1 P1 P1* (cpx P1) P2* (cpx P2) P3 P4\nPosition C C R C R C C\nSiO2 51.99 50.98 51.58 51.87 53.36 52.95 52.34 51.84 52.24 52.88 51.21 52.95 52.21\nTiO2 0.29 0.29 0.27 0.21 0.21 0.17 0.26 0.32 0.26 0.16 0.33 0.23 0.29\nAl2O3 1.33 1.48 1.06 0.93 0.75 0.64 1.30 1.06 0.91 0.73 1.96 0.98 1.90\nCr2O3 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.01 0.00\nFe2O3 1.74 3.13 2.74 2.60 1.90 2.36 1.97 2.38 1.21 2.07 3.74 1.84 2.48\nFeO 21.36 20.73 18.91 18.36 16.85 16.39 17.69 18.39 20.60 18.34 16.28 18.72 16.91\nMnO 0.71 0.66 0.80 0.79 0.52 0.56 0.62 0.65 0.68 0.71 0.63 0.71 0.61\nMgO 21.33 20.98 22.49 23.15 24.95 24.96 23.85 23.07 22.15 23.58 23.66 23.42 24.02\nCaO 1.62 1.74 1.57 1.39 1.62 1.53 1.43 1.52 1.51 1.65 1.78 1.77 1.76\nNa2O 0.05 0.04 0.02 0.00 0.01 0.01 0.04 0.03 0.00 0.04 0.03 0.01 0.02\nK2O 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00\nNiO 0.01 0.00 0.01 0.02 0.00 0.00 0.01 0.00 0.01 0.00 0.00 0.00 0.00\nTotal 100.43 100.04 99.43 99.30 100.17 99.57 99.50 99.27 99.57 100.14 99.61 100.65 100.21\nSi 1.95 1.93 1.94 1.95 1.96 1.96 1.95 1.96 1.91 1.96 1.91 1.96 1.93\nAl 0.06 0.07 0.05 0.04 0.03 0.03 0.06 0.04 0.27 0.03 0.09 0.04 0.08\nFe(ii) 0.67 0.65 0.59 0.57 0.52 0.50 0.55 0.64 0.75 0.57 0.50 0.58 0.52\nFe(iii) 0.05 0.09 0.08 0.07 0.05 0.07 0.05 0.03 0.00 0.06 0.10 0.05 0.07\nCr 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00\nTi 0.01 0.01 0.01 0.01 0.01 0.00 0.01 0.01 0.01 0.00 0.01 0.01 0.01\nMn 0.02 0.02 0.03 0.03 0.02 0.02 0.02 0.02 0.02 0.02 0.02 0.02 0.02\nMg 1.19 1.18 1.26 1.30 1.37 1.38 1.32 1.24 0.90 1.30 1.32 1.29 1.32\nCa 0.07 0.07 0.06 0.06 0.06 0.06 0.06 0.06 0.08 0.07 0.07 0.07 0.07\nNa 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00\nTotal 4.01 4.02 4.02 4.02 4.02 4.02 4.02 4.01 3.95 4.02 4.03 4.01 4.02\nWo 3.27 3.51 3.13 2.76 3.17 3.00 2.84 3.04 3.03 3.25 3.54 3.49 3.49\nEn 59.75 58.74 62.51 64.07 67.85 67.99 66.08 64.11 61.96 64.71 65.32 64.21 66.16\nFs 36.98 37.76 34.36 33.17 28.98 29.00 31.08 32.85 35.00 32.04 31.15 32.30 30.35\nSample G27 G37A G37A G37A G40 G40 G40 G41 G41 G44 G44 G44 G44\nGrain P2 P2 P3 P4 P1 P2 GM P1 P2 P1 P1 INC (CPX) P2\nPosition C-M R\nSiO2 51.62 52.26 52.62 51.87 51.30 51.45 51.14 53.25 52.94 53.60 53.37 53.31 52.78\nTiO2 0.32 0.25 0.28 0.29 0.21 0.18 0.32 0.29 0.36 0.23 0.25 0.29 0.34\nAl2O3 1.49 0.90 1.12 1.68 0.59 0.89 1.06 1.73 1.58 1.40 1.97 1.51 1.12\nCr2O3 0.00 0.00 0.01 0.00 0.00 0.00 0.00 0.01 0.01 0.01 0.00 0.00 0.00\nFe2O3 3.11 2.75 2.23 2.14 3.26 2.62 3.46 1.68 1.48 0.76 1.22 2.12 1.33\nFeO 16.99 17.67 18.39 19.09 17.97 21.13 17.03 16.26 17.73 18.11 16.13 15.22 19.10\nMnO 0.64 0.71 0.70 0.60 0.78 0.85 0.71 0.52 0.59 0.51 0.46 0.50 0.73\nMgO 23.53 23.67 23.44 22.69 22.65 21.03 22.66 25.15 24.02 24.49 25.55 25.89 22.99\nCaO 1.76 1.59 1.61 1.58 1.79 1.57 2.45 1.68 1.81 1.50 1.35 1.59 1.88\nNa2O 0.04 0.02 0.05 0.03 0.02 0.04 0.03 0.04 0.03 0.02 0.04 0.02 0.04\nK2O 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00\nNiO 0.00 0.00 0.00 0.00 0.00 0.00 0.01 0.01 0.02 0.00 0.03 0.02 0.00\nTotal 100.04 99.81 100.46 99.96 99.77 98.88 100.61 100.43 100.04 100.62 100.36 100.48 100.31\nSi 1.93 1.95 1.95 1.94 1.95 1.95 1.94 1.94 1.94 1.96 1.94 1.94 1.96\nAl 0.07 0.04 0.05 0.07 0.03 0.04 0.05 0.07 0.07 0.06 0.08 0.06 0.05\nFe(ii) 0.53 0.55 0.57 0.59 0.57 0.67 0.53 0.49 0.54 0.55 0.49 0.46 0.59\nFe(iii) 0.09 0.08 0.06 0.06 0.09 0.07 0.10 0.05 0.04 0.02 0.03 0.06 0.04\nCr 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00\nTi 0.01 0.01 0.01 0.01 0.01 0.01 0.01 0.01 0.01 0.01 0.01 0.01 0.01\nMn 0.02 0.02 0.02 0.02 0.03 0.03 0.02 0.02 0.02 0.02 0.01 0.02 0.02\nMg 1.31 1.32 1.29 1.26 1.28 1.19 1.28 1.37 1.31 1.33 1.39 1.41 1.27\nCa 0.07 0.06 0.06 0.06 0.07 0.06 0.10 0.07 0.07 0.06 0.05 0.06 0.07\nNa 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00\nTotal 4.02 4.02 4.02 4.02 4.02 4.03 4.01 4.01 4.02 4.01 4.01 4.02 4.01\nWo 3.49 3.14 3.17 3.16 3.57 3.16 4.88 3.30 3.58 2.96 2.66 3.09 3.75\nEn 65.05 64.95 64.43 63.21 62.88 58.85 62.90 68.75 66.15 67.32 70.16 70.21 63.67\nFs 31.46 31.92 32.39 33.63 33.54 38.00 32.22 27.95 30.27 29.72 27.18 26.70 32.58\nSample G48 G48 G48 G48 G49 G49 G49 G49 G49 G49 G49 G51 L G51 L\nGrain P1 P2 P3 P4 GM P1 P2 P2 P3 GLOM GLOM P1 P2\nPosition\nSiO2 52.57 54.04 52.52 53.05 53.11 52.90 52.16 52.42 52.36 52.58 53.26 51.47 51.07\nTiO2 0.28 0.21 0.31 0.29 0.17 0.23 0.09 0.13 0.16 0.11 0.12 0.26 0.37\nAl2O3 1.30 0.62 0.80 0.80 0.41 0.96 0.38 0.43 0.63 0.54 0.54 1.14 0.92\nCr2O3 0.02 0.00 0.02 0.00 0.04 0.00 0.00 0.00 0.00 0.00 0.00 0.01 0.01\nFe2O3 2.05 0.32 1.97 1.01 0.00 0.00 2.09 2.09 1.31 1.26 0.31 2.49 2.06\nFeO 17.48 19.87 19.98 21.15 23.44 23.05 20.77 21.26 21.96 21.86 22.90 21.83 21.41\nMnO 0.60 0.65 0.64 0.74 0.89 0.85 0.97 0.92 0.98 0.91 0.95 0.88 0.79\nMgO 24.00 23.51 22.48 21.88 20.77 20.94 21.94 21.85 21.48 21.66 21.56 20.77 20.51\nCaO 1.53 1.76 1.76 2.02 1.43 1.46 1.13 1.16 1.11 1.10 1.08 1.43 1.95\nNa2O 0.06 0.03 0.03 0.05 0.03 0.01 0.03 0.04 0.02 0.03 0.03 0.04 0.03\nK2O 0.00 0.00 0.00 0.00 0.01 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00\nNiO 0.00 0.01 0.00 0.00 0.01 0.01 0.03 0.00 0.00 0.01 0.00 0.03 0.01\nTotal 99.50 98.56 99.77 98.88 100.61 100.57 100.62 100.30 100.00 100.07 100.74 100.34 99.12\nSi 1.95 1.98 1.96 1.97 1.99 1.98 1.97 1.97 1.97 1.97 1.98 1.95 1.95\nAl 0.06 0.03 0.04 0.04 0.02 0.04 0.02 0.02 0.03 0.02 0.02 0.05 0.04\nFe(ii) 0.54 0.61 0.62 0.65 0.74 0.72 0.65 0.66 0.69 0.68 0.71 0.69 0.68\nFe(iii) 0.06 0.01 0.05 0.03 0.00 0.00 0.06 0.06 0.04 0.04 0.01 0.07 0.06\nCr 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00\nTi 0.01 0.01 0.01 0.01 0.00 0.01 0.00 0.00 0.00 0.00 0.00 0.01 0.01\nMn 0.02 0.02 0.02 0.02 0.03 0.03 0.03 0.03 0.03 0.03 0.03 0.03 0.03\nMg 1.32 1.28 1.25 1.21 1.16 1.17 1.24 1.22 1.20 1.21 1.20 1.17 1.17\nCa 0.06 0.07 0.07 0.08 0.06 0.06 0.05 0.05 0.04 0.04 0.04 0.06 0.08\nNa 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00\nTotal 4.02 4.03 4.02 4.03 4.01 4.01 4.01 4.02 4.01 4.01 4.00 4.02 4.02\nWo 3.04 3.47 3.50 4.01 2.89 2.97 2.26 2.30 2.23 2.21 2.16 2.88 3.97\nEn 66.24 64.50 61.99 60.62 58.57 59.12 61.05 60.49 60.05 60.45 60.11 58.14 58.03\nFs 30.72 32.02 34.51 35.37 38.53 37.91 36.70 37.21 37.72 37.33 37.73 38.98 38.00\nGrain: P, phenocryst; GM, groundmass; INC, inclusion (mineral included within is stated in parentheses);\n*mantled by clinopyroxene; GLOM, glomerocryst.\nSpot: C, core; M, mid point; R, rim.\nWo, wollastonite; En, enstatite; Fs, ferrosilite\nStructural formula based on 6 oxygens.\nSupplementary_Table_4\nClick here to download Electronic supplementary material: Supplementary_Table_4.pdf\nSupplementary Table 5. Olivine mineral data\nSample G01B G01B G01B G01B G23 G26 G26 G26 G26 G26\nGrain P1 P1 P2 P3 P1 P1 P2 P2 P3 P4\nPosition C R C C R C\nSiO2 36.25 36.67 36.72 36.86 36.96 34.87 34.73 35.38 35.65 35.30\nTiO2 0.02 0.02 0.02 0.02 0.02 0.02 0.02 0.03 0.02 0.02\nAl2O3 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00\nCr2O3 0.00 0.00 0.01 0.01 0.00 0.00 0.00 0.00 0.00 0.00\nMgO 36.13 36.15 35.82 36.01 35.29 26.44 27.00 27.12 31.85 27.74\nCaO 0.11 0.13 0.13 0.12 0.14 0.20 0.18 0.17 0.15 0.16\nMnO 0.51 0.50 0.51 0.54 0.54 0.82 0.86 0.86 0.68 0.82\nFeO 26.57 27.06 26.79 26.30 27.54 37.43 37.44 38.15 31.94 36.17\nNiO 0.02 0.01 0.01 0.03 0.00 0.01 0.00 0.01 0.01 0.04\nNa2O 0.02 0.02 0.00 0.02 0.00 0.02 0.00 0.00 0.01 0.00\nK2O 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00\nTotal 99.63 100.56 100.00 99.88 100.50 99.80 100.23 101.71 100.32 100.24\nSi 0.97 0.98 0.98 0.98 0.99 0.99 0.98 0.98 0.98 0.99\nAl 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00\nFe(ii) 0.60 0.60 0.60 0.59 0.61 0.89 0.88 0.89 0.73 0.85\nMn 0.01 0.01 0.01 0.01 0.01 0.02 0.02 0.02 0.02 0.02\nMg 1.45 1.43 1.43 1.43 1.40 1.12 1.14 1.12 1.30 1.16\nCa 0.00 0.00 0.00 0.00 0.00 0.01 0.01 0.01 0.00 0.00\nTotal 3.03 3.03 3.02 3.02 3.02 3.02 3.02 3.02 3.03 3.02\nFo 70.8 70.4 70.5 70.9 69.6 55.7 56.2 55.9 64.0 57.8\nFa 29.2 29.6 29.5 29.1 30.4 44.3 43.8 44.1 36.0 42.2\nSample G26 G30 G30 G35 G35 G35 G51 D S106B S106B S106B\nGrain P4 P1 P2 P1 P2 P3 P1 INC P1 P2\nPosition R M M\nSiO2 34.40 36.02 35.39 34.98 35.69 36.07 37.42 36.27 35.28 35.09\nTiO2 0.04 0.01 0.02 0.02 0.02 0.02 0.03 0.01 0.04 0.02\nAl2O3 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00\nCr2O3 0.02 0.00 0.00 0.00 0.00 0.01 0.01 0.00 0.00 0.00\nMgO 26.80 33.48 30.56 29.75 31.14 32.77 36.18 32.79 28.36 27.32\nCaO 0.19 0.17 0.15 0.21 0.19 0.23 0.14 0.17 0.19 0.19\nMnO 0.86 0.53 0.58 0.67 0.64 0.59 0.42 0.58 0.81 0.82\nFeO 37.26 29.83 32.65 33.88 32.41 30.74 26.38 29.60 35.56 36.65\nNiO 0.01 0.01 0.00 0.02 0.01 0.02 0.01 0.01 0.00 0.01\nNa2O 0.01 0.00 0.03 0.04 0.00 0.01 0.02 0.01 0.02 0.01\nK2O 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00\nTotal 99.59 100.06 99.39 99.58 100.11 100.45 100.61 99.44 100.24 100.10\nSi 0.98 0.98 0.98 0.98 0.98 0.98 0.99 0.99 0.98 0.99\nAl 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00\nFe(ii) 0.89 0.68 0.76 0.79 0.75 0.70 0.58 0.67 0.83 0.86\nMn 0.02 0.01 0.01 0.02 0.01 0.01 0.01 0.01 0.02 0.02\nMg 1.14 1.35 1.26 1.24 1.28 1.33 1.43 1.33 1.18 1.14\nCa 0.01 0.01 0.00 0.01 0.01 0.01 0.00 0.00 0.01 0.01\nTotal 3.03 3.03 3.02 3.03 3.02 3.03 3.01 3.02 3.02 3.02\nFo 56.2 66.7 62.5 61.0 63.1 65.5 71.0 66.39 58.71 57.06\nFa 43.8 33.3 37.5 39.0 36.9 34.5 29.0 33.61 41.29 42.94\nGrain: P, phenocryst; INC, inclusion.\nSpot: C, core; M, mid point; R, rim.\nFo, forsterite; Fa, fayalite\nSupplementary_Table_5\nClick here to download Electronic supplementary material: Supplementary_Table_5.pdf\nSupplementary Table 6. Representative Fe-Ti oxide mineral data\nSample G01B G01B G01B G01B G11 G11 G17 G17 G22 G22 G23 G23 G26\nGrain INC GM P1 P1 P1 P2 INC (OPX) P1 P1 INC (OPX) GM INC (CPX) P1\nPosition C R C\nSiO2 0.03 0.07 0.06 0.05 0.05 0.06 0.06 0.06 0.03 0.05 0.04 0.08 0.07\nTiO2 10.22 10.44 10.51 10.50 12.18 11.34 11.28 12.22 11.80 10.90 8.74 11.55 11.43\nAl2O3 4.63 4.26 4.31 4.25 2.28 2.98 2.48 1.30 2.86 3.10 5.54 4.04 3.90\nCr2O3 0.19 0.09 0.11 0.13 0.09 0.08 0.04 0.09 0.04 0.06 0.08 0.07 0.05\nFe2O3 45.61 44.64 44.48 44.77 43.39 44.12 44.79 43.05 43.44 44.56 47.00 43.28 42.78\nFeO 35.17 35.32 35.40 35.42 38.40 38.10 39.41 40.91 38.98 37.71 33.65 37.10 39.13\nMnO 0.42 0.36 0.31 0.40 0.44 0.44 0.50 0.46 0.48 0.36 0.29 0.36 0.45\nMgO 3.76 3.53 3.61 3.56 2.45 2.24 1.36 0.59 1.91 2.19 3.90 3.19 1.78\nCaO 0.02 0.07 0.00 0.02 0.00 0.01 0.00 0.01 0.00 0.02 0.02 0.12 0.00\nTotal 100.05 98.77 98.79 99.09 99.28 99.37 99.92 98.68 99.54 98.96 99.27 99.79 98.77\nSi 0.01 0.02 0.02 0.01 0.02 0.02 0.02 0.02 0.01 0.02 0.01 0.02 0.02\nTi 2.22 2.30 2.32 2.31 2.72 2.53 2.53 2.80 2.63 2.44 1.91 2.53 2.54\nAl 1.58 1.47 1.49 1.47 0.80 1.04 0.87 0.47 1.00 1.09 1.89 1.39 1.36\nCr 0.04 0.02 0.03 0.03 0.02 0.02 0.01 0.02 0.01 0.02 0.02 0.02 0.01\nFe(iii) 9.92 9.86 9.82 9.86 9.70 9.84 10.03 9.87 9.70 9.98 10.25 9.49 9.51\nFe(ii) 8.50 8.67 8.68 8.67 9.54 9.45 9.81 10.43 9.68 9.39 8.16 9.04 9.67\nMn 0.10 0.09 0.08 0.10 0.11 0.11 0.13 0.12 0.12 0.09 0.07 0.09 0.11\nMg 1.62 1.54 1.58 1.55 1.09 0.99 0.60 0.27 0.85 0.97 1.68 1.39 0.78\nCa 0.01 0.02 0.00 0.01 0.00 0.00 0.00 0.00 0.00 0.01 0.01 0.04 0.00\nTotal 24.00 24.00 24.00 24.00 24.00 24.00 24.00 24.00 24.00 24.00 24.00 24.00 24.00\nTiO2 11.23 11.54 11.62 11.57 12.97 12.12 11.81 12.70 12.52 11.70 9.78 12.56 12.25\nFe2O3 50.12 49.38 49.22 49.37 46.17 47.16 46.91 44.76 46.11 47.82 52.57 47.08 45.83\nFeO 38.65 39.08 39.16 39.06 40.86 40.72 41.28 42.54 41.37 40.48 37.64 40.36 41.92\nSample G30 G30 G30 G35 G35 G40 G44 G44 G48 G49 G51 L G51 D G51 D\nGrain INC (CPX) P1 P1 P1 P2 P1 P1 P2 P1 GLOM P1 P1 P1\nPosition C R C R\nSiO2 0.07 0.07 0.05 0.04 0.04 0.05 0.09 0.07 0.00 0.04 0.03 0.01 0.04\nTiO2 11.72 12.80 12.86 15.23 18.48 12.37 9.83 9.99 0.97 12.27 13.44 12.92 12.86\nAl2O3 5.57 4.76 4.72 0.99 1.39 2.36 4.53 4.36 2.76 0.88 1.52 1.40 1.42\nCr2O3 0.18 0.08 0.09 0.08 0.10 0.07 0.11 0.10 0.09 0.07 0.03 0.07 0.07\nFe2O3 41.65 39.64 39.82 38.32 31.65 42.10 45.33 45.52 64.86 43.94 42.66 43.18 42.64\nFeO 36.34 39.05 39.26 44.05 45.34 40.71 35.64 35.78 27.68 41.00 41.51 40.78 40.50\nMnO 0.38 0.40 0.51 0.40 0.50 0.53 0.37 0.37 0.79 0.46 0.48 0.53 0.54\nMgO 4.08 2.78 2.67 0.57 1.55 0.99 3.10 3.14 2.47 0.63 1.43 1.34 1.32\nCaO 0.00 0.00 0.01 0.00 0.00 0.00 0.00 0.00 0.04 0.01 0.00 0.00 0.04\nTotal 99.97 99.59 99.99 99.99 99.68 99.19 99.00 99.33 99.09 99.29 99.59 99.99 99.68\nSi 0.02 0.02 0.01 0.01 0.01 0.02 0.03 0.02 0.00 0.01 0.01 0.00 0.01\nTi 2.53 2.81 2.81 3.45 4.16 2.80 2.17 2.20 0.22 2.80 2.98 2.90 2.91\nAl 1.88 1.63 1.62 0.35 0.49 0.84 1.57 1.50 0.97 0.32 0.53 0.49 0.50\nCr 0.04 0.02 0.02 0.02 0.02 0.02 0.03 0.02 0.02 0.02 0.01 0.02 0.02\nFe(iii) 8.98 8.69 8.71 8.70 7.14 9.52 10.01 10.03 14.57 10.04 9.47 9.69 9.64\nFe(ii) 8.71 9.52 9.54 11.11 11.36 10.23 8.75 8.76 6.91 10.41 10.24 10.17 10.18\nMn 0.09 0.10 0.12 0.10 0.13 0.13 0.09 0.09 0.20 0.12 0.12 0.13 0.14\nMg 1.74 1.21 1.16 0.26 0.69 0.44 1.36 1.37 1.10 0.29 0.63 0.60 0.59\nCa 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.01 0.00 0.00 0.00 0.01\nTotal 24.00 24.00 24.00 24.00 24.00 24.00 24.00 24.00 24.00 24.00 24.00 24.00 24.00\nTiO2 13.06 13.99 13.99 15.60 19.36 12.99 10.82 10.94 1.04 12.62 13.77 13.33 13.40\nFe2O3 46.43 43.33 43.31 39.27 33.16 44.23 49.92 49.86 69.36 45.20 43.71 44.57 44.41\nFeO 40.51 42.68 42.70 45.13 47.49 42.77 39.25 39.19 29.60 42.18 42.52 42.10 42.19\nGrain: P, phenocryst; GM, groundmass; GLOM, glomerocryst; INC, inclusion (mineral included within is stated in parentheses). \nSpot: C, core; M, mid point; R, rim.\nStructural formula based on 32 oxygens.\nSupplementary_Table_6\nClick here to download Electronic supplementary material: Supplementary_Table_6.pdf\nSupplementary Table 7. Distribution coefficients used in trace element modelling\nOlivine Clinopyroxene Orthopyroxene Plagiocalse Hornblende Fe-Ti oxide\nSr 0.05 0.14 0.05 1.86 0.28 0.11\nBa 0.04 0.04 0.07 0.44 0.24 0.18\nLa 0.034 0.130 0.068 0.183 0.116 0.150\nEu 0.018 0.602 0.180 0.549 0.657 0.182\nYb 0.077 0.661 0.372 0.052 0.816 0.218\nNi 14.14 5.27 9.40 0.40 11.40 22.15\nV 0.11 2.15 1.78 0.14 6.05 26.08\nNb 0.03 0.17 0.35 0.27 0.31 0.84\nData taken from the Geochemical Earth Reference Model (GERM) database:\nhttp:\/\/earthref.org\/GERM\/ for basalts to andesites, except hornblende La, Eu and Yb \nvalues were taken from Bottazzi et al. 1999.\nSupplementary_Table_7\nClick here to download Electronic supplementary material: Supplementary_Table_7.pdf\n"}