{"doi":"10.1016\/j.annals.2008.03.001","coreId":"101656","oai":"oai:epubs.surrey.ac.uk:1084","identifiers":["oai:epubs.surrey.ac.uk:1084","10.1016\/j.annals.2008.03.001"],"title":"Making Sense of Tourism Teaching","authors":["Stergiou, D","Airey, D","Riley, M"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-07","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"PERGAMON-ELSEVIER SCIENCE LTD","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1084<\/identifier><datestamp>\n      2017-10-31T14:00:35Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6172747368756D616E736369656E636573:746F757269736D<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1084\/<\/dc:relation><dc:title>\n        Making Sense of Tourism Teaching<\/dc:title><dc:creator>\n        Stergiou, D<\/dc:creator><dc:creator>\n        Airey, D<\/dc:creator><dc:creator>\n        Riley, M<\/dc:creator><dc:publisher>\n        PERGAMON-ELSEVIER SCIENCE LTD<\/dc:publisher><dc:date>\n        2008-07<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1084\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Stergiou, D, Airey, D and Riley, M  (2008) Making Sense of Tourism Teaching   ANN TOURISM RES, 35 (3).  pp. 631-649.      <\/dc:identifier><dc:relation>\n        10.1016\/j.annals.2008.03.001<\/dc:relation><dc:language>\n        EN<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1084\/","10.1016\/j.annals.2008.03.001"],"year":2008,"topics":[],"subject":["Article","PeerReviewed"],"fullText":" 1 \n \nMAKING SENSE OF TOURISM \nTEACHING \n \nDimitrios Stergiou \nHellenic Open University, Greece \nDavid Airey \nMichael Riley  \nUniversity of Surrey, UK  \n \n \n \n \n \nAbstract: This paper gives details about a study into the evaluation of tourism teaching in \nhigher education.  Although there has been a rapid growth in research into tourism education, \nlittle has focused on teaching or its evaluation.  The work draws on literature from the field of \neducation more generally to arrive at a set of dimensions.  Based on these it explains a study \nconducted in the United Kingdom.  Findings suggest that the important dimensions relate to \nthe extent to which teaching is linked both to the vocational aspects as well as to deeper sets \nof experiences. Keywords: teaching evaluation, tourism education, student survey \n \n \n \n \n \n \n \n \n \n___________________________________________________________________________\nDimitrios Stergiou is Associated Academic at the Hellenic Open University (School of \nSocial Science, Patras 26222, Greece. Email <dstergiou@eap.gr>).  David Airey is Professor \nof Tourism Management and Pro-Vice-Chancellor at the University of Surrey.  Michael \nRiley is Professor of Organizational Behavior in the same institution.  Their combined \nresearch interests include connections between tourism and education, employment, and \naspects of consumer behaviour and management. \n 2 \nINTRODUCTION \nAlthough there has been considerable emphasis in current research on developing a \nsystematic and rigorous body of knowledge about tourism, it is noteworthy that remarkably \nlittle attention has been given to the conduct of teaching itself.  Few researchers have \nparticipated in codifying what we know.  This despite the fact that the activity constitutes an \nintegral part of education.  It is within the context of teaching that the curriculum is \ninterpreted and acted upon and where the link between students and institutions is created and \nprovided.  These fundamental assumptions have led most researchers to subscribe to the \nassertion that research on education depends most heavily on research about teaching for its \nadvancement (Winne and Marx 1977).  This suggests that by ignoring the significant \ncontributions that such knowledge can make to the field, the body of research remains \nincomplete.   \nThis missing element has not gone unnoticed.  For example, in his review of research \ntrends, Tribe observes “How to teach has been overshadowed by what to teach and issues of \neffective teaching and assessment have been overlooked” (2002a:73).  These comments were \nwritten in 2002.  Since then the position has not changed. Of course, this missing element \ncould, to a certain extent, be compensated by drawing on information from the extensive \nliterature that relates to education in general; yet little use has been made of this.  \nThis lack of attention may stem from an instrumentalist view of a fairly straightforward \nprocess of transmitting skills that will equip individuals for effective economic functioning in \nthe industry (Airey 2005).  Indeed, empirical evidence suggests that provision of courses is \nmainly being framed as a vocational one, dominated by business, managerial and \ninstrumental aims (Airey and Johnson 1998, 1999, 2000).  This is not to deny the relevance \nand usefulness of such provision but there are also other angles that deserve attention and can \nstrengthen the provision.    \nThis instrumental view can be summarized as, the transmission of skills in as causally \nefficient and effective a way as possible. This highlights the technical aspects in relation to \nwhich teachers’ capacity for rational deliberation – for conceiving purposes, devising plans, \nor adopting means to ends in the light of knowledge – though important, is nevertheless \nsecondary (Nykiel 1999).  However, teaching involves more than the application of a number \nof practical skills – it also requires a wider range of human qualities and dispositions (Carr \n1994).  It is not just a matter of routine methods but a whole approach in which teachers use \nsubtle styles and approaches to engage with their students. In light of this view, there is also a \n 3 \nteleological dimension to the explanation which does not appear to be entirely eliminable in \nfavor of functionalist accounts.    \nThere is a second related problem. This relates to the fact that current conceptions fail to \nunderstand the educational character of teaching; for whatever else, it is an educative process.  \nCarr has caught the essence of the point made here: \n \n“Education is not merely a matter of ‘delivering’ an optimum curriculum in some \nquasi-technical sense but of the exercise of certain intellectual virtues.  It is a \nshallow and false view of education and teaching which takes it to be a matter of \nthe technical transmission of pre-packaged knowledge and skills in the context of \nefficient management” (1994:49). \n \nA key task of this paper, therefore, is to spell out its features as an educative process.  \nAccordingly, alongside the instrumentalist approach there is what is referred to here as an \neducational approach.  This is important for the future development of tourism both as a \nserious field of scholarly endeavor and for the understanding in practice because without a \nbroad understanding a key dimension is missing.  Over the past few decades, knowledge \nabout tourism has been developed rapidly, notably through the work of social scientists. The \nwork of Cohen (1972), MacCannell (1973, 1976), Smith (1977), Graburn (1983) and Urry \n(1990) in sociology and anthropology, of Butler (1980) and Pearce (1987) from the \ngeographical perspective, Archer (1977) as an economist as well as Tribe (1997) from the \nviewpoint of the field itself has marked the initial contributions to a flow of studies that now \nprovide a strong framework for analyzing and understanding.  In turn, this work has been \nbrought into textbooks (Holden 2005; Tribe and Airey 2007) for ready access to students.  \nThis provides the basis for tourism in the classroom to expand well beyond its vocational \nboundaries.  But, if, in the meantime, in actual activities in the classroom an instrumental and \nbusiness approach remains dominant this can act as a brake on the extent to which this is \nbrought into full effect.  Insufficient interaction between teaching and knowledge sets \nlimitations to the contribution of those who are studying. This is relevant at all levels, from \noperatives to those aiming at the highest positions.  It is also relevant in all contexts. Indeed, \nin parts of the developing world a better understanding of what happens in the classroom \ncould be the key for the better stewardship of the world’s scarce resources.  \nThere are, then, a set of considerations which justify the idea of teaching tourism as \nworthy of attention in its own right.  It poses special problems of its own and it deserves \n 4 \nspecial treatment simply because it is special.  What will be attempted in this paper, therefore, \nis an investigative approach. It is an approach that takes its bearings from a sense of the \ncomplex character of teaching and places it in the center stage.  More specifically, the overall \naim of the paper is to explore the key dimensions on which it can be evaluated and, with \nreference to the views of students, to identify the main factors that are associated with good \nperformance by teachers.  Following an outline of the key dimensions, namely teaching \nability and teacher knowledge, the paper describes the process of a Q-study that generated a \ntotal of 60 statements that provided the basis for a questionnaire survey from which the main \nfactors are identified. \n \nMAKING SENSE OF TEACHING \nThe preceding comments have suggested that there is little sense of educational direction \nin current discussions.  The nature of the evaluation process and the underpinning concepts \nare under-theorized.  For example, a study by Mount and Sciarini (1999) has proposed a set \nof evaluative performance criteria, but with no discernible theoretical underpinning. Against \nthis background the starting point has to be the establishment of an investigative framework.  \nIn the absence of directly related literature this work draws upon studies of teaching in \ngeneral particularly those developed over the past twenty years. This is not to deny the \nrelevance of more contemporary work, rather it points to the need initially to set the study in \nthe context of some of the fundamental thinking developed over the past few years in higher \nas well as other levels of education. This has mainly focused on the study of student ratings \nof instruction, on the ways teachers organize and manage learning activities, and on teacher’s \nown conceptions (Cashin 1995; Centra 1994; Marsh 1987; Ramsden 1991).  There are of \ncourse some important differences between higher and other levels of education, not least in \nthe extent to which they draw on research and new knowledge and in the maturity of the \nparticipants.   However, notwithstanding these differences, the work at other levels provides \nvaluable starting points for understanding.   \nThe development of the framework that follows has its roots in a number of key sources \nincluding Fenstermacher (1986), Shulman (1987), Squires (1999) and Wilson, Shulman and \nRichert (1987), among others. The discussion is structured around the following two \npropositions:  that dimensions should be introduced as evaluative elaborations on the generic \nconcept; that there exists a basic dichotomy in the dimensions on which teachers vary, \ncorresponding generally to their understanding of what is to be taught and how it is to be \ntaught.  \n 5 \nAs far as evaluation is concerned, it is important to distinguish between the generic \nmeaning and its elaborated forms.  In fact, this issue was one of Jackson’s (1986) prime \nconcerns.  He raises the question as to whether it is possible to define teaching in a way that \nspeaks of its true meaning or essence without also becoming entangled in its appraisal. The \nmain point of this analysis is to present an argument regarding the content, character, and \ndimensions.  The question that focuses the argument is one posed by Hirst (1973:5): how do \nwe distinguish it from other activities? The work of Fenstermacher (1986:38) on the different \nmethods for its research provides a helpful way to initiate this analysis.  He sets forth what he \ncalls “The Generic Conditions” as follows: there is a person, P, who possesses some content, \nc, and who intends to convey or impart c to a person, R, who initially lacks c, such that P and \nR engage in a relationship for the purpose of R’s acquiring c.  \nReturning to the original question (how do we distinguish teaching from other activities?), \none answer is that a teacher possesses some knowledge or other content not understood by \nothers and he or she intends to convey this content to them leading to the formation of a \nrelationship for this purpose.  In doing so, the tasks include selecting the content to be \nlearned, adapting the material to the level of the students, helping them to get access to the \ncontent. Therefore, it necessarily begins with understanding of what is to be taught and how it \nis to be taught (Shulman 1987).  It is important to note that learning itself cannot be fully \nattributed to teaching. It also remains the responsibility of the students.     \nThis last point bears a bit more exploration. It could be argued that in order for P to be \nteaching at all, R must acquire what P is teaching.  But this is to confuse the generic \nconditions with what might be called the appraisal conditions.  As Fenstermacher has put it, \n“it makes no more sense to require learning in order to be teaching than it does to require \nwinning in order to be racing, or finding in order to be looking” (1986:38).  Clearly, given its \npurpose there must be a relationship with learning (Squires 1999).  However, it is important \nto remember that learning goes on all the time, whether people are being taught or not.  \nIndeed, there is now widespread evidence that the learning that goes on within the confines of \nformal education is only the visible tip of a much larger iceberg (Brockett and Hiemstra \n1991; Candy 1991).    \nThe characteristics listed above constitute a generic meaning.  It follows that any additions \nto these conditions are elaborations.  There are many forms of such elaboration. So for \nexample, researchers concerned with what might be called the appraisal conditions make \nevaluative elaborations of what is good and what is poor.  The implication here is that the \ngeneric conditions provide a theoretical framework that will allow empirical questions related \n 6 \nto the evaluation to be formulated.   The thrust of the argument here lies in the assumption \nthat an adequate conceptualization needs to be developed before tackling the evaluative \nissues (Squires 1999).    \nHaving established the relationship between the ontology and the evaluation, the focus of \nthe discussion now turns to the two basic questions: What is to be taught?  How is it to be \ntaught?  The first question relates to content. The word “content” is ambiguous.  It can refer \nto everything that the student experiences or it can refer more narrowly to the subject matter \n(Squires 1999).  It is being used in the latter sense here. This follows the thinking of Dunkin \nand Biddle (1974), who suggest that the content ought not be viewed as a context variable, \ncomparable to class size or classroom climate, but should occupy a prominent position.   \nCentral to any discussion of content – the subject matter of a course – is the academic unit \nresponsible.  The thrust of the argument is based on the assumption that a teacher should \npossess a certain minimum facility with, and understanding of, the subject to be taught \n(Wilson et al 1987).  This then raises the question: what is essential for an individual teaching \ntourism?  This inquiry into the nature of knowledge involves some epistemological questions: \nΗow is this organized?  What forms does it take?  What are the sources of information?   \nWhat is important here is that the teacher has special responsibilities in relation to subject-\nknowledge (Smith 1983).  This responsibility places special demands not only on the depth, \nbut also on the understanding of how it should be ordered in ways that will be clear and \naccessible (Shulman 1987).  As noted, the knowledge has developed rapidly over the past few \ndecades to the point where there is no shortage.  The issue is how it is organized and \npresented to make sense in the classroom.  It is obviously here that the need for \nunderstanding comes to the fore.   \nThis analysis opens up the wider discussion concerning methods and techniques.  The \npoint of concern is what is actually meant by a teaching method: a term usually associated \nwith the ways of going about the activity.  It refers to all forms of hardware and software that \nteachers have at their disposal and the methods and techniques for using them (Squires 1999).  \nIt is in this sense that it is possible to speak of methods as procedural, in that a teacher is \nalways concerned with and involved in going about things and doing things. The word \nprocedural is being used here not only to mean identifiable operations but also to capture \nsubtler and less explicit ways, styles and approaches.  As Squires (1999) argues, the point \nabout methods is that they need to be tailored to situations which are not wholly routine. \nThey thus connote not just a particular technique (e.g. group work) but also a whole approach \nand it is in this sense that the term is used here.        \n 7 \nWhile the discussion may seem to have come a long way from the initiation of this \nanalysis, the underlying point is still the same.  The means and forms both structure and color \nperceptions of the whole activity.  A teacher’s understanding of what is to be taught is \nentangled with how they teach it.  This basic split in thinking about the activity was built into \nthe present study in the form of two major dimensions: teacher knowledge and teaching \nability. These provide the basis on which the investigation rests. The importance of this here \nis that to date so little attention has been given to understanding these basic elements. \nWithout a better appreciation, the potential for education to make a full contribution to the \ndevelopment of those who will be taking decisions about the future will be diminished. \n \nStudy Methods \nHaving identified ability and knowledge the starting point was to establish common \ndimensions by which these could be evaluated.  This began with Q-methodology and then \nwent on to use other statistical techniques and ideas, an effort based mainly on Fisher’s ideas \nof correlation.  Now more than half a century old (Stephenson 1953), Q-methodology is \nhardly a new method for conducting research.  Indeed, the literature contains more than 1500 \nbibliographic entries on Q-studies across the social sciences (McKeown and Thomas 1988).  \nNotwithstanding, Q retains a somewhat fugitive status within the larger social scientific \ncommunity.  This can perhaps be explained by noting that whereas most social scientists have \nat least heard of Q-methodology, only a handful have attended seriously to its broader \nmethodological foundations and principles (Brown 1986).   \nQ-methodology provides researchers with a systematic and orderly means for identifying \nthe dimensions of subjective phenomena from the viewpoints and experiences of individuals \n(Stephenson 1953).  It endeavours to convert subjective responses into measurable \ndimensions.  By thus rendering the study of human subjectivity amenable to “objective” \nanalysis, Q represents one of the few efforts to combine the strengths of both quantitative and \nqualitative research paradigms (Sexton, Snyder, Wadsworth, Jardine and Ernest 1998). This \nvery versatile procedure is especially suited to cases where the very existence of concepts has \nnot been established (Ekinci and Riley 2001).  Evaluation of teaching comes into this \ncategory.  There is still very little consensus about what a good teacher is (Squires 1999).     \nQ-methodology holds special promise for those seeking to gain insights into the \ndimensions of subjective phenomena.  This is accomplished by a respondent systematically \nsorting a set of statements that seek to capture the dimensions under investigation according \nto given criteria (normally scales or response categories).  Most Q-samples contain 40 to 60 \n 8 \nsuch statements, but they may number less or more (Brown 1986).  The statements are \nvalidated according to whether the respondents place them in the same categories.  The result \nof a Q-sort, therefore, is a set of statements that have been agreed collectively by a group of \nrespondents.  In this sense, the output of a sample of Q-sort tests should be seen as proof of \nthe existence of a cognitive pattern (Thomas and Baas 1992).  It plays the part of setting up \nempirical approaches so that concepts can be validated.  The resulting statements then \nprovide a basis for further measurement, often by factor analysis.  It should be noted that \nwithout submitting Q-results to further study the technique must be seen only as a \npreliminary methodology (McKeown and Thomas 1988). \nIn effect, two Q-sorts were used for this study: TAQ (Teaching Ability Q-sort), an 80-item \nQ-sort to identify common evaluation dimensions of ability, and TKQ (Teacher Knowledge \nQ-sort), a 60-item sort used to measure perceptions regarding the knowledge base.  The items \nin the sorts were short concise statements culled from existing studies, various books and \nperiodicals, and related to a hidden structure devised from the literature.  For the TAQ, the \nareas of the structure were as follows: concern for students, classroom technique, stimulation, \nand control.  These dimensions of ability were chosen on the basis that they had been \nfrequently used in empirical studies (Sontag 1968; Marsh 1983; Murray 1983).   \nThe study also adopted for testing a list of teacher knowledge dimensions: ways of \nlearning, relation to context of industry, knowledge structure, security of knowledge, \nrelationship to theory, and current versus fundamental knowledge.  This was informed by a \nnumber of key sources on the kinds of knowledge that inform individuals’ expertise (Bruner \n1966; Chi, Glaser and Farr 1988; Daley 1999). It should be noted that following the advice of \nKerlinger (1966) that statements have to be positive in quality because negative items \nintroduce “implicative” bias in the sorting procedure, items that implied a bad teacher were \navoided in both sorts.    \nA total of 31 subjects took part in the tests.  At this stage, the selection procedure of \nsubjects was limited to two criteria; that they were either tourism teachers or students \nregistered on tourism-related programs.  All respondents were based at two major universities \nin the United Kingdom.  Evaluations of activities are much more likely to be insightful if the \nparticipants know what it is all about. Clearly those directly involved understand the basis \nand process of evaluation and need to be equipped to evaluate (Squires 1999).  In this sense, \ngiven the exploratory nature of this research, excluding teachers from the Q-study might have \nled to loss of important insights in the evaluation.  Overall, the sample included 10 teachers, \n14 graduate and 7 doctoral students.   \n 9 \nAs far as the number of participants is concerned, according to Brown (1986) sample sizes \nof the range used here are more than adequate for Q-studies of public opinion.  As a matter of \nfact, the number of participants in the majority of previous Q-studies ranges from 20 to 100 \npeople (Tractinsky and Jarvenpaa 1995).  This preference of Q-researchers to work with \nsmall samples runs counter to conventional wisdom insofar as social scientists tend to regard \nsmall samples with suspicion.  In this connection, it is important to point out that the purpose \nof Q-researchers is to explore the subjective meaning that items have for respondents – a task \nobviously antecedent to ascertaining the numerical incidence and demographic correlates of \nsuch opinions (Brown 1986).   \nTo begin the Q-sorting activity, each subject was presented with two decks of numbered \nstimulus cards.  Subjects were asked to sort the items according to a standard set of \ninstructions.  For the TAQ these boiled down to: please sort the cards on the basis of whether \nthey represent excellence; ordinary competence; or they are not relevant to either.  These \ntypes of response categories were chosen because of Elton’s (1996) work on the distinction \nbetween competence and excellence, which suggests that the first thing to achieve is general \ncompetence.  Subjects were further instructed to sort the items for the TKQ according to \nwhether in their opinion they represent an expert academic; a novice academic; or they are \nnot relevant to either.  In both sorts, the “not relevant to either” option was used because as \nalready indicated the research makes no assumptions about the existence of the dimensions.   \nFor the results, the rules of the procedure followed were that a dimension only exists if at \nleast two statements legitimately describe it and for a statement to be legitimate 60 per cent of \nthe sample must have allocated it to the same category (Hinkin and Schreisheim 1989).  This \npercentage can be seen as similar to a correlation score, which is a major method used for \nassessing the reliability and validity of a scale.  Given the fact that it is very rare to find a 100 \nper cent agreement among the subjects in sorting procedure, such a high value reduces the \nrisk of overlapping statements with other categories (Ekinci and Riley 1999).  At the last \nstage, a minimum of four statements per dimension should be obtained in order to provide \nadequate internal consistency (Hinkin, Tracey and Enz 1997). \nThe output of the Q-sort tests was that of the original 140 statements, 52 (25 for the TAQ \nand 27 for the TKQ) were found to represent the proposed dimensions under the rules.  This \ngives support to the notion that such dimensions exist (Brown 1986).  However, as Ekinci \nand Riley (1999) suggest, the more times a statement goes through a Q-sort test and meets the \nstatistical criteria, the more confidence the researcher can have in its ultimate performance.  \nFor this reason a further Q-sort study with all the qualifying statements and a newly \n 10 \ngenerated 55 statements for the TAQ and 33 for the TKQ was carried out with 30 respondents \n(10 teachers, 20 graduate students).  As a result 35 statements qualified with the same rules \nand these were added to the first bank of statements.   \n \nQuestionnaire Survey \nHaving obtained a sufficient number of statements, the next stage was to transfer a \nselection of accepted statements to a questionnaire for further testing.  In order to ensure \nenough questions to be of value to the research, but not so many as to be off-putting to \nrespondents, 30 statements were selected for each of the TAQ and TKQ dimensions.  For \nthis, all statements that qualified in both rounds of the Q-sorts under the same category were \ntransferred to the questionnaire.  This set of items was then complemented by those \nstatements which achieved the highest degree of consensus in the sample in the second Q-\nstudy.  As a result of this selection process 15 statements each were used to represent \nrespectively excellence and competence.  Similarly, for the TKQ category there were 15 \nstatements for each of the expert and novice categories. \nRespondents were asked to respond to statements from the Q-sort, using semantic \ndifferential for TAQ and a Likert scale for TKQ.  For the purposes of this inquiry the \nsemantic differential operated by putting adjectives of a positive quality at either ends of the \nscale (excellent\/competent).  These were similar to the response categories used in the TAQ \nand in line with the positive nature of the Q-statements.  With respect to teacher knowledge, \nthe Likert scale was designed to measure the extent to which respondents agreed that the \nstatements represented the characteristics of an expert.  In this case, the Likert scale was \npreferred over the semantic differential because the uncertainty about the term “novice \nacademic” in the first round of the TKQ meant that its use at one end of the scale might have \nintroduced response bias in that survey participants could perceive the term as being negative.  \nThe hidden structure identified above was not revealed. \nThe selection of respondents involved a mixture of aspects of convenience and maximum \nvariation sampling.  Convenience sampling is built upon selections which suit the researcher \nand which are available by virtue of their accessibility (Clark, Riley, Wilkie and Wood 1998).  \nThe data were collected at three different institutions, where the researchers had personal \ncontacts who showed interest in the study and facilitated access.  However, subjects were not \ndrawn in the sample simply because they just happened to be available. Rather, the choice of \nsubjects aimed at maximizing the variety of sampled respondents. \n 11 \nThis approach to selecting people or settings purposefully for a study was popularized by \nGlaser and Strauss (1967) and provides a foundation for the distinct approach to sample \ndesign.  This provides the researcher with a method by which the variability characteristic of \nrandom selection can be addressed, while recognizing that the goal of the study is not \ngeneralizability (Maykut and Morehouse 1994).  Indeed, the purpose here was not to build a \nrandom sample, but rather to select settings and persons that the researchers thought \nrepresented the range of experience in the phenomenon under investigation.  Questionnaires \nwere distributed and collected in class from 303 students registered in programs of study at \nthe three different institutions: a university established before the 1992 expansion of the \nuniversity system in the United Kingdom, a university established after 1992, and a \nuniversity college. Both undergraduate and postgraduate courses were represented, the \npopulations of which covered a range of demographic and educational characteristics.     \n \nStudy Results \nAs far as demographic and other information is concerned, almost half of those sampled \n(47.2%) were from the pre-1992 university. Thirty six percent were drawn from the \nparticipating university college and 16.8% from the post-1992 university.  The overwhelming \nmajority were studying on programs with tourism in the title.  In 90% of the cases the word \n“management” also appeared giving an indication that the programmes have an industry \nspecific and employment orientation.  Of the sample population, 76.6% were female, 60.7% \nwere undergraduates and 51.5% had English as their first language.  Almost two thirds were \naged 20-25 years with 17.8% under 20 years and 16.2% over 25 years. Year of study for \nundergraduates was year one, 21.2%, year two 39.7%, year three 34.8% and year four 4.3%.  \nAll students were registered in full-time programs. \nThe initial results of responses to the Q-statements formed the basis for a factor analysis.  \nFor this the data were entered into a statistical analysis program and a reliability analysis \nundertaken.  The Cronbach Alpha value was .896 for the TAQ scale and .870 for TKQ, both \nwell above the .70 level which is considered to be moderate in studies in education and the \nsocial sciences (Nunally 1967).  These show good measures of reliability.  Product moment \ncorrelation coefficients were computed for each data set and the resulting matrices of inter-\nitem correlations were inspected to assess the factorability of the scales.  A matrix that is \nfactorable should include several sizeable correlations.  The expected size depends to some \nextent on sample size, but if no correlation exceeds .30, use of factor analysis is questionable \n 12 \n(Tabachnick and Fidell 1996).  This analysis for both scales revealed numerous inter-item \ncorrelations in excess of .30 and some considerably higher.   \nThe Kaiser-Meyer-Olkin measure of sampling adequacy and Bartlett’s test of sphericity \nwere also used to assess the factorability of the scale.  The current study obtained a sampling \nadequacy measure of the .89 for the TAQ data and of the .854 for TKQ, both of which fall in \nthe “meritorious” category of the .80s (Kaiser 1974).  With respect to Bartlett’s test of \nsphericity, the former obtained a value of 3387.532 and the latter scale a value of 2865.514, \nboth with an associated significance level of .000.  The high values obtained for sampling \nadequacy and the highly significant levels of the test of sphericity provide empirical evidence \nthat the given sets of data are adequate for factor analysis.   \nBoth inter-item correlations matrices were analyzed by the principal factors method and an \northogonal rotation was made.  However, the resulting data suggested that for the TAQ items \nan oblique solution would more nearly satisfy the requirements for simple structure.  If \nsimple structure is present, several variables correlate highly with each factor and only one \nfactor correlates highly with each variable (Thurstone 1947).  In this way, the simplest \npossible interpretation can be achieved.  \nWith a cut off .45 for inclusion of a variable, the analysis of the TAQ data yielded two \nmajor factors with eigenvalues higher than 3.00, which accounted for 39.2% of the total \nvariance, plus four smaller factors (Table 1).  As regards the two major factors, Factor 1 \nincludes items from two dimensions of the TAQ, which seem to reflect the tendency of a \nteacher to be systematic, orderly, and to make things clear.  This factor is provisionally \nnamed “Structural Organization of Knowledge”.  Factor 2 includes items from the concern \nfor students and stimulation dimensions of the TAQ.  The items seem to reflect a teacher’s \nconcerned attitude toward issues related with the intellectual curiosity and development. This \nfactor is provisionally named “Person Oriented Intellectual Reinforcement”. With respect to \nthe four remaining factors, their interpretation was attempted for exploratory purposes.  \nGiven the pioneering nature of this study, it was thought that some interesting findings might \nemerge from this analysis.  However, it should be borne in mind that due to the low \neigenvalues and proportion of variance accounted for by these factors, conclusions about the \ninterpretations should not be drawn too quickly or too easily.  Factor 3 seems to be primarily \nabout communication behavior.  As presented in Table 1, three items loaded on this factor.  \nThese suggest a pattern of behavior in which the teacher assumes the role of encouraging \nstudents, and in which there is little domination.  Perhaps the pattern is best characterized as \n“Supporting Teacher”.  The interpretation of Factor 4 is troublesome.  Its pattern is set by \n 13 \nfour statements which taken together seem to suggest that it is not substantially related to any \nspecific notion of teaching.  For this reason, and because the factor is neither strong nor clear \nin statistical terms, it eludes confident interpretation.   \n \nTable 1.  Teaching Ability – Sorted Factor Loadings \n \n \n \nFactors and their statements \nFactor \nLoadings \nEigenvalue % of \nVariance \nFactor 1: Structural Organization of Knowledge    \nThe teacher announces the objectives of the lecture at the beginning .601 8.042 27.73 \nThe teacher explains to students how their work will be assessed .512   \nThe teacher connects lectures to reading .492   \nFactor 2: Person Oriented Intellectual Reinforcement    \nThe teacher explores with students new approaches and meanings .637 3.328 11.5 \nThe teacher develops students’ capacity to think for themselves .548   \nThe teacher stimulates the intellectual curiosity of students .521   \nFactor 3: Supporting Teacher    \nThe teacher compliments students on their work in front of others .792 1.730 6 \nThe teacher maintains order without apparent effort .482   \nThe teacher commends effort on the part of students .452   \nFactor 4: Indeterminate    \nThe teacher diagnoses students’ misunderstandings and tries to represent the \ninformation in a different way \n \n.540 \n1.433 4.94 \nThe teacher prepares students for employment .508   \nThe teacher brings examples from the field .490   \nThe teacher maintains a friendly atmosphere, but maintains the authority of \nthe teacher \n \n.466 \n  \nFactor 5: Systematic\/Orderly Behavior    \nThe teacher carefully times lectures .707 1.031 3.6 \nThe teacher keeps everything according to schedule .666   \nThe teacher corrects spelling .598   \nThe teacher is consistent in administering discipline .462   \nThe teacher sets up rules of engagement and sticks to them .455   \nFactor 6: Person Oriented Functional Fixity    \nThe teacher gives more support to those students identified as being less able \nto learn independently \n \n.618 \n \n1.002 \n \n3.5 \nThe teacher varies teaching approach according to content .515   \nWhen planning lessons, the teacher takes under consideration students’ prior \nlearning \n \n.494 \n  \n    \n \nThe fifth factor (Factor 5) is perhaps the most interesting finding from the analysis of the \nfour weak factors.  This is because despite its disappointing performance in terms of \neigenvalue (1.031) and accounted percentage of variance (3.60%), the factor loadings of the \nfive items are among the highest. But not only are the loadings surprisingly high, they have \nobvious meaning.  They may all be seen as concomitants of a systematic, orderly, business-\nlike behavior pattern.  Thus, this factor is called “Systematic\/Orderly Behavior”.  Factor 6 is \nthe last factor and accounts for the least of the total variance (3.50%).  These items appear to \ndeal with behaviors that denote a concern for students’ learning and freedom from functional \n 14 \nfixity.  These notions seem to be expressed by the name “Person-oriented Functional \nFlexibility”. \nFactor analysis of the intercorrelations of the teacher knowledge items resulted in the \nextraction of five factors (Table 2).  The first two of these emerged as primary ones, \nappropriating 34.2% of the total variance.  Factor 1 is contributed to by four items, which \nseem to be almost wholly related to the extent to which a teacher updates their knowledge.  \nThis notion seems to be expressed by the name “Up-to-dateness”.  Factor 2 appears to reflect \nthe tendencies to be analytical and knowing where to look for something.  These seem to \nconverge on what may be called “Secure Base of Fundamental Knowledge”. \n \nTable 2.  Teacher Knowledge – Sorted Factor Loadings \n \n \nFactors and their statements \nFactor \nLoadings \nEigenvalue % of \nVariance \nFactor 1: Up-to-Dateness    \nHas main aim of getting up-to-date information out of the journals .677 6.925 23.1 \nHas sufficient confidence in their knowledge to invite and answer questions \nin class \n \n.656 \n  \nReviews and modifies knowledge on the basis of new developments in the \nfield \n \n.628 \n  \nUses examples from the tourism industry 603   \nFactor 2: Secure Base of Fundamental Knowledge    \nReads research reports and more informal studies .629 3.317 11.1 \nIs aware of the key developments in the field .609   \nHas a good knowledge of the sources of information about the industry .568   \nIs able to set and solve problems by applying concepts and techniques .526   \nIs sufficiently confident to discard many of the theories that are fashionable \nat the time \n \n.458 \n  \nFactor 3: Academic Orientation    \nUses alternative representations of subject matter .674 1.689 5.63 \nConstructs subject matter as a web of central interconnected concepts .612   \nUnderstands the limitations of theory .485   \nAppreciates the corrigible and temporary state of knowledge .459   \nFactor 4: Training Orientation    \nEmphasizes that one way is correct .642 1.370 4.6 \nSees the subject matter as existing exclusively in one conceptual framework .571   \nFavors one concept or theory to the exclusion of others .554   \nRelies only on facts .492   \nFactor 5: Indeterminate    \nHas direct experience of the tourism industry .677 1.246 4.2 \nGets to the academic journals on a regular basis .548   \nIs able to explain one idea in many different ways .489   \n \n \nAs regards the three remaining factors, in much the same way as in the case of the TAQ, \ntheir interpretation was pursued for exploratory purposes.  Factor 3 represents a set of deep \napproaches towards the subject matter.  It may be described as “Academic Orientation”.  In \nsome respects, Factor 4 seems to contradict the pattern of Factor 3.  The four items loading \n 15 \non this factor seem to suggest a surface approach towards, and engagement with, the subject \nmatter.  Perhaps this pattern is best characterized as “Training Orientation”.  Factor 5 is the \nlast factor and accounts for the least of the total variance (4.2%).  Unfortunately these items \ndo not seem to be related to any specific notion that would allow interpretation.  The factor is \ntherefore considered to be indeterminate. \n \nCONCLUSION     \nThese results from the student’s responses contain elements that are disappointing and \npredictable but at the same time they also identify some important messages.  The fact that \nthe hidden structure did not emerge more clearly from the fieldwork findings is in some ways \ndisappointing.  This is all the more so in light of the extensive review of the literature and two \nrounds of the Q-sort.  There is an important lesson here that the Q-sort, on its own, can only \nbe a preliminary stage.  It has helped clarify some of the dimensions of the subjective \njudgements, and in this study it is undoubtedly associated with the achievement of the high \nalpha values, but in the end this can only provide the starting point for the fieldwork. \nHowever, notwithstanding the poor fit with the hidden structure, the two dominant \ndimensions for the final results, both for knowledge and ability, do point to some important \ningredients for what makes effective teaching, at least from the perspective of the students.  \nWhat appears to be of key importance, as far as ability is concerned, is the way in which the \nteacher organizes the classes and the ways in which they challenge thinking.  The importance \nof organization behaviour is also highlighted in the pattern of the “Systematic\/Orderly \nBehaviour” factor.  For the dimension relating to knowledge the important issues are being \nup-to-date and confident.  Within these it is worth noting a specific characteristic. Specific \nstatements relating to “new developments in the field”, “examples from the tourist industry”, \n“key developments in the field” and “sources of information about the industry” all point to \nan emphasis on the industry specific aspect of their studies.  There is clearly a recognition by \nstudents of the need for their teachers to be up-to-date.  Many of the findings are not \nparticularly surprising.  It is not unexpected that students rely on the teachers to organize their \nmaterial or look to them to stimulate their thinking.  Nor, for what are mainly designed as \nindustry specific courses, is it in any way odd that they should expect current information \nabout tourism.  However, the statements included in the top two factors for each dimension \nsuggest that the students’ views do extend beyond simple vocationalism.  Statements about \n“connects lectures to reading”, “explores … new approaches and meanings”, “develops … \ncapacity to think for themselves”, “stimulates intellectual curiosity”, “reviews and modifies \n 16 \nknowledge”, “confidence to discard … theories” all suggest a deeper level of understanding.  \nThey are clearly not at university solely for industry specific relevance but are also seeking a \ndeeper set of experiences.   \nThe implications of embracing this wider conception of education and the values which it \npresupposes are considerable.  In particular, there are implications for the content of the \ncurriculum and its organization, for teaching, and for the student experience.  For courses, the \nspace – intellectual and practical – which is called for by the findings of this study, points to \nsignificant levels of autonomy and independence in both thought and action.  This implies an \nethos in which students are encouraged to find their own voices and are invited to claim \nresponsibility for their own learning.  It implies that teachers should not teach that x or y is \nthe case as such, but put it forward as a credible hypothesis for real consent.  This, in turn, \nsuggests that formal didactic teaching should be kept to a minimum, with sessions containing \nreal interaction.  Where lectures have to be given in the traditional form of continuous \nunbroken speech (i.e. due to resource constraints), they should be carefully thought through \nso that they do offer overviews to topics from a critical standpoint, as well as attempting to \nchallenge thinking.        \nThis broader notion of education can also be supported by the use of simulated or actual \nprofessional situations, in which the repertoire of technical knowledge can be extended, as \nwell as by offering opportunities to develop critical skills. But there are also questions to be \nasked of curricula about the extent to which theory and practice are really integrated; the \ndegree to which they are genuinely interdisciplinary, intertwining (as the demands of \nprofessional life in the industry call for) different disciplinary perspectives; and whether there \nare opportunities for the very real value and ethical questions to be explored (to which the \ngraduate or novice professional is going shortly to be exposed) or whether the professional \nrole is simply presented as a technical one, of putting skills and technologies in operation \naccording to a set of well-defined rules (Tribe 2002a, 2002b).  \nIt will be apparent from this discussion that teachers have definite and considerable \nresponsibilities.  In an education for immediate employment or for the transmission of simple \nfacts and truths, the responsibilities of the teacher are definite but limited: on the one hand, to \nbring students to a mastery of identified technical skills and, on the other hand, to enable \nthem to live comfortably in disciplinary territories.  In an education for life, the \nresponsibilities are expanded. In essence, it is that of turning a cohort of students into a \nlearning community, by stimulating their intellectual abilities (person oriented intellectual \nreinforcement) and encouraging them to claim their independence and develop their critical \n 17 \nconsciousness.  In so doing, the teacher has to establish some sense of where the learning is \ngoing, in terms of outcomes and priorities (structural organization of knowledge). They also \nhave special responsibilities to be fully on the inside of their disciplinary calling: they should \nhave a secure base of fundamental knowledge but also keep current with information about \ntourism (up-to-dateness).       \nIn many ways the development of knowledge over the past few decades, particularly by \nsocial scientists, combined with the practical elements of tourism put the subject in an \nexcellent position to provide a strong and demanding education. The important questions now \nare the extent to which those involved in the classroom engage the students not only in \nunderstanding the theoretical and explanatory frameworks that have been developed but also \nget them to challenge them, to consider them in practical settings and at the fullest extent to \nrevise or even overturn them.  The classroom and what goes on in the classroom is vital in \nthis. The significance of this for the work of social scientists is considerable. The \ndevelopment of knowledge, from a social science perspective, has been great, but its full \neffect for the next generation of scholars and practitioners is sadly diminished if it is not \nbrought effectively into the classroom. The role of the teacher here is paramount not only in \nunderstanding but also in having the ability to communicate in ways that extend \nunderstanding. \nTo put it sharply, being a teacher of the kind envisaged here is a complicated matter.  It \nentails engaging in a set of transactions with, and encouraging development in, a group of \nstudents, that will enable them to find their own voices, to become more fully themselves, \nand to develop within frameworks of understanding made available to them that extend \nbeyond the business aspects.  It would be wrong to infer from this that higher education \nshould be dismissive about its vocational elements or the teaching of skills and development \nof capabilities in response to individual and social requirements in pursuit of learning and \nknowledge for work effectiveness. Nor is it suggested that business approaches are \ninappropriate or that they cannot exist alongside more philosophical, creative or abstract \nroles.  The important point is that these should not be the totality of its responsibilities or \ncommitments.   \n \n \n \n \n \n 18 \nREFERENCES \nAirey, D.  \n2005 Tourism Education: From Practice to Theory.  In The Role of Education in Quality \nDestination Management, Proceedings of the WTO Education Council Conference, pp. \n9-16.  Madrid: World Tourism Organization. \nAirey, D., and S. Johnson  \n1998 The Profile of Tourism Studies Degree Courses in the UK: 1997\/98. London: \nNational Liaison Group. \n1999 The Content of Tourism Degree Courses in the UK. Tourism Management 20:229-\n235. \n2000 Tourism Degree and Postgraduate Level Courses in the UK – Dimensions \nCharacteristics and Content.  London: Unpublished Report to the British Travel \nEducational Trust, 47 pages. \nArcher, B.  \n1977 Tourism Multipliers: The State of the Art.  Cardiff: University of Wales Press. \nBarnett, R.  \n1990 The Idea of Higher Education.  Buckingham: Open University Press. \nBrockett, R., and R. Hiemstra  \n1991 Self-direction in Adult Learning: Perspectives on Theory, Research and Practice.  \nLondon: Routledge. \nBrown, S. \n1986 Q Technique and Method: Principles and Procedures.  In Advances and Applications \nin Research Methods, W. Berry and M. Lewis-Beck, eds., pp. 57-76.  London: Sage.. \nBruner, J.  \n1966 Toward a Theory of Instruction.  London: Oxford University Press. \nButler, R.  \n1980 The Concept of a Tourist Area Life Cycle of Evolution: Implications for \nManagement and Resources.  Canadian Geographer 24:5-12. \nCandy, P.  \n1991 Self-direction for Lifelong Learning: A Comprehensive Guide to Theory and \nPractice.  San Francisco: Jossey Bass. \nCarr, D.  \n1994 Educational Enquiry and Professional Knowledge: Towards a Copernican \nRevolution.  Educational Studies 20(1):33-54. \n 19 \nCashin, W. \n1995 Student Ratings of Teaching: The Research Revisited. IDEA paper No 32.  \nManhattan: Center for Faculty Evaluation and Faculty Development, Kansas State \nUniversity. \nCentra, J.  \n1994 The Use of the Teaching Portfolio and Student Evaluations for Summative \nEvaluation.  Journal of Higher Education 65:555-570. \nChi, M., R. Glaser, and M. Farr  \n1988 The Nature of Expertise.  Hove: Lawrence Erlbaum. \nClark, M., M. Riley, E. Wilkie, and R. Wood  \n1998 Researching and Writing Dissertations in Hospitality and Tourism.  London: \nInternational Thomson Business Press. \nCohen, E.  \n1972 Toward a Sociology of International Tourism.  Social Research 39:164-182. \nDaley, B.  \n1999 Novice to Expert: An Exploration of How Professionals Learn. Adult Education \nQuarterly 49(4):133-147. \nDunkin, M., and B. Biddle  \n1974 The Study of Teaching.  New York: Holt, Rinehart and Winston. \nEkinci, Y., and M. Riley \n2001Validating Quality Dimensions.  Annals of Tourism Research 28:202-223. \nElton, L.  \n1996 Criteria for Teaching Competence and Teaching Excellence in Higher Education.  In \nEvaluating Teaching Quality in Higher Education, R. Aylett and K. Gregory, eds., pp. \n33-41.  London: Falmer Press. \nFenstermacher, G. \n1986 Philosophy of Research on Teaching: Three Aspects.  In Handbook of Research on \nTeaching (3rd edition), M. Wittrock, ed., pp. 37-49.  New York: Macmillan. \nGlaser, B., and A. Strauss \n1967 The Discovery of Grounded Theory: Strategies for Qualitative Research.  Chicago: \nAldine. \nGraburn, N. \n1983 The Anthropology of Tourism.  Annals of Tourism Research 10:9-33. \nHinkin, T., and C. Schriesheim \n 20 \n1989 Development and Application of New Scales to Measure the French and Raven \n(1959) Bases of Social Power.  Journal of Applied Psychology 74:561-567. \nHinkin, T., Tracey, J., and C. Enz \n1997 Scale Construction: Developing Reliable and Valid Measurement Instruments.  \nJournal of Hospitality and Tourism Research 21(1):100-121. \nHirst, P. \n1973 What is Teaching? In The Philosophy of Education, R. Peters, ed., pp. 163-177.  \nOxford: Oxford University Press. \nHolden, A. \n2005 Tourism Studies and the Social Sciences.  London: Routledge. \nJackson, P.  \n1986 The Practice of Teaching.  New York: Teachers College Press. \nKaiser, H.  \n1974 An Index of Factorial Simplicity.  Psychometrika 39:31-36. \nKerlinger, F. \n1966 Attitudes Toward Education and Perceptions of Teacher Characteristics: A Q-study.  \nAmerican Educational Research Journal 3:159-168. \n1992 Foundations of Behavioural Research (3rd ed.).  New York: Holt, Rhinehart and \nWinston. \nMacCannell, D.  \n1973 Staged Authenticity: Arrangements of Social Place in Tourist Setting.  American \nJournal of Sociology 79:586-603. \n1976 The Tourist.  London: Macmillan. \nMarsh, H. \n1983 Multidimensional Ratings of Teaching Effectiveness by Students from Different \nAcademic Settings and Their Relation to Student\/Course\/Instructor Characteristics.  \nJournal of Educational Psychology 75:150-166. \n1987 Students’ Evaluation of University Teaching: Research Findings, Methodological \nIssues, and Directions for Future Research.  International Journal of Educational \nResearch 11:253-338. \nMaykut, P., and R. Morehouse \n1994 Beginning Qualitative Research: A Philosophic and Practical Guide.  London: \nFalmer Press. \nMcKeown, B., and D. Thomas \n 21 \n1988 Q-Methodology.  Newbury Park: Sage.  \nMount, D., and M. Sciarini  \n1999 IPI and DSE: Enhancing the Usefulness of Student Evaluation of Teaching Data.  \nJournal of Hospitality and Tourism Education 10(4):8-13. \nMurray, H. \n1983 Low-inference Classroom Teaching Behaviours and Student Ratings of College \nTeaching Effectiveness.  Journal of Educational Psychology 75(1):138-149. \nNunally, J. \n    1967 Psychometric Theory. New York: McGraw-Hill. \nNykiel, R. \n1999 Effective Teaching Techniques for Alternative Delivery Programmes.  Journal of \nHospitality and Tourism Education 11(1):8-11. \nPearce, D.  \n1987 Tourism Today: A Geographical Analysis.  Harlow: Longman. \nRamsden, P. \n1991 A Performance Indicator of Teaching Quality in Higher Education: The Course \nExperience Questionnaire.  Studies in Higher Education 16:129-150. \nSexton, D., Snyder, P., Wadsworth, D. Jardine, A., and J. Ernest \n1998 Applying Q Methodology to Investigations of Subjective Judgements of Early \nIntervention Effectiveness. Topics in Early Childhood Special Education 18(2):95-107. \nShulman, L. \n1987 Knowledge and Teaching: Foundations of the New Reform.  Harvard Educational \nReview 57(1):1-22. \nSmith, B. \n1983 Some Comments on Educational Research in the Twentieth Century.  Elementary \nSchool Journal 83:488-492. \nSmith, V.  \n1977 Hosts and Guests: The Anthropology of Tourism. Philadelphia: University of \nPennsylvania Press \nSontag, M.  \n1968 Attitudes Toward Education and Perception of Teacher Behaviors.  American \nEducational Research Journal 5:385-402. \nSquires, G.  \n1999 Teaching as a Professional Discipline.  London: Falmer Press. \n 22 \nStephenson, W.  \n1953 The Study of Behaviour: Q-technique and its Methodology.  Chicago: University of \nChicago Press. \nTabachnick, B., and L. Fidell \n1996 Using Multivariate Statistics (third edition).  New York: Harper Collins. \nThomas, D., and L. Baas \n1992 The Issue of Generalization in Q-Methodology: Reliable Schematics Revisited. \nOperand Subjectivity 16(1):18-36.  \nThurstone, L. \n1947 Multiple-factor Analysis.  Chicago: University of Chicago Press. \nTractinsky, N., and S. Jarvenpaa \n1995  Information Systems Design Decisions in a Global Versus Domestic Context.  \nManagement Information Systems Quarterly 19:507-534. \nTribe, J.  \n1997 The Indiscipline of Tourism.  Annals of Tourism Research 24:628-657. \n2000 Balancing the Vocational: The Theory and Practice of Liberal Education in Tourism. \nTourism and Hospitality Research 2(1):9-25. \n2002a Research Trends and Imperatives in Tourism Education.  Acta Turistica 14(1):61-\n81. \n2002b The Philosophic Practitioner: A Curriculum for Tourism Stewardship.  Annals of \nTourism Research 29:338-357. \nTribe, J., and D. Airey \n2007  Developments in Tourism Research.  Oxford: Elsevier.  \nUrry, J.  \n1990 The Tourist Gaze.  London: Sage. \nWilson, S., Shulman, L., and A. Richert \n1987 “150 Different Ways of Knowing”: Representations of Knowledge in Teaching.  In \nExploring Teachers’ Thinking, J. Calderhead, ed., pp. 104-124.  London: Cassell. \nWinne, P., and R. Marx \n1977  Reconceptualising Research on Teaching.  Journal of Educational Psychology \n69:668-678. \n \n \n"}