{"doi":"10.1016\/j.bios.2007.04.020","coreId":"140720","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/3193","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/3193","10.1016\/j.bios.2007.04.020"],"title":"The study of genomic DNA adsorption and subsequent interactions using total\ninternal reflection ellipsometry.","authors":["Nabok, Alexei","Tsargorodskaya, Anna","Davis, Frank","Higson, Seamus P. J."],"enrichments":{"references":[{"id":37944357,"title":"Ellipsometry and Polarized Light; North-Holland Personal Library.","authors":[],"date":"2004","doi":null,"raw":"Arwin, H., Poksinski, M., Iohansen, K. 2004,Appl. Optics, 43, 3028-3036. Azzam R.M.A. and Bashara N.M., 1987, Ellipsometry and Polarized Light; North-Holland Personal Library.","cites":null},{"id":37944358,"title":"Thin Solid Films,","authors":[],"date":"1994","doi":null,"raw":"Suh, J., Paik, H., Hwang, B.K., 1994, Bioorg Chem 22, 318-327, Sukhorukov. G., Mohwald, H., Decher, G., Lvov, Y.M., 1996, Thin Solid Films, 284-285, 220-223.","cites":null},{"id":37944362,"title":"Zhou; Li Qun Huang; Sam Fong Yau Li.,","authors":[],"date":"2000","doi":"10.1039\/b001737j","raw":"Xi Chun Zhou; Li Qun Huang; Sam Fong Yau Li., 2000, Biosens. Bioelec, 16, 85-95.1314","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-10-31T00:00:00Z","abstract":"The adsorption of genomic DNA and subsequent interactions between adsorbed and\nsolvated DNA was studied using a novel sensitive optical method of total\ninternal reflection ellipsometry (TIRE), which combines spectroscopic\nellipsometry with surface plasmon resonance (SPR). Single strands of DNA of two\nspecies of fish (herring and salmon) were electrostatically adsorbed on top of\npolyethylenimine films deposited upon gold coated glass slides. The\nellipsometric spectra were recorded and data fitting utilized to extract optical\nparameters (thickness and refractive index) of adsorbed DNA layers. The further\nadsorption of single stranded DNA from an identical source, i.e. herring ss-DNA\non herring ss-DNA or salmon ss-DNA on salmon ss-DNA, on the surface was observed\nto give rise to substantial film thickness increases at the surface of about\n20–21 nm. Conversely adsorption of DNA from alternate species, i.e. salmon ss-\nDNA on herring ss-DNA or herring ss-DNA on salmon ss-DNA, yielded much smaller\nchanges in thickness of 3–5 nm. AFM studies of the surface roughness of adsorbed\nlayers were in line with the TIRE ","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140720.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.bios.2007.04.020","pdfHashValue":"32be8ba695e04e5ac9aa647677c1c6a4e5bd5b23","publisher":"Elsevier Science B.V., Amsterdam.","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/3193<\/identifier><datestamp>2011-10-13T11:55:32Z<\/datestamp><setSpec>hdl_1826_8<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>The study of genomic DNA adsorption and subsequent interactions using total\ninternal reflection ellipsometry.<\/dc:title><dc:creator>Nabok, Alexei<\/dc:creator><dc:creator>Tsargorodskaya, Anna<\/dc:creator><dc:creator>Davis, Frank<\/dc:creator><dc:creator>Higson, Seamus P. J.<\/dc:creator><dc:subject>Total internal reflection ellipsometry<\/dc:subject><dc:subject>Biosensor<\/dc:subject><dc:subject>DNA<\/dc:subject><dc:subject>Polyelectrolyte self-assembly<\/dc:subject><dc:description>The adsorption of genomic DNA and subsequent interactions between adsorbed and\nsolvated DNA was studied using a novel sensitive optical method of total\ninternal reflection ellipsometry (TIRE), which combines spectroscopic\nellipsometry with surface plasmon resonance (SPR). Single strands of DNA of two\nspecies of fish (herring and salmon) were electrostatically adsorbed on top of\npolyethylenimine films deposited upon gold coated glass slides. The\nellipsometric spectra were recorded and data fitting utilized to extract optical\nparameters (thickness and refractive index) of adsorbed DNA layers. The further\nadsorption of single stranded DNA from an identical source, i.e. herring ss-DNA\non herring ss-DNA or salmon ss-DNA on salmon ss-DNA, on the surface was observed\nto give rise to substantial film thickness increases at the surface of about\n20–21 nm. Conversely adsorption of DNA from alternate species, i.e. salmon ss-\nDNA on herring ss-DNA or herring ss-DNA on salmon ss-DNA, yielded much smaller\nchanges in thickness of 3–5 nm. AFM studies of the surface roughness of adsorbed\nlayers were in line with the TIRE d<\/dc:description><dc:publisher>Elsevier Science B.V., Amsterdam.<\/dc:publisher><dc:date>2011-10-11T07:34:17Z<\/dc:date><dc:date>2011-10-11T07:34:17Z<\/dc:date><dc:date>2007-10-31T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>Alexei Nabok, Anna Tsargorodskaya, Frank Davis, Seamus P.J. Higson, The study of genomic DNA adsorption and subsequent interactions using total internal reflection ellipsometry, Biosensors and Bioelectronics, Volume 23, Issue 3, 31 October 2007, Pages 377-383<\/dc:identifier><dc:identifier>0956-5663<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.bios.2007.04.020<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/3193<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0956-5663","0956-5663"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["Total internal reflection ellipsometry","Biosensor","DNA","Polyelectrolyte self-assembly"],"subject":["Article"],"fullText":"1Biosensors and Bioelectronics, Volume 23, Issue 3, 31 October 2007, Pages 377-383\nThe study of genomic DNA adsorption and subsequent interactions using Total Internal\nReflection Ellipsometry\nAlexei Nabok+ , Anna Tsargorodskaya+, Frank Davis++, Séamus P.J. Higson++ *\n+ Sheffield Hallam University, Materials and Engineering Research Institute, Sheffield, S1 1WB, U.K.\n++ Cranfield Health, Cranfield University, Silsoe, MK45 4DT, U.K.\n* Correspondence should be addressed to s.p.j.higson@cranfield.ac.uk.\nThe adsorption of genomic DNA and subsequent interactions between adsorbed and solvated DNA was\nstudied using a novel sensitive optical method of total internal reflection ellipsometry (TIRE), which\ncombines spectroscopic ellipsometry with surface plasmon resonance (SPR). Single strands of DNA of\ntwo species of fish (herring and salmon) were electrostatically adsorbed on top of polyethylenimine\nfilms deposited upon gold coated glass slides. The ellipsometric spectra were recorded and data fitting\nutilized to extract optical parameters (thickness and refractive index) of adsorbed DNA layers. The\nfurther adsorption of single stranded DNA from an identical source, i.e. herring ss-DNA on herring ss-\nDNA or salmon ss-DNA on salmon ss-DNA, on the surface was observed to give rise to substantial film\nthickness increases at the surface of about 20-21 nm. Conversely adsorption of DNA from alternate\nspecies, i.e. salmon ss-DNA on herring ss-DNA or herring ss-DNA on salmon ss-DNA, yielded much\nsmaller changes in thickness of 3-5 nm. AFM studies of the surface roughness of adsorbed layers were\nin line with the TIRE data.\n21. Introduction\nDespite great recent progress in DNA analytical technology, that has become routine in a number\nof different fields, such as medicine, agriculture, food industry and forensic science, there is still a great\ndemand that needs to be met for simple portable analytical tools for DNA characterization. Biosensing\napproaches for DNA analysis could offer a cost-effective alternative to expensive contemporary\nmethods requiring the use of enzyme, fluorescent or radioisotope labels (Downs 1991). DNA biosensors\nare based on the concept of sequence-specific hybridization between nucleic acids in solution - and\nthose immobilized on solid substrates (Ausubel et al 1993). For example, a number of DNA sensors\nexploiting immobilization of nucleic acids on conjugated polymers and different transducing techniques\nwere reported (Korri-Youssufi et al 1997, Kumbupu-Kalemba and Leclerc 2000, Leclerc 1999,\nMcQuade et al 2000).\nThe method of electrostatic layer-by-layer adsorption of DNA, which was first reported in the\nearly 1990's (Lvov et al 1993, Sukhorukov et al 1996) has later become widely used in DNA sensors for\nimmobilization of oligonucleotides (Xi et al 2000, Bjork et al 2005, Travas-Sejdic et al 2005) and\nwhole DNA molecules (Cardenas et al 2003, Sato et al 2005). The concept of using a single strand DNA\nimmobilized on solid support for further hybridization with its counterpart in the solution and the\nsubsequent formation of DNA double helices on the surface has been exploited previously (Nicollini et\nal 1997, Mascini et al 2001, Lemeshko et al 2001), although the formation of the ideal DNA double\nhelix is not obvious because of a limited mobility of the adsorbed single strand DNA.\nMost of the work reported earlier has utilized short DNA fragments, usually containing <50\nbases and of perfectly matched or a few base pair mismatched sequences, although cDNA arrays often\nuse DNA of similar lengths for detection. Our work however has tended towards the use of genomic\nDNA rather than specific sequences since that is the form in which DNA naturally occurs. Genomic\nDNA can be easily denatured to form single-stranded DNA by heating, however upon cooling,\nhybridisation back to the double-stranded form is a complex procedure. This is probably because\ngenomic DNA contains a wide variety of individual chains with different lengths and sequences and the\nstatistical probability of two complementary chains meeting and hybridizing is very low. Even when\nDNA from a single species is allowed to reassociate, measurements have showed that the nucleotide\npairing is imprecise (Britten and Kohne 1968). The extent of reassociation between DNA of different\nspecies has also been studied and shown to be a measure of the relationship between the species (Martin\nand Hoyer 1966).\n3This led us to attempt to determine whether adsorbed genomic DNA would display increased\ninteractions with genomic DNA from the same species compared to DNA from a different species.\nAlthough it is very unlikely that we would see complete hybridization due to the reasons given above, it\nwas thought that there may still be more interaction between two samples of single stranded DNA of\nsimilar composition than two samples from different species (Martin and Hoyer 1966). This could\npotentially lead to a simple DNA sensor capable of quickly and inexpensively determining the identity\nof components in, for example, foodstuffs and\/or fabrics made from natural materials.\nIn a previous publication by ourselves (Davis et al 2005), a layer of single stranded DNA was\nelectrostatically adsorbed on different surfaces for use as a recognition template in electrochemical DNA\nsensors. An optical method of conventional external reflection ellipsometry was also deployed in this\nwork as a second and complementary technique to monitor DNA interactions. The above\nelectrochemical and ellipsometry measurements have resulted in clear differentiation of DNA in two\nspecies of fish: herring and salmon (Davis et al 2005). Response times were of the order of 10-60\nminutes, depending on concentration, for the electrochemical measurements. The limit of detection was\n0.01 mg\/ml, which is much less sensitive than reported for many other authors. However they were\noften utilizing relatively short DNA strands of a single sequence rather than genomic DNA. When we\nutilized single gene DNA in our work (Davis et al 2007), sensitivity was greatly increased, capable of\ndetection of levels of DNA down to 1fg\/ml. This compares favourably with many other techniques\nalthough lower levels of DNA have been detected by utilising electroactive species which bind strongly\nto double stranded DNA, enabling detection of 10-19 moles of oligonucleotide (Park and Hahn 2004). An\nenzyme-catalysed metallization process may also be used to electrochemically detect hybridisation of as\nlittle as 10-20 moles of an oligonucleotide (Hwang et al 2005).\nIn the present work, a detailed study of DNA electrostatic immobilization and further DNA\ninteractions was carried out using an advanced optical technique of total internal reflection ellipsometry\n(TIRE), as well as via direct observation of absorbed DNA layers with atomic force microscopy (AFM).\nThe sensitivity of TIRE is approximately ten times greater than that of conventional ERE (Nabok et al\n2007, Nabok and Tsargorodskaya 2007), potentially making small changes in film thickness and\nmorphology much easier to detect. Our previous papers (Davis et al 2005, 2007) concentrated mainly on\nthe electrochemical responses and the sensitivity and specificity of the DNA recognition. The work\npresented in this paper is intended more as a study of the nature of the adsorbed layers and the kinetics\nof binding rather than development of a detection method, in an attempt to determine the behaviour of\nthe DNA strands and the morphology of the films formed. To our knowledge this is the first time that\n4this technique has been applied to the study of DNA adsorption at surfaces, allowing details of the\nadsorption kinetics and film morphology to be determined.\n2. Experimental.\n2.1 Total Internal Reflection Ellipsometry.\nThe method of Total Internal Reflection Ellipsometry (TIRE) (Posinski et al 2004, Arwin et al 2004)\nwas exploited in this work to study the adsorption and hybridization of DNA molecules. This method\ncombines the spectroscopic ellipsometry platform with the Kretchmann SPR geometry of coupling the\nbeam through the prism to the thin film of metal (gold). The experimental set-up is described in detail\nwithin the supplementary information. The details of ellipsometry data fitting are given in the\nsupplementary information.\nAll TIRE measurements were performed on samples immersed into the same phosphate buffer\nsolution (pH 7). In addition to that, kinetic TIRE measurements were carried out by recording () and\n() spectra after a certain time interval typically of 20-30 seconds in the course of DNA adsorption\n(where  is the amplitude (A) ratio sp AA \/)tan(  and  the phase shift sp   between p- and\ns- components of polarized light of wavelength ). In these measurements, fitting was not performed\nbecause of possible interference due to changes of the refractive index of DNA solutions during the\ncourse of the experiment. Fitting was only performed before and after kinetic experiments were\ncomplete and whilst the cell is filled with phosphate buffer only. Kinetic curves were obtained by\nselecting  or\/and  data points at a certain wavelength () from a massive ,  (, t) file and plotting\nrespective time dependencies (t), (t). The shape (raising or decaying) of (t), (t) curves depends on\nthe wavelength selection on either the decreasing or rising part of (), () spectra, respectively.\n2.2 AFM Measurements.\nAFM tapping mode images of adsorbed DNA layers were obtained using a Nanoscope IIIa instrument\nusing silicon nitride tips of less than 10 nm in radius. The films for AFM study were deposited onto\nclean 10x10 mm pieces of silicon wafers. Typical scan rates used were about 1Hz and the oscillation\nfrequency was around 400 kHz. Roughness analysis of the obtained images was performed using the\nintegrated image processing software.\n52.3 DNA and chemicals.\nThe preparation of the DNA solutions is described in the supplementary information. Our previous work\n(Davis et al 2005) showed that binding of DNA to polyethylenimine (PEI) layers and subsequent\ninteractions could be easily measured when 0.2 mg\/ml solutions in phosphate buffer (pH 7) were\nutilised, therefore solutions of this strength were used in this study. Single strand DNA (ss-DNA) was\nprepared by denaturizing of DNA double helix (or strand) (ds-DNA) by heating DNA solutions up to\n950C and its subsequent sharp cooling in ice (Davis et al 2005). The solution of ss-DNA was used as\nsoon as possible to minimize any potential interactions or crosslinking in solution. RNA molecules\n(from Sigma Aldrich) having original single strand structure were used for comparison. RNA was\nchosen because although it has a single stranded structure, it can also exist in a helical structure similar\nto ds-DNA. Polyethyleneimine from Sigma Aldrich (mw=50000) was used in this work for electrostatic\nadsorption of DNA (in both single- and double- stranded forms) and RNA molecules onto solid\nsubstrates. At the pHs used the charge density of PEI corresponds to 20% of the amine groups being\nprotonated (Suh et al 1994). Previous work (Davis et al 2005) indicates that the nature of the cationic\npolymer only has small effects on film behaviour. This is thought to be due to single stranded DNA\nhaving a lower charge density than any of the polycations we utilized, meaning that the cationic groups\nwere in excess for all the polymers used. This meant that the limiting factors for DNA adsorption and\nthe structures and the further behaviour of the DNA layers were not overly dependent on the nature of\nthe anchoring layer.\nThe molecular weights of the DNA samples were determined by gel electrophoresis (details in\nsupplementary information). The salmon DNA consisted mainly of material with a molecular size of\n2000bp whereas the herring DNA had a more diverse spread of weight, between 300-1000bp.\n2.4. Sample preparation.\nThe preparation of gold and silicon substrates and their treatment with PEI is described in the\nsupplementary information. Previous workers have shown that amines will complex to gold surfaces\n(Leff et al 1996) through a charge-neutral weak covalent bond and a polyamine should therefore adhere\nto a gold surface extremely well. Freshly etched silicon surfaces bear a slight negative charge and thus\nelectrostatic binding between Si and PEI will occur.\n6Layers of either ss-DNA, or ds-DNA, or RNA were electrostatically bound to the solid surface\nby either dipping the substrate into the solution as appropriate or by injecting the required solutions into\nthe cell. In both cases the exposure time was 5 minutes. The samples were then rinsed with Millipore\nwater either in a beaker or by purging the cell with at least three times the cell volume of water.\nTo study the interactions between adsorbed and solvated DNA with the TIRE method, solution\nof ss-DNA was injected into the cell and left for 3 hours. During this time, kinetic TIRE measurements\nwere taken. After 3 hours only minimal further changes in the TIRE results could be observed. The\nexcess of DNA was washed away by pumping Millipore water through the cell. TIRE spectra\nmeasurements were then repeated with the cell filled with phosphate buffer solution. The samples for\nAFM study were prepared by immersing the sample into the solution of single stranded DNA for 3\nhours followed by thorough rinsing with Millipore water and drying at room temperature.\n3. Results and discussion.\n3.1 TIRE spectra.\nTypical TIRE spectra of Cr\/Au films used in this work are shown in Fig. 1b. The spectrum of\n(), representing the amplitude ratio of Ap\/As, very much resembles a conventional SPR curve. In\ncontrast, the spectrum of (), which is related to the phase shift between p- and s- components of\npolarized light, experiences a sharp drop from 2700 down to -900 near the plasmon resonance.\nAccording to Arwin's modelling (Arwin et al 2004), the position of this drop on () spectra is about 10\ntimes more sensitive to adsorption than () spectra and conventional SPR curves.\nA typical TIRE spectra of DNA adsorption is shown in Fig. 2. As can be seen, adsorption of a very thin\nmonolayer of PEI causes a tiny shift of the TIRE () spectra. Adsorption of a layer of either herring ss-\nDNA or salmon ss-DNA causes an additional shift (still small) of the () spectrum. Adsorption of a\nsecond layer of complementary ss-DNA, i.e. salmon ss-DNA on top of salmon ss-DNA (Fig. 2a) or\nherring ss-DNA on top of herring ss-DNA causes a large spectral shift of about 80-100 nm. At the same\ntime, the adsorption of non-complementary ss-DNA, i.e. herring ss-DNA on top of salmon ss-DNA (Fig.\n2b) or salmon ss-DNA on top of herring ss-DNA yields much smaller spectral shift of 40-60 nm.\nFitting of the experimental results was performed with WVASE software using a four layers\nmodel, which is shown in Table 1 and described in more detail the supplementary information and in\nprevious work (Nabok et al 2007, Nabok and Tsargorodskaya 2007).\n7Changes in the thickness of adsorbed layers (Layer 1) obtained by TIRE data fitting are shown in\nTable 2. The data for adsorption of ds-DNA of both herring and salmon as well as of RNA are also\nshown in Table 2 for comparison.\nFor herring DNA, the thickness of the adsorbed single strand DNA was found to be of 4.22 ±\n1.72 nm, which is substantially less than the value of 12.96 ± 3.14 nm for adsorbed RNA molecules also\nrepresenting a single polynucleotide chain. Such difference is not surprising considering RNA has a\ncomplex secondary structure with hairpin loops and helical fragments (Littauer 2000). The thickness of\nthe adsorbed layer is somewhat higher than expected, indicating that we do not have a simple compact\nmonolayer at the surface. It should be remembered however that our measurements take place with the\nfilm submerged in buffer, meaning that it will be fully hydrated. Other workers [Legay et al 2005] have\nshown that the thicknesses of DNA layers on a gold surface are much greater in a hydrated state than in\na dry state. Longer DNA chains have been shown to have a quite flexible structure (Steel et al 2000) and\nthere is also the possibility of looping of the DNA chains from the surface which would also have the\neffect of increasing the thickness of the adsorbed layer. When undenatured herring ds-DNA was utilised,\nthe film thickness was much greater (9.75 ± 1.97 nm). This cannot be a simple monolayer of double-\nstranded DNA lying flat on the surface since this would only have a thickness of about 2 nm. Again\nhowever the layers are fully hydrated and there is also potential for supercoiling to occur, as observed by\nother workers on silicon surfaces (Rippe et al 1997).\nAdsorption of a second layer of herring ss-DNA causes substantial increase in the layer thickness\nof 21.81 ± 1.09 nm. We believe we first have a hydrated layer of DNA electrostatically adsorbed onto\nthe substrate. Interaction between complementary short sequences of bases on adsorbed and solvated\nDNA cause adsorption of a second layer of DNA, although it is certain that hybridization to a double\nhelix will not occur. Since this interaction will only occur along a relatively short part of the DNA chain,\ntheir will be extensive looping out into the solution of the rest of the chain. These unbound chains could\nthen further interact with each other or with other strands in solution. The final structure is that of a\nloosely bound, crosslinked multilayer.\nFigure S2 (supplementary information) illustrates schematically main stages of adsorption, (a)\nelectrostatic adsorption ss-DNA onto the PEI layer, (b) adsorption of complementary ss-DNA on top\nwith parts of the strands pendant to the surface, (c) adsorption of further ss-DNA accompanied with\ncrosslinking and tangling.\nThe adsorption of non-complementary ss-DNA (salmon) on top of adsorbed layer of herring ss-\nDNA has resulted in much smaller changes in the thickness (4.36 ± 0.36 nm) corresponding to a much\n8lower level of adsorption. There will always be some degree of interaction between long DNA strands\nbecause there will always be small sequences of a few bases that will match and cause some interaction,\nhowever, as this work shows, genomic DNA strands from the same source display a higher degree of\ninteraction, leading to formation of thicker films.\nA similar situation is observed for salmon DNA. The thickness of the electrostatically adsorbed\nss-DNA-salmon layer was found to be of 4.08 ± 1.56. Adsorption of a second layer of salmon ss-DNA\ncauses substantial increase in the layer thickness of 20.47 ± 0.53 nm which is very similar to that\nobserved for herring DNA. Again, the thickness of salmon DNA adsorbed on the surface is larger than\nthe thickness of adsorbed ds-DNA-salmon (8.52 ± 2.37). The adsorption of non-complementary ss-DNA\n(herring) on top of adsorbed layer of salmon ss-DNA has resulted in much smaller changes in the\nthickness (3.02 ± 1.15).\nSurprisingly large thickness changes of 20-21 nm, which were observed after adsorption of\ncomplementary ss-DNA, can be explained by initial interaction to form a loosely bound second layer\nwith extensive looping out of unbound chains. Further interaction could then stabilise the formation of a\ncrosslinked multilayer structure. Super-coiling of DNA, which was reported recently to occur on a\nsilicon surface could also have an effect (Rippe et al 1997).\nThe process of DNA hybridization accomplished by coiling up of two complementary single\nstrands requires complete three-dimensional freedom for both counterparts and near-perfect matching of\nthe bases. This is highly unlikely within our system where genomic DNA has been utilised and strands\nare immobilized on a surface. Interaction of adsorbed fragments of ss-DNA with short sequence\nmatching fragments of complementary ss-DNA in solution is possible, however, and would give a\nstructure with unbound chains looping into solution which with further interactions could lead to super-\ncoiling, tangling and knotting of the resulting DNA structure (Delmont and Mann 2003). The resulted\nthickness of DNA layer is therefore much larger than anticipated. What is of interest is that this process\nis much less efficient when the adsorbed and solvated DNA come from different sources. Even though\nre-hybridisation to form the double helix is probably impossible, there is still a degree of selectivity\nwhich could be enough for the development of simple, species-selective DNA sensors.\nThe obtained thickness values of 8-9 nm for electrostatically adsorbed layers of DNA are larger\nthan the value of 4.41.2 nm reported earlier for sturgeon DNA\/PEI layers (Sukhorukov et al 1996).\nThis is most probably due to the fact that the measurements in the literature were performed on dried\nfilms, whereas our samples are immersed and therefore full hydrated, which other workers have shown\n9to have a large effect on film thickness (Legay et al 2005). Other factors could be due to the difference\nin sample preparations and adsorption conditions.\n3.2. Kinetics study.\nTypical time dependencies of changes in the value of Δ at a certain wavelength near the resonance are\nshown in Fig. 3 for adsorption of both single and double stranded DNA of both species of fish. All\ncurves presented are descending due to the choice of the wavelength on the rising section (on the left\nfrom the resonance) of the  spectrum, as indicated by the cross in Fig. 1b. Similar kinetic curves\ncould be obtained from () spectra. All kinetic curves follow a Langmuir type of adsorption. The\nresults obtained are in line with the Δ(λ) spectra in Fig. 2 and their fitting in Table 1. For herring DNA\n(see Fig. 3a), the value of Δ  at saturation increases in the following order: adsorption of herring ss-DNA\non PEI layer, adsorption of non-complementary (salmon) ss-DNA on herring ss-DNA, adsorption of\nherring ds-DNA, complimentary adsorption of herring ss-DNA on herring ss-DNA and the subsequent\nformation of a herring DNA multilayer. The same sequence is observed for kinetics of adsorption of\nsalmon DNA in Fig. 3b. The time of adsorption of ss-DNA is in the range of 10-15 min, which is\nslightly larger than that for adsorption of ds-DNA (7-10 min), which could be due to a larger number of\nelectrically charged sites in the DNA double helix.\n3.3. AFM study.\nA series of typical tapping mode AFM images of adsorbed layers of DNA are shown in Figure S4\n(supplementary information). Values of mean surface roughness <rms> evaluated from AFM images are\npresented in Table 3. The parameter of <rms> is defined as a deviation of the Z values within a defined\nbox calculated as  mZrms i 2 , where Zi is the height value in i-point of the image, and m is\nthe number of points within the box. It is important to realise that AFM only gives a measurement of\nsurface roughness and not overall film thickness. Silicon substrates were chosen because polished pieces\nof silicon wafer have a flat surface which is extremely suitable for AFM study whereas evaporated gold\nfilms have an inherent roughness. Although the adsorbed molecular layers on gold surface may look\nslightly different in AFM, the main goal was to investigate relative changes in the film morphology after\nbinding the second layer of ss-DNA and therefore a substrate with minimal roughness was utilised. The\nobserved increase in the film roughness as a result of the second stage of DNA adsorption is the result\ninvariant of the type of the initial surface used.\n10\nAn adsorbed layer of PEI is rather smooth (AFM image is not shown) with the mean roughness\nof 0.62 ± 0.03 nm. Adsorption of DNA on top of this film leads to substantial increase in roughness. The\nadsorbed layer of ds-DNA clearly shows larger grains in Fig. 5a and larger roughness of 1.90 ±0.42 nm,\nas compared to adsorbed layer of ss-DNA in Fig. S4b having mean roughness of 1.18 ± 0.1 nm. The\nlarger roughness could be due to ds-DNA being much less flexible than ss-DNA, making close chain to\nchain packing and formation of a smooth film much more difficult. The adsorbed layer of RNA\nappeared to have completely different morphology (Fig. S4c) with the largest mean roughness of 2.06 ±\n0.09 nm, possibly again due to the relative inflexibility of this chain and its tendency to form secondary\nstructures. A second adsorption of complementary ss-DNA (Fig. S4d) on ss-DNA layer adsorbed on PEI\ngives rise to a film with a slightly larger grain size (perhaps a function of the thicker film) as compared\nto that obtained from a film exposed to a solution of non-complementary ss-DNA (Fig. S4e); however\ntheir values of mean roughness obtained on several samples are very similar.\n4. Conclusions\nThe method of electrostatic self-assembly was successfully implemented for adsorption of both single\nstrand and double stranded DNA, as well as RNA. Single stranded DNA electrostatically adsorbed on\nthe solid substrates, (despite the limited degree of freedom), is capable of binding further ss-DNA\nsubsequently forming a DNA multilayer structure with some degree of species selectivity. The results\nobtained by a sensitive optical technique of total internal reflection ellipsometry proved this concept: the\nobserved changes in thickness due to binding of complementary ss-DNA layers are 5-6 times larger than\nthose observed for non-complementary binding of ss-DNA. Direct AFM observations of the morphology\nof adsorbed DNA (RNA) layers are in line with TIRE data. The results allow a better understanding of\nthe binding processes that are occurring and combined with our previous electrochemical results show a\npossibility for the development of rapid and inexpensive electrochemical DNA analyses of natural\nsubstances of food, drinks, fabric, wool and other biologically derived materials with sensitivities for\ngenomic DNA in the 0.01 mg ml-1 to 1 mg ml-1 range and down to 1 fg ml-1 for single gene DNA. Future\nwork will involve the optimisation of the conditions of the binding, such as temperature and ionic\nstrength to maximise sensitivity and selectivity of the process.\nAcknowledgement\n11\nThe authors would like to thank the BBSRC for funding for FD as part of the Centre for Bioarray\ninnovation within the post-genomic consortium. Thanks should also go to Dr Lee Larcombe (Cranfield\nHealth) for gel electrophoresis experiments and helpful discussions.\nReferences\nArwin, H., Poksinski, M., Iohansen, K. 2004,Appl. Optics, 43, 3028-3036.\nAzzam R.M.A. and Bashara N.M., 1987, Ellipsometry and Polarized Light; North-Holland Personal\nLibrary.\nAusubel, F.M., Brent, R., Kingston, R E., Moore, D.D., Sedman, G.G., Smith, J.A., Struhl, K.S., 1993,\nCurrent Protocols in Molecular Biology, Vol. 1-2; John Wiley & Sons, New York,.\nBjork, P., Persson, N.K., Peter, K., Nilsson, R., Asberg, P., Inganas, O., 2005, Biosens. Bioelec, 20,\n1764-1771.\nBritten, R.E., Kohne, D.E., 1968, Science, 161, 529-540.\nCardenas, M., Braem, A., Nylander, T., Lindman, B., 2003, Langmuir, 19, 7712-7718.\nDavis, F., Nabok, A.V., Higson, S.P.J., 2005, Biosens. Bioelec, 20, 1531-1538.\nDavis, F., Hughes, M A., Cossins, A.R., Higson, S.P.J., 2007, Anal. Chem, 79, 1153-1157.\nDelmonte, C.S,.Mann, L.R.B., 2003, Current Science, 85, 1564-1570.\nDowns M.E.A., 1991, Biochem. Soc. Trans., 19, 39-43.\nHwang, S., Kim, E., Kwak, J., 2005, Anal. Chem., 77, 579-584.\nKorri-Youssufi, H., Garnie, F., Srivastava, P., Godillot, P., Yassar, A., 1997, J. Am. Chem. Soc., 119,\n7388-7389.\nKumpubu-Kalemba, L., Leclerc, M. 2000, Chem. Comm., 19, 1847-1848.\nLeclerc, M., 1999, Adv. Mater., 11, 1491-1498.\nLeff, D.V., Brandt, L., Heath, J.R., 1996, Langmuir, 12, 4723-4730.\n12\nLegay, G., Finota, E., Meunier-Prest, R., Cherkaoui-Malki, M., Latruffe, N., Dereux, A., 2005, Biosens.\nBioelec, 21, 627-636.\nLemeshko, S.V., Powdrill, T., Belosludsev, Y.Y., Hogan, M., 2001, Nucleic Acids Res., 29, 3051-3058.\nLittauer, U.Z.. 2000, Biophysical Chemistry, 86, 259-266.\nLvov, Yu., Decher. G., Sukhorukov. G., 1993, Macromolecules, 26, 5396-5399.\nMartin, M.A., Hoyer, B.H., 1966, Biochemistry, 5, 2706-2713.\nMascini, M., Palchetti, H., Marazza,. G. J., 2001, Anal. Chem., 369, 15-21.\nMcQuade, D.T., Pullen, A.E., Swager, T.M., 2000, Chem. Rev., 100, 2537-2574.\nNabok, A.V., Tsargorodskaya, A., Holloway, A., Starodub, N. F., Gojster, O., 2007, Biosens. Bioelec.,\n22, 885-890.\nNabok, A.V., Tsargorodskaya, A., Proceedings of 10th European Conference on organised Organic\nFilms, ECOF 10, Latvia, Riga, 24-27 August, 2006, Thin Solid Films, 2007, in press.\nNicollini, C., Erokhin, V., Facci, P., Guerzoni, S., Ross, A., Pashkevich, P., 1997, Biosens. Bioelec,, 12,\n613-618.\nPark N., Hahn J.H., 2004, Anal. Chem., 76, 900-906.\nPoksinski, M., Arwin, H., 2004, Thin Solid Films, 455–456, 716–721.\nRippe, K., Mucke, N., Langowski, J., 1997, Nucleic Acid Research, 25, 1736-1744.\nSato, Y., Kobayashi. Y., Kamiya, T., Watanabe, H., Akaike, T., Yoshikawa,. K., Maruyama, A., 2005,\nBiomaterials, 26, 703-711.\nSteel, A.B., Levicky, R.L., Herne, T.M., Tarlov, M.J., 2000, Biophys. J., 79, 975-981.\nSuh, J., Paik, H., Hwang, B.K., 1994, Bioorg Chem 22, 318-327,\nSukhorukov. G., Mohwald, H., Decher, G., Lvov, Y.M., 1996, Thin Solid Films, 284-285, 220-223.\nTravas-Sejdic, J., Soman, R., Peng, H., 2005, Thin Solid Films, 497, 96-102.\nJ.A. Woollam Co., Inc, 2002, Guide to Using WVASE32..\nXi Chun Zhou; Li Qun Huang; Sam Fong Yau Li., 2000, Biosens. Bioelec, 16, 85-95.\n13\n14\nFigure Captions\nFigure 1. (a) Schematic of TIRE experimental set-up comprising white light sourse (1), polariser (2),\nanalyser (3), photodetector array (4), 680 prism (5), Cr\/Au coated glass slide (6), reaction cell (7). (b)\ntypical () and () TIRE spectra of Cr\/Au layer deposited on glass. A cross on the () spectrum\nillustrates the choice of wavelength for kinetics measurements.\nFigure 2. Series of Δ(λ) spectra taken after following adsorption sequences: (a) (left-to-right) bare\nCr\/Au film (1), PEI (2), salmon ss-DNA (3), salmon ss-DNA (4); (b) (left-to-right) bare Cr\/Au film (1),\nPEI (2), salmon ss-DNA (3), herring ss-DNA (4).\nFigure 3. Kinetics of DNA adsorption: (a) herring ss-DNA on PEI (1), salmon ss-DNA on herring ss-\nDNA (2), herring ds-DNA on PEI (3), herring ss-DNA on herring ss-DNA (4); (b) salmon ss-DNA on\nPEI (1), herring ss-DNA on salmon ss-DNA (2), salmon ds-DNA on PEI (3), salmon ss-DNA on\nsalmon ss-DNA (4).\n15\nTable 1. Parameters of four-layer model in TIRE fitting (parameters marked with * were fixed\nduring fitting)\nambient: BK7 n* = 1.515, k*= 0 at 633 nm\n2: Cr\/Au n* = 0.43±0.11\nk* = 3.09±0.19\nd *= 24.7±2.4 nm\nat 633 nm\n1: Cauchy layer\nAn*=1.396\nBn*=0.01\nCn*=0\nn*= 1.42 , k* = 0 at 633 nm\nd is a variable parameter (the\nsubject of fitting). The values\nobtained are given in Table 2\n0: Phosphate\nbuffer solution\nn* = 1.33, k* = 0\n16\nTable 2. Increases in thickness (TIRE data) of different adsorbed layers.\nAdsorbed layers Thickness changes*\nnm (TIRE)\nAdsorption initial PEI layer (layer 1) 2.87 ± 1.24\nAdsorption of herring ss-DNA on PEI\n(layer 2)\n4.22 ± 1.72\nAdsorption herring ss-DNA\non herring ss-DNA\/PEI (layer 3)\n21.81 ± 1.09\nAdsorption salmon ss-DNA\non herring ss-DNA\/PEI (layer 3)\n4.36± 0.36\nAdsorption of salmon ss-DNA on PEI\n(layer 2)\n4.08 ± 1.56\nAdsorption salmon ss-DNA\non salmon ss-DNA\/PEI (layer 3)\n20.47± 0.53\nAdsorption herring ss-DNA\non salmon ss-DNA\/PEI (layer 3)\n3.02± 1.15\nAdsorption herring ds-DNA on PEI\n(layer 2)\n9.75± 1.97\nAdsorption salmon ds-DNA on PEI\n(layer 2)\n8.52± 2.37\nAdsorption RNA on PEI (layer 2) 12.96± 3.14\n*Thickness changes are additive e.g. Thickness of PEI plus herring ss-DNA layer is 7.09 nm.\n17\nTable 3. Mean roughness (AFM data) of different adsorbed layers.\nAdsorbed layers Mean Roughness,\nnm (AFM)\nAdsorption initial PEI layer (layer 1) 0.62 ± 0.03\nAdsorption of herring ss-DNA on PEI\n(layer 2)\n1.18 ± 0.1\nAdsorption herring ss-DNA\non herring ss-DNA\/PEI (layer 3)\n1.68 ± 0.06\nAdsorption salmon ss-DNA\non herring ss-DNA\/PEI (layer 3)\n1.72± 0.12\nAdsorption herring ds-DNA on PEI\n(layer 2)\n1.90 ±0.42\nAdsorption RNA on PEI (layer 2) 2.06 ± 0.09\n18\nThe study of genomic DNA adsorption and subsequent interactions using Total Internal\nReflection Ellipsometry\nAlexei Nabok+ , Anna Tsargorodskaya+, Frank Davis++, Séamus P.J. Higson++ *\n+ Sheffield Hallam University, Materials and Engineering Research Institute, Sheffield, S1 1WB, U.K.\n++ Cranfield Health, Cranfield University, Silsoe, MK45 4DT, U.K.\nMolecular weights of DNA samples.\nThe molecular weights of the DNA samples were determined by gel electrophoresis. The salmon DNA\nconsisted mainly of material with a molecular size of 2000bp whereas the herring DNA had a more\ndiverse spread of weight, between 300-1000bp. Samples were run on a 1.2% agarose gel, at 100 V for\n30 minutes until the orange loading dye front reached the bottom of the gel to give the widest separation\nof the samples. The gel was immersed in ethidium bromide to stain the DNA, and visualized using a UV\ntransilluminator and digital camera system (SynGene, UK). The salmon DNA was found (by\ncomparison with a standard DNA ladder) to consist mainly of material with a molecular size of 2000bp\nwhereas the herring DNA had a more diverse spread of weight, between 300-1000bp. Images of the gels\ncan be found below (Figure S1).\nPreparation of substrates.\nSubstrates for TIRE measurements were prepared by thermal evaporation of a 3 nm layer of chromium\n(Cr) onto standard BDH glass slides followed by evaporation of a further 20-25 nm layer of gold (Au) in\nthe same vacuum chamber without breaking the vacuum of 2 x 10-6 Pa. Pieces of silicon wafer 10x10\nmm in size, cleaned with 5% HF solution and then washed in Millipore water and dried, were used a\nsubstrates in AFM experiments.\nThe following sample preparation procedure and measurements routine were used in this work:\nAn intermediate layer of PEI was deposited onto Cr\/Au coated glass slides or pieces of silicon wafers by\nimmersing the substrates into 1 mg\/ml solution of PEI for 5 minutes followed by thorough rinsing in\nMillipore water.\n19\nThe experimental set-up for TIRE measurements was built on the spectroscopic ellipsometer M2000V\n(J.A. Woollam Co., Inc.), which is represented on the schematic diagram in Fig. 1a by elements (1-4):\nthe white light source (1), two polarizing prisms (2, 3) called the polarizer and analyzer respectively, and\na photodetector array (4). Additional elements, which allow performing TIRE measurements, are a 680\ntrapezoidal prism (5) with a gold coated glass slide (6) brought into optical contact via index matching\nfluid, and the reaction cell (7) sealed to the slide through a rubber O-ring. The choice of the prism was\ndictated by conditions of total internal reflection of light on the glass\/water interface. The cell has a\nvolume of 2 ml and contains inlet and outlet tubes to allow injection of different liquids into the cell in\norder to perform different chemical- and bio-reactions. Elements 5-7 were fixed on the ellipsometer\nsample stage using vacuum suction.\nThe spectra of two ellipsometric parameters  and , representing, respectively, the amplitude\n(A) ratio sp AA \/)tan(  and phase shift sp   between p- and s- components of polarized light,\nwere recorded using the M2000V instrument in the 350–1000 nm spectral range using the rotating\nanalyzer principle. Optical parameters of the reflection system, i.e. thicknesses and refractive indices of\nthe substrate and adsorbed layers, can be obtained by numerically solving a reverse ellipsometric\nequation:\nsp RRi \/)exp()tan(  .\nHere Rp and Rs are Fresnel reflection coefficients for p- and s- components of polarized light,\nrespectively, related to the parameters of the reflection system and particularly the thickness (d) and\nrefractive index (n) of the adsorbed layers via Fresnel equations (Azzam et al 1987) and 1i . The\nfitting is performed by solving Fresnel equations many times for different values of n and d and\nsubsequently minimizing the error function of experimental and theoretical (calculated) values of  and\n using one of least-square techniques. Commercial WVASE32 software is provided by J.A. Woollam\nCo., Inc. for this task. More details of this technique can be found in our previous papers (Nabok et al\n2007, Nabok and Tsargorodskaya, 2007).\nPreparation of DNA solutions.\nAll water used was purified with a ELGA Purelab UHQ purifier. Phosphate buffer (pH 7) was made by\ndissolving NaH2PO4H2O (0.55 g), Na2HPO412H2O (2.11 g) and NaCl (7.73 g) in water and making up\nto 1 litre. DNA of two species of fish, namely herring (Cat. No. D6898) and salmon (Cat. No. D1626),\nwere selected for this study. Both materials were purchased from Sigma Aldrich, as was RNA from\nTorola yeast. DNA solutions, 0.2 mg\/ml solutions in phosphate buffer (pH 7) were used in this study.\n20\nFitting of TIRE data.\nFitting of the experimental results was performed with WVASE software using a four layers model,\nwhich is shown in Table 1 and described in more detail in previous work (Nabok et al 2007, Nabok, A.\nV., Tsargorodskaya 2007). . Because of the inverted geometry in TIRE measurements, the ambient was\nthe BK7 glass (prism, glass slide) with the optical parameters taken from the WVASE32 library\n(Woollam 2002). Layer 2 represents the Cr\/Au coating, parameters of which were obtained by fitting the\ndata for uncoated Cr\/Au slides. Typical values of d (thickness), n (refractive index), and k (extinction\ncoefficient) for Cr\/Au at 633 nm are given in Table 1. Parameters of Layer 2 were kept fixed in\nsubsequent fitting steps. Layer 1 was the organic film represented by Cauchy dispersion formula for\nrefractive index (Woollam 2002):\n42)( \n CBAn  ,\nwhere A, B and C were parameters of fitting,  is the wavelength of the light and d the thickness of the\nlayer.\nThe extinction coefficient k = 0 was used for optically transparent organic layers. In order to\nsimplify fitting, parameters A, B, and C were kept constant during fitting for all organic layers used, so\nthat the value of refractive index was constant (n=1.42) at =633 nm. In this case, the fitting was\nperformed for the thickness (d) only. This means that all changes on the gold surface caused by\nconsecutive adsorptions of PEI, ss-DNA and further DNA adsorption are associated solely with the\nchanges in the thickness of the adsorbed layer. Such an approximation is not strictly correct but forms\nthe basis of the most logical model. Finally, Layer 0 (the substrate) was a phosphate buffer aqueous\nsolution approximately described by dispersion data for water (n=1.33, k=0 at 633 nm).\nReferences.\nAzzam R.M.A. and Bashara N.M., 1987, Ellipsometry and Polarized Light; North-Holland Personal\nLibrary.\nJ.A. Woollam Co., Inc, 2002, Guide to Using WVASE32.\n21\nFigure S1. The molecular weights of the DNA samples as determined by gel electrophoresis. Size\nladder in lane 1 and 6 (1500bp as marked). Herring DNA in Lanes 2 & 3. Salmon DNA in Lanes 4 & 5.\nSamples were run on a 1.2% agarose gel, at 100 V for 30 minutes and stained with ethidium bromide.\n22\n(a)\n(b)\n(c)\n_ _ _ _ _ _ _ _ _ _\n_ _ _ _ _ _ _ _ _ _\n~7 nm\n~30 nm\nFigure S2. Model of adsorbed DNA layers: (a) electrostatic adsorption of first ss-DNA layer onto\npolycation layer by electrostatic interaction, (b) adsorption of complementary ss-DNA on top of first ss-\nDNA layer with parts of the strands pendant to the surface, (c) adsorption of further ss-DNA\naccompanied with crosslinking and tangling which leads to formation of a thick (c 20 nm) DNA layer.\n23\nFigure S3. AFM tapping mode images of (a) bare Si; (b) Si coated with PEI.\n(a) (b)\n24\n(a) (b)\n(c) (d)\n(e)\nFigure S4. AFM tapping mode images of layers of herring ds-DNA (a), herring ss-DNA (b), and RNA\n(c) electrostatically adsorbed on PEI layer. AFM tapping mode images of layers of herring ss-DNA (d)\nand salmon ss-DNA (e) adsorbed on top of the layer of herring ss-DNA.\n"}