{"doi":"10.1080\/01411926.2011.552709","coreId":"10742","oai":"oai:www.e-space.mmu.ac.uk:2173\/90642","identifiers":["oai:www.e-space.mmu.ac.uk:2173\/90642","10.1080\/01411926.2011.552709"],"title":"Becoming a problem: how and why children acquire a reputation as ‘naughty’ in the earliest years at school","authors":["MacLure, Maggie","Jones, Liz","Holmes, Rachel","MacRae, Christina"],"enrichments":{"references":[{"id":17790997,"title":"Action Research and Post-modernism: Congruence and Critique.","authors":[],"date":"2002","doi":null,"raw":"Brown, T. & Jones, E. (2002) Action Research and Post-modernism: Congruence and Critique. Buckingham: Open University.","cites":null},{"id":17790999,"title":"Bodies that Matter, On the Discursive Limits of &quot;Sex&quot;.","authors":[],"date":"1993","doi":"10.5040\/9781472545688.ch-003","raw":"Butler, J. (1993) Bodies that Matter, On the Discursive Limits of &quot;Sex&quot;. London: Routledge.","cites":null},{"id":17791010,"title":"Constructing and Reconstructing Childhood: Contemporary Issues in the Sociological Study of Childhood, 2nd edn.","authors":[],"date":"1997","doi":"10.4324\/9780203362600","raw":"James, A. & Prout, A. (eds) (1997) Constructing and Reconstructing Childhood: Contemporary Issues in the Sociological Study of Childhood, 2nd edn. London: Falmer.","cites":null},{"id":17790998,"title":"Deconstructing Developmental Psychology.","authors":[],"date":"1994","doi":"10.4324\/9780203946169","raw":"Burman, E. (1994) Deconstructing Developmental Psychology. London: Brunner-Routledge.","cites":null},{"id":17791006,"title":"Discipline and Punish.","authors":[],"date":"1977","doi":"10.1177\/017084068000100211","raw":"Foucault, M. (1977) Discipline and Punish. Harmondsworth: Penguin.","cites":null},{"id":17791004,"title":"et al (2004) Inside the Foundation Stage: Recreating the Reception Year. Final Report. London: Association of Teachers and Lecturers.","authors":[],"date":null,"doi":null,"raw":"Drummond, M.J. et al (2004) Inside the Foundation Stage: Recreating the Reception Year. Final Report. London: Association of Teachers and Lecturers.","cites":null},{"id":17791007,"title":"Every Child Matters: Change for Children.","authors":[],"date":"2004","doi":"10.4135\/9781446279489.n4","raw":"H.M. Government (2004) Every Child Matters: Change for Children. London: HMSO.","cites":null},{"id":17791008,"title":"Home-School Knowledge Exchange and Transformation in Primary Education. End of Award to the Economic and Social Research Council.","authors":[],"date":"2004","doi":null,"raw":"Hughes, M. (2004) Home-School Knowledge Exchange and Transformation in Primary Education. End of Award to the Economic and Social Research Council. Swindon: ESRC.","cites":null},{"id":17790996,"title":"Language and Symbolic Power.","authors":[],"date":"1991","doi":"10.1093\/sf\/71.1.242","raw":"Bourdieu, P. (1991) Language and Symbolic Power. London: Polity Press.","cites":null},{"id":17790994,"title":"Locating culture in action: membership categorisation in texts and talk, in A. Lee & C. Poynton (eds)","authors":[],"date":"2000","doi":null,"raw":"Baker, C. (2000) Locating culture in action: membership categorisation in texts and talk, in A. Lee & C. Poynton (eds) (2000) Culture and Text. Discourse and Methodology in Social Research and Cultural Studies. Lanham, MD: Rowman & Littlefield.","cites":null},{"id":17791016,"title":"Naughty Boys: Anti-Social Behaviour, ADHD and the Role of Culture.","authors":[],"date":"2005","doi":null,"raw":"Timimi, S. (2005) Naughty Boys: Anti-Social Behaviour, ADHD and the Role of Culture. London: Palgrave.","cites":null},{"id":17791002,"title":"Poststructuralist Theory and Classroom Practice.","authors":[],"date":"1994","doi":null,"raw":"Davies, B. (1994) Poststructuralist Theory and Classroom Practice. Geelong, Deakin University Press.","cites":null},{"id":17791011,"title":"Powers of Horror: An Essay on Abjection.","authors":[],"date":"1982","doi":"10.2307\/3684782","raw":"Kristeva, J. (1982) Powers of Horror: An Essay on Abjection. New York: Columbia University Press.","cites":null},{"id":17791003,"title":"Promoting social, emotional and behavioural skills in primary schools. The Standards Site: http:\/\/www.standards.dfes.gov.uk\/primary\/features\/primary\/873235\/","authors":[],"date":"2005","doi":null,"raw":"DfES (2005) Promoting social, emotional and behavioural skills in primary schools. The Standards Site: http:\/\/www.standards.dfes.gov.uk\/primary\/features\/primary\/873235\/ Drew, P. & Heritage, J. (eds) (1992) Talk at Work: Interaction in Institutional Settings. Cambridge: Cambridge University.","cites":null},{"id":17791014,"title":"Questioning the Three Bears: the social construction of classroom assessment, in A. Filer (ed) Assessment: Social Practice and Social Product. London: Routledge Falmer.","authors":[],"date":"2000","doi":null,"raw":"Pryor, J. & Torrance, H. (2000) Questioning the Three Bears: the social construction of classroom assessment, in A. Filer (ed) Assessment: Social Practice and Social Product. London: Routledge Falmer.","cites":null},{"id":17791013,"title":"The discourse of control: disruption and Foucault in an early childhood classroom,","authors":[],"date":"2005","doi":"10.2304\/ciec.2005.6.2.3","raw":"Millei, Z.J. (2005) The discourse of control: disruption and Foucault in an early childhood classroom, Contemporary Issues in Early Childhood, 6, 2: 128-139.","cites":null},{"id":17791012,"title":"The Four Fundamental Concepts of Psychoanalysis","authors":[],"date":"1977","doi":"10.1017\/s0033291700016718","raw":"Lacan, J. (1977) The Four Fundamental Concepts of Psychoanalysis (ed J.A. Miller; trans A. Sheridan). New York: W.W. Norton.","cites":null},{"id":17791005,"title":"The Language of Teaching.","authors":[],"date":"1978","doi":null,"raw":"Edwards, A.D. and Furlong, V.J. (1978) The Language of Teaching. London: Heineman.","cites":null},{"id":17790995,"title":"The Location of Culture.","authors":[],"date":"1994","doi":"10.1177\/147447409600300117","raw":"Bhabha, H. (1994) The Location of Culture. London: Routledge.","cites":null},{"id":17791017,"title":"The Mastery of Reason:","authors":[],"date":"1988","doi":null,"raw":"Walkerdine, V. (1988) The Mastery of Reason: Cognitive Development and the Production of Rationality. London: Routledge.   17","cites":null},{"id":17791015,"title":"Tracing bodylines: the body in feminist poststructural research.","authors":[],"date":"2004","doi":"10.1080\/0951839032000150220","raw":"Somerville, M. (2004) Tracing bodylines: the body in feminist poststructural research. International Journal of Qualitative Studies in Education, 17, 1: 47-63.","cites":null},{"id":17791000,"title":"Undoing Gender.","authors":[],"date":"2004","doi":"10.4324\/9780203499627","raw":"Butler, J. (2004) Undoing Gender. London: Routledge.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-01-26T13:58:41Z","abstract":"Final report presented to the Economic and Social Research Council.","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/10742.pdf","fullTextIdentifier":"http:\/\/hdl.handle.net\/2173\/90642","pdfHashValue":"3b34a2f50f3909d5c7e36ac050a48d818330fb25","publisher":"Economic and Social Research Council","rawRecordXml":"<record><header><identifier>\noai:www.e-space.mmu.ac.uk:2173\/90642<\/identifier><datestamp>2010-01-26T13:58:41Z<\/datestamp><setSpec>hdl_2173_23540<\/setSpec><\/header><metadata><oai_dc:dc xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Becoming a problem: how and why children acquire a reputation as ‘naughty’ in the earliest years at school<\/dc:title><dc:creator>MacLure, Maggie<\/dc:creator><dc:creator>Jones, Liz<\/dc:creator><dc:creator>Holmes, Rachel<\/dc:creator><dc:creator>MacRae, Christina<\/dc:creator><dc:description>Final report presented to the Economic and Social Research Council.<\/dc:description><dc:publisher>Economic and Social Research Council<\/dc:publisher><dc:date>2010-01-26T13:58:41Z<\/dc:date><dc:type>Other<\/dc:type><dc:identifier>MacLure, M., Jones, L., Holmes, R., and MacRae, C. Becoming a problem: how and why children acquire a reputation as 'naughty' in the earliest years at school. Economic and Social Research Council, 2008.<\/dc:identifier><dc:identifier>http:\/\/hdl.handle.net\/2173\/90642<\/dc:identifier><dc:language>en<\/dc:language><dc:relation>http:\/\/www.esri.mmu.ac.uk\/resprojects\/reports\/becomingaproblem.pdf<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/www.esri.mmu.ac.uk\/resprojects\/reports\/becomingaproblem.pdf"],"year":2010,"topics":[],"subject":["Other"],"fullText":"  1 \n \n \nBecoming a Problem: How and Why Children Acquire a Reputation as \n‘Naughty’ in the Earliest Years at School \n \nA project funded by the Economic and Social Research Council  \n[Award ref. RES-062-23-0105] \n \nDirectors:      Maggie MacLure and Liz Jones, \nResearchers:           Rachel Holmes and Christina MacRae \n      Manchester Metropolitan University \n \nDuration:     1 September 2006 – 29 February 2008 \n___________________________________________________________________________ \nExtended Report \nBACKGROUND \nThe research was formulated in the context of the Labour Government’s early childhood \nreforms (eg Every Child Matters, HM Govt, 2004). Early childhood had been identified as a \ncritical period for children’s futures – a site where early signs of social exclusion and \ndisaffection might be tackled. At the same time, anxiety about deteriorating behaviour was also \nin evidence (DfES, 2005). Yet as we noted in the proposal, behaviour is an enduring issue that \nhas prompted a wide array of interventions and approaches - behavioural, cognitive, \npsychotherapeutic and socio-cultural.  \n \nMany of these interventions have focused on individual children, attempting to help them to act \nmore appropriately in school, or to compensate for presumed effects of developmental ‘delay’, \ndisposition, or home background. Our research, by contrast, proposed to focus on problematic \nbehaviour as it emerged within, and was shaped by, the culture of the classroom. We started \nfrom the premise that securing a successful reputation as a ‘good’ pupil, or acquiring a negative \none as a ‘problem’, is never the sole responsibility of the individual child. Children must not only \nact appropriately but must be recognised as having done so. They must secure \nreconnaissance (Bourdieu, 1991). Reputation is therefore a public matter: a child becomes a \nproblem in the eyes of others (teachers, school staff, classmates and other parents).  \n \nThe theoretical framework was informed by discourse analysis and poststructuralist theory \n(Foucault, 1977; Butler, 2004; MacLure, 2003), including previous work in early childhood \n(Walkerdine, 1999; James & Prout, 1997; Davies, 1989; Brown & Jones, 1992; Burman, 1994). \nSuch an approach conceptualises subjectivity as an outcome of discursive practices that \nconstitute and make sense of the social world. The framework also incorporated insights from \nConversation Analysis, a methodology which allows for fine-grained analysis of interaction \n(Drew & Heritage, 1992). This allowed us to trace the ways in which discourses are actualised \nin the interactions through which teachers and children interpret, categorise, recognise and \njudge one another. A key question animating the research was: what makes it difficult for some \nchildren to be, and to be recognised as, ‘good’ students? \n \n \n   2 \nOBJECTIVES \n \nTo document and critically examine the emergence of problem behaviour amongst children in \nthe Foundation stage of school. \n \nTo enhance understanding of the processes by which children begin to develop an identity and \n'career' as a problem in school. \n \nTo explore possibilities for productive change grounded in teachers' practice and children's \nexperiences. \n \nTo inform public and policy debate about behaviour and discipline in the early years. \n \nTo contribute to the development of theory in the field of classroom interaction and pupil \nidentity. \n \nMETHODS \nThe research was based in one reception class (4-5 year olds) in each of 4 primary\/infant \nschools in Greater Manchester: a ‘faith’ school with students of mainly white-British heritage \nand high entitlement to free school meals; an inner-city school with a multi-ethnic intake \nincluding asylum seekers and refugees; a school in a ‘leafy suburb’ of moderately affluent \nhomes, and a city school in an area of social deprivation served by a Sure Start children’s \ncentre. The approach involved participant observation within an ethnographic orientation that \nsought depth of understanding of the cultures and contexts within which behaviour assumed \nsignificance for the participants. Members of the project team spent one day a week in each of \nthe schools. Qualitative data was collected via detailed observation notes, video and audio \nrecordings of interactions in the classroom and other school locations (collective worship, \nassemblies, concerts, parties), and interviews with teachers and children.  \nMethodological issues \nVideo recording and transcription provided valuable insights into the interactional details of \nsignificant events. However high-quality fieldnotes, built up over time, provided richer and more \ncomplex understandings of the ways in which behaviour and reputation were being fabricated \nin the four classes. We suggest that this mix of methods provided both depth and breadth of \nanalytic focus. We also suggest that ethnographic research, based on sustained cultural \nimmersion in the complexities of classrooms and schools, has the capacity to counteract the \naccretion of common-sense views and easy answers to deep-seated educational problems. \nThe project also raised methodological issues concerning the inherent voyeurism of research \nand the risks of intensifying the already-strong gaze upon the child (see Outputs 1 and 2). \n \nAll names are pseudonyms in this report. \nRESULTS \nThe research aimed to delineate the discourse practices that work to maintain classroom order \nand discipline across the class as a whole. It is only against this background of an emerging \ncollectivity that one can understand how certain individuals become more clearly identified than \nothers as a ‘problem’. In this study one child, Carter, was eventually excluded from school. At \nanother school, Jamie became virtually an isolate within the classroom: considered by school   3 \nstaff to be autistic (but not medically diagnosed as such), he spent most of his time disengaged \nfrom collective activities and marginalised in interactions involving adults and children. \nAdditionally, a few other children, across the four schools, were considered by teachers and \nstaff to present problems. Although the four project schools were located in very different \ncatchment areas, the discourse processes and interactional strategies that were identified were \nsimilar across all sites. This is especially significant since one of the schools operates an \nexplicitly innovative organisation involving free flow and pupil choice of activities. However \nduring plenary sessions (whole-class sessions, collective worship etc) the interactional and \ndisciplinary strategies used by staff were indistinguishable from those in the other schools. This \nsuggests that interactions between adults and reception-age children are regulated by deep-\nseated assumptions and discourses that may over-ride differences of organisation and ethos. \n \nWhat counts as problem behaviour? \nTwo broad types of behaviour were of particular concern to teachers and other school staff. \nFirstly, there were actions that might be considered ‘traumatic’ in their immediate physical \nimpact. Biting, kicking, punching or slapping were always treated seriously, and especially so if \nthe recipient was an adult. Indeed the effect of these actions is often so severe for the adult \nrecipient that it seems momentarily to cause a disruption of the usual experiential order – a kind \nof ontological disorientation in which normal sense, including sense of oneself, is fractured. \nSecondly, persistent failure to comply with adult requests was often an issue, especially where \nthis noticeably offended against the collective ‘rules’ that are a major focus in the reception \nyear. Repeatedly ‘calling out’ or not sitting ‘properly’ in whole-class sessions was likely to \noffend, as was an apparent failure to listen or concentrate. Being noisy or restless in queues, \nassemblies and other whole-school events, might also attract attention. Rules for good \nbehaviour and collective order were reiterated in many forms: through explicit statements to the \nclass, identification of infractions, posters, and elaborate systems of reward (stickers, \ncertificates, tokens, house points, marbles etc). Classroom discipline was predominantly a \npublic matter, conducted in plain view of the class. This had serious implications for children’s \nstatus and reputation (see below). \n \nThe discursive ‘framing’ of problem behaviour \nResistant or aggressive behaviour did not however inevitably result in a poor reputation. The \nacquisition of a reputation also involves a discursive frame that grants meaning and duration to \na child’s conduct. Within this frame, individual actions come to be read as ‘signs’ of a more \nenduring problem. Family and community provide one such framing resource, in the form of \nnarratives of the neglectful, indulgent, anxious, uncooperative or interfering parent. One \nteaching assistant remarked: Home lives are very haphazard for some of these children. The \nbehaviours aren‟t their fault. I blame the parents […] They need to live by the rules. Basically \nthey‟re feral aren‟t they? [to T]. In a similar mode, Jamie was described as just running wild \nwhen he first came to school. Brent’s teacher felt his mother failed to teach him self-discipline, \nand called her into school to be made aware of his shortcomings (Actually in a way it is his \nmum who is getting taught the lesson, his teacher remarked). Several parents were considered \nto have ‘spoiled’ their children – terminology that implies that a child has been rendered unfit or \nunready in some way for the demands of schooling. The school’s mission becomes one of \ncivilising those children whose parents have not fulfilled their obligations adequately.  \n \nAnother framing device was ‘medicalisation’ – the attribution of offending behaviour to \nunderlying physical or psychological causes. A few children were thought to have been deaf in \nthe pre-school years and therefore to have suffered developmental delay. Others were \nconsidered to display autistic behaviour, though clinical diagnoses had not been made.   4 \nAlthough answers lie outside the scope of this research, we wondered whether autism was \nbeing used in a comparable way to ADHD (Timimi, 2005) as an explanation for behaviour that \ndoes not conform to attentive and docile bodies required in mainstream education.  \n \nThe discursive framing of reputation could also be applied to the child herself. Some children \nwere judged to be ‘manipulative’, others to be self-centred. It‟s all about me, one adult said, \nsumming up Chloe’s disposition; another described her as a little madam. Joe was reported to \nhave the concentration of a gnat. Hugo’s teacher felt there was something about him:1  \n  \nThere can be some children who are naughty, but they are likeable, and then you have \nsomeone like Hugo. Who‟s really good, but there‟s something about him, I just can‟t \ntake to him. Like today, it‟s his birthday and I have to be really nice to him, but I find it \nhard and I keep telling him off. The nursery staff were the same about him, I don‟t \nknow what it is. I don‟t like his mum, so maybe that‟s it. [EF28.10.06] \n \nDiscursive frames could reference more than one factor – eg a parenting narrative, physical \ncauses and\/or individual disposition. Matt’s behaviour was attributed both to language delay as \na result of deafness (corrected by operation), and to over-protective treatment by his mother, \nwho was said by one adult to use his deafness as an excuse. See also Hugo’s teacher’s \nremarks above. Discursive frames can tolerate apparent logical inconsistency therefore, \nwithout losing their explanatory integrity: a child can be considered both an ‘innocent’ victim of \nphysiology, family or circumstance and responsible for his or her behaviour (‘doing it on \npurpose’), thus replaying the duality of innocence and original sin that continues to run through \npublic discourses around children.  \n \nDisparate frames are granted coherence with reference to the assumption, derived from \ndevelopmental psychology, of a normal developmental course (Walkerdine 1988). Children \nwho fail to act, or to be recognised as acting, in accordance with expectations of what is normal \nfor children of their age are at risk of being judged a problem. As Burman notes, developmental \ndiscourses not only identify but also ‘pathologise’ differences from assumed norms, and render \nmothers subject to blame and scrutiny (2008: 50). Early years practitioners are likewise subject \nto the disciplinary effects of the discourse of normal development, risking censure (including \nself-censure) if ‘their’ pupils are not seen to be acting within the range of normal behaviour and \ncompetence. This helps to explain why open events such as assemblies or school plays often \ncaused anxiety for project teachers.  \n \nThere is a constitutive circularity in the discourse of normal development: specific child \nbehaviours come to be read as signs of deviation from the normal path; yet the integrity of the \nnormal path is consolidated by the identification of deviations. Individual acts by children are \nread metonymically, as ‘standing for’ the bigger problem; while the status of the bigger problem \nis constituted in the iterations of the acts that ‘stand for’ the offence. This has practical \nimplications for children who become subject to such framing, as it may lead teachers and \nother arbitrators to orient to ‘offending’ behaviours and pay less attention to those that stand \n‘outside’ the frame. Once a child’s reputation has begun to circulate in the staffroom, dining hall \nand amongst other parents, it may be very difficult for her behaviour not to be interpreted as a \n‘sign’ of such imputed character traits. Children who have acquired a strong reputation may \ntherefore find it harder to be good – or rather, to be recognised as good. \n \n                                                 \n1 Items in italics indicate excerpts from fieldnotes or video-recorded data.   5 \nReputations may be mobilised by any of the adults who work in a school setting, in addition to \nteachers – teaching assistants, key workers, lunch staff, playground supervisors etc. Indeed \nsuch staff, who often live locally, may have personal knowledge of children and families, which \nthen becomes available for the framing of reputation. Children may also enter the reception \nyear with reputations already partially in place. Carter had been assigned a personal key \nworker in nursery school because of behaviour problems. Jamie had been identified as a ‘deaf \nchild’ when he first went into the reception year. \n \nIt is important to emphasise that the frames that make sense of problem behaviour are \ndiscursive and not causal: one cannot simply predict that the occurrence of certain family \ncharacteristics, parenting practices or behaviours will lead to a problematic reputation. It is the \ndiscursive interpretation\/explanation of behaviour that that grants meaning and significance to \ndifference. Difference is produced by the discourse of normal development. \nThe pathologising of difference \nSubstantial amounts of time were devoted to teaching and modelling the rules and conventions \nfor maintaining classroom order, across all the project schools. Explicit statements and \nrationales such as the following were commonplace: \n \nT: stay on your bottoms so everyone can see …. Hands up, think, don‟t call out. \n[EF23.9.06] \nI can hear some children talking … it has to be quiet when I am doing the register \n[AB14.1.07] \n  Now let me see who is sitting beautifully [Assembly, AB15.11.07] \n \nHowever effective such disciplinary practices may be for a majority of the class, they also work \nto marginalise some children. Indeed it could be said that they work by marginalising a minority, \nso that ‘normal’ children can recognise themselves in their difference. While rule-breaking was \nsometimes dealt with unobtrusively, or indeed overlooked when teachers judged this to be \nappropriate, ‘disciplinary talk’ was typically done in public. In some instances children were \nquite clearly ‘made an example of’ for the edification of the class.  \n \n [Ms A has reprimanded Daniel. He is crying] She tells him that he can’t go outside to play \nand that he must sit on a spot that she indicates with her finger on the floor and read a \nbook. [He sits facing 3 other children] Ms A says ‘don’t you go talking and joining in with \nthose children Daniel, they’re being good’. [EF15.6.07] \n \nDaniel is publicly excluded from belonging with the ‘good’ children. He was again excluded, \nimplicitly, in the following example from his Year 1 class: \n \n…seconds later I hear Mr K saying „Daniel are you facing this way?‟ followed by „Well \ndone Mark for ignoring some silly children‟ [EF4.10.07] \n \nMark is congratulated for distancing himself from the ‘silly children’, with whom Daniel is \nimplicitly identified.  \nNot surprisingly, given the public nature of disciplinary events, other children made similar \njudgements:  \n   6 \nLucy says to me [about Chloe] „she‟s naughty, she doesn‟t sit on her bottom, she \ndoesn‟t tidy up‟. Sarah chips in: „she wouldn‟t sit down when we came in [EF06.10.06] \n \nWhen children begin to orient to others as exceptions, reputation is indisputably at issue. \nA different form of exclusion was observed with Jamie and, to a lesser extent, Ishmael and \nMatt. All three boys (from different schools) were thought to display autistic behaviours, and all \nwere granted exemption from some of the usual rules and routines of the classroom. Jamie’s \nexemption from classroom life was severe. Required to sit on a red ‘spot’ at the back of the \ncarpet, he was seldom engaged by adults during whole-class sessions. He was often ignored \nby the other children too, even though he would follow them around, smiling. Such exemptions \ncould be considered humane and flexible responses to children who seem to have difficulty \ncoping with classroom life. However they may exert a cost, in terms of a child’s status and \nidentity within the class. Jamie and Ishmael fulfilled an ‘exemplary’ function, enabling other \nchildren to be positioned as more mature: \n \nTessa seems to have attached herself to Ishmael. She mimics his behaviour \n(wandering, sitting in „unacceptable‟ places when it‟s registration, standing when the \nother children are sitting and so on. T: „Tessa stop it now and grow up. You are not to \ncopy Ishmael‟. [AB12.10.06] \n \nTessa is told to ‘grow up’ – ie to place herself ahead of Ishmael on the developmental course. \nIn the following example, the children working alongside Jamie do a similar developmental \n‘placing’ of themselves by contrast to him: \n \n[Jamie is sitting at craft table with 3 girls, working with clay. Jamie is sawing at his lump of clay \nwith a table knife and intermittently watching Girl1 closely] \n  \nGirl1  we need a sh- I’ve got a sharp knife [picking up her table knife] Jamie can’t have a \nsharp knife [notices Jamie’s knife] oh! Jamie can’t use a sharp knife \nGirl2  well I have some kind of a knife when- when I was three I had some kind of big knife \nGirl1  are you five now? \nGirl2  no. four. \nGirl1  I’m five \n[CD10.06video]  \n \nThe girls’ positioning of Jamie as less competent than themselves provides an opportunity for \nthem to rehearse and stabilise their own hierarchical status.  \nJamie also provided occasions for other children to rehearse the moral virtues that are strongly \npromoted in early years education, such as being kind and helpful. \n[Time for toilet and hand-washing before lunch] Seth says „I‟ll help Jamie‟ and takes \nJamie by the hand. „I‟ll wash his hands too because I‟m very helpful to James‟. Ms E \nresponds „You are, aren‟t you‟. Seth and Jamie walk hand in hand out of the classroom \n[CD30.11.06] \n \n[Ms G asks Jamie to come and sit next to her. He ignores her] Camilla goes over to \nJamie and bends over saying „Jamie, come and sit next to Mrs G‟. He gets up and \nmoves next to Ms G. „Thank you Camilla, you‟re so very, very kind to Jamie‟, says Ms \nG  [CD31.1.07] \n   7 \nJamie’s classmates are encouraged by teachers and assistants to ‘practice’ the virtues of \nkindness and helpfulness. While such encouragement is undoubtedly well-intentioned, it \npositions Jamie in a marginalised position: he becomes invisible except a resource with which \nother children can demonstrate their developing social and moral competence. Jamie’s \nsubordinate position was marked in other ways too: he was often addressed in a rather \n‘babyish’ tone, and was frequently referred to, as here, in the 3rd person – ie talked ‘about’ \nrather than addressed directly. He was often subject to physical interventions – touching, \nrepositioning, leading by the wrist etc (see also Appendix A, Example 4).  \nDifference thus has a complex status in the production of classroom order and the fashioning of \nreputation. One the one hand, tolerance of difference is low: in all four classrooms, conventions \nfor behaviour, appropriate feelings and moral conduct were continually emphasised. Yet on the \nother hand, difference seems paradoxically necessary to the maintenance of classroom order. \nA few children are granted a status as exceptions and examples, against which the normal \norder may recognise itself. Kristeva (1982) and Butler (1993) have called this excluded-yet-\nexemplary status that of the abject.  \nThe difficulties of being good \nBeing good is not a straightforward matter. Children must do ‘categorization work’ (Baker 2000) \nto understand how behaviour gets assigned to the category of ‘good’, or to the various related \ncategories that are used to regulate behaviour. These included, in the present data, ‘sitting \nbeautifully’\/’properly’\/’nicely’, ‘good listening’, being ‘sensible’, not being ‘silly’, putting hands up \nand waiting to be chosen to speak, not speaking while the teacher is speaking. As noted, a \nrange of social and moral qualities were also required – being kind, being helpful, working hard, \nbeing polite, sharing.  \n \nPart of the problem is that evaluations are made retrospectively: children must read ‘back’ from \nthe adult’s assessment to the behaviour which has earned it. At one school, weekly ‘certificate \nassemblies’ celebrated a wide range of behaviours and competences. For instance:  \n \n  For always listening and being kind and helpful \nFor always listening and working hard \nFor fantastic joining in on the carpet \nFor working really hard with his letter sounds \nFor settling in so well (2 new girls) \n \nInterpretive work is needed if children are to identify what they have done in the past week that \ncounted as ‘fantastic joining in on the carpet’, or ‘being kind and helpful’. And even when \nevaluations are made immediately after a particular action, children still need to do self-\ninspection to know what is specifically being referenced when they are commended for ‘sitting \nbeautifully’ or doing ‘good listening’. Occasionally, children did not seem entirely sure what they \nhad done in order to ‘earn’ an evaluation as good: \n     \nChristopher comes up to me and says „I‟ve got a certificate‟ \nMe  why? \nC  for being good \nMe  what did you do that was good? \nC  I was playing nicely \nMe  What were you playing with? \nC  I don‟t know [EF29.9.06] \n                         [See also Appendix A, Example 1]    8 \n \nEllie, below, must inspect her both her own past behaviour and her future intentions, and \nidentify the nature of Ms H’s dissatisfaction with her, in order to know what she will have done \nin order to ‘behave more sensibly’:  \nMs H starts a whole-group activity on the carpet. \nEllie, come and sit by me \nWhy? \nBecause you‟ll behave more sensibly, that‟s why [EF20.04.07] \nThe space between evaluations and the behaviours to which they retrospectively refer may be \nlarge enough for the evaluation to be withdrawn. Brent’s teacher was angry with him (and his \nmother) when he came to school in wet clothes. As the class sat on the carpet before \nassembly, Ms A picked up a (blank) certificate:    \n \nThis certificate was for you Brent, it was for good listening. I can‟t give it to you now \ncan I, „cause you didn‟t listen to me yesterday when I told you not to get soaked again‟. \nShe tells the TA in front of the assembled children that Brent‟s mum had been with him \nand hadn‟t done anything about it [EF06.07.07] \n \nBrent’s offending behaviour (coming to school ‘soaked’) is retrospectively identified as a breach \nof the ‘good listening’ for which he was prospectively to be commended, although he was not \naware of the impending commendation until the point at which it was withdrawn. Evaluations \nand behaviour may exist in a strange ‘future pluperfect’ timescale in which the import of \nchildren’s own actions will have been deferred, or even altered, by unforeseen events and \nunpredicted interpretations by others.  \n \nMixed messages and double meanings \nThe incident involving Brent demonstrates, further, how classroom discipline may be a site of \nmixed messages. It is unclear whether Brent is being admonished for not doing what he was \ntold, or for not exercising self-discipline. As Millei (2005) notes, teacher-led control operates \nagainst self-discipline, since the former is exerted externally and the latter is supposed to \noperate internally. There is also possible ambiguity as to whether Brent’s teacher was ‘really’ \ndispleased with the nature of his listening, or rather angry at him and his mother. The incident \nalso demonstrates how matters relating to learning and discipline are often intertwined (cf Pryor \n& Torrance, 2000). ‘Good listening’ may be celebrated not only because it indicates \nengagement with learning, but also because it signals compliance and discipline of the body. \nSocial, moral and cognitive competences were often linked in this way in the project \nclassrooms. In the question-answer exchanges that form a central part of whole-class \npedagogy, successful participation was not just a matter of knowing the right answer, but of \nwaiting to be chosen, and adopting the appropriate posture. \n \n [Mr W is leading the class in a counting song]  \nThe song demands that children calculate what number there will be when more is \nadded, and Mr W chooses children with hands up to give their answer. Chloe \ncomplains that he hasn‟t chosen her, „and I know the numbers‟ (she seems to be \ncounting on her fingers and is getting her hand up). Mr W says he only chooses \nchildren who are sitting and singing beautifully. She says „I am sitting nicely‟, and Mr W \nsays „I know you are, that‟s why I‟m really pleased with you‟, and the song continues \n[EF10.11.06] \n   9 \nNumeracy and discipline are inextricably linked here. The example also demonstrates the \nsignificance of pleasing the teacher. Evaluations were often linked to expressions of happiness, \nsadness or pride by the teachers; eg: \n \nMs J praises class in collective worship for „sitting beautifully and making me happy‟ \n[EF30.9.06] \nMs L says that she is going to get very sad because Tessa is not listening  \n[AB10.10.06] \n \nBeing ‘good’ is also connected therefore to pleasing the teacher and winning her approval. \nMoreover, the economy of choosing that regulates participation in whole-class situations \nmeans that children are often obliged to compete with one another for that approval. \nDisappointments, however mundane, are a pervasive feature of classroom life [See Appendix \nA, Example 2].   \n \nMost teachers, aware of the corrosive effects of disappointment, tried to ‘distribute’ approval to \nall children – for example by ensuring that everyone was able to earn rewards such as stickers \nor tokens; by giving certificates for a wide range of ‘achievements’; by finding something to \npraise all children. However such commitments to a kind of equity in the distribution of praise \nmay actually call into question the sincerity of teachers’ expressions of praise. While many \nchildren appeared happy to compete for stickers, certificates or other ‘tokens’ of merit, others \nseemed less impressed. Praise, we surmise, will only work as a disciplinary device if children \nbelieve that it is sincerely meant and genuinely earned; and moreover if earning praise through \nappropriate behaviour ‘matters’ to them.  \n \nPerhaps unsurprisingly, given the public nature of collective discipline, children at times took it \nupon themselves to hold other children accountable for rule breaking, or to report it to the \nteacher. This was a risky strategy however: while it sometimes earned teachers’ approval, it \nmight also be treated as ‘telling tales’ – an unpopular practice with children and adults.2 This \nilluminates further the mixed messages that circulate in classroom discourse. Children might \nreasonably expect that helping to enforce rules would win them approval, since teachers clearly \ncare about rules a good deal, and moreover continuously represent them as everybody’s \nbusiness – a public, collective responsibility. Yet, by taking it upon themselves to act on behalf \nof the teacher, children may be judged instead to be usurping power that does not belong to \nthem, and perhaps also be viewed by their peers as acting disloyally.  \n \nAsymmetries of power and participation \nAs the problem of telling tales indicates, it is also necessary for children to recognise, and to \naccept, the ‘asymmetrical’ nature of classroom interaction, which sets different entitlements for \nadults and children (Edwards & Furlong, 1978). Children are not expected, for instance, to \n                                                 \n2 Compare these examples: \n(a)  Miss, only 2 people in the sand. Ms N gently reminds the 3rd boy that he should find somewhere else. \n[AB28.9.06] \n \n(b)  Ms P tells the children that ‘one of their mummies has said that some of the boys are being a bit rough \nand that they are pulling at jumpers and doing pretend kicking’. Immediately Chelsea tells on one of the \nboys but [I] can’t make out who she has named. \nMs P:  did you tell one of the dinner ladies? Chelsea nods. Well don‟t get people into trouble two times. \n[GH28.9.06) \n   10 \nquestion the reasons for teachers’ requests (see example of Ellie, above), nor to give \nunsolicited advice:   \n \nIn the art area, Ms G is trying to wind up a stick of glue. „Why don‟t you wind it that \nway?‟ suggests Daniel to Ms G. „Instead of telling me what to do, why don‟t you \nconcentrate on your own work. Turn around and get on‟ she replies [CD7.3.07]  \n \nSee also Appendix A, example 3, where Rose and Carter attempt to ‘help’ their teacher \nrelocate other children on the carpet. \n \nChildren also need to understand how teachers’ interest in what they have to say may fluctuate \naccording to the asymmetrical rules for participation. The conventions for group talk are that \nteachers generally have the right to set and change topics, and to identify who will speak next. \nWithin this frame, teachers may display considerable interest in children’s contributions.3  \nHowever children need to learn that they cannot rely on teachers’ interest if they speak ‘out of \nturn’, make unsolicited contributions or misread the topic of the current activity.   \n \nIn summary, being good is a complex matter. Children need to exercise interpretive skills to \nrelate their own behaviour to teachers’ expectations and evaluations. They must be able to \nnegotiate conflicting demands to comply with external authority and to discipline themselves. \nThey must show their commitment to collective discipline without trespassing on teachers’ \nterritory. They must be able to work in a climate where competition and disappointment are \ncommonplace, value praise enough to work for it, and be able and willing to shoulder some \nresponsibility for adults’ pleasure and happiness. And some children must be able to attempt all \nthis in the face of a problematic reputation that colours others’ attitudes and perceptions. \nEmotion work: the regulation of feelings and moral conduct \nEducation in the reception year, as noted, includes learning about feelings and moral conduct - \nwhat it is possible and appropriate to feel, and how one should act towards others. Some \nsessions were explicitly devoted to the discussion\/modelling of feelings and attitudes – for \ninstance ‘passing a smile’ round the circle, or saying something nice about the person to your \nleft. While feelings are conventionally held to be a ‘personal’ matter, in the reception classroom \nfeelings can be evaluated, and even modified, by an authoritative adult. In the example below, \nchildren are asked to speculate on how the head teacher will feel about children who have not \nreceived a sticker for being ‘good’. \nSupply teacher tells class she needs them to be „really good if they want [a sticker] \nbefore they go to collective worship; Mrs C [head] will see which ones of you have \nstickers. How will Mrs C feel if you don‟t have a sticker? \nSad – yes \nTerrified – well I don‟t think so, but it‟s a good word \nAngry – yes she might be a little angry \nUnhappy – she might be \nGrumpy – well she might be, but I was thinking of another word, it‟s very long, \ndisappointed‟  [EF14.5.07]] \n \nSeveral ‘lessons’ are combined here: how to name the feelings that would be appropriate in a \nparticular circumstance; the importance of pleasing adults through good behaviour; the \n                                                 \n3 For example: [Children are sitting in a circle, each in turn saying „I like the smell of…‟] As each child answers Ms \nP gives a little gasp (as if really excited by children‟s responses [GH14.9.06]   11 \ncorrectness of the answers given. Emotional, disciplinary and learning issues are again \nintertwined. The teacher evaluates the children’s answers as she might in, say, a literacy \nlesson (‘I was thinking of another word’). Emotion work may be hard to distinguish, for some \nchildren, from more academic topics, and may not always be interpreted as something that \nrelates to their ‘own’ feelings:  \n \nAdil arrives late and hangs his coat on the floor. He speaks to Farah and it seems from \nthe tone of his voice and his facial expression that he is cross with her about \nsomething […] he does the usual business with his name card and I note that he still \nputs his name card on the „happy‟ face. [AB5.12.06] \nMimicry and authenticity \nThere is an element of mimicry involved in this education of the emotions through rehearsal \nand modelling. Occasionally this guided mimicry was explicit, as when Ben was instructed to \nshow Jamie his ‘sad face’: see Appendix A, Example 4. This highlights the ambivalence of \nmimicry as a way of ‘teaching’ emotions. Precisely because children are presented with \nexamples and performances – ie with imitations – doubts may insinuate themselves about the \nsincerity of the emotional display. Do children necessarily believe that teachers are genuinely \n‘sad’ when they fail to ‘sit nicely’? How might such sadness compare with a child’s own \nsadness over losing a pet, or a grandparent; or being bullied or ignored in the playground?  \nHow does the performance of ‘passing a smile on’ at the teacher’s behest, or saying nice things \nabout next person in the circle, relate to the feelings that children may already have developed \ntowards one another? What is the status of the ostentatious attentiveness that children often \nperform in the attempt to win teachers’ approval or attention? Or indeed of teachers’ \nexaggerated displays of interest and surprise? Mimicry renders utterances liable to being read \nas ironic.  \n \nSome performances seemed explicitly to be marked as ironic by the child concerned. For \nexample: \n \nChildren are returning to the classroom with their PE kits […] „Charlie, I want you to get \nchanged very quickly today. Think about what you need to do first‟, says Ms T. Charlie \nputs his finger to his chin and pulls a pseudo-„thinking‟ face. „No! You‟re being very silly \nnow Charlie! I want you to think about what you‟re doing‟ responds Ms T.  [CD8.2.07] \n \nThe strong reaction of Charlie’s teacher suggests that his response is seen as an act of \ninsubordination.4 Irony, when deployed by children, is a potential threat to the moral economy \nof the reception classroom, since it is a sign that children may be capable of double meanings \nand dissimulation, and therefore of departure from the repertoire of simple and transparent \nemotions that are held to be appropriate to the ‘proper’ five-year old (see below). Irony \ninterferes with the ‘legibility’ of children and their internal states, on which early years practice \ndepends. Yet as noted, the pedagogy of mimicry itself raises the spectre of ironic performance.  \n \nBhabha (1994) identified mimicry as an essential, yet fundamentally ambivalent part of the \ncolonial relation. Aspects of that colonial relation are enacted, we suggest, in the ‘civilizing’ \nemotional and moral projects of early education. Children who successfully perform the mimicry \n                                                 \n4 There may also be a hint of irony in Harry’s contribution, which moreover seems to play off the relationship \nbetween discipline and educational work: \n[Ms H has stopped a group of boys from playing roughly on the soft bricks] A little while later when the children are \non the carpet doing key word recognition, Harry says „like “no soft play”‟ when Ms H holds up the word „no‟ [EF]   12 \nrequired of them achieve a kind of camouflage, in Lacan’s terms: they become ‘mottled’ against \na mottled background (1977: 99). Some children are unable consistently to become ‘mottled’ \nagainst the background of normative expectations, even though they may perform convincing \nacts of mimicry on some occasions, as Jamie and Carter were sometimes able to do. However \nneither attained a degree of camouflage that allowed them to evade their problematic \nreputations.  \nThe ‘proper’ child \nThe discourse of the reception classroom offers children an idealised (if not always consistent) \nversion of the acceptable or ‘proper’ child, and encourages them to mimic the behaviour, \nemotions and cognitive abilities of this proper child. However, children must be able to \nrecognise something of themselves and their experiences in this idealised version. Drummond \net al (2004) are concerned that the Foundation Stage goals define ‘appropriate’ feelings, and \ndo not acknowledge the possibility that children might also express ‘the colourful, difficult \nfeelings that adults experience as challenging, such as anger, frustration or grief’. Chelsea’s \nresponse, below, suggests an experience of the significance of letters that is unlikely to be \ninvoked in Postman Pat stories: \n \n[The class is discussing „Postman Pat‟s Windy Day‟] \nAssistant:    who likes to get a letter through the door? \nChelsea:    as long as you don‟t have to pay some money [GH11.1.07]  \n \nIn order to be (seen to be) good, children need to ‘pass’ as the proper child who is fabricated in \nthe texture of classroom interaction and the discourse of normal development. There may be \nmany reasons why individual children are unable or unwilling to perform the mimicry that this \nrequires. Some may be less astute than others at reading the interactional conventions that \nregulate definitions of good behaviour, or less able to handle the frustrations and \ndisappointments that are inevitably involved. Others, especially if they have life skills and \nexperiences that exceed those encompassed in the simulacrum of the proper child, may be \nunable to suspend their disbelief in the moral economy of happiness, sharing and kindness that \nis promoted in the reception classroom.  \n \nBodies and objects \nIn the reception year, monitoring and bodily discipline is a pervasive and urgent concern. While \nall children were subject to continuous monitoring and bodily regulation, those whose behaviour \nwas causing concern were differentially marked for surveillance and discipline. Such children \nwere more likely than others to be watched, touched and manipulated without their consent by \nadults.5 As a previous ESRC investigation noted (Piper, MacLure & Stronach, RES-000-22-\n0815), children must ‘earn’ exemption from unsolicited touch by demonstrating that they have \nreached an appropriate developmental stage. Children who were becoming a problem were \nalso likely to be more closely monitored – for instance through behaviour plans or the attentions \nof a personal worker. For some children, this seemed to exacerbate their problems. Carter, for \ninstance, whose behaviour programme included trying to get him to comply with at least one \n                                                 \n5 For example:  \nChildren return from play. Sitting on the carpet and working from the whiteboard. Ms G sat at the back of \nthe group and pulled Luke P backwards so that he was sitting next to her. He wriggled forwards again. \n„No, do as you‟ve been told‟ she said as she was pulling him back again. Luke started crying. Ms G \nignored him. He stopped crying and wriggled forwards again. „If you do it again I‟ll sit you outside the \nclassroom. Do you want to go and speak to Mrs A [head teacher]‟? [CD10.10.06] \n   13 \nadult request per day, was observed to become upset and physically resistant when adults \nattempted to hold his wrist or lead him away. He also often moved out of sight of his key \nworker, and by loudly singing or humming to himself, seemed to try to ‘block out’ adults’ \nattempted interventions. Other children similarly complained or became upset when physically \nmanipulated. \nCertain objects operated as materialisations of power in the four project classrooms, aimed at \nrendering the children’s bodies as docile. For instance carpeted areas were key sites: the act of \nsitting on the carpet carried with it a set of implications where the contours of the child’s body \nhad to satisfy the requirement of ‘sitting up straight, with arms folded and legs crossed’. Thus \nmatter such as carpeting comes to make itself felt in the broadest sense - emotionally, \nphysically and psychologically. The engagements that occur when a child’s body connects with \nthe material trouble the boundaries which are ordinarily erected between stuff that is inert and \nthat which is ‘natural’. Intra-actions (Barard, 2008) between the material and the body worked \nto subdue children’s bodies and contribute towards the ebb and flow of agency. Children were \nsent to ‘stand by the door’ in one school when they had failed to comply with the requirements \nfor sitting on the carpet. However these significant locales were also sites of resistance. For \ninstance, while the intra-action between the ‘spot’ by the door and the child initially evoked \nobvious discomfort, the power of this spot had a limited life and was clearly affected by time. \nChildren found other material items, such as the nearby Velcro name stickers, with which to \ndistract themselves, and thus changed the discursive status of the act of ‘standing by the door’. \nSomerville (2004) notes, ’just as we can theorize that language is always already there, we can \nalso theorize that body\/matter is always already there, and the body can intervene in discourse \njust as discourse can intervene into the body’ (p. 51).  \nDiscussion.  \nThe classroom is an important site for the production of problematic reputations. The public \nnature of discipline, conducted under the imperative to form a crowd of children into the \ncollectivity of a ‘class’, means that children who diverge from the rules are identified as \n‘different’ in plain view of other children and adults. There are undoubtedly good reasons for \nclassroom rules – courtesy, democratic participation, safety, a congenial learning environment. \nHowever these rules are operationalised in ways that marginalise a minority of children, who \nbecome examples against which the preponderance may recognise itself as ‘normal’.   \n \nSome key principles of early years education may have unintended consequences in terms of \nbehaviour. Core values such as the importance of home-school links may, however sensitively \ninterpreted, also furnish resources for the narrative ‘framing’ of children’s reputations in terms \nof apparent shortcomings of their families or communities. Hughes (2004) notes that home-\nschool relations can be a powerful and humane educational support, but may also involve \ninvasion of privacy. \n \nThe integrative, holistic approach to early years education in the UK, which embraces social, \nemotional, personal and cognitive development, may make it difficult for some children to \nhandle mixed messages and decode the rules and conventions governing good behaviour. \nMoreover the association of behaviour with emotions, and the coupling of academic \nperformance with competition for teachers’ approval, means that early years classrooms can \nbe places of uneven emotional temperature, which may impact on some children more than \nothers. In the current ethos of holistic development, children who find themselves to be failing \nin behaviour terms may also feel themselves to be judged more comprehensively a failure, as a \nperson, friend or learner.  \n   14 \nNotions of appropriate behaviour are also deeply influenced by the assumption of a normal \ndevelopmental course, a notion that may have become even more deeply embedded with the \nintroduction of the Foundation Stage. Teachers are themselves subject to the disciplinary gaze \nof policy and audit, and the expectations of parents, rendering them accountable for perceived \ndeviations from the normal trajectory sketched in the stages and goals of the Foundation \nStage.   \n \nThe reception classroom is also a place of mixed messages concerning compliance and \nautonomy. Children were expected both to internalise self-discipline and to obey adults without \nquestion. This may reflect the liminal status of the reception year itself. Caught between the \nmore flexible, child-centred ethos of nursery education and the more formal arrangements of \nKey Stage 1 of the national curriculum, the reception year may be troubled by inconsistencies \nof ethos and expectation (cf Drummond et al, 2004). These inconsistencies may be further \nlinked to the mixed ideologies that inform primary education in the UK, where a broadly liberal-\nhumanist notion of the child as the locus of her own potential comes up against more \nauthoritarian conceptions of the child as subject to adults’ power.  \n \nBeyond reason: the limits of rationality and intentionality \nThe research has challenged the assumptions of rationality and intentionality that underlie early \nyears practice (see Output 3). These hold that children do things for a reason, that they either \nor do not act intentionally, and that by understanding the consequences of their actions (for \nthemselves and others) they will be able to change their behaviour. However it was often \nunclear to us whether children were or were not acting ‘on purpose’, and what the rationale for \ntheir actions might be. This may be due in part to the challenges that children face in \nnegotiating the mixed messages and multiple meanings that attach to their own behaviour. \nHowever the notion of the rational individual who is able to ‘know herself’ has also been subject \nto a more general critique within poststructuralist theory. Quasi-therapeutic interventions that \nseek to help children understand the grounds and consequences of their actions may therefore \nhave their limitations.  \n \nConclusion: the chimera of the „proper child‟ \nWhile the moral and pragmatic landscape of the reception classroom looks at first glance to be \nclearly mapped, some children may find it more difficult than others to identify and then meet \nthe conditions for behaving like the ‘proper child’ that adults want them to be. Perhaps more \ndisconcertingly, some may not be able to believe in that child. We suggest that the mismatch \nthat some children may experience between their out-of-school realities and the proper child \nthat is conjured in the classroom may be one source for more visible disaffections that emerge \nin later years at school. \nImplications \nIt is difficult to offer ‘practical’ suggestions since the problematic of reputation and difference \ndoes not operate at an individual level, but is produced through deep-seated discourses and \nbeliefs. This is undoubtedly the reason why ‘behaviour’ has been such a persistent and \nintransigent problem. It is important to emphasise that the teachers who took part in the project \nwere caring and concerned about children’s education and wellbeing. We saw many instances \nof dedication, determination and generosity of spirit in teachers’ and other adults’ interactions \nwith children. The processes that produce winners and losers in the reputational stakes happen \n‘behind the backs’, as it were, of individuals. \n   15 \nWe might however offer some tentative proposals. Firstly, professionals might attempt not to \nintervene too early with explanations and ‘solutions’ for children who are beginning to emerge \nas a problem. For some children in the research, apparent developmental delays and \ndeviations seemed to disappear, or to assume less significance for adults, as the year of the \nresearch progressed. Practitioners might also reflect on the tacit developmental maps that \nunderlie early years practice, and how these may generate ‘deficit’ views of some children, \nparents and families.  \n \nThe public nature of discipline in the reception class is a further area for attention. Can the goal \nof forming children into a collectivity be uncoupled from the public administration of praise and \nreprimands?  Relatedly, and perhaps controversially, practitioners and educators might \nconsider the possibility of reducing the emotional quotient of classroom experience.  \nACTIVITIES \nPapers were presented at the International Congress of Qualitative Inquiry, Illinois (2007), the \nAmerican Educational Research Association Annual Meeting, Chicago (2007) and the British \nEducational Research Association Annual Conference (2007). The project was featured in a \nKeynote Symposium to the British Educational Research Association Annual Conference \n(2008). An international conference, drawing on the conceptual and theoretical framework of \nthe research, was held at MMU: ‘The 3 Rs: Reviewing, Renegotiating and Reframing Early \nChildhood (2007). \n \nOUTPUTS \nJones, L, Holmes, R, MacRae, C. & MacLure, M. (2007) Documenting classroom life: how \ncan I write about what I am seeing?  Paper presented to the 3rd International Congress of \nQualitative Inquiry, Urbana-Champaign, Illinois, May 2007  \n \nMacLure, M, Holmes, R, Jones, L. & MacRae, C.  (2007) Silence and humour as resistance to \nanalysis.  Paper presented to the Annual Meeting of the American Educational Research  \nAssociation, Chicago, April.  \n \nJones, L, Holmes, R, MacLure, M. & MacRae, C. (2007) Pathologising difference: occupying \nnon-conformity in an early years classroom. Paper presented to the Annual Conference of the \nBritish Educational Research Association, London, September 2007.  \n   16 \nReferences \nBaker, C. (2000) Locating culture in action: membership categorisation in texts and talk, in A. \nLee & C. Poynton (eds) (2000) Culture and Text. Discourse and Methodology in Social \nResearch and Cultural Studies. Lanham, MD: Rowman & Littlefield. \nBhabha, H. (1994) The Location of Culture. London: Routledge. \nBourdieu, P. (1991) Language and Symbolic Power. London: Polity Press. \nBrown, T. & Jones, E. (2002) Action Research and Post-modernism: Congruence and Critique. \nBuckingham: Open University. \nBurman, E. (1994) Deconstructing Developmental Psychology. London: Brunner-Routledge. \nBurman, E. (2008) Developments: Child, Image, Nation. London: Routledge. \nButler, J. (1993) Bodies that Matter, On the Discursive Limits of \"Sex\". London: Routledge. \nButler, J. (2004) Undoing Gender. London: Routledge. \nDavies, B. (1994) Poststructuralist Theory and Classroom Practice. Geelong, Deakin University \nPress. \nDfES (2005) Promoting social, emotional and behavioural skills in primary schools. The \nStandards Site: http:\/\/www.standards.dfes.gov.uk\/primary\/features\/primary\/873235\/ \nDrew, P. & Heritage, J. (eds) (1992) Talk at Work: Interaction in Institutional Settings. \nCambridge: Cambridge University. \nDrummond, M.J. et al (2004) Inside the Foundation Stage: Recreating the Reception Year. \nFinal Report. London: Association of Teachers and Lecturers. \nEdwards, A.D. and Furlong, V.J. (1978) The Language of Teaching. London: Heineman. \nFoucault, M. (1977) Discipline and Punish. Harmondsworth: Penguin. \nH.M. Government (2004) Every Child Matters: Change for Children. London: HMSO. \nHughes, M. (2004) Home-School Knowledge Exchange and Transformation in Primary \nEducation. End of Award to the Economic and Social Research Council. Swindon: ESRC. \nJames, A. & Prout, A. (eds) (1997) Constructing and Reconstructing Childhood: Contemporary \nIssues in the Sociological Study of Childhood, 2nd edn. London: Falmer. \nKristeva, J. (1982) Powers of Horror: An Essay on Abjection. New York: Columbia University \nPress. \nLacan, J. (1977) The Four Fundamental Concepts of Psychoanalysis (ed J.A. Miller; trans A. \nSheridan). New York: W.W. Norton. \nMacLure, M. (2003) Discourse in Educational and Social Research. Buckingham: Open \nUniversity Press. \nMillei, Z.J. (2005) The discourse of control: disruption and Foucault in an early childhood \nclassroom, Contemporary Issues in Early Childhood, 6, 2: 128-139. \nPryor, J. & Torrance, H. (2000) Questioning the Three Bears: the social construction of \nclassroom assessment, in A. Filer (ed) Assessment: Social Practice and Social Product. \nLondon: Routledge Falmer. \nSomerville, M. (2004) Tracing bodylines: the body in feminist poststructural research. \nInternational Journal of Qualitative Studies in Education, 17, 1: 47-63. \nTimimi, S. (2005) Naughty Boys: Anti-Social Behaviour, ADHD and the Role of Culture. \nLondon: Palgrave. \nWalkerdine, V. (1988) The Mastery of Reason: Cognitive Development and the Production of \nRationality. London: Routledge.   17 \nAnnexe \nAppendix A: Annotated examples from classroom data \n \nTranscription conventions: \n \nT    Teacher \nTA    Teaching Assistant \nA, J etc  Child identified by initial capital of name \n<…>    angle brackets: enclose tentative interpretation of word(s) \n* * *     asterisk(s): inaudible syllable(s) \nCAPS   very loud speech \nemphasis  underlining: noticeable emphasis on part of utterance \n\/\/    point at which two speakers overlap \n[context]  square brackets: enclose contextual information accompanying \nutterances \ncomment  comments to right of transcription draw attention to key points \n \n \n(1) What does being good mean? \n \nT  NOW I know that Aisha is looking for \n  a  very smart quiet person to take \n  the register  [whispers aside to \n  another child] \nA  Sally \nT  you want to choose Sally [as S walks \n  to front] \n  why did you choose Sally? \n    (…) \nA  because she’s good? [sounds a little \n  uncertain] \nT  because she was good and- what \n  was she doing on the carpet? \nA  sitting nicely \nT  was she [nodding; handing over \n  register] that was a good idea <then \n  wanting to choose her>. Here you go \n  [handing register to A. they walk off, \n  both holding onto register] \n \n[AB12.06, video]  \n \n \n \n \n \n \nClass is seated on the carpet. Aisha, \nis invited to choose another child to \naccompany her to the school office \nwith the register (each child in the \nclass is given this privilege on her \ndesignated ‘special day’). \n \n \n \n \n \nAisha does not seem entirely certain \nwhy she has chosen Sally. \n \n \n \n \nAlthough the teacher commends \nAisha’s ‘idea’, it is not clear that the \nidea is entirely Aisha’s own. In \ninteractions such as these, teachers \nintervene in children’s ‘internal’ \nreasoning and decision-making \nprocesses in order to instruct them on \nhow to make appropriate evaluations. \n     18 \n  \n(2) Competition, Selection; disappointment \n \n[Class is queuing up in the classroom, \nwaiting to go out. T and two assistants are  \nwalking up and down the line] \n \nT  OK. Let me see is it the front the \nmiddle or the back of the line that’s \nthe best part of the line. Ooh! It’s \nhard to choose today! \nC  [Carter gives a little yelp. But is \nstanding very straight and still. TA \nwalks up and looks at him] \nT  this might be – at the front let me see \n– oh some very smart children \/\/here \nat the front \nC  \/\/[yelps again] \nTA  shh! [taps C twice on shoulder] \nT  now at the back, let’s see – oh! It’s \nvery very smart at the back. And in \nthe middle [walks back] oh yes it’s \nnice and straight in the middle as \nwell. Very good that’s a lovely line! \n  [Class waits in line. C is tapping his \nfoot, looking around. T is talking to \nanother adult] \nC  <indecipherable> \nT  if we can give Mrs I a really good \nsurprise, now let’s see –  \nC  have you got a key? [to T; class is \nwaiting to for a door to be unlocked] \nT  - she can hear us you know all the \n  way down there. Let’s see if we can \n  be – perfectly quiet <that means> no \n  sounds a-all the way there and back \n  again \nC  [C is kicking toys that he has \nknocked off a counter top next to \nhim. TA goes over to him. Two boys \npick the toys up \nTA  thank you boys that was very helpful \nC  I done it too [ie picked up the toys \nthat he had knocked over] \n  [children continue to queue. C is \nyelping like a little seal. \n[GH1.07video] \n \n \n \n \nCompetition and selection \n \n \nC is attempting to comply and \ncompete. But his desperation for \nattention\/ approval actually ‘damages’ \nhis performance \n \n \n \nUnsolicited touch \n \nQuite exaggerated expressions of \napproval\/pleasure \n \n \n \n \n \n \n \n \n \n \n \nUnsolicited intervention by C \n \nDiscipline under the imagined gaze of \ncolleagues \n \n \n \n \n \n \n \n \n \nBoys’ actions are granted approval as \n‘helpful’ by implicit contrast to C. \nC tries to evade this exemplary \ncontrast and claim approval for \nhimself too \n \n \n     19 \n(3) ‘Helping’ the teacher? \n \n[Class is sitting on carpet while T, seated at \nfront, assembles some pictures] \n \nT  This morning- \nR  Miss he’s not sitting up \nT  [quietly] pardon? You go and sit next \n  to Olivia then [to another child] \nC  There’s space there [pointing behind \n  him] why don’t you put him in there \n  because there’s a big space \n  [T talks briefly with another adult; \n  class is restless] \nT  shhhhh. Joanna can you do a little \n  job for me? Stand up and go and sit \n  next to Jason [points to space that C \n  had indicated] \nC  [quietly, in triumph?] yeah! \n \n[GH12.06video]  \n \n \nThe boundary between being helpful \nand (mis)appropriating teachers’ \npower is often blurred.  \n \n \nIs Rose ‘helping’ or ‘telling tales’? \n \n \n \nIs Carter ‘helping’ or trespassing on \nT’s territory? \n \n \n \nThe teacher does not acknowledge \nthat she is acting on the children’s \ncontributions, and leaves the question \nof surrogate power implicit. However \nCarter’s final ‘yeah!’ suggests that he \nhas read the situation in these terms. \n(4) Mimicry: educating the emotions   \n \n[Ms Y, teaching assistant is at table with \ngroup of children. Jamie is playing in home \narea alongside Ben and Anna, who don’t \nseem to want to play with him]  \n \nB  no, no you’re hurting me [to Jamie] \nA  he’s hurting you, he’s hurting (…) \n  quick  go and tell- go and tell Mrs Y \n  [calling over to TA at table] Mrs Y. \n  Mrs Y. Mrs Y, Jamie’s hurting us in \n  the house  \nMs Y  JAMES [v loudly] James [leans \nsideways to try to see Jamie behind \nlow wall of play house. 2 boys at \ntable watch with interest. \n  [Jamie, kneeling, looks up, smiling \n  tentatively] \nB  [in play house] Anna you told- you told  \n  Mrs Y \nMs Y  STAND UP PLEASE [loudly; stern \n  voice] \n[Jamie stands up, holds out empty \nhands to Ms Y. Ms Y is now \ncrouched down on other side of low \nwall of house] \n  come here [beckoning with finger]  \n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   20 \nc’mon [pulling J towards her by his \n  outstretched hands. Leans into his \n  face]  \nwhat are you doing? [loudly, slowly] \n  [J looks down] \nMs Y [still holding J’s hand, beckons to Ben \n  in house-] \n  Ben come here \n  [Jamie looks up at Ben] \nB  Eh? \nMs Y show him your sad face Ben [quite \n  quietly] show him your sad f-   \n  ohh! [exaggerated gasp, for Jamie’s \n  benefit] look at Ben \n  [Jamie looks]  \nMs Y  SAD FACE [v clear & loud] ohh –  \n  sad face!  \n[Ben comes into shot, doing exaggerated \nsad face, pouted bottom lip.]  \nMs Y pulls Jamie’s chin round to make him \nlook at her] \n<right> look at me. Not happy \n[shaking head. Jamie  looks down] \n‘cos you’ve hurt him. not happy [J \nnot looking at Ms Y]  \nsay you’re sorry \nJ  I’m sorry \nMs Y  good boy. Shake hands [still holding \nJ   by left   arm, throughout] \nS  [shakes hands with Ben, using left \n  hand. Walks  back into house, \n  turning his back on Ms Y] \nMs Y  sorry. No hurting \n \n \n[CDAutumn06, video] \n \n \n \n \n \n \nUnsolicited touch \n \n \n \n \n \n \n \n \n \n \n \nBen is asked to display\/mimic emotion  \n \nMs Y displays (exaggerated) \nemotional reaction \n \n \n \n \nBen ‘mimicking’ sad face \n \n \nUnsolicited touch \n \n \n \nMs Y’s speech has features \nassociated with talk to younger \nchildren – tempo and intonation; 2-\nword syntax; repetition \n \n     21 \nContact: \nProfessor Maggie MacLure \nEducation and Social Research Institute \nManchester Metropolitan University \n799 Wilmslow Road \nDidsbury \nManchester M20 2RR \n \nTel (0161) 247 2053 \nEmail m.maclure@mmu.ac.uk "}