{"doi":"10.1504\/IJPLM.2008.019968","coreId":"140454","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/3116","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/3116","10.1504\/IJPLM.2008.019968"],"title":"Practitioner requirements for integrated Knowledge-Based Engineering in Product\nLifecycle Management.","authors":["Bermell-Garcia, Pablo","Fan, Ip-Shing"],"enrichments":{"references":[{"id":37938670,"title":"A Best Practice Guide – Achieving Competitive Advantage through Knowledge-Based Engineering'.","authors":[],"date":"1999","doi":null,"raw":"Cooper, S., Fan, I.-S. and Li, G. (1999). 'A Best Practice Guide – Achieving Competitive Advantage through Knowledge-Based Engineering'. British Department of Trade and Industry (DTI). WWW document: http:\/\/www.ds-kti.com\/pdf\/kti_dti.pdf (accessed 18th May 2006).","cites":null},{"id":37938691,"title":"A knowledge framework to support engineering design. In:","authors":[],"date":"2000","doi":"10.1007\/978-1-84628-061-0_14","raw":"Li, G., Bracewell, R. H. and Wallace, K. M. (2000a). A knowledge framework to support engineering design. In: 7th ISPE International Conference on Concurrent Engineering, Lyon, France, 17-20 July 2000, International Society for Productivity Enhancement.","cites":null},{"id":37938689,"title":"A knowledge-based engineering design tool for metal forging'.","authors":[],"date":"2006","doi":"10.1016\/j.jmatprotec.2006.04.062","raw":"Kulon, J., Mynors, D. J. and Broomhead, P. (2006). 'A knowledge-based engineering design tool for metal forging'. Journal of Materials Processing Technology. Vol. 177, pp. 331-335.","cites":null},{"id":37938739,"title":"A product information modelling framework for product lifecycle management'.","authors":[],"date":"2005","doi":"10.1016\/j.cad.2005.02.010","raw":"Sudarsan, R., Fenves, S. J., Sriram, R. D. and Wang, F. (2005). 'A product information modelling framework for product lifecycle management'. Computer aided design. Vol. 37, No. 13, pp. 1399-1411.","cites":null},{"id":37938684,"title":"A rule-level knowledge management system for knowledge-based engineering applications. In:","authors":[],"date":"2002","doi":"10.1115\/detc2002\/cie-34501","raw":"Fan, I.-S., Li, G., Lagos-Hernández, M. and Bermell-Garcia, P. (2002). A rule-level knowledge management system for knowledge-based engineering applications. In: Proceedings of DETC’02, ASME International 22nd Computers and Information in Engineering, (CIE) Conference, Montreal, Canada, 29 September – 2 October, American Society of Mechanical Engineers.","cites":null},{"id":37938743,"title":"Automated conversion between different knowledge representation formats'.","authors":[],"date":"2006","doi":"10.1016\/j.knosys.2006.04.005","raw":"Yao, H. and Etzkorn, L. (2006). 'Automated conversion between different knowledge representation formats'. Knowledge-Based Systems. Vol. 19, No. 6, pp. 404-412.","cites":null},{"id":37938672,"title":"Case studies of coordination activities and problems in collaborative design'.","authors":[],"date":"1997","doi":"10.1007\/bf01596483","raw":"Crabtree, R. A., Fox, M. S. and Baid, M. K. (1997). 'Case studies of coordination activities and problems in collaborative design'. Research in Engineering Design. Vol. 9, pp. 70-84.","cites":null},{"id":37938696,"title":"Characterising the requirements of engineering information systems'.","authors":[],"date":"2004","doi":"10.1016\/j.ijinfomgt.2004.06.008","raw":"Lowe, A., Chris, M. and Culley, S. (2004). 'Characterising the requirements of engineering information systems'. International Journal of Information Management. Vol. 24, pp. 401-422.","cites":null},{"id":37938720,"title":"Characterizing Complex Product Architectures'.","authors":[],"date":"2004","doi":"10.1002\/sys.10056","raw":"Sharman, D. and Yassine, A. (2004). 'Characterizing Complex Product Architectures'. Systems Engineering. Vol. 7, No. 1, pp. 35-60.","cites":null},{"id":37938718,"title":"Collaborative product innovation: integrating elements of CPI via PLM framework'.","authors":[],"date":"2005","doi":"10.1016\/j.cad.2005.02.012","raw":"Sharma, A. (2005). 'Collaborative product innovation: integrating elements of CPI via PLM framework'. Computer aided design. Vol. 37, No. 13, pp. 1425-1434.","cites":null},{"id":37938676,"title":"Dassault Systems acquires Knowledge Technologies International'. Dassault Systems Press Room. WWW document: http:\/\/www.3ds.com\/se\/news-events\/press-room\/release\/796\/1\/ (accessed 16","authors":[],"date":"2002","doi":null,"raw":"Dassault-Systems (2002). 'Dassault Systems acquires Knowledge Technologies International'. Dassault Systems Press Room. WWW document: http:\/\/www.3ds.com\/se\/news-events\/press-room\/release\/796\/1\/ (accessed 16 August 2006).","cites":null},{"id":37938690,"title":"Decomposition of the design process'.","authors":[],"date":"1993","doi":"10.1115\/1.2919255","raw":"Kusiak, A. and Wang, J. (1993). 'Decomposition of the design process'. Journal of Mechanical Design. Vol. 115, No. 4,pp. 687-695.","cites":null},{"id":37938666,"title":"Design engineering - a need to rethink the solution using knowledge based engineering'.","authors":[],"date":"1999","doi":"10.1016\/s0950-7051(99)00013-1","raw":"Chapman, C. B. and Pinfold, M. (1999). 'Design engineering - a need to rethink the solution using knowledge based engineering'. Knowledge-Based Systems. Vol. 12, pp. 257-267.","cites":null},{"id":37938716,"title":"Design engineering competencies: future requirements and predicted changes in the forthcoming decade'.","authors":[],"date":"2005","doi":"10.1016\/j.destud.2004.09.004","raw":"Robinson, M. A., Sparrow, P. R., Clegg, C. and Birdi, K. (2005). 'Design engineering competencies: future requirements and predicted changes in the forthcoming decade'. Design Studies. Vol. 26, pp. 123-153.","cites":null},{"id":37938706,"title":"Design performance. Springer-Verlag London.","authors":[],"date":"2005","doi":null,"raw":"O´Donell, F. J. and Duffy, A. H. B. (2005). Design performance. Springer-Verlag London. ISBN: 185233889X.","cites":null},{"id":37938698,"title":"Engineering 2010: Setting the course for innovative engineering.","authors":[],"date":"2005","doi":null,"raw":"Lukas, U. v., Krause, F.-L., Rothenburg, U., Wöhler, T., Romahn, A., Anderl, R., Melk, K., Awiszus, B., Ufer, R., Binotsch, C., Schützer, K. and Gemignani, B. H. (2005). Engineering 2010: Setting the course for innovative engineering. VMM Wirtschaftsverlag.","cites":null},{"id":37938733,"title":"Engineering automation for the SME: a viable tool for &quot;mass&quot; customisation'.","authors":[],"date":null,"doi":null,"raw":"Str.Direction (2005a). 'Engineering automation for the SME: a viable tool for &quot;mass&quot; customisation'. Strategic Direction. Vol. 21, No. 1, pp. 1-35.","cites":null},{"id":37938688,"title":"Industrial automation systems and integration -- Product data representation and exchange --Part 11: Description methods: The EXPRESS language reference manual'. International Organization for Standardization,","authors":[],"date":"1994","doi":"10.3403\/01507065u","raw":"ISO10303-11 (1994). 'Industrial automation systems and integration -- Product data representation and exchange --Part 11: Description methods: The EXPRESS language reference manual'. International Organization for Standardization, ISO.","cites":null},{"id":37938702,"title":"Information management for through life product support: the curation of digital engineering data'.","authors":[],"date":"2005","doi":"10.1504\/ijplm.2005.007343","raw":"Formatted: German (Germany)McMahon, C., Giess, M. and Culley, S. (2005). 'Information management for through life product support: the curation of digital engineering data'. International Journal of Product Lifecycle Management. Vol. 1, No. 1,pp. 26-42.","cites":null},{"id":37938714,"title":"Information models for product representation: core and assembly models'.","authors":[],"date":"2005","doi":"10.1504\/ijpd.2005.007248","raw":"Rachuri, S., Baysal, M., Roy, U., Foufou, S., Bock, C., Fenves, S. J., Subrahmanian, E., Lyons, K. and Sriram, R. D. (2005). 'Information models for product representation: core and assembly models'. International Journal of Product Development. Vol. 2, No. 3, pp. 207-235.","cites":null},{"id":37938692,"title":"KBE application and research in the UK. In:","authors":[],"date":"2000","doi":null,"raw":"Li, G., Cooper, S. and Fan, I.-S. (2000b). KBE application and research in the UK. In: Proceedings of the International Conference on Advanced Manufacturing Systems and Manufacturing Automation, AMSMA 2000, Guangzhou, China, 19-21 June.","cites":null},{"id":37938710,"title":"KBE services for PLM” Request for Proposal. OMG document: dtc\/05-09-11'. The Object Managment Group. WWW document: http:\/\/www.omg.org\/cgi-bin\/doc?dtc\/2005-9-11 (accessed 16th","authors":[],"date":"2006","doi":null,"raw":"OMG (2005). '“KBE services for PLM” Request for Proposal. OMG document: dtc\/05-09-11'. The Object Managment Group. WWW document: http:\/\/www.omg.org\/cgi-bin\/doc?dtc\/2005-9-11 (accessed 16th August 2006).","cites":null},{"id":37938712,"title":"Knowledge based product life cycle systems: principles of integration of KBE and C3P'.","authors":[],"date":"2000","doi":"10.1016\/s0010-4485(00)00014-2","raw":"Penoyer, J. A., Burnett, G., Fawcet, D. J. and Liou, S.-Y. (2000). 'Knowledge based product life cycle systems: principles of integration of KBE and C3P'. Computer aided design. Vol. 32, pp. 311-320.","cites":null},{"id":37938664,"title":"Knowledge management - not rocket science'.","authors":[],"date":"2005","doi":"10.1108\/13673270510590191","raw":"Call, D. (2005). 'Knowledge management - not rocket science'. Journal of Knowledge Management. Vol. 9, No. 2, pp. 19-30.","cites":null},{"id":37938668,"title":"Knowledge management and its link to knowledge creation process'.","authors":[],"date":"2002","doi":"10.1016\/s0957-4174(02)00038-6","raw":"Choi, B. and Lee, H. (2002). 'Knowledge management and its link to knowledge creation process'. Expert Systems with Applications. Vol. 23, pp. 173-187.CimDATA (2005). 'Autodesk acquires Engineering Intent Corporation'. CimDATA PLM Industry Summary Online Archive. WWW document: http:\/\/cimdata.com\/newsletter\/2005\/42\/03\/42.03.01.htm (accessed 16th August 2006).","cites":null},{"id":37938700,"title":"Knowledge management in engineering design: personalization and codification'.","authors":[],"date":"2004","doi":"10.1080\/09544820410001697154","raw":"McMahon, C. (2004). 'Knowledge management in engineering design: personalization and codification'. Journal of Engineering Design. Vol. 15, No. 4,pp. 307-325.","cites":null},{"id":37938694,"title":"Knowledge-based engineering for SMEs - a methodology'. Journal of materials processing technology.","authors":[],"date":"2000","doi":"10.1016\/s0924-0136(00)00728-7","raw":"Lovett, P. J., Ingram, A. and Bancroft, C. (2000). 'Knowledge-based engineering for SMEs - a methodology'. Journal of materials processing technology. pp. 384-389.","cites":null},{"id":37938662,"title":"Knowledge-based geometric modelling of aircraft structures'.","authors":[],"date":"1997","doi":"10.1243\/0954410971532677","raw":"Bates, J. P., Morris, A. J. and Payne, P. N. (1997). 'Knowledge-based geometric modelling of aircraft structures'. Proceedings of the Institution of Mechanical Engineers - Part G. Vol. 211, pp. 273-284.","cites":null},{"id":37938745,"title":"Knowledge-intensive collaborative design modelling and support. Part I: Review, distributed models and framework'.","authors":[],"date":"2006","doi":"10.1007\/0-387-25786-1_2","raw":"Zha, X. F. and Du, H. (2006a). 'Knowledge-intensive collaborative design modelling and support. Part I: Review, distributed models and framework'. Computers in Industry. Vol. 57, pp. 39-55.","cites":null},{"id":37938747,"title":"Knowledge-intensive collaborative design modelling and support. Part II: System implementation and application'.","authors":[],"date":"2006","doi":null,"raw":"Zha, X. F. and Du, H. (2006b). 'Knowledge-intensive collaborative design modelling and support. Part II: System implementation and application'. Computers in Industry. Vol. 57, pp. 56-71.","cites":null},{"id":37938685,"title":"Managing engineering design. Longman\/John Wiley & Sons Harlow\/New york.","authors":[],"date":"1993","doi":null,"raw":"Hales, C. (1993). Managing engineering design. Longman\/John Wiley & Sons Harlow\/New york. ISBN: 0582039339.Hobday, M. (1998). 'Product complexity, innovation and industrial organisation'. Research Policy. Vol. 26, No. 6,April 1998, pp. 689-710.","cites":null},{"id":37938732,"title":"Managing engineering knowledge: MOKA methodology for knowledge based engineering applications.","authors":[],"date":"2001","doi":null,"raw":"Stokes, M. (2001). Managing engineering knowledge: MOKA methodology for knowledge based engineering applications. Professional Engineering Publishing London. ISBN: 1860582958.","cites":null},{"id":37938704,"title":"MDA distilled: principles of model-driven architecture.","authors":[],"date":"2004","doi":"10.1007\/3-540-46105-1_33","raw":"Mellor, S. J., Scott, K., Uhl, A. and Weise, D. (2004). MDA distilled: principles of model-driven architecture. Addison Wesley. ISBN: 0201788918.","cites":null},{"id":37938724,"title":"On complexity, process ownership and organisational learning in manufacturing organisations, from an ergonomics perspective'.","authors":[],"date":"2002","doi":"10.1016\/s0003-6870(02)00025-x","raw":"Siemieniuch, C. E. and Sinclair, M. A. (2002). 'On complexity, process ownership and organisational learning in manufacturing organisations, from an ergonomics perspective'. Applied Ergonomics. Vol. 33, pp. 449-462.","cites":null},{"id":37938722,"title":"Organizational aspects of knowledge lifecycle management in manufacturing'.","authors":[],"date":"1999","doi":"10.1006\/ijhc.1999.0274","raw":"Siemieniuch, C. E. and Sinclair, M. A. (1999). 'Organizational aspects of knowledge lifecycle management in manufacturing'. International Journal on Human-Computer Studies. Vol. 51, pp. 517-547.","cites":null},{"id":37938682,"title":"Organizing the Tasks in Complex Design Projects. In:","authors":[],"date":"1990","doi":"10.1007\/bfb0014281","raw":"Eppinger, S. D., Whitney, D. E. and Smith, R. P. (1990). Organizing the Tasks in Complex Design Projects. In: ASME Conference on Design Theory and Methodology, Chicago, Illinois, American Society of Mechanical Engineers.","cites":null},{"id":37938737,"title":"Product lifecycle management support: a challenge in supporting product design and manufacturing in a networked economy'.","authors":[],"date":"2005","doi":"10.1504\/ijplm.2005.007342","raw":"Subrahmanian, E., Rachuri, S., Fenves, S. J. and Foufou, S. (2005). 'Product lifecycle management support: a challenge in supporting product design and manufacturing in a networked economy'. International Journal of Product Lifecycle Management. Vol. 1, No. 1, pp. 4-25.","cites":null},{"id":37938687,"title":"Role change of design engineers in product development'.","authors":[],"date":"2005","doi":"10.1016\/j.jom.2005.03.002","raw":"Hong, P., Vonderembse, M. A., Doll, W. J. and Nahm, A. Y. (2005). 'Role change of design engineers in product development'. Journal of Operations Management. Vol. 24, pp. 63-79.","cites":null},{"id":37938726,"title":"Systems Integration'.","authors":[],"date":"2006","doi":"10.1016\/j.apergo.2005.06.012","raw":"Siemieniuch, C. E. and Sinclair, M. A. (2006). 'Systems Integration'. Applied Ergonomics. Vol. 37, No. 1, pp. 91-110.","cites":null},{"id":37938686,"title":"The inseparability of modern knowledge management and computer-based technology'.","authors":[],"date":"2005","doi":"10.1108\/13673270510582956","raw":"Holsapple, C. W. (2005). 'The inseparability of modern knowledge management and computer-based technology'. Journal of Knowledge Management. Vol. 9, No. 1, pp. 42-52.","cites":null},{"id":37938678,"title":"The reality of design process planning. In: Research for Practice -Innovation","authors":[],"date":"2003","doi":null,"raw":"Eckert, C. M. and Clarkson, P. J. (2003). The reality of design process planning. In: Research for Practice -Innovation in Products and Processes. International Conference on Engineering Design. ICED'03. edited by: Folkeson, A., Gralen, K., Norell, M. and Sellgren, U. The Design Society.ISBN: 1904670008.","cites":null},{"id":37938680,"title":"The reality of design. In: Design process improvement. A review of current practice. edited by:","authors":[],"date":"2005","doi":"10.1007\/978-1-84628-061-0_1","raw":"Eckert, C. M. and Clarkson, P. J. (2005). The reality of design. In: Design process improvement. A review of current practice. edited by: Eckert, C. M. and Clarkson, P. J. Springer-Verlag.ISBN: 185233701X.","cites":null},{"id":37938741,"title":"The role of IT in KM: where are we now and where are we heading?'","authors":[],"date":"2005","doi":"10.1108\/13673270510584198","raw":"Tsui, E. (2005). 'The role of IT in KM: where are we now and where are we heading?' Journal of Knowledge Management. Vol. 9, No. 1, pp. 3-6.","cites":null},{"id":37938674,"title":"The semantic web: A guide to the future of XML, web services, and knowledge management.","authors":[],"date":"2003","doi":null,"raw":"Daconta, M. C., Obrst, L. J. and Smith, K. T. (2003). The semantic web: A guide to the future of XML, web services, and knowledge management. John Willey & Sons. ISBN: 0471432571.","cites":null},{"id":37938728,"title":"Towards an ontology of generic engineering design activities'.","authors":[],"date":"2003","doi":"10.1007\/s00163-003-0037-1","raw":"Sim, S. K. and Duffy, A. H. B. (2003). 'Towards an ontology of generic engineering design activities'. Research in Engineering Design. Vol. 14, pp. 200-223.Steward, D. V. (1981). 'The design structure system: a method for managing the design of complex systems'. IEEE Transactions on Engineering Management. Vol. 28, No. 3, August 1981, pp. 71-74.","cites":null},{"id":37938735,"title":"Widening appreciation of PLM. Investing in delivering innovation'.","authors":[],"date":null,"doi":"10.1108\/02580540510616719","raw":"Str.Direction (2005b). 'Widening appreciation of PLM. Investing in delivering innovation'. Strategic Direction. Vol. 21, No. 9, pp. 35-37.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-08-20T00:00:00Z","abstract":"The effective management of knowledge as capital is considered essential to the\nsuccess of engineering product\/service systems. As Knowledge Management (KM) and\nProduct Lifecycle Management (PLM) practice gain industrial adoption, the\nquestion of functional overlaps between both the approaches becomes evident.\nThis article explores the interoperability between PLM and Knowledge-Based\nEngineering (KBE) as a strategy for engineering KM. The opinion of key KBE\/PLM\npractitioners are systematically captured and analysed. A set of ranked business\nfunctionalities to be fulfiled by the KBE\/PLM systems integration is elicited.\nThe article provides insights for the researchers and the practitioners playing\nboth the user and development roles on the future needs for knowledge systems\nbased on PLM","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140454.pdf","fullTextIdentifier":"https:\/\/dspace.lib.cranfield.ac.uk\/bitstream\/1826\/3116\/1\/Practitioner%20requirements%20for%20IK%20based%20engineering%20in%20PLM-2008.pdf","pdfHashValue":"596afa4b9c729bc9540d8fd7e2f720b5f0ba7cad","publisher":null,"rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/3116<\/identifier><datestamp>2014-06-02T13:13:43Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Practitioner requirements for integrated Knowledge-Based Engineering in Product\nLifecycle Management.<\/dc:title><dc:creator>Bermell-Garcia, Pablo<\/dc:creator><dc:creator>Fan, Ip-Shing<\/dc:creator><dc:subject>computer aided design<\/dc:subject><dc:subject>CAD<\/dc:subject><dc:subject>engineering design<\/dc:subject><dc:subject>engineering knowledge management<\/dc:subject><dc:subject>knowledge-based engineering<\/dc:subject><dc:subject>KBE<\/dc:subject><dc:subject>product lifecycle management<\/dc:subject><dc:subject>PLM<\/dc:subject><dc:description>The effective management of knowledge as capital is considered essential to the\nsuccess of engineering product\/service systems. As Knowledge Management (KM) and\nProduct Lifecycle Management (PLM) practice gain industrial adoption, the\nquestion of functional overlaps between both the approaches becomes evident.\nThis article explores the interoperability between PLM and Knowledge-Based\nEngineering (KBE) as a strategy for engineering KM. The opinion of key KBE\/PLM\npractitioners are systematically captured and analysed. A set of ranked business\nfunctionalities to be fulfiled by the KBE\/PLM systems integration is elicited.\nThe article provides insights for the researchers and the practitioners playing\nboth the user and development roles on the future needs for knowledge systems\nbased on PLM.<\/dc:description><dc:date>2012-08-06T23:01:16Z<\/dc:date><dc:date>2012-08-06T23:01:16Z<\/dc:date><dc:date>2008-08-20T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>P. Bermell-Garcia, I-S. Fan; Practitioner Requirements for Integrated Knowledge-\nBased Engineering in Product Lifecycle Management. International Journal of\nProduct Lifecycle Management 2008, Vol. 3, No.1, pp. 3-20<\/dc:identifier><dc:identifier>1743-5110<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1504\/IJPLM.2008.019968<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/3116<\/dc:identifier><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["1743-5110","issn:1743-5110"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2008,"topics":["computer aided design","CAD","engineering design","engineering knowledge management","knowledge-based engineering","KBE","product lifecycle management","PLM"],"subject":["Article"],"fullText":"International Journal of Product Lifecycle Management\nSpecial issue on: “Exploring the Role of Knowledge Management Technologies in PLM”\nGuest Editor: Dr. Madhusudan Therani\nPractitioner requirements for integrated Knowledge Based\nEngineering in PLM\nAbstract. The effective management of knowledge as capital is considered essential to the success\nof engineering product\/service systems. As Knowledge Management and Product Lifecycle\nManagement (PLM) practice gain industrial adoption the question of functional overlaps between\nboth approaches becomes evident. This paper explores the interoperability between PLM and\nKnowledge Based Engineering (KBE) as a strategy for engineering KM. The opinion of key\nKBE\/PLM practitioners are systematically captured and analysed. A set of ranked business\nfunctionalities to be fulfilled by the KBE\/PLM systems integration is elicited. The paper provides\ninsights for researchers and practitioners playing both user and development roles on the future\nneeds for knowledge systems based on PLM.\nKeywords: Product Lifecycle Management, Knowledge Based Engineering, Engineering Design,\nComputer Aided Design, Engineering Knowledge Management.\n1 Introduction\nThe recognition that engineering design practice is the means to deliver product\/service systems rather than just\nartefact descriptions matures alongside the development of engineering oriented IT systems. The current PLM vision\nevolved through several generations of computer aided design tools including early geometric modelling, solid\nmodelling and Product Data Management (PDM). This evolution has seen the increasing role of computer mediated\ndesign work coordination integrated with engineering problem solving technologies that support the analysis,\nsynthesis and evaluation of product solutions. The combination of different schools of thought in engineering design\nresearch and practice has contributed to this progressive contextualisation of the product engineering function as part\nof a larger socio-technical system, (Figure 1).\nModern engineering design practice needs to pay special attention to the socio-technical context in which it\nhappens. This means that in addition to technical challenges, soft organisational constraints affect the performance\nof the design process, (O´Donell and Duffy 2005). The work of (Hobday 1998, Eckert and Clarkson 2003) highlight\nthe difficulties in managing large scale design projects in which socio-technical issues appear. In these situations,\nthe deterministic design process models tend to fail and mechanisms to manage its complexity are needed, (Eckert\nand Clarkson 2005). The research community has proposed frameworks like the Design Structure Matrix to manage\nthis complexity from different viewpoints, (Steward 1981, Eppinger et al. 1990, Kusiak and Wang 1993, Sharman\nand Yassine 2004). However, engineering projects go though various series of iterations not only to execute the\ndesign work but also to find and exchange information, to consolidate agreements, to select suppliers and other non-\npurely technical decisions and tasks. It has been quantified by (Hales 1993, Crabtree et al. 1997) that these activities\nare 50% of the workload of engineering design teams. Human factors play an important role as it has been described\nby Siemieniuch and Sinclair (2006). This would explain some research results highlighting that engineering\norganisations are paying increasing attention to the soft skills of their engineering designers (Hong et al. 2005,\nRobinson et al. 2005). These skills include: “personal attributes”, “project management skills”, “clarity of project\ntargets” and “shared knowledge about customers”.\nAnother socio-technical issue affecting engineering operations is the geographical dispersion of teams in global\nprojects. In these conditions, networked enterprise systems like PLM are becoming the only option to coordinate\ngeographically dispersed engineering activities. They also provide an infrastructure for data storage, distribution and\nmanagement. Until recently, PLM is primarily seen as the technology to provide a repository for intellectual capital\nfor the Knowledge Management practice, (Str.Direction 2005b). A practical question is how to retain and capitalise\nthe large amounts of engineering information stored in PLM repositories as intellectual property assets. McMahon et\nal. 2005 proposes the use of formal knowledge representation approaches for:\n Enriching the semantics of engineering data entities such as Computer Aided Design (CAD) files.\n Supporting the capture of engineering decision making processes as well as the information sources that trigger\nthem.\nThe rest of the paper explores these issues and is structured as follows. Section 2 gives a background on KBE.\nKBE can be used as a KM tool to support the codification and personalisation of knowledge. Section 3 presents the\nintegration of KBE and PLM for Knowledge Management. Section 4 describes the methodology used for research\nwith industrial practitioners. Section 5 reports the interview results and discusses the relevant findings in respect to\nthe KBE\/PLM integration. Section 6 draws conclusions from the research.\n2 KBE as a Knowledge Management instrument\nIn the 1980s, the integration of Artificial Intelligence (AI) techniques in CAD tools created the early of KBE\nsystems. The first commercial success of the technology was The ICAD System. The software uses a LISP-based\nlanguage closely integrated with a geometric modeller so engineers can encode engineering knowledge and run data\ngeneration programs. In the early 1990s KBE technology was used primarily by the aerospace and automotive\nindustries. In the late 90s CAE vendors at the high end of the market (i.e. Catia and Unigraphics) started to include\nKBE functionalities in their CAD suites, (McMahon 2004). Following Dassault Systems’ acquisition of the\ncompany that owed ICAD, Autodesk acquired the company responsible for Intent! with the aim of offering KBE\nfunctionalities on its products, (Dassault-Systems 2002, CimDATA 2005). Similarly, the Unigraphics’ Knowledge\nFusion software product offering KBE functionality has its origins in a strategic partnership in which Intent!\ntechnology was transferred to the system, (Li et al. 2000b). As KBE becomes part of the CAD systems, Str.Direction\n(2005a) reports that medium size engineering firms are increasing the uptake of KBE technology. In essence, KBE\nenables the semantic enrichment of Computer Aided Design (CAD) models so explicit engineering knowledge can\nbe embedded. More importantly, KBE technology supports Knowledge Management by the systematic retention of\nengineering problem solving procedures, (Cooper et al. 1999).\nIt is widely recognised that Knowledge Management is a key practice for 21st century organisations to capitalise\ntheir expertise and know-how. Various sources of literature acknowledge the current debate on the role of\ncomputing technology in KM, (Call 2005, Tsui 2005). The inseparability of KM from computer-based support has\nbeen discussed by Holsapple (2005). His research acknowledges the importance of Information and Communication\nTechnologies (ICTs) to speed up knowledge intensive work carried out by individuals, groups and systems. In the\nengineering domain, McMahon (2004) distinguishes between ICTs is used to personalise and codify knowledge.\nPersonalization refers to computer tools that support the management of human resources and communication.\nCodification is the use of ICTs for collecting and organising knowledge. According to the author, examples of\ncodification tools are KBE systems and ontology editors. Computer supported collaborative work (CSCW) and web-\nbased communities of practice are personalisation tools.\n2.1 Codification and personalisation aspects of KBE\nKBE tools encode the engineering data generation processes using specialised languages to control the\ninstantiation of software objects in CAD systems. Using the generative modelling capabilities, engineers can model\nthe creation of a wide range of engineering data elements (geometry, bills of material, etc.). KBE runs explicitly\ndefined engineering rules to control the instantiation of the data. Engineering rules enrich CAD data from multiple\nengineering viewpoints including that of manufacturing, ergonomics, and many others.\n. KBE software tools “out of the box” are just codification Knowledge Management instruments(Bates et al.\n1997, Chapman and Pinfold 1999, Lovett et al. 2000, Kulon et al. 2006). However, much of the value of KBE as\npart of a Knowledge Management strategy is its role as a personalisation KM instrument. Gaining the benefits of\nKBE as a personalisation instrument requires methodological support and organisational endorsement rather than\njust software. The implementation of KBE encourages the following beneficial KM practices:\n Analysis of engineering activities. KBE projects usually start with the identification of a routine or variant\nengineering task suitable to be automated. Identifying a business case for KBE is in itself a continuous\nimprovement engineering practice. Furthermore, deploying KBE has other beneficial side effects like\nstandardising terminologies, clarifying procedures and identifying engineering decisions.\n Identification of multidisciplinary knowledge areas necessary to solve engineering problems. KBE\nimplementations usually integrate engineering rules from different knowledge domains. Their elicitation is an\ninterdisciplinary exchange of information, knowledge sharing and the establishment of collaboration networks.\n Documentation of engineering best practices. Either by using structured KBE codes or more informal\ndescriptions, the knowledge about engineering procedures is explicitly retained in a way that otherwise would\nremain tacit.\n Making more efficient the work that is not fully supported by software systems. Bespoke software could be\ndeveloped to automated any engineering tasks. However, software development usually involves high costs not\nonly to code the engineering activities but to capture knowledge . KBE is a cost-effective computational\nsolution for engineering jobs in which automation is needed and bespoke software development is expensive.\nA unique approach to realise both the codification and personalisation KM capabilities of KBE is the\nMethodology and Tools for Knowledge Based Engineering (MOKA), reported by Stokes (2001). Using MOKA,\nmajor aerospace and automotive companies have deployed KBE as an enterprise best practice rather than just as a\nsolution for automating certain engineering tasks. In addition to KBE codification tools, MOKA´s methodological\nsupport includes procedures to interview experts, ontological schemas to organise the knowledge and tools for\nrepresenting and publishing the knowledge across the organisation. However, MOKA makes no specific\ncommitments to the management of knowledge. Observations from industrial MOKA implementations have\nrevealed the use of extensions of the methodology to support the management of changes in knowledge repositories.\n3 Towards integrated KBE in PLM\nThis paper identifies the potential of the integration between KBE and PLM. KBE systems can be used as\nknowledge authoring tools to model engineering tasks. Their use as a codification instrument can be complemented\nby PLM as the personalisation instrument. This approach allows the use of ICT mediated mechanism to share, reuse\nand maintain KBE resources across PLM connected engineering teams. The functional interoperability between both\ntechnologies brings the opportunity to realise “out of the box” KM solutions. This would significantly reduce the\ninvestments in KM technology and culture change for large as well as small organisations. End user acceptance of\nKM using the well known tools of KBE and PLM technologies shall be easier compared with the introduction of\ndisruptive systems and frameworks.\nThe integration of KBE within product lifecycle systems is discussed by Penoyer et al. (2000) as a need for\nfuture engineering support tools. Subrahmanian et al. (2005) suggests that a possible path to realise the PLM concept\nas a strategy for knowledge capitalisation is by leveraging the integration between existing standards related to\nPLM. This includes not only product engineering data schemas but also other standards for structured information\nmodelling and knowledge representation. Similarly, a KBE\/PLM integration roadmap has been proposed by the\nProstep-iViP association in the context of a study on strategic product engineering areas subject up to the year 2010.\nAccording to this work, a combination of different standards on information and data modelling like STEP, UML,\nXML and others shall contribute to realise the integration, (Lukas et al. 2005). It is expected that standard based\nsemantic modelling will play a significant role in these initiatives. Examples of these standard modelling\nframeworks are the Semantic Web for e-business and web based systems supported by the W3 Concsortium,\n(Daconta et al. 2003) and the Model Driven Architecture framework (MDA) for interoperability between IT\nsystems, owned by the Object Management Group (OMG), (Mellor et al. 2004). In particular, the OMG plays a\nproactive role in establishing standards to achieve software interoperability in a variety of strategic application\ndomains. Domain Task Forces (DTFs) cover areas in Business Modelling & Integration, C4I, Finance, Government,\nHealthcare, Life Sciences Research, Robotics, Software-Based Communications, and Manufacturing Technology &\nIndustrial Systems (MANTIS). DTFs are composed of representatives from industry, academia and government\nagencies. In 2004, the MANTIS Task Force identified that KBE is maturing to become a significant software\napplication for the manufacturing industry. The interests of OMG members in KBE are related to the prediction of\nthe kind of software applications needed to support product\/service systems in the knowledge economy, and the\nassociated interoperability issues, OMG (2005).\n3.1 Challenges for the KBE\/PLM integration\nA major factor to achieve success in KBE\/PLM interoperability is the expectations from end users of the\ntechnology. Both technologies have a certain level of maturity on large aerospace and automotive companies. The\nexpertise gained by engineering teams in these organisations forms an important input to clarify the business\nfunctionalities of the integration. While the use of 3D and CAD was a relatively mature reality when the ISO-STEP\ninitiative was launched, systematic enterprise management of engineering knowledge to support product\/service\nsystems is still an emerging concept. The major aerospace and automotive OEMs are still exploring the\nproduct\/service business concepts. Investment in the software technology to deliver the vision is seen as a cost and\nthe responsibility of the vendors who shall benefit from cross selling the technology to a wider user space. Two\nmajor challenges for the KBE\/PLM interoperability are identified in the research:\n The ability to unlock engineering knowledge from proprietary representations.\n The ability to manage the lifecycle of KBE models.\nThe need to unlock engineering knowledge representations becomes evident when proprietary KBE models need\nto be exchanged between two systems. This interoperability problem is illustrated in Figure 2. Using two different\nKBE platforms and their respective languages, CAD models are “knowledge-enriched” to generate engineering\ndesign data. The two KBE applications can have the same engineering abstraction of the entities to be instantiated\nand the set of rules that govern the data generation. However, using current data exchange standards, it is only\npossible to transfer an instance of the design and not the knowledge embodied to generate it.\nThis example points out that being able to produce the same part using different KBE applications implies that\nthere is some semantic equivalency between the knowledge abstraction metamodels in the two systems. The\nunification of engineering design knowledge models is a subject of intensive research, (Sim and Duffy 2003).\nInitiatives in this are gaining momentum thanks to the adoption of semantic modelling standards. An early attempt\nfor building engineering semantic models is the EXPRESS language created during the STEP standardisation\nefforts, (ISO10303-11 1994). Other research efforts are MOKA, the Core Product Model and its extensions,\n(Rachuri et al. 2005, Sudarsan et al. 2005). These formalisms use the Unified Modelling Language (UML) to define\nengineering information metamodels independent from particular software platforms. Similarly, the WEBKIDSS\napproach uses the Semantic Web modelling languages to respond to the same need (Zha and Du 2006a, Zha and Du\n2006b). Despite the availability of representation formalisms, interoperability and knowledge exchange between\nthem is a common issue, (Yao and Etzkorn 2006).\nIn addition to the ability to connect KBE systems, the management of KBE models is perceived by engineering\npractitioners as a major challenge. It is expected that achieving the interoperability between KBE and PLM enables\ncoordination of KBE development work. In current practice, specialised teams deploy KBE to engineering units\nacross the organisation whenever opportunities to gain benefits from the technology are identified. The KM\nopportunity is the use of PLM technology to coordinate KBE deployment activities. This implies the definition of\nKBE models as software services whose lifecycle is managed using existing PLM functionalities (Figure 3).\nAn example of this is the deployment of KBE application that captures the knowledge about the design of\naircraft wing ribs as a software service. The application becomes an “item” that can be retrieved or re-engineered\naccording to users’ needs. T This KBE service could then be used by other designers in other aircraft design\nprogrammes or validated by manufacturing and servicing engineers in later stages of the KM lifecycle.\nIt has been pointed out by Sharma (2005) that KBE design automation models should be driven by PLM for\nenhanced enterprise visibility and reuse. The benefits for managing knowledge to make KBE codes become more\ntransparent to non-programming experts have been reported in Fan et al. (2002). This include better maintenance of\nKBE models that otherwise would become difficult to adapt to changes. Finally, managing the lifecycle of KBE\nmodels involves the continuous improvement through validation and feedback from the users. Industrial KBE\npractitioners participating in this research recognise this as a bottleneck that could be supported with PLM mediated\nservice management.\n4 Research methodology\nThe objective of the research is to elicit strategic requirements for the KBE\/PLM integration from engineering\npractitioners. A qualitative study has been designed to collect and analyse data from KBE and PLM experts.\nInterviews and other qualitative research methods are common tools to elicit the needs for future support systems in\nengineering design research, (Li et al. 2000a, Lowe et al. 2004). The seven practitioners who took part of in this\nstudy have been selected to ensure that they meet the following key features:\n They have responsibilities closely related to KBE and PLM implementation. In particular, all the interviewees\nhold leading positions in their organisations related to KBE technology. The only exception is one participant\nwho recently retired from his position after more than 20 years of KBE development activity in a large\naerospace Original Equipment Manufacturing (OEM) organisation.\n They have significant experience on the deployment of KBE technology and exposure to KM and PLM\npractice. All the participants have been users of the first KBE system in the market (ICAD) and have seen the\nevolution of the technology since then. All of them have more than 10 years experience in KBE.\n They belong to engineering organisations large enough to have a corporate strategy for KBE implementation\nand PLM interoperability. This includes one member of an academic institution. She has been in charge of KBE\nin several research programmes in the aerospace domain. All the participants declared in the study that the\nintegration of KBE and PLM is part of their vision of future product realisation technologies.\nTable 1 gives information about the participants in terms of the organisations to which they belong and their\nroles in to KBE and PLM technologies. An initial data collection and analysis to elicit the business functions to be\nfulfilled by the KBE\/PLM integration was carried out through a literature survey. This has been reported in Sections\n1 to 3. Further data gathering uses unstructured interviews with some of the selected practitioners and other\nKBE\/PLM technologists. In these sessions, the challenges described in Section 3.1 guided the discussion. The\nanalysis of interview transcripts and meeting notes helps to narrow down a definitive set of 10 business\nfunctionalities.\nThe final set of data for the research has been gathered from the selected practitioners with the aim to rank the\nimportance of the elicited business functions. This part of the research was carried out through interviews guided by\na structured questionnaire, (see Appendix A). The final outcome of the study is a ranked set of business\nfunctionalities that the interviewed participants expect to be fulfilled from the KBE\/PLM integration. The criteria for\nranking the business functionalities is based on the relevance that participants assign to each of them according to its\nalignment to their short and long term KBE\/PLM integration strategies. Values from 1 to 5 are assigned to each of\nthe business functions in order to weight their importance, with 1 and 5 represent the minimum and the maximum\nrelevance respectively.\n5 Results and discussion\nThe results from the research are a set of business functionalities expressing the practitioners’ requirements for\nintegrated KBE systems in PLM. The quantitative significance of the ranking results is limited due to the small data\nsample. However, a qualitative analysis of the data considering the background of the participants and the value of\ntheir inputs provides useful insights. There are only a small number of KBE teams in large organisations. It is\ndifficult to know accurately the total number of KBE team leaders in industry and consequently estimate the size of\na relevant research sample. On the other hand, the participant’s selected is representative of the distribution of KBE\nexperts across the engineering community. Most KBE technology users are in large OEM organisations (4\nrepresentatives in the study). The second most common type of KBE users are in consultancy services. The study\nincludes two representatives from this group: one form a large international engineering consultancy firm; and\nanother one from a leading PLM\/KBE software vendor. The last participant represents the academic\/research\ncommunity.\nTable 2 illustrates the elicited business functions ranked by the average of the importance assigned by the\nparticipants. An example of application for each business function is also given. In general, there is consensus on\nthe importance of the business functions presented and on their relevance distribution.\nThe high relevance perceived regarding the modularity and easiness to develop KBE models (top business\nfunction) confirms the evolution and the market trends discussed in Section 2. As KBE becomes a mainstream\npractice users demand more user friendly modelling functions so non-specialised engineers can benefit from the\ntechnology. In particular, the aerospace interviewees recognise the need of making the technology more modular\nand reducing the entry skills to gain its benefits. However, they acknowledged that they frequently operate complex\nKBE applications involving hundreds of software objects and thousands of code lines. The development of this kind\nof KBE software services are likely to be commissioned to specialised teams using a traditional hard-coding KBE\napproach like in the ICAD system or other alternatives in the market.\nThe second most appreciated business function is aligned with the challenge to manage KBE services within a\nPLM environment. It can be noticed that the coordination of KBE development work is more appreciated than the\nKBE interoperability challenge (5th business function). 5 out of the 7 interviewed experts consider the use of PLM to\ncoordinate KBE work as “highly relevant” and 3 of them identify the issue as part of their short term strategy.\nAligned to this view, (Siemieniuch and Sinclair 1999) recognise that in competitive environments knowledge has a\nlifecycle that includes its creation, propagation and retirement across the organisation. A representative from a major\nPLM and KBE software vendor summarises these ideas as follows:\nDefinitely, exposing the components of a KBE solution in PLM has the same power as exposing\nthe component artefacts of an engineering design in PLM. You can search and re-use at a much\nfiner level of granularity, and you can approach the problems of versioning, maturity, release\nmanagement and configuration management methodically and in a unified manner. Note that\nmature users of KBE now realize that the second-tier problem with KBE is solution management,\nconfiguration and reuse.\nThe transparency of KBE is appreciated by the participants as a socio-technical barrier for the effective\ndeployment of the technology (4th business function). Making more transparent the functionality of KBE models\nreduces the fears to take up into KBE as it is no longer perceived as a “black art”. Moreover, model transparency\nalso correlates with the ability to manage KBE deployment work. The knowledge embedded in KBE models can not\nbe validated if it is not visible to the users. This issue is pointed out in the following quotation from a participant:\nTransparency is critical for the success of KBE within the traditional enterprises. If it is perceived\nas a “club” or only for “elite” engineers, it will not succeed. It must become “democratized”. But\ntransparency, as well as interoperability, will require the development of strong and relevant\nstandards.\nThe concern on formal knowledge representation (3rd business function) expresses the willingness of KBE users\nto exploit fundamental innovation like structured knowledge representation. This aspect is emphasised by the\npresence of semantic web services and service oriented architectures as business functions (9th and 10th business\nfunctions). It is also remarkable that the KBE\/PLM integration raises expectations on traditional KM best practices.\nKnowledge reuse, sharing and maintenance are acknowledged by KBE users in the 6th, the 7th and the 8th business\nfunctions respectively. Such business functions seem to be associated to the analogy made on the use of PLM\ntechnology to distribute manage and store product data. These perceptions can be summarised with the following\nquestion: why not use PLM to manage the lifecycle of engineering knowledge in a similar way as it is done with\nengineering data “items”?\nDiscussions during the interviews confirmed the consensus on the importance for all the elicited business cases.\nThis suggests that the elicited business cases are positively correlated. Improvement on one of them is likely to\nimpact positively on the others. Apart from the 10 elicited business functionalities, two additional concerns are\nidentified as a common pattern across the different interviewed practitioners:\n The prevention of possible “knowledge leaks” when KBE services become items on a PLM infrastructure. This\nraises the question beyond the generic 7th business function on how KBE services integrated in PLM will\nprotect the intellectual property embedded in engineering rules and other knowledge models.\n The role of ISO 10303 and related standards in the KBE\/PLM integration. There is common agreement among\nthe practitioners on the need of additional information modelling infrastructure to capture the semantics of\nengineering processes encoded in KBE. However, it is considered that the KBE\/PLM integration shall use\nSTEP data models in combination with semantic modelling approaches.\n6 Concluding remarks\nThe research reported here illustrates the consensus in the engineering community to strive towards\ninteroperability between KBE and PLM systems. The participation by the community of engineering software users\nand vendors identified the major challenges to be addressed in KBE\/PLM system integration. Concrete business\nfunctionalities for the KBE\/PLM interoperability are elicited and ranked.\nThis research contributes to the understanding of the needs for future PLM-based KM systems and their\nassociated interoperability issues. The integration of KBE\/PLM systems plays two valuable business roles for\nproduct engineering tool users and vendors:\nA) As a knowledge retention strategy adapted to the socio-technical reality of product engineering practice.\nThe capture of knowledge about an engineering product or process at certain point in time is only short term\nknowledge retention. Making KBE and PLM interoperable fulfils the business functionality of managing the\nlifecycle of engineering knowledge to sustain a KBE infrastructure in the long term. PLM can be used to coordinate\nthe knowledge capture and encoding processes to consolidate enterprise knowledge retention and the deployment of\nKBE services. In addition, global competition in the product\/service engineering practice will become unaffordable\nfor unnetworked teams and undistributed innovation chains. The exchange of data, information and knowledge (and\nthe control to stop so) will increasingly need to be carried out through the use of ICTs. PLM is the emerging\nparadigm for supporting these activities as connectivity and coordination framework.\nB) As a Potential framework for “out of the box” engineering KM toolsets.\nIt is widely accepted that enterprise culture and readiness to adapt is a crucial factor for the success of KM\ninitiatives, (Choi and Lee 2002, Siemieniuch and Sinclair 2002). For instance, the MOKA methodology was built\nupon extensive KBE practice at large automotive and aerospace manufacturers. However, it is difficult for smaller\norganisations to appreciate a Knowledge Management approach to KBE like MOKA. In these cases, built-in PLM\nfunctionalities such as file change management can be used to update and approve KBE applications. In this\napproach, knowledge reuse and sharing is enforced through the use of the PLM system as a repository for existing\nKBE enriched CAD or KBE code files embedding best practices into engineering rules. Similarly, knowledge\nmaintenance is supported by a managed way of deploying KBE applications through a PLM networked\norganisation.\nFurther architectural integration of the technologies shall support the exchange of knowledge between highly\nstructured KBE codes and other unstructured representations available in the PLM databases. As PLM technology\nbecomes a repository for engineering data, domain specific metadata models are progressively emerging to annotate\nmany forms of semi-structured information available in engineering environments such as drawings, pictures and\nmany others. More structured knowledge models may also be populated within PLM databases to accurately classify\nand map the relationships between more abstract engineering concepts such as product functions and specifications.\nIn the former case, flat metadata models in combination with searching tools will suffice to classify knowledge and\nmake it available to end users. In the latter, the need to add formal semantics to the models will require the use of\nmore advanced information modelling such as ontologies. In the journey to KBE integrated in PLM the use of\nsemantic modelling standards will play a significant role in the management of engineering knowledge. The\nachievement of this vision will require the participation of specialist teams responsible not only to administer PLM\nsystems but also to act as curators of the engineering knowledge. The end users of these enterprise knowledge\ninfrastructures shall benefit from the ability to have up to date knowledge at the right time and the right place.\nFinally, the findings help to create a research agenda leading to further stages of KM\/PLM integration research\nand standardisation. Two areas are suggested for future research action:\n The study of socio-technical issues in the coordination of engineering KM activities through networked\nenterprise systems. On one hand, the building of trust through IT systems in distributed teams needs to be\ninvestigated in order to enable PLM-based KM operations. On the other hand, the understanding of\ncollaborative learning processes in distributed engineering teams is a key input to develop knowledge lifecycle\nmanagement strategies.\n The exploration of emergent IT technologies to become engineering Knowledge Management infrastructures.\nThis includes strategies to support the interoperability between different enterprise domains. A promising\nconcept in this direction is the MDA approach supported by the OMG. Although the concept it is on its early\nstage, results from using the approach for model-based IT system development are starting to be delivered. The\nspreading out of MDA into engineering environments raises expectations.\nAcknowledgements\nThe authors are grateful to the UK´s Engineering and Physical Sciences Research Council and the industrial\ncollaborators for providing the grant GR\/R68139\/01 to support the Cranfield University Innovative Manufacturing\nResearch Centre. The authors also wish to express their gratitude to the members of the engineering community that\nhave provided their inputs to the research.\nReferences\nBates, J. P., Morris, A. J. and Payne, P. N. (1997). 'Knowledge-based geometric modelling of aircraft structures'.\nProceedings of the Institution of Mechanical Engineers - Part G. Vol. 211, pp. 273-284.\nCall, D. (2005). 'Knowledge management - not rocket science'. Journal of Knowledge Management. Vol. 9, No. 2,\npp. 19-30.\nChapman, C. B. and Pinfold, M. (1999). 'Design engineering - a need to rethink the solution using knowledge based\nengineering'. Knowledge-Based Systems. Vol. 12, pp. 257-267.\nChoi, B. and Lee, H. (2002). 'Knowledge management and its link to knowledge creation process'. Expert Systems\nwith Applications. Vol. 23, pp. 173-187.\nCimDATA (2005). 'Autodesk acquires Engineering Intent Corporation'. CimDATA PLM Industry Summary Online\nArchive. WWW document: http:\/\/cimdata.com\/newsletter\/2005\/42\/03\/42.03.01.htm (accessed 16th August\n2006).\nCooper, S., Fan, I.-S. and Li, G. (1999). 'A Best Practice Guide – Achieving Competitive Advantage through\nKnowledge-Based Engineering'. British Department of Trade and Industry (DTI). WWW document:\nhttp:\/\/www.ds-kti.com\/pdf\/kti_dti.pdf (accessed 18th May 2006).\nCrabtree, R. A., Fox, M. S. and Baid, M. K. (1997). 'Case studies of coordination activities and problems in\ncollaborative design'. Research in Engineering Design. Vol. 9, pp. 70-84.\nDaconta, M. C., Obrst, L. J. and Smith, K. T. (2003). The semantic web: A guide to the future of XML, web services,\nand knowledge management. John Willey & Sons. ISBN: 0471432571.\nDassault-Systems (2002). 'Dassault Systems acquires Knowledge Technologies International'. Dassault Systems\nPress Room. WWW document: http:\/\/www.3ds.com\/se\/news-events\/press-room\/release\/796\/1\/ (accessed 16\nAugust 2006).\nEckert, C. M. and Clarkson, P. J. (2003). The reality of design process planning. In: Research for Practice -\nInnovation in Products and Processes. International Conference on Engineering Design. ICED'03. edited by:\nFolkeson, A., Gralen, K., Norell, M. and Sellgren, U. The Design Society.ISBN: 1904670008.\nEckert, C. M. and Clarkson, P. J. (2005). The reality of design. In: Design process improvement. A review of current\npractice. edited by: Eckert, C. M. and Clarkson, P. J. Springer-Verlag.ISBN: 185233701X.\nEppinger, S. D., Whitney, D. E. and Smith, R. P. (1990). Organizing the Tasks in Complex Design Projects. In:\nASME Conference on Design Theory and Methodology, Chicago, Illinois, American Society of Mechanical\nEngineers.\nFan, I.-S., Li, G., Lagos-Hernández, M. and Bermell-Garcia, P. (2002). A rule-level knowledge management system\nfor knowledge-based engineering applications. In: Proceedings of DETC’02, ASME International 22nd\nComputers and Information in Engineering, (CIE) Conference, Montreal, Canada, 29 September – 2 October,\nAmerican Society of Mechanical Engineers.\nHales, C. (1993). Managing engineering design. Longman\/John Wiley & Sons Harlow\/New york. ISBN:\n0582039339.\nHobday, M. (1998). 'Product complexity, innovation and industrial organisation'. Research Policy. Vol. 26, No.\n6,April 1998, pp. 689-710.\nHolsapple, C. W. (2005). 'The inseparability of modern knowledge management and computer-based technology'.\nJournal of Knowledge Management. Vol. 9, No. 1, pp. 42-52.\nHong, P., Vonderembse, M. A., Doll, W. J. and Nahm, A. Y. (2005). 'Role change of design engineers in product\ndevelopment'. Journal of Operations Management. Vol. 24, pp. 63-79.\nISO10303-11 (1994). 'Industrial automation systems and integration -- Product data representation and exchange --\nPart 11: Description methods: The EXPRESS language reference manual'. International Organization for\nStandardization, ISO.\nKulon, J., Mynors, D. J. and Broomhead, P. (2006). 'A knowledge-based engineering design tool for metal forging'.\nJournal of Materials Processing Technology. Vol. 177, pp. 331-335.\nKusiak, A. and Wang, J. (1993). 'Decomposition of the design process'. Journal of Mechanical Design. Vol. 115,\nNo. 4,pp. 687-695.\nLi, G., Bracewell, R. H. and Wallace, K. M. (2000a). A knowledge framework to support engineering design. In:\n7th ISPE International Conference on Concurrent Engineering, Lyon, France, 17-20 July 2000, International\nSociety for Productivity Enhancement.\nLi, G., Cooper, S. and Fan, I.-S. (2000b). KBE application and research in the UK. In: Proceedings of the\nInternational Conference on Advanced Manufacturing Systems and Manufacturing Automation, AMSMA\n2000, Guangzhou, China, 19-21 June.\nLovett, P. J., Ingram, A. and Bancroft, C. (2000). 'Knowledge-based engineering for SMEs - a methodology'.\nJournal of materials processing technology. pp. 384-389.\nLowe, A., Chris, M. and Culley, S. (2004). 'Characterising the requirements of engineering information systems'.\nInternational Journal of Information Management. Vol. 24, pp. 401-422.\nLukas, U. v., Krause, F.-L., Rothenburg, U., Wöhler, T., Romahn, A., Anderl, R., Melk, K., Awiszus, B., Ufer, R.,\nBinotsch, C., Schützer, K. and Gemignani, B. H. (2005). Engineering 2010: Setting the course for innovative\nengineering. VMM Wirtschaftsverlag.\nMcMahon, C. (2004). 'Knowledge management in engineering design: personalization and codification'. Journal of\nEngineering Design. Vol. 15, No. 4,pp. 307-325.\nFormatted: German\n(Germany)\nMcMahon, C., Giess, M. and Culley, S. (2005). 'Information management for through life product support: the\ncuration of digital engineering data'. International Journal of Product Lifecycle Management. Vol. 1, No. 1,pp.\n26-42.\nMellor, S. J., Scott, K., Uhl, A. and Weise, D. (2004). MDA distilled: principles of model-driven architecture.\nAddison Wesley. ISBN: 0201788918.\nO´Donell, F. J. and Duffy, A. H. B. (2005). Design performance. Springer-Verlag London. ISBN: 185233889X.\nOMG (2005). '“KBE services for PLM” Request for Proposal. OMG document: dtc\/05-09-11'. The Object\nManagment Group. WWW document: http:\/\/www.omg.org\/cgi-bin\/doc?dtc\/2005-9-11 (accessed 16th August\n2006).\nPenoyer, J. A., Burnett, G., Fawcet, D. J. and Liou, S.-Y. (2000). 'Knowledge based product life cycle systems:\nprinciples of integration of KBE and C3P'. Computer aided design. Vol. 32, pp. 311-320.\nRachuri, S., Baysal, M., Roy, U., Foufou, S., Bock, C., Fenves, S. J., Subrahmanian, E., Lyons, K. and Sriram, R. D.\n(2005). 'Information models for product representation: core and assembly models'. International Journal of\nProduct Development. Vol. 2, No. 3, pp. 207-235.\nRobinson, M. A., Sparrow, P. R., Clegg, C. and Birdi, K. (2005). 'Design engineering competencies: future\nrequirements and predicted changes in the forthcoming decade'. Design Studies. Vol. 26, pp. 123-153.\nSharma, A. (2005). 'Collaborative product innovation: integrating elements of CPI via PLM framework'. Computer\naided design. Vol. 37, No. 13, pp. 1425-1434.\nSharman, D. and Yassine, A. (2004). 'Characterizing Complex Product Architectures'. Systems Engineering. Vol. 7,\nNo. 1, pp. 35-60.\nSiemieniuch, C. E. and Sinclair, M. A. (1999). 'Organizational aspects of knowledge lifecycle management in\nmanufacturing'. International Journal on Human-Computer Studies. Vol. 51, pp. 517-547.\nSiemieniuch, C. E. and Sinclair, M. A. (2002). 'On complexity, process ownership and organisational learning in\nmanufacturing organisations, from an ergonomics perspective'. Applied Ergonomics. Vol. 33, pp. 449-462.\nSiemieniuch, C. E. and Sinclair, M. A. (2006). 'Systems Integration'. Applied Ergonomics. Vol. 37, No. 1, pp. 91-\n110.\nSim, S. K. and Duffy, A. H. B. (2003). 'Towards an ontology of generic engineering design activities'. Research in\nEngineering Design. Vol. 14, pp. 200-223.\nSteward, D. V. (1981). 'The design structure system: a method for managing the design of complex systems'. IEEE\nTransactions on Engineering Management. Vol. 28, No. 3, August 1981, pp. 71-74.\nStokes, M. (2001). Managing engineering knowledge: MOKA methodology for knowledge based engineering\napplications. Professional Engineering Publishing London. ISBN: 1860582958.\nStr.Direction (2005a). 'Engineering automation for the SME: a viable tool for \"mass\" customisation'. Strategic\nDirection. Vol. 21, No. 1, pp. 1-35.\nStr.Direction (2005b). 'Widening appreciation of PLM. Investing in delivering innovation'. Strategic Direction. Vol.\n21, No. 9, pp. 35-37.\nSubrahmanian, E., Rachuri, S., Fenves, S. J. and Foufou, S. (2005). 'Product lifecycle management support: a\nchallenge in supporting product design and manufacturing in a networked economy'. International Journal of\nProduct Lifecycle Management. Vol. 1, No. 1, pp. 4-25.\nSudarsan, R., Fenves, S. J., Sriram, R. D. and Wang, F. (2005). 'A product information modelling framework for\nproduct lifecycle management'. Computer aided design. Vol. 37, No. 13, pp. 1399-1411.\nTsui, E. (2005). 'The role of IT in KM: where are we now and where are we heading?' Journal of Knowledge\nManagement. Vol. 9, No. 1, pp. 3-6.\nYao, H. and Etzkorn, L. (2006). 'Automated conversion between different knowledge representation formats'.\nKnowledge-Based Systems. Vol. 19, No. 6, pp. 404-412.\nZha, X. F. and Du, H. (2006a). 'Knowledge-intensive collaborative design modelling and support. Part I: Review,\ndistributed models and framework'. Computers in Industry. Vol. 57, pp. 39-55.\nZha, X. F. and Du, H. (2006b). 'Knowledge-intensive collaborative design modelling and support. Part II: System\nimplementation and application'. Computers in Industry. Vol. 57, pp. 56-71.\nAppendix A. Questionnaire on KBE\/PLM integration issues\nThe following questions describe 10 issues to be supported by the integration of PLM and KBE technology. The\ntext between the parentheses is aimed to clarify each issue description. We ask you to evaluate their relevance in\nyour domain.\nFormatted: English (U.K.)\n Support the interoperability between KBE systems. (KBE application from KBE system “a” can be used in\nKBE system “b”)\n Support for increasing the transparency of KBE application functionalities and data processing. (Information\nprocessing of KBE applications can be visualised by non KBE experts)\n Support for increasing the reuse of existing KBE applications across domains and projects. (KBE applications\ncan be more easily retrieved and re-engineered to be usable on more situations)\n Support for increasing the efficiency in maintaining and updating KBE applications. (KBE applications can be\nmore efficiently adapted to the changes of the knowledge)\n Support for modularity and easier development of KBE applications. (KBE applications can be more easily\ncreated by assembling existing documented components)\n Support for the management of service-oriented KBE infrastructure. (KBE applications can be deployed as\nservices across the network to be discovered and reused more intensively)\n Support for the KBE generation of engineering data through semantic web services. (KBE applications can be\ndeployed as semantic web services that users discover and access in order to generate engineering data)\n Support for the management of intellectual property stored in PLM. (Engineering knowledge stored in the PLM\ninfrastructure is used as an input for KBE applications and vice-versa)\n Support for engineering change management of KBE applications in PLM. (KBE application engineering\nchange requests can be supported by PLM ECM infrastructure)\n Support for more formal knowledge representation methods both in KBE. (KBE systems and PLM solutions\nallow the deployment of formal conceptual models and advanced inference\/reasoning mechanisms)\nThe possible answers to each of these questions are:\na. Not a relevant issue\nb. Some relevance but not in my domain\nc. Some relevance in my domain. Part of a long-term strategy\nd. Highly relevant issue in my domain. Not in my short term strategy\ne. Highly relevant issue in my domain. Part of my short term strategy.\nAdditional space is provided in the questionnaire to add comments.\nUnderstand design\nas a technical\nproblem solving\nactivity\nContextualise design\nas a systematic\nprocedure in\nengineering\nContextualise\ndesign as a situated\nbusiness process\nUnderstand the socio-\ntechnical complexity\nof product\nengineering\nCognitive and\ncomputational\nmodels of design\nSystematic\ndesign process\nmodels\nData-centric\nengineering\ndesign support\nKnowledge Life\ncycle\nmanagement\nEarly CAD systems\nMulti-aspect CAD systems\nProduct Data Management systems\nEngineering KM systems\nTrends on\nengineering\ndesign research\nIndustrial\ndemands\nPLM systems\nEnabling\ntechnologies\nFigure 1. Engineering design practice evolution.\nKBE Platform 1 KBE Platform “n”\nKBE application KBE application\nPRODUCT\nDATA\n3D Models\nBOM\n…\nPRODUCT\nDATA\n3D Models\nBOM\n…\nKBE\nLanguage 1\nKBE\nLanguage 2\n=\n????\nPlatf. Dep. Knowledge\nabstraction metamodel\nPlatf. Dep. Knowledge\nabstraction metamodel\nFigure 2. Challenge for KBE interoperability\nKBE\nSystem\nEngineering data\nService\nauthoring\nService change\/\ncreation request\nService\nvalidationService\nvalidationService\nvalidation\nService\nusage\nService\nretrieval\nFigure 3. Lifecycle management of KBE software services.\nTable 1. Business functions for the KBE\/PLM integration\nAverage\nperceived\nimportance\nBusiness functions to be\nsupported by the\nKBE\/PLM integration\nExamples of application\n1 4.57\nThe modularity and easier\ndevelopment of KBE\napplications\nKBE applications can be more easily\ncreated by assembling existing\ndocumented components\n2 4.43\nThe increase of efficiency\nin maintaining and\nupdating KBE applications\nKBE applications can be more\nefficiently adapted to changes in the\nknowledge\n3 4.43\nThe use of formal\nknowledge representation\nmethods for both KBE and\nPLM\nKBE systems and PLM solutions\nenable the deployment of formal\nconceptual models and advanced\ninference\/reasoning mechanisms\n4 4.14\nThe increase of\ntransparency of KBE\napplication functionalities\nand data processing\nInformation processing in KBE\napplications can be better visualised\nby non KBE experts\n5 4 The interoperabilitybetween KBE systems\nKBE application from KBE system\n“A” can be used in KBE system “B”\n6 4\nThe increase of the reuse of\nexisting KBE applications\nacross domains and\nprojects\nKBE applications are more easily\nretrieved and reengineered to be\nusable in more situations\n7 4\nThe management of in\nintellectual property stored\nin PLM\nEngineering knowledge stored in\nPLM repositories is used as an input\nfor KBE applications and vice-versa\n8 4\nThe engineering change\nmanagement of KBE\napplications through PLM\nThe change requests for KBE\napplications can be supported by the\nengineering change management\nfunctionalities in PLM\n9 3.71 The management of serviceoriented KBE infrastructure\nKBE applications can be deployed as\nservices across the network to be\ndiscovered and reused\n10 3.29\nThe KBE generation of\ndata through semantic web\nservices\nKBE applications are deployed as\nsemantic web services that user\ndiscover and access in order to\ngenerate engineering data\nTable 2. Information about the participants in the study.\nRole in respect to KBE Role in respect to PLMOrganisation\ntype\nOrganisation\nsize\nPosition in the\norganisation D (1) U (2) S (3) IR (4) A (5) U (6) D (7)\nParticipant 1\nConsultancy\/\nSoftware vendor\nBetween 1000\nand 2000\nemployees\nR&D director X X X\nParticipant 2 OEM aerospace\nMore than 2000\nemployees\nSenior aerospace\nengineer X X X X X X\nParticipant 3 OEM aerospace\nMore than 2000\nemployees\nKBE product line\nmanager X X X\nParticipant 4 OEM aerospace\nMore than 2000\nemployees\nAssociate Technical\nFellow X X\nParticipant 5 Consultancy\nMore than 2000\nemployees\nEngineering automation\ndeputy manager X X\nParticipant 6 OEM aerospace\nMore than 2000\nemployees\nKnowledge engineering\nteam leader X X\nParticipant 7 Research org.\nBetween 1000\nand 2000\nemployees\nLecturer and aerospace\nengineering course\ndirector\nX X X X X\n(1) Developer of KBE applications; (2) User of KBE applications; (3) Provider of software support for both KBE users and developers; (4) Part of the\nteam responsible for implementing PLM in the organisation; (5) Administrator of a PLM solution in the organisation; (6) User of the PLM solution in\nthe organisation; (7) Part of a PLM software development team.\n"}