{"doi":"10.1063\/1.2117632","coreId":"113605","oai":"oai:epubs.surrey.ac.uk:410","identifiers":["oai:epubs.surrey.ac.uk:410","10.1063\/1.2117632"],"title":"High Mobility Ambipolar Charge Transport in a Cross-Linked Reactive Mesogen at Room Temperature","authors":["Kreouzis, T","Baldwin, R","Shkunov, M","McCulloch, I","Heeney, M","Zhang, W"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-01-01","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:410<\/identifier><datestamp>\n      2017-10-31T13:58:06Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:6E616E6F656C656374726F6E696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/410\/<\/dc:relation><dc:title>\n        High Mobility Ambipolar Charge Transport in a Cross-Linked Reactive Mesogen at Room Temperature<\/dc:title><dc:creator>\n        Kreouzis, T<\/dc:creator><dc:creator>\n        Baldwin, R<\/dc:creator><dc:creator>\n        Shkunov, M<\/dc:creator><dc:creator>\n        McCulloch, I<\/dc:creator><dc:creator>\n        Heeney, M<\/dc:creator><dc:creator>\n        Zhang, W<\/dc:creator><dc:date>\n        2005-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/410\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Kreouzis, T, Baldwin, R, Shkunov, M, McCulloch, I, Heeney, M and Zhang, W  (2005) High Mobility Ambipolar Charge Transport in a Cross-Linked Reactive Mesogen at Room Temperature   Applied Physics Letters, 87 (17).       <\/dc:identifier><dc:relation>\n        10.1063\/1.2117632<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/410\/","10.1063\/1.2117632"],"year":2005,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"APPLIED PHYSICS LETTERS 87, 172110 \u00012005\u0002High mobility ambipolar charge transport in a cross-linked reactive\nmesogen at room temperature\nT. Kreouzisa\u0001 and R. J. Baldwin\nPhysics Department, Queen Mary, University of London, E1 4NS, United Kingdom\nM. Shkunov, I. McCulloch, M. Heeney, and W. Zhang\nMerck Chemicals, Chilworth Science Park, Southampton, SO16 7QD, United Kingdom\n\u0001Received 20 May 2005; accepted 1 September 2005; published online 21 October 2005\u0002\nBy photochemically cross linking the molecules of a reactive end group functionalized calamitic\nliquid crystal \u0001bis\u0001heptylphenyl\u0002-bithiophene-oxetane\u0002 in the smectic mesophase, an insoluble rigid\nmolecular network is formed which remains structurally unchanged on cooling to room temperature.\nThe charge transport is investigated by the time-of-flight method and the resulting material shows\nlong-range \u0001\u000310 \u0001m\u0002 ambipolar transport with nondispersive field independent hole mobility,\n\u0001hole=0.016 cm2\/V s and dispersive field dependent electron mobility, typically \u0001electron\n=0.028 cm2\/V s \u0001both at 4\u0002104 V cm−1 and at 15 °C\u0002. These desirable charge transport properties\nmake this system a promising candidate for organic electronic applications, such as charge transport\nlayers in organic light-emitting diodes and field effect transistors. © 2005 American Institute of\nPhysics. \u0004DOI: 10.1063\/1.2117632\u0005Highly ordered thermotropic liquid crystalline me-\nsophases display desirable high mobility charge transport;1\nthese usually occur at elevated temperatures, and upon cool-\ning, the formation of a polycrystalline solid has a detrimental\neffect on the charge transport1 as the grain boundaries form\ncharge carrier barriers. These barriers have the effect of re-\nducing the carrier range and long-range mobility. It has been\nproposed that the problem of maintaining the enhanced\ntransport properties present in the mesophase, at tempera-\ntures below the crystalline to mesophase transition, can be\nsolved by the use of reactive mesogens \u0001RMs\u0002. These are\ncomprised of liquid crystal molecules with reactive end\ngroups at the ends of the aliphatic chains. They form ther-\nmotropic mesophases and can be irreversibly photopolymer-\nized in the presence of an appropriate photoinitiator, forming\na stable network. It is expected that as the morphology is\nfrozen-in, the transport properties will be stabilized.2,3 The\nformation of an insoluble semiconducting film has the\nadvantage of simplifying the fabrication of multilayer de-\nvices using sequential solution-based application methods to\nadd further layers.3 In addition, RMs can be patterned using\noptical masks.\nInitial time-of-flight \u0001TOF\u0002 studies on a nonreactive ca-\nlamitic liquid crystal bis\u0001alkylphenyl\u0002-bithiophene \u0001PTTP\u0002\n\u0001Fig. 1\u0001a\u0002\u0005 in the smectic phase \u0001SmG\u0002 showed ambipolar\ntransport \u0004see Fig. 2\u0002 with resulting hole mobility \u0001hole\n=0.044 cm2 V−1 s−1 and electron mobility \u0001electron\n=0.07 cm2 V−1 s−1 \u0001these are both dispersive and field de-\npendent, quoted here at 4\u0002104 V cm−1\u0002, indicating that this\nparticular calamitic core was a promising candidate for the\npreparation of an oxetane containing reactive mesogen. Be-\ning a thermotropic liquid crystal at elevated temperatures,\nthis behavior was, of course, lost at room temperature, yield-\ning featureless trapping decays in the photocurrent transients.\nThe RM used in the cross linking experiment \u0001PTTP-\noxetane\u0002 is shown in Fig. 1\u0001b\u0002. This was mixed with 0.5\na\u0002Electronic mail: t.kreouzis@qmul.ac.uk\n0003-6951\/2005\/87\u000217\u0001\/172110\/3\/$22.50 87, 17211\nDownloaded 03 Jun 2009 to 131.227.178.130. Redistribution subject towt % cationic initiator \u0001Meerkat\u0002 and the liquid crystal cell\n\u0001thickness, d=10 \u0001m\u0002 was filled by capillary action by melt-\ning the solid above the clearing point in a modified Linkam\nLTS350 hotstage. The RM was then allowed to form the\nsmectic mesophase \u0001SmB\u0002 by lowering the temperature to\n140 °C and cross-linked using the 405 nm wavelength output\nfrom a continuous-wave diode laser \u000115 mW\u0002 for 60 min.\nThe cross-linking was inferred by heating the sample above\nthe clearing point temperature, and comparing the illumi-\nnated regions to those not illuminated under a polarized op-\ntical microscope. The cross-linked regions maintained their\nbirefringent texture, while those that were not subject to ra-\ndiation underwent the transition to the isotropic phase. Direct\nconfirmation of the cross-linking reaction by infared spec-\ntroscopy was not possible as the sample was encased within\nthe glass liquid crystal cell. The sample was cooled to room\ntemperature \u000115 °C\u0002 and the TOF photocurrent transients\nwere obtained using 6 ns duration, 337 nm wavelength, laser\npulses from a Lambda Physic N2 laser, with the sample un-\nder a dc bias, magnitude V, whose polarity determines the\nsign of carrier investigated. The photocurrents were detected\nas the voltage droped across a load resistor on the input of an\nAgilent infinium digitizing oscilloscope. Figure 3 shows two\ntypical hole photocurrents at room temperature; they show a\nnondispersive constant current plateau, and the inflection\npoint transit time \u0001t0\u0002 scales correctly with varying electric\nFIG. 1. \u0001a\u0002 Molecular structure of bis\u0001heptylphenyl\u0002-bithiophene \u0001PTTP\u0002.\n\u0001b\u0002 Molecular structure of bis\u0001heptylphenyl\u0002-bithiophene-oxetane\n\u0001PTTP-oxetane\u0002.\n© 2005 American Institute of Physics0-1\n AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\n172110-2 Kreouzis et al. Appl. Phys. Lett. 87, 172110 \u00022005\u0001field. The resulting field independent mobility, \u0001hole\n=0.016 cm2 V−1 s−1, is calculated using \u0001=d2 \/Vt0 and the\ninflection point time, t0, is used \u0001strictly the arrival time of\nthe fastest carriers\u0002 rather than the time to half plateau height\n\u0001the average arrival time\u0002, in order to make comparisons pos-\nsible with the dispersive electron results, where there is no\nplateau present. Two electron photocurrents are shown in\nFig. 4. They both show a decrease over time before the in-\nflection point, typical of dispersive transport, and the transit\ntime again scales correctly with electric field. The calculated\nelectron mobility is field dependent, as expected for dis-\npersive transport, typically \u0001electron=0.028 cm2 V−1 s−1 at\n4\u0002104 V cm−1.\nBoth the hole and electron mobilities measured in this\nstudy are remarkable for this kind of cross-linked system.\nThey exceed those measured in cross-linked networks from\nnematic mesogens \u0001\u000310−4 cm2 V−1 s−1\u0002,4 those measured\nin smectic mesogens dispersed in a host network\nFIG. 2. Electron \u0001upper curve\u0002 and hole \u0001lower curve\u0002 photocurrents across\na 4.9 \u0001m sample of PTTP in the smectic phase \u0001E=4\u0002104 V cm−1\u0002. The\ndashed lines are included as a guide for the eyes for the location of the\ntransit time, t0.\nFIG. 3. Hole photocurrent transients across a 10 \u0001m film of cross-linked\nPTTP-oxetane \u000140 V bias upper curve, 20 V bias lower curve\u0002 at 15 °C. The\ndashed lines are included as a guide for the eyes for the location of the\ntransit time, t0.\nDownloaded 03 Jun 2009 to 131.227.178.130. Redistribution subject to\u0001\u000310−3 cm2 V−1 s−1\u0002,5 and those previously reported for\ncross linked films by the authors.6 Although these values are\nnot as large as those for single-molecular crystals,7 or those\nin nonreactive liquid crystal smectic mesophases,8 or indeed\ncolumnar mesophases,9 the formation of a solid, stable, in-\nsoluble, and semiconducting layer, will allow easy incorpo-\nration of these materials in actual device structures \u0001field-\neffect transistor, organic light-emitting device\u0002, in much the\nsame manner as the polymeric materials are currently used.\nThe mobility data for the various materials is summarized in\nTable I.\nAn overall consideration of the charge transport in the\nthree systems presented here \u0001PTTP, cross linked PTTP-\noxetane, and nonpolymerised PTTP-oxetane\u0002 leads to the\nfollowing observations. Both holes and electrons in smectic\nPTTP display dispersive behavior \u0001Fig. 2\u0002. This is unlike the\nnondispersive transport observed in many other smectic sys-\ntems \u0001e.g., Refs. 8 and 5\u0002 and most probably an impurity\neffect. The transport in nonpolymerized smectic PTTP-\nFIG. 5. Hole \u0001upper curve\u0002 and electron \u0001lower curve\u0002 photocurrents across\na 10 \u0001m sample of nonpolymerized PTTP-oxetane at 140 °C \u0001Smectic B\nFIG. 4. Electron photocurrent transients across a 10 \u0001m film of cross-linked\nPTTP-oxetane \u000140 V bias upper curve, 25 V bias lower curve\u0002 at 15 °C. The\ndashed lines are included as a guide for the eyes for the location of the\ntransit time, t0.phase, 20 V bias\u0002.\n AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\n172110-3 Kreouzis et al. Appl. Phys. Lett. 87, 172110 \u00022005\u0001oxetane appears to be nondispersive for both electrons and\nholes \u0001both photocurrents display a plateau region, albeit a\nnarrow one in the case of electrons, see Fig. 5\u0002, in the ab-\nsence of photoinitiator, and in agreement with other reported\nsystems. This is in contrast to the cross-linked sample results\nshown in Fig. 4, where the electron photocurrent becomes\ndispersive. Any remaining photoinitiator appears to have a\ntrapping effect in the case of electrons, but not in the case of\nholes, whose behavior remains nondispersive \u0001Fig. 3\u0002. The\nphotoinitiator concentration, and its effects on the transport\nand cross-linking, are the subject of ongoing investigation.\nIn terms of carrier mobility, there is a small drop be-\ntween the nonreactive liquid crystal PTTP and the reactive\nmesogen PTTP-oxetane \u0001both for the cross linked and non-\npolymerized case\u0002. This is not due to the presence of the\nphotoinitiator, as the nonpolymerised PTTP-oxetane without\ninitiator yields mobilities in agreement with the cross-linked\nfilm results at the same temperature \u0001see Table I\u0002. There even\nappears to be some mobility improvement postcross-linking,\nalthough this could be due to sample to sample variation.\nThe higher mobility in the nonreactive liquid crystal, com-\npared to the RM, is probably due to the higher order smectic\nphase \u0001SmG\u0002 present in the former compared to the latter\n\u0001SmB\u0002. This relative drop between a liquid crystal and a\nrelated reactive mesogen is not surprising and has been pre-\nviously measured in a variety of systems,10,6 although in\nmany cases the drop is of a factor of 10. This will not be\nTABLE I. Summary of material parameters.\nMaterial \u0001hole \u0001cm2 V−1 s−1\u0002\nPTTP 0.044 \u0001at 175 °C\u0002\nPTTP-oxetane 0.016 \u0001at 15 °C\u0002\nCross linked 0.033 \u0001at 140 °C\u0002\nPTTP-oxetane nonpolymerized 0.01 \u0001at 140 °C\u0002discussed further at present, as the results presented here are\nDownloaded 03 Jun 2009 to 131.227.178.130. Redistribution subject toa small unoptimized, part of a broader systematic study, in-\nvolving the variation of both core and reactive end groups in\nliquid crystals and reactive mesogens, currently being\nconducted.\nThe authors wish to thank Dr. K. S. Whitehead \u0001Impe-\nrial\u0002 for useful discussions on reactive mesogens, Professor J.\nGoodby and Dr. S. Cowling \u0001York\u0002 for the identification of\nthe material mesophases and the EPSRC for financial sup-\nport of this research.\n1M. Funahashi and J.-I. Hanna, Appl. Phys. Lett. 71, 602 \u00011997\u0002.\n2P. Vlachos, S. M. Kelly, B. Mansoor, and M. O’Neill, Chem. Commun.\n\u0001Cambridge\u0002 2002, 874.\n3I. McCulloch, W. Zhang, M. Heeney, C. Bailey, M. Giles, D. Graham, M.\nShkunov, D. Sparrowe, and S. Tierney, J. Mater. Chem. 13, 2436 \u00012003\u0002.\n4S. R. Farrar, A. E. A. Contoret, M. O’Neill, J. E. Nicholls, G. J. Richards,\nand S. M. Kelly, Phys. Rev. B 66, 125107 \u00012002\u0002.\n5N. Yoshimoto and J.-I. Hanna, J. Mater. Chem. 13, 1004 \u00012003\u0002.\n6M. Shkunov, W. Zhang, D. Graham, D. Sparrowe, M. Heeney, M. Giles,\nS. Tierney, C. Bailey, I. McCulloch, and T. Kreouzis, Proc. SPIE 5217,\n181 \u00012003\u0002.\n7V. Podzorov, S. E. Sysoev, E. Loginova, V. M. Pudalov, and M. E.\nGershenson, Appl. Phys. Lett. 83, 17 \u00012003\u0002; 83, 3504 \u00012003\u0002.\n8M. Funahashi and J.-I. Hanna, Adv. Mater. \u0001Weinheim, Ger.\u0002 17, 594\n\u00012005\u0002.\n9D. Adam, P. Schuhmacher, J. Simmerer, L. Haussling, K. Siemensmeyer,\nK. H. Etzbach, H. Ringsdorf, and D. Haarer, Nature \u0001London\u0002 371, 141\n\u00011994\u0002.\n10\n\u0001electron \u0001cm2 V−1 s−1\u0002 Phase behavior\n0.07 \u0001at 175 °C\u0002 K-140-SmG-225-SmC-229-SmA-234-I\n0.028 \u0001at 15 °C\u0002\n0.024 \u0001at 140 °C\u0002\n0.012 \u0001at 140 °C\u0002 K-83-SmG-93-SmB-144-IR. J. Baldwin \u0001private communication\u0002.\n AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\n"}