{"doi":"10.1515\/jgth.2003.033","coreId":"69843","oai":"oai:eprints.lancs.ac.uk:20816","identifiers":["oai:eprints.lancs.ac.uk:20816","10.1515\/jgth.2003.033"],"title":"Endo-permutation modules as sources of simple modules.","authors":["Mazza, Nadia"],"enrichments":{"references":[{"id":16338397,"title":"Aﬃrmative answer to a question of Feit,","authors":[],"date":"1990","doi":"10.1016\/0021-8693(90)90192-q","raw":"L. Puig, Aﬃrmative answer to a question of Feit, J. Algebra 131 (1990), 513–526.","cites":null},{"id":16338381,"title":"Blocks with cyclic defect groups I,","authors":[],"date":"1966","doi":"10.2307\/1970529","raw":"E. C. Dade, Blocks with cyclic defect groups I, Ann. Math. 84 (1966), 20-48.","cites":null},{"id":16338391,"title":"Character theory of ﬁnite groups,","authors":[],"date":"1976","doi":"10.1515\/9783110809237.538","raw":"I. M. Isaacs, Character theory of ﬁnite groups, Acad. Press, 1976.","cites":null},{"id":16338389,"title":"Character theory of ﬁnite groups, Walter de Gruyter,","authors":[],"date":"1998","doi":"10.1515\/9783110809237","raw":"B. Huppert, Character theory of ﬁnite groups, Walter de Gruyter, 1998.","cites":null},{"id":16338380,"title":"Endo-permutation modules over p-groups, I, II,","authors":[],"date":"1978","doi":"10.2307\/1971169","raw":"E. C. Dade, Endo-permutation modules over p-groups, I, II, Ann. Math. 107 (1978), 459– 494, 108 (1978), 317–346.","cites":null},{"id":16338400,"title":"evenaz, G-algebras and modular representation theory,","authors":[],"date":"1995","doi":null,"raw":"J. Th´ evenaz, G-algebras and modular representation theory, Oxford, 1995.","cites":null},{"id":16338387,"title":"Finite groups, Harper and Row,","authors":[],"date":"1968","doi":"10.1007\/978-1-4684-8497-7","raw":"D. Gorenstein, Finite groups, Harper and Row, 1968.","cites":null},{"id":16338383,"title":"Finite solvable groups, Walter de Gruyter,","authors":[],"date":"1992","doi":"10.1515\/9783110870138","raw":"K. Doerk, T. Hawkes, Finite solvable groups, Walter de Gruyter, 1992.","cites":null},{"id":16338379,"title":"Methods of representation theory with applications to ﬁnite groups and orders I, Pure and applied mathematics,","authors":[],"date":"1981","doi":null,"raw":"C. W. Curtis, I. Reiner, Methods of representation theory with applications to ﬁnite groups and orders I, Pure and applied mathematics, John Wiley and Sons, 1981.","cites":null},{"id":16338376,"title":"Non-Additive Exact Functors and Tensor Induction for Mackey Functors,","authors":[],"date":"2000","doi":"10.1090\/memo\/0683","raw":"S. Bouc, Non-Additive Exact Functors and Tensor Induction for Mackey Functors, AMS Memoirs 683, vol. 144 (2000), 275–349.","cites":null},{"id":16338395,"title":"Notes sur les p-alg` ebres de Dade,","authors":[],"date":"1988","doi":null,"raw":"L. Puig, Notes sur les p-alg` ebres de Dade, Preprint, 1988.","cites":null},{"id":16338398,"title":"Repr´ esentation lin´ eaires des groupes ﬁnis,","authors":[],"date":"1978","doi":null,"raw":"J.-P. Serre, Repr´ esentation lin´ eaires des groupes ﬁnis, Hermann, 1978.","cites":null},{"id":16338377,"title":"Th´ evenaz, The group of endo-permutation modules,","authors":[],"date":"2000","doi":"10.1007\/s002229900026","raw":"S. Bouc, J. Th´ evenaz, The group of endo-permutation modules, Invent. math. 139 (2000), 275–349.","cites":null},{"id":16338378,"title":"Th´ evenaz, Torsion endo-trivial modules,","authors":[],"date":"2000","doi":null,"raw":"J. Carlson, J. Th´ evenaz, Torsion endo-trivial modules, Algebr. Represent. Theory 3 (2000), 303–335.","cites":null},{"id":16338393,"title":"The Dade group of a metacyclic p-group,","authors":[],"date":null,"doi":"10.1016\/s0021-8693(03)00328-4","raw":"N. Mazza, The Dade group of a metacyclic p-group, J. Algebra, to appear.","cites":null},{"id":16338385,"title":"The Representation Theory of Finite groups,","authors":[],"date":"1982","doi":"10.1016\/s0924-6509(08)70425-2","raw":"W. Feit, The Representation Theory of Finite groups, North Holland Publishing Company, 1982.","cites":null}],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2003-05","abstract":"The source of a simple $kG$-module, for a finite $p$-solvable group $G$ and an algebraically closed field $k$ of prime characteristic $p$, is an endo-permutation module (see~\\cite{Pu1} or~\\cite{Th}). L. Puig has proved, more precisely, that this source must be isomorphic to the cap of an endo-permutation module of the form $\\bigotimes_{Q\/R\\in\\cal S}\\Ten^P_Q\\Inf^Q_{Q\/R}(M_{Q\/R})$, where $M_{Q\/R}$ is an indecomposable torsion endo-trivial module with vertex $Q\/R$, and $\\cal S$ is a set of cyclic, quaternion and semi-dihedral sections of the vertex of the simple $kG$-module. At present, it is conjectured that, if the source of a simple module is an endo-permutation module, then it should have this shape. In this paper, we are going to give a method that allow us to realize explicitly the cap of any such indecomposable module as the source of a simple module for a finite $p$-nilpotent group","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69843.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/20816\/1\/endo%2Dpermutation%2Dmodules%2Das%2Dsources%2Dof%2Dsimple%2Dmodules.pdf","pdfHashValue":"018a4cd29b10d5a34f0a8c3c8cd9ffdb800bb9a3","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:20816<\/identifier><datestamp>\n      2018-01-24T02:35:04Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5141<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Endo-permutation modules as sources of simple modules.<\/dc:title><dc:creator>\n        Mazza, Nadia<\/dc:creator><dc:subject>\n        QA Mathematics<\/dc:subject><dc:description>\n        The source of a simple $kG$-module, for a finite $p$-solvable group $G$ and an algebraically closed field $k$ of prime characteristic $p$, is an endo-permutation module (see~\\cite{Pu1} or~\\cite{Th}). L. Puig has proved, more precisely, that this source must be isomorphic to the cap of an endo-permutation module of the form $\\bigotimes_{Q\/R\\in\\cal S}\\Ten^P_Q\\Inf^Q_{Q\/R}(M_{Q\/R})$, where $M_{Q\/R}$ is an indecomposable torsion endo-trivial module with vertex $Q\/R$, and $\\cal S$ is a set of cyclic, quaternion and semi-dihedral sections of the vertex of the simple $kG$-module. At present, it is conjectured that, if the source of a simple module is an endo-permutation module, then it should have this shape. In this paper, we are going to give a method that allow us to realize explicitly the cap of any such indecomposable module as the source of a simple module for a finite $p$-nilpotent group.<\/dc:description><dc:date>\n        2003-05<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/20816\/1\/endo%2Dpermutation%2Dmodules%2Das%2Dsources%2Dof%2Dsimple%2Dmodules.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1515\/jgth.2003.033<\/dc:relation><dc:identifier>\n        Mazza, Nadia (2003) Endo-permutation modules as sources of simple modules. Journal of Group Theory, 6 (4). pp. 477-497. ISSN 1435-4446<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/20816\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1515\/jgth.2003.033","http:\/\/eprints.lancs.ac.uk\/20816\/"],"year":2003,"topics":["QA Mathematics"],"subject":["Journal Article","NonPeerReviewed"],"fullText":"Endo-permutation modules as sources of simple modules\nNadia Mazza1\nInstitut de Mathe´matiques\nUniversite´ de Lausanne\nCH-1015 Lausanne\ne-mail : Nadia.Mazza@ima.unil.ch\nAugust 26, 2005\n1This work is a part of a doctoral thesis in preparation at the University of Lausanne, under the\nsupervision of Prof. Jacques The´venaz\nAbstract\nThe source of a simple kG-module, for a finite p-solvable group G and an algebraically closed field k\nof prime characteristic p, is an endo-permutation module (see [Pu1] or [Th]). L. Puig has proved,\nmore precisely, that this source must be isomorphic to the cap of an endo-permutation module\nof the form\n⊗\nQ\/R∈S Ten\nP\nQ Inf\nQ\nQ\/R(MQ\/R), where MQ\/R is an indecomposable torsion endo-trivial\nmodule with vertex Q\/R, and S is a set of cyclic, quaternion and semi-dihedral sections of the\nvertex of the simple kG-module. At present, it is conjectured that, if the source of a simple module\nis an endo-permutation module, then it should have this shape. In this paper, we are going to give\na method that allow us to realize explicitly the cap of any such indecomposable module as the\nsource of a simple module for a finite p-nilpotent group.\n1 Introduction\n1978, E. Dade introduced the concept of endo-permutation module, in the field of modular repre-\nsentation theory (see [Da1]). The study of these modules occupy at present an important position\nin representation theory, as they seem to appear very often. In particular, they appear as sources\nof simple modules for p-solvable groups, as it has been proved in [Pu1] and section 30 in [Th]. This\nfact raises then the following question: is any indecomposable endo-permutation module the source\nof a simple module, for some finite group? In other words, given a prime p, a finite p-group P , k\nan algebraically closed field of characteristic p and an indecomposable endo-permutation module\nM with vertex P , does there exist a finite group G having P as p-Sylow subgroup and a simple\nkG-module L, such that M is isomorphic to a direct summand of the restriction of L to P? We\ncan’t answer this question at the moment. However, if we consider a large subfamily of torsion\nendo-permutation modules, then we are able to realize explicitly these modules as sources, as we\nwill prove later. Let us also point out that, in order to realize explicitly such situations, we took\nsome inspiration from Dade’s methods, used in [Da2].\nLet us fix the notations and recall some basic facts we are going to use. Let p be a prime,\nO a complete discrete valuation ring, with quotient field K of characteristic 0 and residue field\nk, algebraically closed, of characteristic p (K is supposed to be “big enough” for the considered\ngroups). If G is a finite group, H a subgroup of G, M a kG-module and N a kH-module, then\nwe write M↓GH the restriction of M from kG to kH, N↑GH the induction of N from kH to kG and\nTenGH N the tensor induction of N from kH to kG. Moreover, if H \/G and L is a k[G\/H]-module,\nthen we denote by InfGG\/H L the inflation of L from k[G\/H] to kG. Recall that if g ∈ G, then\ngN , also written g ⊗N , is the conjugate module of N by g and has a structure of k[ gH]-module\ngiven by gh · gn = g(h · n), for all h ∈ H and n ∈ N , where · denotes the action of H on N and\ngh = ghg−1. IfMK andM ′K are two KG-modules, then we have a scalar product (over K) defined\nby\n(MK ,M ′K)G =\n∑\ng∈G\nTr(g,MK)Tr(g−1,M ′K),\nwhere Tr(g,MK) is the trace of the K-linear automorphism corresponding to the action of g\non MK . Note that we consider only finitely generated modules. In case MK and M ′K are sim-\nple KG-modules, then the orthogonality relations give MK ∼= M ′K ⇐⇒ (MK ,M ′K)G = 1 (else\n(MK ,M ′K)G = 0). We admit that the reader is familiar with elementary notions of representa-\ntion theory of finite groups and we come now to endo-permutation modules. A kP -module M is\nendo-permutation if the P -algebra EndkM is a permutation kP -module (i.e. there is a P -invariant\nk-basis). Moreover, if M is indecomposable, we say that it has vertex P if M is not projective\nrelative to any proper subgroup of P . If M is an endo-permutation kP -module with at least one\nindecomposable direct summand M0 with vertex P , then this summand is unique, up to isomor-\nphism and it is called the cap of M . This allows us to define an equivalence relation on theses\nmodules:\nM ∼ N ⇐⇒M0 ∼= N0.\nWe write D(P ) the abelian group formed by the equivalence classes of endo-permutation kP -\nmodules having an indecomposable direct summand of vertex P and we call it the Dade group\nof P . The composition law is given by [M ] + [N ] = [M ⊗ N ], the neutral element is the class\nof the trivial kP -module k (containing also all permutation kP -modules having a trivial direct\n1\nsummand) and −[M ] = [M∗], where M∗ = Homk(M,k) is the dual of M . We denote by Dt(P )\nthe torsion subgroup of D(P ) and by T (P ) the subgroup of D(P ) consisting of equivalence classes\nof endo-trivial kP -modules, i.e. kP -modulesM such that EndkM ∼= k⊕L, for a free kP -module L\n(notice that equivalence classes of endo-trivial modules are smaller than the corresponding classes\nin D(P )). For instance, the syzygies ΩnP (k), n ∈ Z of the trivial module are indecomposable endo-\ntrivial kP -modules with vertex P . The structure of D(P ) is strongly related to the structure of\nT (P ), as it can be noticed in the following theorem, due to Dade (see [Da1]), which classifies all\nendo-permutation modules in the case of an abelian p-group.\nTheorem 1.1 [Dade, [Da]] Let P be an abelian p-group.\n1. T (P ) is generated by [Ω1P (k)]. Thus T (P ) is trivial, if |P | = 2, cyclic of order 2, if P is cyclic\nof order ≥ 3, and infinite cyclic otherwise.\n2. D(P ) is isomorphic to the direct sum of the groups T (P\/Q), where Q runs over the set of\nproper subgroups of P .\nNow that we have recalled all the notions we are going to use, we can explain how we are\ngoing to proceed to realize endo-permutation modules as sources. We start by constructing some\nexamples of finite p-nilpotent groups G having a given p-group P as p-Sylow subgroup. Then we\nbuild, for each group G, a simple kG-module with vertex P and determine its source, that we\nknow to be endo-permutation. Then we prove that, in a sense that will become clear later, the\noperations of inflation, tensor induction and tensor product provide us a kind of “tools” that allow\nus to realize explicitly many other situations from known ones. Finally we note that the previous\nexamples, combined with these “tools”, lead us directly to the main result:\nTheorem Let p be a prime, P a finite p-group and k an algebraically closed field of characteristic p.\nThen any indecomposable endo-permutation kP -module M with vertex P that is a direct summand\nof a kP -module of the form\n⊗\nQ\/R∈S Ten\nP\nQ Inf\nQ\nQ\/R(MQ\/R), where MQ\/R is an indecomposable\ntorsion endo-trivial module with vertex Q\/R, and S is a set of sections of P that are cyclic, or also\nquaternion or semi-dihedral, in case p = 2, can be explicitly realized as source of a simple module\nwith vertex P for some finite p-nilpotent group.\nTo conclude this introductive section, we would try to justify our choice for concentrating on\ntorsion endo-permutation modules. At present, it is conjectured that, if the source of a simple\nmodule is an endo-permutation module, then its class should be a torsion element in the Dade\ngroup. This result has already been proved for finite p-solvable groups (cf. [Pu1]). Moreover, it\nis also conjectured that there are no other indecomposable torsion endo-permutation modules as\nthe ones that are isomorphic to the cap of a module of the form\n⊗\nQ\/R∈S Ten\nP\nQ Inf\nQ\nQ\/R(MQ\/R),\nas in our main theorem. Hence, if both conjectures hold, then we would have proved that any\nendo-permutation module that can be the source of a simple module, namely any torsion endo-\npermutation module, can be explicitly realized as the source of a simple module for a finite p-\nnilpotent group. Let us finally point out the fact that, in a talk given at the LMS Durham\nSymposium on representations of finite groups and related algebras (01-11 July 2002), Jon Carlson\nproved a result on T (P ) which implies that the second conjecture holds for p odd.\n2\n2 Construction of finite p-nilpotent groups\nLet p be a prime number and P a cyclic, quaternion or semi-dihedral p-group. Following Dade’s\nideas, exposed in [Da2], we are going to build a finite p-nilpotent group G = Q o P , with P as\np-Sylow subgroup and Q an extra-special q-group of exponent q and order q3, if P is cyclic or\nquaternion, and q5, if P is semi-dihedral, for a “well chosen” prime number q.\nLet us recall some useful properties about automorphisms of extra-special q-groups of order\nq3 and exponent q, for an odd prime q. Let Q be generated by two elements x and y of order\nq, and set z = [y, x], where [y, x] = yxy−1x−1. Then z has order q and generates the center of\nQ, which coincides with the subgroup Q′ generated by the commutators. The quotient Q\/Q′ is\na symplectic Fq-vector space of dimension 2, for the symplectic form [ , ] induced by taking the\ncommutator of two elements. In the basis {x¯, y¯} of Q\/Q′ (if g ∈ Q, we write g¯ its class in Q\/Q′),\n[ , ] corresponds to the matrix\n(\n0 1\n−1 0\n)\n. Then, the group Aut(Q\/Q′) of automorphisms of Q\/Q′\nis the symplectic group Sp2(Fq), which coincides with SL2(Fq). Let AutQ′(Q) be the subgroup of\nAut(Q) formed by the automorphisms of Q which are the identity on restriction to Q′. We have\na group homomorphism\npi : AutQ′(Q) −→ SL2(Fq) , pi(ϕ)(g¯) = ϕ(g˜), ∀ g˜ ∈ g¯ ∈ Q\/Q′ and ∀ϕ ∈ AutQ′(Q).\nMoreover, pi is surjective. Indeed, let us consider\nϕ : Q −→ Q ψ : Q −→ Q\nx 7−→ xy and x 7−→ x\ny 7−→ yz y 7−→ xy.\nIt is easy to check that ϕ and ψ belong to AutQ′(Q) and, since SL2(Fq) is generated by\ne =\n(\n1 0\n1 1\n)\nand f =\n(\n1 1\n0 1\n)\n(see Theorem 2.8.4 in [Go]), the surjectivity of pi is immediate.\nWe also notice that Ker(pi) is isomorphic to Q\/Q′. Indeed, the two following maps are injective\ngroup homomorphisms:\nconj : Q\/Q′ −→ Ker(pi) and τ : Ker(pi) −→ HomFq (Q\/Q′, Q′)\ng¯ 7−→ conj(g¯) ϕ 7−→ τ(ϕ),\nwhere conj(g¯)(h) = g˜h = g˜hg˜−1 and τ(ϕ)(g¯) = g˜−1ϕ(g˜), for a representative g˜ ∈ g¯, ∀ g¯ ∈\nQ\/Q′, ∀h ∈ Q and ∀ϕ ∈ Ker(pi). As Fq-vector space, Q′ is isomorphic to Fq. This implies\nthat HomFq (Q\/Q\n′, Q′) is isomorphic to the dual of Q\/Q′ and thus to Q\/Q′ as Fq-vector space. In\nparticular, it follows that |Ker(pi)| ≤ |Q\/Q′| and so conj and τ are isomorphisms. We get then a\nshort exact sequence:\n0 −→ Q\/Q′ −→ AutQ′(Q) −→ SL2(Fq) −→ 0.\nMoreover, if p and q are distinct prime numbers and P is a p-subgroup of SL2(Fq), then we get\nanother short exact sequence by restriction:\n(∗) 0 −→ Q\/Q′ −→ pi−1(P ) −→ P −→ 0.\n3\nIt follows from the Schur-Zassenhaus Theorem (see Corollary 8.40 in [CR]) that this sequence\nsplits, because Q\/Q′ and P have coprime orders and Q\/Q′ is abelian. So we have an injective map\nσ : P −→ AutQ′(Q), such that piσ = IdP .\nRecall that SL2(Fq) has order q(q2 − 1) and its 2-Sylow subgroups are generalized quaternion.\nThus the 2-subgroups of SL2(Fq) are either generalized quaternion or cyclic. From now on, we will\ndrop the word “generalized” in the expression “generalized quaternion group”.\nLemma 2.1 Let p and q be two distinct prime numbers, P be a finite cyclic p-group or, if p = 2,\ncyclic or quaternion, such that P is isomorphic to a subgroup of SL2(Fq), and let Q be an extra-\nspecial q-group of order q3 and exponent q. Then there exists an injective group homomorphism\nσ : P −→ Aut(Q). Moreover, we can choose σ such that the restriction of σ(u) to Q′ is the identity\nmorphism, for all u ∈ P .\nFollowing Dade’s ideas (cf. [Da2]), if we choose a prime number q such that q ≡ −1(mod |P |),\nthen, by the above Lemma, P identifies with a subgroup of Aut(Q), whose elements fix Q′. This\ndefines a semi-direct product G = Q o P , where P is a p-Sylow subgroup, acting by conjugation\non the normal q-subgroup Q and Q′ centralizes P . We can also notice, in case p = 2 and P is\nquaternion, that we can also consider a 2-nilpotent group, with the same features, if we take a\nprime number q with q ≡ |P |2 +1(mod |P |) (then P identifies with a 2-Sylow subgroup of SL2(Fq)).\nThe choices of congruences for the prime q will be motivated in section 4. Let us state some\nproperties of the p-nilpotent groups G = Qo P .\nLemma 2.2 With the same notation as above, the group G satisfies the following properties.\na) We can choose a section σ : P −→ pi−1(P ) of (∗) such that σ(w) has order p and no fixed\npoint on Q \\Q′, for a generator w of the unique subgroup of P of order p. In other words, w and\ng ∈ Q commute if and only if g ∈ Q′.\nb) The normalizer N of P in G is equal to Q′ × P .\nc) P is a trivial intersection subgroup of G.\nProof . a) Assume that P is cyclic of order pn, generated by u and write w = up\nn−1\n. As σ is\ninjective, σ(u) has order pn, and so σ(w) has order p.\nIf σ(w) has a fixed point on Q\\Q′, then pi(σ(w)) ∈ SL2(Fq) has an eigenvector for the eigenvalue\n1 and so is conjugate to a matrix of order p of the form A =\n(\n1 a\n0 1\n)\n, for an a ∈ Fq. But then,\nwe have Ap = Id ⇐⇒ pa = 0 ⇐⇒ a = 0, since p is invertible in Fq. It follows that A = Id, which\ncontradicts the fact that A has order p. Thus σ(w) has no fixed point on Q \\Q′.\nNow, if p = 2 and P is a quaternion 2-group, then, as before, we can choose σ such that σ(w)\nhas order 2, i.e. σ(w) = − Id. So 1 is not an eigenvalue of pi(σ(w)), i.e. σ(w) has no fixed point\non Q \\Q′.\nb) As G is p-nilpotent, we have N = CG(P )×P and so we just need to verify that CG(P ) = Q′.\nBy construction, Q′ centralizes P , so we have CG(P ) ≥ Q′. Conversely, if g ∈ CG(P ), then, in\nparticular, g and w commute. By a), it implies that g ∈ Q′.\nc) Let g ∈ Q and s ∈ gP ∩ P . There exists s′ ∈ P such that s = gs′ and so [g, s′] = 1. Indeed,\n[g, s′] = gs′(s′)−1 = s(s′)−1 ∈ P and [g, s′] = g(s′g)−1 ∈ Q as Q \/G. Thus [g, s′] ∈ P ∩Q = {1}. It\nfollows, by a), that g ∈ Q′, if s′ 6= 1, i.e. s 6= 1, as w is contained in any non trivial subgroup of P .\n\u0003\n4\nNow, we are going to construct a finite 2-nilpotent group with a semi-dihedral 2-Sylow subgroup\nP = <u, v | u2n−1 = v2 = 1, vu = u2n−2−1> of order 2n, with n ≥ 4. Consider a prime number\nq ≡ 2n−1 − 1(mod 2n) and\nQ =\n〈\nx1, x2, y1, y2 | xqi = yqi = 1, yixi = xi[yi, xi], [x1, x2] = [y1, y2] = [xi, yj ] = 1, ∀ 1 ≤ i 6= j ≤ 2\n〉\nan extra-special q-group of order q5, of exponent q and center Q′ = <z = [y1, x1] = [y2, x2]> cyclic\nof order q. We can also consider Q as the central product of two extra-special q-groups Q1 and Q2\nof order q3, of exponent q and center Q′, where Qi is the subgroup of Q generated by xi and yi,\nfor i = 1 and 2. There are three maximal subgroups in P , one of which is quaternion, call it R,\ngenerated by u2 and uv. The previous results allow us to consider a section σ : R −→ AutQ′1(Q1) of\nthe split exact sequence (∗) above. Notice that we get another injective map σ˜ : R −→ AutQ′2(Q2)\ndefined as follows. Let θ be the isomorphism Q1 −→ Q2 mapping x1 to x2 and y1 to y2 (and\nconsequently θ(z) = z) and let λ be the automorphism of R, mapping u2 to (u2)−1 and (uv) to\n(u2)2\nn−3−1(uv) (it is bijective since λ2 = Id). Then, if\nσ : R −→ AutQ′1(Q1) , we set σ˜ : R −→ AutQ′2(Q2)\nu2 7−→ σ(u2) u2 7−→ θσ(λ(u2))θ−1 = θσ(u2)−1θ−1\nuv 7−→ σ(uv) uv 7−→ θσ(λ(uv))θ−1 = θσ(u2)2n−3−1σ(uv)θ−1.\nConsider then\nP −→ AutQ′(Q),\nu 7−→ σu\nv 7−→ σv,\nwhere σu|Q1 = σ˜(uv)θ , σv|Q1 = θ , σu|Q2 = σ(uv)θ−1 and σv|Q2 = θ−1,\nand where σg|Qi denotes the restriction of σg to Qi, for g ∈ {u, v} and i = 1 and 2.\nThis is well defined and extends the maps σ : R −→ AutQ′1(Q1) and σ˜ : R −→ AutQ′2(Q2).\nIndeed, we have: (\nσ2u\n)∣∣\nQ1\n=\n(\nσu\n)∣∣\nQ2\n(\nσu\n)∣∣\nQ1\n=\n(\nσ(uv)θ−1\n)(\nσ˜(uv)θ\n)\n=\n= σ(uv)σ(u2)2\nn−3−1σ(uv) = σ(u2)2\nn−3+1σ(uv)2 = σ(u2)2\nn−3+1σ(u2)2\nn−3\n= σ(u2)\nand (\nσ2u\n)∣∣\nQ2\n=\n(\nσu\n)∣∣\nQ1\n(\nσu\n)∣∣\nQ2\n=\n(\nθσ(u2)2\nn−3−1σ(uv)\n)(\nσ(uv)θ−1\n)\n=\n= θσ(u2)2\nn−3−1σ(uv)2θ−1 = θσ(u2)−1θ−1 = σ˜(u2).\nWe also have σ2v = Id and\nσvσu = σ2\nn−2−1\nu , since\n(\nσuσv\n)∣∣\nQ1\n= σ(uv) and\n(\nσuσv\n)∣∣\nQ2\n= σ˜(uv). It\nfollows that the subgroup of AutQ′(Q) generated by σu and σv is semi-dihedral of order 2n. In\nother words, we get a finite 2-nilpotent group G, which is the semi-direct product of P by Q.\nMoreover, using the same argument as in the proof of the previous Lemma, we have CQ(P ) = Q′\nand so NG(P ) = Q′ ×P . The next result shows two differences between this construction and the\nprevious one.\nLemma 2.3 P has two conjugacy classes of elements of order 2. Moreover, P is not a trivial\nintersection subgroup of G.\n5\nProof . Observe that all non-central elements of P of order 2 can be written as a product u2av, for\nan integer 0 ≤ a < 2n−3. Now, for any integer b, we have\nubv = ub( vu)−bv = u2b(1−2\nn−3)v.\nThus, all non-central elements of order 2 are conjugate in P , by a power of u, and so P has two\nconjugacy classes of subgroups of order 2: one containing only the center and the class containing\nall the others subgroups of order 2.\nFor the second statement, consider the conjugacy morphism by the non-central element v of P\nof order 2, i.e. the map σv described above. We have σv(x1x2) = x1x2, i.e. v ∈ x1x2P ∩ P , but\nx1x2 6∈ NG(P ) = Q′ × P .\n\u0003\nNotice that if gP∩P 6= {1}, then gP∩P is conjugate to <v>. Indeed, any non-trivial subgroup of P\nwhich does not contain <w> has order 2 and must then be a conjugate of <v>. As <w> ≤ gP ∩P ,\nif and only if g ∈ NG(P ), we deduce that gP ∩ P is conjugate to <v>.\nLet us summarize the situation. We have build p-nilpotent groups of the form QoP , where Q\nis an extra-special q-group of exponent q, for a prime number q satisfying the following data:\n• If P is cyclic, then we choose q ≡ |P | − 1(mod p|P |) and Q of order q3.\n• If P is quaternion, then we build two finite 2-nilpotent groups by choosing two distinct prime\nnumbers q: first q ≡ |P | − 1(mod 2|P |), and then q ≡ |P |2 + 1(mod |P |). In each case, Q has\norder q3.\n• If P is semi-dihedral, then we choose q ≡ |P |2 − 1(mod |P |) and Q of order q5.\n3 Construction of simple kG-modules\nLet us first recall some basic facts about the simple kQ-modules, where Q is an extra-special q-\ngroup of order q1+2m and exponent q for a prime number q, distinct from p = char(k), and an\ninteger m ≥ 1. Write x1, . . . , xm, y1, . . . , ym the generators of Q satisfying the relations xqi = yqi =\n1, yixi = xi[yi, xi], [yi, xi] = [yj , xj ] and [xi, xj ] = [xi, yj ] = [yi, yj ] = 1, ∀ 1 ≤ i 6= j ≤ m. Let also\nz = [y1, x1] be the generator of the center Q′ of Q (which coincides with the subgroup generated\nby the commutators) and let A be the elementary abelian normal subgroup of Q of rank m + 1,\ngenerated by x1, . . . , xm and z. We know, by Proposition 7.7 in [Hu], that Q has q − 1 simple\nkQ-modules of dimension qm and q2m simple kQ-modules of dimension 1. Let us describe them.\nLet ω ∈ k be a primitive q-th root of unity and consider the degree 1 representation given by:\nψ : A −→ k∗\nxi 7−→ 1, 1 ≤ i ≤ m\nz 7−→ ω.\n6\nWe have gψ 6= ψ, ∀g 6∈ A. In terms of modules, if we write kψ the kA-module of dimension 1 defined\nby a · λ = ψ(a) · λ, ∀a ∈ A, ∀λ ∈ k, then this is equivalent to saying that kψ \u001d gkψ. It follows\nby Clifford theory (see Chapter 11 in [CR]), that the induced kQ-module L = kψ↑QA is simple, of\ndimension qm. As k is supposed to be algebraically closed, we have q − 1 distinct primitive q-th\nroots of unity in k and so we get q−1 non isomorphic simple kQ-modules of dimension qm. On the\nother hand, we get the q2m simple kQ-modules of dimension 1 by considering the representations\nρ : Q −→ k∗\nxi 7−→ ωi, 1 ≤ i ≤ m\nyi 7−→ θi, 1 ≤ i ≤ m\nz 7−→ 1,\nwhere ωi and θi, 1 ≤ i ≤ m are q-th roots of unity in k.\nBefore going further, recall that, as kQ is semi-simple, the decomposition map induces a bijec-\ntion between simple kQ- and KQ-modules (see [Se]). In other words, we can lift in characteristic\n0 any simple kQ-module L into a unique simple KQ-module LK (up to isomorphism). It follows\nthat if MK is a simple KQ-module which lifts another simple kQ-module M , then L ∼=M , if and\nonly if LK ∼= MK , if and only if the scalar product (LK ,MK)Q = 1 (otherwise (LK ,MK)Q = 0).\nIn our situation,M is a simple kQ-module of dimension 1, if and only ifM↓Q\nQ′\n∼= k, where k denotes\nthe trivial kQ-module. From the above description of the simple kQ-modules, we can also notice\nthat any kQ-module M of dimension qm is simple, if and only if M↓Q\nQ′\n∼= (kω)qm , where kω is the\nkQ-module of dimension 1 defined by z · λ = ωλ, ∀λ ∈ k, for a primitive q-th root of unity ω\n(otherwise M↓Q\nQ′\n∼= kqm). So we have proved:\nLemma 3.1 Let L and M be two kQ-modules of dimension qm, lifted to the KQ-modules LK\nand MK , respectively. Assume that L is simple. Then, L and M are isomorphic if and only if\n(LK↓QQ′ ,MK↓QQ′)Q′ = q2m.\nThe next question that we are going to discuss handles with extension of modules. Indeed, we\nhave constructed simple kQ-modules, but we are interested in simple kG-modules. In order to get\nsome simple kG-modules, we are going to use Theorem IX.4.1 in [Fe], that proves that our simple\nkQ-modules extend uniquely to kG. Let us recall this statement.\nTheorem 3.2 Let G = QoP a finite p-nilpotent group, where Q is a p′-group and P is a p-Sylow\nsubgroup of G. Let k be a splitting field of G and let L be a simple P -invariant kQ-module i.e.\nuL ∼= L for all u ∈ P . Then there exists a unique simple kG-module L˜, up to isomorphism, such\nthat L˜↓GQ∼= L. Moreover, L˜↓GP is an endo-permutation module.\nProof . See Theorem IX.4.1 in [Fe].\n\u0003\nLet us turn back to the constructed simple kQ-module L. To prove the existence of a unique\nextension L˜ of L, it suffices to verify that L is P -invariant. Let u ∈ P and consider the kQ-modules\nL and uL of dimension qm, withm = 1, if P is cyclic or quaternion, andm = 2, if P is semi-dihedral.\nRecall that uL is a kQ-module for the action of Q given by g ·u⊗ l = u⊗( u−1g · l), ∀ g ∈ Q, ∀ l ∈ L.\n7\nLemma 3.1 tells us that L ∼= uL if and only if ( uLK↓QQ′ , LK↓QQ′)Q′ = q2m. But z acts on L by the\nscalar matrix ω Id, and so does it also on uL, as u and z commute. Thus we have\n( uLK↓QQ′ , LK↓QQ′)Q′ = q−1\nq−1∑\ni=0\nTr(zi, uLK) Tr(z−i, LK) = q−1\nq−1∑\ni=0\n(qmωi)(qmω−i) = q2m.\nWe conclude then that L is P -invariant and extends to a unique (up to isomorphism) simple\nkG-module L˜ of dimension qm. Moreover, as dim(L˜) and p are coprime, L˜ has vertex P .\n4 Source of L˜\nIn this section we are going to determine, up to isomorphism, the sources of the simple modules L˜\nwe constructed in the previous section. We know, by Theorem 30.5 in [Th], that these sources are\nindecomposable endo-permutation modules. Moreover, Theorem 8.39 and Remark 8.41 in [Pu1]\nimply that these sources belong to a subset of the set of torsion endo-permutation modules. But,\nas this latter result is not published, we will not use it in our argumentation. We use the previous\nnotation and set X |Y , if X and Y are two modules such that X is (isomorphic to) a direct\nsummand of Y . We want to find an indecomposable endo-permutation module S, with vertex\nP , satisfying L˜ |S↑GP and S | L˜↓GP= (L˜↓GN)↓NP (by transitivity of restriction), where N = NG(P ).\nIt follows, by uniqueness of the cap of an endo-permutation module, that the module S we are\nlooking for must be a direct summand of the restriction to P of the Green correspondent M of L˜,\ni.e. M is the unique indecomposable direct summand with vertex P of L˜↓GN such that L˜ |M↑GN .\nThe next lemma shows that M↓NP is an indecomposable kP -module, and so M↓NP is the source\nS of L˜.\nLemma 4.1 Let N = A× P be a finite group where A is an abelian p′-group and P is a p-group,\nand let V be an indecomposable kN -module. Then, V ↓NP is indecomposable.\nProof . As A is of order prime to p, the group algebra kA is semi-simple. Thus, we can write\nV ↓NA∼=\n⊕\nSnii , where S\nni\ni denotes the isotypic component of V ↓NA corresponding to the simple\nkA-module Si, for all i. The group P permutes the isotypic components of V ↓NA transitively, since\nV is indecomposable, and trivially, since P centralizes A. Thus V ↓NA∼= Sn for a simple kA-module\nS and an integer n ∈ N. Moreover, we have dimS = 1 because A is abelian and S simple.\nSince V is a kN -module and N = A × P , we have a group homomorphism N −→ Autk(Sn)\ninducing a morphism\nP −→ AutkA(Sn) ∼= GLn(EndkA S) ∼= GLn(k).\nHence, there exists a kP -module W of dimension n, satisfying V ∼= S ⊗W , as kN -modules, for\nthe action of N given by (au) · (s⊗ w) = (a · s)⊗ (u · w), ∀ a ∈ A, ∀u ∈ P, ∀ s ∈ S and ∀w ∈W .\nThen we have V ↓NP∼= W dimS = W and the result follows, because W is indecomposable, since\nV ∼= S ⊗W is.\n\u0003\n8\nConsider the Green correspondent M of L˜ and write\n(∗∗) L˜↓GN |M↑GN↓GN∼=M ⊕\n( ⊕\ng∈[G\/N ], g 6=1\ngM↓ gNgN∩N↑NgN∩N︸ ︷︷ ︸\n(I)\n)\n.\nIt follows from (∗∗) that L˜↓GN is isomorphic to the direct sum of M and of indecomposable direct\nsummands of (I).\n4.1 Cyclic case\nAssume that P is cyclic. In the finite p-nilpotent group G we constructed, P is a trivial inter-\nsection subgroup (see Lemma 2.2). So the direct summands in (I) have trivial vertex, i.e. they\nare projective kG-modules and their dimension is divisible by |P |. We then get from (∗∗) the\ncongruence dim L˜ ≡ dimM (mod |P |). Since dim L˜ = q and since M↓NP∼= S, the choice of q implies\nthat dimS ≡ −1 (mod |P |). As S is indecomposable and Ω1P (k) is the unique indecomposable\nkP -module with dimension congruent to −1 modulo |P |, we must have S ∼= Ω1P (k).\n4.2 Quaternion case\nAssume that P is quaternion. In both finite p-nilpotent groups having P as 2-Sylow subgroup, P\nis a trivial intersection subgroup. So, as in the cyclic case, the direct summand in (I) have trivial\nvertex, i.e. they are projective and their dimension is divisible by |P |. If q ≡ |P | − 1 (mod 2|P |),\nthen the relation (∗∗) implies dimS ≡ −1(mod |P |). If q ≡ |P |2 + 1 (mod |P |), then (∗∗) implies\ndimS ≡ |P |2 + 1 (mod |P |). Let us prove that in both cases S is endo-trivial.\nSet P = <u, v | u2n−1 = 1, u2n−2 = v2, vu = u−1> (so |P | = 2n) and w = u2n−2 for the unique\nelement of P of order 2, i.e. the generator of the center Z of P . Lemma 2.9 in [CaTh] tells us that\nit suffices to prove that S↓PZ is endo-trivial and so we just need to know how w acts on L˜. As the\ncalculations are the same for both congruences of q, we don’t need to distinguish the cases.\nSince − Id is the unique involution of SL2(Fq), it corresponds to the action of w on Q and\nso there exist two integers a and b such that 0 ≤ a, b < q, wx = x−1za and wy = y−1zb. Since\nL = kω↑Q<x,z> for a primitive q-th root of unity ω, we can consider the k-basis {yi ⊗ 1 | 0 ≤ i < q}\nof L˜. Set w · yi ⊗ 1 = ω(i−l)b(y−i−a ⊗ 1), ∀ 0 ≤ i < q, where l is the unique integer with 0 ≤ l < q\nand 2l ≡ −a(mod q). This action extends to Q o <w> by setting (gw) · yi ⊗ 1 = g · (w · yi ⊗ 1),\nfor all g ∈ Q and for all 0 ≤ i < q. This gives L˜ the (unique, by Theorem 3.2) structure of\nQo<w>-module, as it satisfies:\n1 · yi ⊗ 1 = w2 · yi ⊗ 1 = w · ω(i−l)b(y−i−a ⊗ 1) = yi ⊗ 1,\n(wx) · yi ⊗ 1 = (x−1zaw) · yi ⊗ 1 = ω(i−l)b−i(y−i−a ⊗ 1) = w · (x · yi ⊗ 1) and\n(wy) · yi ⊗ 1 = (y−1zbw) · yi ⊗ 1 = ω(i+1−l)b(y−i−1−a ⊗ 1) = w · (y · yi ⊗ 1).\n9\nThe matrix of the action of w is\n(w, L˜) =\n\nωlb\n· · · 0\nω−lb\nω−(l+1)b\n0 · · ·\nω(l+1)b\n ,\nwith a unique non-zero element, equal to 1, on the diagonal, in the (l, l) coordinate, i.e. an\neigenvector for the eigenvalue 1. We also notice that the other columns of the matrix pair to form\nq−1\n2 Z-invariant subspaces Wi = k<y\ni ⊗ 1, y−i−a ⊗ 1>, for all i strictly between l and q−1+2l2 ,\nand on which Z acts freely. As all these subspaces intersect trivially, their sum is direct and form\nthen a kZ-submodule of L˜↓GZ . Counting the dimension, we deduce that L˜↓GZ decomposes as a\ndirect sum k⊕ (kZ) q−1+2l2 and consequently we have S↓PZ∼= k⊕S′, for a free kZ-module S′, by the\nKrull-Schmidt Theorem. Thus S is endo-trivial.\nLet us recall that there are eight indecomposable endo-trivial kP -modules with vertex P (up to\nisomorphism), whose dimensions determine their orders in the Dade group and allow us to recover\ngenerators of T (P ) (see Section 6 in [CaTh]). Indeed, up to isomorphism, two have dimension\n|P | − 1 and order 4: Ω1P (k) and its dual Ω3P (k); one has dimension |P | + 1 and order 2: Ω2P (k)\n(which is self-dual); two have dimension |P |2 +1 and order 2: an “exceptional” indecomposable endo-\ntrivial kP -module V with vertex P and its dual; two have dimension |P |2 − 1 and order 2: Ω1P (V )\nand its dual; and the trivial kP -module, of dimension 1. So, comparing S with the elements in this\nlist we draw the following conclusions. For q ≡ |P | − 1 (mod 2|P |), we have dimS = |P | − 1 and S\nis isomorphic either to Ω1P (k), or to Ω\n3\nP (k), i.e. [S] has order 4 in D(P ). For q ≡ |P |2 +1 (mod |P |),\nwe have dimS = |P |2 + 1 and S is isomorphic either to V , or to its dual and [S] has order 2 in\nD(P ). In particular, we notice that the classes of the two modules realized as sources generate all\nT (P ).\n4.3 Semi-dihedral case\nAssume that P is semi-dihedral, say P = <u, v | u2n−1 = v2 = 1, vu = u2n−2−1> of order 2n, and\nuse the same notation as in section 2. Recall that P is not a trivial intersection subgroup of G, and\nthat the direct summands of (I) have trivial vertex or vertex cyclic of order 2, conjugate to<v>. So,\ntheir dimension is divisible by 2n−1 and the relation (∗∗) implies that dimS ≡ 1(mod |P |2 ). We want\nto prove that S is isomorphic to the endo-trivial kP -module Ω1P\n(\nΩ1P\/<v>(k)\n)\nof dimension |P |2 + 1.\nBy injectivity of restriction and results of section 7 in [CaTh], we must show that Ω2R(k) |S↓PR and\nthat S↓PE is endo-trivial, where R is the maximal quaternion subgroup of P and E is an elementary\nabelian subgroup of P of order 4 (recall that E is unique up to conjugacy).\nFor i = 1 and 2, consider the simple kQi-modules Li of dimension q satisfying Li↓QiQ′∼= (kω)q,\nfor the same primitive root ω appearing in the simple kQ-module L. We assert that the k-vector\nspace X = L1⊗L2 is a kQ-module for the action given as follows: ∀ g ∈ Q, ∃ gi ∈ Qi, i = 1, 2 such\nthat g = g1g2. We set then g · l1 ⊗ l2 = g1 · l1 ⊗ g2 · l2, ∀ l1 ⊗ l2 ∈ X. This action is well defined, as\ng1g2 = h1h2, if and only if there exists 0 ≤ a < q such that g1 = h1za and g2 = h2z−a, and then\n10\nwe have g1g2 · l1⊗ l2 = h1za · l1⊗h2z−a · l2 = ωaω−a(h1 · l1⊗h2 · l2) = h1h2 · l1⊗ l2. Moreover, we\nhave 1 · l1⊗ l2 = l1⊗ l2 and\n(\n(g1g2)(h1h2)\n) · l1⊗ l2 = (g1g2)((h1h2) · l1⊗ l2), ∀ gi, hi ∈ Qi, ∀ i = 1, 2\nand ∀ l1 ⊗ l2 ∈ X.\nLemma 4.2 X is isomorphic to L and consequently X is a simple kQ-module which extends to\nthe kG-module L˜.\nProof . By Lemma 3.1, X ∼= L, if and only if (XK↓QQ′ , LK↓QQ′)Q′ = q4, as X and L have dimension\nq2 and L is simple. We have zi · (l1 ⊗ l2) = (zi · l1)⊗ l2 = ωi(l1 ⊗ l2), ∀ l1 ⊗ l2 ∈ X and it follows\nthen that (XK↓QQ′ , LK↓QQ′)Q′ = (LK↓QQ′ , LK↓QQ′)Q′ = q4.\n\u0003\nLet H = QoR and Hi = Qi oR, i = 1 and 2. By construction, H1 and H2 are isomorphic to\nthe 2-nilpotent group constructed for the quaternion case, with q ≡ |R| − 1(mod 2|R|).\nLemma 4.3 Let L˜i be the extension of the simple kQi-module Li to the 2-nilpotent group Hi, for\ni = 1 and 2. Then L˜1 ⊗ L˜2 is the unique simple kH-module (up to isomorphism) that extends X,\nfor the action of H given by g1g2s · l1⊗ l2 = g1s · l1⊗ g2s · l2, ∀ l1⊗ l2 ∈ L˜1⊗ L˜2, ∀ gi ∈ Qi, i = 1, 2\nand ∀ s ∈ R. Moreover, L˜1 ⊗ L˜2 ∼= L˜↓GH.\nProof . By definition of the external tensor product, L˜1 ⊗ L˜2 is a kQ-module for the action\ncomponentwise of Q (see definition 10.15 in [CR]) and it is also a kR-module for the diagonal action\nof R. So we just need to check that both actions are compatible, i.e. if s ∈ R, gi ∈ Qi, i = 1, 2\nand l1 ⊗ l2 ∈ L˜1 ⊗ L˜2, then (sg1g2) · l1 ⊗ l2 = s · (g1g2 · l1 ⊗ l2). We have:\n(sg1g2) · l1 ⊗ l2 = ( sg1 sg2s) · l1 ⊗ l2 = sg1s · l1 ⊗ sg2s · l2 = sg1 · l1 ⊗ sg2 · l2 = s · (g1 · l1 ⊗ g2 · l2).\nIt follows that L˜↓GH and L˜1 ⊗ L˜2 are extensions of X to H. So they must be isomorphic, by\nTheorem 3.2.\n\u0003\nConsider L˜↓GE, with E = <w, v> and B = {Yij = (yi1 ⊗ 1) ⊗ (yj2 ⊗ 1) | 0 ≤ i, j < q}, as a\nk-basis of L˜. Let us write again a, b and l for the same integers as in the previous subsection,\nthat is 0 ≤ a, b, l < q, wx = x−1za, wy = y−1zb and 2l ≡ −a (mod q). Set v · Yij = Yji,\nw · Yij = ω(i+j+a)bY−i−a,−j−a and extend k-linearly this action to L˜. It is well defined, as we have\nYij = 1 · Yij = v2 · Yij = w2 · Yij and v · w · Yij = ω(i+j+a)bY−j−a,−i−a = w · v · Yij , ∀Yij ∈ B.\nMoreover, if we define gs · Yij = g · (s · Yij), ∀ g ∈ Q, ∀ s ∈ E and ∀Yij ∈ B, then we get a well\ndefined k[QoE]-module, as it can be easily checked that the actions of Q and E are compatible.\nSo, from unicity of extensions, we deduce that we have described the (unique) action of E on L˜.\nLemma 4.4 L˜↓GE is isomorphic to k ⊕\n(\nk[E\/<v>]\n) q−1\n2 ⊕ (k[E\/<vw>]) q−12 ⊕ (kE)( q−12 )2 as KE-\nmodule.\nProof . Consider the following k-subspaces of L˜ ([α] denotes the integer part of the real number α):\nk<Yll>, Wi = k<Yii, ω(2i+a)bYl−i,l−i>, ∀\n[\nl + 1\n2\n]\n≤ i 6= l ≤\n[\nq + l\n2\n]\n,\n11\nW ′i = k<Yl+i,l−i, Yl−i,l+i>, ∀ 0 < i ≤\nq − 1\n2\n, and , ∀ 0 ≤ i, j < q, with δij = δi+j,−a = 0,\nWij = k<Yij , Yji, ω(i+j+a)bY−i−a,−j−a, ω(i+j+a)bY−j−a,−i−a>.\nThere are q−12 distinct subspaces Wi and W\n′\ni , and (\nq−1\n2 )\n2 distinct subspaces Wij . They are all\npermutation kE-submodules of L˜. Indeed, k<Yll> is isomorphic to the trivial kE-module, Wi is\nisomorphic to k<Yii>↑E<v>∼= k[E\/<v>] as kE-module, because v acts trivially on Wi, while w acts\nfreely, and that is true for any integer i such that\n[\nl+1\n2\n]\n≤ i 6= l ≤\n[\nq+l\n2\n]\n. The same argument\nshows that W ′i is isomorphic to k[E\/<vw>] as kE-module, ∀ 0 < i ≤ q−12 . The subspaces Wij\nare free kE-modules of rank 1, as they are isomorphic to k<Yij>↑E1 . Moreover, all these modules\nintersect trivially, as the vectors Yij are linearly independent (over k) and no one appears in two\ndifferent subspaces k<Yll>, Wi, W ′i or Wij . It follows that the kE-submodule they generate is a\ndirect sum and it has dimension 1 + ( q−12 ) · 2 + ( q−12 ) · 2 + ( q−12 )2 · 4 = q2 = dim L˜. So we have\nL˜↓GE ∼= k ⊕\n(\nk[E\/<v>]\n) q−1\n2 ⊕ (k[E\/<vw>]) q−12 ⊕ (kE)( q−12 )2 .\n\u0003\nIn particular, we deduce from this that L˜↓GZ∼= k⊕\n(\nkZ\n)( q2−12 ), as kZ-modules, and so S↓GZ∼= k⊕F ,\nwhere Z = <w> is the center of P and F a free kZ-module.\nLemma 4.5 Let P be a semi-dihedral 2-group, Z be its center and M an indecomposable endo-\npermutation kP -module with vertex P . Suppose that the restriction M ↓PZ is an endo-trivial kZ-\nmodule. Then M is endo-trivial.\nProof . As M is indecomposable with vertex P , Proposition 2.1.2 in [Pu2] implies that M is endo-\ntrivial, if and only if DefNP (Q)NP (Q)\/QRes\nP\nNP (Q)([M ]) = [k], for all non-trivial subgroups Q. If Q is a\nnon-trivial subgroup of P , then either Q contains Z, or Q is conjugate to <v> and its normalizer\nis conjugate to E. In this latter case, NP (Q)\/Q is cyclic of order 2 and D(NP (Q)\/Q) = {[k]}. It\nfollows that DefNP (Q)NP (Q)\/QRes\nP\nNP (Q)([M ]) = [k].\nSuppose that Q contains Z. Then we can decompose the map DefNP (Q)NP (Q)\/QRes\nP\nNP (Q) as the\ncomposition DefNP (Q)\/ZNP (Q)\/QRes\nP\/Z\nNP (Q)\/Z\nDefPP\/Z . By hypothesis, M ↓PZ is isomorphic to k ⊕ F , for a\nfree kZ-module F . Let A = EndkM . Then A is isomorphic to k⊕F ′ as kZ-module, for a free kZ-\nmodule F ′. Thus we have, DefPP\/Z([A]) = [A\nZ\/AZ1 ] = [k] = [Endk k], and so Def\nP\nP\/Z([M ]) = [k]. It\nfollows that DefNP (Q)\/ZNP (Q)\/QRes\nP\/Z\nNP (Q)\/Z\nDefPP\/Z([M ]) = [k] and hence M is endo-trivial. Recall that\nAZ denotes the k-subalgebra of A formed by all fixed points of A under the action (by conjugacy)\nof Z, and AZ1 is the image of the relative trace map A −→ AZ , ϕ 7→ ϕ+ wϕ, ∀ϕ ∈ A.\n\u0003\nLet us apply these results to the indecomposable capped endo-permutation kP -module S. Since\nS↓PZ∼= k⊕F , Lemma 4.5 implies that S is endo-trivial. Moreover, as S↓PE | L˜↓GE, Lemma 4.4 implies\nthat S↓PE∈ [k].\nConsider S↓PR. We can write L˜↓GR∼= (L˜1⊗L˜2)↓HR∼= (L˜1↓H1R )⊗(L˜2↓H2R ), by transitivity of restriction\nand Lemma 4.3. From the previous subsection, we know that L˜i↓HiR has an indecomposable direct\n12\nsummand Si with vertex R, isomorphic to Ω1R(k) or to Ω\n3\nR(k), for i = 1 and 2. We claim that\nS1 ∼= S2. Indeed, consider the isomorphism ϕ from H1 to H2, mapping hs to θ(h)λ(s), ∀h ∈ Q1\nand ∀ s ∈ R. Let Resϕ(L˜2) be the kH1-module obtained by restriction of L˜2 via ϕ, i.e. where g · l\nis defined as the element ϕ(g) · l, the latter “·” denoting the action of H2 on L˜2, for all g ∈ H1 and\nfor all l ∈ Resϕ(L˜2).\nWe have\nTr(zi,Resϕ(L˜2)↓H1Q′ ) = Tr(ϕ(zi), L˜2↓H2Q′ ) = Tr(zi, L˜2↓H2Q′ ) = qωi = Tr(zi, L˜1↓H1Q′ ),\nfor all 0 ≤ i ≤ q − 1 and so (Resϕ(L˜2)↓H1Q′ , L˜1↓H1Q′ )Q′ = q2. Then, Lemma 3.1 and Theorem 3.2\nimply that Resϕ(L˜2) is isomorphic to L˜1, since they both extend L1 to H1.\nHence, we have L˜1↓H1R ∼=\n(\nResϕ(L˜2)\n)↓H1R ∼= Resλ(L˜2↓H2R ), since the restriction of ϕ to R is λ.\nConsider then the commutative diagram of kR-modules (with exact rows)\n0 −→ Ω1R(k) −→ kR −→ k −→ 0\nλ↓ λ↓ Id↓\n0 −→ Ω1R(k) −→ kR −→ k −→ 0\nWe deduce from this that Resλ(Ω1R(k)) ∼= Ω1R(k) and more generally that Resλ(ΩnR(k)) ∼= ΩnR(k) for\nall integers n. Therefore we have Resλ(L˜2↓H2R ) ∼= L˜2↓H2R . In other words, we have L˜1↓H1R ∼= L˜2↓H2R\nand it follows that S1 ∼= S2. Thus Ω2R(k) |S1 ⊗ S2 and so Ω2R(k) | L˜↓GR.\nFinally, S is an endo-trivial kP -module and its restrictions to R and E belong to the classes of\nΩ2R(k) and k respectively. By injectivity of the restriction T (P ) −→ T (R) ⊕ T (E) (see Theorem\n2.8 in [CaTh]), we conclude that S is isomorphic to the indecomposable endo-trivial kP -module\nΩ1P\n(\nΩ1P\/<v>(k)\n)\n, of dimension |P |2 + 1.\n5 Inflation, tensor induction and tensor product\nIn the previous section, we explicitly realized a few examples of endo-permutation modules as\nsources of simple modules for finite p-nilpotent groups. Now, instead of going on with explicit\nexamples, we are going to provide tools that will allow realizations of many other modules.\n5.1 Inflation\nLet P ′ be a normal subgroup of P and write P¯ the quotient P\/P ′. Let M be an indecomposable\nendo-permutation kP¯ -module with vertex P , such that we can explicitly construct a finite p-\nnilpotent group G having P¯ as p-Sylow subgroup and a simple kG-module L with source isomorphic\nto M . We are going to prove that we can explicitly realize InfPP¯ M as source (recall that this is\nan indecomposable endo-permutation kP -module with vertex P , see Proposition 3.17 in [Da1]).\nWrite G = Q o P¯ , where Q is a finite p′-group, and σ : P¯ −→ Aut(Q) the group homomorphism\ncorresponding to the conjugation of elements of Q by elements of P in G. Consider the map\nσ′ : P −→ Aut(Q), u 7→ σ(u¯), ∀u ∈ P . It is a group homomorphism and so defines a finite\np-nilpotent group G′ = Q o P . Moreover, as σ′(u) = IdQ, ∀u ∈ P ′, the subgroup {1} × P ′ is\n13\nnormal in G′ and the quotient is isomorphic to G. Let L′ = InfG\n′\nG L. It is a simple kG\n′-module\nwith vertex P and its source is isomorphic to InfPP¯ M . Indeed, we have by hypothesis M |L↓GP¯ , and\nso InfPP¯ M | InfPP¯ (L↓GP¯ ) ∼= L′↓G′P .\n5.2 Tensor induction\nLet C be a subgroup of P and M an indecomposable endo-permutation kC-module with vertex\nC, such that we can explicitly construct a finite p-nilpotent group G with a p-Sylow subgroup\nisomorphic to C, and a simple kG-module L with source isomorphic to M . Write G = Q o C,\nwhere Q has order prime to p. Suppose moreover that the restriction L↓GQ is a simple kQ-module.\nIn this section, we are going to realize the cap of TenPCM as source of a simple module for a\nfinite p-nilpotent group having P as p-Sylow subgroup. The constructions we are going to do\ninvolve a choice of a set of representatives of the left cosets of P\/C. We can avoid this if we take\nthe functorial point of view of tensor induction, introduced by S. Bouc (see Remark 5.1 below).\nHowever, since we didn’t introduce this formalism before, we prefer to write here a direct proof.\nLet [P\/C] = {v0, . . . , vr} be a set of representatives of the left cosets of P\/C and assume\nv0 = 1. For each 0 ≤ i ≤ r, we formally define a group viQ = { vig | g ∈ Q}, where the composition\nlaw is given by vig vih = vi(gh), ∀ g, h ∈ Q. Let H = ∏ri=0 viQ. We let P act on H as follows.\nLet ( vihi)ri=0 ∈ H and u ∈ P . As left multiplication by u acts by permutation on [P\/C], there\nexists an unique σu ∈ Sr+1 (where Sr+1 acts on {0, . . . , r}), such that uvi = vσu(i)c(u, i) for a\nunique c(u, i) ∈ C, ∀ 0 ≤ i ≤ r. We set then u( vihi)ri=0 =\n(\nvi( c(u,σ\n−1\nu (i))hσ−1u (i))\n)r\ni=0\n. We can then\ncheck directly that 1h = h and that (uu\n′)h = u( u\n′\nh), ∀h ∈ H, ∀u, u′ ∈ P (as σuu′ = σuσu′ and\nc(uu′, i) = c(u, σu′(i))c(u′, i), ∀ 0 ≤ i ≤ r). So we have a p-nilpotent group G′ = H o P , in which\nthe groups viQ, ∀ 0 ≤ i ≤ r are all conjugate. Moreover, for all 0 ≤ i ≤ r, the k[ viQ]-module\nvi(L↓GQ) is simple and so, as k is algebraically closed, the external tensor product L˜ =\n⊗r\ni=0\nvi(L↓GQ)\nis a simple kH-module.\nSet, for all u ∈ P and for all x = ⊗ri=0xi ∈ L˜, u ∗ x =\n⊗r\ni=0\nvi\n(\nc(u, σ−1u (i)) · xσ−1u (i)\n)\n, where\n· denotes the action of G on L. Then, L˜ turns out to be a kP -module if we extend this action\nk-linearly to L˜. Indeed, ∀u, u′ ∈ P and ∀x = ⊗ri=0xi ∈ L˜, we have 1 ∗ x = x et u ∗ (u′ ∗ x) =\n= u∗\n(\nr⊗\ni=0\nvi\n(\nc(u′, σ−1u′ (i)) · xσ−1\nu′ (i)\n))\n=\nr⊗\ni=0\nvi\n(\nc(u, σ−1u (i))·\n(\nc(u′, σ−1u′ (σ\n−1\nu (i))) · xσ−1\nu′ (σ\n−1\nu (i))\n))\n=\n=\nr⊗\ni=0\nvi\n((\nc(u, σ−1u (i))c(u\n′, σ−1u′ (σ\n−1\nu (i)))\n)\n· xσ−1\nu′ (σ\n−1\nu (i))\n)\n=\nr⊗\ni=0\nvi\n(\nc(uu′, σ−1uu′(i)) · xσ−1\nuu′ (i)\n)\n=\n= (uu′) ∗ x.\nThen, if we set (hu) ∗ x = h · (u ∗ x), ∀h ∈ H, ∀u ∈ P and ∀x ∈ L˜, the actions of P and H are\ncompatible, and so L˜ becomes a kG′-module. Indeed, ∀h ∈ H, ∀u ∈ P and ∀x ∈ L˜, we have:\n(uh) ∗ x =\nr⊗\ni=0\nvi\n(\nc(u,σ−1u (i))hσ−1u (i)\n) · (u ∗ x) = r⊗\ni=0\nvi\n(\nc(u,σ−1u (i))hσ−1u (i) ·\n(\nc(u, σ−1u (i)) · xσ−1u (i)\n))\n=\n14\n=\nr⊗\ni=0\nvi\n(\nc(u, σ−1u (i))hσ−1u (i) · xσ−1u (i)\n)\n= u ∗ (h · x).\nMoreover, we have L˜↓G′P ∼= TenPC(L↓GC), as they are isomorphic as k-vector spaces (of dimension\n(dimL)r+1) and as the action of P on the generators coincides on both modules. As the k[ viC]-\nmodule viM is a direct summand of vi(L↓GC), for all 0 ≤ i ≤ r, it follows that TenPCM | TenPC(L↓GC)\nas kP -modules and so the source of L˜ is isomorphic to the cap of TenPCM .\nRemark 5.1 If we consider the functorial point of view of tensor induction introduced by S. Bouc\nin [Bo], then we do not need to choose a set of representatives of the left cosets of P\/C. Indeed, the\ngroup H we defined above is isomorphic to the group HomC(P,Q) of C-equivariant maps from P\nto Q, where we consider P and Q as left C-sets for the left multiplication inside P and respectively\nfor the action of C on Q (i.e. conjugation inside G).\nSimilarly, the kH-module L˜ is isomorphic to a quotient of kHomC(P, {L}), where {L} denotes\nthe underlying C-set of L (in the notations of [Bo], we have L˜ ∼= tP (L)). Then, applying Lemma 9.9\nand Remark 9.10 of [Bo], we get the same result we proved above (namely, that L˜ is a simple kG′-\nmodule and its source is isomorphic to the cap of TenPC L) and this proof does not involve any\nchoice of representatives.\nRemark 5.2 Let G = QoC be a finite p-nilpotent group, with Q having order prime to p, and C\na p-group, and let L be a simple kG-module. We can drop the additional hypothesis we made above,\nnamely that L↓GQ is a simple kQ-module, if we modify the construction of L˜ as follows. If S is a\nsimple kQ-module belonging to a block e of kQ and I = {g ∈ G | gS ∼= S} is the inertial subgroup\nof S, then, by Clifford theory, we know that S can be extended to a simple kI-module S˜ (which\nbelongs to the block e of kI). Moreover, the relative trace from I to G sends e on a block b of kG\nand the k-algebras kIe and kGb are Morita equivalent. This equivalence lets S˜ correspond to the\nsimple kG-module IndGI (S˜). It follows that, if L is a simple kG-module, then its restriction to kQ\nis not a simple module, in general. However, L↓GQ is a finite direct sum ⊕ri=0 viS of conjugate simple\nmodules (we can assume that v0 = 1), having conjugate inertial subgroups Ii, which are strictly\ncontained in G. We also know that L ∼= IndGI0 S˜ and so, in this situation, instead of constructing\nthe simple kG′-module L˜ using L↓GQ, we consider the simple kQ-module S. Notice, however, that\nin every situation we realized until now, the additional hypothesis we make here was fulfilled.\n5.3 Tensor product\nLet C be a family of indexes (e.g. C is a set of conjugacy classes of non-trivial cyclic subgroups of\nP ). Suppose that for each C ∈ C there is an indecomposable endo-permutation kP -module MC\nwith vertex P , such that we can explicitly construct a p-nilpotent group GC = QC o P (QC of\norder prime to p) and a simple kGC-module LC with source isomorphic to MC . We prove the\nfollowing result.\nTheorem 5.3 If LC↓GCQC is a simple kQC-module, ∀C ∈ C, then there exists a p-nilpotent group\nG and a simple kG-module L˜ with source isomorphic to the cap of ⊗C∈CMC .\n15\nProof . Let G =\n(∏\nC∈C QC\n)\no P , where P acts diagonally on\n∏\nC∈C QC , i.e.\nu(hC)C∈C = ( uhC)C∈C , ∀u ∈ P, ∀(hC)C∈C ∈\n∏\nC∈C\nQC .\nThis is a well defined semi-direct product, as P ∩ (∏C∈C QC) = {1}, 1(hC)C∈C = (hC)C∈C\nand (uu\n′)(hC)C∈C = ( (uu\n′)hC)C∈C = ( u( u\n′\nhC))C∈C = u( u\n′\n(hC)C∈C), ∀u, u′ ∈ P and ∀(hC)C∈C ∈∏\nC∈C QC . The external tensor product (over k) L =\n⊗\nC∈C(LC ↓GCQC ) is a simple k[\n∏\nC∈C QC ]-\nmodule, as k is algebraically closed. Moreover, we can extend L to a simple kG-module L˜, by\nletting P act diagonally: u · ⊗C∈ClC = ⊗C∈Cu · lC , and setting then\n(\n(hC)C∈Cu\n) · ⊗C∈ClC =\n(hC)C∈C ·\n(\nu · ⊗C∈ClC\n)\n, ∀u ∈ P, ∀ (hC)C∈C ∈\n∏\nC∈C QC and ∀ ⊗C∈C lC ∈ L˜, where · denotes the\naction of P on the kGC-module LC , ∀C ∈ C. Next calculation shows that the actions of P and∏\nC∈C QC are compatible:(\nu(hC)C∈C\n)·⊗C∈ClC= ( uhC)·u·⊗C∈ClC = ⊗C∈Cu·hC ·lC = u·⊗C∈ChC ·lC = u·(hC)C∈C ·⊗C∈ClC .\nSo we get a finite p-nilpotent group G, with P as p-Sylow subgroup and a simple kG-module L˜,\nwith vertex P , because the dimension of each LC , and thus the dimension of L˜, is prime to p.\nBy hypothesis, MC is a direct summand of LC↓GCP , ∀C ∈ C. It follows that\n⊗\nC∈CMC is a direct\nsummand of\n⊗\nC∈C(LC↓GCP ), which is clearly isomorphic to L˜↓GP as kP -module. Hence, the source\nof the simple kG-module L˜ is isomorphic to the cap of ⊗C∈CMC .\n\u0003\nLet us apply this to the following two examples.\nCorollary 5.4 Let p = 2 and P be a quaternion 2-group. Then every indecomposable torsion endo-\npermutation kP -module with vertex P can be explicitly realized as source of a simple kG-module\nfor a finite 2-nilpotent group G having P as 2-Sylow subgroup.\nProof . It follows by [CaTh] that every indecomposable torsion endo-permutation module belongs\nto the class of an endo-trivial module. More precisely, we have T t(P ) ∼= Z\/4Z×Z\/2Z, where Z\/4Z\nis generated by the class of a module of dimension |P |−1 and Z\/2Z by the class of an “exceptional”\nendo-trivial module, of dimension |P |2 + 1. Thus, as we noticed in section 4, the classes of the two\nmodules we realized in section 3 generate the whole torsion subgroup Dt(P ) of D(P ) and so, by\nTheorem 5.3, every indecomposable torsion endo-permutation kP -module with vertex P can be\nexplicitly realized (up to isomorphism).\n\u0003\nCorollary 5.5 Let p be an odd prime and P a metacyclic p-group. Then every indecomposable\ntorsion endo-permutation kP -module with vertex P can be explicitly realized as source of a simple\nkG-module for a finite p-nilpotent group G having P as p-Sylow subgroup.\nProof . By the main theorem of [Ma], the set {[TenPC InfCC\/Φ(C) Ω1C\/Φ(C)(k)], C ∈ C} , where C is\nthe set of conjugacy classes of non-trivial cyclic subgroups of P , forms a basis of the F2-vector\nspace Dt(P ) (all torsion elements have order 2). In other words, every indecomposable torsion\n16\nendo-permutation kP -module with vertex P is isomorphic to a direct summand of a kP -module\nof the form ⊗C∈C′ TeninfPC\/Φ(C) Ω1C\/Φ(C)(k), where C′ ⊆ C. In section 3, we realized explicitly\nΩ1C\/Φ(C)(k) as source, as C\/Φ(C) is cyclic of order p. Thus, by subsections 5.1 and 5.2, we can do\nthe same for the cap of each TeninfPC\/Φ(C) Ω\n1\nC\/Φ(C)(k), where C ∈ C, and this construction satisfies\nthe hypothesis of Theorem 5.3. It follows that every indecomposable torsion endo-permutation\nkP -module with vertex P can be explicitly realized as source.\n\u0003\n6 Conclusion\nIf we sum up the results we obtained in the previous sections, then we come to the following\nconclusion.\nTheorem 6.1 Let p be a prime, P a finite p-group and k an algebraically closed field of character-\nistic p. Then the cap of any kP -module of the form\n⊗\n(Q\/R)∈S Ten\nP\nQ Inf\nQ\nQ\/R(MQ\/R), where MQ\/R\nis an indecomposable torsion endo-trivial module with vertex Q\/R, and S is a set of sections of\nP that are cyclic, or also quaternion or semi-dihedral, in case p = 2, can be explicitly realized as\nsource of a simple module with vertex P for some finite p-nilpotent group.\nProof . By section 5, if we know how to realize explicitlyMQ\/R, ∀Q\/R ∈ S, then we are able to\nrealize the cap of a tensor product\n⊗\nQ\/R∈S Ten\nP\nQ Inf\nQ\nQ\/R(MQ\/R). Thus, it is enough to check that\nwe have an explicit realization for any indecomposable torsion endo-trivial module with vertex P ,\nfor a finite cyclic, quaternion or semi-dihedral p-group P . And, in fact, we just need to consider\na set of modules whose classes generate the torsion subgroup T t(P ) of T (P ), as tensor product\ncorresponds to linear combination in D(P ). If P is cyclic, then T t(P ) is generated by the class of\nΩ1P (k), that we realized as our first example. If p = 2 and P is quaternion, then the statement is\nproved in Corollary 5.4. Finally, if p = 2 and P is semi-dihedral, then, T t(P ) is cyclic of order 2,\ngenerated by the class of the module we realized explicitly in the semi-dihedral example. So the\nstatement is proved.\n\u0003\nLet us now take into account Theorem 8.39 and Remark 8.41 in [Pu1]. We can sum up them\ninto the following statement: let p be a prime, k an algebraically closed field with characteristic\np and G a finite p-solvable group having a p-Sylow subgroup P and a simple kG-module L with\nvertex P . Then, the source of L is the cap of a module of the shape\n⊗\nQ\/R∈S Ten\nP\nQ Inf\nQ\nQ\/R(MQ\/R),\nwhere the set S and the modules MQ\/R are as in Theorem 6.1. Hence, the following corollary is\nstraightforward.\nCorollary 6.2 Let p be a prime, P a finite p-group and k an algebraically closed field of charac-\nteristic p. Then any indecomposable endo-permutation kP -module M with vertex P that can be a\nsource of a simple module with vertex P for a finite p-solvable group can be explicitly realized as\nsource for a finite p-nilpotent group.\n17\nFinally, we would like to come back to the last remark of the introduction to draw the main\nconsequence of our theorem, in case both following conjectures hold, namely that, if the source of\na simple module is an endo-permutation module, then its class should be a torsion element in the\nDade group, and that there are no other indecomposable torsion endo-permutation modules as the\nones that are isomorphic to the cap of a module of the form\n⊗\nQ\/R∈S Ten\nP\nQ Inf\nQ\nQ\/R(MQ\/R), as in\nour main theorem. Following Jon Carlson’s recent result, this latter conjecture holds for p odd and\nso, if the first conjecture is also true, then we would have proved that any torsion endo-permutation\nmodule is the source of a simple module and it can be explicitly realized as it for a finite p-nilpotent\ngroup (p odd).\nReferences\n[Bo] S. Bouc, Non-Additive Exact Functors and Tensor Induction for Mackey Functors, AMS\nMemoirs 683, vol. 144 (2000), 275–349.\n[BoTh] S. Bouc, J. The´venaz, The group of endo-permutation modules, Invent. math. 139 (2000),\n275–349.\n[CaTh] J. Carlson, J. The´venaz, Torsion endo-trivial modules, Algebr. Represent. Theory 3 (2000),\n303–335.\n[CR] C. W. Curtis, I. Reiner, Methods of representation theory with applications to finite groups\nand orders I, Pure and applied mathematics, John Wiley and Sons, 1981.\n[Da1] E. C. Dade, Endo-permutation modules over p-groups, I, II, Ann. Math. 107 (1978), 459–\n494, 108 (1978), 317–346.\n[Da2] E. C. Dade, Blocks with cyclic defect groups I, Ann. Math. 84 (1966), 20-48.\n[DH] K. Doerk, T. Hawkes, Finite solvable groups, Walter de Gruyter, 1992.\n[Fe] W. Feit, The Representation Theory of Finite groups, North Holland Publishing Company,\n1982.\n[Go] D. Gorenstein, Finite groups, Harper and Row, 1968.\n[Hu] B. Huppert, Character theory of finite groups, Walter de Gruyter, 1998.\n[Is] I. M. Isaacs, Character theory of finite groups, Acad. Press, 1976.\n[Ma] N. Mazza, The Dade group of a metacyclic p-group, J. Algebra, to appear.\n[Pu1] L. Puig, Notes sur les p-alge`bres de Dade, Preprint, 1988.\n[Pu2] L. Puig, Affirmative answer to a question of Feit, J. Algebra 131 (1990), 513–526.\n[Se] J.-P. Serre, Repre´sentation line´aires des groupes finis, Hermann, 1978.\n[Th] J. The´venaz, G-algebras and modular representation theory, Oxford, 1995.\n18\n"}