{"doi":"10.1080\/0968776990070103","coreId":"14286","oai":"oai:generic.eprints.org:287\/core5","identifiers":["oai:generic.eprints.org:287\/core5","10.1080\/0968776990070103"],"title":"Evaluating EuroMET ‐ a Web‐based resource for meteorologists","authors":["Phelps, Julia","Reynolds, Ross"],"enrichments":{"references":[{"id":199550,"title":"CAL evaluation: what questions are being answered? A response to the article &quot;Integrative evaluation&quot; by Draper et aV,","authors":[],"date":"1996","doi":"10.1016\/s0360-1315(96)00028-0","raw":"Gunn, C. (1996), 'CAL evaluation: what questions are being answered? A response to the article &quot;Integrative evaluation&quot; by Draper et aV, Computers and Education, 27, 157-60.","cites":null},{"id":199548,"title":"Evaluation in a project life-cycle',","authors":[],"date":"1996","doi":"10.3402\/rlt.v4i3.9979","raw":"Chanier, T. (1996), 'Evaluation in a project life-cycle', ALT-J, 4 (3), 54-68. Draper, S., Brown, M. I., Henderson, F. P. and McAteer, E. (1996), 'Integrative evaluation: an emerging role for classroom studies of CAL', Computers and Education, 26, 17-32.","cites":null},{"id":199551,"title":"Formative evaluation of a Web-based course in meteorology',","authors":[],"date":"1999","doi":"10.1016\/s0360-1315(98)00064-5","raw":"Phelps, J. and Reynolds, R. (1999), 'Formative evaluation of a Web-based course in meteorology', Computers and Education, 32(2), 181-93.","cites":null},{"id":199549,"title":"Prospects for summative evaluation of CAL in higher education',","authors":[],"date":"1997","doi":"10.1080\/0968776970050106","raw":"Draper, S. (1997), 'Prospects for summative evaluation of CAL in higher education', ALT-J, 5 (1), 33-9.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1999","abstract":"Euro MET has been created to address the education and training needs of professional meteorologists and students in tertiary education throughout Europe and beyond Two module libraries have been developed for the WWW which are available in English, French, Spanish and German. The modules have been evaluated during their development and after completion. All the project partners used them in courses and training programmes within their institutions. This paper describes the formative and sum‐mative evaluation strategies used and some of the results obtained The efficacy of the evaluation approach adopted with respect to the size of the project is also discusse","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14286.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/287\/1\/ALT_J_Vol7_No1_1999_Evaluating_EuroMET_%E2%80%90_a_Web%E2%80%90bas.pdf","pdfHashValue":"18b6d41f89ea9bfec45743dfa7883e48ab12dcf0","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:287<\/identifier><datestamp>\n      2011-04-04T09:18:05Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/287\/<\/dc:relation><dc:title>\n        Evaluating EuroMET ‐ a Web‐based resource for meteorologists<\/dc:title><dc:creator>\n        Phelps, Julia<\/dc:creator><dc:creator>\n        Reynolds, Ross<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        Euro MET has been created to address the education and training needs of professional meteorologists and students in tertiary education throughout Europe and beyond Two module libraries have been developed for the WWW which are available in English, French, Spanish and German. The modules have been evaluated during their development and after completion. All the project partners used them in courses and training programmes within their institutions. This paper describes the formative and sum‐mative evaluation strategies used and some of the results obtained The efficacy of the evaluation approach adopted with respect to the size of the project is also discussed<\/dc:description><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        1999<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/287\/1\/ALT_J_Vol7_No1_1999_Evaluating_EuroMET_%E2%80%90_a_Web%E2%80%90bas.pdf<\/dc:identifier><dc:identifier>\n          Phelps, Julia and Reynolds, Ross  (1999) Evaluating EuroMET ‐ a Web‐based resource for meteorologists.  Association for Learning Technology Journal, 7 (1).  pp. 12-18.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776990070103<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/287\/","10.1080\/0968776990070103"],"year":1999,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Evaluating EuroMET - a Web-based resource\nfor meteorologists\nJulia Phelps and Ross Reynolds\nUniversity of Reading, email: j.phelps@unl.ac.uk\nEuro MET has been created to address the education and training needs of professional\nmeteorologists and students in tertiary education throughout Europe and beyond Two\nmodule libraries have been developed for the WWW which are available in English,\nFrench, Spanish and German. The modules have been evaluated during their develop-\nment and after completion. All the project partners used them in courses and training\nprogrammes within their institutions. This paper describes the formative and sum-\nmative evaluation strategies used and some of the results obtained The efficacy\nof the evaluation approach adopted with respect to the size of the project is also\ndiscussed\nIntroduction\nThe education and training of meteorologists varies widely across Europe. General\nmeteorology is taught in many universities, typically as part of other courses, for example,\ngeography, while comprehensive courses in meteorology are taught in specialist\ndepartments at both undergraduate and postgraduate level. Due to the relatively small\nnumber of universities teaching meteorology at sufficiently advanced levels (approximately\n5 per cent of all universities Europe-wide), National Meteorological Services (NMS)\nusually recruit employees at university science degree level and then offer training as is\nnecessary. Another part of NMS education programmes is extension training, required to\nkeep all employees up to date with the latest developments in meteorological science. NMS\ntraining varies from employees attending intensive courses running over several weeks,\nwhich can be very similar to a university module, to much less formal 'on-the-job' training.\nRegardless of the training offered, NMS, unlike universities, do not formally examine or\nassess their trainees. At present no distance- or open-learning courses in meteorology exist\nwithin Europe.\nComputer-based learning resources could therefore be extremely useful within the\nEuropean meteorological community. They could offer an alternative to those NMS with\nlittle or no training programmes of their own and enable NMS training centres and\n12\nALT-] Volume 7 Number I\nuniversities to share their educational material. Meteorology is also a subject that could\nbenefit from being taught in a Computer Aided Learning (CAL) environment. Much\nmeteorology concerns descriptions of atmospheric phenomena in three dimensions that\nvary in time, usually presented as complex mathematical equations. A CAL package offers\nthe opportunity to visualize these descriptions as animations or models and simulations\nthat can be explored and experimented with. The European Meteorological Education and\nTraining (EuroMET) project therefore aims to address the education and training\nrequirements of professional meteorologists and students in tertiary education through-\nout Europe by establishing a multimedia, networked-based, open and distance-learning\nservice.\nThe EuroMET consortium\nEuroMET is an EC-funded initiative with matched funding from the participating NMS.\nThe consortium is comprised of twenty-two partners from fourteen European countries\nand the University of Quebec in Canada, divided into two groups, the developers who are\nresponsible for producing the modules, and the evaluators who are responsible for\nassessing them. The developers are led by Met6o France (where the project co-ordinator is\nalso based) and the University of Edinburgh. The evaluation is lead by EUMETSAT (the\nEuropean Organization for the Exploitation of Meteorological Satellites) and the\nUniversity of Reading. The thirty-month project commenced in June 1996 and is split into\nthree key stages: the prototyping of minimal content modules, the development and\nevaluation of full versions of the modules, and finally, the implementation and evaluation\nof the modules into their teaching\/training programmes by all partners.\nThe module libraries\nTwo module libraries have been developed; the subjects for which were selected in response\nto a European-wide needs analysis of the NMS. The two chosen were Numerical Weather\nPrediction and Satellite Meteorology. Both libraries are divided into nine chapters covering\ndifferent sub-topics and contain around 70 modules each. Each module takes an average of\n30-40 minutes to complete. The modular approach allows teachers at different locations to\nchoose those modules that are directly relevant to the course they teach.\nA common interface was developed so that all modules would look and feel the same. The\ninterface was designed to be as simple as possible so that users could learn to use it as they\nwent along. An online help facility is also available which explains all navigation buttons,\nsymbols and icons used. The interface is language-independent, an important considera-\ntion for a multilingual project. Each module is constructed with an opening motivation\npage to introduce the topic and engage the user's interest. The next page lists the module's\nlearning objectives, any pre-requisite modules the user should study first, any subsequent\nmodules that follow on, and a list of the module's contents^ The following pages contain\nthe teaching material, whilst the final page contains a summary of the material, drawing\nout the salient points of the topic. Users navigate through the modules by clicking on\narrows on a button bar at the bottom of the screen, to progress page by page, forwards or\nbackwards, or they can click on the 'module structure' button to go directly to any page of\ntheir choice. A 'course structure' button similarly allows the user to select any module.\n'. 13\nJulia Phelps and Boss Reynolds Evaluating EuroMET - a Web-based resource for meteorologists\nThis learning environment is supported by a glossary and keyword index, enabling the user\nto find easily those modules that contain material covering a term selected from the index.\nCommunication facilities are also included, such as email to subject experts, two discussion\ngroups and a chat area. Due to the number and variety of users, EuroMET is designed to\nbe as flexible as possible with tools to create adapted packages and extra material. This\ntool-kit allows teachers to create their own online course from the EuroMET modules\ncompletely tailored for their needs. This addresses the concerns of Draper et al. (1996) that\n'designers of CAL frequently do not design in detail the teaching within which its use will\nbe embedded, that teachers make many local adaptations just as they do for all other\nteaching, and that even if designers did prescribe their use many teachers would still\nmodify that use just as they do that of text-books' (p. 26).\nEvaluation methodology\nFormative evaluation\nThe EuroMET evaluation strategy was planned and executed by all the evaluation partners\nwith advice from staff at the Institute of Educational Technology, the Open University and\nthe National Physical Laboratory Usability Services (NPLUS). The modules were released\nonto the Web at three points during their development for evaluation. The evaluation team\ncould therefore assess the first set of modules while the developers worked on the\nproduction of the second set. Enough time was incorporated before the second release date\nfor the developers to act on the evaluators' report, so that both sets of modules could be\nmodified to include the recommendations made. This was then repeated for the second and\nthird module releases. In this way the modifications could be tested by the evaluation team,\nresulting in an iterative approach to the development work. The modules were evaluated at\neach institute by a number of users ranging from novices to subject-matter experts.\nBetween 100 and 200 users evaluated modules in each phase. The aim of the formative\nevaluation was to assess the modules' ease of use, pedagogy (including ensuring scientific\nintegrity) and possible utility in replacing conventional teaching. These issues were\naddressed in two questionnaires that were completed after using each module. One\nquestionnaire addressed the broader issues of functionality and ease of use, while the other\nwas directed towards the actual content of the module. The questionnaires consisted of\nyes\/no and agreement scale questions, with comment areas in which subjects were\nencouraged to expand on their answers and make suggestions to the developers.\nResults from the formative evaluation\nResults from the questionnaires indicated that the modules were well-presented and easy to\nuse. An observed session with a group of new users demonstrated that it took them only\nabout ten minutes to become familiar with the navigation tools, despite not having seen the\nmodules before or having received any instruction in their use. Regarding the module\ncontent, the vast majority of users preferred those modules.that used as much interactive\nand visual material as possible to explain a subject and which also had as little text as\npracticable. A comment users frequently made was that they would rather read large\namounts of text from a book than a computer screen. The evaluators therefore\nrecommended that where textbooks were available to explain material in-depth, developers\nshould attempt to produce highly visual and interactive modules.\n14\nALT-J Volume 7 Number I\nA problem with the early modules was that of navigation; many users disliked the\nexploratory layout some modules adopted. Users often made comments that they felt 'lost'\nin these modules and were unsure if they had accessed all the material; one of the\nevaluators termed this type of module structure as 'spaghetti navigation'. In the light of\nthese comments it was decided that all module navigation should be much more linear and\nthat the user should be guided through the module.\nThe formative evaluation was extremely useful in producing modules that were suitable for\ntheir target users. As the evaluation was embedded into the development work it was easy\nfor the developers to modify the modules according to the evaluators' recommendations\nand in turn for these modifications to be tested during the next evaluation phase. A marked\nimprovement in the quality of the modules from the first to the third evaluation phase was\nseen. The evaluation also resulted in a more homogeneous feel to the modules. Although a\ncommon graphical interface had been developed there were still significant differences\nbetween modules. For example, no universally accepted standard notation exists in\nmeteorology to describe various physical quantities, so different developers often used\ndifferent symbols, and sometimes units, for the same term which can be confusing,\nparticularly for someone new to meteorology. The evaluation helped to ensure that in the\nabsence of any standard notation, at least that used in the modules was consistent through-\nout the EuroMET libraries. The formative evaluation has been discussed in more detail\nelsewhere - see Phelps and Reynolds (1999).\nSummative evaluation\nUnlike formative evaluation, summative evaluation is carried out after the design and\ndevelopment work is complete. The purpose of the summative evaluation is to measure a\nCAL package's effectiveness with regard to its stated aims and to assess its appropriateness\nfor certain tasks and users. It therefore has to be undertaken in real learning settings and\ninvolve a larger number of subjects than formative evaluation (Chanier, 1996). Therefore,\nthe modules have been used by all the project partners on courses at their institutions over\na twelve-month period ending in October 1998. These uses include classroom demonstra-\ntions using the modules to illustrate a particular concept, full lecture replacement, using\nthe modules as an electronic reference and independent study programmes for individual\nusers. A range of evaluation methods is being employed to investigate these different uses\nand the effectiveness of the modules. To complement these evaluation tools, an evaluation\nsite has been developed where the tools can be accessed, results from other partners'\ncourses viewed and information on CAL implementation and evaluation strategies can be\nfound. Although it is extremely difficult to isolate the effects of CAL from other learning\nresources (Draper et ah, 1996; Gunn, 1996), it is hoped that by collecting a range .of data\nfrom different learning environments it will be possible to ascertain whether EuroMET\nprovides a useful and effective learning tool and to give us guidelines on how best to\nintegrate it into both university and workplace settings. The evaluation methods used are\nnow discussed individually in the context of the project.\nQuestionnaires\nTwo Web-based questionnaires were devised for users and teachers to complete after using\nthe EuroMET modules. The questionnaires were designed to gather information on the\nusers' background, how the modules were used for study, what technical and aca-\ndemic support was given, impressions of the course and so on. Results were collated\n15\nJulia Phefps and Ross Reynolds Evaluating EuroMET - a Web-based resource for meteorologists\nautomatically to gain an overview of each course and individual submissions were stored\nin a database for more detailed analysis.\nWeb-tracking\nJavascript has been embedded into each EuroMET page. Each time a page is accessed,\nwhether from the memory cache of the user's browser or either of the two EuroMET\nservers, the Javascript calls a CGI script on the server in Edinburgh. The CGI script then\nproduces a tracking log recording such details as the host machine accessing EuroMET,\nthe browser type and version, the date and time of access and the URL of the current and\nprevious pages accessed in the browser session. This results in the collection of valuable\ndata such as when and where users access modules, which modules they look at, which\npages in those modules they access, how long they spend on each page, which language\nversion they access, and so on.\nInterviews and observation\nInterviewing students and observing their interactions with the modules is a good way to\nobtain information that has not been taken into consideration when designing\nquestionnaires. Open-ended discussion allows an evaluator to follow up comments made\nby students in order to understand fully what has taken place during a CAL session.\nAssessment of users' knowledge\nTo investigate the pedagogical effectiveness of the modules, teachers have been encouraged\nto assess their students' learning from the EuroMET modules. Such assessments may be an\nend-of-year examination question, a forecasting exercise, or a presentation on a module\nsubject to the user's peers.\nResults of the summative evaluation\nSo far results have been obtained from 14 courses in 11 different institutions and results\nfrom a minimum of 12 more courses are expected in the final months of the project. These\npreliminary results reveal that the course has been widely used in a number of settings and\nby a range of learners. The modules have been used as extra material to accompany a\nlecture course, as material to replace a lecture, and for independent study by individuals.\nThe data collected so far have shown that these three types of users have similar previous\ncomputing experience and that they all give EuroMET a comparable overall rating. It is\nalso worth noting that all users received similar levels of supervision, both academic and\ntechnical.\nThe independent learners were all experienced forecasters aged between 35 and 45 years\nold. They were more positive about the learning benefits of EuroMET than the other two\ngroups, as illustrated in Figures 1 and 2. Those who used the modules as extra material\naccompanying lectures were all students, ranging in age from under 25 to 45 years old and\neither in their fourth year or above, or higher-degree students. Although generally positive\nabout their learning experience, they were less likely to think that using the modules had\nimproved their skills\/knowledge (Figure 1) than the independent learners. This is not\nsurprising as generally these users were using the modules after a lecture to consolidate\nwhat had already been learnt rather than learning something completely new. Interestingly\nthough, most of these users found that the modules helped them to visualize the material\naddressed (Figure 2). The third group, those users who had used the modules as a\nreplacement to their lectures, showed a more mixed reaction to the modules.\n16\nFigure I: Users'responses\nwhen asked to what extent\nthey agreed with the\nstatements 'the modules\nhelp you to learn'and 'the\nmodules have improved my\nprofessional\nskills\/knowledge'.\nthe modules help you leam\n100\n« 80\n| 60-\n\"5 40-\n^ 20 •\n0 I—I\nj • independent study\n• •extra material\nI OSedure replacement I\ndisagree disagree neutral\nStrongly\nagree agree\nstrongly\nthe modules have improved my professional\nskills\/knowledge\n100\n80\n60\n40\n20\n0\nindependent study\nI n extra material\nI n lecture replacement\ndisagree disagree neutral\nstrongly\nagree agree\nstrongly\nfigure 2: Users'responses\nwhen asked to what extent\nthey agreed with the\nstatements 'the modules are\nworth the time spent'and\n'the modules helped me\nvisualize the material and\nconcepts they addressed'.\nthey are worth the time spent\n100\n80\n60\n40-\n20-\n0 iTLtl\n• independent study\n•extra material\n; D lecture replacement\ndisagree disagree neutral\nstrongly\nagree agree\nstrongly\nthe modules helped me visualise the material and\nconcepts they addressed\n100\n80\n60-\n40\n20 •\n0\nj • independent study \\\ni n extra material I\n\\ • lecture replacement j\ndisagree disagree neutral\nstrongly . agree\nagree\nstrongly\nJulia Phelps and Ross Reynolds Evaluating EuroMET - a Web-based resource for meteorologists\nBy dividing the lecture replacement group into their respective courses a clearer pattern\nemerged. Three courses fell into this category, two received positive feedback, while the\nthird provoked more negative responses. It was initially difficult to see why this might be so\nas one of the positively received courses was taught in the same institution in the same\nmanner (during compulsory, timetabled computer sessions) as the negatively received one,\nthough with a different set of students. However, on examining both sets of students'\ncomments, it was seen that the modules used in the second course were found by most\nstudents to be 'a bit heavy going'. These modules had yet to be re-engineered and so were\nstill very text-based and would have benefited from the addition of more figures and\ninteractive elements. This result highlights the importance of the work done in the\nformative evaluation and illustrates that in this case it was not the implementation strategy\nthat caused the disparity in users' opinions, but the quality of the modules studied.\nThe evaluation has shown that EuroMET has been successfully used on a number of\ndifferent courses and in several different settings. The results also demonstrate the efficacy\nof the evaluation methods adopted. The formative evaluation resulted in modules that\nwere easier to use and of higher quality. The evaluation Web site and online questionnaires\ndeveloped for the summative evaluation have also been extremely useful. In order to be\nable to use the questionnaires correctly, partners had to register their course details on the\nevaluation site. Therefore, it was not only straightforward to collect valuable data from the\nquestionnaires but also to monitor when each partner was running a course and when they\nshould submit their completed questionnaires, an important consideration on such a large\nproject.\nAcknowledgements\nThe authors would like to acknowledge the Telematics division of the European Union\nand the participating Weather Services who have funded this project. Many thanks also go\nto all the EuroMET consortium members for all their hard work in producing and testing\nthe course. A demonstration of the EuroMET modules can be found at http:\/\/www.\neuromet.met.ed.ac.uk\/.\nReferences\nChanier, T. (1996), 'Evaluation in a project life-cycle', ALT-J, 4 (3), 54-68.\nDraper, S., Brown, M. I., Henderson, F. P. and McAteer, E. (1996), 'Integrative evaluation:\nan emerging role for classroom studies of CAL', Computers and Education, 26, 17-32.\nDraper, S. (1997), 'Prospects for summative evaluation of CAL in higher education',\nALT-J, 5 (1), 33-9.\nGunn, C. (1996), 'CAL evaluation: what questions are being answered? A response to the\narticle \"Integrative evaluation\" by Draper et aV, Computers and Education, 27, 157-60.\nPhelps, J. and Reynolds, R. (1999), 'Formative evaluation of a Web-based course in\nmeteorology', Computers and Education, 32(2), 181-93.\n18\n"}