{"doi":"10.1108\/09600030410533574","coreId":"140207","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/2594","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/2594","10.1108\/09600030410533574"],"title":"Creating and Managing Value in Collaborative Networks","authors":["Bititci, Umit S.","Martinez, Veronica","Albores, Pavel","Parung, Joniarto"],"enrichments":{"references":[{"id":37971726,"title":"A framework for performance measurement in virtual enterprises”,","authors":[],"date":"2002","doi":null,"raw":"Kochhar A, and Zhang Y, (2002), “A framework for performance measurement in virtual enterprises”, Proceedings of the 2 nd International Workshop on Performance Measurement, 6- 7 June 2002, Hanover, Germany, pp 2-11, ISBN 3-00-009491-1.","cites":null},{"id":37971735,"title":"and the New Economics of Competition”, Harvard Business Review, Nov-Dec,","authors":[],"date":"1998","doi":null,"raw":"Porter, M.E (1998),”Cluster and the New Economics of Competition”, Harvard Business Review, Nov-Dec, pp.77-90 Rudberg, Martin and Olhager, Jan, Manufacturing networks and supply chains: an operations strategy perspective. Omega Vol. 31; No. 1, 29-39.","cites":null},{"id":37971736,"title":"Clusters of Technological Innovation Systems”,","authors":[],"date":"2002","doi":"10.1108\/13673270210440866","raw":"Scheel, Carlos, (2002),”Knowledge Clusters of Technological Innovation Systems”, Journal of Knowledge Management, Vol.6, No.4, pp.356-367 Treacy M. and Wiersema F. (1996). The disciplines of the market leaders. Publisher Harper Collins.","cites":null},{"id":37971724,"title":"Collaboration: The Key to Value Creation in Supply Chain Management”,","authors":[],"date":"2001","doi":"10.1108\/eum0000000006039","raw":"Horvath, Laura, (2001),” Collaboration: The Key to Value Creation in Supply Chain Management”, Supply Chain Management: An International Journal, Vol.6, No.5, pp.205-207, MCB University Press.","cites":null},{"id":37971719,"title":"Country: The Knowledge Cluster”,","authors":[],"date":"2002","doi":"10.1108\/13673270210440857","raw":"Arbonies, A.L and Moso, M (2002),”Basque Country: The Knowledge Cluster”, Journal of Knowledge Management, Vol.6, No.4, pp.347-355, MCB University Press.","cites":null},{"id":37971720,"title":"Creating and Sustaining Competitive Advantage in Collaborative Systems: The What? And The How?’ Production Planning and Control Journal (Forthcoming).","authors":[],"date":"2003","doi":"10.1080\/0953728032000112331","raw":"Bititci U., Martinez V., Albores P. and Mendibil K. (2003) ‘Creating and Sustaining Competitive Advantage in Collaborative Systems: The What? And The How?’ Production Planning and Control Journal (Forthcoming).","cites":null},{"id":37971721,"title":"editors “Strategic management of the Manufacturing Value Chain”, IFIP,Kluwer Academic Publishers, Dordrecht, The Netherlands, ISBN 0-412-82710-7 Carbo, Bob, Align the Organization for Improved Supply Chain Performance.","authors":[],"date":"1998","doi":null,"raw":"Bititci, U.S and Carrie, A.S (1998), editors “Strategic management of the Manufacturing Value Chain”, IFIP,Kluwer Academic Publishers, Dordrecht, The Netherlands, ISBN 0-412-82710-7 Carbo, Bob, Align the Organization for Improved Supply Chain Performance. The ASCET project 4 (2002): 244-447 Carrie, Allan (1999),”Integrated Clusters – the Future Basis of Competition”, International Journal of Agile Management Systems, Vol.1 No.1, pp.45-50 Carrie, Allan (2000),”From Integrated Enterprise to Regional cluster: The Changing Basis of Competition”, Computers in Industry, Vol. 42, pp. 289-298 Elsevier Science B.V Childe S.J, 1998, &quot;The extended enterprise- a concept for co-operation&quot;, Production Planning and Control, 1998, Vol. 9 No. 4 320-327 Childerhouse, Paul, Aitken, James, and Towill, Denis R., (2002), Analysis and design of focused demand chains. Journal of Operations Management Vol.20 No. 6, 675-689..","cites":null},{"id":37971727,"title":"for Profit: Structuring and Managing Strategic Alliances”,","authors":[],"date":"1990","doi":"10.1016\/0024-6301(93)90184-h","raw":"Lewis, D.J (1990),”Partnership for Profit: Structuring and Managing Strategic Alliances”, The Free Press.","cites":null},{"id":37971731,"title":"Golicic S.L.,(2002),”Implementing Collaborative Forecasting to Improve Supply Chain Performance”,","authors":[],"date":null,"doi":"10.1108\/09600030210437960","raw":"McCarthy T.M., Golicic S.L.,(2002),”Implementing Collaborative Forecasting to Improve Supply Chain Performance”, International Journal of Physical Distribution & Logistic Management, Vol.32, No. 6, pp.431-454, MCB University Press.","cites":null},{"id":37971734,"title":"Hamieda (2000),”Inter-firm Collaboration and the New Product Development Process”,","authors":[],"date":null,"doi":"10.1108\/02635570010301179","raw":"Parker, Hamieda (2000),”Inter-firm Collaboration and the New Product Development Process”, Industrial Management & Data Systems, Vol.100, No 6, MCB University Press.","cites":null},{"id":37971732,"title":"Head M.,Yuan Y.(2000),”Supply Chain Collaboration Alternatives: Understanding the Expected Cost and Benefits”, Internet Research: Electronic Networking Applications and Policy,","authors":[],"date":"1999","doi":"10.1108\/10662240210438416","raw":"McLaren T, Head M.,Yuan Y.(2000),”Supply Chain Collaboration Alternatives: Understanding the Expected Cost and Benefits”, Internet Research: Electronic Networking Applications and Policy, Vol.12, No.4, pp.348-364 Nolan, A (2002),”Public Policy on Enterprise Clusters and Networks” in Bartlett, W.,Bateman,M., and Vehovec, M.,(editors), Small Enterprise Development: Policies for Sustainable growth in Soth-east Europe, Kluwer Academic Publisher O'Dell, C. and Grayson, J. (1999) “Knowledge transfer: discover your value proposition”Bititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks, International Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004. Strategy and Leadership March\/April, 10-15.","cites":null},{"id":37971725,"title":"of Enterprise Collaboration”,","authors":[],"date":"2001","doi":"10.1080\/09537280110042666","raw":"Jagdev, H.S and Thoben, K.D, (2001),”Anatomy of Enterprise Collaboration”, Journal of production Planning & Control, Vol.12, No.5, pp.437-451.","cites":null},{"id":37971722,"title":"Proven BPR trajectories for effective supply chain change management","authors":[],"date":"2003","doi":null,"raw":"Childerhouse, P., Disney, S. M., Lockami III, A. , McCormack, K., And Towill, D. R., (2003), Proven BPR trajectories for effective supply chain change management in Proceedings of the First International Joint Conference EurOMA (European Operations Management Association Conference) - POMS (Production and Operations Management Society): The challenges of integrating research and practice , eds Spina, G., Vineli, A., Cagliano, R., Kalchschmidt, M., Romano, P., And Salvador, F., Vol II, pp 71-80 Darroch, Mark A., Akridge, Jay T., and Boehlje, Michael D., (2002), Capturing value in the supply chain: the case of high oleic acid soybeans. The International Food and Agribusiness Management Review Vol. 5 No.1, 87-103.","cites":null},{"id":37971733,"title":"The Extended Manufacturing Enterprise paradigm&quot;,","authors":[],"date":"1994","doi":"10.1108\/00251749410069453","raw":"O’Neill, H. and Sackett, P., 1994, &quot;The Extended Manufacturing Enterprise paradigm&quot;, Management Decision, vol. 32, no. 8, pp. 42-49.","cites":null},{"id":37971730,"title":"The Value Matrix and its Evolution,&quot;","authors":[],"date":"2001","doi":null,"raw":"Martinez, V. and Bititci Umit (2001), &quot;The Value Matrix and its Evolution,&quot; Proceedings of the 8 th International EurOMA Conference - What really Matters in operations management, Bath UK, 2001. pp 118-130 Martinez, V. (2003) Understanding Value Creation: The Value Matrix and The Value Cube, PhD Thesis Strathclyde University .","cites":null},{"id":37971723,"title":"Trust and Collaboration in a Virtual Team”, Team Performance Management:","authors":[],"date":"2001","doi":"10.1108\/13527590110395621","raw":"Holton J.A., (2001),”Building Trust and Collaboration in a Virtual Team”, Team Performance Management: An International Journal, Vol.7, No.3-4, pp.36-47, MCB University PressBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks, International Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.","cites":null},{"id":37971729,"title":"Virtual enterprise - organisation, evolution and control&quot;,","authors":[],"date":"2001","doi":"10.1016\/s0925-5273(01)00129-3","raw":"Martinez M. T., Fouletier K. H., and Favrel J., (2001), &quot;Virtual enterprise - organisation, evolution and control&quot;, International Journal of Production Economics, vol. 74, pp. 225-238.","cites":null},{"id":37971728,"title":"Visual extended enterprise engineering and operation-embedding knowledge management and work execution.","authors":[],"date":"2001","doi":"10.1080\/09537280150501266","raw":"Lillehagen F and Karlsen D, (2001), Visual extended enterprise engineering and operation-embedding knowledge management and work execution. Production Planning and Control Vol. 12 No.2, 164-175.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-01-01T00:00:00Z","abstract":"This is a theoretical paper that examines the interplay between individual and\ncollective capabilities and competencies and value transactions in collaborative\nenvironments. The theory behind value creation is examined and two types of\nvalue are identified, internal value (shareholder value) and external value\n(value proposition). The literature on collaborative enterprises\/network is also\nexamined with particular emphasis on supply chains, extended\/virtual enterprises\nand clusters as representatives of different forms and maturities of\ncollaboration. The interplay of value transactions and competencies and\ncapabilities are examined and discussed in detail. Finally, a model is presented\nwhich consists of value transactions and a table that compares the\ncharacteristics of different types of collaborative enterprises\/networks. It is\nproposed that this model presents a platform for further research to develop an\nin-depth understanding into how value may be created and managed in\ncollaborative enterprises\/networks","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140207.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1108\/09600030410533574","pdfHashValue":"1b081b18e6280359c4ac6aa570cf016bcac9505d","publisher":"Emerald Group Publishing Limited","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/2594<\/identifier><datestamp>2011-09-30T10:52:40Z<\/datestamp><setSpec>hdl_1826_28<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Creating and Managing Value in Collaborative Networks<\/dc:title><dc:creator>Bititci, Umit S.<\/dc:creator><dc:creator>Martinez, Veronica<\/dc:creator><dc:creator>Albores, Pavel<\/dc:creator><dc:creator>Parung, Joniarto<\/dc:creator><dc:subject>Value Analysis<\/dc:subject><dc:subject>Supply Chain Management<\/dc:subject><dc:subject>Cluster Analysis<\/dc:subject><dc:description>This is a theoretical paper that examines the interplay between individual and\ncollective capabilities and competencies and value transactions in collaborative\nenvironments. The theory behind value creation is examined and two types of\nvalue are identified, internal value (shareholder value) and external value\n(value proposition). The literature on collaborative enterprises\/network is also\nexamined with particular emphasis on supply chains, extended\/virtual enterprises\nand clusters as representatives of different forms and maturities of\ncollaboration. The interplay of value transactions and competencies and\ncapabilities are examined and discussed in detail. Finally, a model is presented\nwhich consists of value transactions and a table that compares the\ncharacteristics of different types of collaborative enterprises\/networks. It is\nproposed that this model presents a platform for further research to develop an\nin-depth understanding into how value may be created and managed in\ncollaborative enterprises\/networks.<\/dc:description><dc:publisher>Emerald Group Publishing Limited<\/dc:publisher><dc:date>2011-06-14T23:25:44Z<\/dc:date><dc:date>2011-06-14T23:25:44Z<\/dc:date><dc:date>2004-01-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>Bititci U.S.; Martinez V.; Albores P.; Parung J. Creating and managing value in collaborative networks. International Journal of Physical Distribution & Logistics Management, Vol. 34 (3-4), 2004, pp. 251-268<\/dc:identifier><dc:identifier>0960-0035<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1108\/09600030410533574<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/2594<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0960-0035","0960-0035"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2004,"topics":["Value Analysis","Supply Chain Management","Cluster Analysis"],"subject":["Article"],"fullText":"  International Journal of Physical Distribution and Logistics Management. Vol.34(3-4), 2004, p.251-268\nCreating and Managing Value in Collaborative Networks\nUmit S Bititci, Veronica Martinez, Pavel Albores and Joniarto Parung\nCentre for Strategic Manufacturing\nDMEM, University of Strathclyde, Glasgow, UK\nAbstract\nThis is a theoretical paper that examines the interplay between individual and collective\ncapabilities and competencies and value transactions in collaborative environments. The\ntheory behind value creation is examined and two types of value are identified, internal\nvalue (Shareholder value) and external value (Value proposition). The literature on\ncollaborative enterprises\/network is also examined with particular emphasis on supply\nchains, extended\/virtual enterprises and clusters as representatives of different forms and\nmaturities of collaboration. The interplay of value transactions and competencies and\ncapabilities are examined and discussed in detail. Finally, a model is presented which\nconsists of value transactions and a table which compares the characteristics of different\ntypes of collaborative enterprises\/networks. It is proposed that this model presents a\nplatform for further research to develop an in-depth understanding into how value may be\ncreated and managed in collaborative enterprises\/networks.\nKeywords: value, value propositions, collaboration, supply chain, extended enterprise,\nclusters.\nBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks,\nInternational Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.\n1. Introduction\nIn today’s global economy, companies are trying to re-invent their businesses and\nmaintain their competitive advantage through collaboration. Collaborative practices such\nas supply chains, value chains, extended enterprises, virtual enterprises and clusters are\nbecoming commonplace. However, collaboration for collaboration sake is not enough; if\nbusinesses are to maintain their competitive advantage and continue to sustain their\nperformance, collaboration should result in creation of new and unique value propositions\nbased on a unified approach to value creation.\nThe proposition underpinning the work presented in this paper is that value creation in\ncollaborative organisations should be a win-win-win situation for all parties concerned.\nTo this end, the purpose of this paper is to develop a better understanding of value\ncreation and the role of value propositions in collaborative networks such as supply\nchains, extended\/virtual enterprises and clusters. This is achieved by examining the\ntheory behind value creation and value propositions in the context of different\ncollaborative enterprises\/networks. As a conclusion a comparison of different\ncollaborative enterprises\/networks is presented with particular emphasis on the different\nvalue transactions and their relationship with individual and collective capabilities and\ncompetencies.\n2. Value\nBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks,\nInternational Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.\nToday, the concept of value is of increasing interest to both academics and practitioners\nin different fields such as economics, operations management, marketing, construction\nmanagement and so on. As a result there are a large number of definitions for the term\n“value”.\nIn order to have a better understanding of value in the context of collaboration, we have\nto link two perspectives of value (Martinez, 2003). These are:\n Internal value, i.e. shareholder perspective, where value = wealth\n External value, i.e. customer perspective, where value = satisfaction\nAccording to Martinez (2003) “Value resides in the satisfaction and fulfilment of\ncustomers’ expectations, at the same time, generating wealth for organisations.”\nIn other words, an organisation in satisfying it’s customers’ expectations, should be\ncreating wealth for its shareholders; hence creating value for both parties. Accordingly,\nvalue creation in collaborative organisations should be a win-win-win situation for all\nparties concerned. The partners should each benefit from collaboration by increasing\ninternal value to their shareholders as well as delivering better value (external) to the end-\ncustomer.\nThe generic value propositions presented in the Value Matrix (Martinez and Bititci,\n2001) have shown a focused way to guide organisations for creating unique value. This is\nbecause the value proposition differentiates from the traditional view of value (internal-\nBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks,\nInternational Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.\noriented view) by looking at the business from a customer perspective (external oriented\nview).\n3. Value Propositions\nThe value proposition is defined as “an implicit promise a company makes to its\ncustomers to deliver a particular combination of values” (Martinez, 2003). Each\nproposition searches for a unique value that can be delivered to a chosen market.\nSuccessful companies do not just add value, they re-invent it.\nThe application of this concept has changed the focus of operations in many businesses\nby redefining their competencies and capabilities (e.g. IBM, DELL, ICI, Federal\nExpress). In doing so, these companies have also made some fundamental decisions on\ncustomer segmentation, competencies, culture, infrastructure, technology, resources and\nstrategies (O’Dell and Grayson, 1999).\nThe Value Matrix (Martinez and Bititci, 2001), illustrated in Figure 1, proposes six\ngeneric value propositions. These value propositions are an extension of the three original\nvalue propositions proposed by Treacy and Wiersema (1996) by introduction of the new\nvalue dimension, i.e Hard Value and Soft Value. Table 1 explains each value proposition\nfrom the customer perspective as “Customers get” and company perspective as\n“Company needs to do”.\nBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks,\nInternational Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.\nFigure 1. The Value Matrix\nTable 1. Six generic value proposition of the Value Matrix\nValue What the What the company needs to do?\nProposition customers get? Strategic Objectives Operational Objectives\nInnovators\nIntel, Sony\nNew innovative\ndesigns and products\nnever seen before.\nContinuous stream of\nbreakthrough designs and\nproducts with new and\nunique features. Often\ntechnologically oriented.\nLong-term vision, robust\nR&D and product\ndevelopment capability.\nCapacity to innovate within\nshort product lifecycles.\nBrand Managers\nHarley Davidson,\nNike, Highland\nSpring\nProduct status\nLifestyle statement\nA feeling of\nsuperiority\nGlobal brand recognition\nReinforce solid brand image\nof the product and\/or\ncompany.\nFocus market sector.\nSuperior control over the\nproduct styles, quality and\npromotion.\nPrice\nMinimisers\nNissan\nPrice\/Costco\nTesco\nOrdinary, reliable\nproducts and services\nat low prices.\nHighly effective production\nand logistics capability with\nhigh quality levels and low\nwaste.\nHighly efficient and\neffective order fulfilment\nprocess sustained by product\nstandardisation. Automation\nand proceduralisation.\nSimplifiers\nScrewfix direct\nHouston w\/h\nEasyjet\nConvenience and\navailability of the\nproducts.\nHassle free\nexperience.\nBuilding streamlined\nprocesses to make life\nsimple and uncomplicated\nfor customers in a novel and\nprofitable way.\nAvailability and\naccessibility. Effective order\nfulfilment–distribution by\nconventional and un-\nconventional resources\n(networking, IT, etc.).\nTechnological\nIntegrator\nAlcan specialist\nchemicals\nTailored products and\nservices.\nTotal solutions.\nTailor specific and\ncontinuous solutions for\ncarefully selected customers\non the basis of permanent\nrelationships.\nUnderstanding customers\nbusiness, markets, products\nand operations. Capacity to\nconfigure products and\nservices. Ability to adopt the\ncustomer’s strategy.\nSocialisors\nSmall\nconsultancies and\ntradesman\nFlexible services and\ninter-personal\nrelationship built and\ntrust.\nBuild confidence and trust\nwith customers through\nunderstanding of their\nbusiness needs.\nSensitive fulfilment of\ncustomers’ needs supported\nby careful deliver,\nreliability, and honesty.\nExcellent personal service.\nHard Soft\nNew Value Dimensions\nProduct\nLeadership\nOperational\nExcellence\nCustomer\nIntimacy\nO\nri\ng\nin\nal\nV\nal\nu\ne\nP\nro\npo\nsi\nti\no\nn\ns\nInnovator\ns\nBrand\nManager\ns\nPrice\nMinimiser\ns\nSimplifiers\nSocialisor\ns\nTechnologic\nalIntegrator\ns\nThe Value Matrix\nBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks,\nInternational Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.\nThe works of Treacy and Wiersema (1996) and Martinez and Bititci (2001) highlight the\nfollowing pertinent points:\n Most successful companies have a very clear and unambiguous value proposition\/\noffering to their customers, which forms the basis of their business and operations\nstrategies.\n These value propositions are a function of carefully shaped and honed competencies\nwhere each firm has focused on developing the key competencies and capabilities that\nenable them to deliver their value proposition to their customers efficiently and\neffectively ensuring that internal value (i.e. shareholder) expectations are also\nsatisfied.\n The value proposition is the common ground between the customer and the supplier.\nSo far, the concept of the value proposition has been applied at a single enterprise level to\nlink the customers’ expectations with the suppliers offer. However, if collaboration is to\nresult in creation of new and unique value propositions based on a unified approach to\nvalue creation, then the role of value propositions in collaborative networks needs to be\nbetter understood.\n4. Collaboration\nCollaboration literally means working-together (Huxham, 1996, Jordan Jr. and Michel,\n2000). The term is often used when individuals or organisations work together towards a\ncommon aim. The other terms that are used to describe this situation are relationships,\npartnerships or alliances.\nBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks,\nInternational Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.\nCollaboration has been discussed as a way forward for organisations in situations in\nwhich working alone is not sufficient to achieve the desired ends (Huxham, 1996). Most\ndefinitions of collaboration are based on this assumption as follows. Collaboration is:\n taken to imply a very positive form of working in association with others for some\nform of mutual benefit (Huxham, 1996).\n a distinct mode of organising, implies a positive, purposeful relationship between\norganisations that retain autonomy, integrity and distinct identity, and thus, the\npotential to withdraw from the relationship (Huxham, 1996).\n a number of companies linked to create and support a service or product for its\nservice life including final disposal (Jordan and Michel, 2000).\n a focus on joint planning, coordination and process integration between supplier,\ncustomers and others partners in a supply chain. Also involves strategic joint decision\nmaking about partnership and network design (McLaren et al, 2002).\n a process in which organizations exchange information, alter activities, share\nresources and enhance each other’s capacity for mutual benefit and a common\npurpose by sharing risks, responsibilities and rewards’ (Himmelman, 1992 in\nHuxham, 1996).\n5. Collaboration: Motives and Benefits\nThe literature on collaboration suggests that implementation of collaborative initiatives\nhas inherited difficulties; therefore the amount of effort involved in integrating\noperational, tactical or strategic levels of separate companies is usually large. However,\nthe same literature also reports that the benefits of such collaboration are considered to be\nBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks,\nInternational Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.\nsignificant. Some motives and benefits associated with inter-enterprise collaboration\nhave been identified as:\n To increase their market share (Lewis, 1990).\n To increase asset utilization (Lewis, 1990).\n To enhance customer service – reduction in lead times, customer complaints, etc.\n(Lewis, 1990).\n To share and reduce the cost of product development (Lewis, 1990; Parker,2000;\nHorvarth, 2001; McLaren et al., 2002)\n To reduce time in product development (Lewis, 1990; Parker, 2000; McCarthy and\nGolicic, 2002,McLaren et al., 2002;)\n To decrease risk of failure of product development (Parker,2000)\n To increase quality of product (Lewis, 1990)\n To enhance skill and knowledge (Lewis, 1990)\n To have technological gain as participating firm (Lewis, 1990; Parker, 2000)\n To achieve economies of scale in production (Lewis, 1990)\n To reduce inventory - in the face of increasing technological complexity and rapid\nrate product development and obsolescence (Parker, 2000, Holton,2001)\n To gain rapid access to markets (Parker, 2000; McCarthy and Golicic, 2002)\nIn context of the research proposition that underpins this paper, collaboration should lead\nto a win-win-win situation for all parties concerned ( i.e participating partners as well as\nthe end-customer). There is no doubt that the motivation for each individual enterprise\ncomes not from the fact that they want to collaborate but from the fact that there are\nBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks,\nInternational Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.\neconomic advantages to be gained through collaboration. But what about the end\ncustomer? How does or should the combined competencies of participating partners\naffect the value proposition of the collaborative enterprise to the end-customer?\nIn order to provide logical answers to these questions it is necessary to understand the\nliterature relating to collaborative networks such as supply chains, extended enterprises,\nvirtual enterprises and clusters.\n6. Collaborative Networks and Value Propositions\nIn this paper, we argue that the type of value created and obtained by a specific\ncollaboration is dependent on the degree of maturity of that collaboration. A framework\nto describe the maturity of the collaboration is proposed by Childerhouse et al (2003),\nwhich presents five stages of maturity: Ad hoc, Defined, Linked, Integrated and\nExtended. Although this model is focused primarily on supply chains, the different\nstages of maturity for collaborative enterprises may be categorised as:\n Ad hoc – collaboration does not go beyond the traditional customer supplier\nrelationship.\n Defined and Linked – collaboration focuses on operational issues and limited to\ncollaborative planning, forecasting and replenishment of materials and capacities, i.e.\nSupply Chain Management.\n Integrated + Extended– collaboration at a strategic level where integrated and\ncoordinated strategies lead to strategic synergy, i.e. Extended and Virtual Enterprises.\nBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks,\nInternational Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.\n To this spectrum of maturity, we would also add Clusters, which represent integrated\ncollaborations which also include supporting infrastructures.\nThe following sections provide a more detailed discussion on how the combined\ncompetencies of participating partners can affect and shape the value proposition of\ntypical collaborative networks, such as supply chains, extended enterprises, virtual\nenterprises and clusters. In doing so, the “value transactions” across the network, in\nwhich value is promised, planned, managed and delivered, are identified as well as\nhighlighting the differences that this has for companies working in different collaborative\nnetworks.\n6.1 Supply Chains\nDuring the last decade, companies have started to have awareness of the need to take into\naccount their suppliers and customers. Traditionally, the focus has been on the supply\nchain in order to manage the movement of materials from suppliers to end customer\nefficiently and effectively. Supply chain management models such as SCOR (Supply\nChain Operations Reference model - www.supply-chain.org) identify the need for\nexternal integration between the supply chain partners. But this integration remains at an\noperational level. At best, supply chains are about collaborative planning, fulfilment and\nreplenishment (CPFR), but do not achieve the level of strategic collaboration and synergy\nalong the supply chain.\nBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks,\nInternational Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.\nEssentially, in supply chains, each company plans its operations according to the orders\nreceived and forecasted and commits capacities and delivery dates according to their\nindividual loads and capacities. Accordingly, strategy for companies in the supply chain\nis formulated at the enterprise level, not at the supply chain level. Generally, the analysis\nof supply chains has taken place from the point of view of one of the members of the\nsupply chain and not for the supply chain as a whole, trying to improve the “supply chain\nrelated processes” of a single company, rather than really optimising the whole of the\nsupply chain. This issue is found repeatedly in the literature, e.g. Darroch et al., (2002)\nand Rudberg and Olhager (2003) present studies of value and strategy from the point of\nview of different partners in the SC, but do not consider the collaborative system as a\nwhole.\nSome authors have described the need to align the members of the supply chain in order\nto gain better performance (e.g. Carbo, 2002). Childerhouse et al, (2002) and Eloranta\n(1999) propose the analysis of demand chains in order to achieve better performance in\nthe demand chain. However, the approach is still centred on the individual company,\nrather than on the SC as a whole.\nTaking the view of supply chain management as simply the management of the logistics\noperations of a company, both upstream and downstream, we can see that the value\npropositions of the supply chain members are disjointed, focusing on delivering value to\nthe next member in the chain, and not worrying about the overall value proposition that is\nimportant to the end customer.\nBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks,\nInternational Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.\nFigure 2 illustrates the value propositions that emerge in supply chain type collaborations\nwhere the companies in the supply chain select their individual value proposition,\naligning it to the next member of the supply chain. In this case, the value proposition of\nthe overall supply chain is the same as that of the company that is facing the end\ncustomer (E3 in Figure 2) – that is the value proposition is a function () of the\ncompetences and capabilities of that last company in the chain.\nVPSC = VPE3=  (CCE3)\nVPSC – Value proposition of the supply chain\nVPE3 – Value proposition of Enterprise #3\nCCE3 – Competencies and capabilities of Enterprise #3\nFigure 2. Value propositions (VP) in supply chains\n6.2 Extended and Virtual Enterprises\nAccording to Childe (1998) an extended enterprise is ‘a conceptual business unit or\nsystem that consists of a purchasing company and suppliers who collaborate closely in\nsuch a way as to maximise the returns to each partner’.\nIn this paper, the virtual enterprise is considered as a temporal case of an extended\nenterprise. I.e. the virtual enterprise is a dynamic partnership among companies that can\nE1 E3E2 EndCustomer\nE 4\nVP\nVP\nOperational integration\nalong the SC\nVPE2 VPE1\nE 5\nVPE3=VPSC\nThe Supply Chain\nBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks,\nInternational Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.\nbring together complementary competencies needed to achieve a particular business task,\nwithin a certain period of time (Kochhar and Zang, 2002).\nFrom the literature on extended and virtual enterprises the following pertinent points have\nbeen extracted as being of relevance to the research presented in this paper:\n The extended enterprise is a philosophy where member organisations strategically\ncombine their core competencies and capabilities to create a unique competency. A\nfacet of this approach is the development of products and services that best fit the\nphysical and intellectual characteristic of the individual markets (Martinez et al.\n2001, Kochhar and Zhang 2002).\n In extended enterprises, people across a number of organisations participate in the\ndecision-making process. This demands knowledge and resource integration (O’Neill\nand Sackett 1994).\n In an extended enterprise each company is self-organised, while the extended\nenterprise imposes a federal structure for communication and synchronisation\nbetween individual enterprises (Martinez et al. 2001).\n The Extended Enterprise business strategy formulation is an incremental process;\nplanning, implementation, evaluation and revision represent small steps, done almost\nsimultaneously (Martinez et al. 2001, Lillehagen and Karlsen 2001).\nBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks,\nInternational Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.\nIn a supply chain, each participating company operating as an individual enterprise tries\nto maximise its own corporate goals, thus sub-optimising the overall performance. An\nextended enterprise is a chain of enterprises, which essentially behave as a single\nenterprise trying to maximise the corporate goals of the extended enterprise, thus\noptimising the performance of each individual enterprise (Bititci et al, 2003). This\ndifference is illustrated in Figure 3. The serial and parallel configuration of the extended\nenterprise is determined by its needs, i.e. competencies, capabilities and resources.\nFigure 3. Extended enterprise (serial & parallel collaborations) Vs. supply chain\nEE\nE1\nsupplier\nE2\ncust\/supp\nMax.\nPerform\nE3\ncustomer\nOpt.\nPerform\nOpt.\nPerform\nOpt.\nPerform\nE\nxt\nen\nd\ned\n\/V\nir\ntu\nal\nE\nn\nte\nrp\nri\nse\nV\nie\nw\n“S\ner\nia\nl”\nOptimised individual\nperformance\nMax. overall performance\nwhere gains are shared\nbetween enterprises\nEnd Customer\nE1\nsupplier\nMax.\nPerform.\nE2\ncust \/supp\nMax.\nPerform.\nE3\ncustomer\nMax.\nPerform\nS\nu\np\np\nly\nC\nh\nai\nn\nV\nie\nw\nEnd Customer\nEE\nE1 E2\ncust\/supp\nE3\ncustomer\nOpt.\nPerform\nOpt.\nPerform\nEE\nE\nxt\nen\nd\ned\n\/V\nir\ntu\nal\nE\nn\nte\nrp\nri\nse\nV\nie\nw\n“P\nar\nal\nle\nl”\nE1\nsupplier\nOpt.\nPerform\nE3\ncustomer\nOpt.\nPerform\nEnd Customer\nMax.\nPerform\nE2\nsupplier\nOpt\nPerform\nOptimised individual\nperformance\nMax. overall performance\nwhere gains are shared\nbetween enterprises\nMax. individual\nperformance\nsub-optimised overall\nperformance\nE\nxt\nen\nd\ned\n\/V\nir\ntu\nal\nE\nn\nte\nrp\nri\nse\nV\nie\nw\n“S\ner\nia\nl”\nE\nxt\nen\nd\ned\n\/V\nir\ntu\nal\nE\nn\nte\nrp\nri\nse\nV\nie\nw\n“S\ner\nia\nl”\nS\nu\np\np\nly\nC\nh\nai\nn\nV\nie\nw\nS\nu\np\np\nly\nC\nh\nai\nn\nV\nie\nw\nE\nxt\nen\nd\ned\n\/V\nir\ntu\nal\nE\nn\nte\nrp\nri\nse\nV\nie\nw\n“P\nar\nal\nle\nl”\nE\nxt\nen\nd\ned\n\/V\nir\ntu\nal\nE\nn\nte\nrp\nri\nse\nV\nie\nw\n“P\nar\nal\nle\nl”\nE\nxt\nen\nd\ned\n\/V\nir\ntu\nal\nE\nn\nte\nrp\nri\nse\nV\nie\nw\n“P\nar\nal\nle\nl”\nBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks,\nInternational Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.\nBased on this literature, we propose the following definitions:-\n ‘An Extended Enterprise is a knowledge-based organisation, which uses the\ndistributed capabilities, competencies and intellectual strengths of its members to\ngain competitive advantage to maximise the performance of the overall extended\nenterprise’\n ‘A Virtual Enterprise is a temporal knowledge-based organisation, which uses the\ndistributed capabilities, competencies and intellectual strengths of its members to\ngain competitive advantage to maximise the performance of the overall virtual\nenterprise’\nIn the extended\/virtual enterprise, there is a strong integration of the actors’ value\npropositions. The whole extended\/virtual enterprise follows a common value proposition\nthat is focused on the delivery of a specific value for a selected market (end customer). It\nis characterised by its strategic and operational collaboration.\nThe integration of the value proposition’s actors implies that the individual competencies\nand capabilities (CC) are integrated and complement each other, thus they are aligned to\n‘the overall value proposition of the extended\/virtual enterprise’ to create a particular\nvalue for the end customers.\nVPEE = (CCEE) [ CCE1 + CCE2 + CCE3 +….+ CCEn ]\nBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks,\nInternational Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.\nVPEE = Value Proposition of the extended\/virtual enterprise\nCCEE = Collective competencies and capabilities of the extended\/virtual enterprise\nCCEn = Individual competencies and capabilities of the participating companies\nIn the literature the basic assumption is that collaboration takes place between individual\ncompanies\/enterprises. However, according to the empirical evidence provided by Bititci\net al (2003), the architecture of the extended enterprise is somewhat more complex then\nthe one illustrated in Figure 3. The critical points are that:\n Extended\/virtual enterprises emerge as a result of collaboration between business\nunits of companies, rather than whole companies.\n One company could be participating in more than one extended enterprise\nThe extended enterprise shown in Figure 4 is formed by the business units of three\nenterprises, i.e. BU1, BU2 and BU3 (illustrated with the solid-white arrows). This figure\nshows the value proposition of the EE (VPEE)at the top of the EE triangle, it is supported\nby the value propositions of its actors (VP1, VP2 and VP3).\nThe value proposition of the extended enterprise is determined by a meta-level\nmanagement process, which plans, co-ordinates and reviews the value creation process of\nthe entire extended enterprise to achieve strategic and operational synergy. A function of\nthis meta-manage process is to ensure that strategic synergy is maintained between the\nmembers of the extended enterprise by ensuring the individual capabilities and\ncompetencies (therefore the individual value propositions) of each business unit is\naligned with the value proposition of the extended enterprise. In achieving this strategic\nBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks,\nInternational Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.\nsynergy, the value proposition of each business unit is likely to be different but\ncomplimentary to one another.\nFigure 4. The value proposition in the EE\nIn summarising this section we could conclude that:\n A single enterprise can have more than one value proposition. i.e. a value proposition\nfor each business unit.\n An enterprise can participate within more than one extended\/virtual enterprise\n The individual competencies and capabilities (therefore the value proposition), of\neach enterprise have strong integration with the value proposition of the overall\nextended enterprise.\nOptimised individual\nperformance\nMax. overall performance\nwhere gains are shared\nbetween enterprises\nE = Enterprise BUi = Business Unit\nEE = Extended Enterprise VPi = Value Proposition of the BUi\nVPEE = Value Proposition of the EE CCi = Competencies and Capabilities of the BUi\nBU1\nBU3\nBU2\nE4\nE1\nBU1\nBU3\nBU2\nBU1\nBU3\nBU2\nBU1\nBU3\nBU2\nE1\nBU1\nBU2\nE2\nBU1\nBU2\nE3\nBU1\nVP1VP3\nVP2\nBU1\nBU3\nBU2\nE6\nVPEE\nEE\nBU1\nBU3\nBU2\nE5\nVP1  CC1\nVP2  CC2\nVP3  CC3\nBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks,\nInternational Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.\n The competencies and capabilities (therefore the value propositions) of each\nenterprise contribute and support the overall value proposition of the extended\nenterprise.\n The overall value proposition of the extended enterprise can be different from the\nvalue propositions of its members.\n The value proposition of the extended enterprise should be reflected in the kind of\nvalue offered to the end customer.\n The value proposition of the extended enterprise is function of the collective\ncompetencies and capabilities.\nWith respect to the literature on value creation, the conclusions relating to value\ntransactions in extended enterprises have lead us identify a three types of value\ntransactions. These are:\n Shareholder value – the value proposition of each enterprise to its shareholders – this\nis essentially equivalent to internal value as defined in the value creation literature\n Intra-extended-enterprise value proposition (VPEn)– the value proposition of each\nenterprise to the overall extended enterprise. Essentially this represents the value a\nsingle member adds to the overall extended enterprise. This is a function of its core\ncompetencies and capabilities (CCEn) - i.e. VPEn = (CCEn)\n Extended-enterprise value proposition (VPEE) - the value proposition of the extended\nenterprise to its end-customers. This is a function of the combined competencies and\ncapabilities (CCEE) of the extended enterprise, which is equal or bigger than the sum\nof the individual members competencies and capabilities (CCEn)\nBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks,\nInternational Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.\nVPEE = (CCEE)  [CCE1 + CCE2 + CCE3]\n6.3 Clusters\nA cluster could be define as a network of companies, their customers and suppliers of all\nthe relevant factors, including materials and components, equipment, training, finance\nand so on (Carrie, 1999). Furthermore, Jones (2002) describes clusters as networks of\ninterdependent firms, knowledge producing institutions, technology providing firms,\nbridging institutions and customers, linked in a value creating production chain. Clusters\nare also defined as geographic concentrations of interconnected companies and\ninstitutions in a particular field. Clusters encompass an array of linked industries and\nother entities important to competition. They include, for example, supplier of specialised\ninputs such as components, machinery, and services, and provides of specialised\ninfrastructure (Porter, 1998).\nIn clusters, facilitators assist and encourage companies, educational institutes\n(universities, colleges, etc), consultants, vocational training providers and trade\nassociation to collaborate and create more value. Facilitators could be government\nagencies (as in the Scottish model), volunteers (as in the Arizona model) or executives of\nthe participants (as in the Basque model). The participants such as educational\ninstitutions (universities, colleges), consultants, vocational training providers and trade\nassociations, provide specialised training, education, information, research, and technical\nsupport to a core group of companies which create value for the entire cluster. The\ncompanies collaborate in the cluster with each other by sharing information and\nBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks,\nInternational Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.\nintegrating similar activities (such as research, education, marketing, IT) in order to\nachieve better competitive advantages for the members and to support the economic\nregion. These competitive advantages could be:\n Reduce the unit cost by providing technical services to clustered businesses (Porter,\n1998; Nolan, 2002)\n Reduced transaction cost because firms and their supplier operate near each other\n(Nolan, 2002;)\n Integrated research (Bititci and Carrie, 1999; Porter, 1998; Arbonies and Moso, 2002)\n Economies of scale (Carrie, 2000; Nolan, 2002)\n Attractive innovation (Arbonies and Moso, 2002; Scheel, 2002)\n Improved customer service e.g. shorter delivery time because of mutual\nunderstanding to help each other between members of the cluster (Carrie, 2000)\n Improved time to market of new products (Carrie, 2000)\n Stronger bargaining power in all respects, including suppliers, government (e.g. built\ninfrastructure, tax incentive) and other relevant bodies (Scheel, 2002)\n Greater scale and presence without sacrificing flexibility (Porter, 1998).\nFigure 5 provides a pictorial illustration of a cluster.\nBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks,\nInternational Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.\nFigure 5. The cluster\nBased on the literature on clusters we have at the following conclusions:\n In an extended enterprise there is a higher degree of strategic and operational\nintegration between the members. In a cluster there is a degree of strategic integration\nwithin the core-network in order to leverage the support functions but the focus is still\non the creation of competitive advantage for each individual enterprise. Therefore\nstrategic synergy and operational integration are not necessary.\n In a cluster each member can leverage the advantages of being a member of the\ncluster to develop its own competitive advantage by enhancing its competencies and\nThe Supporting\nInfrastructure\nSustainable\nCompetitive\nAdvantage\nSuppliers DistributorsManufacturers\nFi\nna\nnc\nia\nl\nIn\nst\nitu\ntio\nns\nG\nov\ner\nnm\nen\nt\nde\npa\nrt\nm\nen\nts\nE\ndu\nca\ntio\nn\nan\nd\nT\nra\nin\nin\ng\nin\nst\n.\nR\nes\nea\nrc\nh\nIn\nst\nitu\ntio\nns\nEquipm\nent\nM\nanufacturers\nR\nD\nA\ns\nTrade\nA\nssociations\nThe Core-Network\nE\nE\nE\nE\nE\nE\nE\nE\nE\nE E\nE\nFi\nna\nnc\nia\nl\nIn\nst\nitu\ntio\nns\nG\nov\ner\nnm\nen\nt\nde\npa\nrt\nm\nen\nts\nE\ndu\nca\ntio\nn\nan\nd\nT\nra\nin\nin\ng\nin\nst\n.\nR\nes\nea\nrc\nh\nIn\nst\nitu\ntio\nns\nEquipm\nent\nM\nanufacturers\nR\nD\nA\ns\nTrade\nA\nssociations\nBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks,\nInternational Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.\ncapabilities to develop a unique value propositions for its own target customers and\nmarkets.\n Clusters may provide the ideal environment within which extended\/virtual enterprises\nmay emerge.\nThus we have identified the following value transactions within a cluster:\n Shareholder value – the value proposition of each member (enterprise or support\ninstitution) to its shareholders – this is essentially equivalent to internal value as\ndefined in the value creation literature\n Intra-cluster value proposition (VPICn) – the value proposition of each member to the\noverall cluster. Essentially this represents the value a single member adds to the\noverall cluster. This is a function of its members core competencies and capabilities\n(CCMn) - i.e. VPICn = (CCMn)\n Cluster value proposition (VPC) - the value proposition of the cluster to external\nmarkets. This is a function of the combined competencies and capabilities of the\ncluster (CCC), which is the sum of the individual members competencies and\ncapabilities (CCMn) – i.e. VPC = CCC  [CCM1 + CCM2 + CCM3]. Although, on the\nsurface this sounds similar to the external value proposition for the extended\nenterprise, it is inherently different. The value proposition of the cluster to its external\nmarkets is a structural and infrastructural proposition (e.g. an OEM may wish to form\npartnerships to purchase its components from an SME which is operating within a\ngood cluster because this structural and infrastructural support available to the SME.\nSimilarly an external investor may be more likely to invest in a venture which is\nBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks,\nInternational Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.\nsupported by a good cluster). Where as the external-enterprise value proposition is\nmore likely to be a combination of the generic value propositions presented in Figure\n1.\n Individual value proposition (VPM) – This is the value proposition of each member to\nits own customers\/markets. This is a function of its own competencies and\ncapabilities (CCMn) as well as the value proposition of the entire cluster (VPC) – i.e.\nVPM= [CCMn+ VPC].\n7. Discussion and Conclusions\nCompanies working together are commonly known as collaborative enterprises. From a\nnetwork point of view, collaborative enterprise or network could be define as: a distinct\nmode of organisation in which participant organisations work together in equity,\ncommitment and trust exchanging information, sharing activities and resources and\ncomplimenting and enhancing each other’s capacity for mutual benefit and a common\npurpose by sharing risks, responsibilities and rewards’.\nThe research has identified different levels of collaboration and categorised each one of\nthe existing collaborative enterprise models according to the level of collaboration\ninherent within the network\/enterprise, i.e. supply chains, extended and virtual enterprises\nand clusters. This led us to analyse and identify the value transactions in case of each\ncollaborative enterprise model.\nBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks,\nInternational Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.\nAccording to Jagdev and Thoben (2001), it is not possible to define a single criterion or\ndemarcation to distinguish collaboration in Supply chain, Extended Enterprise and\nVirtual Enterprise. The same applies to a lesser extend to a cluster. Therefore it is\nimportant to identify the key characteristics for each type of collaborative\nenterprise\/network. Table 2 is represents a first attempt at identifying these characteristics\nand associated value transactions as discussed in greater detail in the paper.\nAlthough the original literature on value creation identified two types of value transaction\n(Shareholder Value and Customer Value - i.e. the value proposition), in the case of\ncollaborative enterprises\/networks, this research has identified additional value\ntransactions. These may be summarised under four different headings as follows:\n Shareholder value - the value proposition of each member to its shareholders – this is\nessentially equivalent to internal value as defined in the value creation literature.\n Individual value proposition - the value proposition of each member to its end-\ncustomers. This is generally a function of each members’ own competencies and\ncapabilities, except in the case of a cluster where members can leverage the\ncapabilities and competencies available in the cluster to enhance their own value\npropositions to their customers and markets.\n Intra-network value proposition - the value proposition of each member to the overall\nnetwork. Essentially this represents the value a single member adds (or contribution it\nBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks,\nInternational Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.\nmakes) to the overall network. This is a function of its core competencies and\ncapabilities.\n Network value proposition - the value proposition of the network to external markets.\nThis is a function of the combined competencies and capabilities of the network but it\nmay be a combination of traditional value propositions in the case of virtual and\nextended enterprises and a structural and infrastructural value proposition in the case\nof a supply chain.\nThis research highlighted the diverse and complicated nature of the value transactions in\ndifferent types of collaborative enterprises\/networks. It is demonstrated that network\ncollaborative enterprises\/networks can create a new and unique value propositions by\ncomplementing, integrating and leveraging each other’s capabilities and competencies.\nFrom a methodological perspective, this is a theoretical paper, which deduced from\nliterature a specific understanding of the interplay between capabilities and competencies\nand value transactions in collaborative environments. This has resulted in a first-cut\nmodel – represented in the form of four value transactions and Table 2 – which should\nprovide a platform for further research in this area.\nBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks,\nInternational Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.\nTable 2. Key characteristics and value transactions of collaborative enterprises\/networks\nSupply Chain Extended Enterprise Virtual Enterprise Cluster\nSharing Resources Low High High Moderate\nTransparency of internal\ninformation\nLow High High Moderate\nStrategic integration Low High High Moderate\nOperational integration Moderate High High ModerateP\nar\nti\nci\npa\nnt\ns\nC\nom\npa\nni\nes\ndo\nin\ng\nTime period of collaboration Not stated Long term Temporary Long term\nPartner enterprises Low High High Moderate\nGovernment, regional\ndevelopment agencies, etc\nLow Low Low High\nEducation and research\nInstitutes, etc\nLow Low Low High\nL\nev\nel\nof\nin\nvo\nlv\nem\nen\nt\nConsultants, Financial\ninstitutions etc\nLow Moderate Moderate High\nIncreased market share Low High High Moderate\nIncrease asset utilization Moderate High High Low\nEnhanced customer services Moderate High High Moderate\nReduced cost of New product\nDevelopment (NPD)\nLow High High Moderate\nReduce time in product\ndevelopment\nModerate High High Moderate\nDecrease risk failure Low High High Moderate\nIncrease quality of product Moderate High High High\nEnhanced skill and knowledge Low Moderate Moderate High\nEnhanced technologies\ncapabilities\nLow Moderate Moderate High\nSharing risk due to the\ncomplexity and rapid rate of\nproduct obsolescence\nLow High High Low\/Moderate\nRapid access to market Moderate Moderate High High\nEconomies of scale Moderate High High High\nReduce order fulfilment time Moderate High High Moderate\nRapid response to the\ncustomer’s complaint\nModerate High High Moderate\nP\nar\nti\nci\npa\nnt\ns\nco\nm\npa\nni\nes\nbe\nne\nfi\nts\nInventory reduction Moderate High High Moderate\nPrice minimisers\nInnovators\nSocialisers Individual Integrated Integrated Multiple\nTechnology integrator\nBrand manager\nSimplifier\nV\nal\nue\npr\nop\nos\nit\nio\nn\nStructural and Infrastructural Low Moderate Moderate High\nShareholder value    \nIndividual value proposition  of own C&C N\/a N\/a  of own C&C\n+ cluster C&C\nIntra-network value proposition  of own C&C  of own C&C  of own C&C N\/a\nV\nal\nue\ntr\nan\nsa\nct\nio\nns\nNetwork-value proposition N\/a\n of sum of the\nindividual C&C\n(Traditional)\n of sum of the\nindividual C&C\n(Traditional)\n of sum of the\nindividual C&C\n(Infrastructural)\nBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks,\nInternational Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.\nReferences\nArbonies, A.L and Moso, M (2002),”Basque Country: The Knowledge Cluster”, Journal\nof Knowledge Management, Vol.6, No.4, pp.347-355, MCB University Press.\nBititci U., Martinez V., Albores P. and Mendibil K. (2003) ‘Creating and Sustaining\nCompetitive Advantage in Collaborative Systems: The What? And The How?’\nProduction Planning and Control Journal (Forthcoming).\nBititci, U.S and Carrie, A.S (1998), editors “Strategic management of the Manufacturing\nValue Chain”, IFIP,Kluwer Academic Publishers, Dordrecht, The Netherlands, ISBN 0-\n412-82710-7\nCarbo, Bob, Align the Organization for Improved Supply Chain Performance. The\nASCET project 4 (2002): 244-447\nCarrie, Allan (1999),”Integrated Clusters – the Future Basis of Competition”,\nInternational Journal of Agile Management Systems, Vol.1 No.1, pp.45-50\nCarrie, Allan (2000),”From Integrated Enterprise to Regional cluster: The Changing\nBasis of Competition”, Computers in Industry, Vol. 42, pp. 289-298 Elsevier Science\nB.V\nChilde S.J, 1998, \"The extended enterprise- a concept for co-operation\", Production\nPlanning and Control, 1998, Vol. 9 No. 4 320-327\nChilderhouse, Paul, Aitken, James, and Towill, Denis R., (2002), Analysis and design of\nfocused demand chains. Journal of Operations Management Vol.20 No. 6, 675-689..\nChilderhouse, P., Disney, S. M., Lockami III, A. , McCormack, K., And Towill, D. R.,\n(2003), Proven BPR trajectories for effective supply chain change management in\nProceedings of the First International Joint Conference EurOMA (European Operations\nManagement Association Conference) - POMS (Production and Operations Management\nSociety): The challenges of integrating research and practice , eds Spina, G., Vineli, A.,\nCagliano, R., Kalchschmidt, M., Romano, P., And Salvador, F., Vol II, pp 71-80\nDarroch, Mark A., Akridge, Jay T., and Boehlje, Michael D., (2002), Capturing value in\nthe supply chain: the case of high oleic acid soybeans. The International Food and\nAgribusiness Management Review Vol. 5 No.1, 87-103.\nEloranta E, (1999), Keynote Address, International Conference on Advanced Production\nManagement Systems, An IFIP WG5.7 Conference, Berlin, Germany, October 1999.\nHolton J.A., (2001),”Building Trust and Collaboration in a Virtual Team”, Team\nPerformance Management: An International Journal, Vol.7, No.3-4, pp.36-47, MCB\nUniversity Press\nBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks,\nInternational Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.\nHorvath, Laura, (2001),” Collaboration: The Key to Value Creation in Supply Chain\nManagement”, Supply Chain Management: An International Journal, Vol.6, No.5,\npp.205-207, MCB University Press.\nHuxham, Chris, editor, (1996),”Creating Collaborative Advantage”, Saage Publications,\nLondon\nJordan Jr. J.A. and Michel F.J.,(2000),”Next Generation Manufacturing: Methods and\nTechniques”,John Wiley & Sons,Inc.\nJagdev, H.S and Thoben, K.D, (2001),”Anatomy of Enterprise Collaboration”, Journal of\nproduction Planning & Control, Vol.12, No.5, pp.437-451.\nKochhar A, and Zhang Y, (2002), “A framework for performance measurement in virtual\nenterprises”, Proceedings of the 2nd International Workshop on Performance\nMeasurement, 6- 7 June 2002, Hanover, Germany, pp 2-11, ISBN 3-00-009491-1.\nLewis, D.J (1990),”Partnership for Profit: Structuring and Managing Strategic Alliances”,\nThe Free Press.\nLillehagen F and Karlsen D, (2001), Visual extended enterprise engineering and\noperation-embedding knowledge management and work execution. Production Planning\nand Control Vol. 12 No.2, 164-175.\nMartinez M. T., Fouletier K. H., and Favrel J., (2001), \"Virtual enterprise - organisation,\nevolution and control\", International Journal of Production Economics, vol. 74, pp. 225-\n238.\nMartinez, V. and Bititci Umit (2001), \"The Value Matrix and its Evolution,\" Proceedings\nof the 8th International EurOMA Conference - What really Matters in operations\nmanagement, Bath UK, 2001. pp 118-130\nMartinez, V. (2003) Understanding Value Creation: The Value Matrix and The Value\nCube, PhD Thesis Strathclyde University .\nMcCarthy T.M., Golicic S.L.,(2002),”Implementing Collaborative Forecasting to\nImprove Supply Chain Performance”, International Journal of Physical Distribution &\nLogistic Management, Vol.32, No. 6, pp.431-454, MCB University Press.\nMcLaren T, Head M.,Yuan Y.(2000),”Supply Chain Collaboration Alternatives:\nUnderstanding the Expected Cost and Benefits”, Internet Research: Electronic\nNetworking Applications and Policy, Vol.12, No.4, pp.348-364\nNolan, A (2002),”Public Policy on Enterprise Clusters and Networks” in Bartlett,\nW.,Bateman,M., and Vehovec, M.,(editors), Small Enterprise Development: Policies for\nSustainable growth in Soth-east Europe, Kluwer Academic Publisher\nO'Dell, C. and Grayson, J. (1999) “Knowledge transfer: discover your value proposition”\nBititci, Martinez, Albores and Parung, 2004, Creating and Managing Value in Collaborative Networks,\nInternational Journal of Physical Distribution and Logistics Management, issue 3\/4, 2004.\nStrategy and Leadership March\/April, 10-15.\nO’Neill, H. and Sackett, P., 1994, \"The Extended Manufacturing Enterprise paradigm\",\nManagement Decision, vol. 32, no. 8, pp. 42-49.\nParker, Hamieda (2000),”Inter-firm Collaboration and the New Product Development\nProcess”, Industrial Management & Data Systems, Vol.100, No 6, MCB University\nPress.\nPorter, M.E (1998),”Cluster and the New Economics of Competition”, Harvard Business\nReview, Nov-Dec, pp.77-90\nRudberg, Martin and Olhager, Jan, Manufacturing networks and supply chains: an\noperations strategy perspective. Omega Vol. 31; No. 1, 29-39.\nScheel, Carlos, (2002),”Knowledge Clusters of Technological Innovation Systems”,\nJournal of Knowledge Management, Vol.6, No.4, pp.356-367\nTreacy M. and Wiersema F. (1996). The disciplines of the market leaders. Publisher\nHarper Collins.\n"}