{"doi":"10.1046\/j.1365-8711.2001.04839.x","coreId":"66505","oai":"oai:dro.dur.ac.uk.OAI2:1339","identifiers":["oai:dro.dur.ac.uk.OAI2:1339","10.1046\/j.1365-8711.2001.04839.x"],"title":"The 2dF Galaxy Redshift survey : luminosity dependence of galaxy clustering.","authors":["Norberg, P.","Baugh, C. M.","Hawkins, E.","Maddox, S.","Peacock, J. A.","Cole, Shaun","Frenk, C. S.","Bland-Hawthorn, J.","Bridges, T.","Cannon, R.","Colless, M.","Collins, C.","Couch, W.","Dalton, G.","De Propris, R.","Driver, S. P.","Efstathiou, G.","Ellis, R. S.","Glazebrook, K.","Jackson, C.","Lahav, O.","Lewis, I.","Lumsden, S.","Madgwick, D.","Peterson, B. A.","Sutherland, W.","Taylor, K."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2001-11","abstract":"We investigate the dependence of the strength of galaxy clustering on intrinsic luminosity using the Anglo-Australian two degree field galaxy redshift survey (2dFGRS). The 2dFGRS is over an order of magnitude larger than previous redshift surveys used to address this issue. We measure the projected two-point correlation function of galaxies in a series of volume-limited samples. The projected correlation function is free from any distortion of the clustering pattern induced by peculiar motions and is well described by a power law in pair separation over the range   \\ud\n. The clustering of   \\ud\ngalaxies in real space is well-fitted by a correlation length   \\ud\nand power-law slope   \\ud\n. The clustering amplitude increases slowly with absolute magnitude for galaxies fainter than M*, but rises more strongly at higher luminosities. At low luminosities, our results agree with measurements from the Southern Sky Redshift Survey 2 by Benoist et al. However, we find a weaker dependence of clustering strength on luminosity at the highest luminosities. The correlation function amplitude increases by a factor of 4.0 between   \\ud\nand −22.5, and the most luminous galaxies are 3.0 times more strongly clustered than L* galaxies. The power-law slope of the correlation function shows remarkably little variation for samples spanning a factor of 20 in luminosity. Our measurements are in very good agreement with the predictions of the hierarchical galaxy formation models of Benson et al","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66505.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/1339\/1\/1339.pdf","pdfHashValue":"1494e66d0c4b7665954260dbe83da1304349f55b","publisher":"Blackwell","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:1339<\/identifier><datestamp>\n      2014-07-23T21:12:32Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        The 2dF Galaxy Redshift survey : luminosity dependence of galaxy clustering.<\/dc:title><dc:creator>\n        Norberg, P.<\/dc:creator><dc:creator>\n        Baugh, C. M.<\/dc:creator><dc:creator>\n        Hawkins, E.<\/dc:creator><dc:creator>\n        Maddox, S.<\/dc:creator><dc:creator>\n        Peacock, J. A.<\/dc:creator><dc:creator>\n        Cole, Shaun<\/dc:creator><dc:creator>\n        Frenk, C. S.<\/dc:creator><dc:creator>\n        Bland-Hawthorn, J.<\/dc:creator><dc:creator>\n        Bridges, T.<\/dc:creator><dc:creator>\n        Cannon, R.<\/dc:creator><dc:creator>\n        Colless, M.<\/dc:creator><dc:creator>\n        Collins, C.<\/dc:creator><dc:creator>\n        Couch, W.<\/dc:creator><dc:creator>\n        Dalton, G.<\/dc:creator><dc:creator>\n        De Propris, R.<\/dc:creator><dc:creator>\n        Driver, S. P.<\/dc:creator><dc:creator>\n        Efstathiou, G.<\/dc:creator><dc:creator>\n        Ellis, R. S.<\/dc:creator><dc:creator>\n        Glazebrook, K.<\/dc:creator><dc:creator>\n        Jackson, C.<\/dc:creator><dc:creator>\n        Lahav, O.<\/dc:creator><dc:creator>\n        Lewis, I.<\/dc:creator><dc:creator>\n        Lumsden, S.<\/dc:creator><dc:creator>\n        Madgwick, D.<\/dc:creator><dc:creator>\n        Peterson, B. A.<\/dc:creator><dc:creator>\n        Sutherland, W.<\/dc:creator><dc:creator>\n        Taylor, K.<\/dc:creator><dc:description>\n        We investigate the dependence of the strength of galaxy clustering on intrinsic luminosity using the Anglo-Australian two degree field galaxy redshift survey (2dFGRS). The 2dFGRS is over an order of magnitude larger than previous redshift surveys used to address this issue. We measure the projected two-point correlation function of galaxies in a series of volume-limited samples. The projected correlation function is free from any distortion of the clustering pattern induced by peculiar motions and is well described by a power law in pair separation over the range   \\ud\n. The clustering of   \\ud\ngalaxies in real space is well-fitted by a correlation length   \\ud\nand power-law slope   \\ud\n. The clustering amplitude increases slowly with absolute magnitude for galaxies fainter than M*, but rises more strongly at higher luminosities. At low luminosities, our results agree with measurements from the Southern Sky Redshift Survey 2 by Benoist et al. However, we find a weaker dependence of clustering strength on luminosity at the highest luminosities. The correlation function amplitude increases by a factor of 4.0 between   \\ud\nand −22.5, and the most luminous galaxies are 3.0 times more strongly clustered than L* galaxies. The power-law slope of the correlation function shows remarkably little variation for samples spanning a factor of 20 in luminosity. Our measurements are in very good agreement with the predictions of the hierarchical galaxy formation models of Benson et al.<\/dc:description><dc:subject>\n        Galaxies<\/dc:subject><dc:subject>\n         Clusters<\/dc:subject><dc:subject>\n         Formation<\/dc:subject><dc:subject>\n         Large-scale structure of Universe.<\/dc:subject><dc:publisher>\n        Blackwell<\/dc:publisher><dc:source>\n        Monthly notices of the Royal Astronomical Society, 2001, Vol.328(1), pp.64-70 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2001-11<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:1339<\/dc:identifier><dc:identifier>\n        issn:0035-8711<\/dc:identifier><dc:identifier>\n        issn: 1365-2966<\/dc:identifier><dc:identifier>\n        doi:10.1046\/j.1365-8711.2001.04839.x<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1339\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1046\/j.1365-8711.2001.04839.x<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1339\/1\/1339.pdf<\/dc:identifier><dc:rights>\n        The definitive version is available at www.blackwell-synergy.com<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1365-2966"," 1365-2966","0035-8711","issn:0035-8711"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2001,"topics":["Galaxies","Clusters","Formation","Large-scale structure of Universe."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n28 April 2008\nVersion of attached file:\nOther\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nNorberg, P. and Baugh, C. M. and Hawkins, E. and Maddox, S. and Peacock, J. A. and Cole, S. and Frenk, C.\nS. and Bland-Hawthorn, J. and Bridges, T. and Cannon, R. and Colless, M. and Collins, C. and Couch, W.\nand Dalton, G. and De Propris, R. and Driver, S. P. and Efstathiou, G. and Ellis, R. S. and Glazebrook, K.\nand Jackson, C. and Lahav, O. and Lewis, I. and Lumsden, S. and Madgwick, D. and Peterson, B. A. and\nSutherland, W. and Taylor, K. (2001) ’The 2dF Galaxy Redshift survey : luminosity dependence of galaxy\nclustering.’, Monthly notices of the Royal Astronomical Society., 328 (1). pp. 64-70.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1046\/j.1365-8711.2001.04839.x\nPublisher’s copyright statement:\nThe definitive version is available at www.blackwell-synergy.com\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 3042 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online 25 April 2008 \n \nCitation for item:  \nNorberg, P. and Baugh, C. M. and Hawkins, E. and Maddox, S. and Peacock, J. A. \nand Cole, S. and Frenk, C. S. and Bland-Hawthorn, J. and Bridges, T. and Cannon, R. \nand Colless, M. and Collins, C. and Couch, W. and Dalton, G. and De Propris, R. and \nDriver, S. P. and Efstathiou, G. and Ellis, R. S. and Glazebrook, K. and Jackson, C. \nand Lahav, O. and Lewis, I. and Lumsden, S. and Madgwick, D. and Peterson, B. A. \nand Sutherland, W. and Taylor, K. (2001) 'The 2dF Galaxy Redshift survey : luminosity \ndependence of galaxy clustering.' , Monthly notices of the Royal Astronomical Society., \n328 (1), pp. 64-70. \n \nDefinitive version available at:  \nhttp:\/\/dx.doi.org\/10.1046\/j.1365-8711.2001.04839.x \nar\nX\niv\n:a\nstr\no-\nph\n\/0\n10\n55\n00\nv2\n  1\n9 \nO\nct\n 2\n00\n1\nMon. Not. R. Astron. Soc. 000, 000–000 (0000) Printed 1 February 2008 (MN LATEX style file v1.4)\nThe 2dF Galaxy Redshift Survey: Luminosity dependence\nof galaxy clustering\nPeder Norberg1, Carlton M. Baugh1, Ed Hawkins2, Steve Maddox2, John A.\nPeacock3, Shaun Cole1, Carlos S. Frenk1, Joss Bland-Hawthorn4, Terry Bridges4,\nRussell Cannon4, Matthew Colless5, Chris Collins6, Warrick Couch7, Gavin\nDalton8, Roberto De Propris7, Simon P. Driver9, George Efstathiou10, Richard\nS. Ellis11, Karl Glazebrook12, Carole Jackson5, Ofer Lahav10, Ian Lewis4, Stu-\nart Lumsden13, Darren Madgwick10, Bruce A. Peterson5, Will Sutherland3, Keith\nTaylor4,11\n1Department of Physics, University of Durham, South Road, Durham DH1 3LE, UK\n2School of Physics & Astronomy, University of Nottingham, Nottingham NG7 2RD, UK\n3Institute for Astronomy, University of Edinburgh, Royal Observatory, Blackford Hill, Edinburgh EH9 3HJ, UK\n4Anglo-Australian Observatory, P.O. Box 296, Epping, NSW 2121, Australia\n5Research School of Astronomy & Astrophysics, The Australian National University, Weston Creek, ACT 2611, Australia\n6Astrophysics Research Institute, Liverpool John Moores University, Twelve Quays House, Birkenhead, L14 1LD, UK\n7Department of Astrophysics, University of New South Wales, Sydney, NSW 2052, Australia\n8Department of Physics, University of Oxford, Keble Road, Oxford OX1 3RH, UK\n9School of Physics and Astronomy, University of St Andrews, North Haugh, St Andrews, Fife, KY6 9SS, UK\n10Institute of Astronomy, University of Cambridge, Madingley Road, Cambridge CB3 0HA, UK\n11Department of Astronomy, California Institute of Technology, Pasadena, CA 91125, USA\n12Department of Physics & Astronomy, Johns Hopkins University, Baltimore, MD 21218-2686, USA\n13Department of Physics, University of Leeds, Woodhouse Lane, Leeds, LS2 9JT, UK\n1 February 2008\nABSTRACT\nWe investigate the dependence of the strength of galaxy clustering on intrinsic luminos-\nity using the Anglo-Australian two degree field galaxy redshift survey (2dFGRS). The\n2dFGRS is over an order of magnitude larger than previous redshift surveys used to\naddress this issue. We measure the projected two-point correlation function of galax-\nies in a series of volume-limited samples. The projected correlation function is free\nfrom any distortion of the clustering pattern induced by peculiar motions and is well\ndescribed by a power-law in pair separation over the range 0.1 < (r\/ h−1 Mpc) < 10.\nThe clustering of L∗ (MbJ − 5 log10 h = −19.7) galaxies in real space is well fit by a\ncorrelation length r0 = 4.9 ± 0.3 h\n−1 Mpc and power-law slope γ = 1.71 ± 0.06. The\nclustering amplitude increases slowly with absolute magnitude for galaxies fainter than\nM∗, but rises more strongly at higher luminosities. At low luminosities, our results\nagree with measurements from the SSRS2 by Benoist et al. However, we find a weaker\ndependence of clustering strength on luminosity at the highest luminosities. The cor-\nrelation function amplitude increases by a factor of 4.0 between MbJ −5 log10 h = −18\nand −22.5, and the most luminous galaxies are 3.0 times more strongly clustered than\nL∗ galaxies. The power-law slope of the correlation function shows remarkably little\nvariation for samples spanning a factor of 20 in luminosity. Our measurements are in\nvery good agreement with the predictions of the hierarchical galaxy formation models\nof Benson et al.\nKey words: methods: statistical - methods: numerical - large-scale structure of\nUniverse - galaxies: formation\n1 INTRODUCTION\nA major obstacle to be overcome by any successful theory of\nthe formation of large scale structure is the problem of how\ngalaxies trace the distribution of matter in the Universe.\nMeasurements of differential galaxy clustering as a function\nof colour (Willmer et al. 1998), morphological type (Davis\n& Geller 1976; Iovino et al. 1993) and selection passband\n(Peacock 1997; Hoyle et al. 1999) imply the existence of\nbiases between the distribution of galaxies and of mass.\nc© 0000 RAS\n2 Norberg et al.\nA generic prediction of hierarchical structure formation\nmodels is that rarer objects should be more strongly clus-\ntered than average (Davis et al. 1985; White et al. 1987).\nCorrespondingly, if more luminous galaxies are associated\nwith more massive haloes, then these galaxies are expected\nto exhibit stronger clustering than the galaxy population as\na whole (for the special case of bright galaxies at high red-\nshift, see for example Baugh et al. 1998; Governato et al.\n1998). However, the form of the dependence of the ampli-\ntude of galaxy clustering on luminosity remains controver-\nsial even after more than twenty years of constructing and\nanalysing redshift surveys of the local Universe. In the liter-\nature, claims of a dependence of galaxy clustering on lumi-\nnosity (e.g. Davis et al. 1988; Hamilton 1988; Maurogordato\n& Lachieze-Rey 1991; Park et al. 1994; Benoist et al. 1996;\nWillmer et al. 1998; Guzzo et al. 2000) have been made with\nsimilar regularity to claims of non-detections (e.g. Phillips\n& Shanks 1987; Hasegawa & Umemura 1993; Loveday et al.\n1995; Szapudi et al. 2000; Hawkins et al. 2001). Part of the\nreason for this disagreement is a mismatch in the range of\nluminosities and clustering length scales considered in ear-\nlier studies. However, the main problem with earlier work is\nthe small size of the redshift surveys analysed, both in terms\nof volume and number of galaxies. With previous surveys,\nthe dynamic range in luminosity for which clustering can\nbe measured reliably is limited, particularly when volume-\nlimited samples are used. Due to the small volumes probed,\nit has generally not been possible to compare the clustering\nof galaxies of different luminosity measured within the same\nvolume. These results have generally been affected by sam-\npling fluctuations that are difficult to quantify. This prob-\nlem is compounded by underestimation of the errors on the\nmeasured correlation functions and on the power-law fits\ntraditionally employed in this subject.\nIn this paper, we use the largest extant local survey,\nthe Anglo-Australian two degree field galaxy redshift survey\n(hereafter 2dFGRS), to address the issue of how clustering\ndepends upon galaxy luminosity. We describe the 2dFGRS\nand the construction of volume-limited samples in Section 2,\nand our estimation of the correlation function is described in\nSection 3. Our results for the real space correlation function\nare given in Section 4. We compare our results with those\nfrom previous studies and with the predictions of simulations\nof hierarchical galaxy formation in Section 5.\n2 THE DATA\n2.1 The 2dFGRS sample\nThe 2dFGRS is selected in the photometric bJ band from\nthe APM galaxy survey (Maddox et al. 1990a,b; 1996) and\nits subsequent extensions (Maddox et al. in preparation).\nThe survey is divided into two regions and covers approx-\nimately 2000 square degrees. The bulk of the solid angle\nof the survey is made up of two broad strips, one in the\nSouth Galactic Pole region (SGP) covering approximatively\n−37◦.5 < δ < −22◦.5, 21h40m < α < 3h30m and the other in\nthe direction of the North Galactic Pole (NGP), spanning\n−7◦.5 < δ < 2◦.5, 9h50m < α < 14h50m. In addition to these\ncontiguous regions, there are a number of circular 2-degree\nfields scattered pseudo-randomly over the full extent of the\nlow extinction regions of the southern APM galaxy survey.\nIn this paper, we use the redshifts obtained prior to January\n2001, over 160 000 in total. As we are mainly interested in\nmeasuring clustering out to separations of order 20 h−1 Mpc,\nwe do not include galaxies that lie in the random fields in\nour analysis.\nIn order to select an optimal sample for the measure-\nment of the two point correlation function, we apply a\nweighting scheme to objects in the 2dFGRS. A weight is\nassigned to each measured redshift based upon the redshift\ncompleteness mask, the construction of which is explained\nin Colless et al. (2001; see also Norberg et al. 2001, in prepa-\nration). We require a relatively high completeness in a given\ndirection on the sky, so that, in practice, our results are fairly\ninsensitive to the precise details of the weighting scheme. Ex-\ncluding areas below our completeness threshold (which arise\nmainly as a result of the tiling strategy adopted to make op-\ntimal use of telescope time, coupled with the fact that the\nsurvey is not yet finished), we estimate the effective solid\nangle used in the SGP region is ∼ 420 2◦, and in the NGP\n∼ 190 2◦.\n2.2 Constructing a volume-limited sample\nIn this paper, we analyse a series of volume-limited subsam-\nples drawn from the 2dFGRS. The advantage of this ap-\nproach is that the radial selection function is uniform, and\nthe only variations in the space density of galaxies within\neach volume are due to clustering. By contrast, in a flux-\nlimited survey, the galaxy number density is a strong func-\ntion of radial distance and this needs to be corrected for\nwhen measuring the clustering. The disadvantage of using\na volume-limited sample is that a large number of galaxies\nin the flux-limited survey do not satisfy the selection cuts\n(which are explained below). This is a serious problem for\nprevious surveys, but not for a survey the size of the 2dF-\nGRS. As we demonstrate in Section 4, the volume-limited\nsamples we analyse give robust clustering measurements and\ncontain over an order of magnitude more galaxies than sim-\nilar samples constructed from previous surveys (see Table\n1).\nThe construction of a volume-limited sample drawn\nfrom a flux-limited redshift survey requires a range of abso-\nlute magnitudes to be specified. Since a flux-limited survey\nhas both bright and faint apparent magnitude limits, the\nselected range of absolute magnitudes requires that both\na minimum (zmin) and a maximum (zmax) redshift cut be\napplied to the volume-limited sample. Thus, in principle,\na galaxy included in the volume-limited sample could be\ndisplaced to any redshift between zmin and zmax and still re-\nmain within the bright and faint apparent magnitude limits\nof the flux-limited survey.\nIn order to estimate the absolute magnitude of 2dFGRS\ngalaxies at redshift zero, it is necessary to apply corrections\nfor band shifting (k−correction) and evolution in the stellar\npopulations (e−correction). We adopt a global k+ e correc-\ntion given by k + e = 0.03z\/\n(\n0.01 + z4\n)\n, which is a good\nfit to the correction calculated for the bJ selected ESO Slice\nProject survey using population synthesis models (see Fig.\n1 of Zucca et al. 1997). This form for the k + e correction\ngives consistent luminosity functions for the 2dFGRS when\nthe survey is divided into redshift bins, indicating that it\nc© 0000 RAS, MNRAS 000, 000–000\nThe 2dF Galaxy Redshift Survey: Luminosity dependence of galaxy clustering 3\nTable 1. Properties of the combined NGP & SGP volume-limited sub-samples analysed. The second column gives the median magnitude\nof each sample. Columns 6 and 7 list the best fitting correlation length, r0, and power-law slope γ of the correlation function in real\nspace, fitted over the range 0.5 ≤ σ\/( h−1 Mpc) ≤ 10. Column 8 gives the value of A(γ), defined by eqn 4, evaluated for the best fitting\nvalue of γ.\nMag. range Median magnitude Ngal zmin zmax r0 γ A(γ)\nMbJ − 5 log10 h MbJ − 5 log10 h (h\n−1 Mpc)\n−18.0 − 18.5 −18.11 7061 0.010 0.086 4.14± 0.64 1.78± 0.10 3.75\n−18.5 − 19.0 −18.61 9382 0.013 0.104 4.43± 0.45 1.75± 0.08 3.80\n−19.0 − 19.5 −19.11 13690 0.016 0.126 4.75± 0.44 1.68± 0.08 4.14\n−19.5 − 20.0 −19.60 15123 0.020 0.152 4.92± 0.27 1.71± 0.06 4.01\n−20.0 − 20.5 −20.09 13029 0.025 0.182 5.46± 0.28 1.68± 0.06 4.14\n−20.5 − 21.0 −20.58 9114 0.031 0.220 6.49± 0.29 1.63± 0.06 4.39\n−21.0 − 21.5 −21.06 3644 0.039 0.270 7.58± 0.48 1.76± 0.09 3.82\n−18.0 − 19.0 −18.22 12594 0.013 0.086 4.06± 0.53 1.79± 0.09 3.72\n−19.0 − 20.0 −19.19 21874 0.020 0.126 4.75± 0.44 1.70± 0.08 4.06\n−20.0 − 21.0 −20.13 17383 0.031 0.182 5.65± 0.30 1.69± 0.06 4.10\n−21.0 − 22.0 −21.07 4013 0.048 0.270 8.12± 0.46 1.78± 0.12 3.75\n−21.5 − 22.5 −21.55 1002 0.059 0.280 9.38± 1.48 1.69± 0.15 4.10\nadequately accounts for the degree of evolution in galaxy\nluminosity over the lookback time spanned by the survey\n(Norberg et al. 2001, in preparation). Our results are un-\nchanged if we use the mean of the k corrections for different\nspectral types given by Madgwick et al. (2001, in prepara-\ntion). The values of zmin and zmax that define a volume-\nlimited sample drawn from the 2dFGRS vary slightly with\nposition on the sky. This is due to revisions made to the map\nof galactic extinction (Schlegel, Finkbeiner & Davis 1998)\nand to the CCD calibration of APM plate zero points since\nthe definition of the original input catalogue. Throughout\nthe paper, we adopt an Ω0 = 0.3, Λ0 = 0.7 cosmology to\nconvert redshift into comoving distance.\n3 ESTIMATING THE TWO-POINT\nCORRELATION FUNCTION\nThe galaxy correlation function is estimated on a two di-\nmensional grid of pair separations parallel (pi) and perpen-\ndicular (σ) to the line-of-sight. To estimate the mean density\nof pairs, a catalogue of unclustered points is generated with\nthe same angular selection and (zmin, zmax) values as the\ndata. The correlation function is estimated by\nξ =\nDD − 2DR+RR\nRR\n, (1)\nwhere DD, DR and RR are the suitably normalised number\nof weighted data-data, data-random and random-random\npairs respectively in each bin (Landy & Szalay 1993).\nContours of constant clustering amplitude in the red-\nshift space correlation function, ξ(σ, pi), are distorted as a\nresult of the peculiar motions of galaxies, as demonstrated\nfor the 2dFGRS by Peacock et al. (2001). On small scales,\nrandom motions inside virialised structures elongate the\nconstant-ξ contours in the pi direction, whereas on large\nscales, coherent flows flatten the contours. The latter ef-\nfect was measured clearly for the first time for galaxies us-\ning the 2dFGRS (Peacock et al. 2001). The dependence of\nthe redshift space correlation function on galaxy luminos-\nity is analysed in a separate paper (Hawkins et al. 2001, in\npreparation). In this paper, to simplify the interpretation,\nwe consider only clustering in real space, which we infer by\nprojecting the measured correlation function along the line-\nof-sight. We compute a dimensionless quantity, Ξ(σ)\/σ by\nintegrating over the measured ξ(σ, pi) grid (note that Ξ(σ)\nis sometimes referred to as w(rp) in the literature):\nΞ(σ)\nσ\n=\n1\nσ\n∫\n∞\n−∞\nξ(σ, pi)dpi. (2)\nIn practice, the integral converges by a pair separation of\npi = 75 h−1 Mpc. The projected correlation function can, in\nturn, be written as an integral over the spherically averaged\nreal space correlation function, ξ(r),\nΞ(σ)\nσ\n=\n2\nσ\n∫\n∞\nσ\nξ(r)\nrdr\n(r2 − σ2)1\/2\n, (3)\n(Davis & Peebles 1983). If the real space correlation func-\ntion is a power-law (which is a reasonable approximation for\nAPM galaxies out to separations around r ∼ 10 h−1 Mpc, see\ne.g. Baugh 1996), then\nΞ(σ)\nσ\n=\n(\nr0\nσ\n)γ Γ(1\/2)Γ([γ − 1]\/2)\nΓ(γ\/2)\n=\n(\nr0\nσ\n)γ\nA(γ), (4)\nwhere ξ(r) = (r0\/r)\nγ and r0 is the correlation length.\nPrevious studies have estimated the error on the mea-\nsured correlation function from the Poisson statistics of the\npair counts in each bin (Peebles 1980) or by bootstrap re-\nsampling of the data (e.g. Benoist et al. 1996). Since we\nstudy a range of samples corresponding to different luminos-\nity bins and also compare samples from different volumes,\nit is important to include an estimate of the sampling fluc-\ntuations in the error budget for the correlation function.\nThis we derive from analysis of 22 mock 2dFGRS cata-\nlogues constructed from the ΛCDM Hubble Volume dark\nmatter simulation, in the manner explained by Baugh et al.\n(2001, in preparation; see also Cole et al. 1998). In order\nto mimic the clustering of the 2dFGRS, a biasing scheme is\nemployed to select particles in the simulations with a prob-\nability which is a function of the final dark matter density\nfield, smoothed with a Gaussian filter (model 2 of Cole et al.\nc© 0000 RAS, MNRAS 000, 000–000\n4 Norberg et al.\nFigure 1. (a) The projected correlation function measured for\ngalaxies in three different absolute magnitude bins in the same\nvolume. The faintest sample contains 16 134 galaxies, the middle\nsample contains 6 186 galaxies and the brightest sample contains\n985 galaxies. For clarity, error bars are plotted only on the correla-\ntion function of galaxies with −18.5 ≥ MbJ − 5 log10 h ≥ −19.5.\n(b) A comparison of the correlation function of galaxies in the\nsame absolute magnitude bins but measured in different (al-\nthough not completely independent) volumes. The heavy lines\nshow results for galaxies with −18.5 ≥ MbJ − 5 log10 h ≥ −19.5\nand the light lines show results for a brighter bin with −20.5 ≥\nMbJ − 5 log10 h ≥ −21.5. In each case, the dashed line shows\nthe estimate from the optimal sample (see text) for the selected\nmagnitude bin, whilst the solid line shows an estimate of the\ncorrelation function from the volume analysed in Fig. 1(a). For\nthe −20.5 ≥ MbJ − 5 log10 h ≥ −21.5 magnitude bin, the opti-\nmal estimate is measured using 10 962 galaxies, which should be\ncontrasted with the 985 galaxies used to make the measurement\nshown by the light solid line, in a volume defined by a broader\nmagnitude bin.\n1998). The mock catalogues have the same clustering ampli-\ntude as galaxies in the flux-limited 2dFGRS and the same\nselection criteria that are applied to the data are used in\nthe construction of the mock surveys. The clustering ampli-\ntude in the mocks is independent of luminosity. The error\nbars that we plot on correlation functions measured from\nthe 2dFGRS are the rms found by averaging over the 22\nmock catalogues.\nFigure 2. The ratio of the projected correlation function of\ngalaxies in different magnitude slices to the projected correlation\nfunction of galaxies with −19 ≥MbJ −5 log10 h ≥ −20. Note that\nthe ratio is plotted on a linear scale, whilst the pair separation\nis on a log scale. The solid line shows the ratio for galaxies with\nabsolute magnitudes in the range −18 ≥MbJ − 5 log10 h ≥ −19,\nthe dotted line for −20 ≥MbJ − 5 log10 h ≥ −21 and the dashed\nline for −21 ≥MbJ −5 log10 h ≥ −22. For clarity, error bars have\nbeen omitted from the dotted line but these are comparable in\nsize with those plotted on the solid line.\n4 RESULTS\nWe first demonstrate the robustness of the approach of mea-\nsuring the correlation function in volume-limited samples.\nUnless stated otherwise, we have added the pair counts in\nthe NGP and SGP regions to compute correlation functions.\nIn Fig. 1(a), we show the correlation function of galaxies\nin three disjoint absolute magnitude bins measured in the\nsame volume. The sampling fluctuations are therefore virtu-\nally the same for each sub-sample, although the number of\ngalaxies varies between them. There is a clear difference in\nthe clustering amplitude of galaxies in the brightest absolute\nmagnitude bin. Next, we demonstrate that sampling fluctu-\nations are not important in a survey the size of the 2dF-\nGRS. We show, in Fig. 1(b), the correlation function in two\nfixed absolute magnitude bins measured in different volume-\nlimited sub-samples. Specifically, the dashed lines show the\ncorrelation function for the optimal volume-limited sample,\nappropriate to the selected absolute magnitude bin. Such a\nsample contains the maximum number of galaxies in that\nmagnitude bin. The different estimates of the correlation\nfunction agree within the errors.\nWe now focus attention on the series of volume-limited\nsubsamples covering the range −18 ≥ MbJ − 5 log10 h ≥\n−22.5, whose characteristics are listed in Table 1. The\nshape and amplitude of the projected correlation function\nin a selection of these samples is compared in Fig. 2 with\nthe correlation function of galaxies in the magnitude range\n−19 ≥ MbJ − 5 log10 h ≥ −20. The shape of the correla-\ntion function varies relatively little with the absolute mag-\nc© 0000 RAS, MNRAS 000, 000–000\nThe 2dF Galaxy Redshift Survey: Luminosity dependence of galaxy clustering 5\nFigure 3. (a) The correlation length in real space as a function of absolute magnitude. Results are shown for the SGP and NGP\nregions separately. The NGP points are plotted with an offset of 0.05 mag for clarity. Horizontal error bars on the SGP points indicate\nthe absolute magnitude range of each bin, and each point is plotted at the bin centre. In both cases, the brightest data points are for\ngalaxies in one magnitude wide bins. The solid line shows the predictions of the semi-analytic model of Benson et al. (2001), computed\nin a series of overlapping bins, each 0.5 magnitudes wide. The dotted curves show an estimate of the errors on this prediction, including\nthe sample variance expected for a volume equal to that of the N-body simulation used. (b) The real space correlation length estimated\ncombining pairs counts in the NGP and SGP (filled circles). The open symbols show a selection of recent data from other studies. The\ndata for surveys selected in the B-band have been corrected to the bJ band using the approximate relation MbJ = MB − 0.2. In order\nto compare samples defined by cumulative and differential magnitude bins, the data points are plotted at the median magnitude of each\nsample.\nnitude that defines the sample in contrast to the amplitude\nof the correlation function, which changes significantly for\nthe brightest magnitude slice. Another view of this trend\nis given in Fig. 3(a) where we plot the real space correla-\ntion length as a function of absolute magnitude. The best\nfitting values of the correlation length, r0, and power-law\nslope γ, are determined by applying eqn. 4 to the mea-\nsured correlation function over the pair separation range\n0.5 ≤ σ\/(h−1 Mpc) ≤ 10 and carrying out a χ2 minimisa-\ntion. This simple χ2 approach will not, however, give reliable\nestimates of the errors on the fitted parameters due to the\ncorrelation between the estimates at differing pair separa-\ntions. We use the mock 2dFGRS catalogues to estimate the\nerrors on the fitted parameters. In brief, the best fitting val-\nues of r0 and γ are found for each mock individually, using\nthe simple χ2 analysis. The estimated error bar is the rms\nscatter in the fitted parameters over the ensemble of mock\ncatalogues.\nIn Fig. 3(a), we plot the correlation lengths for the NGP\nand SGP regions separately. These independent estimates\nare in excellent agreement with one another. The slope of the\nbest fitting power-law correlation function, given in Table\n1, is similar for all the volume-limited samples considered.\nThe clustering amplitude increases slowly with luminosity\nfor galaxies fainter thanM∗ (where M∗ =MbJ −5 log10 h =\n−19.7, as found by Folkes et al. 1999), but rises strongly\nat higher luminosities. The correlation function amplitude\nincreases by a factor of 4.0 between MbJ − 5 log10 h = −18\nc© 0000 RAS, MNRAS 000, 000–000\n6 Norberg et al.\nFigure 4. The variation of the relative bias as a function of lu-\nminosity, using the clustering of L∗ galaxies as a reference point\n(see text for definition). The 2dFGRS points are plotted at the\nmedian magnitude of each sample and the horizontal bars show\nthe quartile magnitude range. The Benoist et al. (1996) points\nare taken from their Fig. 5 and are plotted at the median value of\nL\/L∗ for each sample. Note that the error bars on the Benoist et\nal. points are obtained by averaging over correlated bins in pair\nseparation. The curves shows parametric fits: the Benoist et al.\nmeasurements are well fitted by b\/b∗ = 0.7 + 0.3L\/L∗ (dashed\nline), whereas the 2dFGRS results suggest a more modest depen-\ndence on luminosity: b\/b∗ = 0.85 + 0.15L\/L∗ (solid line).\nand −22.5, and the most luminous galaxies are 3.0 times\nmore strongly clustered than M∗ galaxies.\n5 DISCUSSION\nThe volume-limited samples analysed in this paper contain\nover an order of magnitude more galaxies than previous\nstudies of the dependence of clustering on galaxy luminos-\nity, allowing a more accurate measurement of this effect than\nwas possible before. The sheer volume covered by our sam-\nples, 106 − 2× 107 h−3 Mpc3, ensures that sampling fluctu-\nations have little impact upon our results.\nWe compare the 2dFGRS results with a selection of re-\ncent measurements taken from the literature since 1995 in\nFig. 3(b). To compare samples defined by cumulative and\ndifferential magnitude bins, we plot the datapoints at the\nmedian magnitude for the sample, as computed using the\nSchechter function parameters for the 2dFGRS (Folkes et al.\n1999). The horizontal bars plotted on selected points show\nthe quartile range of the magnitude distribution in the sam-\nple. Benoist et al. (1996) analysed quasi volume-limited sam-\nples in the SGP region of the Southern Sky Redshift Survey\n2 (SSRS2), and found a sharp increase in the correlation\nlength for galaxies brighter than MB − 5 log10 h = −20.5.\nThe Benoist et al. correlation lengths are measured in red-\nshift space, although the authors report that a similar trend\nwith luminosity is seen in real space. Willmer et al. (1998)\nre-analysed the SSRS2 South using different volume limits\nand also measured clustering in the SSRS2 North, present-\ning fits for the correlation length in real and redshift space.\nIntriguingly, Willmer et al. find a larger correlation length\nin real space for galaxies with MB − 5 log10 h ∼ −20 than\nBenoist et al. find in redshift space. Moreover, the clear\ndisagreement between the results for the brightest galax-\nies analysed in SSRS2 North and South suggests that sam-\npling fluctuations are significant in a survey of this size and\nthat the errors on these points have been underestimated\n(as demonstrated in Fig. 4 of Benson et al. 2001). Loveday\net al. (1995) measured the clustering in real space by cross-\ncorrelating galaxies in the sparsely-sampled Stromlo\/APM\nredshift survey with galaxies in the parent catalogue. Galax-\nies were considered in three absolute magnitude bins. No\ndifference was found between the clustering amplitude of\nL∗ and super-L∗ galaxies. However, the median magnitude\nfor the most luminous sample considered by these authors\nis only 0.5 magnitudes brighter than M∗. The increase in\nclustering amplitude with luminosity is connected with a\nchange in the mix of morphological types with increasing\nluminosity. The mix of spectral types at the brightest abso-\nlute magnitudes is dominated by spectra characteristic of el-\nliptical galaxies, whereas spiral galaxies are more numerous\naround L∗ (Folkes et al. 1999; Cole et al. 2001; Madgwick et\nal. in preparation). The clustering of galaxies as a function\nof spectral type will be analysed in a separate paper.\nOur clustering results can be characterised in a concise\nway in terms of a relative bias parameter, b\/b∗, that gives the\namplitude of the correlation function relative to that of L∗\ngalaxies (whereM∗ =MbJ−5 log10 h = −19.7). The relative\nbias between the correlation functions of galaxies of different\nluminosity is assumed to be constant for pair separations\nspanned by the r0 values listed in Table 1 (see also Fig.\n2). The relative bias is then defined by b\/b∗ = (r0\/r\n∗\n0)\nγ\/2,\nwhere we take r∗0 = 4.9 ± 0.3 h\n−1 Mpc from Table 1 and\nuse γ = 1.7. The 2dFGRS results are shown by the filled\nsymbols in Fig. 4 and are well fitted by the relation b\/b∗ =\n0.85 + 0.15L\/L∗ . The 2dFGRS data suggest a significantly\nweaker dependence of the relative bias on luminosity than\nthe Benoist et al. data, which follow the relation b\/b∗ =\n0.7 + 0.3L\/L∗ (Peacock et al. 2001). (The parametric fit\nto the Benoist et al. measurements was used by Peacock\net al. 2001 to estimate the parameter β = Ω0.6\/b for L∗\ngalaxies in the 2dFGRS. Using the above fit to the 2dFGRS\nmeasurements changes the inferred value for β by less than\n1σ to β = 0.49± 0.08.)\nHierarchical models of galaxy formation predict that\nbright galaxies should be more strongly clustered than faint\ngalaxies (e.g. White et al. 1987; Kauffmann, Nusser & Stein-\nmetz 1997). This generic prediction arises because bright\ngalaxies are expected to occupy more massive dark matter\nhaloes and these haloes are more strongly clustered than the\noverall distribution of dark matter. The trend of clustering\namplitude with luminosity measured for 2dFGRS galaxies is\nin very good agreement with the predictions of a simulation\nof hierarchical galaxy formation taken from Fig. 4 of Benson\net al. (2001), reproduced as the solid line in Fig. 3(a). In the\nBenson et al. semi-analytic model, the input parameters are\nset in order to reproduce a subset of local galaxy data, with\nmost emphasis given to the field galaxy luminosity function\n(see Cole et al. 2000). No reference is made to clustering\nc© 0000 RAS, MNRAS 000, 000–000\nThe 2dF Galaxy Redshift Survey: Luminosity dependence of galaxy clustering 7\ndata in setting the model parameters. In a ΛCDM cosmol-\nogy, Benson et al. (2000a,b) find excellent agreement with\nthe real space correlation function measured for galaxies in\nthe APM survey by Baugh (1996). It is remarkable that the\nsame model, without any readjustment of parameters, also\nreproduces the dependence of clustering amplitude on lumi-\nnosity exhibited by the 2dFGRS in Fig. 3(a).\nACKNOWLEDGMENTS\nThe 2dFGRS is being carried out using the 2 degree field\nfacility on the 3.9m AngloAustralian Telescope (AAT). We\nthank all those involved in the smooth running and contin-\nued success of the 2dF and the AAT. We thank the referee,\nDr. L. Guzzo, for producing a speedy and helpful report,\nand also Andrew Benson for communicating an electronic\nversion of his model predictions. PN is supported by the\nSwiss National Science Foundation and an ORS award and\nCMB acknowledges receipt of a Royal Society University\nResearch Fellowship. This work was supported in part by a\nPPARC rolling grant at Durham.\nREFERENCES\nBaugh, C.M., 1996, MNRAS, 280, 267.\nBaugh, C.M., Cole, S., Frenk, C.S., Lacey, C.G., 1998, ApJ, 498,\n504.\nBenoist, C., Maurogordato, S., Da Costa, L.N., Cappi, A., Scha-\neffer, R., 1996, ApJ, 472, 452.\nBenson, A.J., Baugh, C.M., Cole, S., Frenk, C.S., Lacey, C.G.,\n2000a, MNRAS, 316, 107.\nBenson, A.J., Cole, S., Frenk, C.S., Baugh, C.M., Lacey, C.G.,\n2000b, MNRAS, 311, 793.\nBenson, A.J., Frenk, C.S., Baugh, C.M., Cole, S., Lacey, C.G.,\n2001, MNRAS submitted, astro-ph\/0103092.\nCole, S., Hatton, S., Weinberg, D.H., Frenk, C.S., 1998, MNRAS,\n300, 945.\nCole, S., Lacey, C.G., Baugh, C.M., Frenk, C.S., 2000, MNRAS,\n319, 168.\nCole, S., et al. (the 2dFGRS team), 2001, MNRAS, in press.\nColless, M., et al. (the 2dFGRS team), 2001, MNRAS, submitted,\nastro-ph\/0106498.\nDavis, M., Geller, M.J., 1976, ApJ, 208, 13.\nDavis, M., Efstathiou, G., Frenk, C.S., White, S.D.M., 1985, ApJ,\n292, 371.\nDavis, M., Meiksin, A., Strauss, M.A., Da Costa, L.N., Yahil, A.,\n1988, ApJ, 33, L9.\nDavis, M., Peebles, P.J.E., 1983, ApJ, 267, 465.\nFolkes, S., et al. (the 2dFGRS team), 1999, MNRAS, 308, 459.\nGovernato, F., Baugh, C.M., Frenk, C.S., Cole, S., Lacey, C.G.,\nQuinn, T., Stadel, J., 1998, Nature, 392, 359.\nGuzzo, L., et al. , 2000, Astron. & Astroph., 355, 1.\nHamilton, A.J.S., 1988, ApJ, 331, L59.\nHasegawa, T., Umemura, M., 1993, MNRAS, 263, 191.\nHawkins, E., Maddox, S.J., Branchini, E., Saunders, W., 2001,\nMNRAS, 325, 589.\nHoyle, F., Baugh, C.M., Shanks, T., Ratcliffe, A., 1999, MNRAS,\n309, 659.\nIovino, A., Giovanelli, R., Haynes, M., Chincarini, G., Guzzo, L.,\n1993, MNRAS, 265, 21.\nKauffmann, G., Nusser, A., Steinmetz, M., 1997, MNRAS, 286,\n795.\nLandy, S.D., Szalay, A.S., 1993, ApJ, 412, 64.\nLoveday, J., Maddox, S.J., Efstathiou, G., Peterson, B.A., 1995,\nApJ, 442, 457.\nMaddox, S.J., Efstathiou, G., Sutherland, W.J., Loveday, J.,\n1990a, MNRAS 243, 692\nMaddox, S.J., Efstathiou, G., Sutherland, W.J., Loveday, J.,\n1990b, MNRAS 246, 433\nMaddox, S.J., Efstathiou, G., Sutherland, W.J., Loveday, J., 1996,\nMNRAS 283, 1227\nMaurogordato, S., Lachieze-Rey, M., 1991, ApJ, 369, 30.\nPark, C., Vogeley, M.S., Geller, M.J, Huchra, J.P., 1994, ApJ,\n431, 569\nPeacock, J.A., 1997, MNRAS, 284, 885.\nPeacock, J.A., et al. (the 2dFGRS team), 2001, Nature, 410, 169.\nPeebles, P.J.E., 1980, The Large Scale Structure of the Universe,\nPrinceton.\nPhillips, S., Shanks, T., 1987, MNRAS, 229, 621.\nSchlegel, D.J., Finkbeiner, D.P., Davis, M., 1998, ApJ, 500, 525.\nSzapudi, I., Branchini, E., Frenk, C.S., Maddox, S., Saunders, W.,\n2000, MNRAS, 318, L45.\nWhite, S.D.M., Davis, M., Efstathiou, G., Frenk, C.S., 1987, Na-\nture, 330, 351.\nWillmer, C.N.A., Da Costa, L.N., Pellegrini, P.S., 1998, AJ, 115,\n869.\nZucca, E., et al. 1997, Astron. & Astroph., 326, 477.\nc© 0000 RAS, MNRAS 000, 000–000\n"}