{"doi":"10.1088\/0954-3899","coreId":"113647","oai":"oai:epubs.surrey.ac.uk:7555","identifiers":["oai:epubs.surrey.ac.uk:7555","10.1088\/0954-3899"],"title":"Long-range interactions and artificial poles","authors":["Stott, JO","Thompson, IJ","Tostevin, JA"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"1999-11","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"IOP PUBLISHING LTD","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:7555<\/identifier><datestamp>\n      2017-10-31T14:11:28Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:70687973696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/7555\/<\/dc:relation><dc:title>\n        Long-range interactions and artificial poles<\/dc:title><dc:creator>\n        Stott, JO<\/dc:creator><dc:creator>\n        Thompson, IJ<\/dc:creator><dc:creator>\n        Tostevin, JA<\/dc:creator><dc:publisher>\n        IOP PUBLISHING LTD<\/dc:publisher><dc:date>\n        1999-11<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        attached<\/dc:rights><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/7555\/2\/jos.pdf<\/dc:identifier><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/7555\/4\/licence.txt<\/dc:identifier><dc:identifier>\n          Stott, JO, Thompson, IJ and Tostevin, JA  (1999) Long-range interactions and artificial poles   J PHYS G NUCL PARTIC, 25 (11).  pp. 2189-2195.      <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1088\/0954-3899\/25\/11\/302<\/dc:relation><dc:relation>\n        10.1088\/0954-3899\/25\/11\/302<\/dc:relation><dc:language>\n        EN<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/7555\/","http:\/\/dx.doi.org\/10.1088\/0954-3899\/25\/11\/302","10.1088\/0954-3899\/25\/11\/302"],"year":1999,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Long-range interactions and arti\fcial poles\nJ. O. Stott, I. J. Thompson, J. A. Tostevin1\n1Department of Physics, School of Physical Sciences, University of Surrey,\nGuildford, Surrey GU2 5XH, United Kingdom\n(Dated: November 5, 2011)\nAbstract\nThe structure of the three-body continuum of the 6He nucleus within the hyperspherical harmonic\ncalculation scheme has been the subject of extensive study. An approximate treatment of the\nlong-range couplings inherent in such models gives rise to unphysical poles in the deduced S-\nmatrix at complex energies. We consider here a simple two-channel example, which includes\nlong-range interactions, and demonstrates the existence of these arti\fcial S-matrix poles. This\nis also illustrated in a physical context by considering the extreme adiabatic approximation of\nthe hyperspherical harmonics technique for 6He. A correct treatment of the long-range (1=\u001a\u0015)\nbehaviour of the channel potentials is shown to remove the arti\fcial poles from the physically\nsigni\fcant region of the complex energy plane.\nPACS numbers: PACS numbers: 11.55.Bq, 25.70.Ef, 21.45.+v\n1\nI. INTRODUCTION\nExperiments with neutron-rich nuclear beams have con\frmed that 6He has a pronounced\ntwo-neutron halo which extends to large radii. This structure has been successfully modelled\nas a three-body system, with a 0+ ground state, consisting of an alpha particle core and two\nneutrons forming the halo [1]. Recently, attention has focussed on the excited continuum\nstructure of 6He, which has been probed experimentally using breakup reactions [2]. The\nlow energy 6He 2+ resonance at about 1.8 MeV excitation [3, 4], predicted by three-body\nmodels, has been experimentally observed however there has been no experimental signature\nof the higher 2+ resonance predicted at about 3 MeV. Resonance positions for 0+ and 1\u0000\nspin parity states have also been predicted [3], however these predictions have been criticized\nas being unphysical [5].\nTo compare experiment and theory it is important to correctly determine the position\nof the continuum resonances as predicted by theoretical models, according to the strict\nde\fnition that a resonance corresponds to a pole of the S-matrix at a complex energy [6].\nOur interest concerns long-range interactions which if truncated give rise to unphysical\npoles at complex energy. These are distinct from the redundant poles of Ma [7, 8] found in\nconnection with the short-range exponential potential, and which are located on the positive\nimaginary k axis, but are not bound states. A fuller discussion may be found in reference [9].\nWithin the hyperspherical harmonic calculation scheme the three-body Hamiltonians\nintroduce long-range radial couplings. It has been shown in [10] that a radial truncation of\nsuch couplings gives rise to unphysical poles of the S-matrix, which were referred to in that\narticle as arti\fcial poles. In that work, integrations were carried out to large radii and so\nthese unphysical poles were located very close to the origin of the complex energy plane.\nIn the case of 6He, our interest is in using the R-matrix method to solve the large coupled\nchannels sets in an interior region with a modest internal boundary radius. In this case we\nshow that the arti\fcial poles are located in the physically interesting part of the complex\nenergy plane where we would wish to locate resonance poles.\nIn this work we \frst consider a simpler two-channel example where arti\fcial poles are\nshown to exist if long-range interactions are truncated. These are shown to be removed when\nthe long-range nature of the interaction is correctly incorporated. The physical implications\nare illustrated by considering the extreme adiabatic approximation of the hyperspherical\n2\nharmonics technique in the case of the 6He system.\nII. METHOD OF SOLUTION\nThe expansion of the quantum mechanical three-body wave function in terms of the\nhyperspherical harmonic basis functions [4] reduces the Schrodinger equation to a system\nof coupled equations in one radial variable \u001a, the hyper-radius, which is a measure of the\noverall size of the three-body system.\nIn this coordinate system the hyper-radial Schrodinger equations take the familiar form\nof a system of coupled two-body radial equations. The main di\u000berence is that, in the three-\nbody case, the centrifugal barrier is (K + 3=2)(K + 5=2)=\u001a2 where K is the hyperharmonic\nquantum number. Furthermore, the hyper-radial potentials are of a long-range nature,\nbehaving asymptotically as inverse powers of \u001a, despite the two-body interactions being of\na short-range nature.\nThe R-matrix method [11] has been found to provide a numerically stable method for the\nnumerical solution of these radial coupled channels equations with advantages over direct\nnumerical integration of the system. This R-matrix method provides the means to evaluate\nthe S-matrix at a boundary (\u001a = rm) by matching to incoming and outgoing spherical\nwaves. If it is assumed that all interactions can be neglected beyond the matching radius,\nthen the functions used in the matching are simply diagonal Riccati-Hankel functions which\nare solutions of the free equation.\nThe internal R-matrix solution is most e\u000bective when using not too large values for the\nboundary radius rm, otherwise large basis sets are required. We will show that it is then\nimportant to incorporate the long-range nature of the diagonal and coupling interactions\ncorrectly, and the matching must be done to solutions of the coupled radial equations in the\nasymptotic region (\u001a > rm) where the interactions behave as sums of inverse powers of \u001a.\nThese solutions can be expressed as asymptotic series expansions in inverse powers of \u001a so\nit is advantageous to evaluate these at as large a \u001a as possible for faster convergence.\nFor their evaluation at complex energy this would suggest that complex coordinate rota-\ntion (or exterior rotation) [12{14] is necessary for the numerical calculation of the S-matrix.\nHowever we will show that it is still possible to calculate the S-matrix accurately over an\nappreciable region of the complex energy plane without using any form of coordinate rota-\n3\ntion, and this enables the use of boundary radii appropriate to the R-matrix procedure. In\nthis case however it is important to include the long-range nature of the potentials when\nmatching at the R-matrix boundary.\nIII. COUPLED CHANNELS POLES IN THE ADIABATIC LIMIT\nWe know from [10] that one-channel solutions, calculated with radial truncation, have\narti\fcial poles. Arti\fcial poles will also be present for any many channel calculation if long-\nrange couplings are truncated. This fact is most easily demonstrated by considering a simple\ntwo-channel case.\nIn the limit of degenerate channel energies E1 = E2 = E and equal diagonal and o\u000b-\ndiagonal interactions, V11 = V22 = V and V12 = V21 = v, it is well known that the two\ncoupled equations\n(E \u0000 T \u0000 V )\u001e1 = v\u001e2\n(E \u0000 T \u0000 V )\u001e2 = v\u001e1 (1)\ncan be decoupled. The (2\u00022) S-matrix, with elements Sij representing the coe\u000ecient of the\noutgoing wave in channel i when there is a unit incoming wave in channel j, are obtained\nby adding and subtracting the Eqs. 1 giving rise to the two uncoupled equations for wave\nfunctions  1 = (\u001e1 + \u001e2)=2 and  2 = (\u001e1 \u0000 \u001e2)=2.\n(E \u0000 T \u0000 [V + v]) 1 = 0\n(E \u0000 T \u0000 [V \u0000 v]) 2 = 0: (2)\nIt follows that the diagonal and o\u000b-diagonal S-matrix elements (S1 +S2)=2 and (S1\u0000S2)=2\nare linear combinations of the uncoupled one-channel S-matrices S1 and S2.\nIt may be further concluded that, in this adiabatic limit, any poles introduced by the\ntruncation of V or v will be shared by the coupled channels set, which will see poles resulting\nfrom each truncated channel. This general feature is also to be expected in the non-adiabatic\ncase.\n4\nIV. INCLUSION OF LONG-RANGE COUPLINGS\nGiven the above it is clearly important to include the long-range portion of the potential,\nwhile, for the use of the R-matrix interior solution, it is important to avoid numerically\nintegrating to a large distance. Both these constraints can be satis\fed, if we modify the\nfunctions that are used in the matching procedure. Instead of using the free incoming and\noutgoing waves solutions, functions must be used that are the actual solutions of the coupled\nequations in the presence of inverse power couplings. Various methods exist to generate such\nfunctions. In the following example the method of Rosel, as proposed in [15] for Coulomb\nexcitation calculations, is applied. We assume the interactions behave asymptotically as a\nsum of inverse cubic and quintic powers of r. This asymptotic behaviour is that displayed by\nthe hyper-radial couplings in the three body model. For a simple demonstration, a numerical\nexample is considered where they are included in a two-channel case.\nThe radial Schrodinger equation is shown in Eq. 3 where x = kr and the factor 2m=\u0016h2\nhas been absorbed into the asymptotic potential strengths w\n[3]\njm and w\n[5]\njm,\u0012\nd2\ndx2\n+ 1\u0000 lj(lj + 1)\nx2\n\u0013\n j(x) =\nX\nm\nkw\n[3]\njm m(x)\nx3\n+\nX\nm\nk3w\n[5]\njm m(x)\nx5\n: (3)\nTo perform the matching a complete set of coupled outgoing wave solutions can then be\nde\fned\n tj(x) = a\nt\nj(x) exp[i(x\u0000 \u0019lj=2)] ; (4)\nwhere the subscript labels the channel in which the outgoing waves appear as x ! 1 and\nthe superscript labels the channel in which there was an incoming wave. The asymptotic\nbehaviour of atj(x) is such that a\nt\nj(x)! \u000ejt so that\n tj(x) \u0000! \u000ejt exp[i(x\u0000 \u0019lj=2)] ; (5)\nas the Eqs. 3 decouple as x!1. The functions atj(x) satisfy the coupled equations\u0012\nd2\ndx2\n+ 2i\nd\ndx\n\u0000 lj(lj + 1)\nx2\n\u0013\natj(x) =\nX\nm\nkw\n[3]\njma\nt\nm(x)\nx3\n+\nX\nm\nk3w\n[5]\njma\nt\nm(x)\nx5\n(6)\nand are chosen to have the form\natj(x) =\n1X\nn=0\nA\n(n)\njt\nxn\n: (7)\n5\nWhen substituted into Eq. 6, the recurrence relation\nA\n(n+4)\njt =\n[(n+ 3)(n+ 4)\u0000 lj(lj + 1)]A(n+3)jt \u0000\nP\nm kw\n[3]\njmA\n(n+2)\nmt \u0000\nP\nm k\n3w\n[5]\njmA\n(n)\nmt\n2i(n+ 4)\n(8)\nis obtained. The asymptotic behaviour of Eq. 5 is ensured if A\n(0)\njt = \u000ejt. The values A\n(1)\njt ,\nA\n(2)\njt and A\n(3)\njt are obtained by equating the coe\u000ecients of like powers of x in Eq. 6, giving\nA\n(1)\njt =\ni\n2\nlj(lj + 1)A\n(0)\njt ;\nA\n(2)\njt =\n[2\u0000 lj(lj + 1)]A(1)jt \u0000\nP\nm kw\n[3]\njmA\n(0)\nmt\n4i\n;\nA\n(3)\njt =\n[6\u0000 lj(lj + 1)]A(2)jt \u0000\nP\nm kw\n[3]\njmA\n(1)\nmt\n6i\n: (9)\nThe recurrence relation for the coupled incoming solutions is the complex conjugate of\nEqs. 8 and 9.\nWhen summed directly these series have the usual properties of asymptotic series in that\nthe partial sums converge towards the correct result and then diverge. Pad\u0013e acceleration\nis therefore used. Particularly suitable when dealing with matrices is the \u000f-algorithm [16]\nwhich is used here. This allows the acceleration to be applied to the whole matrix of partial\nsums, as opposed to each individual matrix element. Furthermore a matrix inversion can be\navoided at each step of the iteration by the use of the pseudo inverse of the matrix.\nOur model two-channel problem is solved with diagonal and o\u000b-diagonal potential ele-\nments having the form\nVij(r) = V\n[3]\nij =(a\n[3]\nij + r\n3) + V\n[5]\nij =(a\n[5]\nij + r\n5) : (10)\nIf the potential strengths are too weak to form a bound state in either channel, then it is\nexpected that the two physical poles corresponding to the \frst bound states will be present\nin the fourth quadrant of the complex k-plane.\nHowever, if the couplings are truncated at 20 fm, six poles are found, as shown in\n\fgure 1 (the \flled circles on the dashed line). The diagonal potential strengths are:\nV\n[3]\n11 = \u0000160; V [5]11 = \u000010; V [3]22 = \u0000150; V [5]22 = \u000010 and a[3]ii = a[5]ii = 2, i = 1; 2 .\nThe o\u000b-diagonal strengths are given by, V\n[3]\n12 = \u00002; V [5]12 = \u000013, a[3]12 = 1:5; a[5]12 = 1:0, with\nthe potential matrix being symmetric.\nThe e\u000bect of including the asymptotic region of the potential can be seen by introducing a\nmultiplicative factor \u000b to alter the asymptotic strengths w\n[3]\njm and w\n[5]\njm used when evaluating\n6\nthe asymptotic solutions for matching. This is introduced so that as \u000b tends to zero,\nthe coupled asymptotic solutions tend to the solutions of the free equation, the Riccati-\nHankel functions, and the poles of the S-matrix are found in the same positions as when\nthe interactions are truncated. As \u000b tends to unity the full asymptotic interaction strength\nis included. It is seen that in this limit two of the poles move to \fxed positions while the\nother four arti\fcial poles continue to move away from the real k axis.\nV. THE EXTREME ADIABATIC APPROXIMATION\nThe adiabatic approximation, applied to the hyperspherical harmonics technique [17],\nprovides a means of reducing the coupled system of hyper-radial equations to a single second-\norder di\u000berential equation. This is achieved by diagonalizing the e\u000bective potential part of\nthe Hamiltonian for \fxed values of the hyper-radius. The wave function is then expanded\nin this basis set and, under the extreme adiabatic approximation, the Schrodinger equation\nis reduced to a single uncoupled equation, where the potential used is the eigenvalue of the\ne\u000bective potential. This approximation provides a lower limit to the binding energy, and\nis therefore a useful starting point for locating resonance poles for the three-body problem\nwithout resorting to the full and more complicated calculations.\nThe phase shifts for the lowest two eigen-potentials for the 0+ state of 6He are shown in\n\fgure 2 (i). We have seen that there is a reasonable agreement with the appropriate phase\nshifts for the full coupled problem. Furthermore the lowest eigen-potential, giving rise to\nthe repulsive phase shift, has a bound state at \u00001:1 MeV in reasonable agreement with the\nvalue \u00001:0 MeV obtained in the full coupled channels calculation.\nThe phase shifts are shown (thick lines) when the full long-range interaction is included\nby matching at 25 fm to solutions of the radial equation when it is assumed that the potential\nbehaves asymptotically as inverse cubic and quintic radial powers as discussed in section IV.\nFor comparison the phase shifts when the interaction is truncated at 25 fm are also shown\n(thin lines). For the K = 0 eigen-potential there is only a signi\fcant deviation of the phase\nshifts at low energy, while for the K = 2 eigen-potential a signi\fcant deviation between the\nphase shifts is seen at all energies indicating that the correct asymptotic treatment is more\nimportant in this case.\nHowever the truncation has a more profound implication on the position of the resonance\n7\npole as shown in \fgure 2 (ii). Here the pole positions are shown for the cases when the\nlong-range interaction is included and when it is truncated. Four poles are found when the\nlong-range interaction is truncated (\flled circles on the dashed line), while only one is found\nat k = 0:23 \u0000 0:12i fm\u00001 if it is included (\flled square). This corresponds to a position in\nthe complex energy plane of Er = 0:79\u0000 1:20i MeV. This result is consistent with the pole\nposition located when exterior rotation is used on the analytical region of the potential. In\nthis case the integration can be carried out to a larger distance and the matching done using\nRiccati-Hankel functions.\nIf a multiplicative factor \u0015 is introduced to strengthen the interaction, then for \u0015 = 1:5\nit can be seen from \fgure 2 (ii) that the position of the pole does not signi\fcantly depend\non the asymptotic portion of the potential. However as \u0015 is reduced to 1.0 the e\u000bect of the\nlong-range behaviour is seen to become more signi\fcant as the pole moves further from the\nreal k axis when the full interaction is included.\nFurthermore, the three arti\fcial poles (present when the interaction is truncated) are\nseen to be removed from the physically signi\fcant region of the complex plane when the\nasymptotic scaling parameter \u000b = 1 incorporates the full interaction.\nAs \u000b tends to unity, the three arti\fcial poles are seen to move away from the real k axis,\ntheir positions moving rapidly for \u000b \u0019 1. The pole that corresponds to the \frst bound state,\nwhen \u0015 is increased, does not continue to move from the real axis but converges to a \fxed\nposition for \u000b = 1.\nVI. CONCLUSION\nArti\fcial S-matrix poles are created in a single channel calculation when long-range inter-\nactions are truncated. They are also present in any coupled channels calculation if long-range\ncouplings are truncated. Including correctly the long-range nature of the interaction is shown\nto remove these arti\fcial poles from the physically interesting region of the complex energy\nplane.\nThe extreme adiabatic approximation applied to the 0+ state of 6He shows an over-binding\nof the ground state. If this approximation has the same implications for the position of the\nresonance poles, then a full coupled channels calculation for the 0+ state may be expected\nto produce a resonance pole with a lower limit on the width of about 2 MeV. The results of\n8\nthe full three-body calculations will be presented in a subsequent publication.\nAcknowledgments\nThe \fnancial support of the United Kingdom Engineering and Physical Sciences Research\nCouncil (EPSRC) in the form of Grant No. GR\/J95867 and a research studentship (for\nJ.O.S) is gratefully acknowledged.\n[1] M. V. Zhukov, B. V. Danilin, D. V. Fedorov, J. M. Bang, I. J. Thompson and J.S.Vaagen\nPhys. Rep. 231, 151 (1993)\n[2] T. Aumann et al. Phys. Rev. C. 59, 1252 (1999)\n[3] A. Cobis, D. V. Fedorov and A. Jensen, Phys. Rev. Lett. 79 (1997) 2411\n[4] B. V. Danilin, I. J. Thompson, J. S. Vaagen and M. V. Zhukov, Nucl. Phys. A632 (1998) 383\n[5] A. Cs\u0013ot\u0013o, nucl-th\/9807016\n[6] V. I. Kukulin, V. M. Krasnopol'sky, and J. Hor\u0013a\u0014cek, Theory of Resonances Principles and\nApplications (Kluwer Academic Publishers, Dordrecht, 1989)\n[7] S. T. Ma, Phys. Rev. 69, 668, (1946)\n[8] S. T. Ma, Phys. Rev. 71, 195, (1947)\n[9] T. Wu and T. Ohmura, Quantum Theory of Scattering (Prentice-Hall, London, 1962), p. 94\n\u000b.\n[10] V. V. Pupyshev and S. A. Rakityansky Z. Phys. A348 (1994) 227\n[11] A. M. Lane and R. G. Thomas, Rev. Mod. Phys. 30, 257 (1958)\n[12] B. R. Junker, Adv. At. Mol. Phys. 18, 207 (1981)\n[13] W. P. Reinhardt, Ann. Rev. Phys Chem. 33, 223 (1982)\n[14] Y. K. Ho, Phys. Rep. 99, 1 (1983)\n[15] F. Rosel, J.Phys. G. 3, 613 (1977)\n[16] P. R. Graves-Morris, Pad\u0013e Approximants (The Institute of Physics, London, 1973)\n[17] S. Sanyal, Few-Body Systems 4, 141 (1988)\n9\n0.00 0.05 0.10 0.15 0.20 0.25 0.30 0.35 0.40\nRe(k)\n-0.30\n-0.25\n-0.20\n-0.15\n-0.10\n-0.05\nIm\n(k)\nα=0\nα=0.75\nα=0.95\nα=0.98\nα=0.99\nFIG. 1: A two-channel example using the values: \u0016h2=(2m) = 23:223 MeV fm2, and l = 1 for both\nchannels. The arti\fcial poles continue to move away from the real k axis, as the full interaction is\nincluded, while only the two physical poles remain for \u000b = 1.\n10\n0.0 1.0 2.0 3.0 4.0 5.0 6.0\nE (MeV)\n-40\n-20\n0\n20\n40\n60\n80\n100\n120\n140\nPh\nas\ne \nsh\nift\n (d\neg\n) K=0 with truncation\nK=0 without truncation\nK=2 with truncation\nK=2 without truncation\n(i)\n0.00 0.10 0.20 0.30 0.40 0.50\nRe(k)\n-0.25\n-0.20\n-0.15\n-0.10\n-0.05\n0.00\nIm\n(k)\nα=0\nα=0.25\nα=0.5\nα=0.75\nα=0.9\nα=0.95\nα=0.99\nα=0 λ=1.5 to 1.0\nα=1.0 λ=1.5 to 1.0\nα=1 λ=1\n(ii)\nFIG. 2: (i) Phase shifts for the lowest two eigen-potentials, K = 0 and K = 2, for the 6He 0+\nstate when truncating the potentials at 25 fm and also when including the appropriate asymptotic\nform. (ii) A multiplicative factor \u0015 is used to strengthen the K = 2 eigen-potential. The pole\nposition corresponding to the \frst bound state is shown when the asymptotic part of the potential\nis neglected (open circle) and included (open squares). The removal of the arti\fcial poles is also\nshown, where the multiplicative factor \u000b is used to scale the asymptotic coe\u000ecients.\n11\n"}