{"doi":"10.1029\/2006JF000560","coreId":"15452","oai":"oai:dro.dur.ac.uk.OAI2:7244","identifiers":["oai:dro.dur.ac.uk.OAI2:7244","10.1029\/2006JF000560"],"title":"Transient landscapes at fault tips.","authors":["Densmore, A.L.","Gupta, S.","Allen, P.A.","Dawers, N.H."],"enrichments":{"references":[{"id":1008678,"title":"A healing-reloading feedback control on the growth rate of seismogenic faults,","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":1008018,"title":"Alluvial fan processes and forms, in Geomorphology of Desert Environments,","authors":[],"date":"1994","doi":null,"raw":null,"cites":null},{"id":1016811,"title":"Channel network source representation using digital elevation models,","authors":[],"date":"1993","doi":null,"raw":null,"cites":null},{"id":1008679,"title":"Constraining slip rates and spacings for active normal faults,","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":1008014,"title":"Constraints on North American plate velocity from the Yellowstone hotspot deformation field,","authors":[],"date":"1994","doi":null,"raw":null,"cites":null},{"id":1008677,"title":"Deformed streams reveal growth and linkage of a normal fault array in the Canyonlands graben,","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":1008022,"title":"Fault growth by segment linkage: An explanation for scatter in maximum displacement and trace length data from the Canyonlands Graben of SE","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":1016816,"title":"Fault scaling relationships, deformation rates and seismic hazards: An example from the Lazio-Abruzzo Apennines, central Italy,","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":1008682,"title":"Fault tip displacement gradients and process zone dimensions,","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":1008685,"title":"Footwall topographic development during continental extension,","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":1008020,"title":"Geomorphology of segmented alluvial fans in western Fresno County,","authors":[],"date":"1964","doi":null,"raw":null,"cites":null},{"id":1008684,"title":"Landscape evolution at extensional relay zones,","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":1016815,"title":"Late Quaternary sedimentation on the Leidy Creek fan, Nevada-California: Geomorphic responses to climate change,","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":1008021,"title":"Lateral displacement variation and lateral tip geometry of normal faults in the Canyonlands National Park,","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":1016817,"title":"Neogene evolution of Birch Creek Valley near Lone Pine, Idaho, in Geologic Field Tours of Western Wyoming and Parts of Adjacent Idaho,","authors":[],"date":"1990","doi":null,"raw":null,"cites":null},{"id":1008015,"title":"Overlapping faults, intrabasin highs, and the growth of normal faults,","authors":[],"date":"1994","doi":null,"raw":null,"cites":null},{"id":1016812,"title":"Patterns of displacement along large normal faults: Implications for basin evolution and fault propagation, based on examples from East Africa,","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":1016814,"title":"Pleistocene episodes of alluvialgravel deposition, southeastern Idaho, in Cenozoic Geology of Idaho,","authors":[],"date":"1982","doi":null,"raw":null,"cites":null},{"id":1016809,"title":"Progressive localization of strain during the evolution of a normal fault population,","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":1016813,"title":"Quaternary history of faulting on the Arco segment of the Lost River fault, central Idaho,","authors":[],"date":"1985","doi":null,"raw":null,"cites":null},{"id":1008019,"title":"Recent debris-flow processes and resultant form and facies of the Dolomite alluvial fan,","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":1008680,"title":"Scholz (1992a), Growth of faults by accumulation of seismic slip,","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":1008681,"title":"Scholz (1992b), Displacement-length scaling relationship for faults: Data synthesis and discussion,","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":1008017,"title":"Sedimentology of the debris flow-dominated Warm Spring Canyon alluvial fan,","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":1016810,"title":"Slope distributions, threshold hillslopes, and steady-state topography,","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":1008016,"title":"The growth of fault-bounded tilt blocks,","authors":[],"date":"1993","doi":null,"raw":null,"cites":null},{"id":1008676,"title":"The growth of normal faults by segment linkage,","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":1016808,"title":"The propagation and linkage of normal faults: Insights from the Strathspey-Brent-Statfjord fault array, northern North Sea,","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":1008683,"title":"The role of fault interaction and linkage in controlling syn-rift stratigraphic sequences: Late Jurassic, Statfjord East area, northern North Sea,","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":1008013,"title":"Time scales of tectonic landscapes and their sediment routing systems,","authors":[],"date":"2007","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-09-01","abstract":"Fault growth produces patterns of displacement and slip rate that are highly variable in both space and time. This transience is most pronounced near fault tips, where along‐strike displacement gradients vary in time as the fault array lengthens. We use a set of statistical and field observations to quantify the response of catchments and their associated fans in three large normal fault arrays to transient patterns of displacement and slip rate. Catchments near the fault tips show distinct scaling of channel slope with drainage area compared with catchments near the strike center. This scaling becomes uniform beyond about ∼10 km from the fault tips and is therefore like footwall relief, largely decoupled from the fault displacement profile. The estimated catchment response times to a change in slip rate also vary between fault tips and strike center. The response times for tip catchments are much longer than the inferred time since fault activity began, indicating that they are unlikely to be in equilibrium with the current fault displacement field. This disequilibrium, combined with the decoupling of slope‐area scaling from displacement, indicates that landscapes are most sensitive to fault activity near fault tips. Active faults characterized by along‐strike variation in slip rate thus provide excellent opportunities to explore the transient response of landscapes to tectonic forcing","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/15452.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/7244\/1\/7244.pdf","pdfHashValue":"2b332ce52386f5fa94dea1efb0f858fc48ab6c7e","publisher":"American Geophysical Union","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:7244<\/identifier><datestamp>\n      2016-04-20T09:13:36Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Transient landscapes at fault tips.<\/dc:title><dc:creator>\n        Densmore, A.L.<\/dc:creator><dc:creator>\n        Gupta, S.<\/dc:creator><dc:creator>\n        Allen, P.A.<\/dc:creator><dc:creator>\n        Dawers, N.H.<\/dc:creator><dc:description>\n        Fault growth produces patterns of displacement and slip rate that are highly variable in both space and time. This transience is most pronounced near fault tips, where along‐strike displacement gradients vary in time as the fault array lengthens. We use a set of statistical and field observations to quantify the response of catchments and their associated fans in three large normal fault arrays to transient patterns of displacement and slip rate. Catchments near the fault tips show distinct scaling of channel slope with drainage area compared with catchments near the strike center. This scaling becomes uniform beyond about ∼10 km from the fault tips and is therefore like footwall relief, largely decoupled from the fault displacement profile. The estimated catchment response times to a change in slip rate also vary between fault tips and strike center. The response times for tip catchments are much longer than the inferred time since fault activity began, indicating that they are unlikely to be in equilibrium with the current fault displacement field. This disequilibrium, combined with the decoupling of slope‐area scaling from displacement, indicates that landscapes are most sensitive to fault activity near fault tips. Active faults characterized by along‐strike variation in slip rate thus provide excellent opportunities to explore the transient response of landscapes to tectonic forcing.<\/dc:description><dc:publisher>\n        American Geophysical Union<\/dc:publisher><dc:source>\n        Journal of geophysical research : earth surface, 2007, Vol.112(F3), pp.F03S08 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2007-09-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:7244<\/dc:identifier><dc:identifier>\n        issn:0148-0227<\/dc:identifier><dc:identifier>\n        doi:10.1029\/2006JF000560<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7244\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1029\/2006JF000560<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7244\/1\/7244.pdf<\/dc:identifier><dc:rights>\n        © 2007 American Geophysical Union. Densmore, A. L., S. Gupta, P. A. Allen, and N. H. Dawers (2007), Transient landscapes at fault tips, Journal of geophysical research., 112, F03S08, .1029\/2006JF000560. To view the published open abstract, go to http:\/\/dx.doi.org and enter the DOI.<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0148-0227","0148-0227"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n11 August 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nDensmore, A. L. and Gupta, S. and Allen, P. A. and Dawers, N. H. (2007) ’Transient landscapes at fault\ntips.’, Journal of geophysical research : earth surface., 112 . F03S08.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1029\/2006JF000560\nPublisher’s copyright statement:\n2007 American Geophysical Union. Densmore, A. L., S. Gupta, P. A. Allen, and N. H. Dawers (2007), Transient\nlandscapes at fault tips, Journal of geophysical research., 112, F03S08, .1029\/2006JF000560. To view the published\nopen abstract, go to http:\/\/dx.doi.org and enter the DOI.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nTransient landscapes at fault tips\nAlexander L. Densmore,1,2 Sanjeev Gupta,3 Philip A. Allen,3 and Nancye H. Dawers4\nReceived 5 May 2006; revised 16 August 2006; accepted 19 November 2006; published 27 March 2007.\n[1] Fault growth produces patterns of displacement and slip rate that are highly variable\nin both space and time. This transience is most pronounced near fault tips, where along-\nstrike displacement gradients vary in time as the fault array lengthens. We use a set of\nstatistical and field observations to quantify the response of catchments and their\nassociated fans in three large normal fault arrays to transient patterns of displacement and\nslip rate. Catchments near the fault tips show distinct scaling of channel slope with\ndrainage area compared with catchments near the strike center. This scaling becomes\nuniform beyond about \u000210 km from the fault tips and is therefore like footwall relief,\nlargely decoupled from the fault displacement profile. The estimated catchment response\ntimes to a change in slip rate also vary between fault tips and strike center. The response\ntimes for tip catchments are much longer than the inferred time since fault activity\nbegan, indicating that they are unlikely to be in equilibrium with the current fault\ndisplacement field. This disequilibrium, combined with the decoupling of slope-area\nscaling from displacement, indicates that landscapes are most sensitive to fault activity\nnear fault tips. Active faults characterized by along-strike variation in slip rate thus provide\nexcellent opportunities to explore the transient response of landscapes to tectonic forcing.\nCitation: Densmore, A. L., S. Gupta, P. A. Allen, and N. H. Dawers (2007), Transient landscapes at fault tips, J. Geophys. Res., 112,\nF03S08, doi:10.1029\/2006JF000560.\n1. Introduction\n[2] Faults grow by a combination of tip propagation and\nlinkage of adjacent fault segments. During this growth\nprocess, both displacement and slip rate will vary signifi-\ncantly in space and time, particularly in the areas surround-\ning the fault tips. Fault tips are thus ideal places to study the\neffects of a transient deformation field on processes of\nerosion and sediment transport, and on the development\nof the overlying landscape. Because displacement scales\nwith fault length, and because the processes of fault growth\nlead to predictable spatial patterns of fault slip and slip rate\n[e.g., Dawers et al., 1993; Cowie, 1998; Gupta and Scholz,\n2000; Manighetti et al., 2001; Cowie and Roberts, 2001;\nRoberts et al., 2004], we can use fault tips to assess the\ndetailed response of the topography to both spatial and\ntemporal variations in fault activity.\n[3] In previous work, we have argued that the footwall\nmountain ranges associated with crustal-scale normal faults\naccumulate relief in a predictable fashion as the faults grow\nlaterally and accumulate displacement. Densmore et al.\n[2004] showed that topographic relief on a series of normal\nfault footwalls in the western United States increases from\nzero at the fault tips to a maximum value at approximately\n15 km from the tip, after which it remains relatively uniform\nalong strike over the remainder of the footwall. Because\nalong-strike fault displacement profiles do not show this\nuniformity [Densmore et al., 2005], we inferred that foot-\nwall relief was externally limited and was decoupled from\nthe displacement profile away from the fault tips. This is a\nkey result, because it implies that the topography over most\nof the range is insensitive to the details of the fault\ndeformation field, and that attempts to extract tectonic\ninformation from the landscape should be focused on the\nfault tips. Densmore et al. [2005] demonstrated that at least\npart of the external control on footwall relief was imposed\nby the width of the mountain range, and thus by the avail-\nable space for drainage basin development. This hypothe-\nsis depends critically on the existence of a geomorphic\nlimit to hillslope and channel gradients [e.g., Schmidt and\nMontgomery, 1995] that occurs within the 15 km tip zone;\notherwise, relief could continue to increase with increasing\nfault displacement, even if range width remained uniform.\n[4] In this paper, we quantify the effects of along-strike\nvariations in displacement and slip rate on catchment mor-\nphology, response time, and erosional process. We first\nreview the important implications of fault growth processes\nfor the spatial and temporal variations in displacement and\nslip rate at fault tips. These variations provide a tectonic\nframework within which the landscape, and the sediment\nrouting systems that comprise it, must evolve. We then use\nthis to understand the landscape response to transient tectonic\nactivity at the well-defined southern tips of the Beaverhead,\nLemhi and Lost River faults in the western United States.\nThese fault tips were chosen because (1) along-strike varia-\nJOURNAL OF GEOPHYSICAL RESEARCH, VOL. 112, F03S08, doi:10.1029\/2006JF000560, 2007\nClick\nHere\nfor\nFull\nArticle\n1Institute of Geology, Department of Earth Sciences, Eidgeno¨ssische\nTechnische Hochschule Zu¨rich, Zurich, Switzerland.\n2Now at Department of Geography, Durham University, Durham, UK.\n3Department of Earth Science and Engineering, Imperial College\nLondon, London, UK.\n4Department of Earth and Environmental Sciences, Tulane University,\nNew Orleans, Louisiana, USA.\nCopyright 2007 by the American Geophysical Union.\n0148-0227\/07\/2006JF000560$09.00\nF03S08 1 of 16\ntions in displacements are relatively well-constrained by a\nvariety of geologic markers, (2) at least some slip rate\ninformation exists for all three faults, although it is sparsely\ndistributed, and (3) previous studies have shown predictable\npatterns of relief accumulation in all three footwalls\n[Densmore et al., 2004, 2005]. We demonstrate that increas-\ning displacement and slip rate away from the fault tips drives\na transition to geomorphically limited slopes within the\nfootwall. This transition is visible both statistically, through\nthe achievement of roughly uniform scaling of catchment\nslope with drainage area, and in the field, as a change in the\ndominant sediment transport process. Finally, we evaluate the\ntransience of the resulting fault tip topography by comparing\nthe estimated response times of fault tip catchments to the\ntimescales of fault growth. We find that catchment response\ntimes are long compared with the timescales involved in tip\npropagation or segment linkage, implying that catchments in\nequilibrium with the tectonic displacement field are highly\nunlikely near fault tips. The along-strike variation in dis-\nplacement and slip rate on active faults thus provides a\nwell-defined, transient boundary condition for exploring\nlandscape response to tectonic activity.\n2. Fault Growth and the Tectonic Geometry of\nFault Tips\n[5] Previous studies of fault growth help to constrain the\npatterns and evolution of deformation at fault tips, and\nprovide a tectonic framework for landscape development.\nHere we briefly highlight the key observations and model\npredictions at fault tips that are important for sediment\nrouting systems.\n2.1. How Do Faults Grow?\n[6] As they accumulate strain, faults grow in length by a\nvariety of physical processes. These can be broadly divided\ninto two categories: lateral tip propagation and fault linkage.\nFault growth by lateral propagation is typically thought to\nproceed by a concentration of stress and inelastic deforma-\ntion within finite ‘‘damage zones’’ adjacent to the fault tips\n[e.g., Cowie and Scholz, 1992a; Cartwright and Mansfield,\n1998; Cowie and Shipton, 1998; Scholz, 2002]. Tip prop-\nagation occurs when the stress at the tip exceeds the yield\nstrength of the rock. This may occur quasi-continuously, or\nin small ‘‘jumps’’ caused by the formation of new faults\nwithin the damage zone and their incorporation into the\ngrowing array [e.g., Cartwright et al., 1996]. Lateral prop-\nagation will produce a displacement field that is strongly\ntransient, such that the time since the inception of faulting\nwill decrease to zero at the fault tips (Figure 1).\n[7] Fault growth by segment linkage occurs when two or\nmore isolated faults begin to interact as they propagate\ntoward one another (Figure 1). This interaction sets up a\npositive feedback, such that slip on one fault increases the\nstresses on, and drives rupture of, the other [e.g., Cowie,\n1998; Gupta and Scholz, 2000]. Continued interaction\ninhibits propagation of en echelon segments past one\nanother and the faults eventually become mechanically\nlinked through a relay zone in the area of en echelon\noverlap [Cartwright et al., 1995; Cowie, 1998; Gupta and\nScholz, 2000]. Two key differences between this process\nand tip propagation are that, in the case of growth by\nlinkage (1) the tip of the growing fault array moves in\nrapid, discrete jumps as new segments are incorporated, but\nis subsequently ‘‘pinned’’ once the segment is incorporated,\nand (2) slip rates increase dramatically during interaction\nand linkage (Figure 1), particularly within the relay zone\nbetween the interacting segments [Gupta et al., 1998; Gupta\nand Scholz, 2000; Commins et al., 2005]. Because the array\nlengthens in discrete linkage events, the time since the onset\nof rapid fault slip (the ‘‘initiation time’’ for landscape\nFigure 1. Schematic diagram illustrating end-member processes of fault growth. Figures 1 (top) and\n1 (middle) show along-strike profiles of fault displacement and footwall elevation, respectively. Times 1–\n3 are successive stages in fault array history. Dashed line in Figure 1 (middle) is uniform footwall relief,\nwhile gray box shows the tip zone of increasing relief [Densmore et al., 2004]. (a) Fault growth by tip\npropagation. As fault grows, the time since the onset of faulting decreases toward the fault tips. Along-\nstrike length of tip zone therefore corresponds to the time required to reach uniform relief. (b) Fault growth\nby segment linkage. Individual displacement profiles of interacting en echelon segments merge during fault\nlinkage. Note that this implies along-strike variation in slip rate (Figure 1, bottom). Along-strike length of\ntip zone corresponds to a particular value of slip rate, which may trigger a threshold in erosional process.\nF03S08 DENSMORE ET AL.: TRANSIENT LANDSCAPES AT FAULT TIPS\n2 of 16\nF03S08\ndevelopment in the footwall) will be approximately uniform\nalong each segment [e.g., McLeod et al., 2000]. Growth by\nlinkage becomes more important through time in the growth\nof a fault array, as tip propagation is increasingly inhibited\nby segment interactions and less space is available for the\nnucleation of new faults [e.g., Scholz, 2002].\n[8] These end-members are not mutually exclusive, and\nboth processes are likely to be important in the growth of\ncrustal-scale fault arrays. The relevant issues for the devel-\nopment of landscapes are how rapidly the fault tip migrates,\nhow the onset time of rapid fault slip varies along strike, and\nhow much the spatial patterns of displacement and slip rate\nvary, particularly over timescales that are long enough for\nsignificant erosion and sediment transport to occur, i.e., on\nthe order of 104 to 106 years.\n2.2. Displacement and Slip Rate Variations at Fault\nTips\n[9] The growth processes outlined above yield a charac-\nteristic fingerprint in terms of along-strike patterns of\ndisplacement and slip rate. Near fault tips, displacement\nvaries approximately linearly along strike over a wide range\nof fault lengths [Cowie and Scholz, 1992b; Dawers et al.,\n1993; Cartwright and Mansfield, 1998; Cowie and Shipton,\n1998; Shipton and Cowie, 2001; Scholz and Lawler, 2004;\nManighetti et al., 2004; Commins et al., 2005]. The mag-\nnitude of the along-strike displacement gradient appears to\ndepend largely on lithology or rock shear strength [Cowie\nand Scholz, 1992a; Scholz and Lawler, 2004] and the degree\nof interaction with adjacent faults [Willemse, 1997; Gupta\nand Scholz, 2000]. Stronger rocks and more interaction lead\nto higher along-strike gradients, because both effects act to\ninhibit lateral fault propagation [Scholz and Lawler, 2004;\nManighetti et al., 2001]. If a fault has a symmetric,\ntriangular displacement profile, the along-strike gradient\nshould be half of the displacement length ratio, which is\ntypically\u000210\u00031 to 10\u00033 [Schlische et al., 1996]. Asymmetric\ndisplacement profiles can lead to larger gradients; for exam-\nple, Scholz and Lawler [2004] found gradients for crustal-\nscale faults of 0.5–0.05, with a mean of about 8 \u0004 10\u00032.\n[10] Geometrical considerations predict that fault slip\nrates must also vary along strike, from zero at the fault tips\nto a maximum value near the center [Cowie and Roberts,\n2001]. For fault arrays composed of multiple segments, this\nslip rate enhancement is likely due to loading of central fault\nsegments by failure of neighboring segments [Cowie, 1998;\nCowie and Roberts, 2001]. In fact, along-strike variation in\nslip rate is required to explain the similar displacement\nlength ratios on single-segment and multisegment faults\n[Cowie and Roberts, 2001]. Rapid growth of a fault array\nby segment linkage leads to a fault array which may be\nsomewhat ‘‘underdisplaced’’ for its length [Cartwright et\nal., 1995], and subsequent post linkage displacement accu-\nmulation is both rapid [Gupta et al., 1998] and varies in\nmagnitude along strike, from highest near the strike center\nto zero at the tips [McLeod et al., 2000; Commins et al.,\n2005]. For single-segment faults, higher slip rates are also\npredicted near the fault center, because (1) slip in single\nearthquakes varies along strike, and (2) slip length ratios for\nsingle earthquakes (\u000210\u00035 to 10\u00036 [Scholz, 2002]) are\nseveral orders of magnitude lower than those for cumulative\ndisplacement length ratios (\u000210\u00031 to 10\u00033 [Schlische et al.,\n1996]).\n[11] Testing these hypotheses has been hampered by the\nfact that there are few slip rate data that are (1) well-\ndistributed along fault strike and (2) span timescales of\nmore than 1–2 seismic cycles.McLeod et al. [2000] showed\nthat throw rates near the center of the Strathspey-Brent-\nStatfjord fault in the northern North Sea increased by a\nfactor of \u00022 following fault linkage, but that rates near the\nfault tips were unaffected by the linkage event. Cowie and\nRoberts [2001] argued that slip rate data from the Wasatch\nfault and the Gulf of Corinth are compatible with a simple\nlinear model of slip rate enhancement in the central seg-\nments of a fault array. Roberts et al. [2004] showed that the\nsame model can explain a large data set of late Quaternary\nslip rates from interacting faults in the Italian Apennines. As\nfar as we are aware, detailed measurements of slip rate\nvariations in space or time near a fault tip are lacking.\n[12] To first order, then, fault growth models predict that\nslip rates should (1) increase through time at any one point\nas the fault array grows and (2) increase toward the center of\nthe fault or fault array at any one time. The magnitude of the\nslip rate increase with time will depend on position, with the\ntips of the fault array being relatively unaffected by linkage\nevents elsewhere in the array [McLeod et al., 2000].\n2.3. Timescales of Fault Growth\n[13] The timescales over which crustal-scale faults are\nassembled are poorly constrained, but are probably propor-\ntional to the regional strain rate [Cowie, 1998]. Because\nlateral growth by linkage is likely to be rapid compared to\nincremental tip propagation, faults may propagate slowly at\nfirst, then rapidly as segments are incorporated into the\narray, then slowly again as the array is consolidated and slip\nrate increases [Gupta and Scholz, 2000]. Some studies have\nsuggested that a growing fault may reach its final length\nearly in the rift phase, perhaps in as little as 1–3 Myr [e.g.,\nMorley, 1999; Gawthorpe et al., 2003]. Meyer et al. [2002]\nargued that most lateral propagation in a fault population in\nthe Timor Sea occurred in the first 1–2 Myr of rifting, and\nthat fault tips were relatively fixed during subsequent\ndisplacement accumulation. In contrast, McLeod et al.\n[2000] showed that the main phase of linkage of the\n100 km long Strathspey-Brent-Statfjord fault took \u00023–\n4 Myr, but that this phase began about 10 Myr after rift\ninitiation. Considering only the tip region of this same fault\nsystem, Dawers and Underhill [2000] speculated that the\ntimescale of increasing slip rate on one of the distal seg-\nments, and incorporation of that segment into the growing\nfault array, was \u00025 Myr. Given the lack of well-constrained\nexamples and the likely differences between extensional\nsettings, it seems safe to say that crustal-scale fault growth\nis likely to occur over periods of 1–10 Myr, and that we\nshould expect temporal variations in patterns of displace-\nment and slip rate over timescales that are at least this long.\n3. Study Area\n[14] The Lost River, Lemhi, and Beaverhead faults are\nlarge fault arrays in the northeastern Basin and Range\nProvince, and are composed of multiple, linked segments.\nAll three faults are 140–150 km in length with 5–6 km of\nF03S08 DENSMORE ET AL.: TRANSIENT LANDSCAPES AT FAULT TIPS\n3 of 16\nF03S08\ntotal displacement [Densmore et al., 2004, 2005]. We focus\non the southeastern 80 km of all three faults (Figure 2),\nwhere footwall relief decays to zero and normal slip on the\nfaults passes laterally into damage zones and extensional\nfracturing in the Snake River Plain [Kuntz et al., 2002].\nAlong-strike throw profiles for the faults were compiled by\nDensmore et al. [2005] based on a variety of published\nsources [e.g., Rodgers and Anders, 1990; Janecke et al.,\n1991; Anders et al., 1993]. Roughly uniform tilts on region-\nally exposed volcanic rocks show that all three faults grew\nto their present lengths by about 6 Ma [Anders et al., 1993;\nAnders, 1994; Anders and Schlische, 1994]. Fault growth\nappears to have been dominantly by linkage, and in some\ncases preexisting faults were incorporated directly into the\ngrowing arrays [Janecke, 1993; Janecke et al., 2001]. Slip\nrates are poorly known, and are generally defined only since\nlate Pleistocene or (rarely) Holocene time from regional\ncorrelations and limited paleoseismologic investigations\n(slip rate data and references are available by fault and\nsegment at http:\/\/qfaults.cr.usgs.gov). The highest late Qua-\nternary slip rates (up to 0.3 mm yr\u00031) and evidence for\nHolocene earthquakes are found on the central segments of\nall three faults. The tip segments, by contrast, have low slip\nrates (0.12 mm yr\u00031 for the Lost River fault [Pierce, 1985]\nand 0.1–0.2 mm yr\u00031 for the Lemhi fault) and no evidence\nof Holocene activity.\n4. Methods\n4.1. Stream Profiles and Catchment Slope-Area\nScaling\n[15] To understand the landscape response to along-strike\nvariations in displacement and slip rate, we examined the\npatterns of catchment slope-area scaling in each footwall. If\nfootwall relief is geomorphically limited as displacement\nand slip rate increase away from fault tips, as hypothesized\nby Densmore et al. [2005], then catchments near the fault\ntips should be morphologically distinct from those in the\ncentral part of the footwall, and slope-area scaling provides\na straightforward means of quantifying that morphology.\nPlots of contributing drainage area versus local slope in\nchannelized landscapes often reveal two distinct regimes of\nscaling behavior: relatively invariant slopes at low drainage\nareas and an inverse relationship between area and slope\nabove a critical drainage area, typically approximated by a\npower law\nS ¼ ksA\u0003q ð1Þ\nwhere S is local slope [dimensionless], A is drainage area\n[m2], ks is a constant called the steepness index [m\n2q], and q\nis a dimensionless constant called the concavity index\n[Tarboton et al., 1992;Montgomery and Foufoula-Georgiou,\n1993;Montgomery, 2001; Stock and Dietrich, 2003;Dietrich\net al., 2003]. Sklar and Dietrich [1998] noted that the indices\nin equation (1) may covary, and proposed a normalized\nform of the relationship:\nS ¼ Sr A\nAr\n\u0002 \u0003\u0003q\nð2Þ\nwhere Sr is the slope [dimensionless] at a reference area\nAr [m\n2], typically chosen to fall near the median of the data.\nThe constant Sr thus represents a normalized steepness\nwhose spatial variation can be interpreted in terms of\ndifferences in incision rate, lithology, and hydraulic\ngeometry [Sklar and Dietrich, 1998]. Alternatively, a\nnormalized steepness index ksn may be calculated by fixing\nthe value of q to some regional reference value [Snyder et\nal., 2000; Wobus et al., 2006]. A number of authors have\nused Sr or ksn to evaluate spatial variations in rock uplift rate\n[e.g., Lague et al., 2000; Snyder et al., 2000; Kirby and\nWhipple, 2001; Kobor and Roering, 2004; Wobus et al.,\n2006]. Here we are interested primarily in whether the\nchannel slopes show evidence of along-strike uniformity, in\nother words, whether or not they are decoupled, like relief,\nfrom the fault displacement profiles.\n[16] We defined the trunk streams of catchments that\nreach the main drainage divide in the three footwalls by\nextracting the locus of points of maximum contributing\ndrainage area from a 10 m USGS digital elevation model,\nstarting from the catchment mouth and extending to the\ndivide. Trunk stream data points were resampled to a\nconstant elevation spacing of 5 m to ensure equal weighting\nof each elevation interval [Snyder et al., 2000; Wobus et al.,\nFigure 2. Location map of the Lost River, Lemhi, and\nBeaverhead faults in east central Idaho, western United\nStates. Background is a Landsat 7 panchromatic image.\nBlack lines show the active traces of the three faults. The\nanalyses in this paper are limited to the catchments in the\nsouthernmost 80 km of each footwall, shown in white. SRP,\nSnake River Plain.\nF03S08 DENSMORE ET AL.: TRANSIENT LANDSCAPES AT FAULT TIPS\n4 of 16\nF03S08\n2006]. Local slopes for each point were calculated with a\ntwo-sided finite difference approximation. We fit a power\nlaw (equation (2)) to the area-slope data beyond a specified\nminimum value of drainage area, identified both by visual\nexamination of slope-area plots and by successively pruning\nthe smallest catchment areas and refitting the power law\nuntil a consistent fit was achieved [Stock and Dietrich,\n2003]. We conservatively chose a minimum area of 105 m2\nfor the power law fit, and a reference area Ar of 10\n6 m2.\nNote that this excludes the smallest tip catchments from the\nanalysis because their areas are less than 105 m2; however,\nthis represents only 5 of the 138 divide-forming catchments\nthat we analyzed. Normalized steepness indices ksn were\ncalculated from equation (1) by taking a reference concavity\nqref equal to the mean concavity index for each footwall.\n4.2. Catchment Response Times\n[17] Whipple and Tucker [1999] showed that the com-\nmonly used stream power model of bedrock river erosion\ncan be used to derive an analytical expression for the\nresponse time of a bedrock river to a step change in rock\nuplift rate, as would occur during fault array linkage. In the\nstream power model, the rate of change of channel bed\nelevation z can be expressed as\n@z\n@t\n¼ U \u0003 KAmSn ð3Þ\nwhere U is the rock uplift rate [m yr\u00031], K is a dimensional\nerosion coefficient, and m and n are positive, empirical\ncoefficients [e.g., Howard and Kerby, 1983; Whipple and\nTucker, 1999]. Area A may be replaced with downstream\ndistance from the divide using Hack’s law [Hack, 1957]:\nA ¼ kaxh ð4Þ\nwhere ka and h are empirical coefficients.\n[18] Whipple and Tucker [1999] and Whipple [2001]\nassumed a steady state catchment profile, such that erosion\neverywhere balances rock uplift and @z\/@t = 0. They applied\na step change to the rock uplift rate, which is assumed to be\nuniform within the catchment. The response time to this\nperturbation can be defined as the time required for the\nresulting knickpoint to reach the upstream edge of the\nchannel network [Whipple, 2001]:\ntU ¼ bK\u00031n U 1n\u00031\n\u0004 \u0005\nfU\n1\nn \u0003 1\n\u0004 \u0005\nfU \u0003 1ð Þ\u00031 ð5Þ\nwhere fU is the ratio of final to initial rock uplift rate, and\nb is a grouping of constants defined by\nb ¼\nk\n\u0003m\nn\na 1\u0003 hm\nn\n\u0002 \u0003\u00031\nL1\u0003\nhm\nn \u0003 x1\u0003hmnc\n\u0004 \u0005\n;\nhm\nn\n6¼ 1\nk\n\u0003m\nn\na ln\nL\nxc\n\u0002 \u0003\n;\nhm\nn\n¼ 1\n8>><\n>>:\nð6Þ\nwhere L is the total catchment length [m] and xc is the\nposition of the channel head [m]. As pointed out byWhipple\n[2001], derivation of equation (5) assumes spatially uniform\nU, K, m, and n, and further assumes that the knickpoint\npropagates upstream without smoothing; any rounding of\nthe knickpoint (which will occur if n 6¼ 1) will increase the\nresponse time. It should be emphasized that the analytical\nresponse time in equation (5) is different from the relaxation\ntime required for a catchment variable (such as sediment\nefflux) to grow or decay to a fraction of its new value\nfollowing a perturbation [Allen, 2007]. The analytical\nresponse time used here is the time taken to fully reach\nthe new equilibrium state, and is therefore considerably\nlonger than an equivalent relaxation time.\n[19] As slip rate on a fault segment increases due to\nlinkage of the fault array, the calculated catchment response\ntime should vary along strike because of variations in slope-\narea scaling, local slip rate, and catchment size. Thus the\ntimescales defined by equations (5) and (6) provide a useful\nrelative measure of catchment response along strike, and\nallow us to examine the role of competing influences on\ncatchment response times. Accordingly, we calculated\nresponse times for the catchments in all three footwalls\nusing equations (5) and (6). We used the 10 m DEM to\nestimate L, ka, and h for each catchment, and the catchment\nslope-area scaling described earlier to estimate K (given by\nU\/(ks)\nn in steady state [Howard, 1994]) and the exponent\nratio m\/n (given by \u0003q in steady state [Sklar and Dietrich,\n1998]). Drainage area at the channel head was assumed to\nbe 105 m2, which when combined with equation (4) yielded\nxc. The slope exponent n was assumed to be 1 for simplicity.\nBecause of the lack of slip rate data on our chosen faults, we\napplied a simple but reasonable linear slip rate variation\nalong strike, from 0 at the fault tip to 0.5 mm yr\u00031 at the\nstrike center. Consequently, the rock uplift rate varies along\nthe fault, but is assumed to be uniform in the transverse\ndirection for each catchment. We then calculated the\nresponse times after the slip rate was arbitrarily doubled\neverywhere (i.e., fU = 2), to simulate a rapid increase in slip\nrate following fault linkage.\n[20] To compare these catchment response times to rele-\nvant tectonic timescales, we defined a normalized response\ntime t* for each catchment:\nt* ¼\ntU\ntonset\nð7Þ\nwhere tU is the calculated response time from equation (5)\nand tonset is the onset time of rapid fault slip at the catchment\nposition. Although geological evidence in the Lemhi\nfootwall supports a spatially uniform value of tonset, we\ncalculated two end-member cases of t* for comparison. For\nfault growth by linkage, tonset should be approximately\nuniform for the tip segments, and we used a value of 6 Ma\n[Anders et al., 1993; Anders, 1994]. For a continuously\npropagating fault tip, tonset will depend on the distance from\nthe fault tip and the lateral propagation rate, which we\nassumed to be 10 mm yr\u00031 based on theoretical considera-\ntions [Cowie and Scholz, 1992a] and limited observational\nevidence (summarized by Densmore et al. [2003]).\n[21] As we show below, footwall catchments near the\nfault tips are probably not in steady state, and catchment\nerosion in the strike centers appears to be dominated by\ndebris flows, which may not be well described by the stream\npower model that underlies equation (5). We thus regard the\nresponse times calculated with equations (5) and (6) as\nuseful relative measures of catchment response along strike,\nbut emphasize that the absolute values of the response times\nF03S08 DENSMORE ET AL.: TRANSIENT LANDSCAPES AT FAULT TIPS\n5 of 16\nF03S08\nare unlikely to be accurate. The point of this exercise is not\nto simulate precise values of tU and t*, but to examine the\npotential influence of different fault growth end-members\non the likelihood of steady state or equilibrium catchments.\n5. Results\n5.1. Throw Profiles and Footwall Relief at Fault Tips\n[22] As noted by Densmore et al. [2004], relief increases\nalmost monotonically from the fault tips in all three foot-\nwalls, reaching a maximum value of 1200–1500 m after\napproximately 15 km (Figure 3). This corresponds to an\noverall topographic gradient at the fault tips of \u00020.1. For\ncomparison, along-strike gradients in the throw profiles are\n\u00020.2 for all three faults [Densmore et al., 2005]. If fault\nthrow is approximately equally partitioned between footwall\nuplift and hanging wall subsidence, as suggested for the\nBeaverhead fault by Rodgers and Anders [1990] and Anders\net al. [1993], then the along-strike gradient in footwall uplift\nshould be \u00020.1, or approximately equal to the topographic\ngradient. This suggests that there is relatively little denuda-\ntion from the top of the displacement envelope within 15 km\nof the fault tips. In other words, relief is created by\ncatchment incision into the displacement envelope [e.g.,\nDensmore et al., 2005], but there is little removal of\nmaterial from the peaks and the range crest close to the\nfault tips.\n5.2. Stream Profiles and Catchment Slope-Area\nScaling\n[23] Stream profiles in all three footwalls can be broadly\ndivided into two types, depending on along-strike position.\nNear the fault tips, profiles are generally smooth and\nconcave up, with no obvious knickpoints or marked con-\nvexities (Figure 4). In contrast, catchments closer to the\nstrike center have two distinct regions: a steep, linear to\nconcave-up reach at drainage areas of less than 1–2 \u0004\n106 m2, and a linear to gently convex-up reach farther\ndownstream (Figure 5). Slopes in the strike center catch-\nments are generally greater than 0.05 even at the catch-\nment mouths, which suggests that we might expect debris\nflows to be a dominant transport mechanism throughout\nthe catchments [e.g., Stock and Dietrich, 2003].\n[24] The profile differences visible in Figures 4 and 5 are\nreflected in the along-strike patterns of catchment slope-area\nscaling. In all three footwalls, the normalized catchment\nsteepness Sr is very low at the fault tips and increases\ntoward the strike center (Figures 6–8). It reaches a maxi-\nmum value within 10–15 km from the fault tip, and then\nstays high and relatively uniform across most of the\nfootwall. Because Sr is a measure of channel slope at a\ngiven reference drainage area (here 106 m2), uniform Sr\nvalues imply relatively invariant channel slopes along most\nof the length of the footwall, regardless of catchment size or\nposition. In the Lemhi Range, the maximum value of Sr is\nreached at approximately the position of Middle Canyon,\nwhose mouth is 10 km from the fault tip (Figure 7). The\nnormalized steepness index ksn shows similar along-strike\nvariability (Figures 6–8), indicating that the basic pattern is\ninsensitive to the normalization method that was used.\n[25] Likewise, values of the concavity index q vary along\nall three footwalls, with the highest values near the fault tips\nand a rapid decay to low, uniform values (0.3–0.5) at the\nstrike center (Figures 6–8). That is, channels in the central\npart of each footwall appear more linear, and lose slope less\nrapidly downstream, than those near the fault tips. No clear\nsystematic variations are visible over most of the footwall,\nnor do the variations appear to correspond with geometric\nfeatures of the faults themselves (such as relay zones\nbetween adjacent segments).\n[26] The presence of linear to convex-up lower reaches in\nthe strike center catchments (e.g., Figure 5) suggests that\nFigure 3. Along-strike profiles of footwall relief. Profiles\nare generated by projecting footwall topography (from\nmountain front to drainage divide) onto a fault-parallel line.\nDistances (x axes) are measured from the southeastern tip of\neach fault. Upper portion of each plot shows mean elevation\n(thin line) and elevation range from maximum to minimum\n(shaded field). Lower portion shows footwall relief, defined\nas difference between maximum and minimum elevations\n(thick line). Dashed lines show topographic gradient of 0.1\nat fault tips. (a) Beaverhead fault. (b) Lemhi fault. (c) Lost\nRiver fault.\nF03S08 DENSMORE ET AL.: TRANSIENT LANDSCAPES AT FAULT TIPS\n6 of 16\nF03S08\nfitting a power law relation to the entire profile is an\noversimplification, and so we have experimented with\nlimiting the range of power law fits to a maximum drainage\narea (e.g., 1–2 \u0004 106 m2; Figure 5). While this changes the\nabsolute values of Sr, ksn, and q, the along-strike patterns in\nFigures 6–8 do not change. Thus our basic observations\n(high concavities and low steepness values near the fault\ntips, changing along strike to uniform values in the strike\ncenters) appear to be robust, and are insensitive to the\ndetails of the fitting procedure.\n5.3. Catchment Response Times\n[27] We show calculated catchment response times based\non equations (5) and (6) only for the Lemhi footwall, as the\nother footwalls show similar patterns. Response times to a\ndoubled slip rate vary significantly along strike, increasing\nfrom 4–5 Myr near the fault tip to a maximum of \u00029 Myr\nand then decaying to \u00021 Myr near the strike center\n(Figure 9). The longest calculated response time occurs at\nMiddle Canyon, which also coincides with the transition to\nuniform Sr values. Catchments near the fault tip have small\nvalues of catchment length L (and thus small b from\nequation (6)), leading to shorter response times. Likewise,\nthose close to the strike center have high local slip rates and\nlow concavities q (and thus small b), also leading to short\nresponse times. Interestingly, catchments between these\nextremes have, in a sense, the worst of both worlds: they\nare large enough that L becomes important, but still have\nhigh concavities and relatively low slip rates. The net effect\nis to produce very long response times for those catchments\nlocated 10–15 km from the fault tip.\n[28] It is instructive to compare these response times to\nthe onset time of rapid fault slip at each catchment mouth,\ntonset. We consider two end-member cases. If, as we suspect,\nthe Lemhi fault grew largely by linkage, then tonset should\nbe about 6 Ma everywhere along strike. This leads to an\nFigure 5. Stream profile and slope-area scaling for Warm\nCreek catchment near the strike center of the Lemhi fault.\nSee Figure 11 for location. (a) Longitudinal profile of the\ntrunk stream (black line) and downstream increase in\ndrainage area (gray line). The fan head is located at the\ndownstream end of the profile. Note steep, roughly linear\nprofile. The lowermost exposure of bedrock in the channel\nbed is shown by the dashed line. (b) Slope-area scaling for\nthe trunk stream. Steepness index Sr and concavity index q\nare calculated for areas greater than 105 m2 using equation (2)\nwith Ar = 10\n6 m2.\nFigure 4. Stream profile and slope-area scaling for small\ncatchment near the southeastern tip of the Lemhi fault\n(basin 9). See Figure 11 for location. (a) Longitudinal\nprofile of the trunk stream (black line) and downstream\nincrease in drainage area (gray line). The fan head is located\nat the downstream end of the profile. Note smooth, concave-\nup profile. (b) Slope-area scaling for the trunk stream.\nSteepness index Sr and concavity index q are calculated for\nareas greater than 105 m2 using equation (2) with Ar = 10\n6 m2.\nF03S08 DENSMORE ET AL.: TRANSIENT LANDSCAPES AT FAULT TIPS\n7 of 16\nF03S08\nFigure 6. Along-strike profiles of (top) concavity index q,\n(middle) normalized steepness Sr, and (bottom) steepness\nindex ksn for catchments in the southern half of the\nBeaverhead footwall. Gray boxes show 15 km tip region\nof increasing footwall relief. Sr was calculated assuming a\nreference area of 1 km2. Steepness index ksn was calculated\nusing a reference concavity index qref of 0.40, set by the\nmean concavity index of all divide-forming catchments in\nthe Beaverhead footwall.\nFigure 7. Along-strike profiles of (top) concavity index q,\n(middle) normalized steepness Sr, and (bottom) steepness\nindex ksn for catchments in the southern half of the Lemhi\nfootwall. Gray boxes show 15 km tip region of increasing\nfootwall relief. Sr was calculated assuming a reference area\nof 1 km2. Steepness index ksn was calculated using a\nreference concavity index qref of 0.35, set by the mean\nconcavity index of all divide-forming catchments in the\nLemhi footwall.\nF03S08 DENSMORE ET AL.: TRANSIENT LANDSCAPES AT FAULT TIPS\n8 of 16\nF03S08\nalong-strike pattern of the normalized response time t* that\nmimics the pattern of calculated response times tU\n(Figure 10a). Catchments that are less than 20 km from\nthe fault tip have normalized response times t* > 1. In other\nwords, the response time to enhanced rock uplift rate is\ngreater than the time since the inception of faulting, and we\ninfer from this that these catchments are unlikely to be at\nequilibrium with the present tectonic displacement field.\nCatchments beyond 20 km from the tip have t* < 1, meaning\nthat they are likely to have adjusted to the assumed onset of\nrapid slip on the Lemhi fault at 6 Ma. This is consistent with\nthe general uniformity in slope-area scaling over most of the\nfootwall.\n[29] The alternative end-member is to assume that the\nLemhi fault grew solely by tip propagation. With a constant\ntip propagation rate of \u000210 mm yr\u00031, propagation of the\nsouthern tip by 75 km (half the length of the fault) would\nhave taken \u00027.5 Myr, and tonset would therefore vary\nlinearly between 7.5 Ma and 0. While this seems less likely\nthan a uniform tonset in our study area, the pattern of t* that\nemerges with this assumption is broadly similar \u0003t* > 1\nnear the fault tip, indicating likely disequilibrium condi-\ntions, and becoming <1 beyond about 35 km from the fault\ntip (Figure 10b).\n5.4. Field Observations\n[30] Preliminary field observations at the tips of the Lost\nRiver, Lemhi, and Beaverhead faults show that there are\ncharacteristic along-strike changes in landscape form and\npresent-day sediment transport processes that coincide with\nthe transitions in slope-area scaling and response times\ndescribed above. Close to the fault tips, the catchments\nare small, relatively elongate [Densmore et al., 2005], and\nhave mouth-to-crest relief of <1000 m. Their geomorphol-\nFigure 8. Along-strike profiles of (top) concavity index q,\n(middle) normalized steepness Sr, and (bottom) steepness\nindex ksn for catchments in the southern half of the Lost\nRiver footwall. Gray boxes show 15 km tip region of\nincreasing footwall relief. Sr was calculated assuming a\nreference area of 1 km2. Steepness index ksn was calculated\nusing a reference concavity index qref of 0.36, set by the\nmean concavity index of all divide-forming catchments in\nthe Lost River footwall.\nFigure 9. Analytical response time tU to a doubled slip\nrate for catchments in the southern half of the Lemhi\nfootwall. The preperturbation slip rate is assumed to vary\nfrom 0 at the fault tip to 0.5 mm yr\u00031 at the strike center.\nResponse time is calculated using equation (5) [Whipple,\n2001]. Gray box shows 15 km tip region of monotonically\nincreasing footwall relief.\nF03S08 DENSMORE ET AL.: TRANSIENT LANDSCAPES AT FAULT TIPS\n9 of 16\nF03S08\nogy is typified by a small catchment (basin 16) near the\nsouthern tip of the Lemhi fault, along the Howe segment\n(drainage area 5.12 km2; Figure 11). Hillslopes are mantled\nby <1–2 m of regolith and the structure in the underlying\nbedrock is clearly visible (Figure 12). The regolith cover\nappears to be moved downslope by dry ravel and small\nrockfalls into abundant talus cones; we have not observed\nlandslide scars or evidence of large-scale mass wasting. The\nvalley floor is broad (up to 50 m across), flat, and mantled\nby sand to cobble-sized alluvium. Incision into this surface\nis limited to a narrow (2–3 m) active channel that is\ntypically <1 m deep. Even in constrictions caused by\nchannel incision through resistant beds, bedrock is not\nexposed in the channel. The only sedimentary features\nvisible on the valley floor are large (2–10 m across),\nrelatively well-sorted cobble bars, with clasts 2–10 cm in\ndiameter and no evidence of vertical or downstream grading\nor size variation. These bars are particularly common at\ntributary junctions with the main channel, and we interpret\nthem as bed forms resulting from short-duration, high-\ndischarge floods that cover the valley floor but are incapable\nof significant incision into the alluvial fill. The lack of much\npresent-day sediment transport out of the catchment is\nunderscored by the associated sediment fan, which is highly\ndissected and incised at its head by up to 20 m (Figure 12).\nThere is some evidence in the catchment for higher sedi-\nment transport rates in the past, in the form of dissected\nremnants of alluvial fill that now sit 5–10 m above the\nmodern channel. These remnants grade up channel into\nhillslope colluvium, and appear to grade down channel\ntoward the dissected, older fan surfaces. This alluvium,\nwhile undated, may be correlative with widespread regional\nfluvial deposits associated with high water discharges\nduring the last glacial [Pierce and Scott, 1982].\n[31] This picture contrasts with the suite of processes\nvisible in strike-center catchments, typified by Warm Creek\nnear the center of the Lemhi fault (drainage area 11.08 km2;\nFigure 11). There, despite similar bedrock lithologies to the\ntip catchments, hillslopes are steep and largely planar, with\nabundant loose regolith (Figure 13). Small Pleistocene\nglaciers were present in the catchment, but their maximum\nextent was only about one third the distance from divide to\nmountain front, and they do not appear to have had a strong\ninfluence on the valley morphology downstream of the\ncirques. The valley is narrow and V-shaped, with a well-\ndefined active channel. The channel contains abundant\nevidence of recent debris flows, including boulder levees,\ninversely graded fill terrace deposits, and isolated clusters of\nmeter-scale boulders. Abraded, polished bedrock is exposed\nin several places in the channel bed. The sediment fan at the\nmouth of the catchment is segmented into multiple deposi-\ntional lobes [e.g., Bull, 1964], with the active lobe near the\nfan toe (Figure 13). Lobe surfaces are composed of a\ndistributary network of channels, 1–2 m deep and 3–4 m\nwide, lined by levees composed of 0.5–1 m boulders. The\nchannels end abruptly in coarse openwork cobble-boulder\ndeposits, 2–4 m across. We interpret these features as debris\nflow levee channel complexes, indicating sustained sedi-\nment transport by debris flows into the hanging wall. Fan\nstratigraphy is not exposed, so we can only infer that\nsediment transport by debris flows has been a dominant\nprocess in the Warm Spring catchment over the time period\nrepresented by the present fan surface.\n[32] In the Lemhi Range, the present-day transition\nbetween (episodic?) streamflow-dominated catchments with\nstarved, dissected fans, and those dominated by debris flows\nwith segmented, active fans, occurs near the fault tip in the\narea of Middle and Black Canyons (Figure 11). Hillslopes\nin Middle Canyon, while generally similar to those closer to\nthe fault tip, show evidence for small recent debris flows,\nsourced on talus accumulations below bedrock exposures\n(Figure 14a). These features are not seen in catchments\ncloser to the fault tip, and they appear to be limited to the\nhillslopes in Middle Canyon; we found no evidence of\ndebris flow transport in the Middle Canyon main channel.\nThe Middle Canyon fan is incised by up to 20 m at the fan\nFigure 10. Normalized response times t*, defined as\ncatchment response time tU divided by the time since the\ninception of faulting tonset, in the southern half of the Lemhi\nfootwall. Gray boxes show 15 km tip region of increasing\nfootwall relief. Note log scales on y axes. (a) Normalized\nresponse time assuming fault growth by linkage, so that\nonset of rapid fault slip tonset is everywhere uniform (and\nassumed here to be 6 Ma). (b) Normalized response time\nassuming fault growth by tip propagation at a rate of\n\u000210 mm yr\u00031, so that tonset varies from 0 at the fault tip to\n\u00027.5 Ma at the strike center.\nF03S08 DENSMORE ET AL.: TRANSIENT LANDSCAPES AT FAULT TIPS\n10 of 16\nF03S08\nFigure 11. Perspective image of the Lemhi Range, viewed from the south. Image consists of Landsat\n7 panchromatic data draped on 30 m DEM. Scale varies; width of image in foreground is approximately\n35 km. Black line shows active trace of the Lemhi fault. Catchments described in the text are shown in\nwhite. White arrow marks approximate onset of uniform footwall relief, \u000215 km from southeastern fault\ntip. Black arrow marks approximate onset of uniform catchment steepness Sr, \u000210 km from fault tip.\nFigure 12. Perspective image of basin 16, near the southeastern tip of the Lemhi fault. See Figure 11 for\nlocation. Image consists of USGS digital orthophotograph draped on 10 m DEM. Scale varies; distance\nfrom catchment mouth to crest of Lemhi Range is 3.6 km. Black lines show active trace of the Lemhi\nfault. Thick white line shows catchment boundary. Thin white line shows catchment trunk stream from\ndrainage area of 105 m2 (white dot in headwaters) to catchment mouth and illustrates the range over\nwhich slope-area scaling is assessed (see Figure 7). Note irregular hillslopes with thin regolith cover and\nexposed stratigraphy and incised, sediment-starved hanging wall fan.\nF03S08 DENSMORE ET AL.: TRANSIENT LANDSCAPES AT FAULT TIPS\n11 of 16\nF03S08\nhead, and the modern channel is broad and flat, as with all\nother fans closer to the fault tip (Figure 14b). Fan surfaces\nare smooth, with few clasts that are greater than 10–20 cm\nin diameter. In contrast, the adjacent Black Canyon fan, like\nmost of the fans to the north toward the strike center, is\nunincised and has abundant boulders with diameters of up\nto 3 m, typically arranged in clusters or linear arrays along\nshallow channels (Figure 14c). We ascribe these differences\nin fan morphology to an along-strike increase in the\nimportance of debris flows as sediment transport agents.\nThe mouth of Middle Canyon is 10 km from the fault tip,\nwhile that of Black Canyon is 12 km from the tip. Thus, at\npresent this transition occurs within the 15 km tip region,\nbefore uniform footwall relief is reached (Figure 11). As\nnoted above, Middle Canyon marks the onset of uniform\ncatchment steepness Sr and has the longest calculated\nresponse time of any catchment in the Lemhi footwall.\nObservations in the Beaverhead and Lost River ranges\nsuggest that similar transitions from streamflow to debris\nflow dominance occur in those ranges as well, but we have\nnot pinpointed their locations.\n6. Discussion\n[33] Densmore et al. [2005] hypothesized that the uni-\nform relief seen in normal fault footwalls was a geometric\nconsequence of the limited space in which the catchments\ncould develop. This hypothesis required the establishment\nof some sort of geomorphic limit on hillslope and channel\ngradients within the \u000215 km tip zone. Here, we have shown\nthat two important transitions occur along strike in our study\narea as displacement and slip rate increase away from the\nfault tips. First, debris flows replace episodic stream flows\nas the dominant sediment transport mechanism, both within\nthe catchments and from catchment to fan. This transition\nmanifests itself as a change from irregular weathering-\nlimited hillslopes, unincised alluvial channels, and sedi-\nment-starved fans near the fault tips, to planar hillslopes,\nincised bedrock channels, and active debris flow fans closer\nto the strike centers. Second, there is a marked transition in\ncatchment slope-area scaling, from gently sloping, concave\nchannels near the fault tips to steep, low-concavity channels\ncloser to the strike centers. This transition is the only sig-\nnificant along-strike variation in channel geometry, despite\nthe fact that fault displacement (and probably slip rate)\nvaries continuously along the footwalls. Both transitions,\nthe change in channel geometry and the onset of debris\nflows, happen at approximately the same position along\nstrike, and both happen within the tip zone. Thus we suggest\nthat the change in slope-area scaling (and its decoupling\nfrom the fault displacement profile) is the fingerprint of a\nswitch to more efficient erosional processes that, when\ncombined with limited footwall space, conspires to limit\nrange relief.\nFigure 13. Perspective image of Warm Creek, near the strike center of the Lemhi fault. See Figure 11\nfor location. Image consists of USGS digital orthophotograph draped on 10 m DEM. Scale varies;\ndistance from catchment mouth to crest of Lemhi Range is 6.3 km. Thick black lines show active trace of\nthe Lemhi fault. Thin black lines show margins of Warm Creek fan. Thick white line shows catchment\nboundary. Thin white line shows catchment trunk stream from drainage area of 105 m2 (white dot in\nheadwaters) to catchment mouth and illustrates the range over which slope-area scaling is assessed (see\nFigures 5 and 7). Note planar hillslopes, incised V-shaped channel, and active debris flow fan.\nF03S08 DENSMORE ET AL.: TRANSIENT LANDSCAPES AT FAULT TIPS\n12 of 16\nF03S08\n[34] The low, uniform values of concavity and linear\nchannel reaches in the strike centers of all three footwalls\nin our study area may be compatible with the dominance of\ndebris flows in those catchments. A number of authors have\nsuggested that channel incision by debris flows may give\nrise to relatively straight, low-concavity channel profiles\n[Montgomery and Foufoula-Georgiou, 1993; Howard,\n1998; Stock and Dietrich, 2003]. Most studies of debris\nflow effects on slope-area scaling have been primarily\nconcerned with the scaling break at the upstream end of\nthe power law relation in equation (1) [e.g., Stock and\nDietrich, 2003]. Few workers have explicitly considered the\nmorphology of catchment-fan systems in which debris\nflows transport sediment from source (hillslopes) to sink\n(hanging wall fan) as in our study area, rather than handing\noff sediment to fluvial processes downstream. The recent\nproposal of a debris flow incision law by Stock and Dietrich\n[2006] holds much promise for a more quantitative under-\nstanding of channel profile development in these settings.\nOur field observations also highlight how little we know\nabout the geological role of debris flows in catchment\nincision and fan development, despite the fact that debris\nflow fans are ubiquitous in arid regions [e.g., Whipple and\nDunne, 1992; Blair and McPherson, 1994, 1998; Blair,\n1999; Du¨hnforth et al., 2007]. Pierce and Scott [1982]\npointed out that the largest fans in the Lemhi and Lost River\nRanges were constructed by fluvial processes, and that these\nwere largely abandoned after about 15 ka due to decreased\nwater discharge in the drier interglacial climate. We suggest\nthat debris flows appear to be important in supplying\nsediment directly to smaller fans, such as the Warm Springs\nfan (Figure 13), but in larger catchments may feed sediment\nonly into the trunk streams, perhaps due to limited runout\nlengths. Sediment transport onto the largest fans is then\ndependent on the availability of sufficient water discharge in\nthe trunk streams. Studies on debris flow fans in other\nfootwalls in the western United States show that debris flow\noccurrence has persisted through the Holocene [Reheis et\nal., 1996; Du¨hnforth et al., 2007], so it may be that the\nsmaller fans are relatively unaffected by the postglacial\nshutdown in sediment supply envisaged by Pierce and Scott\n[1982]. Absolute ages of debris flow deposition on a range\nof fans would help address this question.\n[35] At present, we cannot determine whether the transi-\ntion to debris flow dominated catchments observed in the\nfield is related to along-strike increases in displacement or\nslip rate. Densmore et al. [2005] pointed out that the ratio of\ntopographic relief to range half width, a measure of the\nrange-scale topographic slope, is approximately uniform for\neach of the three ranges in the study area. This invariance,\nFigure 14. Field photographs from the adjacent Middle\nand Black Canyons, near the southeastern tip of the Lemhi\nfault. See Figure 11 for locations. (a) Small recent debris\nflows on the east flank of Middle Canyon. View is to the\nnortheast. Flows appear to be sourced in talus accumula-\ntions beneath prominent bedrock exposures (upper third of\nphotograph). The 4WD track gives scale; depositional lobe\nin foreground is approximately 15 m across. (b) Floor of\nmain incised channel on Middle Canyon fan, looking north\ntoward the catchment mouth. Note smooth topography, lack\nof any sedimentary features, and older, abandoned fan\nsurfaces. (c) View of debris flow deposits on Black Canyon\nfan. View is to the northwest. Note shallow debris flow\nchannel, bouldery lateral levee, and isolated boulders to 3 m\nin diameter.\nF03S08 DENSMORE ET AL.: TRANSIENT LANDSCAPES AT FAULT TIPS\n13 of 16\nF03S08\nwhich spans both the tip zone and the strike center, means\nthat increasing displacement toward the strike center does\nnot result in a steeper overall mountain front. This casts\ndoubt on a direct link between fault displacement, increased\nmountain range slopes, and the onset of debris flows. In\naddition, there is no simple relationship between the onset\nof debris flow dominance and clear along-strike trends in\nhillslope gradients or slope histograms. Ideally, we require\ndata on the along-strike distribution of erosion rates and\ntransport processes over longer timescales from fan stratig-\nraphy, coupled with better information on along-strike\nvariations in slip rate over geological timescales.\n[36] An alternative explanation for the onset of debris\nflow dominance at 10–12 km from the fault tip, and indeed\nfor the limited range relief, is orographic enhancement of\nprecipitation over the growing footwall. As pointed out by\nDensmore et al. [2004], there should be a direct correlation\nbetween the efficiency of the surface processes system and\nthe length or timescales required to reach uniform relief. As\nthe fault grows laterally and accumulates displacement, the\ngrowing footwall will intercept a larger fraction of the\navailable atmospheric moisture, and precipitation rates will\nincrease [Steenburgh, 2003; Schultz and Trapp, 2003]. The\nincrease in vegetation cover between catchments at the fault\ntip and the strike center (Figures 12 and 13) give an\nexcellent illustration of this effect. It seems likely that\nenhanced precipitation will trigger higher rates of regolith\nproduction, perhaps modulated by vegetation (e.g., through\nincreased root density or penetration), and lead to greater\nsediment supply to the channel through higher rates of soil\nand bedrock landsliding. This may in turn encourage debris\nflow occurrence, either through failure of saturated regolith\non hillslopes or through entrainment of sediment in chan-\nnels during high-magnitude, short-duration floods [e.g.,\nIverson, 1997]. We can envision these relationships giving\nrise to a powerful negative feedback, in which increased\nrange relief drives increased rates of sediment transport out\nof the footwall, eventually leading to a climatically induced\nlimit on footwall topography. While preliminary experi-\nments with mesoscale atmospheric models suggest that the\ngrowth of even a narrow, fault block scale range can have\ndramatic effects on precipitation totals (J. Galewsky, per-\nsonal communication, 2006), the lack of observational\nevidence (in terms of both climatic variables and erosion\nrates) makes this an open but intriguing avenue for future\nresearch.\n[37] The mismatch between calculated catchment response\ntimes and the time since the fault began to slip (Figure 10)\nis striking. We emphasize again that the value of the\nresponse time calculation in equation (5) rests not in its\nabsolute value, which depends on several unknown param-\neters and on the applicability of the stream power rule to our\ncatchments, but in its relative variation along strike. By\nnormalizing the calculated response times to the likely time\nsince the fault began to slip, we can derive a first-order\nestimate of the likelihood, or not, that catchments have\nreached some sort of equilibrium with the present-day\ntectonic displacement field. Given our lack of knowledge\non the true slip rate history, the end-member cases of fault\ngrowth by linkage and by tip propagation are effectively\nindistinguishable. They do suggest, however, that catchment\nequilibrium with the rate and pattern of fault slip is\nhighly unlikely at fault tips, making them excellent places\nto seek out and quantify the transient response to surface\ndeformation.\n7. Conclusions\n[38] Fault tips are areas of transient and spatially variable\npatterns of displacement and slip rate, and are thus ideal\nplaces to examine the response of sediment routing systems\nto spatial and temporal changes in fault activity. Landscapes\nat the tips of three active normal fault arrays in the western\nUnited States are characterized by distinct catchment mor-\nphologies and sediment transport processes when compared\nwith catchments at the fault strike centers. We find a marked\nalong-strike transition in catchment slope-area scaling, from\ngently sloping, concave channels near the fault tips to steep,\nlow-concavity channels closer to the strike centers. This\ntransition appears to coincide with the replacement of\nstream flows by debris flows as the dominant sediment\ntransport mechanism, and with a switch from sediment-\nstarved fans near the fault tips to active debris flow fans\nnear the strike center. We infer that these along-strike\nvariations signal a switch to more efficient erosional pro-\ncesses that act to limit footwall relief. Calculated catchment\nresponse times to a change in slip rate also vary systemat-\nically along strike; they are low near the fault tips where\ncatchments are small, reach a maximum near the onset of\nuniform slope-area scaling, and decrease again toward the\ncenter of the footwall. Response times at fault tips are long\ncompared with the time since fault activity began. We infer\nfrom this that catchments close to the fault tips are unlikely\nto be in equilibrium with the local displacement field,\nmeaning that fault tip landscapes are highly transient. In\nsum, we suggest that the landscape response to fault activity\nis best explored at the tips of faults, where displacements\nand slip rates are low and transient. The predictable along-\nstrike variations in displacement and slip rate on active\nfaults provide ideal boundary conditions for systematic\ninvestigation of landscape evolution.\n[39] Acknowledgments. Support for this research was provided by\ngrants from the U.S. National Science Foundation (EAR0207569) and the\nSwiss National Science Foundation (2100-067624 and 200020-105225\/1).\nWe thank Guy Simpson, Se´bastien Castelltort, Kurt Frankel, Joe Galewsky,\nRalf Hetzel, Jennifer Pierce, and Kelin Whipple for helpful discussions and\nadvice. Thought-provoking reviews by Simon Brocklehurst, Cameron\nWobus, and Associate Editor Josh Roering helped to focus and clarify\nthe manuscript.\nReferences\nAllen, P. A. (2007), Time scales of tectonic landscapes and their sediment\nrouting systems, in Earth’s Dynamic Surface: Catastrophe and Continu-\nity in Landscape Evolution, Geol. Soc. Spec. Publ., in press.\nAnders, M. H. (1994), Constraints on North American plate velocity from\nthe Yellowstone hotspot deformation field, Nature, 369, 53–55.\nAnders, M. H., and R. W. Schlische (1994), Overlapping faults, intrabasin\nhighs, and the growth of normal faults, J. Geol., 102, 165–180.\nAnders, M. H., M. Spiegelman, D. W. Rodgers, and J. T. Hagstrum (1993),\nThe growth of fault-bounded tilt blocks, Tectonics, 12, 1451–1459.\nBlair, T. C. (1999), Sedimentology of the debris flow-dominated Warm\nSpring Canyon alluvial fan, Death Valley, California, Sedimentology,\n46, 941–965.\nBlair, T. C., and J. G. McPherson (1994), Alluvial fan processes and forms,\nin Geomorphology of Desert Environments, edited by A. D. Abrahams\nand A. J. Parsons, pp. 354–402, CRC Press, Boca Raton, Fla.\nBlair, T. C., and J. G. McPherson (1998), Recent debris-flow processes and\nresultant form and facies of the Dolomite alluvial fan, Owens Valley,\nCalifornia, J. Sediment. Res., 68, 800–818.\nF03S08 DENSMORE ET AL.: TRANSIENT LANDSCAPES AT FAULT TIPS\n14 of 16\nF03S08\nBull, W. B. (1964), Geomorphology of segmented alluvial fans in western\nFresno County, California, U.S. Geol. Surv. Prof. Pap., 352-E, 129 pp.\nCartwright, J. A., and C. S. Mansfield (1998), Lateral displacement varia-\ntion and lateral tip geometry of normal faults in the Canyonlands National\nPark, Utah, J. Struct. Geol., 20, 3–19.\nCartwright, J. A., B. D. Trudgill, and C. S. Mansfield (1995), Fault growth\nby segment linkage: An explanation for scatter in maximum displacement\nand trace length data from the Canyonlands Graben of SE Utah, J. Struct.\nGeol., 17, 1319–1326.\nCartwright, J. A., C. Mansfield, and B. D. Trudgill (1996), The growth of\nnormal faults by segment linkage, in Modern Developments in Structural\nInterpretation, Validation, and Modeling, edited by P. G. Buchanan and\nD. A. Nieuwland, Geol. Soc. Spec. Publ., 99, 163–177.\nCommins, D., S. Gupta, and J. Cartwright (2005), Deformed streams reveal\ngrowth and linkage of a normal fault array in the Canyonlands graben,\nUtah, Geology, 33, 645–648.\nCowie, P. A. (1998), A healing-reloading feedback control on the growth\nrate of seismogenic faults, J. Struct. Geol., 20, 1075–1087.\nCowie, P. A., and G. P. Roberts (2001), Constraining slip rates and spacings\nfor active normal faults, J. Struct. Geol., 23, 1901–1915.\nCowie, P. A., and C. H. Scholz (1992a), Growth of faults by accumulation\nof seismic slip, J. Geophys. Res., 97, 11,085–11,095.\nCowie, P. A., and C. H. Scholz (1992b), Displacement-length scaling\nrelationship for faults: Data synthesis and discussion, J. Struct. Geol.,\n14, 1149–1156.\nCowie, P. A., and Z. K. Shipton (1998), Fault tip displacement gradients\nand process zone dimensions, J. Struct. Geol., 20, 983–997.\nDawers, N. H., and J. R. Underhill (2000), The role of fault interaction and\nlinkage in controlling syn-rift stratigraphic sequences: Late Jurassic,\nStatfjord East area, northern North Sea, AAPG Bull., 84, 45–64.\nDawers, N. H., M. H. Anders, and C. H. Scholz (1993), Growth of normal\nfaults: Displacement-length scaling, Geology, 21, 1107–1110.\nDensmore, A. L., N. H. Dawers, S. Gupta, P. A. Allen, and R. Gilpin\n(2003), Landscape evolution at extensional relay zones, J. Geophys.\nRes., 108(B5), 2273, doi:10.1029\/2001JB001741.\nDensmore, A. L., N. H. Dawers, S. Gupta, R. Guidon, and T. Goldin\n(2004), Footwall topographic development during continental extension,\nJ. Geophys. Res., 109, F03001, doi:10.1029\/2003JF000115.\nDensmore, A. L., N. H. Dawers, S. Gupta, and R. Guidon (2005), What sets\ntopographic relief in extensional footwalls?, Geology, 33, 453–456.\nDietrich, W. E., D. G. Bellugi, L. S. Sklar, J. D. Stock, A. M. Heimsath, and\nJ. J. Roering (2003), Geomorphic transport laws for predicting landscape\nform and dynamics, in Prediction in Geomorphology, edited by P. R.\nWilcock and R. M. Iverson, Geophys. Monogr. Ser., vol. 135, pp. 103–\n132, AGU, Washington, D. C.\nDu¨hnforth, M., A. L. Densmore, S. Ivy-Ochs, P. A. Allen, and P. W. Kubik\n(2007), Timing and patterns of debris flow fan deposition on Shepherd\nand Symmes Creek fans, Owens Valley, California, deduced from cos-\nmogenic 10Be, J. Geophys. Res., doi:10.1029\/2006JF000562, in press.\nGawthorpe, R. L., C. A. L. Jackson, M. J. Young, I. R. Sharp, A. R.\nMoustafa, and C. W. Leppard (2003), Normal fault growth, displacement\nlocalisation and the evolution of normal fault populations: The Hammam\nFaraun fault block, Suez Rift, Egypt, J. Struct. Geol., 25, 883–895.\nGupta, A., and C. H. Scholz (2000), A model of normal fault interaction\nbased on observations and theory, J. Struct. Geol., 22, 865–879.\nGupta, S., P. A. Cowie, N. H. Dawers, and J. R. Underhill (1998), A\nmechanism to explain rift-basin subsidence and stratigraphic patterns\nthrough fault-array evolution, Geology, 26, 595–598.\nHack, J. T. (1957), Studies of longitudinal stream profiles in Virginia and\nMaryland, U.S. Geol. Surv. Prof. Pap., 294-B, 45–97.\nHoward, A. D. (1994), A detachment-limited model of drainage basin\nevolution, Water Resour. Res., 30, 2261–2285.\nHoward, A. D. (1998), Long profile development of bedrock channels:\nInteraction of weathering, mass wasting, bed erosion, and sediment trans-\nport, in Rivers Over Rock: Fluvial Processes in Bedrock Channels, Geo-\nphys. Monogr. Ser., vol. 107, edited by K. J. Tinkler and E. E. Wohl,\npp. 297–320, AGU, Washington, D. C.\nHoward, A. D., and G. Kerby (1983), Channel changes in badlands, Geol.\nSoc. Am. Bull., 94, 739–752.\nIverson, R. M. (1997), The physics of debris flows, Rev. Geophys., 35,\n245–296.\nJanecke, S. U. (1993), Structures in segment boundary zones of the Lost\nRiver and Lemhi faults, east central Idaho, J. Geophys. Res., 98, 16,223–\n16,238.\nJanecke, S. U., J. W. Geissman, and R. L. Bruhn (1991), Localized rotation\nduring Paleogene extension in east central Idaho: Paleomagnetic and\ngeologic evidence, Tectonics, 10, 403–432.\nJanecke, S. U., J. J. Blankenau, C. J. VanDenburg, and B. S. Van Gosen\n(2001), Map of normal faults and extensional folds in the Tendoy Moun-\ntains and Beaverhead Range, southwest Montana and eastern Idaho, U.S.\nGeol. Surv. Misc. Field Stud. Map, MF-2362.\nKirby, E., and K. X. Whipple (2001), Quantifying differential rock-uplift\nrates via stream profile analysis, Geology, 29, 415–418.\nKobor, J. S., and J. J. Roering (2004), Systematic variation of bedrock\nchannel gradients in the central Oregon Coast Range: Implications for\nrock uplift and shallow landsliding, Geomorphology, 62, 239–256.\nKuntz, M. A., S. R. Anderson, D. E. Champion, M. A. Lanphere, and D. J.\nGrunwald (2002), Tension cracks, eruptive fissures, dikes, and faults\nrelated to late Pleistocene-Holocene basaltic volcanism and implications\nfor the distribution of hydraulic conductivity in the eastern Snake River\nPlain, Idaho, in Geology, Hydrogeology, and Environmental Remedia-\ntion: Idaho National Engineering and Environmental Laboratory, East-\nern Snake River Plain, Idaho, edited by P. K. Link and L. L. Mink, Geol.\nSoc. Am. Spec. Pap., 353, 111–133.\nLague, D., P. Davy, and A. Crave (2000), Estimating uplift rate and erod-\nibility from the area-slope relationship: Examples from Brittany (France)\nand numerical modelling, Phys. Chem. Earth, Part A, 25, 543–548.\nManighetti, I., G. C. P. King, Y. Gaudemer, C. H. Scholz, and C. Doubre\n(2001), Slip accumulation and lateral propagation of active normal faults\nin Afar, J. Geophys. Res., 106, 13,667–13,696.\nManighetti, I., G. King, and C. G. Sammis (2004), The role of off-fault\ndamage in the evolution of normal faults, Earth Planet. Sci. Lett., 217,\n399–408.\nMcLeod, A. E., N. H. Dawers, and J. R. Underhill (2000), The propagation\nand linkage of normal faults: Insights from the Strathspey-Brent-Statfjord\nfault array, northern North Sea, Basin Res., 12, 263–284.\nMeyer, V., A. Nicol, C. Childs, J. J. Walsh, and J. Watterson (2002),\nProgressive localization of strain during the evolution of a normal fault\npopulation, J. Struct. Geol., 24, 1215–1231.\nMontgomery, D. R. (2001), Slope distributions, threshold hillslopes, and\nsteady-state topography, Am. J. Sci., 301, 432–454.\nMontgomery, D. R., and E. Foufoula-Georgiou (1993), Channel network\nsource representation using digital elevation models, Water Resour. Res.,\n29, 3925–3934.\nMorley, C. K. (1999), Patterns of displacement along large normal faults:\nImplications for basin evolution and fault propagation, based on exam-\nples from East Africa, AAPG Bull., 83, 613–634.\nPierce, K. L. (1985), Quaternary history of faulting on the Arco segment of\nthe Lost River fault, central Idaho, in Proceedings of Workshop XXVIII on\nthe Borah Peak, Idaho, Earthquake, edited by R. S. Stein and R. C.\nBucknam, U.S. Geol. Surv. Open File Rep., 85-290, 195–206.\nPierce, K. L., and W. E. Scott (1982), Pleistocene episodes of alluvial-\ngravel deposition, southeastern Idaho, in Cenozoic Geology of Idaho,\nedited by B. Bonnichsen and R. M. Breckenridge, Bull. Idaho Bur. Mines\nGeol., 26, 685–702.\nReheis, M. C., J. L. Slate, C. K. Throckmorton, J. P. McGeehin, A. M.\nSarna-Wojcicki, and L. Dengler (1996), Late Quaternary sedimentation\non the Leidy Creek fan, Nevada-California: Geomorphic responses to\nclimate change, Basin Res., 12, 279–299.\nRoberts, G. P., P. Cowie, I. Papanikolaou, and A. M. Michetti (2004), Fault\nscaling relationships, deformation rates and seismic hazards: An example\nfrom the Lazio-Abruzzo Apennines, central Italy, J. Struct. Geol., 26,\n377–398.\nRodgers, D. W., and M. H. Anders (1990), Neogene evolution of Birch\nCreek Valley near Lone Pine, Idaho, in Geologic Field Tours of Western\nWyoming and Parts of Adjacent Idaho, Montana, and Utah, edited by\nS. Roberts, Public Info. Circ. Geol. Surv. Wyo., 29, 27–38.\nSchlische, R. W., S. S. Young, R. V. Ackermann, and A. Gupta (1996),\nGeometry and scaling relations of a population of very small rift-related\nnormal faults, Geology, 24, 683–686.\nSchmidt, K. M., and D. R. Montgomery (1995), Limits to relief, Science,\n270, 617–620.\nScholz, C. H. (2002), The Mechanics of Earthquakes and Faulting, 471 pp.,\nCambridge Univ. Press, New York.\nScholz, C. H., and T. M. Lawler (2004), Slip tapers at the tips of faults and\nearthquake ruptures, Geophys. Res. Lett., 31, L21609, doi:10.1029\/\n2004GL021030.\nSchultz, D. M., and R. J. Trapp (2003), Nonclassical cold-frontal structure\ncaused by dry subcloud air in northern Utah during the Intermountain\nPrecipitation Experiment (IPEX), Mon. Weather Rev., 131, 2222–2246.\nShipton, Z. K., and P. A. Cowie (2001), Damage zone and slip-surface\nevolution over mm to km scales in high-porosity Navajo Sandstone, Utah,\nJ. Struct. Geol., 23, 1825–1844.\nSklar, L., and W. E. Dietrich (1998), River longitudinal profiles and bed-\nrock incision models: Stream power and the influence of sediment supply,\nin Rivers Over Rock: Fluvial Processes in Bedrock Channels, Geophys.\nMonogr. Ser., vol. 107, edited by K. J. Tinkler and E. E. Wohl, pp. 237–\n260, AGU, Washington, D. C.\nF03S08 DENSMORE ET AL.: TRANSIENT LANDSCAPES AT FAULT TIPS\n15 of 16\nF03S08\nSnyder, N. P., K. X. Whipple, G. E. Tucker, and D. J. Merritts (2000),\nLandscape response to tectonic forcing: Digital elevation model analysis\nof stream profiles in the Mendocino triple junction region, northern\nCalifornia, Geol. Soc. Am. Bull., 112, 1250–1263.\nSteenburgh, W. J. (2003), One hundred inches in one hundred hours: Evo-\nlution of a Wasatch Mountain winter storm cycle, Weather Forecast., 18,\n1018–1036.\nStock, J., and W. E. Dietrich (2003), Valley incision by debris flows:\nEvidence of a topographic signature, Water Resour. Res., 39(4), 1089,\ndoi:10.1029\/2001WR001057.\nStock, J. D., and W. E. Dietrich (2006), Erosion of steepland valleys by\ndebris flows, Geol. Soc. Am. Bull., 118, 1125–1148, doi:10.1130\/\nB25902.1.\nTarboton, D. G., R. L. Bras, and I. Rodriguez-Iturbe (1992), A physical\nbasis for drainage density, Geomorphology, 5, 59–76.\nWhipple, K. X. (2001), Fluvial landscape response time: How plausible is\nsteady-state denudation?, Am. J. Sci., 301, 313–325.\nWhipple, K. X., and T. Dunne (1992), The influence of debris-flow rheol-\nogy on fan morphology, Owens Valley, California, Geol. Soc. Am. Bull.,\n104, 887–900.\nWhipple, K. X., and G. E. Tucker (1999), Dynamics of the stream power\nincision model: Implications for height limits of mountain ranges, land-\nscape response timescales, and research needs, J. Geophys. Res., 104,\n17,661–17,674.\nWillemse, E. J. M. (1997), Segmented normal faults: Correspondence be-\ntween three-dimensional mechanical models and field data, J. Geophys.\nRes., 102, 675–692.\nWobus, C., K. X. Whipple, E. Kirby, N. Snyder, J. Johnson, K. Spyropolou,\nB. Crosby, and D. Sheehan (2006), Tectonics from topography: Proce-\ndures, promises, and pitfalls, in Tectonics, Climate and Landscape Evolu-\ntion, edited by S. D. Willett et al., Spec. Pap. Geol. Soc. Am., 398, 55–74.\n\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\nP. A. Allen and S. Gupta, Department of Earth Science and Engineering,\nImperial College London, South Kensington Campus, London SW7 2AZ,\nUK.\nN. H. Dawers, Department of Earth and Environmental Sciences, Tulane\nUniversity, New Orleans, LA 70118, USA.\nA. L. Densmore, Department of Geography, Durham University, South\nRoad, Durham DH1 3LE, UK. (a.l.densmore@durham.ac.uk)\nF03S08 DENSMORE ET AL.: TRANSIENT LANDSCAPES AT FAULT TIPS\n16 of 16\nF03S08\n"}