{"doi":"10.1109\/TAC.2007.900854","coreId":"140604","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/1954","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/1954","10.1109\/TAC.2007.900854"],"title":"On the Minimization of Maximum Transient Energy Growth.","authors":["Whidborne, James F.","McKernan, John"],"enrichments":{"references":[{"id":37941860,"title":"Bounded peaking in the optimal linear regulatorwithcheapcontrol,”IEEETrans.Autom.Control,vol.AC-23,","authors":[],"date":"1978","doi":"10.1109\/tac.1978.1101792","raw":"B. A. Francis and K. Glover, “Bounded peaking in the optimal linear regulatorwithcheapcontrol,”IEEETrans.Autom.Control,vol.AC-23, no. 4, pp. 608–617, 1978.","cites":null},{"id":37941841,"title":"Constructive Nonlinear Control.","authors":[],"date":"1997","doi":"10.1007\/978-1-4471-0967-9","raw":"R. Sepulchre, M. Jankovic, and P. Kokotovic, Constructive Nonlinear Control. London, U.K.: Springer-Verlag, 1997.","cites":null},{"id":37941858,"title":"Convergent Ritz approximations of the set of stabilizing controllers,”","authors":[],"date":"1999","doi":"10.1016\/s0167-6911(98)00087-5","raw":"A. Linnemann, “Convergent Ritz approximations of the set of stabilizing controllers,” Syst. Contr. Lett., vol. 36, pp. 151–156, 1999.","cites":null},{"id":37941835,"title":"Energy growth in viscous channel ﬂows,”","authors":[],"date":"1993","doi":"10.1017\/s0022112093003738","raw":"S. C. Reddy and D. S. Henningson, “Energy growth in viscous channel ﬂows,” J. Fluid Mech., vol. 252, pp. 209–238, 1993.","cites":null},{"id":37941854,"title":"Grigoriadis, A Uniﬁed Algebraic ApproachtoLinearControlDesign. London,U.K.:Taylor&Francis,","authors":[],"date":"1998","doi":"10.1002\/rnc.694","raw":"R. E. Skelton, T. Iwasaki, and K. M. Grigoriadis, A Uniﬁed Algebraic ApproachtoLinearControlDesign. London,U.K.:Taylor&Francis, 1998.","cites":null},{"id":37941836,"title":"Hydrodynamic stability without eigenvalues,”","authors":[],"date":"1993","doi":"10.1126\/science.261.5121.578","raw":"L. N. Trefethen, A. E. Trefethen, S. C. Reddy, and T. A. Driscoll, “Hydrodynamic stability without eigenvalues,” Science, vol. 261, pp. 578–584, 1993.","cites":null},{"id":37941839,"title":"Limitations of linear control of thermal convection in a porous medium,”","authors":[],"date":"2006","doi":"10.1063\/1.2221354","raw":"H. Zhao and H. H. Bau, “Limitations of linear control of thermal convection in a porous medium,” Phys. Fluids, vol. 18, no. 7, 2006.","cites":null},{"id":37941861,"title":"Linear controller design: Limits of performance via convex optimization,”","authors":[],"date":"1990","doi":"10.1109\/5.52229","raw":"S. Boyd, C. Barratt, and S. Norman, “Linear controller design: Limits of performance via convex optimization,” Proc. IEEE, vol. 78, pp. 529–574, 1990. Consensus Seeking Over Random Weighted Directed Graphs Maurizio Porﬁri, Member, IEEE, and Daniel J. Stilwell, Member, IEEE Abstract—We examine the consensus problem for a group of agents that communicateviaastochasticinformationnetwork.Communicationamong agents is modeled as a weighted directed random graph that switches periodically. The existence of any edge is probabilistic and independent from the existence of any other edge. We further allow each edge to be weighted differently. Sufﬁcient conditions for asymptotic almost sure consensus are presented for the case of positive weights and for the case of arbitrary weights. Index Terms—Consensus problem, directed graphs, fast switching, random graphs, weighted graphs. I. INTRODUCTION In a consensus problem, a set of dynamic agents seeks to agree upon certain quantities of interests based upon shared information. Consensus problems are used to model many different phenomena involving information ﬂow among agents, including ﬂocking, swarming, synchronization, distributed decision making, and schooling; see, e.g., the survey paper [1]. Algebraicgraphtheory [2]isanatural frameworkforanalyzing consensusproblems;see,e.g.,[3]–[6]and[7].Withinthisframework,each agent is modelled as a vertex of a graph, and communication among Manuscript received January 24, 2006; revised August 28, 2006. Recommended by Associate Editor G. Pappas. This work was supported by the National Science Foundation under Grant IIS-0238092 and by the Ofﬁce of Naval Research under Grants N000140310444, N000140510780, and N000140510516. M. Porﬁri is with the Department of Mechanical, Aerospace and Manufacturing Engineering, Polytechnic University, Brooklyn, NY 11201 USA (e-mail: mporﬁri@poly.edu). D. J. Stilwell is with the Bradley Department of Electrical and Computer Engineering, Virginia Polytechnic Institute and State University, Blacksburg, VA 24061 USA (e-mail: stilwell@vt.edu). Digital Object Identiﬁer 10.1109\/TAC.2007.904603 0018-9286\/$25.00 © 2007 IEEE","cites":null},{"id":37941857,"title":"Linear Controller Design: Limits of Performance. Englewood Cliffs,","authors":[],"date":"1991","doi":"10.1137\/1034133","raw":"S. Boyd and C. Barratt, Linear Controller Design: Limits of Performance. Englewood Cliffs, NJ: Prentice-Hall, 1991.","cites":null},{"id":37941853,"title":"Linear System Theory and Design.","authors":[],"date":"1970","doi":null,"raw":"C. T. Chen, Linear System Theory and Design. New York: Holt, Rinehart & Winston, 1970.","cites":null},{"id":37941852,"title":"Mathematical Systems Theory I: Modelling, State Space Analysis, Stability and Robustness.","authors":[],"date":"2005","doi":"10.1108\/03684920510614885","raw":"D. Hinrichsen and A. J. Pritchard, Mathematical Systems Theory I: Modelling, State Space Analysis, Stability and Robustness. Berlin, Germany: Springer, 2005.","cites":null},{"id":37941856,"title":"Matrix Analysis.","authors":[],"date":"1985","doi":"10.1017\/cbo9780511810817","raw":"R. A. Horn and C. R. Johnson, Matrix Analysis. Cambridge, U.K.: Cambridge Univ. Press, 1985.","cites":null},{"id":37941849,"title":"Minimisation of transient perturbation growth in linearised Lorenz equations,” in","authors":[],"date":"2005","doi":"10.3182\/20050703-6-cz-1902.00628","raw":"J. McKernan, J. F. Whidborne, and G. Papadakis, “Minimisation of transient perturbation growth in linearised Lorenz equations,” in Proc. 16th IFAC World Congr., Prague, Czech Republic, Jul. 2005.","cites":null},{"id":37941859,"title":"Minimization of maximum transient energy growth by output feedback,” in","authors":[],"date":"2005","doi":"10.1109\/tac.2007.900854","raw":"J. F. Whidborne, J. McKernan, and A. J. Steer, “Minimization of maximum transient energy growth by output feedback,” in Proc. 16th IFAC World Congr., Prague, Czech Republic, Jul. 2005.","cites":null},{"id":37941848,"title":"Minimization of maximum transient energy growth,” in","authors":[],"date":"2004","doi":"10.1109\/tac.2007.900854","raw":"J. F. Whidborne, J. McKernan, and G. Papadakis, “Minimization of maximum transient energy growth,” in Proc. UKACC Int. Conf. CONTROL 2004, Bath, U.K., Sep. 2004, 065.","cites":null},{"id":37941850,"title":"On minimizing maximum transient energy growth Cranﬁeld Univ.,","authors":[],"date":"2005","doi":null,"raw":"J. F. Whidborne, J. McKernan, and A. J. Steer, On minimizing maximum transient energy growth Cranﬁeld Univ., Cranﬁeld, U.K., 2005, CoA Rep. 0501.","cites":null},{"id":37941842,"title":"On the transientbehaviour ofstable linear systems,” in","authors":[],"date":"2000","doi":null,"raw":"D. HinrichsenandA. J.Pritchard, “On the transientbehaviour ofstable linear systems,” in Proc. 14th Int. Symp. Math. Theory Networks Syst., Perpignan, France, Jun. 2000, B218.","cites":null},{"id":37941834,"title":"Optimal excitation of perturbations in viscous shear ﬂow,”","authors":[],"date":"1988","doi":"10.1063\/1.866609","raw":"B. F. Farrell, “Optimal excitation of perturbations in viscous shear ﬂow,” Phys. Fluids, vol. 31, no. 8, pp. 2093–2102, 1988.","cites":null},{"id":37941855,"title":"Parametrization of all stabilizing controllers via quadratic Lyapunov functions,”","authors":[],"date":"1995","doi":"10.1007\/bf02192228","raw":"T. Iwasaki and R. E. Skelton, “Parametrization of all stabilizing controllers via quadratic Lyapunov functions,” J. Optim. Theory Applicat., vol. 85, no. 2, pp. 291–307, 1995.","cites":null},{"id":37941838,"title":"S.Liu, “Optimaland robust control andestimationof linear paths to transition,”","authors":[],"date":"1998","doi":null,"raw":"T. R.Bewleyand S.Liu, “Optimaland robust control andestimationof linear paths to transition,” J. Fluid Mech., vol. 365, pp. 305–349, 1998.","cites":null},{"id":37941851,"title":"Spectra and Pseudospectra: The Behavior of Nonnormal Matrices and Operators.","authors":[],"date":"2005","doi":"10.1090\/s0273-0979-06-01128-1","raw":"L. N. Trefethen and M. Embree, Spectra and Pseudospectra: The Behavior of Nonnormal Matrices and Operators. Princeton, NJ: Princeton Univ. Press, 2005.","cites":null},{"id":37941837,"title":"Stability and Transition in Shear Flows.","authors":[],"date":"2001","doi":"10.1007\/978-1-4613-0185-1","raw":"P. J. Schmid and D. S. Henningson, Stability and Transition in Shear Flows. New York: Springer, 2001.","cites":null},{"id":37941845,"title":"Stabilization of linear systems with prescribed transient bounds,” in","authors":[],"date":"2004","doi":null,"raw":"E. Plischke and F. Wirth, “Stabilization of linear systems with prescribed transient bounds,” in Proc. 16th Int. Symp. Math. Theory Networks Syst., Leuven, Belgium, Jul. 2004.","cites":null},{"id":37941844,"title":"State feedback stabilization with guaranteed transient bounds,” in","authors":[],"date":"2002","doi":null,"raw":"D. Hinrichsen, E. Plischke, and F. Wirth, “State feedback stabilization with guaranteed transient bounds,” in Proc. 15th Int. Symp. Math. Theory Networks Syst., South Bend, IN, Aug. 2002, 2132.","cites":null},{"id":37941840,"title":"The peaking phenomenon and the global stabilization of nonlinear systems,”","authors":[],"date":"1991","doi":"10.1109\/9.75101","raw":"H. J. Sussmann and P. V. Kokotovic, “The peaking phenomenon and the global stabilization of nonlinear systems,” IEEE Trans. Autom. Control, vol. 36, no. 4, pp. 424–440, 1991.","cites":null},{"id":37941846,"title":"Transient behavior and robustness,” in","authors":[],"date":"2004","doi":"10.1515\/9781400826155.197","raw":"F. Wirth, “Transient behavior and robustness,” in Proc. 16th Int. Symp. Math. Theory Networks Syst., Leuven, Belgium, Jul. 2004.","cites":null},{"id":37941847,"title":"Transient effects of lineardynamical systems,” Ph.D.dissertation,","authors":[],"date":"2005","doi":null,"raw":"E. Plischke, “Transient effects of lineardynamical systems,” Ph.D.dissertation, Universität Bremen, Germany, 2005.","cites":null},{"id":37941843,"title":"Transitory behaviour of uncertain systems,”","authors":[],"date":"2000","doi":"10.1007\/978-1-4612-0179-3_1","raw":"A. J. Pritchard, “Transitory behaviour of uncertain systems,” in Advances in Mathematical Systems Theory: A Volume in Honor of Diederich Hinrichsen, F. Colonius, U. Helmke, D. Prätzel-Wolters, and F. Wirth, Eds. Boston, MA: Birkhäuser, 2000, pp. 1–17.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-09-01T00:00:00Z","abstract":"The problem of minimizing the maximum transient energy growth is considered.\nThis problem has importance in some fluid flow control problems and other\nclasses of nonlinear systems. Conditions for the existence of static controllers\nthat ensure strict dissipativity of the transient energy are established and an\nexplicit parametrization of all such controllers is provided. It also is shown\nthat by means of a Q-parametrization, the problem of minimizing the maximum\ntransient energy growth can be posed as a convex optimization problem that can\nbe solved by means of a Ritz approximation of the free parameter. By considering\nthe transient energy growth at an appropriate sequence of discrete time points,\nthe minimal maximum transient energy growth problem can be posed as a\nsemidefinite program. The theoretical developments are demonstrated on a\nnumerical example","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140604.pdf","fullTextIdentifier":"https:\/\/dspace.lib.cranfield.ac.uk\/bitstream\/1826\/1954\/1\/Minimization%20of%20Max%20Transient%20Energy%20Growth-2007.pdf","pdfHashValue":"dc55c59c0465b6d56e09ad6a781e4e5fbfe790cf","publisher":"IEEE Institute of Electrical and Electronics","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/1954<\/identifier><datestamp>2011-11-14T14:01:28Z<\/datestamp><setSpec>hdl_1826_19<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>On the Minimization of Maximum Transient Energy Growth.<\/dc:title><dc:creator>Whidborne, James F.<\/dc:creator><dc:creator>McKernan, John<\/dc:creator><dc:subject>Fluid flow control<\/dc:subject><dc:subject>linear matrix inequalities<\/dc:subject><dc:subject>linear systems<\/dc:subject><dc:subject>optimization<\/dc:subject><dc:subject>transient response<\/dc:subject><dc:description>The problem of minimizing the maximum transient energy growth is considered.\nThis problem has importance in some fluid flow control problems and other\nclasses of nonlinear systems. Conditions for the existence of static controllers\nthat ensure strict dissipativity of the transient energy are established and an\nexplicit parametrization of all such controllers is provided. It also is shown\nthat by means of a Q-parametrization, the problem of minimizing the maximum\ntransient energy growth can be posed as a convex optimization problem that can\nbe solved by means of a Ritz approximation of the free parameter. By considering\nthe transient energy growth at an appropriate sequence of discrete time points,\nthe minimal maximum transient energy growth problem can be posed as a\nsemidefinite program. The theoretical developments are demonstrated on a\nnumerical example.<\/dc:description><dc:publisher>IEEE Institute of Electrical and Electronics<\/dc:publisher><dc:date>2011-09-29T17:41:34Z<\/dc:date><dc:date>2011-09-29T17:41:34Z<\/dc:date><dc:date>2007-09-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>Whidborne, J. F. McKernan, J.; On the Minimization of Maximum Transient Energy Growth, IEEE Transactions on Automatic Control, 2007, Vol 52, Iss 9, pg1762-1767<\/dc:identifier><dc:identifier>0018-9286<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1109\/TAC.2007.900854<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/1954<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0018-9286","0018-9286"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["Fluid flow control","linear matrix inequalities","linear systems","optimization","transient response"],"subject":["Article"],"fullText":"1762 IEEE TRANSACTIONS ON AUTOMATIC CONTROL, VOL. 52, NO. 9, SEPTEMBER 2007\nFig. 7. Internal dynamics for spline (38).\nFig. 8. Stabilization for spline (38).\nand di\r(5)=dti = di\r(0)=dti, for i = 0; . . . ; 3. The maximum accel-\neration is given by 2.2 m\/s. Fig. 7 shows the internal dynamics trajecto-\nries obtained using the fixed-point approach outlined in Section III. It\nis j\u0012(t)j \u0014 0:085, j _\u0012(t)j \u0014 0:24. The corresponding bounds obtained\nfrom (8) are j\u0012(t)j \u0014 0:4861, j _\u0012(t)j \u0014 1:1727. In this example, these\nbounds appear very conservative. This is justified by the fact that they\nmust apply to any trajectory whose acceleration is bounded by 2.2 m\/s.\nFig. 8 shows the behavior of the closed-loop system obtained with a\nflatness-based stabilizing controller, as considered in [2].\nV. CONCLUSION\nUsing a precise geometric characterization, the method based on the\nPoincaré map used in Section III allows one to find a set of trajecto-\nries that the VTOL can exactly track with bounded internal dynamics,\nwhose estimates depend on the trajectory acceleration.\nREFERENCES\n[1] H. Sastry, J. Hauser, and G. Meyer, “Nonlinear control design for\nslightly non-minimum phase systems: Application to V\/STOL air-\ncraft,” Automatica, vol. 28, pp. 665–679, 1992.\n[2] P. Martin, S. Devasia, and B. Paden, “A different look at output\ntracking: Control of a VTOL aircraft,” Automatica, vol. 32, pp.\n101–107, 1996.\n[3] H. Sira-Ramirez and M. Fliess, “Regulation of non-minimum phase\noutputs in a pvtol aircraft,” in Proc. 37th IEEE Conf. Decision Control\n1998, pp. 4222–4227.\n[4] F. Lin, W. Zhang, and R. D. Brandt, “Robust hovering control of a\npvtol aircraft,” IEEE Trans. Control Syst. Technol., vol. 7, no. 3, pp.\n343–351, 1999.\n[5] C. Huang and K. Yuan, “Output tracking of a non-linear non-minimum\nphase PVTOL aircraft based on non-linear state feedback control,” Int.\nJ. Contr., vol. 75, no. 6, pp. 466–473, 1992.\n[6] L. Marconi, A. Isidori, and A. Serrani, “Autonomous vertical landing\non an oscillating platform: An internal-model based approach,” Auto-\nmatica, no. 38, pp. 21–32, 2002.\n[7] K. Do, Z. Jiang, and J. Pan, “On global tracking control of a VTOL\naircraft without velocity measurements,” IEEE Trans. Autom. Control,\nvol. 48, no. 12, pp. 2212–2217, 2003.\n[8] S. A. Al-Hiddabi and N. H. McClamroch, “Tracking and maneuver reg-\nulation control for nonlinear nonminimum phase systems: Application\nto flight control,” IEEE Trans. Contr. Syst. Technol., vol. 10, no. 6, pp.\n780–792, 2002.\n[9] J. Hauser, A. Saccon, and R. Frezza, “Achievable motorcycle trajecto-\nries,” in Proc. 43rd IEEE Conf. Decision Control, 2004, pp. 3944–3949.\n[10] G. Notarstefano, J. Hauser, and R. Frezza, “Trajectory manifold ex-\nploration for the PVTOL aircraft,” in Proc. 44th IEEE Conf. Decision\nContr.\/2005 Eur. Contr. Conf., 2005, pp. 5848–5853.\n[11] H. Sira-Ramírez, R. Castro-Linares, and E. Licéaga-Castro, “A Li-\nouvillian systems approach for the trajectory planning-based control\nof helicopter models,” Int. J. Robust Nonlinear Contr., vol. 10, pp.\n301–320, 2000.\nOn the Minimization of Maximum Transient\nEnergy Growth\nJames F. Whidborne and John McKernan\nAbstract—The problem of minimizing the maximum transient energy\ngrowth is considered. This problem has importance in some fluid flow con-\ntrol problems and other classes of nonlinear systems. Conditions for the\nexistence of static controllers that ensure strict dissipativity of the tran-\nsient energy are established and an explicit parametrization of all such con-\ntrollers is provided. It also is shown that by means of a -parametrization,\nthe problem of minimizing the maximum transient energy growth can be\nposed as a convex optimization problem that can be solved by means of a\nRitz approximation of the free parameter. By considering the transient en-\nergy growth at an appropriate sequence of discrete time points, the minimal\nmaximum transient energy growth problem can be posed as a semidefinite\nprogram. The theoretical developments are demonstrated on a numerical\nexample.\nIndex Terms—Fluid flow control, linear matrix inequalities, linear sys-\ntems, optimization, transient response.\nI. INTRODUCTION\nFollowing some initial perturbation to the state of a stable linear\nsystem, it is possible for the magnitude of the system state trajectory to\ngrow to a large value before decreasing and converging to the origin.\nThis can occur even though all the eigenvalues may have very negative\nreal parts and no imaginary parts. This behavior is highly undesirable,\nManuscript received August 30, 2005; revised August 21, 2006 and March\n30, 2007. Recommended by Associate Editor M. Kothare.\nJ. F. Whidborne is with the Department of Aerospace Sciences, Cranfield\nUniversity, Bedfordshire MK43 0AL, U.K. (e-mail: j.f.whidborne@cran-\nfield.ac.uk).\nJ. McKernan is with EIP Ltd., London WC1V 6HU, U.K.\nDigital Object Identifier 10.1109\/TAC.2007.900854\n0018-9286\/$25.00 © 2007 IEEE\nIEEE TRANSACTIONS ON AUTOMATIC CONTROL, VOL. 52, NO. 9, SEPTEMBER 2007 1763\nparticularly for certain nonlinear systems, where although linear eigen-\nvalue analysis at an equilibrium point indicates very good stability, very\nsmall initial perturbations in the state variables may cause them to leave\nthe domain of attraction resulting in instability.\nThis phenomenon is known to occur in fluid dynamic systems. For\nexample, laminar flow can become turbulent even for Reynolds num-\nbers for which linear stability analysis predicts stable eigenvalues. The\nreason for this was not widely recognized by fluid dynamicists until\nfairly recently [1]–[3]. The energy of the velocity perturbations is the\nsquare of the (appropriately weighted) Euclidian distance of the state\nfrom the origin, and the maximum energy following an initial unit en-\nergy state perturbation is sometimes used as a stability measure for\nfluid dynamics systems [2], [4]. Hence for fluid flow control systems, a\nuseful control objective is the minimization of the maximum transient\nenergy growth of the flow perturbations [5], [6]. Reducing the max-\nimum transient energy growth is also important for a class of partially\nlinear cascade systems initially investigated by Sussmann and Koko-\ntovic [7]; see [8] for a review.\nThe problem of constraining transient trajectory norms has been re-\ncently considered elsewhere [9]–[14]. In fact, an upper bound on the\nmaximum transient energy growth can be obtained by a simple Lya-\npunov inequality, and so this upper bound can be minimized by a linear\nmatrix inequality (LMI) approach [15]. However, in this paper, the min-\nimization of the actual maximum transient energy growth is considered\nrather than the upper bound. The upper bound problem is presented for\ncompleteness and comparison.\nLarge transient energy growth behavior is often associated with non-\nnormality of the system state matrix [3]. While it can be shown that\nif the system state matrix is normal, there will be no transient energy\ngrowth, the converse is not true. That is, normality of the system state\nmatrix is a sufficient but not a necessary condition for no transient en-\nergy growth [16]. The role of normality in affecting the transient be-\nhavior is explored in more depth in [17] and [18].\nThis paper is organized as follows. In Section II, following definitions\nof transient energy and maximum transient energy growth, conditions\nfor unity maximum transient energy growth are established. Conditions\nthat ensure strict dissipativity of the transient energy are provided.\nAn upper bound on the maximum transient energy growth is given,\nand methods for evaluating the maximum transient energy growth\nand the upper bound are proposed. Section III considers the problem\nof determining static gain controllers that minimize the maximum\ntransient energy growth. An explicit parametrization of all linear\ncontrollers that ensure strict dissipativity is provided. For systems\nwhere such controllers do not exist, a state feedback static controller\nthat minimizes the upper bound may be determined. In Section IV,\ndynamic feedback controllers are considered. First, it is shown that if\nno static gain controller that restricts the maximum transient energy\ngrowth to unity exists, then no dynamic controller exists either. It is\nthen shown that the problem of determining a controller to minimize\nthe actual maximum transient energy growth (rather than the upper\nbound) may be solved by convex optimization over the free parameter\nin a Q-parametrization of the problem. Furthermore, by considering\nthe response at a finite set of time points, an approximation of the\nproblem can posed as a semidefinite program that can be solved\nusing standard methods. In Section V, the theory is illustrated with\na numerical example. Concluding remarks are given in the final\nsection.\nIn this paper, the following notation is used.\nkxk :=\np\nxT x Euclidian 2-norm of a vector x.\nMT Transpose of a matrix M .\nM? Left null space of a matrix M ,\nthat is, M? = UT2 , where\n[U1 U2 ]\n\u000611 0\n0 0\nV1\nV2\n= M is\nthe singular value decomposition of\nM .\nvec(M) Vector formed by stacking the columns\nof matrix M .\n\u0015max(M) and \u0015min(M) Largest and smallest eigenvalues,\nrespectively, of the symmetric matrix\nM = MT .\nM > 0 (M \u0015 0) Symmetric matrix M is positive\ndefinite (semidefinite).\nIn Identity matrix of dimension n\u0002 n.\n0n n \u0002 n matrix of zeros.\nAlso jjjM jjj := max p\u0015i : \u0015i are the eigenvalues of MTM is the\nspectral norm of a real matrix M .\nII. MAXIMUM TRANSIENT ENERGY GROWTH\nConsider the asymptotically stable linear time-invariant system de-\nscribed by the initial value problem\n_x(t) = Ax(t); x(0) = x0 (1)\nwith A 2 n\u0002n, x0 2 n, which has the continuous solution x :\n+ ! n; t 7! \b(t)x0, where \b(t) is the state transition matrix\ngiven by \b(t) = eAt = 1\ni=0\nAiti=i!.\nDefinition 1: The transient energy E(t) is defined as E(t) :=\nmax kx(t)k2 : kx0k = 1 .\nDefinition 2: The maximum transient energy growth E is defined as\nE := max fE(t) : t \u0015 0g.\nLemma 1: The maximum transient energy growth E of the system\ndescribed by (1) is lower bounded by unity.\nProof: At t = 0, then x(0) = x0 and kx0k = 1. Hence\nmax fE(t) : t \u0015 0g \u0015 1.\nThe following lemma gives the conditions on the state matrix A for\nthere to be unity transient energy growth.\nLemma 2: The maximum transient energy growth E of the system\ndescribed by (1) is unity if and only if A + AT \u0014 0.\nProof:\nSufficiency: If d kx(t)k2 =dt \u0014 0 for all t \u0015 0 and all\nfx(t) : kx0k = 1g, then max fkx(t)k : t \u0015 0g = kx(0)k = 1.\nDifferentiating kx(t)k2 gives dxT (t)x(t)=dt = xT (t)(A+AT )x(t),\nwhich, if A + AT \u0014 0, is nonpositive for all x(t), t \u0015 0.\nNecessity: IfA+AT 0, then there exists an x such thatxT (A+\nAT )x > 0; hence there exists an x0 such that xT (A + AT )x > 0 at\nt = 0. Thus kx(t)k2 > 1 for some t > 0, so it is necessary that\nA+ AT \u0014 0.\nIf A + AT > 0, then E can be evaluated by means of a line search\nover time of the spectral norm of \b(t), since it is well known that\njjjM jjj = max fkMxk : kxk = 1g. Monotonically decreasing and in-\ncreasing upper bounds on the E(t) are available, e.g., [19, p. 138], and\nthese can be used to provide the search interval of t and a maximum\nstep size. However, the bounds can be very conservative and hence the\nsearch can be inefficient. The search procedure can be improved by es-\ntablishing the necessary conditions for a maximum point of jjj\b(t)jjj.\nClearly, at a turning point, the state derivative vector _x(t) should be\northogonal to the state vector x(t). Thus a local search can be made\nover t to obtain the inner product of _x(t) and x(t) to be zero, that is,\nxT (t)Ax(t) = 0. Additional investigation and bounds are provided in\n[14].\nLemma 3: Consider the system described by (1). Then there exists\n\f < 0 such that E(t) \u0014 e\ft for all t \u0015 0 if and only if A + AT < 0.\nThis condition is known as strict dissipativity [12], [20, p. 660].\n1764 IEEE TRANSACTIONS ON AUTOMATIC CONTROL, VOL. 52, NO. 9, SEPTEMBER 2007\nProof: Similarly to Lemma 2, A + AT < 0 is equivalent to\nd kx(t)k2 =dt \u0014 \f < 0 for all t \u0015 0 and all fx(t) : kx0k = 1g.\nAt t = 0, E(t) = e\ft = 1 and de\ft=dt = \f. Furthermore, at t = 0,\nde\ft=dt is minimal for t \u0015 0. Hence E(t) \u0014 e\ft for all t \u0015 0.\nRemark 1: It is clear that strict dissipativity is a sufficient condition\nfor unity transient energy growth with asymptotic stability.\nAn upper bound on the maximum transient energy growth can be\nobtained by means of a Lyapunov function that describes an ellipsoid\nthat bounds the trajectory.\nLemma 4: Eu \u0015 E is an upper bound on the maximum transient\nenergy growth E for a system described by (1), where\nEu := \u0015max(P )\u0015max(P\n\u00001) (2)\nwhere P = P T > 0 satisfies\nPA +ATP \u0014 0: (3)\nProof: The function L(x) = xTPx is a (nonstrict) Lyapunov\nfunction if dL=dt \u0014 0, that is, if P satisfies PA+ATP \u0014 0. If L(x)\nis a Lyapunov function, then if x(0) is in the ellipsoidal set f\u0018TP\u0018 \u0014\n1g, then x(t) will remain in set f\u0018TP\u0018 \u0014 1g for all t \u0015 0. Since\n\u0015min(P ) k\u0018k\n2 \u0014 \u0018TP\u0018 \u0014 \u0015max(P ) k\u0018k\n2 [21, Th. 8.18]; the identity\n\u0015min(P ) = 1=\u0015max(P\n\u00001) gives (2).\nNote that \u0015max(P ) = jjjP jjj and that \u0015max(P )\u0015max(P\u00001) =\njjjP jjj P\u00001 , the well-known condition number of P .\nA minimal upper bound can be obtained by solving the following\nLMI generalized eigenvalue problem (GEVP) [14, p. 75]:\nmin \r\nsubject to I \u0014 P \u0014 \rI; PA+ ATP \u0014 0 (4)\nwhere P > 0 is real and symmetric. The inequality I \u0014 P \u0014 \rI en-\nsures that \r \u0015 \u0015max(P ) \u0015 \u0015min(P ) \u0015 1; thus \u0015max(P )=\u0015min(P ) \u0014\n\r and so E \u0014 Eu \u0014 \r.\nRemark 2: Solving (4) has considerable numerical difficulties [14,\np. 75]; however, suboptimal solutions can be obtained by tightening (3)\nto be a strict inequality as in [15, p. 65]\nPA +ATP < 0: (5)\nIn addition, using the strict Lyapunov inequality ensures that solutions\nto the control problem (13) are asymptotically stable.\nIII. OPTIMAL STATIC GAIN FEEDBACK CONTROLLERS\nNow consider the linear time-invariant plant\n_x(t) =Ax(t) +Bu(t); x(0) = x0\ny(t) =Cx(t) (6)\nwhere A 2 n\u0002n, x(t) 2 n, B 2 n\u0002`, C 2 m\u0002n, u : + ! `\nis a piecewise continuous function and y : + ! m is a piecewise\ncontinuous function. Furthermore, it is assumed that BTB > 0, that\nis, B has full column rank; and CCT > 0, that is, C has full row rank,\n(i.e., all actuators and sensors are independent).\nThe next theorem provides conditions for all static output feedback\ncontrollers that have strict dissipativity.\nTheorem 1: For the system of (6), the following are equivalent.\n1) There exists a control u = Ky, whereK is a constant matrix such\nthat the closed-loop system has strict dissipativity.\n2) The following two conditions hold:\nB? A +AT B?T < 0 or BBT > 0 (7)\nCT? A+ AT CT?T < 0 or CTC > 0: (8)\nFurthermore, if the above statements hold, all controller ma-\ntrices K that ensure strict dissipativity are given by K =\n\u0000R\u00001BT\tCT (C\tCT )\u00001 + S1=2L(C\tCT )\u00001=2, where\nS := R\u00001 \u0000 R\u00001BT \t\u0000\tCT (C\tCT )\u00001C\t BR\u00001, where L\nis an arbitrary matrix such that jjjLjjj < 1 and R > 0 is an arbitrary\nmatrix such that\n\t := BR\u00001BT \u0000A \u0000AT\n\u00001\n> 0: (9)\nProof: For the closed-loop system transient energy to satisfy\nLemma 3 and have strict dissipativity, it is required that\n(A+BKC) + (A+BKC)T < 0: (10)\nThe remainder follows directly by application of [22, Th. 2.3.12.], with\nthe condition that B is full column rank and C has full row rank.\nRemark 3: A matrix R that satisfies (9) can be obtained by R =\nI=\u001a. For the case whereBBT > 0 (i.e.,B is full rank n), \u001a is obtained\nsimply by rearranging BRBT \u0000 A\u0000 AT > 0 giving the inequality\n\u001a > \u0015max(B\n\u00001(A+ AT )(BT )\u00001): (11)\nFor the case where B?(A+AT )B?T < 0, \u001a is obtained by an appli-\ncation of [22, Th. 2.3.10], this being an extension to Finsler’s theorem.\nIf (3) in Lemma 4 is replaced by the strict Lyapunov inequality (5) in\norder to ensure asymptotic stability, then Theorem 1 can be extended\nto characterize all controllers that satisfy this inequality [23]. However,\nthe problem of determining a P is nonconvex for most cases. IfC = I ,\nthat is, the state feedback case, the problem can be solved [15], [23,\np. 100]. Expanding (5) for u = Kx gives PA + ATP + PBK +\nKTBTP < 0. By the change of variable, Q = P\u00001 and Y = KQ,\nthe LMI\nAQ+QAT +BY + Y TBT < 0 (12)\nis obtained. Now since \u0015max(P )\u0015max(P\u00001) = \u0015max(Q)\u0015max(Q\u00001),\na controller that minimizes the upper bound on the maximum transient\nenergy growth can be obtained by solving the following LMI GEVP:\nmin \r\nsubject to I \u0014 Q \u0014 \rI\nAQ+QAT +BY + Y TBT < 0; Q = QT (13)\nand the upper bound minimizing controller is K = Y Q\u00001.\nIV. OPTIMAL DYNAMIC FEEDBACK CONTROLLERS\nConsider the linear time-invariant plant\n_x(t) =Ax(t) +Bu(t); x(0) = x0\ny(t) =Cx(t) (14)\nwith A 2 n\u0002n, x(t) 2 n, B 2 n\u0002`, u(t) 2 `, C 2 m\u0002n,\ny(t) 2 m, with feedback controller\n_xk(t) =Akxk(t) +Bky(t); xk(0) = xk0\nu(t) =Ckxk(t) +Dky(t) (15)\nwith Ak 2 n \u0002n , Bk 2 n \u0002m, C 2 `\u0002n , D 2 `\u0002m. The\nclosed-loop system is given by\n_xc(t) = Acxc(t); xc(0) = xc0 (16)\nwhere\nAc :=\nA +BDkC BCk\nBkC Ak\n; xc(t) :=\nx(t)\nxk(t)\n: (17)\nIEEE TRANSACTIONS ON AUTOMATIC CONTROL, VOL. 52, NO. 9, SEPTEMBER 2007 1765\nA. Unity Maximum Transient Energy Growth\nLemma 5: A necessary condition for unity maximum transient en-\nergy growth E = 1 of the plant (14) with a stabilizing feedback con-\ntroller (15) is that (A + BDkC) + (A + BDkC)T \u0014 0.\nProof: From Definition 1, the transient energy of the plant (14)\nis given by E(t) := max kx(t)k2 : kx0k = 1; xk0 = 0 . Let us\nreplace E(t) by a modified energy function E\u000f(t), where E\u000f(t) :=\nmax kW\u000fxc(t)k\n2 : W\u00001\u000f xc0 = 1 , where W\u000f := diag(In; \u000fIn )\nand \u000f 2 +. Clearly as \u000f ! 0, E\u000f ! E . Applying Lemma 2 to (17),\nmaxfE\u000f(t)g = 1 if and only if W\u000f(Ac + ATc )W\u000f \u0014 0, that is\nAD +A\nT\nD (BCk + (BCk)\nT )\u000f\n(BkC + C\nTBTk )\u000f (Ak +A\nT\nk )\u000f\n2 \u0014 0 (18)\nwhere AD = A + BDkC. Since all the principal submatrices of\na negative semidefinite matrix are negative semidefinite [24, p. 397],\n(A+BDkC)+ (A+BDkC)\nT \u0014 0 is a necessary condition for (18)\nto hold and for E = 1.\nRemark 4: From the above lemma, it is clear that if no static con-\ntroller that achieves unity maximum transient energy growth exists,\nthen no dynamic controller exists either.\nB. Minimal Transient Energy Growth by Convex Optimization\nThe transient energy of the plant is E(t) =\nmax kx(t)k2 : kx0k = 1; xk0 = 0 and can be evalu-\nated by jjj\bc(t)jjj, where \bc(t) := [In 0n ]eA t[In 0n ]T . The\noperation max fE(t) : t \u0015 0g represents a norm on the matrix\nfunction \bc(t). By means of a Q-parametrization, control system\nperformance indexes that are norms can be minimized by exploiting\nthe convex properties of norms [25]. For simplicity, here we just\nconsider the case for an open-loop stable system; details on a\nparametrization for the unstable case are given in [25]. Assuming that\nthe system given by (14) is stable, a convex realization of \bc(t) is\ngiven by \bc(t) = L\u00001 [\bc(s)] = 1=2\u0019 j1\u0000j1 \bc(s)e\nstds, where\n\bc(s) = U1(s) + U2(s)Q(s)U3(s) with U1(s) = (sI \u0000 A)\u00001,\nU2(s) = (sI \u0000 A)\n\u00001B, U3(s) = C(sI \u0000 A)\n\u00001\n, and Q(s) is the\nfree parameter transfer function matrix with dimension ` \u0002m and is\nstable and proper.\nThe problem is then posed as follows:\nEmin = min\nstable Q\nmax\nt\u00150\njjj\bc(t)jjj : (19)\nApproximations of the set of all stable, proper Q(s) can be param-\neterized by means of a Ritz approximation [25], [26] of Q(s) given\nby ~Q(s). The final optimal controller is given by Kopt(s) = (I +\n~Qopt(s)C(sI \u0000 A)\n\u00001B)\u00001 ~Qopt(s).\nUsing a state-space basis for the Ritz approximation [26], some\nexamples of the above problem appear in [27]. However, the search\nover time for the peak of the maximum transient energy growth, de-\nscribed in Section II, is computationally intensive, and so the method\nis very inefficient. However, the problem can be solved approxi-\nmately by choosing an appropriate sequence of unique points in time,\nftig\nN\ni=1 = ft1; t2; . . . ; tNg, ti > 0, and minimizing the maximum\nenergy growth over all ti. This translates simply into an LMI, since it\nis well known that, for some real matrix M\njjjM jjj < \r ,\n\rI M\nMT \rI\n> 0: (20)\nThus if at each time point ti the following LMI is satisfied:\n\rIn \bc(ti)\n\bTc (ti) \rIn\n> 0 (21)\nFig. 1. Open-loop transient energy.\nthen, provided ftigNi=1 is appropriately chosen, the problem given by\n(19) will be approximately solved. Since \bc(t) is a continuous func-\ntion, asN increases and the intervals between adjacent time-points de-\ncrease, the approximation accuracy will increase and E \r2. Hence\nthe problem given by (19) can be approximated by the semidefinite pro-\ngram (SDP)\nmin \r\nsubject to \rIn \bc(ti; ~q)\n\bTc (ti; ~q) \rIn\n>0; i = 1; . . . ; N (22)\nwhere ~q = vec( ~Q) and\b(ti; ~q) depends affinely on the decision vector\n~q. The problem can be solved using standard SDP software.\nThe choice of ftigNi=1 can be made by observation of the transient\nenergy response E(t) after the optimization. This requires some trial\nand error, but for the examples given in the next section, it is quite\neasy. The points are simply chosen to be sufficiently close to each other\nwhere E(t) is near its maximum and can be more widely spread else-\nwhere. Development of a rigorous method remains for future work.\nV. EXAMPLE\nThe linear system plant with\nA =\n\u00001 0 0 0 0 0 \u0000625\n0 \u00001 \u000030 400 0 0 250\n\u00002 0 \u00001 0 0 0 30\n5 \u00001 5 \u00001 0 0 200\n11 1 25 \u000010 \u00001 1 \u0000200\n200 0 0 \u0000150 \u0000100 \u00001 \u00001000\n1 0 0 0 0 0 \u00001\n(23)\nand\nB =\nI4\n04\n(24)\nis from [12]. The maximum transient energy growth for the open-loop\nsystem is calculated as E = 358148 by means of a line search over\ntime of the spectral norm of \b(t). The transient energy E(t) is shown\nin Fig. 1. Solving the GEVP of (4), an upper bound on E is obtained as\nEu = 439709.\nNo state feedback controller providing asymptotic stability and unity\nmaximum transient energy growth was found to exist. The GEVP of\n(13) is solved to obtain a controller that minimizes the upper bound\non the maximum transient energy growth. The minimal upper bound is\n1766 IEEE TRANSACTIONS ON AUTOMATIC CONTROL, VOL. 52, NO. 9, SEPTEMBER 2007\nTABLE I\nSOLUTIONS TO SEQUENCE OF APPROXIMANT SDPS\nFig. 2. Transient energy with an upper bound minimizing controller.\nFig. 3. Transient energy with an approximately minimizing state feedback con-\ntroller with = 8.\nEu = 178:47 with maximum transient energy growth of E = 65:99.\nThe transient energy of the closed-loop system E(t) is shown in Fig. 2.\nNote that initially E(t) rises very quickly (within 10 \u0016s) from 1 to about\n30.5. This is a consequence of the very large gains in K . An LMI that\nalso constrains the control effort energy has been proposed in [17].\nThe dynamic controller problem with C = I7 is now considered.\nA sequence of SDPs given by (22) was solved using Ritz approxima-\ntions formed from eigenvalues located at\u000050, as described in [26]. The\ndegree of the Ritz approximations is given by nq . The time sequence\nftig\nN\ni=1 was kept constant for the whole sequence of problems, and was\nchosen by trial and error. Table I shows the solutions to the SDPs along\nwith the actual maximum transient energy growth resulting from the\nFig. 4. Transient energy with an approximately minimizing output feedback\ncontroller with = 9.\ncontrollers obtained from solving (22). It can be seen that the solution\nconverges with increasing nq . For nq \u0015 9, the chosen time sequence\nftig\nN\ni=1 is no longer dense enough to give a good approximation to\nthe E minimization problem. The transient energy of the closed-loop\nsystem E(t) for the controller for nq = 8 is shown in Fig. 3. Again,\nE(t) initially rises very rapidly.\nFinally, it is assumed that only the sixth state variable can be mea-\nsured. Eigenvalues located at \u000050 are again chosen for the Ritz ap-\nproximation. For a Ritz approximant of degree nq = 9, the maximum\ntransient energy gain is E = 11919. The transient energy E(t) of the\nresulting closed-loop system is shown in Fig. 4.\nVI. CONCLUDING REMARKS\nUpper bound problem LMIs have been suggested previously [15],\nand some similar results have also appeared recently [11], [12], [14].\nThese have been extended to consider the robust problem in [13]. Other\nupper bounds have been proposed in [9].\nThe proposed method for minimizing the maximum transient en-\nergy growth approach can also be used for other norms of the tran-\nsient response such as the L1-norm [18] that has been used to investi-\ngate bounded peaking for linear quadratic optimal control [28]. Inves-\ntigation of other norms such as those used in [14] remains for further\nwork. Also remaining is a methodical determination of an appropriate\nsequence of time points ftigNi=1 so that the problem is solved to a pre-\nspecified accuracy.\nThe controllers resulting from the Q-parametrization are high order\nand high gain, and although they lead to low maximum transient energy\ngrowth, it is clear that these controllers do not necessarily provide good\ncontrol system designs. The intention is not necessarily to design con-\ntrollers that meet all desired closed-loop requirements but to provide\ndesigners with a means of determining the minimum of the maximum\ntransient energy gain so that the specifications for the controller design\ncan be sensibly set. Alternatively, additional performance criteria can\nbe included in the SDP to improve the design. Note that the results of\nIEEE TRANSACTIONS ON AUTOMATIC CONTROL, VOL. 52, NO. 9, SEPTEMBER 2007 1767\n[11] and [12] allow for the inclusion of a decay rate constraint, i.e.,\neAt < Me\u000bt. The inclusion of time-domain constraints to “shape”\nE(t) is straightforward within the proposed approach.\nAnother difficulty with theQ-parametrization approach is the choice\nof the eigenvalues for the Ritz approximation. This is discussed in more\ndetail in [26]. The Q-parametrization allows for an observer structure\nthat includes state and estimator gain matrices [29]. This is required if\nthe plant is not open-loop stable. However, the suboptimal state feed-\nback controller from Section III could be used in the observer struc-\nture, and it is envisaged that this may improve convergence of the Ritz\napproximation. Determining an appropriate suboptimal estimator gain\nmatrix remains for future work, as does consideration of the robust\nproblem.\nREFERENCES\n[1] B. F. Farrell, “Optimal excitation of perturbations in viscous shear\nflow,” Phys. Fluids, vol. 31, no. 8, pp. 2093–2102, 1988.\n[2] S. C. Reddy and D. S. Henningson, “Energy growth in viscous channel\nflows,” J. Fluid Mech., vol. 252, pp. 209–238, 1993.\n[3] L. N. Trefethen, A. E. Trefethen, S. C. Reddy, and T. A. Driscoll,\n“Hydrodynamic stability without eigenvalues,” Science, vol. 261, pp.\n578–584, 1993.\n[4] P. J. Schmid and D. S. Henningson, Stability and Transition in Shear\nFlows. New York: Springer, 2001.\n[5] T. R. Bewley and S. Liu, “Optimal and robust control and estimation of\nlinear paths to transition,” J. Fluid Mech., vol. 365, pp. 305–349, 1998.\n[6] H. Zhao and H. H. Bau, “Limitations of linear control of thermal con-\nvection in a porous medium,” Phys. Fluids, vol. 18, no. 7, 2006.\n[7] H. J. Sussmann and P. V. Kokotovic, “The peaking phenomenon and\nthe global stabilization of nonlinear systems,” IEEE Trans. Autom.\nControl, vol. 36, no. 4, pp. 424–440, 1991.\n[8] R. Sepulchre, M. Jankovic, and P. Kokotovic, Constructive Nonlinear\nControl. London, U.K.: Springer-Verlag, 1997.\n[9] D. Hinrichsen and A. J. Pritchard, “On the transient behaviour of stable\nlinear systems,” in Proc. 14th Int. Symp. Math. Theory Networks Syst.,\nPerpignan, France, Jun. 2000, B218.\n[10] A. J. Pritchard, “Transitory behaviour of uncertain systems,” in\nAdvances in Mathematical Systems Theory: A Volume in Honor of\nDiederich Hinrichsen, F. Colonius, U. Helmke, D. Prätzel-Wolters,\nand F. Wirth, Eds. Boston, MA: Birkhäuser, 2000, pp. 1–17.\n[11] D. Hinrichsen, E. Plischke, and F. Wirth, “State feedback stabiliza-\ntion with guaranteed transient bounds,” in Proc. 15th Int. Symp. Math.\nTheory Networks Syst., South Bend, IN, Aug. 2002, 2132.\n[12] E. Plischke and F. Wirth, “Stabilization of linear systems with pre-\nscribed transient bounds,” in Proc. 16th Int. Symp. Math. Theory Net-\nworks Syst., Leuven, Belgium, Jul. 2004.\n[13] F. Wirth, “Transient behavior and robustness,” in Proc. 16th Int. Symp.\nMath. Theory Networks Syst., Leuven, Belgium, Jul. 2004.\n[14] E. Plischke, “Transient effects of linear dynamical systems,” Ph.D. dis-\nsertation, Universität Bremen, Germany, 2005.\n[15] S. Boyd, L. El Ghaoui, E. Feron, and V. Balakrishnan, Linear Matrix\nInequalities in System and Control Theory. Philadelphia, PA: SIAM,\n1994.\n[16] J. F. Whidborne, J. McKernan, and G. Papadakis, “Minimization of\nmaximum transient energy growth,” in Proc. UKACC Int. Conf. CON-\nTROL 2004, Bath, U.K., Sep. 2004, 065.\n[17] J. McKernan, J. F. Whidborne, and G. Papadakis, “Minimisation of\ntransient perturbation growth in linearised Lorenz equations,” in Proc.\n16th IFAC World Congr., Prague, Czech Republic, Jul. 2005.\n[18] J. F. Whidborne, J. McKernan, and A. J. Steer, On minimizing max-\nimum transient energy growth Cranfield Univ., Cranfield, U.K., 2005,\nCoA Rep. 0501.\n[19] L. N. Trefethen and M. Embree, Spectra and Pseudospectra: The\nBehavior of Nonnormal Matrices and Operators. Princeton, NJ:\nPrinceton Univ. Press, 2005.\n[20] D. Hinrichsen and A. J. Pritchard, Mathematical Systems Theory I:\nModelling, State Space Analysis, Stability and Robustness. Berlin,\nGermany: Springer, 2005.\n[21] C. T. Chen, Linear System Theory and Design. New York: Holt,\nRinehart & Winston, 1970.\n[22] R. E. Skelton, T. Iwasaki, and K. M. Grigoriadis, A Unified Algebraic\nApproach to Linear Control Design. London, U.K.: Taylor & Francis,\n1998.\n[23] T. Iwasaki and R. E. Skelton, “Parametrization of all stabilizing con-\ntrollers via quadratic Lyapunov functions,” J. Optim. Theory Applicat.,\nvol. 85, no. 2, pp. 291–307, 1995.\n[24] R. A. Horn and C. R. Johnson, Matrix Analysis. Cambridge, U.K.:\nCambridge Univ. Press, 1985.\n[25] S. Boyd and C. Barratt, Linear Controller Design: Limits of Perfor-\nmance. Englewood Cliffs, NJ: Prentice-Hall, 1991.\n[26] A. Linnemann, “Convergent Ritz approximations of the set of stabi-\nlizing controllers,” Syst. Contr. Lett., vol. 36, pp. 151–156, 1999.\n[27] J. F. Whidborne, J. McKernan, and A. J. Steer, “Minimization of max-\nimum transient energy growth by output feedback,” in Proc. 16th IFAC\nWorld Congr., Prague, Czech Republic, Jul. 2005.\n[28] B. A. Francis and K. Glover, “Bounded peaking in the optimal linear\nregulator with cheap control,” IEEE Trans. Autom. Control, vol. AC-23,\nno. 4, pp. 608–617, 1978.\n[29] S. Boyd, C. Barratt, and S. Norman, “Linear controller design: Limits\nof performance via convex optimization,” Proc. IEEE, vol. 78, pp.\n529–574, 1990.\nConsensus Seeking Over Random Weighted Directed\nGraphs\nMaurizio Porfiri, Member, IEEE, and\nDaniel J. Stilwell, Member, IEEE\nAbstract—We examine the consensus problem for a group of agents that\ncommunicate via a stochastic information network. Communication among\nagents is modeled as a weighted directed random graph that switches pe-\nriodically. The existence of any edge is probabilistic and independent from\nthe existence of any other edge. We further allow each edge to be weighted\ndifferently. Sufficient conditions for asymptotic almost sure consensus are\npresented for the case of positive weights and for the case of arbitrary\nweights.\nIndex Terms—Consensus problem, directed graphs, fast switching,\nrandom graphs, weighted graphs.\nI. INTRODUCTION\nIn a consensus problem, a set of dynamic agents seeks to agree\nupon certain quantities of interests based upon shared information.\nConsensus problems are used to model many different phenomena in-\nvolving information flow among agents, including flocking, swarming,\nsynchronization, distributed decision making, and schooling; see, e.g.,\nthe survey paper [1].\nAlgebraic graph theory [2] is a natural framework for analyzing con-\nsensus problems; see, e.g., [3]–[6] and [7]. Within this framework, each\nagent is modelled as a vertex of a graph, and communication among\nManuscript received January 24, 2006; revised August 28, 2006. Recom-\nmended by Associate Editor G. Pappas. This work was supported by the\nNational Science Foundation under Grant IIS-0238092 and by the Office\nof Naval Research under Grants N000140310444, N000140510780, and\nN000140510516.\nM. Porfiri is with the Department of Mechanical, Aerospace and Manufac-\nturing Engineering, Polytechnic University, Brooklyn, NY 11201 USA (e-mail:\nmporfiri@poly.edu).\nD. J. Stilwell is with the Bradley Department of Electrical and Computer En-\ngineering, Virginia Polytechnic Institute and State University, Blacksburg, VA\n24061 USA (e-mail: stilwell@vt.edu).\nDigital Object Identifier 10.1109\/TAC.2007.904603\n0018-9286\/$25.00 © 2007 IEEE\n"}