{"doi":"10.1257\/aer.100.5.2548","coreId":"96429","oai":"oai:eprints.lse.ac.uk:31432","identifiers":["oai:eprints.lse.ac.uk:31432","10.1257\/aer.100.5.2548"],"title":"Psychological pressure in competitive environments: evidence from a randomized natural experiment","authors":["Apesteguia, Jose","Palacios-Huerta, Ignacio"],"enrichments":{"references":[{"id":17287665,"title":"Accounting for tastes.","authors":[],"date":"1996","doi":"10.1093\/sf\/75.4.1463","raw":"Becker, Gary S. 1996. Accounting for tastes. Cambridge, MA: Harvard University Press.","cites":null},{"id":17287676,"title":"Anticipation and the Valuation of","authors":[],"date":"1987","doi":"10.2307\/2232929","raw":"Loewenstein, George. 1987. “Anticipation and the Valuation of Delayed Consumption.” Economic Journal, 97(387): 666–84.","cites":null},{"id":17287682,"title":"Anxiety and Performance: An Endogenous Learning-by-Doing Model.”","authors":[],"date":"2006","doi":"10.1111\/j.1468-2354.2006.00390.x","raw":"Rauh, Michael T., and Giulio Seccia. 2006. “Anxiety and Performance: An Endogenous Learning-by-Doing Model.” international Economic Review, 47(2): 583–609.","cites":null},{"id":17287674,"title":"Attention and Effort.","authors":[],"date":"1973","doi":"10.2307\/1421603","raw":"Kahneman, Daniel. 1973. Attention and Effort. Englewood Cliffs, NJ: Prentice Hall.","cites":null},{"id":17287658,"title":"Binary Choice Panel Data Models with Predetermined Variables.”","authors":[],"date":"2003","doi":"10.1016\/s0304-4076(03)00095-2","raw":"Arellano, Manuel, and Raquel Carrasco. 2003. “Binary Choice Panel Data Models with Predetermined Variables.” Journal of Econometrics, 115(1): 125–57.","cites":null},{"id":17287667,"title":"Choking Under Pressure.” In Encyclopedia of social psychology,","authors":[],"date":"2007","doi":"10.4135\/9781412956253.n83","raw":"Beilock, Sian. 2007. “Choking Under Pressure.” In Encyclopedia of social psychology, ed. Roy F. Baumeister, and Kathleen D. Vohs, 140–41. Thousand Oaks, CA: Sage Publications.","cites":null},{"id":17287680,"title":"Cognitive and Emotional Components of Anxiety: Literature Review and a Revised Worry-Emotional Scale.”","authors":[],"date":"1981","doi":"10.1037\/0022-0663.73.4.541","raw":"Morris, Larry W., Mark A. Davis, and Calvin H. Hutchings. 1981. “Cognitive and Emotional Components of Anxiety: Literature Review and a Revised Worry-Emotional Scale.” Journal of Educational psychology, 73(4): 541–55.","cites":null},{"id":17287671,"title":"How to Divide the Possession of a Football?”","authors":[],"date":"2008","doi":"10.1016\/j.econlet.2007.10.013","raw":"Che, Yeon-Koo, and Terrence Hendershott. 2008. “How to Divide the Possession of a Football?” Economics Letters, 99(3): 561–65.","cites":null},{"id":17287679,"title":"identification problems in the social sciences.","authors":[],"date":"1995","doi":"10.2307\/271005","raw":"Manski, Charles F. 1995. identification problems in the social sciences. Cambridge, MA: Harvard University Press.","cites":null},{"id":17287669,"title":"Increasing Dominance with No Efficiency Effect.”","authors":[],"date":"2002","doi":"10.1006\/jeth.2001.2796","raw":"Cabral, Luis M. B. 2002. “Increasing Dominance with No Efficiency Effect.” Journal of Economic theory, 102(2): 471–79.","cites":null},{"id":17287678,"title":"On the Advantage of Serving First in a Tennis Set: Four Years at","authors":[],"date":"1999","doi":"10.1111\/1467-9884.00186","raw":"Magnus, Jan R., and Franc J. G. M. Klaassen. 1999. “On the Advantage of Serving First in a Tennis Set: Four Years at Wimbledon.” Journal of the Royal statistical society: series D, 48(2): 247–56.","cites":null},{"id":17287663,"title":"Panel Data Models: Some Recent Developments.”","authors":[],"date":"2001","doi":"10.1016\/s1573-4412(01)05006-1","raw":"Arellano, Manuel, and Bo Honoré. 2001. “Panel Data Models: Some Recent Developments.” in Vol. 5, Handbook of Econometrics, ed. James Heckman and Edward Leamer, 3229–96. Amsterdam: NorthHolland.","cites":null},{"id":17287670,"title":"Penalty Shoot-Outs: Before or after Extra Time?”","authors":[],"date":"2007","doi":"10.1177\/1527002506292580","raw":"Carrillo, Juan D. 2007. “Penalty Shoot-Outs: Before or after Extra Time?” Journal of sports Economics, 8(5): 505–18.","cites":null},{"id":17287672,"title":"Psychology and Economics: Evidence from the Field.”","authors":[],"date":"2009","doi":"10.3386\/w13420","raw":"DellaVigna, Stefano. 2009. “Psychology and Economics: Evidence from the Field.” Journal of Economic Literature, 47(2): 315–72.","cites":null},{"id":17287675,"title":"Rank-Order Tournaments as Optimum Labor Contracts.”","authors":[],"date":"1981","doi":"10.3386\/w0401","raw":"Lazear, Edward P., and Sherwin Rosen. 1981. “Rank-Order Tournaments as Optimum Labor Contracts.” Journal of political Economy, 89(5): 841–64.","cites":null},{"id":17287668,"title":"Rational Adversaries? Evidence from Randomised Trials in","authors":[],"date":"2009","doi":"10.1111\/j.1468-0297.2008.02203.x","raw":"Bhaskar, V. 2009. “Rational Adversaries? Evidence from Randomised Trials in One Day Cricket.” Economic Journal, 119(534): 1–23.","cites":null},{"id":17287666,"title":"social Economics: market Behavior in a social Environment.","authors":[],"date":"2000","doi":"10.1628\/0932456032974899","raw":"Becker, Gary S., and Kevin M. Murphy. 2000. social Economics: market Behavior in a social Environment. Cambridge, MA: Harvard University Press.","cites":null},{"id":17287664,"title":"the Economic Approach to Human Behavior.","authors":[],"date":"1976","doi":"10.2307\/2553078","raw":"Becker, Gary S. 1976. the Economic Approach to Human Behavior. Chicago: University of Chicago Press.","cites":null},{"id":17287681,"title":"The Provision of Incentives in","authors":[],"date":"1999","doi":"10.1257\/jel.37.1.7","raw":"Prendergast, Canice. 1999. “The Provision of Incentives in Firms.” Journal of Economic Literature, 37(1): 7–63.","cites":null},{"id":17287673,"title":"Tournament Rewards and Risk Taking.”","authors":[],"date":"2002","doi":"10.2139\/ssrn.183271","raw":"Hvide, Hans K. 2002. “Tournament Rewards and Risk Taking.” Journal of Labor Economics, 20(4): 877–98.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-12","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/96429.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/31432\/1\/Psychological_Pressure_in_Competitive_Environments_%28publisher%29.pdf","pdfHashValue":"a98bf8eeeaae8bf8268a6c879783c3bb1d0e402c","publisher":"American Economic Association","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:31432<\/identifier><datestamp>\n      2011-01-13T10:21:37Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4D414E<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/31432\/<\/dc:relation><dc:title>\n        Psychological pressure in competitive environments: evidence from a randomized natural experiment<\/dc:title><dc:creator>\n        Apesteguia, Jose<\/dc:creator><dc:creator>\n        Palacios-Huerta, Ignacio<\/dc:creator><dc:subject>\n        BF Psychology<\/dc:subject><dc:publisher>\n        American Economic Association<\/dc:publisher><dc:date>\n        2010-12<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/31432\/1\/Psychological_Pressure_in_Competitive_Environments_%28publisher%29.pdf<\/dc:identifier><dc:identifier>\n          Apesteguia, Jose and Palacios-Huerta, Ignacio  (2010) Psychological pressure in competitive environments: evidence from a randomized natural experiment.  American Economic Review, 100 (Dec).  pp. 2548-2564.  ISSN 0002-8282     <\/dc:identifier><dc:relation>\n        http:\/\/www.aeaweb.org\/aer\/index.php<\/dc:relation><dc:relation>\n        10.1257\/aer.100.5.2548<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/31432\/","http:\/\/www.aeaweb.org\/aer\/index.php","10.1257\/aer.100.5.2548"],"year":2010,"topics":["BF Psychology"],"subject":["Article","PeerReviewed"],"fullText":"2548\nAmerican Economic Review 100 (December 2010): 2548–2564\nhttp:\/\/www.aeaweb.org\/articles.php?doi=10.1257\/aer.100.5.2548\nMuch as the rationality principle has successfully accommodated social attitudes, altruism, \nvalues, and other elements (see, e.g., Gary S. Becker 1976, 1996; Becker and Kevin M. Murphy \n2000), behavioral economics attempts to parsimoniously incorporate psychological motives not \ntraditionally included in economic models. Theoretical models in this area firmly rely for empiri-\ncal support on the observation of human decision making in laboratory environments. Laboratory \nexperiments have the important advantage of providing a great deal of control over relevant \nmargins. In these settings, observed behavior often deviates from the predictions of standard \neconomic models. In fact, at least since the 1970s, a great deal of experimental evidence has been \naccumulated demonstrating circumstances under which strict rationality considerations break \ndown and other patterns of behavior, including psychological considerations, emerge. Thus, an \nimportant issue is how applicable are the insights gained in laboratory settings for understanding \nbehavior in natural environments. This challenge, often referred to as the problem of “generaliz-\nability” or “external validity,” has assumed a central role in recent research in the area.\nThe best and perhaps only way to address this concern is by studying human behavior in real \nlife settings. Unfortunately, however, Nature seldom creates the circumstances that allow a clear \nview of the psychological principles at work. Furthermore, naturally occurring phenomena are \ntypically too complex to be empirically tractable in a way that allows us to discern psychological \nelements from within the characteristically complex behavior exhibited by humans.\nIn this paper we take advantage of an unusually clean opportunity to discern these elements by \nstudying a randomized natural experiment, that is, a real life situation in which the treatment and \ncontrol groups are determined via explicit randomization. As is well known, this situation guar-\nantees internal validity since it satisfies the conditions for causal inference (Charles F. Manski \n1995). The subjects in the experiment are professionals who have to perform a simple task in \na tournament competition. In soccer, one of the methods of determining the winning team if a \nmatch is drawn but a winner is needed is by the two teams taking kicks from the penalty mark. \nThis method is used worldwide in all major elimination tournaments involving both national and \nclub teams (e.g., World Cups, European Cups, Champions League, etc). From the time it was first \nintroduced in 1970 and until 2003, the basic procedure established that both teams alternately \ntake five penalty kicks each, and that the order of the kicks be decided by a referee who tosses a \ncoin, and the team whose captain wins the toss takes the first kick.\nPsychological Pressure in Competitive Environments: \nEvidence from a Randomized Natural Experiment\nBy Jose Apesteguia and Ignacio Palacios-Huerta*\n* Apesteguia: Department of Economics, Universitat Pompeu Fabra, Ramon Trias Fargas, 08005 Barcelona, Spain \n(e-mail: jose.apesteguia@upf.edu); Palacios-Huerta: Department of Management, London School of Economics, \nHoughton Street, London WC2A 2AE, United Kingdom (e-mail: i.palacios-huerta@lse.ac.uk). We thank three anony-\nmous referees, Ghazala Azmat, Miguel A. Ballester, Jordi Blanes-i-Vidal, Caterina Calsamiglia, Juan D. Carrillo, Gary \nCharness, Yeon-Koo Che, Pedro Dal Bo, David de Meza, Manuel E. Mejuto, Patxo Palacios, Steve Pischke, Antonio \nRangel, Pedro Rey, Yona Rubinstein, Giulio Seccia, Carmit Segal, and participants in various seminars and conferences \nfor helpful comments. Ozan Eksi provided excellent research assistance and Eugenio J. Miravete the programs that \nimplement the dynamic panel data analysis. We gratefully acknowledge financial support from the Fundación Ramón \nAreces, the Spanish Ministerio de Ciencia y Tecnología (grant SEJ2006-11510), the Barcelona GSE research network, \nand the Government of Catalonia, as well as the editing assistance from Estelle Shulgasser. \nVOL. 100 NO. 5 2549ApEstEguiA AND pALAciOs-HuERtA: pREssuRE iN cOmpEtitiVE ENViRONmENts\nThis randomized experiment gives us the chance to study a situation that is familiar to the \nsubjects and takes place in the natural setting in which they operate. The subjects are profession-\nals; in fact, they are among the highest paid professionals in the world, and the task they have to \nperform (kick a ball once) is one of the simplest they could possibly be asked to perform. Further, \nthe competitive setting relates to an important framework of analysis in labor economics and in \nthe economics of organizations (the tournament model). Moreover, from an empirical perspec-\ntive all the relevant variables are perfectly observable, the task is effortless, outcomes are decided \nimmediately, and with only two possible outcomes (score, no score) risk plays no role in the \nanalysis. Finally, individuals are subject to high incentives, and so are interested in performing \nas well as they can. In fact, their actions often have enormous consequences not only for their \nindividual careers, but also for their team, their city, and even their country, as in a World Cup \nfinal, for instance.\nThe explicit randomization mechanism used to determine which team goes first in the sequence, \nin a situation where both teams have exactly the same opportunities to perform a task, suggests \nthat we should expect the first and second teams to have exactly the same probability of winning \nthe tournament. Yet, we find a strongly significant and quantitatively important difference. Using \ndata on 1,343 penalty kicks from 129 penalty shoot-outs over the period 1976–2003, we find that \nteams that take the first kick in the sequence win the penalty shoot-out 60.5 percent of the time. \nGiven the characteristics of the setting we can attribute this difference in performance to psycho-\nlogical effects resulting from the consequences of the kicking order.\nThe paper is structured as follows. Section I briefly reviews relevant literature. Section II pres-\nents the natural experiment. Section III describes the data and reports the main empirical result. \nIn Section IV we study whether subjects are aware of the advantage of going first, whether they \nrationally respond to it by systematically choosing to kick first when given the chance to choose \nthe order, and whether, when surveyed, they identify a specific psychological mechanism for \ntheir behavior. We find that the answer to these three questions is affirmative. We also study the \nmechanism whereby teams kicking first are more likely to win using a random effects dynamic \npanel data model and discuss some policy implications. Section V concludes.\nI. Related Literature\nThis paper relates to several strands of literature in economics and psychology. First, the \nnatural setting is that of a tournament. Tournaments are pervasive in real life and often char-\nacterize competitive situations such as competitions for promotion in internal labor markets in \nfirms and organizations, patent races, political elections, student competitions in schools, and \nmany others. The tournament model was first formalized by Edward P. Lazear and Sherwin \nRosen (1981), and over the last couple of decades a large literature has studied both theo-\nretically and empirically a number of important aspects of this incentive scheme.1 Despite the \nlarge body of work, however, we are aware of no evidence documenting how psychological \nor emotional effects may be relevant in explaining the performance of subjects competing in \na tournament setting. One possible reason for this is that the difficulties in clearly observing \nactions, outcomes, choices of risky strategies, and other relevant variables in naturally occur-\nring settings are exceedingly high, and as a result it is not possible to discern with sufficient \nprecision whether there are, in addition to these variables, any psychological elements at work.\nThe characteristics of the setting we study, however, are ideal for overcoming these obsta-\ncles. Variables such as the choice of effort levels and risky strategies that are typically hard to \n1 See Canice Prendergast (1999) for a review.\nDEcEmBER 20102550 tHE AmERicAN EcONOmic REViEW\nmeasure in tournaments and other competitive situations play no role in our setting: the task \n(kicking a ball once) involves no physical effort and, with only two possible outcomes (score \nor no score), risk plays no role either.2 Outcomes can be perfectly observed and are immedi-\nately determined after players make their choices; that is, there is no subsequent play. This \nis important, indeed critical, to establish the empirical results.3 Furthermore, the rules of the \ncompetition are precisely established and require that subjects are always in the same physical \nsituation (same position and location).\nSecond, an important literature in social psychology has studied expert performance and per-\nformance under pressure such as that induced by high stakes, the presence of an audience, and \nothers.4 Dan Ariely, Uri Gneezy, George Loewenstein, and Nina Mazar (2009) review and dis-\ncuss this literature in the context of a study of whether or not increases in motivation and effort \nresult in improved performance. In our setting, however, both teams have the same stakes in the \nshoot-out, and both perform in front of the same audience, an audience which in many shoot-outs \nroughly equally supports both teams. More importantly, although different forms of pressure \n(e.g., stakes, audience) may be complements with each other, the explicit randomization pro-\ncedure that is used means that there is no reason why one team should be systematically more \naffected than the other. The novel result we obtain from the perspective of this literature is that \ndifferences in the interim state of the competition caused by the kicking order may generate dif-\nferences in the psychological pressure that drives the effects on performance that we observe.5\nThird, there is a literature showing the importance of psychology to economics. Stefano \nDellaVigna (2009) surveys the empirical evidence from natural settings documenting devia-\ntions from the standard rational model with respect to nonstandard preferences, incorrect beliefs, \nand systematic biases in decision making. It has been shown, for instance, that behavior often \ndepends on reference points. In our setting, as will be documented later, the score at the time a \nplayer has to perform his task (the state of the competition) appears to act as a reference point, \nand the “ahead-behind” asymmetry associated with this partial score (that is, to be leading or \nlagging in the score) to have an impact on performance.6 To the best of our knowledge there is \nno empirical evidence from real life strictly competitive environments on reference-dependent \npreferences and their impact on performance. Similarly, we are aware of no empirical evidence \ndocumenting how changes in mood and arousal associated with the state of the competition can \ngenerate deviations from the rational model in terms of performance.7\n2 The role of risk in tournament competitions has been examined in Hans K. Hvide (2002) and Hvide and Eirik G. \nKristiansen (2003). In dynamic competition games, there is a literature on the “increasing dominance” effect of a leader \nover a rival (e.g., Luis M. B. Cabral 2002, 2003), which studies the strategic choice of variance and covariance throughout \na competition.\n3 The reason is that if there were subsequent actions that contribute to determine the outcome, we would need to \nhave detailed information on the subjects’ choice of effort levels and choice of risky strategies in those actions. Further, \nsubjects may also have asymmetric information concerning their effort levels and be heterogeneous in their risk attitudes. \nThese aspects mean that situations in which a coin toss is used to decide, for instance, initial sides or which team begins \nplay (see, e.g., V. Bhaskar 2009 and Jan R. Magnus and Franc J. G. M. Klaassen 1999 for studies on cricket and tennis) \nare an order of magnitude more complex than a penalty kick for discerning the presence of psychological elements. \nFurther, winners of the coin toss in these settings typically choose sides and whether or not to begin batting or serving. \nThis means that these situations do not represent a perfect randomized experiment.\n4 See, for instance, K. Anders Ericsson et al. (2006); Sian Beilock (2007), and other references therein.\n5 We will not speculate as to the actual form that these psychological effects may take beyond indicating that they may \nbe associated with increased arousal, greater shifting of mental process from “automatic” to “controlled,” or differences \nin the narrowing of attention (see Daniel Kahneman 1973). Also, they may represent differences in mental fatigue or \nmental strain.\n6 See Botond Kőszegi and Matthew Rabin (2006) for a model of reference-dependent preferences where “gain-loss” \n(or “ahead-behind”) evaluations around a reference point influence behavior.\n7 For evidence on the impact of changes associated with exposure to media violence, the weather, and other factors, see \nDellaVigna (2009). With regard to formal models, Larry G. Epstein and Igor Kopylov (2007) develop a model of pessi-\nmism where individuals lose confidence in their outlook as they approach the moment of truth. Theoretical contributions \nVOL. 100 NO. 5 2551ApEstEguiA AND pALAciOs-HuERtA: pREssuRE iN cOmpEtitiVE ENViRONmENts\nLastly, there is some economic literature on the ex post fairness of certain regulations in sports \nwhere a coin flip that determines the order of play may have a significant impact on the outcome of \na game by giving the winner of the coin flip more chances to perform a task (e.g., Yeon-Koo Che \nand Terrence Hendershott 2008, for the case of extra-time sudden-death regulations in the National \nFootball League).8 Our results show that even under ideal circumstances where a coin flip deter-\nmines only the order of competition and both teams have exactly the same chances, human nature \nis such that the outcome of a perfect randomized trial may be considered ex post unfair.\nII. The Randomized Natural Experiment\nA penalty shoot-out is simply a sequence of penalty kicks. The rules that govern a penalty \nkick are described in the Official Laws of the Game issued by the world governing body of soc-\ncer, the Fédération Internationale de Football Association (FIFA).9 Each penalty kick involves \ntwo players: a kicker and a goalkeeper. In the typical kick the ball takes about 0.3–0.4 seconds \nto travel the distance between the penalty mark and the goal line, which is less than the reaction \ntime plus the goalkeeper’s movement time to possible paths of the ball. Hence, both kicker and \ngoalkeeper must move simultaneously, and the outcome is determined immediately. The penalty \nkick has only two possible outcomes: score or no score. There are no second penalties or any \nform of subsequent play in the event of a goal not being scored. By any reasonable metric the task \ncan be considered effortless, and with only two possible outcomes risk plays no role.10 Further, \nplayers’ actions and outcomes can be perfectly observed. The initial location of both the ball \nand the goalkeeper is always the same: the ball is placed on the penalty mark and the goalkeeper \npositions himself on the goal line.\nThe purpose of a penalty shoot-out is to decide the winning team where competition rules \nrequire one team to be declared the winner after a drawn match.11 The penalty shoot-out was first \nintroduced in 1970 and until July 2003 its main characteristics were as follows (FIFA 2002, 36):\n• “The referee tosses a coin and the team whose captain wins the toss takes the first kick.\n• Subject to the conditions explained below, both teams take five kicks.\n• The kicks are taken alternately by the teams.\n• If, before both teams have taken five kicks, one has scored more goals than the other could \nscore, even if it were to complete its five kicks, no more kicks are taken.\n• If, after both teams have taken five kicks, both have scored the same number of goals, or \nhave not scored any goals, kicks continue to be taken in the same order until one team has \nscored a goal more than the other from the same number of kicks.”\nIn July 2003, FIFA (2003, 36) decided to slightly change the first regulation in the procedure \nby replacing it with (italics added):\n• “The referee tosses a coin and the team whose captain wins the toss decides whether to take \nthe first or the second kick.”\nThe focus of our analysis is the period 1970–2003 where we have a perfect randomized experi-\nment, and post-2003 data will be used to assess other relevant aspects.\non anxiety include Loewenstein (1987), Andrew Caplin and John Leahy (2001), and Michael T. Rauh and Giulio Seccia \n(2006). In cognitive psychology, Larry W. Morris, Mark A. Davis, and Calvin H. Hutchings (1981) provides a review.\n8 Bialik, Carl. 2003. “Should the Outcome of a Coin Flip Mean So Much in NFL Overtime?” the Wall street Journal, \nDecember 23, 2003.\n9 Federation Internationale de Football Association. 2002, 2003, 2007. Official Laws of the game. Zurich: FIFA.\n10 We refer here to physical effort, which is typically conceived as a choice variable. With regard to mental effort, arousal \nis the brain’s way of increasing its level of effort, and it is not ordinarily under volitional control (see Kahneman 1973).\n11 The complete set of rules in a penalty shoot-out is available at http:\/\/www.fifa.com.\nDEcEmBER 20102552 tHE AmERicAN EcONOmic REViEW\nIII. Data and Empirical Evidence\nThe data come from the Union of European Football Associations (UEFA), the Rec.Sport.\nSoccer Statistics Foundation, the Association of Football Statisticians, weltfussball.de, and the \nSpanish newspapers mARcA and El pais. The dataset comprises 269 penalty shoot-outs with \n2,820 penalty kicks over the period 1970−2008 and it includes all the observations available in \nthe Web sites uefa.com, rssf.com, weltfussball.de, elpais.com, and marca.com (last accessed on \nNovember 17, 2007). It is fully comprehensive in that it includes all the penalty shoot-outs in the \nhistory of the main international competitions for national teams and for club teams, as well as \ndata on various national club competitions. Table 1 provides a summary of the dataset.\nFor every shoot-out of every competition we have information on the date, the identity of \nthe teams kicking first and second, the final outcome, the outcomes of each of the kicks in the \nsequence (with the exception of one shoot-out), and the geographical location of the game (that \nis, whether the game was played at a home ground, a visiting ground, or in a neutral field).\nAs is well known, and following the description in Manski (1995), let yz be the outcome that \na subject (a team in our case) would realize if he were to receive treatment z, where z = 0, 1. Let \np(yz | x) denote the distribution of outcomes that would be realized if all subjects with covariates \nx were to receive treatment z. The objective is to compare the distributions p(y1 | x) and p(y0 | x). \nWhen the treatment z received by each subject with covariates x is statistically independent of \nthe subject’s outcomes, we have p(yz | x) = p(yz | x, z = 1) = p(yz | x, z = 0) for z = 0, 1. Now let \ny ≡ y1z + y0(1 − z) denote the outcome actually realized by a member of the population, namely, \ny1 when z = 1 and y0 when z = 0. Note that p(y | x, z = 1) = p(y1 | x, z = 1) and p(y | x, z = 0)= p(y0 | x, z = 0). Hence, if we denote by B the set of outcome values (that is, win or lose in our \nTable 1—Description of the Dataset\n1970−2003 2003−2008\nCompetition Type \nShoot-outs  \nN \nKicks  \nN \nShoot-outs  \nN \nKicks  \nN \nAll shoot-outs  \nN \nAll kicks  \nN \nWorld Cup National teams 16 153 4 33 20 186\nEuropean  \n Championship \nNational teams 9 97 4 42 13 139\nAmerican Cup National teams 12 116 3 31 15 147\nAfrican Nations Cup National teams 9 110 4 58 13 168\nGold Cup National teams 5 55 2 17 7 72\nAsian Nations Cup National teams — — 7 74 7 74\nChampions League Clubs 8 82 13 127 21 209\nUEFA Cup Clubs 12 101 20 221 32 322\nSpanish Cup Clubs 29 308 26 259 55 567\nGerman Cups Clubs 24 273 48 521 72 794\nEnglish Cups Clubs 5 48 9 94 14 142\nAll 129 1,343 140 1,477 269 2,820\nNotes: The dataset includes all the shoot-outs in the history of the World Cup, European Championship, American \nCup, African Nations Cup (except one), and Gold Cup. All these are international competitions for national teams. The \nEuropean Champions League and European UEFA Cup are international club competitions in Europe. For these two \ncompetitions the dataset includes all the shoot-outs that ever took place in the final match and all those that took place in \nany of the rounds in the period 2000–2008. The Spanish Cup, the German Cups, and the English Cups are national club \ncompetitions. For the Spanish Cup and the German Cup the dataset has all the shoot-outs that took place in a final match, \nplus all the shoot-outs in all the rounds in the period 1999–2008 (Spanish Cup) and in the period 2001–2008 (German \nCup). For the German Supercup it includes all those that ever took place. The English Cups include data on the F.A. Cup, \nLeague Cup, and the F.A. Community Shield.\nVOL. 100 NO. 5 2553ApEstEguiA AND pALAciOs-HuERtA: pREssuRE iN cOmpEtitiVE ENViRONmENts\ncase), when the treatment is independent of the outcomes, the estimate of the average treatment \neffect t(B | x) is:\n  t(B | x) = p(y ∈ B | x, z = 1) − p(y ∈ B | x, z = 0).\nNext, we first confirm the statistical similarity of the pretreatment characteristics of the two \nteams involved in a shoot-out. The main covariates we are interested in are variables that mea-\nsure the quality of the teams, their previous experience in shoot-outs, and environmental factors \nsuch as the nature of the crowd in the stadium, since these may represent differences in support \nor pressure experienced by the teams. With respect to the quality of the teams, FIFA and UEFA \npublish yearly rankings both for national teams and clubs based on their performance in certain \ncompetitions. For the national team competitions we use the “FIFA rankings,” and for interna-\ntional club competitions the “UEFA team rankings.” 12 For club competitions at the national level \nwe consider the division or category to which the teams belong at the time of the shoot-out and, \nwhen they belong to the same division, their standings in the table. With respect to experience, \nwe compute the number of previous shoot-outs observed in our dataset in which a given team has \nbeen involved. Lastly, we consider whether a team is playing at its own stadium in front of mostly \na supporting home crowd, at the stadium of its opponent in front of a predominantly unfriendly \ncrowd, or at a neutral venue. Table 2 reports the differences in these characteristics.\nConsistent with the randomization procedure used to determine the order of play, it is not \npossible to reject the null hypothesis of equality in any of these covariates at conventional sig-\nnificance levels.\nWe now turn to the main result of this paper. As indicated earlier, the estimate of the aver-\nage treatment effect is p(y ∈ B | x, z = 1) − p(y ∈ B | x, z = 0). We compute this effect and find \n12 The methodology used to construct these rankings is described at http:\/\/www.fifa.com and http:\/\/www.uefa.com.\nTable 2—Pretreatment Characteristics\nCriterion N First team Second team Difference\nFIFA rankings 35 0.46 0.54 −0.08\n(0.50) (0.50) (1.01)\nUEFA rankings 20 0.35 0.65 −0.30\n(0.49) (0.49) (0.99)\nCategory 58 0.50 0.50 0.00\n(0.35) (0.35) (0.70)\nPosition 30 0.4 0.6 −0.20\n (when same category) (0.50) (0.50) (0.996)\nExperience 128 0.48 0.52 −0.03\n(0.32) (0.32) (0.65)\nHome team 82 0.57 0.43 0.14\nNotes: FIFA publishes ranks on national teams since 1993. The UEFA ranking applies to \ninternational club team competitions (Champions League and UEFA Cup), and it is published \nsince 1959. Teams taking part in national cup competitions—Spanish Cup, German Cups, and \nEnglish Cups—may or may not belong to the same category (division) in the national league \ncompetition. If they belong to the same one, we consider their standings (“Position”) in the \nleague table at the time of the shoot-out. Experience refers to the number of previous shoot-\nouts in which a team has participated in which we observe in our dataset. The table reports the \nproportion of times in which each team shows a better entry in the respective criterion (= 1 if \nhigher, = 0 if lower, = 0.5 if same). Home team equals 1 if the team plays in its own stadium. \nStandard deviations in parentheses.\nDEcEmBER 20102554 tHE AmERicAN EcONOmic REViEW\nthat teams kicking first in the sequence win the penalty shoot-out 60.5 percent of the time (see \nFigure 1). That is, kicking first conveys a strongly significant (at the 1.7 percent level) and sizable \nadvantage. For the complete dataset (1970–2008) the effect is 59.2 percent, significant at the 0.5 \npercent level.\nIn Table 3 we use a regression framework to provide an estimate of the treatment effect using \nvarious probit and logit specifications.\nWe find, not surprisingly, that the order of play is strongly significant in every specification. \nIn fact, when we control for all the observed covariates χ in the regressions the significance of \nthe effect increases more than tenfold. Furthermore, it is also interesting to note that none of the \ncovariates included in the regressions is significant in any of the specifications. These results \nconfirm the significant and sizable advantage gained by the team that is first to kick.\nIV. Discussion\nA. Are professionals Aware of Any psychological Effects on performance?\nAs indicated earlier, in July 2003 FIFA introduced a slight change in the procedure used to \ndetermine the kicking order. Rather than requiring that the winner of the coin toss must take \nfirst kick, it required that he chooses whether to take the first kick or the second kick. This \nchange allows us to study the response of professionals to the psychological phenomenon we \nhave documented: \n  (i)  Professionals may or may not be aware of it; \n  (ii)  If they are, they may or may not react optimally to it; \n  (iii)  And if they do react optimally, they may or may not do so for the right reason.\nClearly, if subjects are aware of any psychological effects caused by the order of play and \ntheir detrimental impact on performance, they should always choose to go first in the tourna-\nment. Unfortunately, there are no public records of players’ choices because FIFA regulations do \nnot require referees to record this information.13 In order to get to know what their choices after \nJuly 2003 are, we have done the following:\n 1.  First, we watched about twenty videos of matches that ended in a penalty shoot-out. \nAlthough the interval between the end of a game and the beginning of a shoot-out is typi-\ncally used by TV channels to air commercials, it is sometimes possible to catch the very \ninstant when the referee flips the coin and talks to the winner of the toss. We found that in \neach and every case that we were able to observe with just one exception, the winner of \nthe coin toss chose to kick first.14\n 2.  Second, we conducted a survey of more than 240 players and coaches in the professional \nand amateur leagues in Spain, who were asked the following question: “Assume you are \nplaying a penalty shoot-out. You win the coin toss and have to choose whether to kick \n13 See the complete regulations at http:\/\/www.fifa.com.\n14 The exception is the Italy-Spain match in the quarter finals of the European Championship, June 2008. Gianluigi \nBuffon, the Italian goalkeeper, won the toss and chose Spain to kick first. Spain won.\nVOL. 100 NO. 5 2555ApEstEguiA AND pALAciOs-HuERtA: pREssuRE iN cOmpEtitiVE ENViRONmENts\nTable 3—Determinants of Winning the Tournament\nProbit Probit Probit Logit Logit Logit\nConstant −0.265** −0.275 −0.263 −0.424** −0.441 −0.421\n(0.111) (0.197) (0.436) (0.180) (0.320) (0.708)\nTeam kicks first 0.530*** 0.645*** 0.629*** 0.849*** 1.035*** 1.009***\n(0.158) (0.171) (0.172) (0.254) (0.278) (0.278)\nHome field −0.087 −0.110 −0.1421 −0.178\n(0.208) (0.209) (0.337) (0.338)\nNeutral field −0.043 −0.055 −0.070 −0.089\n(0.250) (0.274) (0.399) (0.434)\nCategory −0.008 0.008 −0.012 0.014\n(1 if higher) (0.171) (0.172) (0.277) (0.278)\nHome × category 0.000 0.001\n(0.255) (0.406)\nNeutral × category 0.001 0.004\n(0.072) (0.186)\nTeam kicks first interacted with:\n Home field 0.002 0.005\n(0.569) (0.928)\n Neutral field 7.89e − 05 −6.2e − 06\n(0.508) (0.817)\n Category 0.030 0.0001\n(0.536) (0.876)\nFixed effects for:\n Champions League No No Yes No No Yes\n UEFA Cup No No Yes No No Yes\n National teams No No Yes No No Yes\n National cups No No Yes No No Yes\nN (teams) 258 224 224 258 224 224\nAdjusted R2 0.031 0.046 0.048 0.031 0.046 0.048\nLog-likelihood −173.14 −148.10 −147.10 −173.14 −148.10 − 147.10\nNotes: Missing observations for “Category” for 17 shoot-outs. Standard errors in parentheses.\n*** Significant at the 1 percent level.\n ** Significant at the 5 percent level.\n0.605\n0.395\n0.0\n0.2\n0.4\n0.6\nFirst team Second team\nFigure 1. Winning Frequencies in Aggregate Data\nDEcEmBER 20102556 tHE AmERicAN EcONOmic REViEW\nfirst or second. What would you choose: first; second; either one, I am indifferent; or, it \ndepends?” The results are collected in Table 4.\nWe found that around 96 percent of the subjects answered that they would prefer to go first. \nMore importantly, when asked to explain their decision, they systematically argued that their \nchoice was motivated by the desire to put pressure on the kicker of the opposing team. Coding \ntheir answers to a second question we asked in the survey: “Please explain your decision: why \nwould you do what you just said?,” we find that in 96 percent of the cases they explicitly mention \nthat they intend to put pressure on the kicker of the second-kicking team, and that in no case do \nthey refer to the possibility of enhancing the performance of their own goalkeeper.\nWe interpret this evidence as supporting the hypothesis that subjects are perfectly aware of the \nresult and, more important, they respond optimally to it. This means, following the terminology \nused in behavioral economic theory, that they can be characterized as “sophisticates.” Further, \nthey attribute the result to a specific psychological mechanism that leads to pressure and under-\nperformance. In the next subsections we study whether this is also substantiated in the data.\nB. Descriptive Evidence of Dynamic performance\nTable 5 reports round by round data of winning frequencies for each team. As indicated earlier, \nwhen the shoot-out remains tied after five rounds kicks continue to be taken in the same order in \nadditional rounds until one team has scored a goal more than the other from the same number of \nkicks. We will call these “decisive rounds.”\nWe find that most of the shoot-outs (about three-quarters) end in five or fewer rounds, and the \nrest move into decisive rounds. The team kicking first wins 65.9 percent of all the shoot-outs \nthat end in five rounds or less, and 52.9 percent of the rest. The lower advantage in the decisive \nrounds may simply reflect a selection effect, namely that it involves first teams that have failed to \ncapitalize on the advantage of kicking first during five rounds or more.\nFigures 2A and 2B report the unconditional scoring rates per round for the first five rounds, \nand the unconditional frequencies with which a given team (first or second) is ahead of its oppo-\nnent in the score at the end of each of these rounds.\nTable 4—Survey Results\nThe following questions were asked to soccer coaches and players:\nQ1: “Assume you are playing a penalty shoot-out. You win the coin toss and have to \nchoose whether to kick first or second. What would you choose: first; second; either \none, I am indifferent; or, it depends?”\nObservations First Second Indifferent Depends\nCoaches:\n Professional 21 90.5% 0 0 9.5%\n Amateur 37 94.6% 0 0 5.4%\nPlayers:\n Professional 67 97.0% 0 1.5% 1.5%\n Amateur 117 96.5% 0 2.5% 1.0%\nAll: 242 95.9% 0 1.6% 2.5%\nQ2: “Please explain your decision. Why would you do what you just said?”\nNotes: Professional coaches and players come from the professional leagues in Spain (Primera \nDivision and 2A and 2B Divisions). Amateur coaches and players come from Division 3 and \nRegional Leagues in Spain. The four coaches that answered “Depends” further explained \nthat they would let their players choose what they preferred to do.\nVOL. 100 NO. 5 2557ApEstEguiA AND pALAciOs-HuERtA: pREssuRE iN cOmpEtitiVE ENViRONmENts\nThe scoring rate in the aggregate data is 73.1 percent, 76.3 percent for the first team and \n69.7 percent for the second.15 Figure 2A shows that it is always greater for the first team than for \nthe second team and appears to decline in the later rounds. Figure 2B shows that the differences \nin scoring rates tend to make the first team more likely to be leading in the score than the second \nteam at the end of every round. The difference between the teams is 7 percentage points in each \nof the first two rounds, which is not significant at conventional levels, and increases in magnitude \nin subsequent rounds to 12, 13, and 19 percentage points respectively, becoming statistically \nsignificant (at the 1 percent level). Interestingly, the relative frequency with which the first team \nleads in the partial score when one of the two teams is leading is around 60 percent, increasing \nslightly in the later rounds. These findings suggest that the detrimental effects on performance \nbecome more pronounced as the potential final rounds are approached.\nTable 6 provides a more detailed description of both scoring probabilities and winning fre-\nquencies by team, round, and partial score.\nNot surprisingly, most of the observations for the first team occur when the partial score is tied, \nand for the second team when it is lagging in the score. The scoring rate along these two paths of \nobservations (columns 2 and 4) is nearly always higher for the first team than for the second. It \nalso appears to drop over the rounds quite significantly for the second team but not for the first: for \nthe second team it falls from about 75–80 percent in the first two rounds to about 62–66 percent in \nrounds 3 to 5, whereas for the first team it remains fairly stable in a range of 72–78 percent. The \npercentage of times with which the teams observed at every round-score combination  eventually \n15 These rates are lower than the average scoring rate in penalty kicks in the normal course of a game (that is, not in \nshoot-outs), which is about 80 percent, but similar to the scoring rate in games with a close score (a tie or a one goal dif-\nference) when there is little time left to play in the game (see, e.g., Palacios-Huerta 2003). These lower rates may reflect \nthe increased pressure associated with the fact that scoring a goal or not is a critical determinant of the final outcome both \nin a penalty shoot-out and in close games.\nTable 5—Observations by Round and Winning Rates\nNumber of shoot-outs If decided, percentage in which the:\nRound Observed Decided First team wins Second team wins\nRegular rounds \n Round 1 128 0 — —\n Round 2 128 0 — —\n Round 3 128 1 100 0\n Round 4 127 30 76.6 23.3\n Round 5 97 63 60.3 39.7\nTotal decided: 94 65.9 34.1\nDecisive rounds\n Round 6 34 18 38.8 61.2\n Round 7 16 4 75.0 25.0\n Round 8 12 5 80.0 20.0\n Round 9 7 1 0 100\n Round 10 6 3 100 0\n Round 11 3 1 0 100\n Round 12 2 2 50.0 50.0\nTotal decided: 34 52.9 47.1\nAll rounds Total decided: 128 60.2 39.5\nNote: We are missing the round by round data of one shoot-out which was won by the first \nteam in five rounds.\nDEcEmBER 20102558 tHE AmERicAN EcONOmic REViEW\nwin the shoot-out reveals that the impact of scoring versus not scoring increases over the rounds \nfor both teams. In round 1, for instance, the first team begins with a 60.2 percent chance of win-\nning. If it scores, this probability increases 7.1 percentage points (to 67.3 = 100 – 32.7) and if it \nmisses the probability drops 26.9 percentage points (to 33.3 = 100 – 66.7). The corresponding \nfigures for round 5 are +17.6 and −35.7 percentage points, respectively. Thus, the cumulative \nimpact of any scoring rate differentials over five rounds can be substantial. One way to capture \nthe “importance” of a penalty kick is to compute the difference in these conditional probabilities \nrelative to the ex ante probability of winning the shoot-out at that state. For instance, for the first \nteam in round 1, the “Penalty Kick Importance” is simply (67.3 – 33.3)\/60.2 = 56.5. It turns \nout that there is a slightly negative but insignificant correlation ρ between the importance of a \npenalty kick and the scoring rate (ρ = – 0.008, p-value = 0.96). Interestingly, however, the data \nalso show that along the two most frequent paths of observations (columns 2 and 4) in nearly \nall the cases the importance is substantially greater for the second team than for the first team. \nThe correlation between importance and performance just within this subset of observations is \nρ = –  0.557, p-value = 0.06.\nTaken together, while the descriptive evidence just presented is at most suggestive of the mecha-\nnism that may generate the phenomenon we study, it shows substantial differences between the two \n0.79 0.82 0.77 0.74 0.740.72\n0.77\n0.64\n0.68 0.67\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n1              2           3        4    5\nRound\nFirst team Second team\n0.20\n0.27\n0.35\n0.40\n0.46\n0.13\n0.20\n0.23\n0.27 0.27\n0.0\n0.2\n0.4\n1               2              3                            4             5\nRound\nFirst team Second team\nFigure 2B. Frequency with which a Team Leads in the Score at the End of a Round\nNotes: If before both teams have taken five penalty kicks, one has score more goals than the other could possibly score \neven if it were to complete its five kicks, no more kicks are taken. The percentage of times in which a team is leading \nin the score at the end of a round in Figure 2B includes these cases, that is, cases in which the shoot-out already ended \nbefore this round, whereas in Figure 2A the scoring rate is only computed for the teams that are observed to kick in the \ncorresponding round.\nFigure 2A. Scoring Probabilities per Round\nVOL. 100 NO. 5 2559ApEstEguiA AND pALAciOs-HuERtA: pREssuRE iN cOmpEtitiVE ENViRONmENts\nteams: the second team has a lower scoring rate, especially in the later rounds, and typically finds itself \nkicking penalty kicks which have greater importance in terms of changes in probabilistic outcomes. In \nthe next subsection we provide a more rigorous analysis of the dynamics of the tournament.\nC. Dynamic panel Data Analysis\nThe outcome of a penalty kick (score, no score) in a shoot-out may depend on certain observed \nand unobserved characteristics of the teams and the penalty shoot-out, the specific sequence of \npast outcomes and the state of the tournament shoot-out. Not having a random assignment of any \nof these variables, we estimate a binary choice panel data model with lagged endogenous vari-\nables and unobserved heterogeneity. In particular, in order to appropriately control for the effect \nTable 6—Scoring Probabilities and Winning Frequencies by Team, Round, and Partial Score\nFirst team Second team\nBehind Even Ahead Behind Even Ahead\nRound 1\n Scoring probability — 78.9 — 75.2 59.3 —\n Percent win shoot-out — 60.2 — 32.7 66.7 —\n Penalty kick importance 56.5 93.4 39.3\n N — 128 — 101 27 —\nRound 2\n Scoring probability 100 74.7 96.0 82.2 65.8 —\n Percent win shoot-out 31.3 57.5 88.0 32.2 57.9 —\n Penalty kick importance — 32.2 30.6 62.7 61.2\n N 16 87 25 90 38 0\nRound 3\n Scoring probability 80.0 76.8 76.5 63.2 69.4 40.0\n Percent win shoot-out 24.0 59.4 88.2 23 72.2 100\n Penalty kick importance 115.7 67.3 21.9 62.7 66.4 14.3\n N 25 69 34 87 36 5\nRound 4\n Scoring probability 76.7 71.7 75.0 66.2 69.4 77.8\n Percent win shoot-out 13.3 62.3 88.6 21.1 75.0 100\n Penalty kick importance 150.0 68.2 19.8 125.1 50.1 14.8\n N 30 53 44 71 36 9 \nRound 5\n Scoring probability 74.1 76.2 71.4 62.5 70.0 —\n Percent win shoot-out 14.8 52.4 96.4 30.0 83.3 —\n Penalty kick importance 112.5 101.8 31.1 156.9 63.5\n N 27 42 28 40 30 —\nRounds 6+\n Scoring probability — 67.5 — 68.5 65.4 —\n Percent win shoot-out — 58.8 — 24.1 76.9 —\n Penalty kick importance 90.0 153.5 84.7\n N — 80 — 54 26 —\nNotes: For each team-score-round situation, the “Scoring probability” is the percentage of teams that scored a goal in \nthat situation, “Percent win shoot-out” is the percentage of teams observed in that situation that eventually won the shoot-\nout, and “Penalty kick importance” is the probability of winning the shoot-out when the penalty kick is scored minus \nthe probability when it is not scored divided by the probability of winning the shoot-out (that is, by “Percent win shoot-\nout”). N is the number of observations. In Rounds 6+ N is computed as the sum of the number of teams that in rounds 6 \nand beyond are observed at a given partial score. That is, since the first team can be observed in various rounds with an \neven partial score and the second team can be observed in various rounds with the same or different (behind and even) \nscore, the same team may be observed at multiple occasions. The scoring probabilities and the percentage of teams that \nwin the shoot-out are computed using these as the number of observations for these rounds. We are missing the round by \nround data in one shoot-out.\nDEcEmBER 20102560 tHE AmERicAN EcONOmic REViEW\nof state dependence in our setting, we estimate the semi-parametric dynamic random effects \npanel data model of Manuel Arellano and Raquel Carrasco (2003). These authors develop a \nconsistent random effects estimator where: (a) explanatory variables are predetermined but not \nstrictly exogenous, and where (b) individual effects are allowed to be correlated with the explana-\ntory variables. In online Appendix A we describe this method, discuss its advantages over the \nalternatives available in the literature, and show how our short panel fits its identification require-\nments.16 The results are collected in Table 7.\n16 The econometric estimation of these models is typically subject to a number of difficulties. For example, parameter \nestimates from short panels jointly estimated with individual fixed effects can be seriously biased and inconsistent. See \nArellano and Bo Honoré (2001) for a review.\nTable 7—Random Effects Dynamic Panel Data Model\n(1) (2) (3)\nConstant 0.95*** 0.87*** 0.82***\n(6.77) (3.03) (2.92)\nLagged penalty outcome −0.27 −0.25 0.10\n(1.02) (1.12) (0.93)\nPartial score +1 0.98 0.67 1.77\n(1.23) (0.50) (0.82)\nPartial score 0 2.34 1.44 1.25\n(0.45) (0.53) (0.45)\nPartial score −1 −0.21*** −0.17*** −0.14***\n(5.21) (3.18) (3.19)\nSecond team −0.04** −0.02\n(1.70) (1.60)\nPartial score −1 × second team 0.02** 0.02**\n(1.65) (1.68)\nPenalty kick importance −0.23 −0.09\n(1.10) (1.18)\nPotential winner penalty kick −0.94 −0.03\n(1.03) (1.09)\nPotential loser penalty kick −0.88 −0.53\n(1.05) (1.20)\nInternational competition −0.03 0.44 −0.01\n(0.38) (0.27) (0.32)\nFinal match −1.20 −0.05* −0.06\n(0.99) (1.32) (1.07)\nSemifinal match −0.23 −0.33 −0.42\n(0.19) (0.09) (0.08)\nField fixed effects Yes Yes Yes\nRound fixed effects Yes Yes Yes\nGoalkeeper fixed effects No No Yes\nCompetition type fixed effects No No Yes\nNotes: The endogenous variable equals 1 if the penalty is scored and 0 otherwise. “Partial score \nX” are dummy variables for penalties where the score from the perspective of the kicking team \nis X at the time of kicking. “Potential winner penalty kick” and “Potential loser penalty kick” \nare dummy variables for penalty kicks which if scored or missed mean that the shoot-out will \nbe won or lost respectively. Field fixed effects refer to home field, neutral field, or opponent’s \nhome team field. The sample has 1,343 individual penalty kick observations. Absolute, choice-\nbiased sampling, heteroskedastic-consistent t-statistics are reported in parentheses. The model \nis estimated by GMM.\n*** Significant at the 1 percent level.\n ** Significant at the 5 percent level.\n  * Significant at the 10 percent level.\nVOL. 100 NO. 5 2561ApEstEguiA AND pALAciOs-HuERtA: pREssuRE iN cOmpEtitiVE ENViRONmENts\nWe find that the main determinant of the scoring rate is whether the team is lagging in the \nscore: the variable “partial score −1” has a negative effect that is strongly significant at con-\nventional levels, regardless of whether other endogenous variables relating to the state of the \nshoot-out are included or not. This means that lagging in the score hinders the performance of the \nsubjects. Consequently, the team more likely to find itself with a partial score of −1 (by construc-\ntion, the second kicking team) will have significantly greater chances of losing the tournament. \nWe also find that this effect is mitigated if the kicking team is the one kicking in second place. \nThis latter result is consistent with the intuition that, while a negative partial score is bad news, \nit is especially bad news for a team that has had exactly the same opportunities to score as its \nopponent (the first team to kick). With respect to the magnitude of the effects, Table 8 reports the \nmarginal effects associated with different partial scores and different rounds.\nThe results in panel A show that the transition of a team from a partial score of 0 to +1 has \na positive impact. For the team kicking first, the increase in the probability of scoring is around \n1.50 percent per round for rounds 2 to 4, reaching 3.74 percent in the fifth round. The impact is, as \nexpected, greater for the second team, and ranges from 2.35 percent to 3.55 percent for rounds 2 \nto 4. Moving a team from a partial score of 0 to −1 has a negative impact, whose magnitude in \nabsolute value is greater for the team kicking first and lower for the team kicking second at any \ngiven round than in the case when we move a team from 0 to +1. Finally, since we are dealing \nwith a two-agent zero-sum game, these marginal effects must be compounded in a zero-sum fash-\nion (when one team goes from 0 to +1, the other team must go from 0 to −1) to gain a sense of \ntheir impact on a team’s chances of winning the tournament. Consistent with the basic intuition \nfrom the raw data, this compounded effect is greater in rounds 4 and 5 than in the earlier rounds. \nFor the decisive rounds, the marginal effect for the second team (the only one that exists in these \nrounds) is 6.98 percent. This effect is sizable, although somewhat smaller than the compound \neffect in round 5.\nIn panel B the marginal effects of kicking first rather than second net of other effects are posi-\ntive, though small in magnitude, ranging from 0.26 to 1.37 percent for the first five rounds, and \nrising to 2.53 percent in the decisive rounds.\nFinally, it is important to remark that a penalty kick involves two players: a kicker and a goal-\nkeeper. Hence, it is theoretically possible to consider that it is not that the kicker’s performance \nis hindered by a negative partial score, but rather that the goalkeeper’s performance is enhanced \nTable 8—Marginal Effects\nRound 1 Round 2 Round 3 Round 4 Round 5 Round 6+\npanel A. partial score\nFrom 0 to 1:\n First team — 1.46 1.63 1.41 3.74 —\n Second team — 2.35 2.50 3.55 — —\nFrom 0 to - 1:\n First team — −1.73 −2.17 −3.85 −5.82 —\n Second team −3.12 −0.39 −1.42 −2.35 −4.46 −6.88\npanel B. Kicking first instead of kicking second\n0.26 0.35 0.57 1.05 1.37 2.53\nNotes: These marginal effects represent the percentage change in the probability of scoring \nconditional on each transition among states i to j. In panel A, the states are partial scores; the \ncurrent state is represented by i = 0 at a given round, and j = +1, − 1. In panel B, the state is \nthe kicking order, and current state is represented by kicking second. These effects are com-\nputed from specification (3) in Table 7.\nDEcEmBER 20102562 tHE AmERicAN EcONOmic REViEW\nwhen his team’s partial score is positive. Although this is theoretically possible, in the survey \npresented earlier professional players systematically report that the effect is to put psychological \npressure on the kicker. Not a single player mentions the possibility that the performance of the \nfirst team’s goalkeeper may be enhanced when the partial score is in his favor. In addition, for a \nsubset of all the penalty shoot-outs in the sample we have detailed information on whether the \nno-goals are due to “saves” by the goalkeeper or “misses” by the kicker. In online Appendix A we \nreport the basic features of this subset of the data and the results of a multinomial logit specifica-\ntion with goals, misses, and saves. The raw data show that both teams have basically the same \nproportion of saves, and hence that the difference in scoring rates between the first and the second \nteam basically corresponds to their difference in misses. The logit regressions then show that lag-\nging in the score predicts more misses by the kicker but predicts no more saves by the goalkeeper. \nHence, these results are also consistent with the idea that the psychological effects may operate \nmainly through the kicker.17\nD. policy implications\nWe have found that in a dynamic competitive setting, when information on the performance of \nthe competing agents is available or released in the interim periods or stages, the state of compe-\ntition may have an impact on performance. Thus, these results highlight the role of performance \ninformation in competitive settings and also show that, in terms of the theory of optimal incentive \nprovision, the timing of tasks can be important exclusively for psychological reasons: even when \nthe order of the tasks is determined through a perfect randomized trial, the outcome can be ex \npost unfair. One way to accomplish an ex post fair outcome would be to require that the agents \nperform their task simultaneously. Another would be to require that interim performance be only \nprivately observed and not publicly. In our specific setting it may even be optimal to require that \nagents perform their task before the game starts.18 In more general settings where other factors \nsuch as the choice of effort levels and risky strategies may play a role, it is entirely an empiri-\ncal question how the psychological effects we have documented interact with decision-making \nprocesses and how they then jointly determine performance.19 Hence, the results have implica-\ntions for the merits of different incentive schemes and for the choice of performance information \nrevelation rules. For instance, school officials can decide whether or not to reveal the scores of \nthe students in each round of a contest; in political competitions, election commissions may \ndesign specific policies about the release of information regarding voting tendencies before the \ndate of the election, and in competitions for promotion in internal labor markets principals may \n17 When kickers miss the goal, the goalkeeper’s performance is irrelevant, and so he may perform worse (or better) \nunder pressure. Since most penalties are scored, the upside for the goalkeeper is always greater but less likely than the \ndownside. The opposite is the case for the kicker: his upside is smaller but more likely than the downside. Hence, a greater \npressure on the kicker may be explained in terms of some form of probabilistic loss aversion, that is if losses are perceived \ndisproportionally larger than gains. We are indebted to a referee for these suggestions.\n18 We are indebted to a referee for this suggestion. Juan D. Carrillo (2007) shows that the timing of the shoot-out may \naffect the incentives to exert and allocate effort in the game, and that the attractiveness (appropriately defined) of the \ngame could increase if the shoot-out would take place before rather than after the match is over. Although it is a priori \nunclear in which direction and to what extent the order of events might affect strategies, effort levels, and final outcomes, \nit is theoretically possible that changing the timing of the shoot-out might induce the winning and losing teams to adopt \nstrategies that will make the shoot-out ex post fair.\n19 Intuitively, subjects treated unfairly by the random draw of order would tend to fall behind and then react by exerting \nmore effort and\/or taking more risks than they would otherwise for precisely the same reasons as in the literature cited \nearlier (see footnote 2).\nVOL. 100 NO. 5 2563ApEstEguiA AND pALAciOs-HuERtA: pREssuRE iN cOmpEtitiVE ENViRONmENts\ndecide whether or not to reveal their (partial) assessment of the performance of workers before \nthe competition is over.20\nV. Concluding Remarks\nNature seldom creates circumstances that allow a transparent view of psychological elements \nat work. And, when it does, the phenomena are typically too complex to clearly discern the impact \nof these elements on human behavior. The randomized experiment we have studied provides an \nunusual opportunity and involves highly incentivized professionals performing a simple, familiar \ntask, in a real world strictly competitive situation.\nThe results provide support for a source of psychological pressure that has a detrimental effect \non performance, and that is different from others such as high stakes, social pressure or peer \npressure previously documented in the literature. Since this is a source that is endogenous to the \ncourse of the competition, the results are relevant from both a theoretical and an empirical per-\nspective for competitive environments at large. In particular, R&D races, political elections, com-\npetitions for promotion within certain firms and organizations, student competitions in schools \nand others represent competitive settings that share some or all of the main characteristics of the \nsetting we have studied: they are strictly competitive (zero-sum) situations and feedback infor-\nmation on performance and the state of competition is available to the participants during the \ncompetition. Whether or not psychological elements are important, or even critical, is entirely an \nempirical question. What the results in this paper indicate is that they are critical in the setting \nthat we have studied, and hence that future theoretical and empirical research on dynamic com-\npetitive settings that incorporate psychological elements associated with the state of the competi-\ntion may offer insights that otherwise would be lost.\nLastly, from the perspective of the recent behavioral economics literature, we find a significant \nand quantitatively important type of psychological effect not previously documented. From the \nperspective of rational choice theory, we find that individuals are aware of this effect and they \nrationally respond to it.\nREFERENCES\nArellano, Manuel, and Raquel Carrasco. 2003. “Binary Choice Panel Data Models with Predetermined \nVariables.” Journal of Econometrics, 115(1): 125–57.\nArellano, Manuel, and Bo Honoré. 2001. “Panel Data Models: Some Recent Developments.” in Vol. 5, \nHandbook of Econometrics,  ed. James Heckman and Edward Leamer, 3229–96. Amsterdam: North-\nHolland.\nAriely, Dan, Uri Gneezy, George Loewenstein, and Nina Mazar. 2009. “Large Stakes and Big Mistakes.” \nReview of Economic studies, 76(2): 451–69.\nBecker, Gary S. 1976. the Economic Approach to Human Behavior. Chicago: University of Chicago Press.\nBecker, Gary S. 1996. Accounting for tastes. Cambridge, MA: Harvard University Press.\nBecker, Gary S., and Kevin M. Murphy. 2000. social Economics: market Behavior in a social Environment. \nCambridge, MA: Harvard University Press.\nBeilock, Sian. 2007. “Choking Under Pressure.” In Encyclopedia of social psychology, ed. Roy F. Baumeis-\nter, and Kathleen D. Vohs, 140–41. Thousand Oaks, CA: Sage Publications.\nBhaskar, V. 2009. “Rational Adversaries? Evidence from Randomised Trials in One Day Cricket.” Eco-\nnomic Journal, 119(534): 1–23.\nCabral, Luis M. B. 2002. “Increasing Dominance with No Efficiency Effect.” Journal of Economic theory, \n102(2): 471–79.\n20 In online Appendix B we provide a simple theoretical model that is consistent with the evidence we have presented. \nThe model can be easily generalized to more general settings and is also useful to study specific policy implications for \npenalty shoot-outs such as the optimal allocation of players when they are heterogeneous in quality.\nDEcEmBER 20102564 tHE AmERicAN EcONOmic REViEW\nCabral, Luis M. B. 2003. “R & D Competition When Firms Choose Variance.” Journal of Economics and \nmanagement strategy, 12(1): 139–50.\nCaplin, Andrew, and John Leahy. 2001. “Psychological Expected Utility Theory and Anticipatory Feel-\nings.” Quarterly Journal of Economics, 116(1): 55–79.\nCarrillo, Juan D. 2007. “Penalty Shoot-Outs: Before or after Extra Time?” Journal of sports Economics, \n8(5): 505–18.\nChe, Yeon-Koo, and Terrence Hendershott. 2008. “How to Divide the Possession of a Football?” Econom-\nics Letters, 99(3): 561–65.\nDellaVigna, Stefano. 2009. “Psychology and Economics: Evidence from the Field.” Journal of Economic \nLiterature, 47(2): 315–72.\nEpstein, Larry G., and Igor Kopylov. 2007. “Cold Feet.” theoretical Economics, 2(3): 231–59.\nEricsson, K. Anders, Neil Charness, Robert R. Hoffman, and Paul J. Feltovich, ed. 2006. the cambridge \nHandbook of Expertise and Expert performance. Cambridge, UK: Cambridge University Press.\nHvide, Hans K. 2002. “Tournament Rewards and Risk Taking.” Journal of Labor Economics, 20(4): 877–98.\nHvide, Hans K., and Eirik G. Kristiansen. 2003. “Risk Taking in Selection Contests.” games and Economic \nBehavior, 42(1): 172–79.\nKahneman, Daniel. 1973. Attention and Effort. Englewood Cliffs, NJ: Prentice Hall.\nKőszegi, Botond, and Matthew Rabin. 2006. “A Model of Reference-Dependent Preferences.” Quarterly \nJournal of Economics, 121(4): 1133–65.\nLazear, Edward P., and Sherwin Rosen. 1981. “Rank-Order Tournaments as Optimum Labor Contracts.” \nJournal of political Economy, 89(5): 841–64.\nLoewenstein, George. 1987. “Anticipation and the Valuation of Delayed Consumption.” Economic Journal, \n97(387): 666–84.\nMagnus, Jan R., and Franc J. G. M. Klaassen. 1999. “On the Advantage of Serving First in a Tennis Set: \nFour Years at Wimbledon.” Journal of the Royal statistical society: series D, 48(2): 247–56.\nManski, Charles F. 1995. identification problems in the social sciences. Cambridge, MA: Harvard Univer-\nsity Press.\nMorris, Larry W., Mark A. Davis, and Calvin H. Hutchings. 1981. “Cognitive and Emotional Components \nof Anxiety: Literature Review and a Revised Worry-Emotional Scale.” Journal of Educational psychol-\nogy, 73(4): 541–55.\nPalacios-Huerta, Ignacio. 2003. “Professionals Play Minimax.” Review of Economic studies, 70(2): 395–415.\nPrendergast, Canice. 1999. “The Provision of Incentives in Firms.” Journal of Economic Literature, 37(1): \n7–63.\nRauh, Michael T., and Giulio Seccia. 2006. “Anxiety and Performance: An Endogenous Learning-by-Doing \nModel.” international Economic Review, 47(2): 583–609.\n"}