{"doi":"10.1016\/j.jsr.2007.01.013","coreId":"138254","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/1900","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/1900","10.1016\/j.jsr.2007.01.013"],"title":"Culpable versus non-culpable traffic accidents; What is wrong with this picture?","authors":["af Wahlberg, Anders E.","Dorn, Lisa"],"enrichments":{"references":[{"id":38074564,"title":"Characteristics of low speed accidents with buses in public transport.","authors":[],"date":"2002","doi":"10.1016\/s0001-4575(01)00063-x","raw":"af Wåhlberg, A. E. (2002). Characteristics of low speed accidents with buses in public transport. Accident Analysis and Prevention, 34, 637-647.","cites":null},{"id":38074566,"title":"Characteristics of low speed accidents with buses in public transport. Part II. Accident Analysis and Prevention,","authors":[],"date":"2004","doi":"10.1016\/s0001-4575(02)00128-8","raw":"af Wåhlberg, A. E. (2004). Characteristics of low speed accidents with buses in public transport. Part II. Accident Analysis and Prevention, 36, 63-71.","cites":null},{"id":38074567,"title":"Differential accident involvement of bus drivers.","authors":[],"date":"2005","doi":"10.1080\/13669870802488891","raw":"af Wåhlberg, A. E. (2005). Differential accident involvement of bus drivers. In L. Dorn (Ed.) Driver Behaviour and Training, Volume II, pp. 383-391. Aldershot: Ashgate. Second International Conference on Driver Behaviour and Training.","cites":null},{"id":38074556,"title":"Impression management and self-deception in traffic behaviour inventories.","authors":[],"date":"1997","doi":"10.1016\/s0191-8869(96)00221-8","raw":"Lajunen, T., Corry, A., Summala, H., & Hartley, L. 1997b. Impression management and self-deception in traffic behaviour inventories. Personality and Individual Differences 22, 341-353.","cites":null},{"id":38074555,"title":"Induced exposure.","authors":[],"date":"1973","doi":"10.1016\/0001-4575(73)90019-5","raw":"Haight, F. A., 1973. Induced exposure. Accident Analysis and Prevention 5, 111-126.","cites":null},{"id":38074558,"title":"Perceptual abilities of accident involved drivers.","authors":[],"date":"1986","doi":null,"raw":"Quimby, A. R., Maycock, G., Carter, I. D., Dixon, R., & Wall, J. G. (1986). Perceptual abilities of accident involved drivers. TRRL Research Report 27. Crowthorne: Transport and Road Research Laboratory.","cites":null},{"id":38074553,"title":"Prediction of police officers' traffic accident involvement using behavioral observations. Accident Analysis and Prevention","authors":[],"date":"1995","doi":"10.1016\/0001-4575(94)00072-t","raw":"Gully, S. M., Whitney, D. J., & Vanosdall, F. E. 1995. Prediction of police officers' traffic accident involvement using behavioral observations. Accident Analysis and Prevention 27, 355-362.","cites":null},{"id":38074551,"title":"Reconstructing human contributions to accidents: the new view on error and performance. J Saf Res.","authors":[],"date":"2002","doi":"10.1016\/s0022-4375(02)00032-4","raw":"Dekker SW. Reconstructing human contributions to accidents: the new view on error and performance. J Saf Res. 2002 33; 371-385.","cites":null},{"id":38074565,"title":"Some methodological deficiencies in studies on traffic accident predictors. Accident Analysis and Prevention,","authors":[],"date":"2003","doi":"10.1016\/s0001-4575(02)00025-8","raw":"af Wåhlberg, A. E. (2003). Some methodological deficiencies in studies on traffic accident predictors. Accident Analysis and Prevention, 35, 473-486.","cites":null},{"id":38074563,"title":"The connection between risky driving and involvement in fatal accidents.","authors":[],"date":"1994","doi":"10.1016\/0001-4575(94)90017-5","raw":"Rajalin, S. 1994. The connection between risky driving and involvement in fatal accidents. Accident Analysis and Prevention 26, 555-562.","cites":null},{"id":38074549,"title":"The Five-factor model, conscientiousness, and driving accident involvement.","authors":[],"date":"1996","doi":"10.1111\/j.1467-6494.1996.tb00523.x","raw":"Arthur, W., & Graziano, W. G. 1996. The Five-factor model, conscientiousness, and driving accident involvement. Journal of Personality 64, 593-618.","cites":null},{"id":38074560,"title":"The practical use of projective personality tests as accident predictors.","authors":[],"date":"1965","doi":null,"raw":"Shaw, L. (1965). The practical use of projective personality tests as accident predictors. Traffic Safety Research Review, 9, 34-72.","cites":null},{"id":38074554,"title":"The prediction of individual accident liability with an inventory measuring risk-taking tendency.","authors":[],"date":"1968","doi":null,"raw":"Gumpper, D. C., & Smith, K. R. (1968). The prediction of individual accident liability with an inventory measuring risk-taking tendency. Traffic Safety Research Review, 12, 50-55.","cites":null},{"id":38074561,"title":"The reduction of accidents in a transport company by the determination of the accident liability of individual drivers.","authors":[],"date":"1961","doi":null,"raw":"Shaw, L., & Sichel, H. S. (1961). The reduction of accidents in a transport company by the determination of the accident liability of individual drivers. Traffic Safety Research Review, 5, 2-13.","cites":null},{"id":38074557,"title":"The relation between a driver’s speed and his accident rate.","authors":[],"date":"1967","doi":null,"raw":"Munden, J. W. (1967). The relation between a driver’s speed and his accident rate. RRL Report 88. Crowthorne: Road Research Laboratory.","cites":null},{"id":38074559,"title":"Traffic volume and collisions involving transit and non-transit vehicles. Accident Analysis and Prevention,","authors":[],"date":"1992","doi":"10.1016\/0001-4575(92)90063-o","raw":"Ragland, D. R., Hundenski, R. J., Holman, B. L., & Fischer, J. M. (1992). Traffic volume and collisions involving transit and non-transit vehicles. Accident Analysis and Prevention, 27, 845-851.","cites":null},{"id":38074562,"title":"Trends in highway safety: Effects of an aging population on accident propensity. Accident Analysis and","authors":[],"date":"1995","doi":"10.1016\/0001-4575(94)00086-2","raw":"Stamatiadis, N., & Deacon, J. A. (1995). Trends in highway safety: Effects of an aging population on accident propensity. Accident Analysis and Prevention, 27, 443-459.7 Stamatiadis, N., & Deacon, J. A. (1997). Quasi-induced exposure: methodology and insight. Accident Analysis and Prevention, 27, 443-459.","cites":null},{"id":38074550,"title":"Validation of a visual attention test as a predictor of driving accident involvement.","authors":[],"date":"1994","doi":"10.1111\/j.2044-8325.1994.tb00559.x","raw":"Arthur, W., Strong, M. H., & Williamson, J. 1994. Validation of a visual attention test as a predictor of driving accident involvement. Journal of Occupational and Organizational Psychology 67, 173-182.6 Carr, B. R. (1969). A statistical analysis of rural Ontario traffic accidents using induced exposure data. Accident Analysis and Prevention 5, 343-357.","cites":null},{"id":38074552,"title":"Women drivers’ behaviour, socio-demographic characteristics and accidents.","authors":[],"date":"1999","doi":"10.1016\/s0001-4575(99)00009-3","raw":"Dobson, A., Brown, W., Ball, J., Powers, J., & McFadden, M. 1999. Women drivers’ behaviour, socio-demographic characteristics and accidents. Accident Analysis and Prevention 31, 525-535. Dorn, L., af Wåhlberg, A. E., & Muncie, H. (submitted) Work related road safety: Age, length of service and changes in crash risk.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007","abstract":"It is often implicitly or explicitly assumed in traffic accident research that drivers with accidents designated as non-culpable are a random sample from the population. However, this assumption is dependent upon differences in the criterion used for culpability. If drivers are erroneously categorized by assuming randomness, results could be grossly misleading.\nThe assumption of randomness leads to two predictions: first, no correlation should exist between culpable and non-culpable crashes; and second, the accident groups should differ on the variables known to be associated with accidents, such as amount of driving experience. These predictions were tested in two samples of bus drivers.\nIt was found that in a sample with a harsh criterion (70% culpable accidents) for crash responsibility, the drivers with non-culpable accidents had the features expected, namely, they were more experienced for example, while in a sample with a lenient criterion (50 % culpable), this was not so.\nIt was concluded that similar studies to the present one would need to be undertaken to establish exactly what percentage of drivers in a given population should be assigned culpable accidents, and construct a criterion that yields this ratio. Otherwise, the theoretical assumptions of randomness and non-responsibility will probably be violated to some degree","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/138254.pdf","fullTextIdentifier":"http:\/\/hdl.handle.net\/1826\/1900","pdfHashValue":"062176171712fe5c9075bf544dca67ed1ef44a3c","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/1900<\/identifier><datestamp>2012-01-31T16:15:31Z<\/datestamp><setSpec>hdl_1826_19<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Culpable versus non-culpable traffic accidents; What is wrong with this picture?<\/dc:title><dc:creator>af Wahlberg, Anders E.<\/dc:creator><dc:creator>Dorn, Lisa<\/dc:creator><dc:subject>Bus driver<\/dc:subject><dc:subject>Accident<\/dc:subject><dc:subject>Crash<\/dc:subject><dc:subject>Culpability<\/dc:subject><dc:subject>Responsibility<\/dc:subject><dc:subject>Induced exposure<\/dc:subject><dc:description>It is often implicitly or explicitly assumed in traffic accident research that drivers with accidents designated as non-culpable are a random sample from the population. However, this assumption is dependent upon differences in the criterion used for culpability. If drivers are erroneously categorized by assuming randomness, results could be grossly misleading.\nThe assumption of randomness leads to two predictions: first, no correlation should exist between culpable and non-culpable crashes; and second, the accident groups should differ on the variables known to be associated with accidents, such as amount of driving experience. These predictions were tested in two samples of bus drivers.\nIt was found that in a sample with a harsh criterion (70% culpable accidents) for crash responsibility, the drivers with non-culpable accidents had the features expected, namely, they were more experienced for example, while in a sample with a lenient criterion (50 % culpable), this was not so.\nIt was concluded that similar studies to the present one would need to be undertaken to establish exactly what percentage of drivers in a given population should be assigned culpable accidents, and construct a criterion that yields this ratio. Otherwise, the theoretical assumptions of randomness and non-responsibility will probably be violated to some degree.<\/dc:description><dc:publisher>Elsevier<\/dc:publisher><dc:date>2007-10-15T15:08:00Z<\/dc:date><dc:date>2007-10-15T15:08:00Z<\/dc:date><dc:date>2007<\/dc:date><dc:type>Postprint<\/dc:type><dc:format>64008 bytes<\/dc:format><dc:format>application\/pdf<\/dc:format><dc:identifier>A.E. af Wahlberg and L. Dorn, Culpable versus non-culpable traffic accidents; What is wrong with this picture?, Journal of Safety Research, Volume 38, Issue 4, 2007, Pages 453-459.<\/dc:identifier><dc:identifier>0022-4375<\/dc:identifier><dc:identifier>http:\/\/hdl.handle.net\/1826\/1900<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.jsr.2007.01.013<\/dc:identifier><dc:language>en<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0022-4375","issn:0022-4375"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["Bus driver","Accident","Crash","Culpability","Responsibility","Induced exposure"],"subject":["Postprint"],"fullText":"1Journal of Safety Research, Vol. 38, Iss. 4 2007 pg 453-459\nCulpable versus non-culpable traffic accidents;\nwhat is wrong with this picture?\nAbstract\nIt is often implicitly or explicitly assumed in traffic accident research that drivers with accidents\ndesignated as non-culpable are a random sample from the population. However, this assumption is very\nvulnerable to differences in the criterion used for culpability in previous research. The assumption of\nrandomness leads to two predictions; firstly no correlation should exist between culpable and non-\nculpable crashes, and secondly the groups with such accidents should differ in their age and experience\netc. These predictions were tested in two samples of bus drivers. It was found that in a sample with a\nharsh criterion for responsibility, the drivers with non-culpable accidents had the features expected,\nnamely, they were more experienced for example, while in a sample with a lenient criterion, this was\nnot so. It was concluded that similar studies to the present one would need to be undertaken to establish\nexactly what percentage of drivers in a given population should have culpable accidents and construct a\ncriterion which yields this ratio. Otherwise, the theoretical assumptions of randomness and non-\nresponsibility will probably be violated to some degree.\nKey words: bus driver, accident, crash, culpability, responsibility, induced exposure\n2Introduction\nThroughout the history of traffic accident research responsibility for being involved in\na crash has received little attention. At one end, researchers have suggested that each\nperson is fully responsible for every crash; many who conducted research into\naccident proneness seem to have held this belief (e.g. Shaw, 1961; Shaw & Sichel,\n1965). At the other end, there are those who believe that all accidents are due to errors\nin 'the system', and prefer not to blame drivers (e.g. Dekker, 2002).\nHowever, regardless of which theoretical stance is taken, it is a fact that very little\nresearch has been undertaken to actually study the relations between blameworthy and\nnon blameworthy incidents. For example, none of the 100+ accident prediction\nstudies reviewed in af Wåhlberg (2003) had any reference or discussion concerning\nhow culpability should be handled or what effects different criterions could have.\nEven the one source where culpability is an important subject and theoretical\nconsiderations made explicit, induced exposure methods (Carr, 1969; Haight, 1973;\nStamatiadis & Deacon, 1995), there seems to be a similar lack of research into the\nconcept itself, apart from Stamatiadis and Deacon (1997) as a notable exception.\nBut why is culpability important as a concept? In induced exposure methods, the\nreasoning is that it is possible to compare drivers in collisions on various variables, by\nturning culpable and non-culpable drivers into separate groups. If these groups differ,\nit is concluded that the difference tells us something about the causes of accidents.\nHowever, this method assumes that the non-culpable group's accidents are random\nhappenings which they have not had any influence on, but are only due to their\nexposure. Therefore, the non-culpable drivers are a random sample of the driving\npopulation (Stamatiadis & Deacon, 1997).\nIn some accident prediction studies, the thinking is similar, but the method different;\nnon-culpable accidents are seen as non-predictable from psychological variables,\nbecause they are not due to the behaviour of the driver, and should therefore be\nexcluded as a dependent variable. In this tradition, a few studies have tested using ‘all\naccidents’ and ‘culpable only accidents’as criterion, mainly with the result that the\nlatter had stronger associations with the predictors (e.g. Lajunen, Corry, Summala &\nHartley, 1997b; Gully, Whitney & Vanosdall, 1995; Arthur & Graziano, 1996;\nRajalin, 1994; but see also Dobson, Brown, Ball, Powers & McFadden, 1999;\nQuimby, Maycock, Carter, Dixon & Wall, 1986; Arthur, Strong & Williamson, 1994,\nfor other results).\nHaving ascertained that some theoretical stances do assume that non-culpable\naccidents are random, we turn to the problem of what criterion is used to actually\nassign culpability. This kind of coding would most often seem to be regarded as\nunproblematic (most of the researchers analyzing culpability seem to accept the way\npolice officers and companies have categorized their data, e.g. Gumpper & Smith,\n1968; Carr, 1969; Gully, Whitney & Vanosdall, 1995; Chandraratna, Stamatiadis &\nStromberg, 2006), but there is precious little research into the inter-rater reliability of\ncoding (e.g. af Wåhlberg, 2002), not to mention how well the criterions actually\ncapture the theoretical division of culpable versus non-culpable accidents.\nHowever, apart from Stamatiadis and Deacon (1997)1 no study has been found which\nhas tested the characteristics of non-culpable accidents by themselves, although, given\nthe theoretical considerations above, a number of predictions can be made concerning\ndrivers with non-culpable accidents (af Wåhlberg, 2003). First, if non-culpable\naccidents happen randomly to drivers, there should be no correlation between the\n1 These authors did not use the driver as the unit of analysis.\n3number of culpable and non-culpable for each driver when exposure has been held\nconstant. Second, neither should non-culpable accidents correlate with themselves in\nanother time period when exposure has been held constant. Third, drivers with non-\nculpable crashes only should be very similar to drivers without accidents, and\ndissimilar from those with culpable crashes, on variables which have been shown to\nrelate to crash involvement. Such a well-known parameter is for example experience2.\nThe general thinking here was that if an effect has been found for a variable\nconcerning accidents in general, this effect should reside mainly in the culpable\ncategory. Fourth, it should be possible to see differences in the size of these effects\ndue to differences in the criterion for culpability used for a population.\nMethod\nSamples and variables\nThe study was conducted using two different bus driver samples, one British and one\nSwedish. For the first, number of accidents for (each year of) a five-year period at\nthree levels of culpability (none, some, sole), and number of years employed\n(experience) as a driver were available. The same data existed for the Swedish\nsample, plus exposure (hours of work per year) and ethnicity, crudely dichotomized as\npeople with typical Swedish names versus others.\nFor the UK sample, culpability was assigned by the bus company in cooperation with\nan insurance team, while the Swedish data was retrieved from a research database (af\nWåhlberg, 2002; 2004). For the present study, culpability was dichotomized.\nCategories and statistical treatment\nTo test some of the hypotheses presented in the introduction, the drivers were sorted\ninto three categories; those with no accidents, those with non-culpable only, and\ndrivers with culpable accidents. If the criterion used to assign culpability is correct, it\ncan be expected that the no accidents and non-culpable accidents groups will be very\nsimilar on all variables except exposure, and that both will differ from the culpable\naccidents group. Such differences can be tested using t-tests.\nData could also be arranged with number of accidents per driver for two variables;\nnon-culpable and culpable.\nResults\nGeneral\nDescriptive data for both samples can be seen in Table 1. The most noteworthy\nfeatures at this stage was the fifty-fifty distribution of responsibility for the British\ndrivers, as compared to two to one for the Swedish drivers, and the large difference in\nmean number of accidents.\nUK sample\nFirst, the three groups of drivers were compared on the experience variable, as shown\nin Table 2. No differences were significant. However, it should be noted that the\ndrivers with no accidents were closer to culpable than to non-culpable drivers in\nexperience, which was unexpected. Thereafter, experience and the accident categories\nwere correlated, with results that can be seen in Table 3. It is noticeable that not only\n2 Age (another variable which usually has an impact on safety) has not been shown to have any\ninfluence in these data (Dorn, af Wåhlberg & Muncie, submitted; af Wåhlberg, 2005).\n4are the accident variables fairly strongly associated, but experience does seem to have\nat least as much impact on non-culpable as culpable accidents. Finally, culpable\naccidents correlated .419, and the non-culpable .377 (N=464, p<.001) between the\ntime periods 2001\/2002 versus 2003\/2005.\nSwedish sample\nAs can be seen in Table 4, experience was significantly different between the drivers\nwith culpable accidents and those without, whether they had had non-culpable\naccidents or not. The latter two groups were very similar. These effects may have\nbeen due to different numbers of hours worked. However, although those with no\naccidents did work significantly fewer hours as compared to those with culpable\naccidents, drivers with non-culpable crashes only worked longer hours than those with\nno accidents (as can be seen in Table 5).\nSimilar results surfaced for the ethnicity variable, despite its crudeness. In Table 5 it\ncan be seen that drivers with Swedish names were more common in the no accident\nand non-culpable groups, despite that the latter worked even more than those with\nculpable incidents.\nThereafter, the variables were correlated. The results can be seen in Table 6and show\nthat the association between the two categories of accidents is not significant, and that\nexperience has the strongest effect on culpable accidents. Finally, accidents were\ncorrelated between time periods, and it was found that culpable accidents had .317\ncorrelation, while the association for non-culpable was close to zero. Holding constant\nthe number of hours worked (accidents\/hour) during these years had little impact on\nany of the correlations.\nDiscussion\nThe present results would seem to indicate that so-called non-culpable accidents are\nnot always a random sample of the population, as the UK sample clearly did not\nconform to the theoretical expectations for such a group. The Swedish sample, on the\nother hand, fulfilled these expectations, even before exposure had been held constant.\nThe explanation for this difference lies obviously with the difference in culpability\ncriterion (if it is assumed that UK and Swedish drivers are in fact equally often\nculpable for their accidents); the UK criterion would appear to be somewhat too\ngenerous.\nThe question of whether a criterion is correct, i.e. actually sort drivers' accidents into\nthe right categories have rarely been researched. Moreover, the level of culpable\ndrivers differ strongly between studies; 62 percent for police officers (Cation, Mount\n& Brenner, 1951), 35-39 percent for bus drivers (Brandaleone & Flamm, 1955), 50\npercent for motorcyclists (Quimby, Maycock, Carter, Dixon & Wall, 1986), 52-62\npercent for car drivers in self-report (Dobson, Brown, Ball, Powers & McFadden,\n1999) and 39-52 percent for police-recorded crashes (Munden, 19673).\nFrom the present results and theoretical considerations, it could be suggested that for\nresearch purposes, for example in induced exposure analysis, the ratio of culpable to\nnon-culpable accidents in a population should be empirically determined, using\nmethods like the ones in this study, and the criterion thereafter set to achieve this\nbalance. If not, assumptions, explicit or implicit, may be violated, and the results\nmisleading. For example, Chandraratna, Stamatiadis and Stromberg (2006) used state\n3 This study used the term 'primary vehicle', which has been interpreted as akin to culpability.\n5records on culpability for crashes, trying to predict whether a driver will be culpable\nfor a crash given their previous record of accidents etc. However, these authors also\nreported that culpable and non-culpable crashes correlated .49 (for an eight-year\nperiod), and that about half of the drivers were at fault. Given the results in the present\nstudy, it can be suspected that the criterion used was too mild, and that a serious\namount of error was introduced into the study due to misclassification of incidents.\nUnfortunately, the Chandraratna et al study is also one of the few to actually report a\ncorrelation between accident categories. Turning back to the problem of the ratio of at\nfault to not at fault, it can be guessed from the present results and the study of\nChandraratna et al, that 50 percent at fault is too low.\nIt can be noted that the present results are similar to those of Stamatiadis and Deacon\n(1997), but the conclusions different. They did find shared variance between culpable\nand non-culpable accidents that they could not explain by reference to exposure alone,\nwhich they discussed in the following terms; \"To the extent, however, that similar\ntypes of drivers\/vehicles tend to travel on similar types of facilities and at similar\ntimes, some correlation between responsible and not-responsible parties would be\nexpected. Moreover, less capable drivers would seem to be more likely to be the not-\nresponsible driver due to their less effective defensive driving techniques.\" (p. 41.\nitalics added). Indirectly, these authors seem to accept that some 'non-responsible'\ndrivers actually do have a part in causing the accidents. Anyway, in the end they\nconcluded that this effect was too small to have any significant impact.\nFurthermore, it may also be noticed that the present results do support the theoretical\ndivision of accidents by culpability, not only when induced exposure techniques are\nused, but also when accidents are to be predicted. Such a split has so far been\nuncommon in individual accident record prediction studies (af Wåhlberg, 2003), but\nthe present results again underscore the importance of being clear about what\ncategories of culpability is being predicted. Also, apart from the induced exposure\nmethod research, a number of studies of a traffic engineering flavour would seem to\nuse the culpability split without much consideration of whether the theoretical\ndivision is actually mirrored by an empirical one (e.g. Ragland, Hundenski, Holman\n& Fisher, 1992). The results of such reports may therefore be questioned based on the\npresent study.\nRegarding methodology, it can be argued that the correlations for the UK sample are\neasier to interpret, as both accident categories are equally large. In the Swedish\nsample, the non-culpable accidents are fewer than their culpable counterparts, and\nthese correlations are therefore probably somewhat underestimated, due to lower\nvariance.\nAcknowledgement\nThe data used in this paper had been generously made available by a major UK bus company and\nGamla Uppsalabuss.\nReferences\nArthur, W., & Graziano, W. G. 1996. The Five-factor model, conscientiousness, and\ndriving accident involvement. Journal of Personality 64, 593-618.\nArthur, W., Strong, M. H., & Williamson, J. 1994. Validation of a visual attention test\nas a predictor of driving accident involvement. Journal of Occupational and\nOrganizational Psychology 67, 173-182.\n6Carr, B. R. (1969). A statistical analysis of rural Ontario traffic accidents using\ninduced exposure data. Accident Analysis and Prevention 5, 343-357.\nDekker SW. Reconstructing human contributions to accidents: the new view on error\nand performance. J Saf Res. 2002 33; 371-385.\nDobson, A., Brown, W., Ball, J., Powers, J., & McFadden, M. 1999. Women drivers’\nbehaviour, socio-demographic characteristics and accidents. Accident Analysis and\nPrevention 31, 525-535.\nDorn, L., af Wåhlberg, A. E., & Muncie, H. (submitted) Work related road safety:\nAge, length of service and changes in crash risk.\nGully, S. M., Whitney, D. J., & Vanosdall, F. E. 1995. Prediction of police officers'\ntraffic accident involvement using behavioral observations. Accident Analysis and\nPrevention 27, 355-362.\nGumpper, D. C., & Smith, K. R. (1968). The prediction of individual accident liability\nwith an inventory measuring risk-taking tendency. Traffic Safety Research Review,\n12, 50-55.\nHaight, F. A., 1973. Induced exposure. Accident Analysis and Prevention 5, 111-126.\nLajunen, T., Corry, A., Summala, H., & Hartley, L. 1997b. Impression management\nand self-deception in traffic behaviour inventories. Personality and Individual\nDifferences 22, 341-353.\nMunden, J. W. (1967). The relation between a driver’s speed and his accident rate.\nRRL Report 88. Crowthorne: Road Research Laboratory.\nQuimby, A. R., Maycock, G., Carter, I. D., Dixon, R., & Wall, J. G. (1986).\nPerceptual abilities of accident involved drivers. TRRL Research Report 27.\nCrowthorne: Transport and Road Research Laboratory.\nRagland, D. R., Hundenski, R. J., Holman, B. L., & Fischer, J. M. (1992). Traffic\nvolume and collisions involving transit and non-transit vehicles. Accident Analysis\nand Prevention, 27, 845-851.\nShaw, L. (1965). The practical use of projective personality tests as accident\npredictors. Traffic Safety Research Review, 9, 34-72.\nShaw, L., & Sichel, H. S. (1961). The reduction of accidents in a transport company\nby the determination of the accident liability of individual drivers. Traffic Safety\nResearch Review, 5, 2-13.\nStamatiadis, N., & Deacon, J. A. (1995). Trends in highway safety: Effects of an\naging population on accident propensity. Accident Analysis and Prevention, 27, 443-\n459.\n7Stamatiadis, N., & Deacon, J. A. (1997). Quasi-induced exposure: methodology and\ninsight. Accident Analysis and Prevention, 27, 443-459.\nRajalin, S. 1994. The connection between risky driving and involvement in fatal\naccidents. Accident Analysis and Prevention 26, 555-562.\naf Wåhlberg, A. E. (2002). Characteristics of low speed accidents with buses in public\ntransport. Accident Analysis and Prevention, 34, 637-647.\naf Wåhlberg, A. E. (2003). Some methodological deficiencies in studies on traffic\naccident predictors. Accident Analysis and Prevention, 35, 473-486.\naf Wåhlberg, A. E. (2004). Characteristics of low speed accidents with buses in public\ntransport. Part II. Accident Analysis and Prevention, 36, 63-71.\naf Wåhlberg, A. E. (2005). Differential accident involvement of bus drivers. In L.\nDorn (Ed.) Driver Behaviour and Training, Volume II, pp. 383-391. Aldershot:\nAshgate. Second International Conference on Driver Behaviour and Training.\nEdinburgh 15-17 November, 2005.\n8Table 1: Descriptive data for the samples: Percentage of drivers with Swedish names. Means and\nstandard deviations for age, experience (years employed), and accidents for the whole time period (all,\nand sub-divided into the two culpability categories). Age and experience calculated at the beginning of\nthe period. Last, the number of hours worked for the whole period.\nSample N Ethnicity Age Experien\nce\nAccidents\nAll Culpabl\ne\nNon-\nculpable\nHour\ns\nUK (five years) 464 46.2\/9.1\n(N=407)\n9.9\/9.0 4.74\/3.7\n8\n2.35\/2.2\n6\n2.39\/2.35 -\nSwedish (five\nyears)\n255 57% 45.0\/9.7 10.3\/10.2 1.45\/1.6\n2\n1.05\/1.4\n0\n0.40\/0.67 7193\n9Table 2: Comparisons of experience between the three groups of drivers in the UK sample; those with\nno accidents, those with non-culpable only, and those with culpable ones. Independent t-tests between\nmeans. Some comparisons for age were not possible to calculate, due to missing cases.\nGroups Variable Means N t p\nNon-culpable\/No accidents Experience 11.6 9.9 58\/60 1.0 ns\nNon-culpable\/Culpable Experience 11.6 9.6 58\/346 1.6 ns\nNo accidents\/Culpable Experience 9.9 9.6 60\/346 0.3 ns\n10\nTable 3: The correlations between experience and accidents for the UK sample. N=464.\nVariable Experience Culpable\nNon-culpable -.109* .338***\nCulpable -.093*\n* p<.05, ***p<.001\n11\nTable 4: Comparisons of experience between the three groups of drivers in the Swedish sample; those\nwith no accidents, those with non-culpable only, and those with culpable ones. Independent t-tests\nbetween means.\nGroups Means N t p\nNon-culpable\/No accidents 13.1 12.9 32\/83 0.1 ns\nNon-culpable\/Culpable 13.1 8.2 32\/138 2.6 <.05\nNo accidents\/Culpable 12.9 8.2 83\/138 3.3 <.001\n12\nTable 5: The percentage of drivers with Swedish names in each of the groups; those with no accidents,\nthose with non-culpable only, and those with culpable accidents.\nAll drivers No accidents Non-culpable Culpable\nN 255 83 32 140\nPercentage Swedish 57 67.5 62.5 50.0\nHours worked 2001-2005 7193 6701 7504 7414\n13\nTable 6: The correlations between culpable and non-culpable accidents, hours worked, experience and\nage for bus drivers in the Swedish sample. N= 253.\nVariable Non-culpable Culpable Hours worked\nCulpable accidents .102\nHours worked .153* .145*\nExperience -.046 -.276*** -.066\n* p<.05, *** p<.001\n"}