{"doi":"10.1103\/PhysRevB.69.201305","coreId":"102322","oai":"oai:epubs.surrey.ac.uk:1781","identifiers":["oai:epubs.surrey.ac.uk:1781","10.1103\/PhysRevB.69.201305"],"title":"Thickness Dependence of Hall Transport in Ni<sub>1.15<\/sub>Mn<sub>0.85<\/sub>Sb Thin Films on Silicon","authors":["Branford, W R","Clowes, S K","Bugoslavsky, Y V","Gardelis, S","Androulakis, J","Giapintzakis, J","Grigorescu, C E A","Manea, S A","Freitas, R S","Roy, S B","Cohen, L F"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-01-01","abstract":"<p>Highly spin polarized Heusler alloys, NiMnSb and Co2MnSi, attract a great deal of interest as potential spin injectors for spintronic applications. Spintronic devices require control of interfacial properties at the ferromagnet:semiconductor contact. To address this issue we report a systematic study of the ordinary and anomalous Hall effect, in Ni1.15Mn0.85Sb films on silicon, as a function of film thickness. In contrast to the bulk stoichiometric material, the Hall carriers in these films become increasingly electron-like as the film thickness decreases, and as the temperature increases from 50 K toward room temperature. High field Hall measurements confirm that this is representative of the majority transport carriers. This suggests that current injected from a NiMnSb:semiconductor interface may not necessarily carry the bulk spin polarization. The films also show a low temperature upturn in the resistivity, which is linked to a discontinuity in the anomalous Hall coefficient. Overall these trends indicate that the application of Heusler alloys as spin injectors will require strictly controlled interfacial engineering, which is likely to be demanding in these ternary alloys.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1781<\/identifier><datestamp>\n      2017-10-31T14:03:06Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:70686F746F6E696373<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:70687973696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1781\/<\/dc:relation><dc:title>\n        Thickness Dependence of Hall Transport in Ni<sub>1.15<\/sub>Mn<sub>0.85<\/sub>Sb Thin Films on Silicon<\/dc:title><dc:creator>\n        Branford, W R<\/dc:creator><dc:creator>\n        Clowes, S K<\/dc:creator><dc:creator>\n        Bugoslavsky, Y V<\/dc:creator><dc:creator>\n        Gardelis, S<\/dc:creator><dc:creator>\n        Androulakis, J<\/dc:creator><dc:creator>\n        Giapintzakis, J<\/dc:creator><dc:creator>\n        Grigorescu, C E A<\/dc:creator><dc:creator>\n        Manea, S A<\/dc:creator><dc:creator>\n        Freitas, R S<\/dc:creator><dc:creator>\n        Roy, S B<\/dc:creator><dc:creator>\n        Cohen, L F<\/dc:creator><dc:description>\n        <p>Highly spin polarized Heusler alloys, NiMnSb and Co2MnSi, attract a great deal of interest as potential spin injectors for spintronic applications. Spintronic devices require control of interfacial properties at the ferromagnet:semiconductor contact. To address this issue we report a systematic study of the ordinary and anomalous Hall effect, in Ni1.15Mn0.85Sb films on silicon, as a function of film thickness. In contrast to the bulk stoichiometric material, the Hall carriers in these films become increasingly electron-like as the film thickness decreases, and as the temperature increases from 50 K toward room temperature. High field Hall measurements confirm that this is representative of the majority transport carriers. This suggests that current injected from a NiMnSb:semiconductor interface may not necessarily carry the bulk spin polarization. The films also show a low temperature upturn in the resistivity, which is linked to a discontinuity in the anomalous Hall coefficient. Overall these trends indicate that the application of Heusler alloys as spin injectors will require strictly controlled interfacial engineering, which is likely to be demanding in these ternary alloys.<\/p><\/dc:description><dc:date>\n        2004-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1781\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Branford, W R, Clowes, S K, Bugoslavsky, Y V, Gardelis, S, Androulakis, J, Giapintzakis, J, Grigorescu, C E A, Manea, S A, Freitas, R S, Roy, S B and Cohen, L F  (2004) Thickness Dependence of Hall Transport in Ni1.15Mn0.85Sb Thin Films on Silicon   Physical Review B, 69 (20).       <\/dc:identifier><dc:relation>\n        10.1103\/PhysRevB.69.201305<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1781\/","10.1103\/PhysRevB.69.201305"],"year":2004,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"RAPID COMMUNICATIONS\nPHYSICAL REVIEW B 69, 201305~R! ~2004!Thickness dependence of Hall transport in Ni1.15Mn0.85Sb thin films on silicon\nW. R. Branford,* S. K. Clowes, and Y. V. Bugoslavsky\nBlackett Laboratory, Imperial College, Prince Consort Road, London SW7 2BZ, United Kingdom\nS. Gardelis, J. Androulakis, and J. Giapintzakis\nFoundation for Research and Technology—Hellas, Institute of Electronic Structure and Laser, P.O. Box 1527, Vasilika Vouton,\n711 10 Heraklion, Crete, Greece\nC. E. A Grigorescu and S. A. Manea\nNational Institute for Research & Development for Optoelectronics, Bucharest, Romania\nR. S. Freitas\nInstituto de Fı´sica, Universidade Federal Fluminense, Campus da Praia Vermelha, Nitero´i, 24210-340 Rio de Janeiro, Brazil\nS. B. Roy\nLow Temperature Physics Laboratory, Centre for Advanced Technology, Indore 452013, India\nL. F. Cohen\nBlackett Laboratory, Imperial College, Prince Consort Road, London SW7 2BZ, United Kingdom\n~Received 12 December 2003; published 18 May 2004!\nHighly spin polarized Heusler alloys, NiMnSb and Co2MnSi, attract a great deal of interest as potential spin\ninjectors for spintronic applications. Spintronic devices require control of interfacial properties at the ferro-\nmagnet:semiconductor contact. To address this issue we report a systematic study of the ordinary and anoma-\nlous Hall effect, in Ni1.15Mn0.85Sb films on silicon, as a function of film thickness. In contrast to the bulk\nstoichiometric material, the Hall carriers in these films become increasingly electron-like as the film thickness\ndecreases, and as the temperature increases from 50 K toward room temperature. High field Hall measurements\nconfirm that this is representative of the majority transport carriers. This suggests that current injected from a\nNiMnSb:semiconductor interface may not necessarily carry the bulk spin polarization. The films also show a\nlow temperature upturn in the resistivity, which is linked to a discontinuity in the anomalous Hall coefficient.\nOverall these trends indicate that the application of Heusler alloys as spin injectors will require strictly\ncontrolled interfacial engineering, which is likely to be demanding in these ternary alloys.\nDOI: 10.1103\/PhysRevB.69.201305 PACS number~s!: 73.50.Jt, 85.75.2d, 73.61.At, 75.50.2yIt has long been known that there is a component of the\nHall resistivity of ferromagnets proportional to the magneti-\nzation, rxy5ROB1RSm0M , where RO and RS are known,\nrespectively, as the ordinary and anomalous Hall coefficients\nand m0M is the magnetization. The recent development1,2 of\ntheories, based on the Berry3 ~or Pancharatnam! phase, that\nquantitatively describe the behavior of RS in a number of\ndifferent systems has resulted in a resurgence of interest in\nthe anomalous Hall effect ~AHE!. The observation of a non-\nzero anomalous Hall velocity requires a finite spin polariza-\ntion of the transport current and spin-orbit coupling. This\nholds out the intriguing possibility that the transport spin\npolarization can be extracted from anomalous Hall measure-\nments in well characterized systems.\nThe half Heusler4 alloy NiMnSb is ferromagnetic with a\nCurie temperature (TC) of 728 K,5 and band structure calcu-\nlations predict that it is half-metallic6 with the spin-polarized\ncarriers holes derived from the Sb 6s2 band. Further calcu-\nlations have shown the transport spin polarization (Pt) of\nNiMnSb to be highly sensitive to atomic disorder7 and sur-\nface effects.8,9 Ideally spin injection for spintronic applica-\ntions will require the carriers close to the injection interface\nto carry the bulk spin polarization.0163-1829\/2004\/69~20!\/201305~4!\/$22.50 69 2013A primary motivation for performing this study was to\ndetermine whether bulk-like transport could be achieved in\nthin films and hence evaluate NiMnSb as a potential spin\ninjector. Here, we report a systematic study of the longitudi-\nnal (rxx) and Hall (rxy) electrical resistivities of\nNi1.15Mn0.85Sb films on silicon as a function of film thick-\nness. We demonstrate that the film transport properties close\nto the interface vary quite drastically compared to bulk—like\nbehavior and this has important implications for using this\nmaterial in spintronic applications. Thin films of\nNi1.15Mn0.85Sb, with thicknesses of 5, 45, 80, 110 and 400\nnm, were grown on Si~100! by pulsed laser deposition10 at\n200 °C from a stoichiometric target. All films were shown by\nenergy dispersive x-ray analysis to be slightly off-\nstoichiometric, formulated Ni11xMn12ySb; x50.1560.05,\ny50.1560.05. The x-ray diffraction patterns were consistent\nwith ~220! oriented polycrystalline NiMnSb Heusler phase\nwith lattice parameter 5.99 Å60.02 Å, compared to\n5.9320 Å60.0028 Å for the target. No second phase was\nobserved. The rocking curve of the ~220! reflection indicated\nthat the out-of-plane alignment was imprecise, with a spread\nof orientations of 12 around @110#.\nMagnetotransport data were collected in a square geom-\netry by the van der Pauw method. The geometry led to a©2004 The American Physical Society05-1\nRAPID COMMUNICATIONS\nW. R. BRANFORD et al. PHYSICAL REVIEW B 69, 201305~R! ~2004!strong mixing of the Hall and MR components, which were\nseparated by their opposite symmetries with respect to inver-\nsion of the magnetic field. The temperature and field depen-\ndence of the magnetoresistance were reported previously.11\nThe field dependence of the magnetization of the films was\nmeasured at the same temperatures and in the same geometry\n~field perpendicular to the film surface! as the Hall measure-\nments, in an Oxford Instruments vibrating sample magneto-\nmeter. In this geometry the magnetic anisotropy of the films\nis dominated by the shape anisotropy. A reliable magnetiza-\ntion could not be obtained for the 5 nm film.\nThe Hall resistivity was measured for all the films at se-\nlected temperatures between 50 and 290 K, the data for the\n80 nm film, which is typical of all the films, is shown in Fig.\n1. An iterative procedure was used to fit the measured Hall\nresistivity to the expression for rxy5ROB1RSm0M , using\nindependently measured magnetization, which was measured\nat the same temperature, and in the same geometry ~with\nfield perpendicular to film surface!. We previously used this\nmethod to report12 the Hall transport of the thickest film.\nWith this field orientation the demagnetization factor (N) is\nunity, hence the flux density, B5m0@H14p(12N)M #\n5m0H , where H is the applied magnetic field in A\/m. The\nfitting procedure was limited to the range of data 1.5 T\n>m0H>0 T, because a slight curvature was observed in rxy\nat larger fields, indicating that the low-field limit model ~dis-\ncussed in the following! becomes inappropriate above 1.5 T.\nThe solid lines in Fig. 1 are fits to the data for the 80 nm film\nat a selection of temperatures. The temperature dependence\nof the low field limit ordinary Hall coefficient RO obtained\nfrom this fitting procedure, for all the films, is shown in Fig.\n2. The temperature dependence of rxx is also shown in Fig.\n2, for comparison. Note an increasingly strong low tempera-\nture upturn in rxx is observed with decreasing thickness.\nIn the stoichiometric bulk material RO remains positive at\nall temperatures below TC .13,14 It is immediately apparent\nfrom Fig. 2~b! that the transport in all these films is different\nto that material, as RO is increasingly negative as the tem-\nperature increases from 50 K, and as the thickness decreases.\nFIG. 1. Hall resistivity ~open squares! vs field for 80 nm film at\n50, 60, 70, 80, 90, 100, 110, 130, 150, 200, 250, and 290 K. Solid\nlines show fit to rxy5ROB1RSM at each temperature. Inset: Hall\nresistivity vs field for 5 nm film at selected temperatures.20130The crossover from positive to negative RO corresponds to a\ncrossover from hole dominated to electron dominated Hall\ntransport, and hence that the Hall data must be considered\nwithin a two-carrier model. Band structure calculations6 pre-\ndict that the spin polarized carriers are Sb holes, so the ob-\nservation of electron dominated transport at room tempera-\nture in thin films suggests that NiMnSb may not be an\nefficient spin injector.\nIn a two-carrier system, RO is only constant in the low\nfield limit ~when me ,h 2B2!1), in this limit RO is given by\nEq. ~1!, where n and p are the electron and hole carrier\nconcentrations and me and mh are the respective mobilities.\nIn the high field limit (me ,h 2B2@1) the dependence on the\nmobility ratio z disappears and RO51\/(p2n)e; hence it be-\ncomes a direct measure of the majority carriers. Therefore, if\nthe low-field Hall resistivity has been dominated by a high\nmobility minority carrier, then there must be a strong curva-\nture of rxy at intermediate fields with an eventual change of\nsign,\nRO5\np2nz2\nueu~p1nz !2\n, z5\nme\nmh\n. ~1!\nHence, the low-field Hall mobility is not necessarily rep-\nresentative of the majority transport carriers. For example,15\nin CrO2 there are a small number of high mobility holes and\naround 500 times more low mobility electrons, the low-field\nHall is hole-like, and the high-field Hall is electron-like, in\nagreement with the thermopower. To investigate whether the\nlow-field Hall is representative of the majority transport car-\nriers, the high field Hall resistivity of the 5 nm sample was\nmeasured, this is plotted in the inset to Fig. 1. There is a\nslight curvature toward less negative slope with increasing\nfield, but unlike CrO2 ~Ref. 15! neither a sign change nor the\nhigh field limit is reached by 8 T. This strongly suggests that\nthe low-field Hall is representative of the majority transport\ncarriers. The curvature can be fit to the two band model16,15\nbut the refined parameters are strongly correlated and unique\nfit could not be obtained. This is consistent with the\nobservation15 that a reliable fit can only be obtained by re-\nlating the band parameters to the measured low-field limit,\nFIG. 2. ~a! Longitudinal resistivity vs temperature for the series\nof films. ~b! Ordinary Hall coefficient RO vs temperature, solid lines\nare a guide to the eye.5-2\nRAPID COMMUNICATIONS\nTHICKNESS DEPENDENCE OF HALL TRANSPORT IN . . . PHYSICAL REVIEW B 69, 201305~R! ~2004!high field limit and crossover point values. There is no fea-\nture in the temperature dependence of RO associated with the\nresistivity upturn; this suggests that the resistivity upturn is\nnot due to a freezing out of carriers, but to a decrease in\ncarrier mobility.\nDetailed knowledge of the transport carriers as a function\nof thickness is important for understanding spin injection\nprocesses at ferromagnet:semiconductor interfaces. Four re-\nlations are required to determine the four band parameters,\nthe Hall and the zero field resistivity provide two. Two-\ncarrier transport analysis is routine in high mobility semicon-\nductors, where the other two relations are obtained from the\nShubnikov–de Haas oscillations and the MR. In these films\nthat information is not accessible because the two-carrier MR\nis masked by the anomalously large positive MR17 and in\nmetals Shubnikov–de Haas oscillations are only observed in\nextremely high fields. Therefore, only a qualitative analysis\nof the band parameters can be made. The sign reversal of the\nlow field RO with increasing temperature, even in the thick-\nest film, shows that at low temperature p.nz2 and at high\ntemperature p,nz2. z is unlikely to change dramatically\nwith temperature and n\/p is almost certainly increasing with\ntemperature. The small amount of curvature in the high-field\nHall indicates that, unlike CrO2 ,15 z is close to unity. The\nband structure of stoichiometric NiMnSb contains both holes\nand electrons,6 with holes dominating the Hall resistivity,13,14\nalthough the thermopower14 indicates a crossover to\nelectron-dominant transport. For the films studied here, a\nlikely hypothesis is that the holes result from the bulk band\nstructure and their concentration is only weakly temperature\ndependent, whereas the electron concentration seems to be\nderived partly from the band structure and partly from a ther-\nmally activated process, such as thermal excitation of donor\nstates. The off-stoichiometry in these Ni1.15Mn0.85Sb films\nwill result in a large number of atomic site defects, which are\npredicted7 to affect the band structure, and the difference\nbetween the stoichiometric bulk and the 400-nm-thick film is\nlikely to be a result of the stoichiometry. The increasingly\nelectron dominated transport as a function of thickness is not\nattributed to off-stoichiometry in our films as this did not\nchange systematically with thickness. The trend can only be\nexplained by the increasing significance of electronic surface\nor interface states, arising from either the reduced symmetry\nat the interfaces or strain induced defects. Note that unlike\nthe silver chalcogenides,18 there is no evidence of a cross-\nover of majority carrier at the MR maximum ~resistivity up-\nturn!.\nNow let us turn to RS . The anomalous Hall effect has\nhistorically been ascribed19 to a scattering anisotropy, al-\nthough there can also be an intrinsic20 ~scattering indepen-\ndent! term, which is discussed in the following. In the scat-\ntering model, it was proposed13 that RS was derived from\ncontributions from side-jump scattering and skew scattering,\nand that these terms were proportional to rxx\n2 and rxx , re-\nspectively. In bulk NiMnSb, this model accounts for the ex-\nperimental data at high temperatures, but there is a disconti-\nnuity in RS \/rxx vs rxx at around 100 K.13,14 The inset to Fig.\n3~b! shows a typical RS \/rxx vs rxx plot, from the 45 nm film\nrxx which is non-monotonic. At temperatures above and be-20130low the resistivity upturn two different straight lines are ob-\ntained. The a and b coefficients obtained from linear fitting\nof RS \/rxx vs rxx above and below the upturn for all the films\nare shown in Figs. 3~a! and 3~b!, respectively. Above the\nresistivity upturn, the coefficients are, within error, the same\nas the stoichiometric bulk values13 of a526.531024 T21\nand b521 500 T21 V21 m21, which were previously inter-\npreted as side-jumps dominating over skew scattering. How-\never, below the resistivity upturn, the magnitudes of both the\nslope and the intercept increase dramatically as the thickness\nis increased from 5 to 110 nm, driven by the temperature\ndependence of rxx . The implicit assumption in the tradi-\ntional RS \/rxx vs rxx analysis13 is that RS is only indirectly a\nfunction of temperature via its dependence on the resistivity\n~scattering!. It appears that both in the stiochiometric bulk\nmaterial, and these films, that assumption and the validity of\nthat model breaks down around 100 K. No change was ob-\nserved by room temperature in the sign of RS in any of our\nfilms. In a number of simple ferromagnets ~such as Fe, Co,\nGd! the skew-scattering and side jump terms are of opposite\nsign, but it is not known if that is the case in our material.\nIt is important to note that the anomalous Hall effect\narises from an asymmetric deflection of the carriers, resulting\nin an anomalous Hall conductivity, (sA); the anomalous Hall\nresistivity (rA) is derived from the conductivity by sA\n5rA\/(rxx2 1rxy2 )’rA\/rxx2 because rxx@rxy . Since a qua-\ndratic behavior of RS in rxx only requires a temperature in-\ndependent sA, it is not clear that any inferences can be made\nabout the scattering.\nRecently, theories describing the anomalous Hall effect\nas an intrinsic Berry3 phase effect, have given a good quan-\ntitative agreement with experiment1,2 that was never\nachieved with the scattering model. Two types of Berry\nFIG. 3. ~a! a and ~b! b coefficients obtained from the fits to\nRS \/rxx5a1brxx for all films. Because the magnetization of the\n5nm film could not be measured directly, the magnetization loop of\nthe 45 nm film was scaled by volume to obtain RS of the 5 nm film.\nBulk values taken from Otto et al. ~Ref. 13!. Inset to ~b! RS \/rxx vs\nrxx for the 45 nm film, dashed line is a guide to the eye. Solid lines\nshow fits to RS \/rxx5a1brxx in regions above and below upturn.5-3\nRAPID COMMUNICATIONS\nW. R. BRANFORD et al. PHYSICAL REVIEW B 69, 201305~R! ~2004!phase induced AHE have, thus far, been reported, one is\nrelated to spin chirality in magnetically frustrated21 systems\nand the other is associated with thermally induced topologi-\ncal defects that show an exponential temperature\ndependence1 around TC . In our films there is no feature in\nthe magnetization at the resistivity upturn temperature, and\nthis temperature is far from the Curie temperature, so the\nanomalous behavior of RS below the resistivity upturn is\ndissimilar to previously reported Berry systems. Although a\nBerry phase component cannot be ruled out, the change in\nsA at the resistivity upturn is probably due to a change in\nspin dependent scattering.\nIn summary, the room temperature electrical transport in\nnon-stoichiometric Heusler thin films becomes increasingly\nelectron dominated with decreasing thickness, in marked\ncontrast to the spin-polarized holes predicted for the bulk\n*Electronic address: w.branford@imperial.ac.uk\n1 H. Yanagihara and M. B. Salamon, Phys. Rev. Lett. 89, 187201\n~2002!.\n2 T. Jungwirth, J. Sinova, K. Y. Wang, K. W. Edmonds, R. P. Cam-\npion, B. L. Gallagher, C. T. Foxon, Q. Niu, and A. H. Mac-\nDonald, Appl. Phys. Lett. 83, 320 ~2003!.\n3 M. V. Berry, J. Mod. Opt. 34, 1401 ~1987!.\n4 F. Heusler, Verh. Dtsch. Phys. Ges. 5, 219 ~1903!.\n5 M. J. Otto, H. Feil, R. A. M. Vanwoerden, J. Wijngaard, P. J.\nVandervalk, C. F. Vanbruggen, and C. Haas, J. Magn. Magn.\nMater. 70, 33 ~1987!.\n6 R. A. de Groot, F. M. Mueller, P. G. van Engen, and K. H. J.\nBuschow, Phys. Rev. Lett. 50, 2024 ~1983!.\n7 D. Orgassa, H. Fujiwara, T. C. Schulthess, and W. H. Butler,\nPhys. Rev. B 60, 13237 ~1999!.\n8 D. Ristoiu, J. P. Nozieres, C. N. Borca, B. Borca, and P. A. Dow-\nben, Appl. Phys. Lett. 76, 2349 ~2000!.\n9 G. A. de Wijs and R. A. de Groot, Phys. Rev. B 64, 020402\n~2001!.\n10 J. Giapintzakis, C. Grigorescu, A. Klini, A. Manousaki, V. Zorba,\nJ. Androulakis, Z. Viskadourakis, and C. Fotakis, Appl. Phys.\nLett. 80, 2716 ~2002!.\n11 W. R. Branford, S. K. Clowes, M. H. Syed, Y. V. Bugoslavsky, S.\nGardelis, J. Androulakis, J. Giapintzakis, A. V. Berenov, S. B.20130stiochiometric material. The thickness dependence is likely\nto be due to the increasing significance of interface or free\nsurface electronic states, and indicates that controlled inter-\nfacial engineering will be required for the use of NiMnSb as\na spin injector. The anomalous Hall conductivity cannot be\ninterpreted within the traditional scattering model at low\ntemperatures, because of an additional contribution that\ncomes into play, which is attributed to a change in the spin-\ndependent scattering. Unlike the silver chalcogenides, there\nappears to be no correlation between the large positive MR\nfound in these films17 and the sign reversal in the ordinary\nHall coefficient.\nWe acknowledge the E.U. programme G5RD-CT-2001\nand the EPSRC GR\/S14061 and EPSRC GR\/R98945 for\nfunding.\nRoy, and L. F. Cohen, Appl. Phys. Lett. ~in press!.\n12 W. R. Branford, S. B. Roy, S. K. Clowes, Y. Miyoshi, Y. V. Bugo-\nslavsky, S. Gardelis, J. Giapintzakis, and L. F. Cohen, J. Magn.\nMagn. Mater. ~in press!.\n13 M. J. Otto, R. A. M. Vanwoerden, P. J. Vandervalk, J. Wijngaard,\nC. F. Vanbruggen, and C. Haas, J. Phys.: Condens. Matter 1,\n2351 ~1989!.\n14 C. Hordequin, D. Ristoiu, L. Ranno, and J. Pierre, Eur. Phys. J. B\n16, 287 ~2000!.\n15 S. M. Watts, S. Wirth, S. von Molnar, A. Barry, and J. M. D.\nCoey, Phys. Rev. B 61, 9621 ~2000!.\n16 R. G. Chambers, Proc. Phys. Soc., London, Sect. A 65, 903\n~1952!.\n17 W. R. Branford, S. K. Clowes, M. H. Syed, Y. V. Bugoslavsky, S.\nGardelis, J. Androulakis, J. Giapintzakis, A. V. Berenov, S. B.\nRoy, and L. F. Cohen ~unpublished!.\n18 M. Lee, T. F. Rosenbaum, M. L. Saboungi, and H. S. Schnyders,\nPhys. Rev. Lett. 88, 066602 ~2002!.\n19 L. Berger and G. Bergmann, in The Hall Effect and its Applica-\ntions, edited by C. L. Chien and C. R. Westgate ~Plenum, New\nYork, 1979!.\n20 J. M. Luttinger, Phys. Rev. 112, 739 ~1958!.\n21 Y. Taguchi, Y. Oohara, H. Yoshizawa, N. Nagaosa, and Y. Tokura,\nScience 291, 2573 ~2001!.5-4\n"}