{"doi":"10.1016\/S0016-7037(01)00777-3","coreId":"71712","oai":"oai:eprints.lancs.ac.uk:484","identifiers":["oai:eprints.lancs.ac.uk:484","10.1016\/S0016-7037(01)00777-3"],"title":"Laboratory measurements and modeling of metal-humic interactions under estuarine conditions.","authors":["Hamilton-Taylor, J.","Postill, A. S.","Tipping, E.","Harper, M. P."],"enrichments":{"references":[{"id":16458797,"title":"A comparative study of proton and alkaline earth metal binding by humic substances.","authors":[],"date":"1994","doi":"10.1016\/0003-2670(94)80316-1","raw":"Lead J. R., Hamilton-Taylor J., Hesketh N., Jones M. N., Wilkinson A. E., and Tipping  20 E. (1994) A comparative study of proton and alkaline earth metal binding by humic substances. Anal. Chim. Acta 294, 319-327.","cites":null},{"id":16458809,"title":"Americium binding to humic acid.","authors":[],"date":"2001","doi":"10.1021\/es000295g","raw":"Peters A. J., Hamilton-Taylor J., and Tipping E. (2001) Americium binding to humic acid. Environ. Sci. Technol. (submitted).","cites":null},{"id":16458803,"title":"An Introduction to Marine Biogeochemistry.","authors":[],"date":"1992","doi":"10.1021\/ed069pa251.2","raw":"Libes S. M. (1992) An Introduction to Marine Biogeochemistry. Wiley.  25 Lin C. F., Houng L. M., Lo K. S., and Lee D. Y. (1994) Kinetics of copper complexation with dissolved organic matter using stopped-flow fluorescence technique. Toxicol. Environ. Chem. 43(1-2), 1-12.","cites":null},{"id":16458790,"title":"by humic substances in groundwaters.","authors":[],"date":"1993","doi":"10.1016\/b978-1-85861-038-2.50005-x","raw":"Higgo J. J. W., D. K., B. S., and E. T. (1993) Complexation of Co 2+, Ni 2+, UO2 2+ and  15 Ca 2+ by humic substances in groundwaters. Radiochim. Acta 61, 91-103.","cites":null},{"id":16458782,"title":"Cu(II) binding 10 by a pH-fractionated fulvic acid. Analytica chimica acta 402(1-2),","authors":[],"date":"1999","doi":"10.1016\/s0003-2670(99)00521-8","raw":"Brown G. K., Cabaniss S. E., Maccarthy P., and Leenheer J. A. (1999) Cu(II) binding  10 by a pH-fractionated fulvic acid. Analytica chimica acta 402(1-2), 183-193.","cites":null},{"id":16458814,"title":"Determination of molecular weights of humic substances by analytical (UV scanning) ultracentrifugation.","authors":[],"date":"1990","doi":"10.1016\/0016-7037(90)90201-u","raw":"Reid P. M., Wilkinson A. E., Tipping E., and Jones M. N. (1990) Determination of molecular weights of humic substances by analytical (UV scanning) ultracentrifugation. Geochimica et Cosmochimica Acta 54, 131-138.  10 Stumm W. and Morgan J. J. (1996) Aquatic Chemistry. Wiley.","cites":null},{"id":16458805,"title":"Effect of kinetic of complexation by humic acid on the toxicity of copper to Ceriodaphnia dubia. 30 Environ.","authors":[],"date":"1999","doi":"10.1897\/1551-5028(1999)018<0828:eokocb>2.3.co;2","raw":"Ma H., Kim S. D., Cha D. K., and Allen H. E. (1999) Effect of kinetic  of complexation by humic acid on the toxicity of copper to Ceriodaphnia dubia.  30 Environ. Toxicol. Chem. 18, 828-837.","cites":null},{"id":16458800,"title":"Europium binding by fulvic acids.","authors":[],"date":"1998","doi":"10.1016\/s0003-2670(98)00230-x","raw":"Lead J. R., Hamilton-Taylor J., Peters A., Reiner S., and Tipping E. (1998) Europium binding by fulvic acids. Anal. Chim. Acta 369, 171-180.","cites":null},{"id":16458794,"title":"High speed computers as a supplement to graphical methods, V HALTAFALL, a general program for calculating the composition of equilibrium mixtures.","authors":[],"date":"1967","doi":"10.1016\/0039-9140(67)80203-0","raw":"Ingri N., Kakolowicz W., Sillén L. G., and Warnqvist B. (1967) High speed computers as a supplement to graphical methods, V HALTAFALL, a general program for calculating the composition of equilibrium mixtures. Talanta 12, 1261-1286.","cites":null},{"id":16458823,"title":"Humic ion-binding Model VI: an improved description of the interactions of protons and metal ions with humic substances.","authors":[],"date":"1998","doi":null,"raw":"Tipping E. (1998) Humic ion-binding Model VI: an improved description of the interactions of protons and metal ions with humic substances. Aquat. Geochem. 4, 3-48.  20 Tipping E. and Hurley M. A. (1992) A unifying model of cation binding by humic substances. Geochim. Cosmochim. Acta 56, 3627-3641.","cites":null},{"id":16458811,"title":"Lead and calcium binding to 5 fulvic acids: Salt effect and competition.","authors":[],"date":"1999","doi":"10.1021\/es990210f","raw":"Pinheiro J. P., Mota A. M., and Benedetti M. F. (1999) Lead and calcium binding to  5 fulvic acids: Salt effect and competition. Environmental Science & Technology 33, 3398-3404.","cites":null},{"id":16458788,"title":"Marine Geochemistry. Unwin Hyman.","authors":[],"date":"1990","doi":"10.1007\/978-94-010-9488-7","raw":"Chester R. (1990) Marine Geochemistry. Unwin Hyman.","cites":null},{"id":16458778,"title":"Measurement of electrostatic and site-specific associations of alkali metal cations with humic acid.","authors":[],"date":"1993","doi":"10.1111\/j.1365-2389.1993.tb00456.x","raw":"Bonn B. A. and Fish W. (1993) Measurement of electrostatic and site-specific associations of alkali metal cations with humic acid. J. Soil Sci. 44, 335-345.","cites":null},{"id":16458775,"title":"Metal-ion binding to humic substances - Application of the nonideal competitive adsorption model.","authors":[],"date":"1995","doi":"10.1021\/es00002a022","raw":"Benedetti M. F., Milne C. J., Kinniburgh D. G., Van Riemsdijk W. H., and Koopal L.  5 K. (1995) Metal-ion binding to humic substances - Application of the nonideal competitive adsorption model. Environ. Sci.  Technol. 29(2), 446-457.","cites":null},{"id":16458819,"title":"Modelling ion binding by humic acids.","authors":[],"date":"1993","doi":"10.1016\/b978-1-85861-038-2.50012-7","raw":"Tipping E. (1993) Modelling ion binding by humic acids. Colloids and Surfaces A: Physicochem. Engineer. Aspects 73, 117-131.","cites":null},{"id":16458825,"title":"Modelling the chemical speciation of trace metals in the surface waters of the Humber system.","authors":[],"date":"1998","doi":"10.1016\/s0048-9697(98)00045-x","raw":"Tipping E., Lofts S., and Lawlor A. J. (1998) Modelling the chemical speciation of trace metals in the surface waters of the Humber system. Science Of the Total Environment 210\/211(1-6), 63-77.  25 Town R. M. and Filella M. (2000) Dispelling the myths: Is the existence of L1 and L2 ligands necessary to explain metal ion speciation in natural waters? Limnol. Oceanogr. 45, 1341-1357.   25","cites":null},{"id":16458770,"title":"Oligoelectrolyte Model For Cation Binding By Humic Substances.","authors":[],"date":"1992","doi":"10.1021\/es00026a007","raw":"Bartschat B. M., Cabaniss S. E., and Morel F. M. M. (1992) Oligoelectrolyte Model For Cation Binding By Humic Substances. Environmental Science & Technology 26(2), 284-294.","cites":null},{"id":16458817,"title":"Physical Chemistry of Macromolecules.","authors":[],"date":"1961","doi":"10.1002\/star.19620141214","raw":"Tanford C. (1961) Physical Chemistry of Macromolecules. Wiley.","cites":null},{"id":16458784,"title":"Testing models of chemical speciation in freshwaters.","authors":[],"date":"2001","doi":null,"raw":"Bryan S. E. (2001) Testing models of chemical speciation in freshwaters. Ph.D., Lancaster.","cites":null},{"id":16458807,"title":"The complexation of metals with humic materials in natural waters.","authors":[],"date":"1978","doi":"10.1016\/0302-3524(78)90130-5","raw":"Mantoura R. F. C., Dickson A., and Riley J. P. (1978) The complexation of metals with humic materials in natural waters. Est. Coastal Mar. Sci. 6, 387-408.   24 Martell A. E. and Hancock R. D. (1996) Metal Complexes in Aqueous Solutions. Plenum Press.","cites":null},{"id":16458821,"title":"WHAM- a chemical equilibrium model and computer code for 15 waters, sediments, and soils incorporating a discrete site\/electrostatic model of ion binding by humic-substances.","authors":[],"date":"1994","doi":"10.1016\/0098-3004(94)90038-8","raw":"Tipping E. (1994) WHAM- a chemical equilibrium model and computer code for  15 waters, sediments, and soils incorporating a discrete site\/electrostatic model of ion binding by humic-substances. Computers and Geosciences 20(6), 973-1023.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2002-02-01","abstract":"Equilibrium dialysis was used to measure Co- and Cu-binding by an isolated peat humic acid (PHA) in controlled laboratory experiments under simulated estuarine conditions: ionic strengths of 0.005-0.7 M in NaCl and mixed Na-Mg-Ca chloride solutions, with trace metal concentrations of ~5x10-7 M, a PHA concentration of 10 mg\/l, and at constant pH values of ~7.8 (Co and Cu) and ~4.6 (Cu only). Generally, Co- and Cu-humic binding decreased substantially with increasing ionic strength and, in the case of Cu, with decreasing pH. The presence of seawater concentrations of Ca and Mg had a relatively small effect on Co-humic binding and no measurable effect on that of Cu under the experimental conditions. The binding data were well-described by an equilibrium speciation code (WHAM) after optimising the fits by varying the metal-proton exchange constants for humic acid within justifiable limits (i.e. within 1 standard deviation of the mean exchange constants used in the WHAM database). The main factor producing the observed variations in metal-humic binding at constant pH was the electrostatic effect on the humic molecule. WHAM was used to predict Co- and Cu-humic binding in simulations of real estuaries. Co-humic binding is predicted to be relatively unimportant (generally <5% of total Co), whereas the Cu-humic complex is likely to be the dominant species throughout an estuary. The main factors producing changes in Co- and Cuhumic binding in the real-estuary simulations are the electrostatic effect on the humic molecule, ligand competition (mainly from carbonate species) for metals and to a lesser extent Ca and Mg competition for humic binding sites. Variations in pH are significant only at the freshwater end of an estuary. WHAM simulations also indicated that competition effects between metals are more likely to occur in freshwaters, than in seawater, due to enhanced electrostatic binding at low ionic strength","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71712.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/484\/2\/GCA_66_403%2D415.pdf","pdfHashValue":"2b111858bc11c2bb992408c1ac3fdedb6fe58770","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:484<\/identifier><datestamp>\n      2018-01-24T03:13:15Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:514B<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Laboratory measurements and modeling of metal-humic interactions under estuarine conditions.<\/dc:title><dc:creator>\n        Hamilton-Taylor, J.<\/dc:creator><dc:creator>\n        Postill, A. S.<\/dc:creator><dc:creator>\n        Tipping, E.<\/dc:creator><dc:creator>\n        Harper, M. P.<\/dc:creator><dc:subject>\n        QK Botany<\/dc:subject><dc:description>\n        Equilibrium dialysis was used to measure Co- and Cu-binding by an isolated peat humic acid (PHA) in controlled laboratory experiments under simulated estuarine conditions: ionic strengths of 0.005-0.7 M in NaCl and mixed Na-Mg-Ca chloride solutions, with trace metal concentrations of ~5x10-7 M, a PHA concentration of 10 mg\/l, and at constant pH values of ~7.8 (Co and Cu) and ~4.6 (Cu only). Generally, Co- and Cu-humic binding decreased substantially with increasing ionic strength and, in the case of Cu, with decreasing pH. The presence of seawater concentrations of Ca and Mg had a relatively small effect on Co-humic binding and no measurable effect on that of Cu under the experimental conditions. The binding data were well-described by an equilibrium speciation code (WHAM) after optimising the fits by varying the metal-proton exchange constants for humic acid within justifiable limits (i.e. within 1 standard deviation of the mean exchange constants used in the WHAM database). The main factor producing the observed variations in metal-humic binding at constant pH was the electrostatic effect on the humic molecule. WHAM was used to predict Co- and Cu-humic binding in simulations of real estuaries. Co-humic binding is predicted to be relatively unimportant (generally <5% of total Co), whereas the Cu-humic complex is likely to be the dominant species throughout an estuary. The main factors producing changes in Co- and Cuhumic binding in the real-estuary simulations are the electrostatic effect on the humic molecule, ligand competition (mainly from carbonate species) for metals and to a lesser extent Ca and Mg competition for humic binding sites. Variations in pH are significant only at the freshwater end of an estuary. WHAM simulations also indicated that competition effects between metals are more likely to occur in freshwaters, than in seawater, due to enhanced electrostatic binding at low ionic strength.<\/dc:description><dc:date>\n        2002-02-01<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/484\/2\/GCA_66_403%2D415.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/S0016-7037(01)00777-3<\/dc:relation><dc:identifier>\n        Hamilton-Taylor, J. and Postill, A. S. and Tipping, E. and Harper, M. P. (2002) Laboratory measurements and modeling of metal-humic interactions under estuarine conditions. Geochimica et Cosmochimica Acta, 66 (3). pp. 403-415. ISSN 0016-7037<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/484\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1016\/S0016-7037(01)00777-3","http:\/\/eprints.lancs.ac.uk\/484\/"],"year":2002,"topics":["QK Botany"],"subject":["Journal Article","PeerReviewed"],"fullText":" Hamilton-Taylor, J.*, A.S. Postill, E. Tipping# and M.P. Harper. \n \nLaboratory measurements and modelling of metal-humic interactions under estuarine \nconditions 5 \n \nInstitute of Environmental and Natural Sciences, Lancaster University, Lancaster, LA1 \n4YQ, U.K. Tel: (01524) 593893. Fax: (01524) 593985. Email: J.Hamilton-\nTaylor@lancaster.ac.uk \n 10 \n#Centre for Ecology and Hydrology Windermere, Ambleside, Cumbria, LA22 0LP, \nUK. \n \n*Author for correspondence \n 15 \n \nRevised ms., May 2001. \n \n 2\nAbstract \n \nEquilibrium dialysis was used to measure Co- and Cu-binding by an isolated peat humic acid \n(PHA) in controlled laboratory experiments under simulated estuarine conditions: ionic \nstrengths of 0.005-0.7 M in NaCl and mixed Na-Mg-Ca chloride solutions, with trace metal 5 \nconcentrations of ~5x10-7 M, a PHA concentration of 10 mg\/l, and at constant pH values of \n~7.8 (Co and Cu) and ~4.6 (Cu only). Generally, Co- and Cu-humic binding decreased \nsubstantially with increasing ionic strength and, in the case of Cu, with decreasing pH.  The \npresence of seawater concentrations of Ca and Mg had a relatively small effect on Co-humic \nbinding and no measurable effect on that of Cu under the experimental conditions.  The 10 \nbinding data were well-described by an equilibrium speciation code (WHAM) after optimising \nthe fits by varying the metal-proton exchange constants for humic acid within justifiable limits \n(i.e. within 1 standard deviation of the mean exchange constants used in the WHAM database). \nThe main factor producing the observed variations in metal-humic binding at constant pH was \nthe electrostatic effect on the humic molecule.  WHAM was used to predict Co- and Cu-humic 15 \nbinding in simulations of real estuaries.  Co-humic binding is predicted to be relatively \nunimportant (generally <5% of total Co), whereas the Cu-humic complex is likely to be the \ndominant species throughout an estuary.  The main factors producing changes in Co- and Cu-\nhumic binding in the real-estuary simulations are the electrostatic effect on the humic molecule, \nligand competition (mainly from carbonate species)  for metals and to a lesser extent Ca and 20 \nMg competition for humic binding sites.  Variations in pH are significant only at the freshwater \nend of an estuary.  WHAM simulations also indicated that competition effects between metals \nare more likely to occur in freshwaters, than in seawater, due to enhanced electrostatic binding \nat low ionic strength. \n25 \n 3\n1.  INTRODUCTION \n \nHumic substances are present in most surface and ground waters and are important \nwith respect to the chemical speciation, mobility and bioavailability of trace metals.  \nSubstantial advances have been made in recent years in modelling metal-humic 5 \ninteractions so that a number of models now exist that are capable of predicting metal-\nhumic binding under a range of solution conditions, e.g. Humic Ion-Binding Models V \n(Tipping and Hurley, 1992) and VI (Tipping, 1998), and the NICA-Donnan Model \n(Benedetti et al., 1995). There are considerable published experimental data on proton \nbinding at various ionic strengths with which to calibrate the proton dissociation and 10 \nelectrostatic components of these models (Tipping and Hurley, 1992).  There are also \nsufficient metal-humic binding data with which to undertake an initial calibration of \nthe metal-proton exchange reactions (Tipping and Hurley, 1992).  However, there are \nlittle or no experimental data on metal-humic binding, directly involving both \nvariations in ionic strength and concentrations of competing major cations, suitable for 15 \nvalidating the models under estuarine conditions.  Estuaries are ideal for testing \nspeciation schemes, such as Model V, because the factors that most affect metal-humic \ninteractions exhibit a wide range of parameter values therein, with the possible \nexception of pH.  The most important are likely to be competition effects from Ca and \nMg, the effect of ionic strength (I) on electrostatic interactions between metals and 20 \nhumics, and the indirect effect of ligand competition from the major inorganic anions.  \n \nMetal-humic interaction in estuaries is a topic of considerable interest, linked \nparticularly to questions concerning the fate of pollutants and of river-borne weathering \nproducts. Current ideas concerning metal-humic interactions in estuaries, described in 25 \nstandard oceanographic texts (Chester, 1990; Libes, 1992), originate mainly from the \nstudy of Mantoura et al. (1978).  Most importantly, competition from Ca and Mg is \nthought to be the main controlling effect, resulting in decreased humic-binding of trace \nmetals under more saline conditions.  Ca and Mg were predicted to occupy >99% of \nthe humic binding sites under seawater conditions and, as a result, the complexation of 30 \nCu, for example, was predicted to fall from >90% to ~10% going from freshwater to \nseawater (Mantoura et al., 1978).  More recent predictions using Model V (Tipping et \nal., 1998) have suggested that Ca and Mg competition effects are less important in \n 4\nestuaries than previously thought.  Additionally, recent laboratory experiments have \ndemonstrated the potential importance of ionic strength (i.e. the electrostatic effect) on \nmetal binding by humic substances (Brown et al., 1999; Pinheiro et al., 1999).  The \ninitial aims of the present work therefore were (i) to determine experimentally the \neffects of ionic strength and Ca and Mg competition on the humic complexation of 5 \nstrongly (Cu) and weakly (Co) binding metals under simulated estuarine conditions, \nand (ii) to use the data to test Humic Ion-Binding Model V.  Following successful \ntesting, the model was then used to predict humic binding of Cu and Co in simulations \nof real estuaries with contrasting freshwater pH values (5.1 and 7.8) and to explore the \nrole of Ca and Mg competition more generally in natural waters. 10 \n \n2.  HUMIC ION-BINDING MODEL V, WHAM, AND BINDING UNITS \n \nIn this work, the speciation of dissolved metals is computed with the Windermere Humic \nAqueous Model, WHAM (Tipping, 1994).  This model takes into account the interactions 15 \nof metals with (i) inorganic ligands (OH-, HCO3-, CO32-, SO42-, Cl-), using conventional \nequilibrium formulations and equilibrium constants from the literature, and (ii) humic \nsubstances using Humic Ion-Binding Model V (Tipping and Hurley, 1992).  The essential \nfeatures of Model V are as follows.  Humic compounds are represented by hypothetical \nsize-homogeneous molecules, which carry proton-dissociating groups that can bind metal 20 \nions.  The interactions are described in terms of intrinsic equilibrium constants, which \nrefer to the (usually hypothetical) situation where the humic substances have zero \nelectrical charge, and an electrostatic term, which takes into account the influence on \nbinding of the variable humic charge.  Two types of proton-binding groups are \nrecognised, one (type A) being relatively acid (mainly carboxyl groups) and the other 25 \n(type B) less acid (e.g. phenolic groups).  Each type is heterogeneous, comprising four \nsites with equally spaced pK (-log10 K)  values that are defined by two adjustable \nparameters (median and spread values obtained by fitting).  Metal binding takes place at \nsingle proton-binding sites (monodentate) and at bidentate sites formed by pairs of \nproton-dissociating sites.  The model permits the binding of the first hydrolysis product 30 \n(e.g. CuOH+ in the case of Cu2+) as well as the parent species.  The binding is \ncharacterised by intrinsic equilibrium constants (KMHA and KMHB) for metal-proton \nexchange reactions of the type: \n 5\n RHZ + Mz+ = RMZ+z-1 + H+       (1) \nwhere R is the humic molecule, Z is the charge on the humic molecule (eq g-1) and z is \nthe charge on the metal ion (M).  A representative equilibrium constant expression, \ntogether with its appropriate electrostatic correction, is given by: \n \n[ ]\n[ ]\nR a\nR a\nK eMHA\nw\nM\nH\nZ+z-1\nH\nZ\nM\nZ z+\nz +\n=\n− −2 1( )\n      (2) 5 \nwhere [ ] = concentrations and a = activities (both in mol l-1) in the bulk solution, w is the \nelectrostatic interaction factor, given by: \n w P I= log10          (3) \nwhere P is an empirical proportionality constant, included in the WHAM database, and \nI is the ionic strength.  The default value of P was estimated by fitting literature data of 10 \nproton binding undertaken at variable I (Tipping, 1994).  The exponential (electrostatic) \nterm in Eq. 2 arises from the theoretical treatment of electrostatic effects given by \nTanford (1961), derived by applying the Debye-Hückel model to macromolecules. \n \nDuring the early stages of calibrating Model V it was found that values of pKMHB vary 15 \nlinearly with pKMHA, so that it is possible to characterise metal binding with a single \nparameter, -log10 KMHA or pKMHA (Tipping, 1994).  The strength of metal-humic binding \ntherefore increases with decreasing values of pKMHA.  The linear relationship is consistent \nwith observations for the metal complexes of simple carboxylic and phenolic ligands, as \nshown by Martell and Hancock (1996).  The WHAM database contains default values of 20 \npKMHA for 31 metals, estimated from literature data or by linear free-energy correlations.  \nThe (non-specific) accumulation of an excess of counterions in the diffuse layer adjacent \nto the molecular surface also contributes to the total binding. \n \nWHAM was originally designed for freshwaters and soils, and calculates activity 25 \ncoefficients for ions with the extended Debye-Hückel equation, which is applicable only \nup to an ionic strength of about 0.1 M.  For this study, WHAM was modified to allow the \nuse of the Davies equation, which is valid up to an ionic strength of around 0.5 M \n(Stumm and Morgan, 1996).  The use of the Davies equation will therefore result in some \nerrors in the prediction of metal speciation in full-strength seawater, although the 30 \nsignificance of these errors will be minor in the context of the observed and predicted \n 6\nionic strength trends.  Within WHAM, Model V was used as the humic sub-model in \npreference to Model VI (Tipping, 1998) because of current uncertainties of how best to \ndeal with the competitive effects of Fe(III) and other strong binding metals, present at \nunknown concentrations (Bryan, 2001; Peters et al., 2001).  Model VI (Tipping, 1998) \nwas developed from Model V to provide a better description of published binding data 5 \nobtained at low [metal]:[humic] ratios.  Model VI differs from Model V in having an \nextended range of binding site strengths at low pKMHA values, resulting in a relatively \nsmall number of particularly strong binding sites.  The significance of this choice of \nmodel to the interpretation of our results is considered in Section 5.4. \n 10 \nMetal-humic binding is expressed as %-metal bound and as νM, the total amount of \nmetal specifically bound to the humic molecule (mol g-1). The term νM is comparable \nto[ ]RM Z+z-1  in Equation 2 divided by the concentration of humic substances (g l-1), but \nit relates to the total amount bound by all the heterogeneous monodentate and bidentate \nsites.  Methods used for characterising metal binding commonly have a limited 15 \nanalytical window (Town and Filella, 2000).  The dialysis method employed in the \npresent study cannot generally be used much outside the range 10-90% humic-bound \nbecause of problems associated with quantifying whichever is the smaller, the humic-\nbound fraction or the non-bound fraction (Lead et al., 1998).  Consequently, it was \nnecessary to obtain a spread of binding values within this range in order to provide a 20 \nreliable test of WHAM.  In the case of Cu, this required a series of binding experiments \nat a relatively low pH (~4.5) (see  Section 3).  It follows from the law of mass action \n(see Equation 2) that the percentage bound between 10 and 90% will be highly \nsensitive to pH and the pKMHA, so that humic binding within this range also provides a \nrigorous test of the model.  Illustrative WHAM simulations, at total metal 25 \nconcentrations of 10-6 M and a humic acid concentration of 10 mg\/l in 0.01 M NaCl, \nindicate that the range 10-90% humic-bound can be brought about by changes in pH of \n1.0 (pH 3.6 to 4.6) for Cu and 1.4 (pH 5.2 to 6.6) for Co, or changes in pKMHA of 0.6 \n(pKMHA 1.25 to 1.85) for Cu and 1.1 (pKMHA 2.2 to 3.3) for Co.  The variable pH \nsimulations were undertaken using the default pKMHA values for humic acid (1.5 for Cu 30 \nand 2.7 for Co).  The variable pKMHA simulations used the pH values (4.1 for Cu and 6.0 \nfor Co) at which 50% of each metal is humic bound with the default pKMHA values. \n 7\n \n3.  METHODS \n \n3.1.  Collection and Isolation of Humic Sample \n 5 \nApproximately 1 kg of moorland peat was collected from Whitray Fell, North \nYorkshire (Lat. 54°5' N, Long. 2°30' W), at the same location as used in a previous \nstudy (Lead et al., 1994).  A humic acid fraction (PHA) was extracted as described by \nReid et al. (1990).  Briefly, the peat was wet sieved (4 mm mesh) and then treated with \nnitrogen-saturated NaOH (0.1 M Na in final solution). After centrifuging and 10 \ndiscarding the residue, the supernatant  was acidified to pH 2 using concentrated HCl.  \nThe resulting suspension was left for 2 days in the dark to allow complete precipitation \nof humic acid and then the suspension was recentrifuged and the supernatant discarded.  \nThe resulting PHA sample was subjected to successive treatments in nitrogen-saturated \n1 M KOH, HCl (pH 2) and a 0.3 M HF- 0.1 M HCl mixture in order to remove bound 15 \nmetals and dissolve, as far as possible, any residual mineral content. Finally the humic \nacid residue was dialysed (Visking tubing) against Milli-Q water until chloride was \nundetectable, and then freeze-dried.  Prior to the experiments, 1 g\/l stock solutions of \nPHA were prepared in Milli-Q water and stored in the dark at 4°C.   \n 20 \n3.2.  Experimental Protocol \n \nMetal-humic binding was determined by equilibrium dialysis, following a similar \napproach to that described by Lead et al. (1998).  The experiments were carried out in 1 \nl HDPE screw top bottles, using Spectra\/Por cellulose ester dialysis tubing (2000 25 \nMWCO) that had been thoroughly prewashed in Milli-Q water.     Preliminary \nexperiments were carried out in order to determine equilibration times (~24 h) for Cu \nand Co through the membranes, under the solution conditions used in the main \nexperiments. \n 30 \nTwo simple analogue solutions of estuarine systems were prepared using AnalaR \nreagents, one containing NaCl only and the other containing NaCl, MgCl2 and CaCl2 in \ntheir sea water ratios (i.e. Na:Mg:Ca molar ratios of 45.6:5.4:1).  Cu and Co binding \n 8\nwere studied independently in each medium at five different ionic strengths: 5 mM, 50 \nmM, 0.15 M, 0.35 M and 0.7 M.  The solutions were spiked with Perkin Elmer acidic \nmetal standards to give final concentrations of 4.7 x 10-7 M Cu and 5.1 x 10-7 M Co.  \nAnalar NaOH (0.1 M) and HNO3 (10% by vol.) were added as required to adjust the \npH of the solutions.  Experiments were undertaken at a single narrow pH range (~7.7-5 \n8.0) in the case of Co and at two narrow pH ranges (~4.4-4.7, 7.7-8.1) in the case of \nCu.  The high pH solutions were equilibrated with atmospheric CO2 by bubbling with \nwater-saturated air for 24 h.  PHA was added from the 1 g\/l stocks to give a final humic \nconcentration of 10 mg\/l.  A length (~20 cm) of dialysis tubing  was filled with the \nrelevant trace-metal free, ionic medium, then sealed and inserted into each 10 \nexperimental solution.  Experiments were allowed to reach dialysis equilibrium over 4 \ndays with continuous stirring. Each batch of experiments was run with a control, \ncontaining no PHA, to confirm that dialysis equilibrium was achieved for both Co and \nCu.  Typically, three to five replicate binding experiments were run under each set of \nconditions (see Table 1). 15 \n \nAfter 4 days, the experiments were terminated and samples taken from the bulk \nsolution and from inside the dialysis tubing.  Metal complexation reactions with humic \nsubstances are generally regarded as being fast (minutes) (Lin et al., 1994), although \ncomplete equilibration may take in the order of 24 h (Ma et al., 1999).  Therefore 20 \nchemical equilibrium, as well as dialysis equilibrium, would be expected.  The samples \nfor trace metal analysis were then acidified to pH 2 with 10 % HNO3.  A separate \nsample from inside the tubing was checked for leakage of PHA in every experiment by \nmeasuring the absorbance at 340 nm after mixing with an equal volume of pH 7 buffer.  \nSubsequent calculations of metal binding were corrected for any leakage, assuming that 25 \nthe leaked PHA had the same binding affinity as the bulk PHA.  The estimated leakage \neffects, equivalent to mean and median absolute errors of 1.8% and 0.5% in the \ncalculated percentage bound, were generally less than the experimental uncertainties \n(see error bars in Fig. 1).  The final pH of the bulk solution was also measured.  Trace \nmetal analysis was carried out by GFAAS using a matrix modifier in the more saline 30 \nsolutions and matrix matched standards. The modifier consisted of a 550 ppm solution \nof palladium nitrate in 1% hydroxyammonium chloride and 1% nitric acid (A. Tappin, \npers. comm.). \n 9\n \n4.  RESULTS AND WHAM PREDICTIONS \n \nIn the NaCl medium at a pH of ~7.8, Co-humic binding decreased markedly with \nincreasing ionic strength (Fig.1a),  whereas Cu remained predominantly bound to PHA 5 \nat all ionic strengths (Fig. 1c). The presence of Ca and Mg decreased Co binding still \nfurther (Fig. 1b), while no significant change in Cu binding was apparent in the mixed \nsalt medium at high pH (Fig. 1d).  At low pH, in contrast, Cu exhibited a marked \ndecrease in binding with increasing ionic strength (Fig. 1e), but the effect of Ca and Mg \nwas again small if not negligible (Fig. 1f). 10 \n \nWHAM simulations were run for each set of experimental conditions, including the \nmean measured pH values (Table 1), with the Model V parameters initially set to their \ndefault values for humic acid.  Given that binding is highly sensitive to pH and pKMHA \nwithin the range 10-90% bound (see Section 2), these blind predictions were good in 15 \nthe sense that the general scale of  binding and the relative effects of variable I and \nvariable Ca, Mg concentrations were reproduced in all cases (Figs. 1a-f). \n \nWith the assumption of a fixed relationship between pKMHA and pKMHB, the former is \nthe only parameter in Model V that directly affects metal binding.  The default values 20 \nof all the other Model V parameters, including the electrostatic parameter P in \nEquation 3, were obtained independently by fitting the large number of published data \nsets on proton binding by humic and fulvic acids (e.g. see Tipping and Hurley, 1992). \nTherefore the default predictions shown in Fig. 1 can only justifiably be improved on \nthe basis of optimising the pKMHA values.  The strategy adopted was to minimise the 25 \nsum of the squared errors in percentage metal bound by optimising the pKMHA values \nfor Cu and Co, leaving the Ca and Mg values at their default settings.  In the case of \nCu, the minimisation routine was applied simultaneously to the low pH data for both \nionic media with excellent results (Figs. 1e and 1f).  Cu-humic binding at high pH \n(Figs. 1c and 1d) was predicted using the optimised pKMHA value but was not used in 30 \nthe fitting because all the data points fell outside the effective analytical window of the \ndialysis method (10-90% binding).  In the case of Co, two approaches were adopted. \nThe first involved simultaneously fitting the data for both ionic media, as with Cu, \n 10\nwhile the second involved fitting the data for the NaCl medium alone (Fig. 1a) \nfollowed by the prediction of binding in the mixed salt solution (Fig. 1b).  Both \napproaches gave better fits than that based on the default values, but neither was as \ngood as that for Cu.  Table 2 shows that the optimised pKMHA values of 1.61 for Cu \n(both media), and 2.55 (both media) and 2.45 (NaCl) for Co are all well within a single 5 \nstandard deviation of the WHAM default values for humic acid, based on the published \ndata used to derive them (Higgo et al., 1993; Tipping, 1993). \n \n5.  DISCUSSION \n 10 \n5.1.  Ionic Strength Dependence of Metal-Humic Binding in NaCl Solution \n \nGiven the success of WHAM in predicting the experimental data, using acceptable \npKMHA values, and given that the model is based on established chemical principles, \nWHAM can justifiably be used to explore the nature of the observed humic binding-15 \nionic strength relationships.  The fact that Cu remained predominantly bound to PHA at \nall ionic strengths at pH ~7.8 in NaCl solution (Fig. 1c) suggests that Cu-humic binding \nis insensitive to I under these conditions, compared with the binding observed in the \nother two series of experiments undertaken in NaCl solutions (Figs. 1a and 1e).  \nExamination of the WHAM output data, however, shows that this conclusion is 20 \npotentially misleading.  Tables 3-5 show selected output from the various WHAM \ncalculations for the binding experiments in NaCl solutions, including νM\/ aM2+ values. \nThe WHAM output also indicated that diffuse layer binding of Cu and Co was \nnegligible in all experiments, so that νM ≈ total bound metal.  The relative values of \nνCu\/ aCu2+  shown in Tables 3-5 indicate that Cu-humic binding in NaCl at high pH is 25 \njust as sensitive to I as humic binding in the other two series of experiments in NaCl  \nsolution (Cu at low pH and Co at high pH).  In fact, using νCu\/ aCu2+  as the measure of \nbinding indicates that it is Cu-humic binding at low pH that is the least sensitive to I \n(Table 5).  The fact that such a large change in νCu\/ aCu2+ could not be confirmed by the \nexperimental measurements is attributable to the overall strength of Cu-humic binding 30 \nat circum-neutral pH, resulting in the percentage binding being >90% in all cases and \ntherefore outside the analytical window.  It was only at low pH, where Cu-humic \n 11\nbinding is much weaker, that a much smaller change in the νCu\/ aCu2+ ratio was reflected \nin a measurable change within the range 10-90 % bound. \n \nThe factors causing the observed dependence of metal-humic binding on I in NaCl \nsolution potentially include competition for humic binding sites from Na+, changes in 5 \nfree metal ion activities due to chloride and carbonate complexation, an electrostatic \neffect on the humic molecule (see Equations 2 and 3), and a decrease in the activity \ncoefficient of the free metal ions with increasing I.  Monovalent metals like Na+ have \nfar less affinity for humic functional groups than polyvalent metals (Bonn and Fish, \n1993), and it is for this reason that, in Model V, monovalent metals are assumed to 10 \nbind only nonspecifically as counterions in the diffuse layer (Tipping and Hurley, \n1992).  The success of the model in predicting the observed binding behaviour of Cu \nand Co is consistent with the lack of any substantial specific Na+ binding. \n \nTotal carbonate and bicarbonate species were predicted to be present at maximal 15 \nconcentrations of 12% and <1% for Co and Cu, respectively, and in the case of Co the \nmaximal concentrations of these species occurred at an intermediate ionic strength of \n~0.15 M.  Therefore in terms of both absolute concentrations and their ionic strength \ntrends, carbonate species cannot account for the observed binding trends.  Chloride \ncomplexation is clearly significant in both the Co and low pH, Cu experiments, varying 20 \nfrom <1 to ~20% of the total metal species (Tables 3 and 5).  The activity coefficients \nof the free ions of both Co and Cu are predicted to decrease by a factor of ~3 with \nincreasing I from 0.005 to 0.7 M.  Therefore, at first appearance, chloride complexation \nand simple activity coefficient effects both appear to be important in explaining the \nmetal-humic binding trends shown in Figs. 1a and 1e.  However, the predicted free 25 \nmetal ion activities either vary little with I (Cu at low pH, Table 5) or actually increase \nover all or part of the range of increasing I (Cu at high pH, Table 4; Co, Table 3), \nindicating that chloride complexation and the varying activity coefficients are not the \noverriding factors controlling the metal-humic binding. \n 30 \nThe electrostatic effect on the humic molecule results in decreased attraction, and \nhence binding, between metals and the negatively charged humic molecule with \n 12\nincreasing I.  The effect is ascribed to the increased shielding effect of the solution ions \nand to the associated decreased diffuse-layer thickness. The scale of the effect within \neach of the three experimental series can be assessed by running WHAM under the \nextreme ionic strength conditions with fixed values of aM2+  and pH.  It follows from \nEquation 2 that the only factors then affecting the amount of specifically bound metal 5 \nare the exponential term and the degree of protonation of the humic molecule, which \ntogether can be considered as constituting the electrostatic effect on metal binding.  As \nionic strength increases, protonation decreases due to increased shielding and therefore \nthe negative charge on the humic molecule also increases.  The increase in negative \ncharge has the effect of counteracting to some degree the effect of increased shielding 10 \non metal ion binding.  To obtain fixed values of aM2+  and pH, the total trace metal \nconcentrations at I=0.7 M were varied until WHAM gave the same aM2+ values as those \npredicted at I=0.005 M with the original total trace metal concentrations (4.7 x 10-7 M \nCu and 5.1 x 10-7 M Co).  Table 6 shows the final values of variables used in the \ncalculations.  The predicted differences in νM\/ aM2+ between the 0.005 and 0.7 M 15 \nsolutions of each series (Table 6), at fixed values of aM2+  and pH, are similar to those \npredicted under the experimental conditions (Tables 3-5) .  It follows that the \nelectrostatic (coulombic) effect is the dominant factor underlying the observed \nvariations in metal-humic binding in NaCl solutions. \n 20 \nAlthough the electrostatic sub-model within Model V provides a good description of \nthe dependence of metal-humic binding on ionic strength, observed in this and a \nlimited number of other studies (Higgo et al., 1993; Tipping and Hurley, 1992), \nalternative electrostatic models have been used for humic substances (Bartschat et al., \n1992; Benedetti et al., 1995).  Given the apparent importance of the electrostatic term 25 \nfor metal-humic interactions (see also Sections 5.3 and 5.4), additional measurements \nof ionic strength effects would enable a proper comparison of the performance of these \nvarious alternative models. \n \n 30 \n5.2.  Metal-Humic Binding in the presence of Ca and Mg \n \n 13\nThe results shown in Fig. 1 indicate that sea-water concentrations of Ca and Mg have a \nsmall competitive effect on Co-binding by PHA but a negligible effect on that of Cu \nunder the conditions employed in our experiments.  The findings for Cu contrast with \nthe combined experimental-modelling study of Mantoura et al. (1978) that predicted a \ndecrease in humic binding from ~100% to ~10% down estuary due principally to 5 \ncompetition from Ca and Mg.  In their study, Mantoura et al. (1978) isolated humic \nmaterial from various sources, determined conditional metal-humic association \nconstants (Ko) at a single set of conditions (pH 8.0 and I = 0.02 M), and used these \nconstants to make predictions of metal speciation under estuarine conditions using an \nequilibrium speciation code based on HALTAFALL (Ingri et al., 1967).  Thus 10 \ncompetition by Ca and Mg was not measured directly. \n \nThe contrasting Cu-binding characteristics reported in this and the Mantoura et al. \n(1978) studies may be related to a number of factors, the most obvious of which are the \nbinding strengths of the humics and the concentrations of humic binding sites and 15 \nmetals.  The equilibrium constants cannot be compared directly between the two \nstudies because the metal-humic interactions are expressed as metal association \nreactions in the Mantoura model and by metal-proton exchange reactions in Model V \n(Equation 1).  However, a measure of the relative binding strengths was obtained by \ncomparing the ratios of the equilibrium constants for Ca, Mg, Cu and Co (Table 7).  20 \nTrace metal binding occurs principally at bidendate sites in the Model V framework \n(Tipping et al., 1998) and the bidentate constants are obtained by multiplying the \nrelevant monodentate constants for each metal (i.e. adding the pK values) (Tipping, \n1994).  The comparison therefore used the pKMHA value for each metal multiplied by 2, \ncorresponding to bidentate binding by two carboxyl groups.  This analysis yielded the 25 \nsame order of binding strength in both studies (Cu >> Co > Ca ≈ Mg) but in different \nratios, i.e. 3200:13:1 with Model V and 250000:8:1 in the Mantoura study.  The latter \nratios were obtained using the median values of the ranges shown in Table 7.  If the \nlowest Ko for Cu was used instead, the Mantoura ratios would be 16000:8:1.  \nWhichever Cu value is used, it is apparent that the relative binding strengths of Ca, Mg 30 \nand Co were approximately the same in both studies, but that the relative strength of \nCu binding used in our study was much less.  Therefore the greater effect of Ca and Mg \n 14\ncompetition on Cu binding, predicted in the Mantoura study, cannot be explained by \nthe intrinsic binding strengths of the humics. \n \nThe concentration of humic binding sites in our experiments (see Table 7) was \ncalculated from the added PHA concentration (10 mg l-1) and from the default total 5 \nbinding site concentration (4.94 x 10-3 mol g-1) for humic acid contained in the WHAM \ndatabase.  The five sets of published proton binding data, used by Tipping (1993) to \nderive the default binding site concentration for humic acids, gave a range of 4.35-5.25 \nx 10-3 mol g-1.  In the Mantoura study, the Cu concentration was 1 x 10-8 M but a \nnumber of trace metals were included in the model prediction, giving a total trace metal 10 \nconcentration of 5.2 x 10-8 M.  Thus both studies employed a [Cu]:[binding site] ratio \nof 1:100, but the absolute concentrations of the two parameters were 50-times higher in \nour study (Table 7).  The difference in the Ca-Mg-Cu competition effects between the \ntwo studies therefore could be related to the low availability of humic binding sites in \nthe Mantoura study relative to seawater-Ca and -Mg concentrations, especially as other 15 \ntrace metals were also included in the model predictions.  This possibility is discussed \nfurther in the following section. \n \n5.3.  WHAM Simulations under Realistic Estuarine Conditions \n 20 \nFrom the point of view of the likely effects on metal-humic binding, real estuaries \ndiffer most significantly from the experimental conditions with respect to pH and the \npresence of additional inorganic ligands.  The effect of low pH river waters on metal-\nhumic binding is of particular interest.  While increasing ionic strength, cation \ncompetition and inorganic speciation all serve to reduce metal-humic binding down an 25 \nestuary, increases in pH may limit or even potentially reverse these effects.   \n \nWHAM was used in combination with its default database to predict the effects of \nligand competition and variable pH on Cu and Co binding in two estuarine systems \nwith contrasting river-water pH values.  The default pKMHA values were used in 30 \npreference to the optimised values since the former are means derived from a range of \npublished studies (Tipping, 1994) and therefore are likely to be more representative of \nhumic acids in general.  The compositions of the freshwaters were based on two soft-\n 15\nwater Cumbrian lakes, Seathwaite Tarn (pH of 5.1) and Esthwaite Water (pH of 7.8).  \nIntermediate estuarine compositions were calculated assuming conservative mixing of \nthe various chemical components (Table 8), including alkalinity.  The pH was \ncalculated (Figs. 2a and 2b) assuming equilibrium with CO2 in the atmosphere \n(0.00036 atm).  The concentration of humic material was kept constant at 1 mg\/l, a 5 \ntypical value for coastal waters (Libes, 1992).  Cu and Co concentrations were set at \n3x10-7 M, which is 1-2 orders greater than  might be expected for these metals \n(Chester, 1990).  Extreme trace metal concentrations and [M]:[binding site] ratios \n(~1:10) were chosen so as to maximise any competition effects from Ca and Mg for the \nhumic ligand.  The high concentrations are unlikely to affect the inorganic speciation as 10 \nthe inorganic ligands are present in great excess.  Initial model runs included only one \ntrace metal at a time. \n \nFigures 2c and 2d demonstrate that Co speciation is generally dominated by the free \nmetal ion and carbonate forms in both estuarine simulations, in agreement with the 15 \npredictions of Mantoura et al. (1978) and Tipping et al. (1998).  In all three studies the \npredicted Co-humic complexation reaches a maximum, generally within the range 0.5-\n5 % of the total Co, at or close to the freshwater end-member.  In the relatively high pH \nsystem (Fig. 2d), the predicted percentage humic-Co decreases continuously down the \nestuary from 7 % to 0.1 % of the total Co.  In the low pH system (Fig. 2c), humic 20 \nbinding in the freshwater end-member is decreased from 7% to 1.6% due to proton \ncompetition.  In contrast to Co, Cu speciation is dominated by humic complexation in \nboth estuaries (Figs. 2e and 2f).  As with Co, however, humic binding is lower (84%) \nin the freshwater end-member of the low pH system (Fig. 2e), due to proton \ncompetition, and carbonate species are increasingly important with increasing ionic 25 \nstrength at both pH values.  In the seaward end member, 90% of the Cu is humic-bound \nand 10% occurs as carbonate species.  To determine the contribution of Ca and Mg \ncompetition to this predicted decrease in Cu-humic binding in full-strength seawater, \nrelative to that predicted and observed at 0.7 M ionic strength in mixed salt solution \n(Fig. 1d), the seawater simulation was rerun with the pKMHA for Ca and Mg set to 999 30 \n(i.e. effectively equivalent to no Ca and Mg binding).   The result was to increase the \nCu-humic binding from 90% back up to 96%, so that there does appear to be a \n 16\ncompetition effect under more realistic estuarine conditions but it remains small \ncompared to that reported by Mantoura et al. (1978). \n \nAdditional modelling was undertaken to explore the effects of Co-Cu competition and \nthe natural variability in humic binding. To examine competition, the estuarine 5 \nsimulations were rerun under the same conditions as above, except that Co and Cu \nwere present together, each at their original concentrations (3 x 10-7 M).  Natural \nvariability was considered by running simulations for one trace metal at a time with \nalternative pKMHA values for Co and Cu.  The alternatives used were the extremes of \nthe ranges for humic acid, and the default fulvic acid values, as contained in the 10 \nWHAM database and shown in Table 2. The humic bound fractions predicted by these \nsimulations are shown in Figure 3, together with the fractions predicted using the \ndefault humic acid pKMHA values, shown previously in Figure 2.  The most substantial \ndifferences are those linked to the natural variability of the humic substances.  Ignoring \nthe low binding in the Seathwaite (low pH) end-member, the predicted Cu binding 15 \ndecreased to ~70% in seawater when the humic substances were assumed to be fulvic \nacid.  For humic acid, Cu binding remained above 85% at all pKMHA values.  The \npredicted effect of humic variability was even greater for Co, especially with respect to \nthe extreme pKMHA values of 1.9 and 3.8.  It is apparent that a value of 1.9 effectively \nchanges the nature of Co from being a weak binding to a strong binding metal, more 20 \ncomparable to Cu (see Figs. 3a-d).  The question then arises as to how representative \nthe Co pKMHA values are for humic acid in the WHAM database, especially as they are \nbased on only three published datasets (Higgo et al., 1993; Tipping, 1993).  The \noptimised pKMHA value (~2.5) for Co obtained in the present study for a peat humic \nacid and the previously reported correlation between pKMHA values and the analagous 25 \nvalues for lactic acid (Tipping and Hurley, 1992) both indicate that the default pKMHA \nvalue of 2.7 for humic acid is the most representative.  However, the above simulations \ndo highlight the need for further high quality measurments of metal-humic interactions \nfor at least some metals.  In comparison to the effects of natural variability in humic \nsubstances, the predicted competition effects between Co and Cu are small, even at the 30 \nhigh metal:humic ratios used in the simulations.  A small competition effect is \npredicted in the case of Co binding (Figs. 3a and 3b), but effectively none at all in the \n 17\ncase of Cu (Figs. 3c and 3d), reflecting the contrasting binding strengths of the two \nmetals.   \n \nGiven the particular interest in this study of Ca and Mg competition on Cu binding, \nfurther WHAM simulations were undertaken to explore the effects of variable Cu and 5 \nhumic concentrations on humic binding.  These simulations used the default humic \nacid pKMHA values and were run for full-strength seawater at more typical estuarine \nconcentrations of total Cu (1x10-8 M and 1x10-7 M), over a range of humic \nconcentrations between 0.2 and 1 mg l-1.  One of these simulations (1x10-8 M Cu and \n0.2 mg l-1 humic acid) corresponds to the same concentrations of total Cu and humic 10 \nbinding sites as those used by Mantoura et al. (1978).  Figure 4a shows that the \npredicted % Cu-humic binding decreases sharply once the humic concentration falls \nbelow ~0.5 mg l-1 and it decreases with increasing total Cu concentration, as would be \nexpected from the law of mass action.  Figure 4b shows the corresponding predictions \nof combined binding-site occupancy by Ca and Mg (i.e. νCa + νMg) and Ca, Mg and Cu 15 \n(i.e. νCa + νMg + νCu).  The trends in νCa + νMg + νCu are again in line with mass action \nprinciples but of particular significance is that the combined occupancy by Ca and Mg \nactually decreased with decreasing humic concentration, due to displacement by the more \nstrongly binding Cu.  In all cases, approximately half of the increased Cu binding was \nmitigated by decreased Ca and Mg binding, so that the predicted metal competition 20 \neffects were smaller than might have been expected.  Since metal binding occurs \npreferentially at bidendate sites in the Model V framework (Tipping et al., 1998), a \nmaximum level of binding site occupation by Ca, Mg and Cu can be  calculated from \nthe predicted ν values and the default concentration (4.94 x 10-3 mol g-1) of binding \nsites for humic acid in the WHAM database (Tipping, 1994).  The ν values shown in 25 \nFigure 4b correspond to a maximum site occupancy of 35-48%. \n \nBoth the experimental and modelling work undertaken in this study have indicated that \nCa and Mg competition is not a major factor in influencing Cu-humic binding in \nestuaries.  We suggest that the key factor as to why Mantoura et al. (1978) predicted a 30 \ndecrease in Cu-humic binding from ~100% to ~10% down estuary, linked to a >99% \nhumic binding-site occupancy by Ca and Mg in seawater, is the electrostatic effect on \nthe humic molecule.  In their model, Mantoura et al. (1978) included the humic \n 18\nmaterial as an additional simple ligand with the assumptions that (1) the ratio of the \nactivity coefficients of the humic ligand and the metal-humic complex was unity, and \n(2) Ko did not vary over the small pH range (~7.5-8.1) used in the modelling.  \nAssumption 1 means that Ko is independent of I, implying that there is no electrostatic \neffect on the humic molecule.  Thus the conditional binding constants measured at 5 \nI=0.02 M were applied universally. \n \nThe effects of assumption 1 on the WHAM predictions were assessed by means of the \nfollowing steps: (1) WHAM was run at identical conditions (I=0.02 M, pH=8.0, 1x10-6 \nM humic binding sites, and 1x10-8 M Cu) to those used by Mantoura et al. (1978) in 10 \nmeasuring their conditional metal-humic stability constants, with all WHAM \nparameters set to their default values.  (2)  P (see Equation 3) was then set to zero, so \nthat the exponential term in Equation 2 was equal to unity, and the model rerun with \nvarying pKMHA values for Cu, Ca and Mg, until the amounts of specifically bound Cu and \nCa + Mg were approximately the same as those found in step 1.  The results of the final 15 \nrerun (see Table 9) were achieved with pKMHA values lower than the default values by \n0.58.  The new pKMHA values are effectively conditional binding constants, directly \ncomparable to those used by Mantoura et al. (1978).  (3) WHAM was run for the \nseawater end-member using the new conditional binding constants for Cu, Ca and Mg \nwith P set to zero. 20 \n \nThe above procedure resulted in a substantial decrease in the humic-bound Cu fraction \nin seawater to 59% and a marked increase in binding site occupancy by Ca and Mg to \n2.20 x 10-3 mol g-1, when compared with the results for seawater using the default \nparameters (Table 9).   These figures are significantly closer to the predictions of 25 \nMantoura et al. (1978), confirming the importance of the electrostatic term under \nestuarine conditions.  The importance of the electrostatic effect under estuarine \nconditions is also supported by two other recent studies.  Pinheiro et al. (1999) found \nthat an increase in ionic strength from 0.02 to 0.1 M produced a far greater lowering of \nCa-fulvic acid binding than did metal competition from Pb, while Brown et al. (1999) 30 \nreported a substantial decrease in binding with increasing ionic strength between \nSuwannee River fulvic acid and Cu. \n \n 19\n5.4.  Predicted Ca and Mg Competition in a Range of Natural Waters \n \nTable 9 shows that binding site occupancy by Ca and Mg is predicted, using the default \nparameters, to be greater at I=0.02 M and a pH of 8.0 than in full-strength seawater at \npH 8.3.  This result is counter-intuitive because seawater has approximately a 30-times 5 \ngreater concentration of dissolved Ca + Mg and half the proton activity (i.e. less proton \ncompetition).  To explore this surprising result further, the occupancy of humic binding \nsites by Ca + Mg was also estimated at the same humic acid and total Cu \nconcentrations for a range of low salinity waters, including the I=0.02 M, pH=6.9 water \nfrom the low-pH estuary simulation, used in this study, and the two hard-waters (R1 10 \nand R2) from the Humber catchment (U.K.), used in the modelling work of Tipping et \nal.(1998).  Several general points emerge when the results are viewed as a whole \n(Table 9).  Apart from Seathwaite Tarn water, in which proton competition was the \npredominant factor, there is a relatively small range (0.85-1.38 x 10-3 mol g-1) in site \noccupancy by Ca and Mg within the diverse range of water-types considered.  15 \nFurthermore, this range encompasses the values observed in seawater at varying humic \nand total Cu concentrations (Fig. 4b).  It has been shown that the electrostatic effect on \nthe humic molecule and ligand competition are important in limiting Ca and Mg binding \nin seawater.  The same two factors, operating in reverse, are important in maintaining \nhigh Ca and Mg binding in non-acid freshwaters.  Another important factor in 20 \nmaintaining binding, even in soft waters, is that the combined concentrations of Ca and \nMg (e.g. 325 µM in Esthwaite Water - see Table 8) are far in excess of the total number \nof humic binding sites (e.g. 5 µM at 1 mg l-1 humic acid). \n \nTable 9 also shows that, even with humic concentrations at the lower end of their natural 25 \nrange (i.e. 0.2 mg l-1),  humic-bound Cu exceeds 95% except in seawater and in \nSeathwaite Tarn water, where the controlling factor is proton competition.  Furthermore, \nfor those waters with >95% humic-Cu, the exact percentage bound is not simply related \nto site occupancy by Ca + Mg.  For example, the water (Esthwaite Water) with the \nhighest humic-bound Cu has one of the highest occupancies by Ca + Mg.  It follows that, 30 \nin these examples, the amount of humic-bound Cu is influenced more by other factors, \nsuch as variations in Cu speciation, ionic strength and hence the associated electrostatic \neffects on the various binding species.  Therefore competition from Ca and Mg does not \n 20\nappear to be a dominant factor in the humic binding of Cu in common natural waters.  By \nanalogy, it follows that the same will be true for other strongly binding metals (e.g. Al, \nFe(III), Hg and Pb).  This contrasts with the picture for weakly binding metals like Co.  \nBoth the experimental and modelling studies have demonstrated the importance of Ca \nand Mg competition for Co.  This competition is due to the greater similarity in the 5 \npKMHA values of these metals, so that competition occurs even when binding site \noccupancy by Ca and Mg is relatively low.  Other similarly weakly binding metals \ninclude Ni, Zn and Cd. \n \nThe final observation concerning Table 9 is that the highest binding site occupancy by 10 \nCa and Mg, obtained with the default WHAM parameters, occurs in the slightly \nalkaline hardwaters (R1 and R2) followed by the slightly alkaline softwater of \nEsthwaite Water (Table 9). This high Ca- and Mg-occupancy is relatively unaffected by \nhigher humic concentrations more typical of freshwaters (e.g. see the predictions for \nEsthwaite Water at humic concentrations of 2 and 10 mgl-1 in Table 9) because the 15 \ncombined concentrations of Ca and Mg are still substantially in excess of the total \nnumber of humic binding sites.  The WHAM predictions therefore suggest that the most \nlikely conditions in which Ca and Mg competition effects will be significant with \nrespect to all metals is in fresh and brackish waters, and not seawater as intuitively \nexpected. 20 \n \nAnother surprising prediction concerning Ca and Mg competition is apparent in the \nestuarine simulations shown in Figure 3.  In the case of Co, and in contrast to Cu, an \nincrease in humic binding in the river water end-member was predicted in all \nsimulations of the low pH estuary, apart from that involving a pKMHA value of 1.9 (see 25 \nFigs. 3a and 3c).  The decrease in Cu binding has already been attributed to the low pH \n(5.1) of the river end-member, compared to that at higher ionic strengths (Fig. 2a), and \nthe associated increase in proton competition.  An insight into why an increase in Co \nbinding is predicted is given in Table 9.  As already noted, a relatively small range \n(~0.8-1.4 x 10-3 mol g-1) in site occupancy by Ca and Mg was predicted for most 30 \nnatural waters using the default pKMHA values.  Of the waters considered in Table 9, \nonly the river water end-member in the Seathwaite (low pH) estuary fell outside this \nrange,  with a low combined Ca and Mg occupancy of ~0.1 mol g-1.  Therefore, the \n 21\nmost likely explanation for the predicted increase in humic binding in the river water \nend-member is that, for a weak binding trace metal like Co, increased binding can \noccur due to substantially decreased competition from Ca and Mg under acid \nconditions.  Ca and Mg binding are affected more by proton competition than Co \nbecause of their higher pKMHA values (Table 7).  In other words, the positive effect on 5 \nCo binding of less Ca and Mg competition more than outweighs the direct negative \neffect of increased proton competition.  The same overall effect does not occur for a \nstrong binding metal like Cu because the metal is not affected substantially by Ca and \nMg competition in the first place, as demonstrated throughout this study. This \ninterpretation is supported by the predictions for Co at a pKMHA value of 1.9 in Fig. 3a.  10 \nIn this instance, the pKMHA value corresponds to that of a strong binding metal, as \npreviously discussed, and Co binding is predicted to decrease in the river water end-\nmember, as with Cu (see Figs. 3a and 3c).  It follows that this effect will be highly \nsensitive to the exact pKMHA values for trace metals over a critical range (e.g. ~1.9-2.7 \nfor humic acids) and, in the case of some trace metals (e.g. Co), to the natural 15 \nvariability in humic binding properties.  These results highlight a major advantage of a \ngeneral predictive model, such as WHAM, in that it is able to identify subtle \ncompetition effects of multi-component equilibrium systems that are sometimes \ncounter-intuitive. \n 20 \nIn this study, data interpretation and model predictions have been based on Model V as \nthe humic sub-model within WHAM.  If trace metals are present at particularly low \n[metal]:[humic] ratios, it may be the case that better predictions would be obtained using \nModel VI (see Section 2), especially if the metals (e.g. Cu) have high affinities for the \nsmall number of strong binding sites that appear to present in at least some humic 25 \nsamples (Tipping, 1998).  The main effect of using Model VI would be to increase the \nextent of humic complexation of some trace metals.  Within the Model V framework, \nthis effect is equivalent to lowering the pKMHA values of some metals.  The relative \nimportance of the electrostatic effect is unlikely to be diminished by the choice of \nhumic sub-model, since Equation 2 operates similarly for the strong binding sites as for 30 \nthe monodentate and bidentate carboxyl and phenolic sites.  The predicted Ca and Mg \ncompetition effects, if affected at all, will be less with Model VI because Ca and Mg \nhave particularly low affinities for the additional strong binding sites (Tipping, 1998). \n 22\n \n6.  CONCLUSIONS \n \nLaboratory experiments have demonstrated that Cu- and Co-humic binding decrease \nsubstantially with increasing ionic strength under typical estuarine conditions.  The 5 \nequilibrium chemical model, WHAM, provided a good description of the observed \nbinding and indicated that the main factor causing the observed variations was the \nelectrostatic (coulombic) effect on the humic molecule.  WHAM also indicated that \ncompetition for humic binding sites by Ca and Mg in a wide range of natural water \ntypes, at typical humic concentrations, may be important for weak binding metals, e.g. 10 \nCo, Zn, Cd and Ni, but not for strong binding metals, e.g. Cu, Al, Hg and Pb. \n \nACKNOWLEDGMENTS \nThis work was made possible by NERC Research Studentships awarded to ASP and \nMPH and by a NERC Research Grant (GR9\/2866).  We would like to thank 3 15 \nanonymous reviewers for their detailed and stimulating comments. \n \n 23\nREFERENCES \n Bartschat B. M., Cabaniss S. E., and Morel F. M. M. (1992) Oligoelectrolyte Model \nFor Cation Binding By Humic Substances. Environmental Science & Technology \n26(2), 284-294. \nBenedetti M. F., Milne C. J., Kinniburgh D. G., Van Riemsdijk W. H., and Koopal L. 5 \nK. (1995) Metal-ion binding to humic substances - Application of the nonideal \ncompetitive adsorption model. Environ. Sci.  Technol. 29(2), 446-457. \nBonn B. A. and Fish W. (1993) Measurement of electrostatic and site-specific \nassociations of alkali metal cations with humic acid. J. Soil Sci. 44, 335-345. \nBrown G. K., Cabaniss S. E., Maccarthy P., and Leenheer J. A. (1999) Cu(II) binding 10 \nby a pH-fractionated fulvic acid. Analytica chimica acta 402(1-2), 183-193. \nBryan S. E. (2001) Testing models of chemical speciation in freshwaters. Ph.D., \nLancaster. \nChester R. (1990) Marine Geochemistry. Unwin Hyman. \nHiggo J. J. W., D. K., B. S., and E. T. (1993) Complexation of Co2+, Ni2+, UO22+ and 15 \nCa2+ by humic substances in groundwaters. Radiochim. Acta 61, 91-103. \nIngri N., Kakolowicz W., Sillén L. G., and Warnqvist B. (1967) High speed computers \nas a supplement to graphical methods, V HALTAFALL, a general program for \ncalculating the composition of equilibrium mixtures. Talanta 12, 1261-1286. \nLead J. R., Hamilton-Taylor J., Hesketh N., Jones M. N., Wilkinson A. E., and Tipping 20 \nE. (1994) A comparative study of proton and alkaline earth metal binding by humic \nsubstances. Anal. Chim. Acta 294, 319-327. \nLead J. R., Hamilton-Taylor J., Peters A., Reiner S., and Tipping E. (1998) Europium \nbinding by fulvic acids. Anal. Chim. Acta 369, 171-180. \nLibes S. M. (1992) An Introduction to Marine Biogeochemistry. Wiley. 25 \nLin C. F., Houng L. M., Lo K. S., and Lee D. Y. (1994) Kinetics of copper \ncomplexation with dissolved organic matter using stopped-flow fluorescence \ntechnique. Toxicol. Environ. Chem. 43(1-2), 1-12. \nMa H., Kim S. D., Cha D. K., and Allen H. E. (1999) Effect of kinetic  of \ncomplexation by humic acid on the toxicity of copper to Ceriodaphnia dubia. 30 \nEnviron. Toxicol. Chem. 18, 828-837. \nMantoura R. F. C., Dickson A., and Riley J. P. (1978) The complexation of metals with \nhumic materials in natural waters. Est. Coastal Mar. Sci. 6, 387-408. \n 24\nMartell A. E. and Hancock R. D. (1996) Metal Complexes in Aqueous Solutions. \nPlenum Press. \nPeters A. J., Hamilton-Taylor J., and Tipping E. (2001) Americium binding to humic \nacid. Environ. Sci. Technol. (submitted). \nPinheiro J. P., Mota A. M., and Benedetti M. F. (1999) Lead and calcium binding to 5 \nfulvic acids: Salt effect and competition. Environmental Science & Technology 33, \n3398-3404. \nReid P. M., Wilkinson A. E., Tipping E., and Jones M. N. (1990) Determination of \nmolecular weights of humic substances by analytical (UV scanning) \nultracentrifugation. Geochimica et Cosmochimica Acta 54, 131-138. 10 \nStumm W. and Morgan J. J. (1996) Aquatic Chemistry. Wiley. \nTanford C. (1961) Physical Chemistry of Macromolecules. Wiley. \nTipping E. (1993) Modelling ion binding by humic acids. Colloids and Surfaces A: \nPhysicochem. Engineer. Aspects 73, 117-131. \nTipping E. (1994) WHAM- a chemical equilibrium model and computer code for 15 \nwaters, sediments, and soils incorporating a discrete site\/electrostatic model of ion \nbinding by humic-substances. Computers and Geosciences 20(6), 973-1023. \nTipping E. (1998) Humic ion-binding Model VI: an improved description of the \ninteractions of protons and metal ions with humic substances. Aquat. Geochem. 4, 3-\n48. 20 \nTipping E. and Hurley M. A. (1992) A unifying model of cation binding by humic \nsubstances. Geochim. Cosmochim. Acta 56, 3627-3641. \nTipping E., Lofts S., and Lawlor A. J. (1998) Modelling the chemical speciation of \ntrace metals in the surface waters of the Humber system. Science Of the Total \nEnvironment 210\/211(1-6), 63-77. 25 \nTown R. M. and Filella M. (2000) Dispelling the myths: Is the existence of L1 and L2 \nligands necessary to explain metal ion speciation in natural waters? Limnol. \nOceanogr. 45, 1341-1357. \n 25\nTable 1.  The measured pH (mean and standard deviation) in the binding experiments, with the numbers \nof experimental replicates shown in parentheses.   \n \nExperimental   series*\n \nI (\/M) Cu\/Na \nlow pH \nCu\/Na \nhigh pH \nCu\/NaMgCa \nlow pH \nCu\/NaMgCa \nhigh pH \nCo\/Na Co\/NaMgCa \n0.005 4.57±0.04 (3) 7.79±0.12 (3) 4.58±0.01 (5) 8.07±0.02 (6) 7.92±0.03 (6) 8.03±0.03 (6) \n0.05 4.38±0.03 (3) - (0) 4.62±0.01 (4) - (0) 7.77±0.02 (6) 7.87±0.05 (6) \n0.15 4.69±0.14 (9) 7.84±0.01 (2) 4.51±0.02 (4) 7.82±0.00 (3) 7.82±0.02 (5) 7.76±0.06 (5) \n0.35 4.56±0.03 (3) 7.79±0.06 (5) 4.44±0.05 (9) 7.93±0.15 (3) 7.70±0.02 (4) 7.79±0.01 (6) \n0.7 4.46±0.09 (7) 7.73±0.03 (3) 4.51±0.01 (3) 7.71±0.02 (4) 7.68 (1) 7.68±0.07 (6) \n*Experiments in NaCl solutions indicated by \/Na, those in mixed NaCl, MgCl2, CaCl2 solutions by \n\/NaMgCa \n 5 \n \nTable 2.  A comparison between the optimised pKMHA values in this study with the default values in the \nWHAM database. \n \n pKMHA range stand. \ndev. \nno. of \ndatasets \nCu (optimised) 1.61 - - 1 \nCu HA (WHAM) 1.5 1.1-1.8 0.4 4 \nCu FA (WHAM) 0.8 0.6-0.9 0.1 6 \nCo (optimised) 2.45 and 2.55 - - 1 \nCo HA (WHAM) 2.7 1.9-3.8 1.0 3 \nCo FA (WHAM) 1.7 1.3-1.9 0.3 6 \n 10 \n \nTable 3.  Selected WHAM output data* for Co binding experiments in NaCl solutions at pH ~7.8. \n \nI (\/M) νCo \n(mol g-1)\/10-6 \nν Co\nCo2 +a\n  (l g-1) aCo2+ \n(nM) \nγCo2+ [Co2+] \n(nM) \n[CoCl+] \n(nM) \n[CoCl+]    [Co2+] \n(as % of total Co) \n0.005 53 25000 2.1 0.73 3 0.02 0.004 0.6 \n0.05 39 910 43 0.47 95 4.2 0.82 19 \n0.15 17 220 79 0.31 250 23 4.6 50 \n0.35 4.9 56 88 0.25 360 60 12 70 \n0.7 1.5 19 80 0.23 350 110 22 68 \n*νCo - concentration of Co specifically bound to humics;  [ ] denotes solution concentrations; aCo2+ - free ion \nactivity; and γCo2+ - activity coefficient of free ion. 15 \n 26\nTable 4. Selected WHAM output data* for Cu binding experiments in NaCl solutions at pH ~7.8. \n \nI (\/M) νCu \n(mol g-1)\/10-6 \nν Cu\nCu2 +a\n  (l g-1) aCu2+ \n(nM) \nγCu2+ [Cu2+] \n(nM) \n[CuCl+] \n(nM) \n[CuCl]        [Cu2+] \n(as % of total Cu) \n0.005 57 1.9x108 0.0003 0.74 0.0004 0.000003 6.0x10-7 7.2x10-5 \n0.15 46 1.0x107 0.0046 0.31 0.015 0.0017 3.5x10-4 3.1x10-3 \n0.35 46 3.8x106 0.012 0.25 0.051 0.01 2.2x10-3 1.1x10-2 \n0.7 48 1.7x106 0.028 0.23 0.12 0.048 1.0x10-2 2.6x10-2 \n*\n nCu - concentration of Cu specifically bound to humics;  [ ] denotes solution concentrations; aCu2+ - free ion \nactivity; and γCu2+ - activity coefficient of free ion. \n 5 \n \n \n \n \nTable 5. Selected WHAM output data* for Cu binding experiments in NaCl solutions at pH ~4.5. 10 \n \nI (\/M) νCu \n(mol g-1)\/10-6 \nν Cu\nCu2 +a\n  (l g-1) aCu2+ \n(nM) \nγCu2+ [Cu2+] \n(nM) \n[CuCl+] \n(nM) \n[CuCl]     [Cu2+] \n(as % of total Cu) \n0.005 41 910 45 0.74 61 0.5 0.114 13 \n0.15 35 1000 35 0.31 110 13 2.67 24 \n0.35 24 500 47 0.25 190 40 8.38 41 \n0.7 15 290 53 0.23 230 88  18.7 48 \n*\n nCo - concentration of Co specifically bound to humics;  [ ] denotes solution concentrations; aCo2+ - free ion \nactivity; and γCo2+ - activity coefficient of free ion. \n \n 15 \n \nTable 6.  A comparison between the metal humic binding, expressed as nM\/aM2+, in the end-member \nNaCl solutions predicted at fixed aM2+ and pH, with the binding calculated under the experimental \nconditions used in deriving Tables 3-5.  Values of variables used in the calculations are also shown. \n 20 \nSeries I \n(M) \n \npH Total metal \n(nM) \naM\n2+ \n(nM) \n \nPredicted  M\nM 2 +\nν\na\n  (l g-1) \n \n     fixed aM2+ and pH as in Tables 3-5 \nCo 0.005 7.68 510 3.2 1.6x104 2.5x104 \nCo 0.7 7.68 21 3.2 19 19 \nCu, high pH 0.005 7.73 470 0.0003 1.6x108 1.9x108 \nCu, high pH 0.7 7.73 6.0 0.0003 2.0x106 1.7x106 \nCu, low pH 0.005 4.46 470 65.9 580 910 \nCu, low pH 0.7 4.46 590 65.9 290 290 \nnM - concentration of metal specifically bound to humics; aM2+- free ion activity. \n \n \n \n 27\n \n \n \nTable 7.  A comparison of parameter values used in this and the Mantoura et al. (1978) studies. \n 5 \n \nThis study Mantoura et al. study \n[Cu] 4.7 x 10-7 M [Cu] 1.0 x 10-8 M \n  [total metals] 5.2 x 10-8 M \n[binding sites] 5 x 10-5 M [binding sites] 1 x 10-6 M \npKCaHA 3.2 log10 Ko for Ca 3.6-4.1* \npKMgHA 3.3 log10 Ko for Mg 3.4-4.1* \npKCuHA 1.5 log10 Ko for Cu 8.0-10.4* \npKCoHA 2.7 log10 Ko for Co 4.5-4.9* \n*Typical values, omitting outliers. \n \n \n 10 \n \n \n \n \nTable 8.  Composition of end-member waters used in the simulated estuary predictions of metal 15 \nspeciation. \n \n \nComponent Esthwaite Seathwaite Seawater \n (mM) (M) \nNa             250 193 0.488 \nMg             60 33 0.0552 \nK              25 10 0.0102 \nCa             265 28 0.0107 \nSr             0 0 0.00009 \nCl             280 212 0.569 \nNO3          30 36 0 \nSO4          115 42 0.0293 \nHCO3        385 0 0.0024 \npH 7.8 5.1 8.3 \n \n20 \n 28\nTable 9.  The combined occupancy of humic binding sites by Ca and Mg and the amount of humic-bound \nCu predicted by WHAM for various waters at 0.2 mg l-1 humic acid and 1x10-8 M total Cu, using \ndifferent values of the electrostatic constant (P) and pKMHA (see text for full explanation).  The Esthwaite \nWater predictions are also given for two other humic acid concentrations. \nWater type \n \nP pKMHA nCa + nMg \n (mol g-1) \/10-3 \n \n[ ]\n[ ] ( )\nhumic - Cu\ntotal Cu\n%\n0.02 M, pH=8.0 default default 1.136 96.2 \n0.02 M, pH=8.0 zero conditional 1.146 97.7 \nSeawater, pH=8.3 default default 1.015 73.4 \nSeawater, pH=8.3 zero conditional 2.20 59.2 \n0.02 M, pH=6.9 default default 0.854 98.3 \nEsthwaite, pH=7.8 default default 1.180 99.0 \nSeathwaite Tarn, pH=5.1 default default 0.111 63.2 \nR1 (Tipping et al., 1998), pH=8.0 default default 1.375 96.1 \nR2 (Tipping et al., 1998), pH=7.5 default default 1.247 96.8 \nEsthwaite, pH=7.8, humics=2mgl-1 default default 1.211 99.9 \nEsthwaite, pH=7.8, humics=10mgl-1 default default 1.208 100.0 \n 5 \n 29\n \nFigure 1.  Metal-humic binding results of experiments, WHAM predictions using default database (____), \nand WHAM fits following optimization of pKMHA values (_ _ _  fitted to NaCl data only; ........ fitted to data \nfor both ionic media).  (a) Co in NaCl solution at pH ~7.8, (b) Co in Na-Mg-Ca chloride solution at pH \n~7.8, (c) Cu in NaCl solution at pH ~7.8, (d) Cu in Na-Mg-Ca chloride solution at pH ~7.8, (e) Cu in 5 \nNaCl solution at pH ~4.6, (f) Cu in Na-Mg-Ca chloride solution at pH ~4.6.  Error bars represent the \nstandard deviations of experimental replicates. \n \nFigure 2.  WHAM predictions, using the default database, of pH, metal-humic binding and inorganic \nmetal speciation in simulated estuaries with low (a, c, e) and high (b, d, f) freshwater end-member pH 10 \nvalues.  With the exception of humic-bound M and the free metal ion, species are only included if >1% \nof the total metal at some point in the estuary.  Combined carbonate and bicarbonate species are \nindicated by \"carb.\" \n \nFigure 3. WHAM predictions of metal-humic binding in simulated estuaries with low and high 15 \nfreshwater end-member pH values for humic acid at various assumed pKMHA values, including the defaults \n(def), and for fulvic acid (FA), using the default pKMHA values. \n \n \nFigure 4. WHAM predictions for seawater at total Cu concentrations of 1x10-8 M (circles) and 1x10-7 M 20 \n(squares) and at various humic acid concentrations, using the default database, of (a) Cu-humic binding \nand (b) the combined binding-site occupancy by Ca + Mg (solid symbols) and Ca + Mg + Cu (open \nsymbols). \n 30\nFig. 1 \n 31\nFig. 2 \n 32\nFig. 3 \n \n 33\nFig. 4 \n \n"}