{"doi":"10.1080\/0968776990070102","coreId":"14287","oai":"oai:generic.eprints.org:286\/core5","identifiers":["oai:generic.eprints.org:286\/core5","10.1080\/0968776990070102"],"title":"‘Learning matters’ ‐ adjusting the media mix for academic advantage","authors":["Twining, Peter"],"enrichments":{"references":[{"id":199557,"title":"A pedagogical framework for embedding C and IT into the curriculum',","authors":[],"date":"1998","doi":"10.1080\/0968776980060202","raw":"Conole, G. and Oliver, M. (1998), 'A pedagogical framework for embedding C and IT into the curriculum', ALT-J, 6 (2), 4-16.","cites":null},{"id":199560,"title":"Balancing the Media,","authors":[],"date":"1994","doi":"10.1080\/0260741930190204","raw":"Laurillard, D. (1994), Balancing the Media, PLUM Report No. 23, Milton Keynes: The Open University.","cites":null},{"id":1881695,"title":"Choosing and Using Educational Software: A Teacher's Guide,","authors":[],"date":"1994","doi":null,"raw":"Squires, D. and McDougall, A. (1994), Choosing and Using Educational Software: A Teacher's Guide, London: Falmer Press. II","cites":null},{"id":199563,"title":"Choosing and Using Educational Software: A Teacher's Guide, London: Falmer Press.","authors":[],"date":"1994","doi":null,"raw":null,"cites":null},{"id":199561,"title":"How should UK Higher Education make best use of new technology?', keynote speech ALT-C","authors":[],"date":"1996","doi":null,"raw":"Laurillard, D. (1996,), 'How should UK Higher Education make best use of new technology?', keynote speech ALT-C 1996, Glasgow.","cites":null},{"id":199559,"title":"Rethinking University Teaching: A Framework for the Effective Use of Educational Technology,","authors":[],"date":"1993","doi":"10.4324\/9780203304846","raw":"Laurillard, D. (1993), Rethinking University Teaching: A Framework for the Effective Use of Educational Technology, London: Routledge.","cites":null},{"id":199558,"title":"Student revolution', educ@guardian (the information and communication technology in education supplement in the UK's national Guardian newspaper),","authors":[],"date":"1998","doi":null,"raw":"Heppell, S. (1998), 'Student revolution', educ@guardian (the information and communication technology in education supplement in the UK's national Guardian newspaper), June 1998 and at http:\/\/www.ultralab.anglia.ac.uk\/pages\/recent_papers\/student_revolution.html.","cites":null},{"id":199556,"title":"Tele-learning in a Digital World: The Future of Distance Learning,","authors":[],"date":"1996","doi":"10.1080\/0268051022000048228","raw":"Collis, B. (1996), Tele-learning in a Digital World: The Future of Distance Learning, London: International Thomson Computer Press.","cites":null},{"id":199562,"title":"Theorising the IT\/Society Relationship',","authors":[],"date":"1995","doi":null,"raw":"Mackay, H. (1995), 'Theorising the IT\/Society Relationship', in Heap, N., Thomas, R., Einon, G., Mason, R. and Mackay, H., Information Technology in Society, London: Sage Publications, 41-53.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1999","abstract":"This paper notes the move towards resource‐based and distance learning within higher education institutions and briefly describes the Open University's approach to the development of such materials. In this context the need for clear evidence of the educational effectiveness of new technologies to support learning is explored. This is illustrated by reference to a course called ‘E211 Learning Matters’, which is currently being produced at the Open University (OU). A comparison is made of student activity on a ‘traditional’ OU course and E211. This analysis is based on a theoretical model presented to Alt‐C96 by Diana Laurillard This model involves looking at the distribution of student activity in terms of ‘attending’, ‘practising’, ‘discussing’ and ‘articulating’. The outcome of the analysis supports the view that by changing the balance of media used on E211 away from paper and towards new interactive media, the quality of the course will be enhanced. However, the model is limited in that it only explicitly deals with the quantity of use of each media. The paper explores some of the implicit assumptions within the model and illustrates them with reference to E211. It also highlights ways in which changing the balance of media has been found to impact on the underlying view of learning implicit within the course","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14287.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/286\/1\/ALT_J_Vol7_No1_1999_%E2%80%98Learning_matters%E2%80%99_%E2%80%90_adjusting.pdf","pdfHashValue":"fe7255890ff6afa2beec598cb7e268a180b08c08","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:286<\/identifier><datestamp>\n      2011-04-04T09:18:14Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/286\/<\/dc:relation><dc:title>\n        ‘Learning matters’ ‐ adjusting the media mix for academic advantage<\/dc:title><dc:creator>\n        Twining, Peter<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        This paper notes the move towards resource‐based and distance learning within higher education institutions and briefly describes the Open University's approach to the development of such materials. In this context the need for clear evidence of the educational effectiveness of new technologies to support learning is explored. This is illustrated by reference to a course called ‘E211 Learning Matters’, which is currently being produced at the Open University (OU). A comparison is made of student activity on a ‘traditional’ OU course and E211. This analysis is based on a theoretical model presented to Alt‐C96 by Diana Laurillard This model involves looking at the distribution of student activity in terms of ‘attending’, ‘practising’, ‘discussing’ and ‘articulating’. The outcome of the analysis supports the view that by changing the balance of media used on E211 away from paper and towards new interactive media, the quality of the course will be enhanced. However, the model is limited in that it only explicitly deals with the quantity of use of each media. The paper explores some of the implicit assumptions within the model and illustrates them with reference to E211. It also highlights ways in which changing the balance of media has been found to impact on the underlying view of learning implicit within the course.<\/dc:description><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        1999<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/286\/1\/ALT_J_Vol7_No1_1999_%E2%80%98Learning_matters%E2%80%99_%E2%80%90_adjusting.pdf<\/dc:identifier><dc:identifier>\n          Twining, Peter  (1999) ‘Learning matters’ ‐ adjusting the media mix for academic advantage.  Association for Learning Technology Journal, 7 (1).  pp. 4-11.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776990070102<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/286\/","10.1080\/0968776990070102"],"year":1999,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"'Learning matters' - adjusting the media mix for\nacademic advantage\nPeter Twining\nSchool of Education,The Open University, email: P.Twining@open.ac.uk\nThis paper notes the move towards resource-based and distance learning within higher\neducation institutions and briefly describes the Open University's approach to the\ndevelopment of such materials. In this context the need for clear evidence of the\neducational effectiveness of new technologies to support learning is explored. This is\nillustrated by reference to a course called 'E211 Learning Matters', which is currently\nbeing produced at the Open University (OU). A comparison is made of student activity on\na 'traditional' OU course and E211. This analysis is based on a theoretical model\npresented to ALT-C96 by Diana Laurillard This model involves looking at the distribution\nof student activity in terms of 'attending', 'practising', 'discussing' and 'articulating'. The\noutcome of the analysis supports the view that by changing the balance of media used on\nE211 away from paper and towards new interactive media, the quality of the course will\nbe enhanced. However, the model is limited in that it only explicitly deals with the quantity\nof use of each media. The paper explores some of the implicit assumptions within the\nmodel and illustrates them with reference to E211. It also highlights ways in which\nchanging the balance of media has been found to impact on the underlying view of\nlearning implicit within the course.\nIntroduction\nCurrent trends in higher education are towards a greater emphasis on resource-based learning,\noften in a 'distance learning' or 'supported self-study' mode. Traditionally this is how Open\nUniversity (OU) courses are transacted.\nWithin the OU the typical model is for courses to go through a 'production' phase followed by a\n'delivery' phase. During the production phase, which often lasts three years, the course\nmaterials are developed and tested. Once the course materials are completed, a course will be\npresented to one cohort of students each year for around five years. This model of production\nfollowed by delivery mitigates against changes to course materials once the production phase is\ncompleted. This means that course teams have to be totally confident about the educational\neffectiveness of their materials before the production phase ends.\n4\nAu-J Volume 7 Number I\nA 'traditional' OU course uses a range of media including print, television programmes, video,\naudio, home kits, telephone support and face-to-face sessions. Over the last twenty-eight years\nthe OU has developed considerable expertise in utilizing these media to maximum effect. Today\nnew technologies appear to offer the potential to enhance students' learning, especially in\ncontexts where it is not possible for teachers and learners to meet face-to-face. However, within\nthe OU production\/delivery model there has to be clear evidence of the educational effective-\nness of new media before a course team can take the risk of relying on it within their course.\n'E211 Learning Matters' is a course that is currently in production at the Open University. The\ncourse looks at issues relating to learning, knowledge and achievement. It has a particular focus\non the potential for new technologies to alter what we learn and how we learn it. The academic\nmembers of the course team all hold 'constructivist' views of learning and believe that by using\nnew technologies we can enhance the student learning experience. We also want to provide\nstudents with personal experience of the ways in which new technologies can alter learning.\nThus we want to make greater use of new technologies within E211 than is typical for an OU\ncourse. This is a risky approach, and when we started developing E211 we needed evidence to\nsupport our claims that incorporating a wider range of media would enhance student learning.\nThe first source of evidence that we turned to was Laurillard's Media Mix Model (Laurillard,\n1996).\nLaurillard's Media Mix Model\nAt ALT-C in 1996 Diana Laurillard presented a theoretical model (Laurillard, 1996) that\nanalysed student activity when studying using a range of different media. Laurillard's model,\nwhich she linked to her 'conversational framework' (Laurillard, 1993), identified four types of\nstudent activity that are involved in any learning situation: attending, practising, discussing and\narticulating.\nLaurillard presented an analysis of student activity with respect to media format over fifty\nhours' study on a traditional OU course. Table 1 lists the media forms featured in the study and\nFigure 1 presents an analysis of the use of these forms with respect to student activity.\nLaurillard went on to claim that by changing the balance of media one could change the balance\nMedia form Abbreviation\nPrint . Pr\nAudio vision: audio cassette plus artefacts to explore A\/V\nTelevision programme plus notes TV+\nVideo programme plus activities Video\nFace-to-face tutorials) Tut'l\nTutor-marked assignment TMA\nComputer-marked assignment CMA\nComputer tools (e.g. word processor) Ctools\nComputer resources (e.g. digital versions of reader articles) Cres\nMultimedia MM\nComputer-mediated communication (e.g. email, conferencing) CMC\nTable I: Featured media forms\n5\nPeter Twining 'Learning matters' - adjusting the media mix for academic advantage\n60\n50\n40\n30\n20\n• Articulating (Trad)\nD Discussing (Trad)\nB Practising (Trad)\nAttending (Trad)\nFigure I: Analysis of 50 hours'student study time on a traditional Oil course\no\n60\n50\n40\n30\n20\n10\n0\n• Articulating (LM)\n' • Discussing (LM)\n. Q Practising (LM)\n•Attending (LM)\nfigure 2: Analysis of the first 50 hours'student study time planned forE2l I\nof student activity and hence improve the learning situation. Collis (1996) refers to this as\n'pedagogical re-engineering'; enhancing learning by changing the balance or combination of\nthe components used.\nThe E211 course team applied Laurillard's Media Mix Model to the planned first fifty hours of\nE211 (see Figure 2). E211 was planned as an integrated set of educational activities, or what\nConole and Oliver (1998) describe as 'learning scenarios'. At this early stage in the production\nprocess we had to rely on judgements about the length of time and balance of student activity\nfor each of the learning scenarios within the course. These judgements were based on prior\n6\nAtr-J Volume 7 Number I\n35\nTraditional\nCourse\nLearning Matters\nAttending Practising Discussing Articulating\nfigure 3: Comparison of student activity on a traditional Oil course and El 11\nexperience of similar learning scenarios and comparisons with the balance of student activity\nthat Laurillard's model suggests for each media type.\nThis analysis of the amount of time students spend engaged in each of the four types of activity\non a traditional OU course and the planned E211 indicated that for E211 the amount of (i)\nattending would be reduced, (ii) practising would be increased, (iii) discussing would be\nincreased, and (iv) articulating would be increased (see Figure 3).\nThus, from a constructivist viewpoint, this analysis suggested that the plan to reduce the amount\nof print material on E211 and replace it with learning scenarios that made use of information\nand communication technology (ICT) would provide a better balance of student activity than a\ntraditional OU course.\nThe course team then went on to develop E211 further. This included initial testing of each of\nthe multimedia components in isolation, followed by developmental testing of the first 50 hours\nof the course as a whole. This latter evaluation involved a group of 20 students and one tutor\nworking through the first 50 hours of E211 as if they were actually taking the course. The\noutcomes of this developmental testing suggested that changing the balance of media in the way\nthat we had done had a miich more dramatic effect on the student learning experience than our\ntheoretical analysis had indicated. It thus highlighted some limitations of the Media Mix Model.\nLimitations of the Media Mix Model\nThe limitations of Laurillard's Media Mix Model are discussed in terms of how the model\nsimplifies real-world experience, the need to address the integration of the use of different\nforms of media, and changes in pedagogy.\nSimplification\nAs one might expect, Laurillard's Media Mix Model is a simplification of the real situation. For\nexample, the percentage of time that a student spends in each of the four modes of activity could\n7\nPeter Twining 'Learning matters' - adjusting the media mix for academic advantage\nvaiy considerably within each of the media. Thus, the term multimedia is used to describe a\nwide variety of different types of applications. This includes using multimedia to deliver\ncontent to students as well as using multimedia to allow students to explore dynamic models.\nThe former would involve significantly more 'attending' than the latter. Heppell (1998) makes\nthis same point about the different ways in which media can be used with reference to the Web\nwhen he draws out the distinction between ICT and IDT (information dissemination\ntechnology).\nIn addition, the balance of student activity when undertaking any learning scenario is\ndetermined by an interaction between the learner and that learning scenario. Squires and\nMcDougall's 'Perspectives Interactions Paradigm' (1994), which was developed as a tool for\nevaluating educational software, highlights the importance of such interactions. Thus, for\nexample, OU texts often include self-assessment questions (SAQs), which are intended to\nengage the student in what the Media Mix Model describes as 'practising' (i.e. rehearsing their\nunderstanding of the material being covered). However, if a student chooses to skip over the\nSAQs then the balance of activity that they are engaged in will not be as predicted in the model.\nIntegration\nThe Media Mix Model says nothing explicitly about the ways in which the different media need\nto be integrated. This seems likely to have a significant impact on the effectiveness of the\ncourse overall. As Laurillard (1994) has pointed out, 'individual media do not easily support all\nthe aspects of the learning process' (p. 7), and 'that is why each medium has to be used in the\ncontext of its integration with any of the others that can complement the support it provides'\n(p. 16).\nThus, implicit within this Media Mix Model is an assumption that the different media will be\nused in areas where their particular strengths match the learning objectives and where they can\ncomplement and enhance the other media being used. This is illustrated in Table 2 with\nreference to our use of media on E211.\nIn this sequence of learning scenarios there is a close interlinking of the objectives of each of\nthe scenarios. In addition, the media used were selected on the basis of their individual strengths\nand the need to compensate for weaknesses in the other media. For example, paper is used to\ndeliver 'content' to the students (Learning Scenarios 9 and 10) but electronic versions of the\nreader articles are provided so that students can search for particular text, annotate sections and\nmake links to relevant portions from their hypermedia note-taking tool. Multimedia is used to\nencourage the students to reflect on their own understanding of the knowledge domain being\nstudied (Learning Scenarios 7 and 12). However, to enhance the level of feedback and meta-\ncognition that the multimedia can support, computer-mediated communication is utilized\n(Learning Scenarios 8 and 13). In order to enhance the effectiveness of the computer\nconferencing (Learning Scenario 13), the students first meet face-to-face (Learning Scenario\n11). This face-to-face session also allows students to share and explore in some depth their\nunderstandings of the Reader Articles (Learning Scenarios 9 and 10).\nChanging pedagogy\nThe Media Mix Model says nothing about the impact of altering the media mix on the implicit\nmodel of learning that the course materials engender. As highlighted above, the technology does\nnot determine the way in which it is used (Mackay, 1995; Conole and Oliver, 1998); any one\ntechnology can support a variety of models of learning. However, we would argue that changing\n8\nLearning scenario Medium\n7: The Trunk RickThrough Multimedia\n8: Email re\nLearning Scenario 7\n9& 10: Reader\nArticles I & 2\n11: Tutorial\nCMC\nPaper\nFace-to-face\n12: The Trunk Sort Multimedia\n13: Conference re\nLearning Scenario 12\nCMC\nl4:Tutor-marked\nAssignment\nCTools\nDescription\nThis is an exploratory learning scenario where the students are\npresented with a range of'media artefacts' belonging to Bob McCormick\n(a member of the learning Matters' course team). They are asked to\nexplore the artefacts and select the five that they think tell them the\nmost about Bob as a learner.\nThey are expected to make notes about why they chose those five\nitems.\nThe students share the items they selected in Learning Scenarios 7 and\ntheir reasons for their selections in groups of 3, via email. A t this early\nstage in the course they are not expected to enter into in-depth\ndiscussions electronically.\nThe students read the Reader Articles, which address aspects of\n•knowledge', 'learning' and 'achievement'. The students are asked to\ncreate a set of notes that relate their views of'knowledge', \"learning1 and\n'achievement'from Learning Scenarios 7 and 8 to the views expressed in\nthe Reader Articles.\nThis will be the first time the students and tutors will have met face-to-\nface (at least in relation to the course!). The aims of the tutorial are:\n• to help students build relationships with each other and with their\ntutor in order to facilitate future computer conferencing (e.g. in\nLearning Scenario 13);\n• to extend students' thinking about learning, knowledge and\nachievement and the concept of a'setting' (i.e. to extend work done\nduring Learning Scenarios 7 to 10).\nThe activities in the tutorial will include: working in the same groups of\nthree that shared emails in Learning Scenarios 8 and discussing the\nsimilarities and differences between the choices they made in Learning\nScenarios 7 and their reasons for them.\nThe students are presented with a subset of the herns that they\nexplored in Learning Scenario 7. The software takes them through a\nseries of progressively more refined sorting activities: they are asked t o\nfocus on categories relating to learning, knowledge and achievement As\nthe students move further into the program more options are made\navailable. Throughout the learning scenario the students' ideas (as\nrevealed by the ways in which they classify the objects) are used to\nextend their thinking further by reflecting it back to them in a variety of\nways.\nThe outcomes from The Trunk Sort are output in a format that the\nstudents can annotate (using the dedicated hypermedia software which\nthey use throughout the course for taking notes, writing assignments,\nannotating media objects, etc.).\nThe students share the outcomes from Learning Scenario 12 via a\ncomputer conference. Using the 'Learning Matters' hypermedia soft-\nware the students can look a t\n• the categories other students used;\n• how other students assigned items to each category;\n• other students'annotations on the above.\nThe aim of this learning scenario is to extend the feedback that the\nstudents receive and to help them further develop their ideas through\ndiscussion with other students (moderated by their tutor).\nThe students create a hypermedia 'essay1 using the 'Learning Matters'\nhypermedia software, which allows them to make links to the digital\nresources used in the Trunk, as well as to sections of the Reader Articles\nthat are supplied to them in electronic form on the course CD ROM,\nand to any notes they have made in digital format during previous\nactivities.\nTable 2: Integration of media on'E2l I Learning Matters'\nPeter Twining 'Learning matters' - adjusting the media mix for academic advantage\nthe balance of student activity does necessarily lead to changes in the implicit underlying\neducational model that is operating. We found during the developmental testing of E211 that\naltering the balance of media in the way that we had done led to the following changes:\n• The balance of content vs. process was changed. Within a traditional OU course there is a\nsubstantial emphasis on providing students with content and this is not the case for E211.\n• Roles of both the tutors and the students were changed. Within the context of the computer\nconferences it is not possible for a tutor to respond to all of the students' messages. The\ntutor's role becomes that of 'facilitator of peer tutoring' rather than that of 'provider of\nanswers'. Thus the students very often become the 'teachers' as well as being the 'learners'.\n• Recognized sources of expertise were changed. Alongside the move towards more peer\ntutoring there is a move away from the course tutor being seen as 'the expert'. Alternative\nsources of expertise are available both in the form of other students and in the form of other\nexperts on the internet.\n• Students moved away from individual working and towards co-operative and collaborative\nworking.\nAll these moves involved the students (and tutors) acquiring new skills. These included, for\nexample:\n• new technical skills, in terms of knowing how to operate the software;\n• new social and learning skills, such as peer tutoring and collaborative working;\n• new intellectual skills, such as how to find and evaluate information and how to represent\ntheir knowledge and understanding in a hypermedia format.\nThese changes have meant that we are having to devise new ways of assessing the students on\nE211. After all, if we require students to develop new skills we need to adjust pur assessment in\norder to take these skills into account. This raises a vast number of issues. For example, how do\nyou assess process skills (at a distance) and what criteria should be used for evaluating students'\nhypermedia presentations?\nConclusion\nFrom a theoretical perspective Laurillard's Media Mix Model does provide support for the view\nthat altering the mix of media within a course can enhance the student learning experience, from\na constructivist perspective. However, this assumes that one is using the media in ways that\ndraw on the strengths of each individual medium and that the media are closely integrated so\nthat they complement and enhance each other.\nIt is important to note that the Media Mix Model is at best a simplification of the real situation\nin that it assumes that one can assign a balance of student activity for each media type across a\ncourse. In reality, the proportion of time that a student spends in each of the four modes of\nactivity can vary considerably within each media type. This is dependent not only on how the\nmedia are incorporated within a learning scenario but also on the way in which a student\ninteracts with that scenario. Thus the balance of student activity within any one media type is\nlikely to vary across learning scenarios and students, and is thus not easy to predict accurately in\nthe way that the Media Mix Model implies.\n10\nAu-J Volume 7 Number I\nIn addition, it needs to be recognized that altering the balance of student activity within a course\nsignificantly impacts on many, if not all, other aspects of the learning transaction. It changes the\nunderlying model of learning that is implicit within the course. This needs to be recognized\nfrom the outset if student learning is to be maximized.\nReferences\nCollis, B. (1996), Tele-learning in a Digital World: The Future of Distance Learning, London:\nInternational Thomson Computer Press.\nConole, G. and Oliver, M. (1998), 'A pedagogical framework for embedding C and IT into the\ncurriculum', ALT-J, 6 (2), 4-16.\nHeppell, S. (1998), 'Student revolution', educ@guardian (the information and communication\ntechnology in education supplement in the UK's national Guardian newspaper), June 1998 and\nat http:\/\/www.ultralab.anglia.ac.uk\/pages\/recent_papers\/student_revolution.html.\nLaurillard, D. (1993), Rethinking University Teaching: A Framework for the Effective Use of\nEducational Technology, London: Routledge.\nLaurillard, D. (1994), Balancing the Media, PLUM Report No. 23, Milton Keynes: The Open\nUniversity.\nLaurillard, D. (1996,), 'How should UK Higher Education make best use of new technology?',\nkeynote speech ALT-C 1996, Glasgow.\nMackay, H. (1995), 'Theorising the IT\/Society Relationship', in Heap, N., Thomas, R., Einon,\nG., Mason, R. and Mackay, H., Information Technology in Society, London: Sage Publications,\n41-53.\nSquires, D. and McDougall, A. (1994), Choosing and Using Educational Software: A Teacher's\nGuide, London: Falmer Press.\nI I\n"}