{"doi":"10.1007\/978-90-481-3594-3_4","coreId":"65209","oai":"oai:dro.dur.ac.uk.OAI2:6522","identifiers":["oai:dro.dur.ac.uk.OAI2:6522","10.1007\/978-90-481-3594-3_4"],"title":"Critical interrelations between ICT and electricity system.","authors":["Bialek,  J. W."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":["Lukszo,  Z.","Deconinck,  G.","Weijnen,  M. P. C"],"datePublished":"2010-01-01","abstract":"The widespread blackouts of 2003 have exposed the critical role of ICT systems in maintaining reliable operation of power systems. Fundamental errors in providing back-up and alarm function in the control room were one of the main contributing factors to the 2003 USA\/Canada blackout. The lack of proper ICT infrastructure to enable proper communication and cooperation between system operators in Italy and Switzerland led to delayed remedial actions and the consequent blackout of Italy in 2003. Improved ICT systems would enable a better real-time cooperation and coordination between utilities in an interconnected power system but the main challenge is political: overcoming resistance of individual utilities to give up partially their interdependence and operate within the paradigm of a distributed, but coordinated, control. Emergence of GPS-synchronised Wide Area Measurement Systems (WAMS) holds a great promise for improved monitoring and control of modern power systems and therefore avoiding future blackouts","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65209.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/6522\/1\/6522.pdf","pdfHashValue":"6a435a0d07a5eed823627001bc51e5f8353b6332","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:6522<\/identifier><datestamp>\n      2011-12-13T15:53:32Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Critical interrelations between ICT and electricity system.<\/dc:title><dc:creator>\n        Bialek,  J. W.<\/dc:creator><dc:description>\n        The widespread blackouts of 2003 have exposed the critical role of ICT systems in maintaining reliable operation of power systems. Fundamental errors in providing back-up and alarm function in the control room were one of the main contributing factors to the 2003 USA\/Canada blackout. The lack of proper ICT infrastructure to enable proper communication and cooperation between system operators in Italy and Switzerland led to delayed remedial actions and the consequent blackout of Italy in 2003. Improved ICT systems would enable a better real-time cooperation and coordination between utilities in an interconnected power system but the main challenge is political: overcoming resistance of individual utilities to give up partially their interdependence and operate within the paradigm of a distributed, but coordinated, control. Emergence of GPS-synchronised Wide Area Measurement Systems (WAMS) holds a great promise for improved monitoring and control of modern power systems and therefore avoiding future blackouts. <\/dc:description><dc:subject>\n        WAMS<\/dc:subject><dc:subject>\n         power\/ICT interdependencies<\/dc:subject><dc:subject>\n         North-American and Italian blackout.<\/dc:subject><dc:publisher>\n        Springer<\/dc:publisher><dc:source>\n        Lukszo,  Z. & Deconinck,  G. & Weijnen,  M. P. C (Eds.). (2010). Securing electricity supply in the cyber age : exploring the risks of Information and communication technology in tomorrow's electricity infrastructure. : Springer, pp. 53-70, Topics in safety, risk, reliability and quality(15)<\/dc:source><dc:contributor>\n        Lukszo,  Z.<\/dc:contributor><dc:contributor>\n        Deconinck,  G.<\/dc:contributor><dc:contributor>\n        Weijnen,  M. P. C<\/dc:contributor><dc:date>\n        2010-01-01<\/dc:date><dc:type>\n        Book chapter<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:6522<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6522\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1007\/978-90-481-3594-3_4<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6522\/1\/6522.pdf<\/dc:identifier><dc:rights>\n        The original publication is available at www.springerlink.com<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":["WAMS","power\/ICT interdependencies","North-American and Italian blackout."],"subject":["Book chapter","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n11 March 2010\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nBialek, J. W. (2010) ’Critical interrelations between ICT and electricity system.’, in Securing electricity supply\nin the cyber age : exploring the risks of Information and communication technology in tomorrow’s electricity\ninfrastructure. , pp. 53-70. Topics in safety, risk, reliability and quality. (15).\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1007\/978-90-481-3594-34\nPublisher’s copyright statement:\nThe original publication is available at www.springerlink.com\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \n \nDurham Research Online \n \nDeposited in DRO: \n11 March 2010 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status: \nAccepted for publication version \n \nCitation for published item: \nBialek, J. W. (2010) 'Critical interrelations between ICT and electricity system.', in Securing \nelectricity supply in the cyber age : exploring the risks of Information and communication \ntechnology in tomorrow's electricity infrastructure. , pp. 53-70. Topics in safety, risk, reliability \nand quality. (15). \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1007\/978-90-481-3594-3_4 \n \nPublisher’s copyright statement: \nThe original publication is available at www.springerlink.com \n \n \n \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \n―Securing Electricity Supply in the Cyber Age‖ \nEdited by Z. Lukszo, G. Deconinck and M. P. C. Weijnen \nSpringer 2010 \nISBN 978-90-481-3593-6 \nCRITICAL INTERRELATIONS BETWEEN \nICT AND ELECTRICITY SYSTEM \n \nJanusz W. Bialek \nInstitute for Energy Systems, School of Engineering \nThe University of Edinburgh, UK \nEmail: Janusz.Bialek@ed.ac.uk \n \nAbstract    \nThe widespread blackouts of 2003 have exposed the critical role of ICT systems in \nmaintaining reliable operation of power systems. Fundamental errors in providing \nback-up and alarm function in the control room were one of the main contributing \nfactors to the 2003 USA\/Canada blackout. The lack of proper ICT infrastructure to \nenable proper communication and cooperation between System Operators in Italy \nand Switzerland led to delayed remedial actions and the consequent blackout of It-\naly in 2003. Improved ICT systems would enable a better real-time cooperation \nand coordination between utilities in an interconnected power system but the main \nchallenge is political: overcoming resistance of individual utilities to give up par-\ntially their interdependence and operate within the paradigm of a distributed, but \ncoordinated, control. Emergence of GPS-synchronised Wide Area Measurement \nSystems (WAMS) holds a great promise for improved monitoring and control of \nmodern power systems and therefore avoiding future blackouts. \n1 Introduction \nModern power systems are highly complicated, dynamic, non-linear, time-\ncritical, and covering large geographic areas. In addition, reliable operation of the \npower grid is complex and demanding for two main reasons: \n As electricity flows at almost the speed of light and it cannot be stored \neconomically at large quantities, its production must follow consumption \n2  \non minute-by-minute basis. Any discrepancy between production and \nconsumption will be absorbed by kinetic energy of all rotating generators \nresulting in  their increased or reduced speed. \n The flow of electricity in a meshed network is governed by the laws of \nphysics and cannot be directly controlled1. In order to avoid overloading \nof transmission lines, System Operators (SOs) must have ability to adjust \noutput of generators (or consumption of loads) in certain locations. \nAll those reasons mean that monitoring and control of modern power systems \nrequires advanced ICT systems.  Any problems with ICT systems may have grave \nconsequences for security of supply. This paper will discuss two aspects of critical \ninterrelations between ICT and electricity systems. Firstly we will illustrate this \ncriticality by discussing how inappropriate ICT systems contributed to widespread \nblackouts in USA\/Canada and Italy in 2003. Then we will discuss the potential of \nGPS-synchronised Wide Area Measurement Systems (WAMS) in preventing \npower system blackouts. \n2 ICT systems and blackouts \nThe critical dependence of electricity supply systems on ICT systems has been \nmost vividly demonstrated during a number of blackouts that occurred in recent \nyears. There were 6 blackouts within 6 weeks in the late summer of 2003 affecting \nabout 112 million people in US, UK, Denmark, Sweden and Italy.  They were all \ntransmission-based, i.e. there were no problems at the time with the level of gen-\neration. The systems were not stressed before the blackouts occurred – in Italy the \nblackout even happened at night. Obviously the direct reasons for the blackouts \nwere purely electrical (short-circuits) but one of the reasons the blackouts spread \nso widely was the inadequate provision of ICT systems. This point will be de-\nscribed in more detail using the example of the USA\/Canada and Italia blackouts. \nThe attention will be concentrated not on the blackouts themselves but rather on \nhow inadequate provision of ICT system has exasperated the situation. Please re-\nfer to Appendix A for explanation how security of an interconnected power sys-\ntem is maintained and to [2] for more details on blackouts of 2003.  \n2.1 US blackout on 14 August 2003 \nThe blackout was triggered by some initial innocuous-looking outages in \nnorthern Ohio, which spread to the North East of USA and parts of Canada. 62 \nGW were lost, about 50 million people were affected, full restoration took several \n                                                          \n1 Power flows can be controlled to some extent by so-called  Flexible AC Transmission System \n(FACTS) devices but they are still too expensive for general use. \n3 \ndays. The blackout description below contains extended excerpts from the final \nreport [1] \n2.1.1 The course of events \nFigure 1 shows the geographical area and the control areas in the area where \nthe blackout started. It is important to note that the events involved directly 6 con-\ntrol areas, which shows the importance of proper communication and coordination \nbetween System Operators. The disturbances started in northern Ohio controlled \nby FirstEnergy (FE) – see Figure 1.  \nAt 14:02 EDT, Dayton Power & Light’s (DPL) Stuart-Atlanta 345-kV line (see \nFigure 1) tripped off-line due to a tree flashover2. This line had no direct electrical \neffect on FE’s system—but it did affect Midwest Independent System Operator \n(MISO) performance as reliability coordinator, even though PJM is the reliability \ncoordinator for the DPL line3. One of MISO’s primary system condition evalua-\ntion tools, its state estimator, was unable to assess system conditions for most of \nthe period between 12:37 EDT and 15:34 EDT, due to a combination of human er-\nror and the effect of the loss of DPL’s Stuart-Atlanta line on other MISO lines as \nreflected in the state estimator’s calculations. Without an effective state estimator, \nMISO was unable to perform contingency analyses of generation and line losses \nwithin its reliability zone. Therefore, through 15:34 EDT MISO could not deter-\nmine that with an earlier trip of Eastlake 5 power station in Cleveland, other \ntransmission lines would overload if FE lost a major transmission line, and could \nnot issue appropriate warnings and operational instructions.  \n \n                                                          \n2 Flow of current causes transmission lines to heat and sag. If trees growing underneath are not cut \nin time, a flashover may occur. \n3 See Appendix A for explanations about reliability of interconnected power systems, state estima-\ntion, SCADA systems, etc. \n4  \n \nFigure 1  The area of blackout origination [1] \nStarting around 14:14 EDT, FE’s control room operators lost the alarm func-\ntion that provided audible and visual indications when a significant piece of \nequipment changed from an acceptable to problematic condition. Shortly thereaf-\nter, the Energy Management System (EMS) system lost a number of its remote \ncontrol consoles. Next it lost the primary server computer that was hosting the \nalarm function, and then the backup server such that all functions that were being \nsupported on these servers were stopped at 14:54 EDT. However, for over an hour \nno one in FE’s control room grasped that their computer systems were not operat-\ning properly, even though FE’s Information Technology support staff knew of the \nproblems and were working to solve them, and the absence of alarms and other \nsymptoms offered many clues to the operators of the EMS system’s impaired \nstate. Thus, without a functioning  EMS or the knowledge that it had failed, FE’s \nsystem operators remained unaware that their electrical system condition was be-\nginning to degrade. Unknowingly, they used the outdated system condition infor-\nmation they did have to discount information from others about growing system \nproblems. \nFrom 15:05:41 EDT to 15:41:35 EDT, three 345-kV lines tripped in Cleveland \narea at 43.5%, 87.5% and 93.2%, respectively, of their normal and emergency line \nrating. As each of the transmission lines failed, power flows shifted to other \ntransmission paths increasing their loading and resulting in further trips. Addition-\nally, voltages on the rest of FE’s system degraded further. \n5 \n \nFigure 2  Overview of power flows during the blackout [1]. \nAs each of FE’s 345-kV lines in the Cleveland area tripped out, it increased \nloading and decreased voltage on the underlying 138-kV system serving Cleve-\nland and Akron, pushing those lines into overload. Starting at 15:39 EDT, the first \nof an eventual sixteen 138-kV lines began to fail. As these lines failed, the result-\ning voltage drops caused a number of large industrial customers with voltage-\nsensitive equipment to go off-line automatically to protect their operations. As the \n6  \n138-kV lines tripped out, they blacked out customers in Akron and the areas west \nand south of the city, ultimately dropping about 600 MW of load. \nThe collapse of FE’s transmission system induced unplanned power surges \nacross the region. Shortly before the collapse, large electricity flows were moving \nacross FE’s system from generators in the south (Tennessee, Kentucky, Missouri) \nto load centers in northern Ohio, eastern Michigan, and Ontario – see Figure 2.1. \nThis pathway in northeastern Ohio became unavailable with the collapse of FE’s \ntransmission system. The electricity then took alternative paths to the load centres \nlocated along the shore of Lake Erie – see Figure 2.2. Power surged in from west-\nern Ohio and Indiana on one side and from Pennsylvania through New York and \nOntario around the northern side of Lake Erie. Transmission lines in these areas, \nhowever, were already heavily loaded with normal flows, and some of them began \nto trip. \nThe northeast then separated from the rest of the Eastern Interconnection due to \nthese additional power surges. The power surges resulting from the FE system \nfailures caused lines in neighbouring areas to see overloads that caused impedance \nrelays to operate4. The result was a wave of line trips through western Ohio that \nseparated AEP from FE - - Figure 2.3. Then the line trips progressed northward in-\nto Michigan separating western and eastern Michigan - - Figure 2.4. With paths \ncut from the west, a massive power surge flowed from PJM into New York and \nOntario in a counter-clockwise flow around Lake Erie to serve the load still con-\nnected in eastern Michigan and northern Ohio - - Figure 2.4. Power flow from On-\ntario into Detroit suddenly changed direction and a period of sustained oscillations \nensued indicating system instability. The impedance relays on the lines between \nPJM and New York saw the massive power surge as faults and tripped those lines. \nLines in western Ontario also became overloaded and tripped - - Figure 2.5 and \nFigure 2.6. The entire northeastern United States and the province of Ontario then \nbecame a large electrical island separated from the rest of the Eastern Interconnec-\ntion -- Figure 2.7. This large island, which had been importing power prior to the \ncascade, quickly became unstable as there was not sufficient generation in opera-\ntion within it to meet electricity demand. Systems to the south and west of the \nsplit, such as PJM, AEP and others further away remained intact and were mostly \nunaffected by the outage. Once the northeast split from the rest of the Eastern In-\nterconnection, the cascade was isolated. \n2.1.2 Criticality of ICT systems for the USA\/Canada blackout \nThe most critical issue from the point of view of ICT systems was that during \nthe crucial hour when transmission lines started to trip, the operators at FE control \nroom were unaware of what was going on in their systems. Not only there were \nunaware of the situation but that did not know that they were unaware. It is quite \n                                                          \n4 Impedance relay trips a transmission line when its load exceeds a pre-set val-\nue. \n7 \nlikely that had they known, they could have taken actions to avert the fast-\nspreading blackout. It is important to emphasise that time-criticality is essential for \npreventing blackouts. This is illustrated in Figure 3 which shows the number of \nsystem elements that tripped during the blackout. Once a cascade starts, it is next \nto impossible to stop it. \n \nFigure 3 Speed of blackout spreading [1] \nThe report [1] identified a number of causes of the blackout and they were also \nreviewed in [2]. Below we quote the causes [1] that directly relate to ICT systems \n: \n FE lacked procedures to ensure that their operators were continually aware of \nthe functional state of their critical monitoring tools.  \n FE lacked procedures to test effectively the functional state of these tools af-\nter repairs were made.  \n FE did not have additional monitoring tools for high-level visualization of the \nstatus of their transmission system to facilitate its operators’ understanding of \ntransmission system conditions after the failure of their primary monitor-\ning\/alarming systems.  \n MISO did not have real-time data from Dayton Power and Light’s Stuart-\nAtlanta 345-kV line incorporated into its state estimator (a system monitoring \ntool). This precluded MISO from becoming aware of FE’s system problems \nearlier and providing diagnostic assistance to FE.  \n MISO’s reliability coordinators were using non-real-time data to support real-\ntime ―flowgate‖ monitoring. This prevented MISO from detecting an N-1 se-\n8  \ncurity violation in FE’s system and from assisting FE in necessary relief ac-\ntions.  \n MISO lacked an effective means of identifying the location and significance \nof transmission line breaker operations reported by their Energy Management \nSystem (EMS). Such information would have enabled MISO operators to be-\ncome aware earlier of important line outages. PJM and MISO lacked joint \nprocedures or guidelines on when and how to coordinate a security limit vi-\nolation observed by one of them in the other’s area due to a contingency near \ntheir common boundary.  \n2.2 Italian blackout on 28 September 2003. \nThe blackout happened at 3 am when Italy was importing 6651 MW from \nFrance, Switzerland, Austria and Slovenia [3]. The import constituted about 24% \nof total demand and was about 300 MW above the agreed import level. The pat-\ntern of flows into Italy through the tie-lines depends on the overall generation pat-\ntern in surrounding countries. At the time, the Swiss transmission grid was highly \nstressed operating close to (N-1) security criterion however the Italian System Op-\nerator (SO) was not aware of it. The high usage of Swiss grid by imports to Italy \nwas difficult to control by the Swiss operator by its own means. \n2.2.1 The course of events \nAt 3.01 am a tree flashover tripped an overhead 380 kV Mettlen-Lavorgo line \nin Switzerland – see Figure 4. At the time the loading on the line was about 86% \nof its maximum capacity and the flashover was probably caused by insufficient \ndistance of the tree from the conductors. An attempt was made to reclose the line \nbut it was unsuccessful due to a too high phase angle difference (42\no\n) resulting \nfrom a high power flow to Italy. The load carried by the tripped line was taken \nover by other parallel lines and resulted in overloading by 10% of another 380 kV \nline Sils-Soazza – see Figure 4. According to operating standards the line load \nshould have been relieved within 15 minutes to prevent automatic disconnection. \nThe Swiss operator, ETRANS, telephoned the Italian operator GRTN at 3.11 \nam and requested reduction of imports by 300 MW to the previously agreed le-\nvels. According to ETRANS, they have also informed GRTN about the line out-\nage but this claim is disputed by GRTN. GRTN reduced import at 3.21 am by \nshutting down pumps at pumped-storage plants but this, together with some inter-\nnal countermeasures undertaken within the Swiss system, was not sufficient and at \n3.25 am, i.e. 24 minutes after the first line tripped, the overloaded Sils-Soazza line \nsagged and tripped after a tree flashover. From this moment on, a severe system \nfailure was inevitable. Loss of the second import line resulted in a severe overload \nof other import lines and the third line (Airolo-Mettlen) tripped after 4 seconds. \n9 \nAdditionally, Italy lost synchronism with the rest of UCTE (loss of angle stability) \nand the remaining import lines tripped almost instantaneously isolating Italy from \nthe rest of Europe at 3.25 am. Quite importantly, the dynamic interaction between \nthe Italy and rest of UCTE main grid during the last seconds before separation led \nto a fast voltage collapse in Italy. Following islanding of Italy, the internal genera-\ntion deficit was about 6.4 GW and frequency started to fall. Although about 10 \nGW of load was shed by automatic under-frequency load shedding, it proved inef-\nfective as 21 out of 50 thermal plants were tripped due to low voltage even before \nfrequency reached 47.5 Hz. Consequently the whole Italy, apart from Sardinia, \nwas blacked out 2 minutes and 30 seconds after separation.  \n \n \nFigure 4. Italian blackout and its timeline [3]. \nFollowing separation of Italy, the rest of UCTE network was also in a danger-\nous position. Frequency quickly increased to 50.25 Hz, significant power fluctua-\ntions were recorded and the European power flows took an unpredicted pattern. \nSome generating units were tripped by over-frequency or under-voltage relays.  \nLoading of lines from France to Germany and Belgium increased significantly. \nHowever the system operators took various emergency actions so that further \nspreading of blackouts was avoided. \n2.2.2 Criticality of ICT systems for the Italian blackout  \nSimilarly as it was the case with the US blackout, the real underlying reason for \nsuch a widespread blackout was insufficient coordination of real-time security as-\nsessment and control between the Swiss and Italian System Operators. Additional-\nly Italian system operator was unaware of the overall load flow situation in Europe \n10  \nand the resulting consequences for Italy. Proper ICT systems would have made \nexchange of real-time information possible and could have prevented the blackout. \nThe report [3] also concluded that in Europe, where the network is highly \nmeshed and stability problems never appeared to be so critical, power system sta-\nbility must be thoroughly analysed - even in the case of N-2 contingencies. This \nwill require deeper stability analyses, in order to identify possible conditions lead-\ning to stability problems and to define suitable countermeasures if necessary. Such \nsystem-wide stability analyses would require a continent-wide comprehensive ICT \nsystem. \n2.3 Need for coordination of operation in interconnected power \nsystems \nOne of the main problems with cross-border trades in an interconnected power \nsystem is that trades do not travel according to \"contract paths\" agreed between \nthe seller and the buyer but rather they flow over many transmission lines, as de-\ntermined by Kirchhoff's and Ohm's laws. This is referred to as a parallel, or loop-\nflow, effect. Consequently utilities find their networks loaded with power transfers \nthey have little idea about. Figure 5 shows different routes through which an as-\nsumed 1000 MW trade between Northern France and Italy would flow [4]. Only \n38% of power would flow directly from France to Italy; the remaining 62% would \nflow through different parallel routes loading the transit networks. Note that 15% \nof power would even flow in a round way via Belgium and Netherlands.  \n \n \nFigure 5. Percentage shares through different transit routes for a trade from northern France to It-\naly [4]. \n11 \nParallel flows did not cause major problems pre 1990, as inter-area exchanges \nwere usually agreed well in advance by the system operators and were relatively \nsmall. Post 1990, inter-area trades have not only increased significantly in volume, \nbut they also started to be arranged by independent agents, rather than system op-\nerators. The result is illustrated in Figure 6 which shows that a large proportion of \nflows on the Belgian grid in 1999 was unexpected by the Belgian system operator. \nThat situation led to a few nearly avoided blackouts in Belgium in 1990s. \nA similar parallel flow effect was one of the main factors contributing to US \nand Italian blackouts. In the case of US, as the existing transmission corridors \nwere increasingly blocked by lines tripping off, power to supply northern Ohio \nand Ontario had to find alternative ways and did so through neighbouring utilities \n(Michigan, PJM and New York) – see Figure 2. The relevant system operators \nsuddenly saw huge increases in power transfers through their territories but they \ndid not know what caused them and could do little about them.  \n \n \nFigure 6. Expected and unidentified flows through Belgian grid [5].  \nIn the case of Italian blackout, transfers through Switzerland to Italy depended \non the overall pattern of generation in surrounding countries. Although some of \nSwiss lines were operating close to their limits, Swiss operators could do little to \nrelieve them.  \nProper accounting for parallel flows is difficult enough in operational planning \nstages. In emergencies, when power system topology may be different to the as-\nsumed one and some power stations may be lost, proper accounting for parallel \nflows would require real-time security monitoring and automatic exchange of in-\nformation between SOs, rather than telephone-based coordination. \nProper coordination between System Operators in an interconnected power sys-\ntem would require a overcoming a number of technical, political and organisation \nchallenges [6]. The best way forward would be to change the paradigm of opera-\ntion from the existing decentralised to the coordinated one in which each SO \nwould still look after its own area in day-to-day operation and planning but neces-\nsary coordination would be required for system-wide security assessment and con-\n12  \ntrol purposes. To do that information would have to be exchanged to assess the \nimpact of planned trades and outages on all the areas involved or, in other words, \nto assess accurately all the parallel flows in both operational planning and real-\ntime operation stages. Furthermore, real-time coordinated security assessment \nwould be needed to assess the impact of any contingencies on the whole intercon-\nnected network. Obviously this would require advanced ICT systems. The next \nstep would be coordinated reaction to contingencies. When each SO defends itself \nagainst a contingency without taking into account the big picture, the results may \nbe detrimental for the system as the whole. The next important problem is deter-\nmination of who, and how much, should pay for the reliability-connected actions. \nDevelopment of ICT system to support such a mode of operation is a technical \nchallenge but one which can be relatively easily overcome as the underlying tech-\nnology is readily available. The main challenge is political: overcoming resistance \nof individual utilities to give up partially their interdependence and operate within \nthe paradigm of a distributed, but coordinated, control.  One of the other main \nproblems with increased coordination is the necessity to exchange operational in-\nformation about each control area. Such information could be deemed to be com-\nmercially sensitive so the SOs would be reluctant to share it. Traditional load-flow \nor stability programs require detailed information about generation and demand \nprofiles at each node but for proposed coordinated operation and control exchange \nof full individual nodal profiles is not needed. The important thing is to asses the \nsystem-wide impact of situation in each control area. Further research is needed to \nestablish what type of information is necessary to be exchanged, and in what way, \nin order to perform system-wide security assessment and control whilst which in-\nformation can be deemed to be left as private to individual SOs. Following that, \nappropriate organisational structures would have to be established. There may be a \nneed to establish a single body charged with maintaining real-time security of the \nwhole interconnected system. \nThe need for improved coordination between utilities has been clearly recog-\nnised by the industry. The situation has improved over the last few years with es-\ntablishment of Electric Reliability Organisation in the USA in 2005 and a number \nof initiatives undertaken by UCTE. However there is still a long way to achieve a \nproper real-time cooperation between utilities. \n3 Preventing blackouts: Wide Area Measurement Systems \n(WAMS) \nUtilities rely on SCADA systems for operational monitoring of their systems – \nsee Appendix – but SCADA systems have some serious shortcomings. Firstly \nSCADA relies on the state estimator to obtain an estimate of the exact system to-\npology, power flows and voltages. However all known state estimation algorithms \nhave shortcomings especially with regard to bad data identification and robustness \n13 \n[7]. Bad measurements, especially incorrect switch statues, may result in large er-\nrors in the estimation results. The periods of measurements in a SCADA scan are \nnot synchronous causing significant time skew errors. All those errors may se-\nriously affect power system security evaluation by SO.   \nThe wave of power system blackouts in 2003 has provided an impetus to de-\nvelopment of monitoring systems based on GPS-synchronised measurement tech-\nnology referred to as Wide Area Measurement Systems – see Appendix B for \ntechnological details. Time-synchronised Phasor Measurement Units (PMUs) in-\ntroduce the possibility of directly measuring the system state (i.e. voltage magni-\ntudes and their angles) rather than estimating it based on system models and tele-\nmetry data.  As measurements are tracked 20 to 60 times per second, PMUs can \ntrack system dynamics in real time. WAMS systems have a wide area of applica-\ntions in monitoring and control [8] but here we will concentrate on the applica-\ntions regarding prevention of blackouts.  \nDue to their accuracy and wide area coverage, WAMS may enable early warn-\ning systems to detect conditions that lead to catastrophic events, help, with restora-\ntion and improve the quality of data for event analysis. It is worth noting here that \nit took several months to gather information from different measurement stations \nfollowing the 2003 USA\/Canada blackout and perform analyses to recreate the \ncourse of events [1]. On the other hand synchronised frequency traces from differ-\nent parts of Europe were available almost immediately following the UCTE dis-\nturbance in 2006 due to availability of PMUs [9].  \nWAMS may prevent blackouts due to their ability to provide system monitor-\ning and tracking of power system dynamics in real time. Onset of unstable oscilla-\ntions usually precedes a blackout and this can be detected quickly [10]. WAMS-\nbased wide area protection and control systems offer a chance to see ―the big pic-\nture‖, stop power system degradation, restore the system to a normal state and mi-\nnimise the effect of disturbance [11]. WAMS could also provide a crucial building \nblock for the concept of ―smart grids‖ through their wide-area communication in-\nfrastructure and ability to monitor power operation in real time. \nAlthough WAMS systems have been implemented in a number of places in \nUSA, Brazil, China and various places in Europe, their more widespread adoption \nis still yet to be achieved. Probably the main factor preventing a wider use of \nWAMS systems is a lack of application algorithms which would provide a signifi-\ncant additional value in everyday power system operation. Also a business case \nfor adoption of WAMS is not entirely clear as the main advantage of using them \nlies in improved system security which is a ―common good‖ benefiting everyone. \nAll European countries have adopted, or are adopting, a liberalised model of orga-\nnisation of electricity supply industry in which distribution, supply, generation and \ntransmission sectors are separated (so-called unbundling). In such a business mod-\nel costs of WAMS, and resulting benefits, cannot always be easily associated with \none particular player. This makes it difficult to justify and finance any widespread \ninstallations. \n14  \n4 Conclusions \nThe widespread blackouts of 2003 have exposed the critical role of ICT sys-\ntems in maintaining reliable operation of power systems. Fundamental errors in \nproviding back-up and alarm function in the control room were one of the main \ncontributing factors to the 2003 USA\/Canada blackout. The lack of proper ICT in-\nfrastructure to enable efficient communication and cooperation between System \nOperators in Italy and Switzerland led to delayed remedial actions and the conse-\nquent blackout of Italy in 2003. Improved ICT systems would enable a better real-\ntime cooperation and coordination between utilities in an interconnected power \nsystem but the main challenge is political: overcoming resistance of individual \nutilities to give up partially their interdependence and operate within the paradigm \nof a distributed, but coordinated, control.  \nEmergence of GPS-synchronised Wide Area Measurement Systems holds a \ngreat promise for improved monitoring and control of modern power systems and \ntherefore avoiding future blackouts. Despite some initial successes with WAMS \ndeployment, their wider adoption is still to be achieved due to a lack of application \nalgorithms which would make WAMS systems more relevant to everyday power \nsystem operation. Another obstacle may lay in the unbundled industry organisa-\ntion which makes it difficult to associate costs and benefits of WAMS with one \nparticular industry player. \n5 References \n1. US-Canada Power System Outage Task Force \"Interim Report: Causes of the August 14th \nBlackout in the United States and Canada\" November 2003. \n2. J. W. Bialek: ―Recent Blackouts in US and Continental Europe: Is Liberalisation to \nBlame?‖, The Cambridge –MIT Institute, Working Paper EP34, Cambridge, 2004 \n3. UCTE: \"Final Report of the Investigation Committee on the 28 September 2003 Blackout \nin Italy\". \n4. H.-J. Haubrich, W. Fritz: \"Study on Cross-Border Electricity Transmission Tariffs by order \nof the European Commission, DG XVII\/C1\" Aachen, April 1999. \n5. P. Bonnard: \"Power System Collapse: European Utility Experience\" 2003 IEEE Trans. \nDistr. Conf. \n6. J.W. Bialek; \"Why has it happened again? Comparison between the 2006 UCTE blackout \nand the blackouts of 2003\", IEEE PowerTech Conference, Lausanne, 2007  \n7. M. Shahidehpour, W. F. Tinney, Y Fu: ―Impact of security on power system operation‖ \nProc. of IEEE, Vol. 93, No. 11, Nov. 2005. \n8. D. Novosel, V. Madani, B. Bhargava, K. Vu, J. Cole: ―Dawn of the Grid Synchronization‖ \nIEEE Power and Energy Magazine, Jan\/Feb. 2008 \n9. UCTE: ―Final Report. System Disturbance on 4 November 2006‖  \n15 \n10. D. Wilson, J. W. Bialek, K Hay, P. McNabb, J. Trehern: ―Identifying Sources of Damping \nProblems in Power Systems‖, 16th Power Systems Computation Conference, Glasgow, \n2008. \n11. M. Begovic, D. Novosel, D. Karlsson, C. Henville, G. Michel: ―Wide area protection and \nemergency control‖, Proc. IEEE, Vol. 93, No. 5, May 2005. \nAppendix A: Maintaining reliability of an interconnected power \nsystem \nA control area is a geographic area within a large interconnected network in \nwhich a System Operator (SO) balances generation and loads in real time to main-\ntain reliable operation. Control areas are linked with each other through transmis-\nsion interconnection tie lines. Close cooperation between System Operators is re-\nquired to support the reliability of their interconnection. There are approximately \n140 control areas in North America while in Europe a control area usually means a \nsingle country although larger countries may be divided into more control areas \n(as e.g. Germany). In the US, reliability coordinators are responsible for coordina-\ntion between a number of SOs controlling different control areas.  \nICT system are fundamental for maintaining power system reliability. System \nOperators look at potential problems that could arise on their systems by using \ncontingency analyses, driven from state estimation, that are fed by data collected \nby the SCADA system. \n \nSCADA: System operators use System Control and Data Acquisition systems \nto acquire power system data and control power system equipment. SCADA sys-\ntems have three types of elements: field remote terminal units (RTUs), communi-\ncation to and between the RTUs, and one or more Master Stations. Field RTUs, \ninstalled at generation plants and substations, are combination data gathering and \ndevice control units. They gather and provide information of interest to system \noperators, such as the status of a breaker (switch), the voltage on a line or the \namount of real and reactive power being produced by a generator, and execute \ncontrol operations such as opening or closing a breaker. Telecommunications fa-\ncilities, such as telephone lines or microwave radio channels, are provided for the \nfield RTUs so they can communicate with one or more SCADA Master Stations \nor, less commonly, with each other. Master stations are the pieces of the SCADA \nsystem that initiate a cycle of data gathering from the field RTUs over the com-\nmunications facilities, with time cycles ranging from every few seconds to as long \nas several minutes. In many power systems, Master Stations are fully integrated \ninto the control room, serving as the direct interface to the Energy Management \nSystem (EMS), receiving incoming data from the field RTUs and relaying control \noperations commands to the field devices for execution. \n \n16  \nState Estimation: System Operators must have visibility (condition informa-\ntion) over their own transmission facilities, and recognize the impact on their own \nsystems of events and facilities in neighbouring systems. To accomplish this, sys-\ntem state estimators use real-time data measurements (real and reactive power \nflows, the state of switches) available on a number, but not all, of transmission \nlines, substation and other plants. This information is fed to a mathematical model \nof the power system to estimate voltages and real and reactive power flows \nthroughout the system.  \n \nContingency Analysis: A power system must be able to withstand on its own, \ni.e. without intervention of the System Operator, impact of probable events (such \nas tripping of lines or generators) that are referred to as contingencies. The most \ncommon criterion used is ―N-1‖ contingency which means that a trip of a single \nelement should not result in overloading of power system elements, loss of stabili-\nty or voltage violation. This gives SO time to adjust operation should a contingen-\ncy happen. Contingency analysis is run regularly by SO based on the current sys-\ntem operating conditions as identified by the state estimator. \nAppendix B: Wide Area Measurement Systems (WAMS) \nWide area measurement system (WAMS) is a measurement system based on \ntransmission of analogue and\/or digital information using telecommunication sys-\ntems and allowing a synchronisation (time stamping) of the measurements using a \ncommon time reference. Measuring devices used by WAMS have their own \nclocks synchronised with the common time reference using satellite GPS (global \npositioning system).  \nWAMS and WAMPAC based on GPS signal \nThe satellite GPS system is the result of many years of research undertaken by \nUS civil and military institutions aiming to develop a very accurate navigation \nsystem. The system has been made available for civil users around the world.  \nThe accuracy of the GPS reference time of about 1 μs is good enough to meas-\nure the AC phasors with frequency 50 Hz or 60 Hz. For a 50 Hz system, the pe-\nriod time corresponding to a full rotation corresponding to 360\n0\n is 20 ms = 20 x \n10\n3 μs. The time error of 1μs corresponds to the angle error of 3600\/(20 x 103) = \n0.018\n0\n .i.e. 0.005%. Such an error is small enough from the point of view of pha-\nsor measurements. \nThe possibility of measuring directly voltage and current phasors in a power \nsystem has created new control possibilities: \n17 \n Monitoring of operation of a large power system from the point of view \nof voltage angles and magnitudes and frequency. This is referred to as \nwide area monitoring (WAM).  \n Application of special power system protections based on measuring \nphasors in large parts of a power system. Such protection is referred to as \nwide area protection (WAP).  \n Application of control systems based on measuring phasors in large parts \nof a power system. Such control is referred to as wide area control \n(WAC).  \nWide area measurement system WAMS integrated with wide area monitoring \nWAM and wide area protection WAP and wide area control WAC is referred to as \nwide area measurement, protection, and control (WAMPAC).  \nRecent years have seen a dynamic expansion of WAMPAC systems. Mea-\nsurement techniques and telecommunication techniques have made a fast progress \nbut the main barrier for the expansion of WAMPAC system is a lack of WAP and \nWAC control algorithms based on the use of phasors. There has been a lot of re-\nsearch devoted to that problem but the state of knowledge cannot be regarded as \nsatisfactory. \nStructures of WAMS and WAMPAC  \nWAMS, and constructed on their basis WAMPAC, may have different struc-\ntures depending on telecommunication media used. With point-to-point connec-\ntions, the structure may be multi-layer when PMU data are sent to phasor data \nconcentrators PDC. One concentrator may service 20-30 PMUs. Data from con-\ncentrators is then sent to computers executing SCADA\/EMS functions or \nWAP\/WAC phasor-based functions. An example of a three-layer structure is \nshown in Figure 7.  \n \n \nFigure 7 An example of a three-layer structure of WAMPAC. PMU – phasor measurement unit, \nPDC – phasor data concentrator, P&C –protection and control based on phasors \n18  \nIn each stage of data transmission, delays are incurred. Concentrators in the \nlowest layer service PMUs. As the delays are the smallest at that stage, the con-\ncentrators may supply data not only for monitoring (WAM) but also for protection \n(WAP) and control (WAC).  \nThe middle-layer concentrators combine data from individual areas of a power \nsystem. The data may be used for monitoring and for some WAP or WAC func-\ntions.  \nThe top, central, concentrator services the area concentrators. As at that stage \nthe delays are the longest, the central layer may be used mainly for monitoring and \nfor those SCADA\/EMS functions that do not require a high speed of data trans-\nmission. \n \n \nFigure 8 WAMPAC structure based on a flexible communication platform \nThe main advantage of the layered structure is the lack of direct connections \nbetween area concentrators. Such connections may make it difficult, or even im-\npossible, to execute those WAP or WAC functions that require data from a num-\nber of areas. The only way to get access to data from another area is via the central \nconcentrator which incurs additional delays. That problem may be solved by add-\ning additional communication between area concentrators. That leads to more \ncomplicated communication structures as more links are introduced. \nComputer networks consisting of many local digital area networks LAN and \none wide area digital network WAN offer best possibilities of further WAMPAC \ndevelopment and application. Such a structure is illustrated in Figure 8. LAN net-\nwork services all measurement units and protection and control devices in indi-\nvidual substation. The connecting digital wide area network (WAN) creates a flex-\nible communication platform. Individual devices can communicate with each \nother directly. Such a flexible platform may be used to create special protection \nand control systems locally, for each area, and centrally. The platform could also \nbe used to provide data for local and central SCADA\/EMS systems.  \n"}