{"doi":"10.1016\/j.talanta.2010.04.034","coreId":"140511","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/4736","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/4736","10.1016\/j.talanta.2010.04.034"],"title":"Development of a sensitive detection method of cancer biomarkers in human serum\n(75%) using a quartz crystal microbalance sensor and nanoparticles amplification\nsystem","authors":["Uludag, Yildiz","Tothill, Ibtisam E."],"enrichments":{"references":[{"id":37941659,"title":"A novel multi-array immunoassay device for tumor markers based on insert-plug model of piezoelectric immunosensor.","authors":[],"date":"2007","doi":"10.1016\/j.bios.2007.03.007","raw":"B. Zhang, X. Zhang, H.h. Yan, S.j. Xu, D.h. Tang, and W.l. Fu, A novel multi-array immunoassay  device  for  tumor  markers  based  on  insert-plug  model  of  piezoelectric immunosensor. Biosensors and Bioelectronics 23 (2007) 19-25.","cites":null},{"id":37941650,"title":"A strategy for sensitivity and specificity enhancements in prostate specific antigen-[alpha]1-antichymotrypsin detection based on surface plasmon resonance.","authors":[],"date":"2006","doi":"10.1016\/j.bios.2005.10.014","raw":"C. Cao, J.P. Kim, B.W. Kim, H. Chae, H.C. Yoon, S.S. Yang, and S.J. Sim, A strategy for  sensitivity  and  specificity  enhancements  in  prostate  specific  antigen-[alpha]1-antichymotrypsin  detection  based  on  surface  plasmon  resonance.  Biosensors  and Bioelectronics 21 (2006) 2106-2113.","cites":null},{"id":37941663,"title":"A survey of the 2001 to 2005 quartz crystal microbalance biosensor literature: applications of acoustic physics to the analysis of biomolecular interactions.","authors":[],"date":"2007","doi":"10.1002\/jmr.826","raw":"M.A.  Cooper,  and  V.T.  Singleton,  A  survey  of  the  2001  to  2005  quartz  crystal microbalance  biosensor  literature:  applications  of  acoustic  physics  to  the  analysis  of biomolecular interactions. Journal of Molecular Recognition 20 (2007) 154-184.","cites":null},{"id":37941649,"title":"Amperometric biosensors for detection of the prostate cancer marker (PSA).","authors":[],"date":"2002","doi":"10.1016\/s0378-5173(02)00015-7","raw":"P. Sarkar, P.S. Pal, D. Ghosh, S.J. Setford, and I.E. Tothill, Amperometric biosensors for detection of the prostate cancer marker (PSA). International Journal of Pharmaceutics 238 (2002) 1-9.","cites":null},{"id":37941670,"title":"Analyzing a kinetic titration series using affinity biosensors.","authors":[],"date":"2006","doi":"10.1016\/j.ab.2005.09.034","raw":"R.  Karlsson,  P.S. Katsamba,  H.  Nordin,  E.  Pol,  and  D.G.  Myszka,  Analyzing  a kinetic titration series using affinity biosensors. Analytical Biochemistry 349 (2006) 136-147.","cites":null},{"id":37941673,"title":"Antibodyantigenic peptide interactions monitored by SPR and QCM-D: A model for SPR detection of IA-2 autoantibodies in human serum.","authors":[],"date":"2007","doi":"10.1016\/j.bios.2007.01.020","raw":"C. Ayela, F. Roquet, L. Valera, C. Granier, L. Nicu, and M. Pugnière, Antibodyantigenic peptide interactions monitored by SPR and QCM-D: A model for SPR detection of IA-2 autoantibodies in human serum. Biosensors and Bioelectronics 22 (2007) 3113-3119.","cites":null},{"id":37941643,"title":"Biosensors for cancer markers diagnosis.","authors":[],"date":"2009","doi":"10.1016\/j.semcdb.2009.01.015","raw":"I.E.  Tothill,  Biosensors  for  cancer  markers  diagnosis.  Seminars  in  Cell  & Developmental Biology 20 (2009) 55-62.","cites":null},{"id":37941658,"title":"Cell-based immobilization strategy for sensitive piezoelectric immunoassay of total prostate specific antigen.","authors":[],"date":"2008","doi":"10.1016\/j.bios.2008.03.020","raw":"Y.J.  Ding,  H.X.  Lu,  G.R.  Shi,  J.  Liu,  G.L.  Shen,  and  R.Q.  Yu,  Cell-based immobilization strategy for sensitive piezoelectric immunoassay of total prostate specific antigen. Biosensors & Bioelectronics 24 (2008) 228-232.","cites":null},{"id":37941674,"title":"Determination of human growth hormone in human serum samples by surface plasmon resonance immunoassay.","authors":[],"date":"2009","doi":"10.1016\/j.talanta.2009.01.012","raw":"J.  Trevino,  A.  Calle,  J.M.  Rodriguez-Frade,  M.  Mellado,  and  L.M.  Lechuga, Determination of human growth hormone in human serum samples by surface plasmon resonance immunoassay. Talanta 78 (2009) 1011-1016. Page 16 of 20 Accepted Manuscript Development of a QCM Assay for PSA Detection","cites":null},{"id":37941672,"title":"Determination of Schistosoma japonicum circulating antigens in dilution serum by piezoelectric immunosensor and S\/N enhancement.","authors":[],"date":"2008","doi":"10.1016\/j.bios.2008.03.029","raw":"C.-W.  Cheng,  C.-K.  Chen,  Y.-S.  Chen,  and  L.-Y.  Chen,  Determination  of Schistosoma  japonicum  circulating  antigens  in  dilution  serum  by  piezoelectric immunosensor and S\/N enhancement. Biosensors and Bioelectronics 24 (2008) 136-140.","cites":null},{"id":37941644,"title":"Estimates of the cancer incidence and mortality","authors":[],"date":"2007","doi":"10.1093\/annonc\/mdl498","raw":"J. Ferlay, P. Autier, M. Boniol, M. Heanue, M. Colombet, and P. Boyle, Estimates of the cancer incidence and mortality in Europe in 2006. Annals of Oncology 18 (2007) 581-592.","cites":null},{"id":37941660,"title":"Evaluation of a high-affinity QCM immunosensor using antibody fragmentation and 2-methacryloyloxyethyl phosphorylcholine (MPC) polymer.","authors":[],"date":"2004","doi":"10.1016\/j.bios.2004.05.016","raw":"S. Kurosawa, M. Nakamura, J.-W. Park, H. Aizawa, K. Yamada, and M. Hirata, Evaluation of a high-affinity QCM immunosensor using antibody fragmentation and 2-methacryloyloxyethyl phosphorylcholine (MPC) polymer. Biosensors and Bioelectronics 20 (2004) 1134-1139.","cites":null},{"id":37941668,"title":"Extracting affinity constants from biosensor binding responses.","authors":[],"date":"2009","doi":"10.1017\/cbo9780511626531.005","raw":"R.L. Rich, and D.G. Myszka, Extracting affinity constants from biosensor binding responses.  in:  M.  Cooper,  (Ed.),  Label-Free  Biosensors  Techniques  and  Applications, Cambridge University Press, 2009.","cites":null},{"id":37941653,"title":"Highly sensitive immunoassay of free prostate-specific antigen in serum using europium(III) nanoparticle label technology.","authors":[],"date":"2003","doi":"10.1016\/s0009-8981(02)00376-5","raw":"T.  Soukka,  K.  Antonen,  H.  Harma,  A.-M.  Pelkkikangas,  P.  Huhtinen,  and  T. Lovgren, Highly sensitive immunoassay of free prostate-specific antigen in serum using europium(III) nanoparticle label technology. Clinica Chimica Acta 328 (2003) 45-58.","cites":null},{"id":37941652,"title":"Immunoassays with rolling circle DNA amplification: A versatile platform for ultrasensitive antigen detection.","authors":[],"date":"2000","doi":"10.1073\/pnas.170237197","raw":"B. Schweitzer, S. Wiltshire, J. Lambert, S. O'Malley, K. Kukanskis, Z. Zhu, S.F. Kingsmore,  P.M.  Lizardi,  and  D.C.  Ward,  Immunoassays  with  rolling  circle  DNA amplification: A versatile platform for ultrasensitive antigen detection. Proceedings of the National Academy of Sciences of the United States of America 97 (2000) 10113-10119.","cites":null},{"id":37941656,"title":"In-situ quantitative analysis of a prostate-specific antigen (PSA) using a nanomechanical PZT cantilever. Lab on a Chip - Miniaturisation for Chemistry and","authors":[],"date":"2004","doi":"10.1039\/b410905h","raw":"K.S.  Hwang,  J.H.  Lee,  J.  Park,  D.S.  Yoon,  J.H.  Park,  and  T.S.  Kim,  In-situ quantitative analysis of a prostate-specific antigen (PSA) using a nanomechanical PZT cantilever. Lab on a Chip - Miniaturisation for Chemistry and Biology 4 (2004) 547-552.","cites":null},{"id":37941648,"title":"Integrated microfluidic systems with an immunosensor modified with carbon nanotubes for detection of prostate specific antigen (PSA) in human serum samples.","authors":[],"date":"2008","doi":"10.1016\/j.bios.2007.11.003","raw":"N.V.  Panini,  G.A.  Messina,  E.  Salinas,  H.  Fernandez,  and  J.  Raba,  Integrated microfluidic  systems  with  an  immunosensor  modified  with  carbon  nanotubes  for detection of prostate specific antigen (PSA) in human serum samples. Biosensors and Bioelectronics 23 (2008) 1145-1151.","cites":null},{"id":37941671,"title":"Kinetic analysis of a high-affinity antibody\/antigen interaction performed by multiple Biacore users.","authors":[],"date":"2006","doi":"10.1016\/j.ab.2006.01.034","raw":"P.S. Katsamba, I. Navratilova, M. Calderon-Cacia, L. Fan, K. Thornton, M. Zhu, T.V.  Bos,  C.  Forte,  D.  Friend,  I.  Laird-Offringa,  G.  Tavares,  J.  Whatley,  E.  Shi,  A. Widom,  K.C.  Lindquist,  S.  Klakamp,  A.  Drake,  D.  Bohmann,  M.  Roell,  L.  Rose,  J. Dorocke, B. Roth, B. Luginbühl, and D.G. Myszka, Kinetic analysis of a high-affinity antibody\/antigen  interaction  performed  by  multiple  Biacore  users.  Analytical Biochemistry 352 (2006) 208-221.","cites":null},{"id":37941647,"title":"Label-free immunosensor for prostate-specific antigen based on single-walled carbon nanotube array-modified microelectrodes.","authors":[],"date":"2007","doi":"10.1016\/j.bios.2006.09.038","raw":"J. Okuno, K. Maehashi, K. Kerman, Y. Takamura, K. Matsumoto, and E. Tamiya, Label-free  immunosensor  for  prostate-specific  antigen  based  on  single-walled  carbon nanotube array-modified microelectrodes. Biosensors and Bioelectronics 22 (2007) 2377-2381.","cites":null},{"id":37941657,"title":"Novel electrical detection of label-free disease marker proteins using piezoresistive selfsensing micro-cantilevers.","authors":[],"date":"2005","doi":"10.1016\/j.bios.2004.09.023","raw":"K.W. Wee, G.Y. Kang, J. Park, J.Y. Kang, D.S. Yoon, J.H. Park, and T.S. Kim, Novel electrical detection of label-free disease marker proteins using piezoresistive selfsensing micro-cantilevers. Biosensors and Bioelectronics 20 (2005) 1932-1938. Page 15 of 20 Accepted Manuscript Development of a QCM Assay for PSA Detection","cites":null},{"id":37941664,"title":"Piezoelectric mass-sensing devices as biosensors - An alternative to optical biosensors?","authors":[],"date":"2000","doi":"10.1002\/chin.200106278","raw":"A.  Janshoff,  H.J.  Galla,  and  C.  Steinem,  Piezoelectric  mass-sensing  devices  as biosensors  -  An  alternative  to  optical  biosensors?  Angewandte  Chemie-International Edition 39 (2000) 4004-4032.","cites":null},{"id":37941654,"title":"Preparation, Characterization, and TimeResolved Fluorometric Application of Silica-Coated Terbium(III) Fluorescent Nanoparticles.","authors":[],"date":"2004","doi":"10.1021\/ac030177m","raw":"Z. Ye, M. Tan, G. Wang, and J. Yuan, Preparation, Characterization, and TimeResolved  Fluorometric  Application  of  Silica-Coated  Terbium(III)  Fluorescent Nanoparticles. Analytical Chemistry 76 (2004) 513-518.","cites":null},{"id":37941646,"title":"Prostate-specific antigen: Its usefulness in clinical medicine.","authors":[],"date":"1998","doi":"10.1016\/s1043-2760(98)00082-4","raw":"E.P. Diamandis, Prostate-specific antigen: Its usefulness in clinical medicine. Trends in Endocrinology and Metabolism 9 (1998) 310-316.","cites":null},{"id":37941645,"title":"PSA in the screening, staging and follow-up of earlystage prostate cancer. A review of recent developments.","authors":[],"date":"1989","doi":"10.1007\/bf01576837","raw":"M.K. Brawer, and P.H. Lange, PSA in the screening, staging and follow-up of earlystage prostate cancer. A review of recent  developments.  World Journal of Urology 7 (1989) 7-11.","cites":null},{"id":37941662,"title":"QCM immunosensor with nanoparticle amplification for detection of Escherichia coli O157:H7. Sensing and Instrumentation for Food Quality and","authors":[],"date":"2007","doi":"10.1007\/s11694-007-9021-1","raw":"L.  Fei,  L.  Yanbin,  S.  Xiao-Li,  M.F.  Slavik,  Y.  Yibin,  and  W.  Jianping,  QCM immunosensor with nanoparticle amplification for detection of Escherichia coli O157:H7. Sensing and Instrumentation for Food Quality and Safety 1 (2007) 161-168.","cites":null},{"id":37941661,"title":"Reduction of severe bovine serum associated matrix effects on carboxymethylated dextran coated biosensor surfaces.","authors":[],"date":"2008","doi":"10.1016\/j.talanta.2008.04.053","raw":"C. Situ, A.R.G. Wylie, A. Douglas, and C.T. Elliott, Reduction of severe bovine serum associated matrix effects on carboxymethylated dextran coated biosensor surfaces. Talanta 76 (2008) 832-836.","cites":null},{"id":37941666,"title":"The Art of Immobilization for SPR Sensors.","authors":[],"date":"2006","doi":"10.1007\/5346_017","raw":"S. Löfas, and A. McWhirter, The Art of Immobilization for SPR Sensors. in: J. Homola, (Ed.), Surface Plasmon Resonance Based Sensors, Springer, 2006.","cites":null},{"id":37941651,"title":"Ultra-sensitive surface plasmon resonance based immunosensor for prostate-specific antigen using gold nanoparticle-antibody complex. Colloids and Surfaces A: Physicochemical and Engineering Aspects 313-314","authors":[],"date":"2008","doi":"10.1016\/j.colsurfa.2007.05.057","raw":"J.W. Choi, D.Y. Kang, Y.H. Jang, H.H. Kim, J. Min, and B.K. Oh, Ultra-sensitive surface plasmon resonance based immunosensor for prostate-specific antigen using gold nanoparticle-antibody  complex.  Colloids  and  Surfaces  A:  Physicochemical  and Engineering Aspects 313-314 (2008) 655-659.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-06-30T00:00:00Z","abstract":"A simple and sensitive sensor method for cancer biomarkers [prostate specific\nantigen (PSA) and PSA-alpha 1-antichymotrypsin (ACT) complex] analysis was\ndeveloped, to be applied directly with human serum (75%) by using antibody\nmodified quartz crystal microbalance sensor and nanoparticles amplification\nsystem. A QCM sensor chip consisting of two sensing array enabling the\nmeasurement of an active and control binding events simultaneously on the sensor\nsurface was used in this work. The performance of the assay and the sensor was\nfirst optimised and characterised in pure buffer conditions before applying to\nserum samples. Extensive interference to the QCM signal was observed upon the\nanalysis of serum. Different buffer systems were then formulated and tested for\nthe reduction of the non-specific binding of sera proteins on the sensor\nsurface. A PBS buffer containing 200 mu g mL(-1) BSA, 0.5 M NaCI, 500 mu g mL(-\n1) dextran and 0.5% Tween 20, was then selected which eliminated the interfering\nsignal by 98% and enabled the biomarker detection assay to be performed in 75%\nhuman serum. By using Au nanoparticles to enhance the QCM sensor signal, a limit\nof detection of 0.29 ng mL(-1) PSA and PSA-ACT complex (in 75% serum) with a\nlinear dynamic detection range up to 150 ng mL(-1) was obtained. With the\nachieved detection limit in serum samples, the developed QCM assay shows a\npromising technology for cancer biomarker analysis in patient samples. (C) 2010\nElsevier B.V. All rights reserved","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140511.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.talanta.2010.04.034","pdfHashValue":"042386951c618273bc57495fe82bd45179ce5916","publisher":"Elsevier Science B.V., Amsterdam.","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/4736<\/identifier><datestamp>2015-09-15T18:43:21Z<\/datestamp><setSpec>hdl_1826_2005<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Development of a sensitive detection method of cancer biomarkers in human serum\n(75%) using a quartz crystal microbalance sensor and nanoparticles amplification\nsystem<\/dc:title><dc:creator>Uludag, Yildiz<\/dc:creator><dc:creator>Tothill, Ibtisam E.<\/dc:creator><dc:subject>Cancer biomarkers Prostate specific antigen (PSA) Human serum Biosensor Quartz crystal microbalance (QCM) Nanoparticles Point of care assay prostate-specific antigen surface-plasmon resonance piezoelectric immunosensor immunoassay biosensors psa strategy samples model<\/dc:subject><dc:description>A simple and sensitive sensor method for cancer biomarkers [prostate specific\nantigen (PSA) and PSA-alpha 1-antichymotrypsin (ACT) complex] analysis was\ndeveloped, to be applied directly with human serum (75%) by using antibody\nmodified quartz crystal microbalance sensor and nanoparticles amplification\nsystem. A QCM sensor chip consisting of two sensing array enabling the\nmeasurement of an active and control binding events simultaneously on the sensor\nsurface was used in this work. The performance of the assay and the sensor was\nfirst optimised and characterised in pure buffer conditions before applying to\nserum samples. Extensive interference to the QCM signal was observed upon the\nanalysis of serum. Different buffer systems were then formulated and tested for\nthe reduction of the non-specific binding of sera proteins on the sensor\nsurface. A PBS buffer containing 200 mu g mL(-1) BSA, 0.5 M NaCI, 500 mu g mL(-\n1) dextran and 0.5% Tween 20, was then selected which eliminated the interfering\nsignal by 98% and enabled the biomarker detection assay to be performed in 75%\nhuman serum. By using Au nanoparticles to enhance the QCM sensor signal, a limit\nof detection of 0.29 ng mL(-1) PSA and PSA-ACT complex (in 75% serum) with a\nlinear dynamic detection range up to 150 ng mL(-1) was obtained. With the\nachieved detection limit in serum samples, the developed QCM assay shows a\npromising technology for cancer biomarker analysis in patient samples. (C) 2010\nElsevier B.V. All rights reserved.<\/dc:description><dc:publisher>Elsevier Science B.V., Amsterdam.<\/dc:publisher><dc:date>2011-09-08T10:26:11Z<\/dc:date><dc:date>2011-09-08T10:26:11Z<\/dc:date><dc:date>2010-06-30T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>0039-9140<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.talanta.2010.04.034<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/4736<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0039-9140","0039-9140"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":["Cancer biomarkers Prostate specific antigen (PSA) Human serum Biosensor Quartz crystal microbalance (QCM) Nanoparticles Point of care assay prostate-specific antigen surface-plasmon resonance piezoelectric immunosensor immunoassay biosensors psa strategy samples model"],"subject":["Article"],"fullText":"Accepted Manuscript\nTitle: Development of a Sensitive Detection method of Cancer\nBiomarkers in Human Serum (75%) using a Quartz Crystal\nMicrobalance Sensor and Nanoparticles amplification system\nAuthors: Yıldız Uludag˘, Ibtisam E. Tothill\nPII: S0039-9140(10)00291-2\nDOI: doi:10.1016\/j.talanta.2010.04.034\nReference: TAL 11248\nTo appear in: Talanta\nReceived date: 13-1-2010\nRevised date: 31-3-2010\nAccepted date: 16-4-2010\nPlease cite this article as: Y. Uludag˘, I.E. Tothill, Development of a Sensitive\nDetection method of Cancer Biomarkers in Human Serum (75%) using a Quartz\nCrystal Microbalance Sensor and Nanoparticles amplification system, Talanta (2008),\ndoi:10.1016\/j.talanta.2010.04.034\nThis is a PDF file of an unedited manuscript that has been accepted for publication.\nAs a service to our customers we are providing this early version of the manuscript.\nThe manuscript will undergo copyediting, typesetting, and review of the resulting proof\nbefore it is published in its final form. Please note that during the production process\nerrors may be discovered which could affect the content, and all legal disclaimers that\napply to the journal pertain.\nPage 1 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\nDevelopment of a Sensitive Detection method of Cancer Biomarkers in \nHuman Serum (75%) using a Quartz Crystal Microbalance Sensor and \nNanoparticles amplification system \n \nYıldız Uludağ and Ibtisam E. Tothill* \n \nCranfield University, Cranfield Health, Cranfield, Bedfordshire MK43 0AL, \nEngland, UK \n \n \n \n \n \n \n                                                 \n*\n Corresponding author: I.E. Tothill. Tel: +44 (0) 7500766487.  \nE-mail: i.tothill@cranfield.ac.uk \nPage 2 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n  Development of a QCM Assay for PSA Detection \n \n2 \n \nAbstract \nA simple and sensitive sensor method for cancer biomarkers [prostate specific antigen \n(PSA) and PSA-alpha 1 antichymotrypsin (ACT) complex] analysis was developed, to be \napplied directly with human serum (75%) by using antibody modified quartz crystal \nmicrobalance sensor and nanoparticles amplification system. A QCM sensor chip \nconsisting of two sensing array enabling the measurement of an active and control \nbinding events simultaneously on the sensor surface was used in this work. The \nperformance of the assay and the sensor was first optimised and characterised in pure \nbuffer conditions before applying to serum samples. Extensive interference to the QCM \nsignal was observed upon the analysis of serum. Different buffer systems were then \nformulated and tested for the reduction of the non-specific binding of sera proteins on the \nsensor surface. A PBS buffer containing 200 µg mL\n-1\n BSA, 0.5 M NaCl, 500 µg mL\n-1\n \ndextran and 0.5% Tween 20, was then selected which eliminated the interfering signal by \n98% and enabled the biomarker detection assay to be performed in 75% human serum.  \nBy using Au nanoparticles to enhance the  QCM sensor signal, a limit of detection of 0.29 \nng mL\n-1\n PSA and PSA-ACT complex (in 75 % serum) with a linear dynamic detection \nrange up to 150 ng mL\n-1\n was obtained. With the achieved detection limit in serum \nsamples, the developed QCM assay show a promising technology for cancer biomarker \nanalysis in patient samples. \n \n \n \n \n \n \n \n \n \n \n \n \nKeywords: Cancer biomarkers, prostate specific antigen, PSA, human serum, biosensor, \nquartz crystal microbalance, QCM, nanoparticles, point of care assay.  \nPage 3 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n  Development of a QCM Assay for PSA Detection \n \n3 \n \n \n \n \nThe World Health Organisation (WHO) states that around 13% of all deaths worldwide in \n2007 were caused by cancer [1]. Early and accurate detection of cancer is very important \nbefore it spreads out to the other organs of the body and this makes early diagnosis very \nimportant for successful treatment of the disease. The detection of cancer biomarkers in \npatient samples provides an effective way to diagnose and treat the disease. Recent \nadvances in the area of sensor technology and microarrays have enabled the \nminiaturisation of the devices and multiplex testing of a range of analytes. Therefore, \nbiosensor technology has the potential to produce point of care cancer testing devices that \ndetects biomarkers [2].  \n \nAmong different cancer types, prostate cancer which is a complex and multifactorial \ndisease is the commonest form of cancer in men in Europe (301,500 incident cases, \n24.1% of all cancer cases) [3]. The increase in prostate specific antigen (PSA) levels in \nserum above the normal limits is the primary indication of prostate malignancy; therefore \nPSA is used as a biomarker for the diagnosis and prognosis of the prostate cancer [4; 5]. \nSeveral biosensor systems have been applied in the past for the detection of PSA; \nelectrochemical [6; 7; 8], optical [9; 10; 11], fluorescence \/ chemiluminescence [12; 13], \nmicrocantilever [14; 15] and quartz crystal microbalance (QCM) biosensors [16; 17] were \nused for the detection.  The detection limit of PSA using these systems varies between 0.2 \npg mL\n-1\n to 10 ng mL\n-1\n. The detection signal has been amplified by means of a sandwich \nassay with Au nanoparticles or the use of carbon nanotubes. In most cases biomarker \ndetection test was performed only in buffered pure solutions rather than serum. To obtain \nclinically relevant results, it is essential to perform the biomarker test in human serum. \nThe main difficulty of using serum as the assay media is high non-specific interaction \nbetween the sensor surface and serum proteins. A number of strategies have been \nemployed to reduce the non-specific binding of clinical samples. As an example Cao et \nal. used mixed self-assembled monolayer coated surface which contains ethylene glycol \nunits [9], Kurosawa et al. used 2-methacryloyloxyethyl phosphorylcholine polymer as \nblocking agent [18] and Situ et al. employed additives in the buffer to lower the non-\nspecific binding of serum proteins [19] to the sensor surface. The above described \n1 Introduction \nPage 4 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n  Development of a QCM Assay for PSA Detection \n \n4 \n \nmethods can either be applied individually or together to reduce the non-specific binding \nof serum proteins achieving different success.  \n \nIn this paper we describe the development of a simple and rapid detection method for \ncancer biomarkers analysis using a quartz crystal microbalance (QCM) biosensor. A \nQCM consists of a thin quartz wafer sandwiched between a pair of electrodes. The mode \nof oscillation depends on the cut and geometry of the quartz crystal. Mass addition or loss \non the sensor surface results in frequency change and hence measuring molecular \ninteractions that occur on the sensor surface without the need of a label. By employing Au \nnanoparticles in the assay design, it is possible to increase the mass due to antigen binding \nand further enhance the sensitivity of the assay [20; 21]. However, the frequency is also \naffected by viscosity change of the assay media and charge of the interaction molecules \n[22]. Therefore, care needs to be taken to subtract the controls and extract the real \nresponse due to specific molecular interactions. The sensitivity enhancement using \nnanoparticles has been usually achieved by modifying a secondary antibody to the \nnanoparticles and performing a sandwich assay. \n \nIn this work an investigation was performed to develop and optimise an immunoassay to \ndetect biomarkers in human serum on the QCM sensor chip. To minimise the matrix \neffect of human serum, the addition of detergent, salt and other additives to the buffer \nsolution was investigated. PSA and PSA-ACT complex were used as the cancer \nbiomarkers for detection and an immunoassay was developed and performed in buffer \nand in human serum. \n \n \nPSA, monoclonal PSA detection (cat no: MCA2561) and capture antibodies (cat no: \nMCA2560) were obtained from AbD Serotec, (Kidlington, UK). ACT-PSA complex was \npurchased from BiosPacific (CA, USA). Mouse IgG (cat no: 015-000-003) usually used \nas a control antibody was obtained from Stratech Scientific Ltd.\/Jackson \nImmunoResearch (Newmarket, UK). Human serum and bovine serum albumin (BSA) \nwere purchased from Sigma-Aldrich (Poole, UK). All other chemicals were of analytical \ngrade.  \n2 Materials and Methods \nPage 5 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n  Development of a QCM Assay for PSA Detection \n \n5 \n \n2.1 Instrumentation \nA fully automated QCMA-1 biosensor instrument and sensor chips were obtained from \nSierra Sensors GmbH (Hamburg, Germany). Au coated QCMA-1 sensor chips (20 MHz) \npossess two sensing arrays each, enabling the measurement of active and control sensor \nsurfaces simultaneously (Figure 1S\n1\n). The operating temperature of the assays was 25ºC \nand the flow rate of the buffer was 80 µl min\n-1\n throughout the assay. The data presented in \nthis work are the averages of 4 data points for the assays described unless otherwise \nstated.  \n2.2 Modification of Au nanoparticles with Anti-PSA detection antibody   \nPSA detection antibody was added to the 40 nm Au nanoparticle solution and incubated \nat room temperature on a shaker. BSA was added to the solution to ensure that the Au \nnanoparticles are all coated with antibody or protein. After spinning 20 minutes at 4ºC, \nthe antibody modified nanoparticles were recovered and re-suspended in PBS\/T buffer. \nThe concentration of nanoparticles was determined by a spectrophotometer at 520 nm \nwavelength. The antibody modified Au nanoparticles were then stored in the fridge (4\no\nC) \nuntil use. \n2.3 Sensor surface modification \nInitially gold coated QCMA-1 sensor chips were coated with self assembled monolayer \n(SAM) by immersing the sensors in 2 mM ethanol solution of mercaptoundecanoic acid \novernight followed by rinsing with ethanol and water and then dried under nitrogen. The \nsensors were stored at 4\no\nC till use.  For the AFM (Atomic Force Microscopy) study, \nDimension 3000 SPM instrument (Veeco Instruments Ltd., Cambridge) was used with \nsilicon probes (type: PPP-NCH-50). The analysis was carried out at tapping mode. AFM \nimages of QCMA-1 sensor were taken before and after surface chemistry application. For \nthe assay,  the SAM coated sensor chip was first docked to the instrument and primed \nwith running buffer (10 mM PBS, pH 7.4) at a flow rate of 80 µl min\n-1 \nuntil use. \nMonoclonal anti-PSA antibodies (capture antibody) and Mouse IgG antibody (control \nantibody) were then immobilised on the sample and control sensing arrays respectively \nusing conventional amine coupling chemistry. Sensor surfaces were first activated with a \n                                                 \n1\n Figure numbers ended with letter ‘S’ are presented at the supplementary information. \nPage 6 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n  Development of a QCM Assay for PSA Detection \n \n6 \n \n1 : 1 mixture of 400 mM EDC and 100 mM NHS by injecting simultaneously across the \ntwo sensing spots for 3 min (240 µl). A 15-30 or 50 µg mL\n-1\n anti-PSA antibody (in \nsodium acetate buffer, 10 mM, pH 5.5) was injected on the active sensor array and 15-30 \nor 50  µg mL\n-1\n mouse IgG (in sodium acetate buffer, pH 5.5) was injected on the control \nsensor array for 3 min (240 µl).  The surfaces were then blocked with 50 µg mL\n-1\n BSA in \nPBS for 3 min (240 µl).  Non-reacted NHS esters were capped with 1 M ethanolamine, \npH 8.5 for 3 min (240 µl). The frequency changes were recorded 2 min after the protein \ninjection was completed and the signal reached steady state. The running buffer was \nchanged to PBS containing 0.005% Tween (PBS\/T) for the binding assay studies. \n2.4 Detection of PSA  \nIn serum, PSA is found either in free form or as a complex with alpha 1-antichymotrypsin \n(ACT) (ACT-PSA, MW 96 kDA). Total PSA (tPSA) refers to the PSA in both forms \n(PSA and ACT-PSA complex). In the current study to prepare tPSA 1 to 1 mixture of \nPSA and ACT-PSA was used. PSA or tPSA was diluted at specified concentrations (0.29 \nto 5000 ng mL\n-1\n) in PBS\/T buffer containing 5 µg mL\n-1\n BSA or 10% to 75% human \nserum in PBS\/T buffer containing additives. These solutions were then injected over the \nPSA capture antibody and mouse IgG immobilised surfaces for 3 or 5 min to allow \nbinding interactions (240 or 400 µl).  The frequency changes due to PSA\/tPSA binding \nwere recorded at 180 s after the injection started. After the binding of PSA\/tPSA either \nsurface was regenerated by injection of 100 mM HCl (1 min, 80 µl) or the assay was \ncontinued to perform a sandwich assay. \n \nAfter the binding of PSA\/tPSA to the sensor surface, 1.5 µg mL\n-1\n PSA detection \nantibodies or PSA detection antibody modified Au nanoparticles were injected on the \nsensor surface for 3 or 5 min (240 or 400 µl).  After 3 min dissociation period under \nrunning buffer flow, surfaces were regenerated by injection of 100 mM HCl (1 min, 80 \nµl) (and additional 20 mM NaOH (1 min, 80 µl) was injected if PSA spiked human serum \nwas used). The frequency changes due to PSA detection antibody binding were recorded \n3 min after the injection started. The limit of detection (LOD) was calculated as the signal \nobtained from the PSA concentration that is equivalent to the 3 times the standard \ndeviation of the signals obtained from the blank standards. \n \nPage 7 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n  Development of a QCM Assay for PSA Detection \n \n7 \n \n \n \n3.1 Optimisation of sensor signal  \nBare gold QCMA-1 sensor chips were employed in this work as the sensor platform for \nPSA detection. Each chip consists of two sensing array for active and control sample \ntesting. The modification of the chips using self assembled monolayer (SAM) was carried \nout on the sensor surface.  Atomic Force Microscopy (AFM) images of a sensor chip \nwere taken before and after the SAM coating (Figure 2S). The results indicate that SAM \nmodification caused a change of the root mean square (rms) roughness from 5.5 nm to 3.1 \nnm due to surface coating. The SAM coated sensor chip was first docked to the QCMA-1 \ninstrument and primed with running buffer to wet the sensor chip and continues buffer \nflow (80 µl min\n-1\n) was started. Anti-PSA capture antibody and mouse IgG were then \nimmobilised on the active sensor array and the control sensor array respectively using \nconventional EDC-NHS chemistry [23]. A 3 minutes injection of antibodies was \nsufficient to achieve signal saturation; therefore, the immobilisation time was kept at 3 \nminutes for the assay. Three different concentrations were used for antibody \nimmobilisation and from these 30 µg mL\n-1\n was chosen as the optimum concentration to \nvimmobilise the antibodies.  Anti-PSA capture antibody immobilised sensors produced an \naverage frequency change of 380 ± 38 Hz and mouse IgG immobilised sensors produced \na frequency change of 520 ± 15 Hz (Figure 3S). \n \nThe PSA non-specific binding (diluted in PBS\/T buffer containing 5 µg mL\n-1\n BSA) to the \ncontrol sensor array was then examined by conducting binding tests.  The results show \nthat the control sensor surface did not give any frequency change even if the highest \nconcentration of PSA (5 µg mL\n-1\n) was used (Figure 1-trace e). To examine  the non-\nspecific binding of BSA on the PSA capture antibody immobilised surface, BSA (5 µg \nmL\n-1\n) was injected for 3 min and the non-specific binding of BSA to the surface was \ndetected as 4 ± 1 Hz (n = 3, data not shown).  \n \nFor the sandwich assay procedure, anti-PSA detection antibody (3 µg mL\n-1\n) was injected \nin the absence of the antigen (PSA) on to the PSA capture antibody immobilised surface \n3 Results and Discussion \nPage 8 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n  Development of a QCM Assay for PSA Detection \n \n8 \n \nand the non-specific binding was detected as 5 ± 2 Hz (n = 3, data not shown). The non-\nspecific responses were subtracted from the PSA or PSA detection antibody binding data. \n3.2 Determination of kinetic constants for PSA detection assay \nThe calibration curve obtained with PSA binding (3 min) to the PSA capture antibody \nimmobilised surface in a concentration range between 4.7 to 5000 ng mL\n-1 \nis shown in \nFigure 1 and Figure 4S. PSA binding response curves were then fitted to 1:1 Langmuir \nbinding model to determine the binding association and dissociation rates [24], from \nwhich KD value was calculated as 5.56 × 10\n-10\n M and Rmax as 108 Hz (Table 1). Karlsson \net al. calculated the affinity of PSA antibody towards PSA as 3.3 × 10\n-9\n M (antibody from \nFitzgerald Industries Int., clone M212091) [25].  Katsamba et al. calculated the affinity as \n1.1 × 10\n-9\n M (antibody from Fitzgerald Industries Int., clone M612166) [26].  \n \nTo enhance the sensor signal and improve the sensitivity of the method, a sandwich assay \napproach was followed employing PSA detection antibody. The calibration curve was \nobtained for the sandwich assay in a concentration range between 150 to 2.3 ng mL\n-1 \nthat \nis relevant for prostate cancer diagnosis (Figure 4S, trace b). This assay resulted in 4.7 ng \nmL\n-1\n PSA as detection limit which is four folds more sensitive than the direct assay \n(Table 2). The experiments have shown that the chosen anti- PSA antibody has good \naffinity for a successful immunoassay and the sandwich assay resulted in a clinically \nrelevant detection limit. Consequently experiments were performed to optimise the assay \nso that biomarker detection could be performed in human serum. \n3.3 Buffer optimisation for human serum sample analysis \nThere is a significant difference in the limit of detection when buffer or clinical sample \n(serum) is used as the assay media. For example, although Cao et al. performed the PSA-\nACT detection assay using only 10% human serum; the limit of detection has changed \nfrom 10.2 ng mL\n-1\n (in buffer) to 18.1 ng mL\n-1\n (in 10% serum) [9]. This change in the \ndetection limit, when clinical samples are used, is mainly due to lower signal to noise \nratio resulting from the high non-specific binding of sera proteins\/antibodies to the sensor \nsurface. This is especially noticeable when label-free biosensors are employed, and this \nprevents researchers from the use of high concentrations of human serum. Therefore, \nPage 9 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n  Development of a QCM Assay for PSA Detection \n \n9 \n \nmost analyses are conducted using concentration of human serum in the range 10 to 50 % \n[18; 19; 27].  \n \nIn the current study we investigated the use of additives to minimize the adsorption of \nsera proteins to the sensor surface. Initially, a 10% human serum diluted in PBS\/T buffer \nwas injected on the mouse IgG immobilised sensor surface. A 1490 Hz response was \nobtained from this solution and after buffer flow started, the response was reduced to \n1370 Hz (Figure 2, A-trace 1). From the results it was evident that human serum proteins \ncaused a significant non-specific binding on the surface. To reduce this non-specific \nbinding salt, BSA, dextran and Tween 20 were added to the buffer at varying \nconcentrations. Increase the salt concentration increases the ionic strength of the solution \nand that lowers the electrostatic attraction of human serum proteins to the sensor surface. \nTherefore, high salt concentration was used to reduce proteins adsorption to the sensor \nsurface. Dextran and BSA were used to help in preventing serum protein absorption. It is \ncommon to employ detergents to lower the non-specific protein binding; therefore the \nconcentration of Tween 20 was increased in the solution [28]. These additives at varying \nconcentrations were added to prepare 10% human serum and injected over the mouse IgG \nimmobilised sensor surface for 3 min (Figure 2, A). The lowest non-specific binding was \nobserved when the serum is diluted in additives containing PBS\/T buffer that had final \nconcentrations of 200 µg mL\n-1\n BSA, 0.5 M salt, 500 µg mL\n-1\n dextran and 0.5% Tween 20 \nin solution. The response 180s after the injection of 10% human serum diluted in this \nmatrix elimination buffer (matrix buffer) was found as 251 ± 18 Hz (n = 3) and after the \nbuffer flow started the response was reduced to 23 ± 12 Hz (n = 3). As it can be seen from \nFigure 2, A - trace 1, the injection of human serum in PBS\/T buffer resulted in a trace that \nshowed a curved structure indicating the binding of sera proteins to the sensor surface and \nthere was little dissociation after the injection stopped and buffer flow was started. \nWhereas when human serum diluted in the matrix buffer was injected (Figure 2, A - trace \n5), the response trace showed an instant sharp increase up to ca. 250 Hz and remained \nshowing no curvature indicated that the bulk of this response was due to the use of \nadditives and therefore this matrix buffer was then used for all further assays using human \nserum. Figure 2, B, shows the comparison of non-specific binding results for 10%, 40% \nand 75% human serum diluted in the matrix buffer developed in this work and injected to \nmouse IgG immobilised surface. The low non-specific binding values for these three \nconcentrations of human serum (highest 91 ± 10 Hz for 75% human serum) indicated that \nPage 10 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n  Development of a QCM Assay for PSA Detection \n \n10 \n \nthe matrix buffer was effective even for high serum concentrations. For all the \nforthcoming experiments human serum was always diluted with the matrix buffer. \n \nThese results showed that by applying the matrix buffer in the assay method, a 98% \nreduction in non-specific binding of human sera proteins was achieved. If this result is \ncompared to other recently published work; Situ et al. achieved 94% reduction in non-\nspecific binding by using CM5 (carboxymethyl dextran) surface and a formulated buffer \ntogether and Trevino et al. achieved 88% reduction in non-specific binding of serum by \nusing another formulated buffer [19; 29].  \nThe PSA assay was then performed using 20 ng mL\n-1\n PSA spiked in 10% and 40% \nhuman serum. When the results were compared with PSA assay in PBS\/T buffer, it was \nseen that both direct and sandwich PSA assay results in buffer or spiked in 10% human \nserum (diluted in matrix buffer) were very close to each other and within the standard \ndeviation (Figure 3, A). However, as the human serum concentration increased to 40%, \nthe response from direct assay was eliminated but still there was a response from the \ninjection of PSA detection antibody (sandwich assay). Although this result was lower \nthan the assay in PBS\/T buffer (or assay in 10% human serum) still good enough to \nperform the assay in high human serum concentrations. An example to direct and \nsandwich assay response of PSA spiked in 10% human serum is shown in Figure 3B. \n3.4 Detection of tPSA in 75% human serum \nA calibration curve was obtained for the sandwich assay in a concentration range between \n2.3 to 150 ng mL\n-1 \ntPSA spiked in 75% human serum. The non-specific binding of PSA \ndetection antibody after the injection of 75% human serum (without spiked PSA) was 2 ± \n1 Hz, if assay performed on mouse IgG immobilised surface and 10 ± 3 Hz if assay \nperformed on PSA capture antibody immobilised surface. The PSA detection antibody \nbinding responses were obtained after the subtraction of the non-specific binding \nresponse. The detection limit obtained for this assay was 9.4 ng mL\n-1\n (Figure 5 - trace a). \nHowever this result was not sensitive enough for PSA detection at the required levels in \nserum. To enhance the sensitivity further 40 nm Au nanoparticles were modified with \nPSA detection antibody and sandwich assay was performed to detect tPSA. The use of Au \nnanoparticles lowered the detection limit down to 0.29 ng ml\n-1\n (Figure 5 – trace b), which \nPage 11 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n  Development of a QCM Assay for PSA Detection \n \n11 \n \nis well below the required limit of detection. Table 2, summarises the results of the assays \nin buffer and in human serum. \n \nThe specificity of the tPSA interaction with the sensor surface was tested by employing a \nmouse IgG surface on the control sensor. The non-specific binding of PSA detection \nantibody modified Au nanoparticles after the injection of 75% human serum (with or \nwithout spiked tPSA) resulted in no response on mouse IgG immobilised surface (Figure \n4 - trace b). The binding of PSA detection antibody modified Au nanoparticles after the \ninjection of 75% human serum (without spiked tPSA) resulted in 9 ± 2 Hz response on \nanti-PSA capture antibody immobilised surface, since non-specific binding on to MIgG \nsurface was very low, this result was purely due to the tPSA content of the serum \nobtained from Sigma. While creating the calibration curve, this response was deducted \nfrom the responses obtained to get the binding results due to the spiked tPSA. Later after \ncalibration curve of tPSA assay was obtained, it was calculated that serum from Sigma \nused for the study contains 0.41 ng ml\n-1\n tPSA. \n \nIn conclusion, the limit of detection of the biomarker assay was 0.29 ng ml\n-1\n (corresponds \nto 0.39 ng ml\n-1\n in 100% serum) with a linear detection range of 0.29-150 ng ml\n-1\n and the \ncoefficient of variation (CV) laid between 1 to 9% across the range. These results show \nthat the assay developed with the formulated matrix buffer and Au nanoparticle signal \namplification, have potential for the rapid and sensitive detection of serum biomarkers in \npatient samples. \n \nThe number of publications related to the detection of PSA using QCM biosensor is very \nlimited and this indicates that application of QCM biosensors to PSA detection is a newly \ndeveloping area. An example to a previous study for PSA assay using QCM biosensor has \nbeen the study performed by Zhang et al. which involve the use of an insert-plug model \nof piezoelectric immunosensor. After 40 min of reaction at 37ºC in a static cell with a 10 \nMHz quartz crystal, Zhang et al achieved linear detection of 1.5 – 40 ng mL-1 PSA in \n100% serum [17]. Although the detection limit obtained from this study was low enough, \nthe reaction time was long and assay needs to be performed at elevated temperatures. \nAdditionally the dynamic range of the assay was limited. In another study, Ding et al. \nused yeast cell modified QCM sensors to immobilise PSA antibodies [16]. The binding of \nPSA to the PSA antibody immobilised sensor was recorded after the binding reached \nPage 12 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n  Development of a QCM Assay for PSA Detection \n \n12 \n \nequilibrium using a 9 MHz quartz crystal and magnetic stirrer agitated static cell. With \nthis method Ding et al. achieved detection of PSA in the range of 5 to 604 ng mL\n-1\n in \n100% serum. Both applications mentioned above were performed using non-automated \nequipment that due to their manual operation may not only cause variations between the \nassays but also are not suitable for clinicians use. In another study Cao et al. performed \n10 min PSA-ACT assay in 10 % human serum using an automated SPR biosensor and \nobtained a detection limit of 18.1 ng mL\n-1\n that corresponds to LOD of 181 ng mL\n-1\nfor the \nwhole serum [9].  \n \nIn our study although 75% serum was used as assay matrix, the detection limit obtained \nwas 0.29 ng mL\n-1\n for a 8 min assay which corresponds to 0.39 ng mL\n-1\n tPSA in the whole \nserum indicating the good performance of the optimised assay. Additionally; although \nhigh concentration of serum was used for the assay, matrix buffer limited the non-specific \nbinding of the proteins on to sensor spots and allowed complete regeneration of the sensor \nsurface by short injections of 100 mM HCl and 20 mM NaOH. This enables the repeated \nuse of the same sensor chip for several times to analyse multiple serum samples to detect \ntPSA. \n \nThe experimental conditions reported in the literature vary between the assays \nsignificantly such as, assays in static or in flow, temperature, assay time and the antibody \nused against PSA. All these contribute to the assay sensitivity and hence make it difficult \nto compare the results effectively. When compared briefly to similar label-free PSA \nassays such as above, the assay developed in this study, with total 8 min reaction time, \nrepeated usability and LOD of 0.29 ng mL\n-1\n in 75% human serum, proves the advantage \nof the optimised assay format suitable for point of care system. Additionally due to it is \nbeing rapid and wide detection range the QCM assay developed outperforms the \ncommercial ELISA kits available for biomarker detection (Table 3).  \n \n \nEarly diagnosis of cancer biomarkers is essential for successful treatment of the disease. \nThe current biomarker tests are ELISA type and usually performed at centralised labs \nusing automated devices. In this work, a groundwork study was described for the use of \nQCM biosensor to perform cancer biomarker detection test. A new buffer was formulated \nto eliminate 98% of the non-specific human serum protein binding to the sensor surface. \n4 Conclusion \nPage 13 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n  Development of a QCM Assay for PSA Detection \n \n13 \n \nA sandwich assay using QCMA-1 affinity sensor chips resulted in detection of tPSA \nconcentrations as low as 0.29 ng mL\n-1\n in 75% human serum.\n \nShort assay time, repeated \nusability of the same sensor chip, ability to detect PSA in high serum concentrations and \nutilisation of a label-free detection method enables the optimised assay format a \npromising tool for clinical diagnosis\/prognosis.  \n \n \n \nAcknowledgements \n \nWe gratefully acknowledge Sierra Sensors GmbH for providing financial support for the \nstudy.  \n  \nPage 14 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n  Development of a QCM Assay for PSA Detection \n \n14 \n \nReferences \n[1] WHO, http:\/\/www.who.int\/mediacentre\/factsheets\/fs297\/en\/index.html, 2008. \n[2] I.E. Tothill, Biosensors for cancer markers diagnosis. Seminars in Cell & \nDevelopmental Biology 20 (2009) 55-62. \n[3] J. Ferlay, P. Autier, M. Boniol, M. Heanue, M. Colombet, and P. Boyle, Estimates of \nthe cancer incidence and mortality in Europe in 2006. Annals of Oncology 18 (2007) 581-\n592. \n[4] M.K. Brawer, and P.H. Lange, PSA in the screening, staging and follow-up of early-\nstage prostate cancer. A review of recent developments. World Journal of Urology 7 \n(1989) 7-11. \n[5] E.P. Diamandis, Prostate-specific antigen: Its usefulness in clinical medicine. Trends \nin Endocrinology and Metabolism 9 (1998) 310-316. \n[6] J. Okuno, K. Maehashi, K. Kerman, Y. Takamura, K. Matsumoto, and E. Tamiya, \nLabel-free immunosensor for prostate-specific antigen based on single-walled carbon \nnanotube array-modified microelectrodes. Biosensors and Bioelectronics 22 (2007) 2377-\n2381. \n[7] N.V. Panini, G.A. Messina, E. Salinas, H. Fernandez, and J. Raba, Integrated \nmicrofluidic systems with an immunosensor modified with carbon nanotubes for \ndetection of prostate specific antigen (PSA) in human serum samples. Biosensors and \nBioelectronics 23 (2008) 1145-1151. \n[8] P. Sarkar, P.S. Pal, D. Ghosh, S.J. Setford, and I.E. Tothill, Amperometric biosensors \nfor detection of the prostate cancer marker (PSA). International Journal of Pharmaceutics \n238 (2002) 1-9. \n[9] C. Cao, J.P. Kim, B.W. Kim, H. Chae, H.C. Yoon, S.S. Yang, and S.J. Sim, A strategy \nfor sensitivity and specificity enhancements in prostate specific antigen-[alpha]1-\nantichymotrypsin detection based on surface plasmon resonance. Biosensors and \nBioelectronics 21 (2006) 2106-2113. \n[10] J.W. Choi, D.Y. Kang, Y.H. Jang, H.H. Kim, J. Min, and B.K. Oh, Ultra-sensitive \nsurface plasmon resonance based immunosensor for prostate-specific antigen using gold \nnanoparticle-antibody complex. Colloids and Surfaces A: Physicochemical and \nEngineering Aspects 313-314 (2008) 655-659. \n[11] B. Schweitzer, S. Wiltshire, J. Lambert, S. O'Malley, K. Kukanskis, Z. Zhu, S.F. \nKingsmore, P.M. Lizardi, and D.C. Ward, Immunoassays with rolling circle DNA \namplification: A versatile platform for ultrasensitive antigen detection. Proceedings of the \nNational Academy of Sciences of the United States of America 97 (2000) 10113-10119. \n[12] T. Soukka, K. Antonen, H. Harma, A.-M. Pelkkikangas, P. Huhtinen, and T. \nLovgren, Highly sensitive immunoassay of free prostate-specific antigen in serum using \neuropium(III) nanoparticle label technology. Clinica Chimica Acta 328 (2003) 45-58. \n[13] Z. Ye, M. Tan, G. Wang, and J. Yuan, Preparation, Characterization, and Time-\nResolved Fluorometric Application of Silica-Coated Terbium(III) Fluorescent \nNanoparticles. Analytical Chemistry 76 (2004) 513-518. \n[14] K.S. Hwang, J.H. Lee, J. Park, D.S. Yoon, J.H. Park, and T.S. Kim, In-situ \nquantitative analysis of a prostate-specific antigen (PSA) using a nanomechanical PZT \ncantilever. Lab on a Chip - Miniaturisation for Chemistry and Biology 4 (2004) 547-552. \n[15] K.W. Wee, G.Y. Kang, J. Park, J.Y. Kang, D.S. Yoon, J.H. Park, and T.S. Kim, \nNovel electrical detection of label-free disease marker proteins using piezoresistive self-\nsensing micro-cantilevers. Biosensors and Bioelectronics 20 (2005) 1932-1938. \nPage 15 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n  Development of a QCM Assay for PSA Detection \n \n15 \n \n[16] Y.J. Ding, H.X. Lu, G.R. Shi, J. Liu, G.L. Shen, and R.Q. Yu, Cell-based \nimmobilization strategy for sensitive piezoelectric immunoassay of total prostate specific \nantigen. Biosensors & Bioelectronics 24 (2008) 228-232. \n[17] B. Zhang, X. Zhang, H.h. Yan, S.j. Xu, D.h. Tang, and W.l. Fu, A novel multi-array \nimmunoassay device for tumor markers based on insert-plug model of piezoelectric \nimmunosensor. Biosensors and Bioelectronics 23 (2007) 19-25. \n[18] S. Kurosawa, M. Nakamura, J.-W. Park, H. Aizawa, K. Yamada, and M. Hirata, \nEvaluation of a high-affinity QCM immunosensor using antibody fragmentation and 2-\nmethacryloyloxyethyl phosphorylcholine (MPC) polymer. Biosensors and Bioelectronics \n20 (2004) 1134-1139. \n[19] C. Situ, A.R.G. Wylie, A. Douglas, and C.T. Elliott, Reduction of severe bovine \nserum associated matrix effects on carboxymethylated dextran coated biosensor surfaces. \nTalanta 76 (2008) 832-836. \n[20] L. Fei, L. Yanbin, S. Xiao-Li, M.F. Slavik, Y. Yibin, and W. Jianping, QCM \nimmunosensor with nanoparticle amplification for detection of Escherichia coli O157:H7. \nSensing and Instrumentation for Food Quality and Safety 1 (2007) 161-168. \n[21] M.A. Cooper, and V.T. Singleton, A survey of the 2001 to 2005 quartz crystal \nmicrobalance biosensor literature: applications of acoustic physics to the analysis of \nbiomolecular interactions. Journal of Molecular Recognition 20 (2007) 154-184. \n[22] A. Janshoff, H.J. Galla, and C. Steinem, Piezoelectric mass-sensing devices as \nbiosensors - An alternative to optical biosensors? Angewandte Chemie-International \nEdition 39 (2000) 4004-4032. \n[23] S. Löfas, and A. McWhirter, The Art of Immobilization for SPR Sensors. in: J. \nHomola, (Ed.), Surface Plasmon Resonance Based Sensors, Springer, 2006. \n[24] R.L. Rich, and D.G. Myszka, Extracting affinity constants from biosensor binding \nresponses. in: M. Cooper, (Ed.), Label-Free Biosensors Techniques and Applications, \nCambridge University Press, 2009. \n[25] R. Karlsson, P.S. Katsamba, H. Nordin, E. Pol, and D.G. Myszka, Analyzing a \nkinetic titration series using affinity biosensors. Analytical Biochemistry 349 (2006) 136-\n147. \n[26] P.S. Katsamba, I. Navratilova, M. Calderon-Cacia, L. Fan, K. Thornton, M. Zhu, \nT.V. Bos, C. Forte, D. Friend, I. Laird-Offringa, G. Tavares, J. Whatley, E. Shi, A. \nWidom, K.C. Lindquist, S. Klakamp, A. Drake, D. Bohmann, M. Roell, L. Rose, J. \nDorocke, B. Roth, B. Luginbühl, and D.G. Myszka, Kinetic analysis of a high-affinity \nantibody\/antigen interaction performed by multiple Biacore users. Analytical \nBiochemistry 352 (2006) 208-221. \n[27] C.-W. Cheng, C.-K. Chen, Y.-S. Chen, and L.-Y. Chen, Determination of \nSchistosoma japonicum circulating antigens in dilution serum by piezoelectric \nimmunosensor and S\/N enhancement. Biosensors and Bioelectronics 24 (2008) 136-140. \n[28] C. Ayela, F. Roquet, L. Valera, C. Granier, L. Nicu, and M. Pugnière, Antibody-\nantigenic peptide interactions monitored by SPR and QCM-D: A model for SPR detection \nof IA-2 autoantibodies in human serum. Biosensors and Bioelectronics 22 (2007) 3113-\n3119. \n[29] J. Trevino, A. Calle, J.M. Rodriguez-Frade, M. Mellado, and L.M. Lechuga, \nDetermination of human growth hormone in human serum samples by surface plasmon \nresonance immunoassay. Talanta 78 (2009) 1011-1016. \n \n \n  \nPage 16 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n  Development of a QCM Assay for PSA Detection \n \n20 \n \nFigure 4. \n \n \n \n \n \n \n   \n  \n-200\n0\n200\n400\n600\n800\n1000\n0 200 400 600 800 1000 1200\nTim e (s)\n-d\nF\n (\nH\nz\n)\ntPSA spiked 75% serum\nAnti-tPSA modified \nAu nanoparticles\n100 mM HCl\na\nb\nPage 17 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n  Development of a QCM Assay for PSA Detection \n \n21 \n \nFigure 5. \n \n \n \n  \nR² = 0.94\nR² = 0.91\n0\n100\n200\n300\n400\n500\n0 25 50 75 100 125 150\n-d\nF \n(H\nz)\nPSA concentration (ng ml-1)\ny = 71.96ln(x) + 73.77\nR² = 0.99\n1\n101\n201\n301\n401\n501\n0.1 1.0 10.0 100.0 1000.0\n-d\nF \n(H\nz)\nPSA concentration (ng ml-1)\nb\na\nb\na\nA B\nPage 18 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n  Development of a QCM Assay for PSA Detection \n \n22 \n \n \nTable 1. Results of kinetic calculations for PSA direct assay. \n \nKD  = 5.56 × 10\n-10\n M \nKa = 1.23 × 10\n+06\n M\n-1 \ns\n-1 \nKd = 6.83 × 10\n-04\n s\n-1 \nRmax =  108 Hz \n \n \n  \nPage 19 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n  Development of a QCM Assay for PSA Detection \n \n23 \n \n \nTable 2. The summary of the PSA detection assay results. \n \n  \ndirect assay in \nPBS\/T \nsandwich assay \nin PBS\/T \nsandwich assay \nin 75% serum \nsandwich assay in \n75% serum using Au \nnanoparticles \nLOD  18.8 ng mL\n-1\n 4.7 ng mL\n-1\n 9.4 ng mL\n-1\n 0.29 ng mL\n-1\n \nLinear range 18.8 – 150 ng mL-1 4.7 – 150 ng mL-1 9.4 – 150 ng mL-1 0.29  – 150 ng mL-1 \n Equation \ny = 0.87x + 0.27 \n(R\n2\n = 1.00)* \ny = 0.91x + 0.35 \n (R\n2\n = 0.99)* \ny = 0.89x + 0.33 \n (R\n2\n = 0.98)* \ny = 71.96Ln(x)+73.77 \n(R\n2\n = 0.99) \n*y = log (response); x = log (concentration) \n \n  \nPage 20 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n  Development of a QCM Assay for PSA Detection \n \n24 \n \n \nTable 3. The summary of the PSA detection limit and detection ranges for some of the \ncommercial ELISA kits and the developed QCM assay. \n \n \nDetection range \n(ng mL\n-1\n) \nLimit of detection \n(ng mL\n-1\n) \nThe developed QCM assay*  0.39 – 200 0.39 \nAbazyme PSA ELISA kit 1 - 80 1 \nMP Biomedicals PSA ELISA kit 2 - 120 1 \nAlpco Diagnostics PSA ELISA kit 2 - 120 1 \nCalbiotech PSA ELISA kit 0.585 - 50 0.585 \nAlpha Diagnostic PSA ELISA kit 0.3-60 0.30 \n*Both detection range and limit is given based on 100% serum. \n \n"}