{"doi":"10.4028\/www.scientific.net","coreId":"140262","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/1777","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/1777","10.4028\/www.scientific.net"],"title":"New Advances in Forming Functional Ceramics for Micro Devices","authors":["Dorey, Robert A.","Rocks, Sophie A.","Dauchy, Florent","Navarro, A."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-10-10T00:00:00Z","abstract":"Micro electromechanical systems (MEMS) are finding uses in an increasing number of diverse applications. Currently the fabrication techniques used to produce such MEMS devices are primarily based on 2-D processing of thin films. The challenges faced by producing more complex structures (e.g. high aspect ratio, spans, and multi-material structures) require the development of new processing techniques. Potential solutions to these challenges based on low temperature processing of functional ceramics, selective chemical patterning, and micro-moulding are presented to show that it is possible to create complex functional ceramic structures which incorporate non-ceramic conducting and support structures. The capabilities of both techniques are compared and the relative advantages of each explored","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140262.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.4028\/www.scientific.net\/AST.45.2440","pdfHashValue":"597a70239691b6d63d5edc01185f69f8143821f8","publisher":null,"rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/1777<\/identifier><datestamp>2014-09-04T10:27:45Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>New Advances in Forming Functional Ceramics for Micro Devices<\/dc:title><dc:creator>Dorey, Robert A.<\/dc:creator><dc:creator>Rocks, Sophie A.<\/dc:creator><dc:creator>Dauchy, Florent<\/dc:creator><dc:creator>Navarro, A.<\/dc:creator><dc:subject>PZT<\/dc:subject><dc:subject>MEMS<\/dc:subject><dc:subject>microsystems<\/dc:subject><dc:description>Micro electromechanical systems (MEMS) are finding uses in an increasing number of diverse applications. Currently the fabrication techniques used to produce such MEMS devices are primarily based on 2-D processing of thin films. The challenges faced by producing more complex structures (e.g. high aspect ratio, spans, and multi-material structures) require the development of new processing techniques. Potential solutions to these challenges based on low temperature processing of functional ceramics, selective chemical patterning, and micro-moulding are presented to show that it is possible to create complex functional ceramic structures which incorporate non-ceramic conducting and support structures. The capabilities of both techniques are compared and the relative advantages of each explored.<\/dc:description><dc:date>2013-02-03T23:01:05Z<\/dc:date><dc:date>2013-02-03T23:01:05Z<\/dc:date><dc:date>2006-10-10T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>R.A. Dorey, S. Rocks, F. Dauchy, A. Navarro, New Advances in Forming Functional Ceramics for Micro Devices, Advances in Science and Technology, Volume 45, 2006, Pages 2440-2447<\/dc:identifier><dc:identifier>1662-8969<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.4028\/www.scientific.net\/AST.45.2440<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/1777<\/dc:identifier><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1662-8969","1662-8969"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":["PZT","MEMS","microsystems"],"subject":["Article"],"fullText":"Journal Advances in Science and Technology Vol. 45 (2006) pp. 2440-2447\nNew Advances in Forming Functional Ceramics for Micro Devices\nR.A. Dorey*, S. Rocks, F. Dauchy, A. Navarro\nCranfield University, Cranfield, Bedfordshire, MK43 0AL, UK\n*r.a.dorey@cranfield.ac.uk, s.rocks@cranfield.ac.uk, f.dauchy.2003@cranfield.ac.uk,\na.navarro@cranfield.ac.uk\nKeywords: lead zirconate titanate, composite sol gel, thick film, micro-moulding, wet\netching, MEMS\nAbstract: Micro electromechanical systems (MEMS) are finding uses in an increasing number of\ndiverse applications. Currently the fabrication techniques used to produce such MEMS devices are\nprimarily based on 2-D processing of thin films. The challenges faced by producing more complex\nstructures (e.g. high aspect ratio, spans, and multi-material structures) require the development of\nnew processing techniques.\nPotential solutions to these challenges based on low temperature processing of functional ceramics,\nselective chemical patterning, and micro-moulding are presented to show that it is possible to create\ncomplex functional ceramic structures which incorporate non-ceramic conducting and support\nstructures. The capabilities of both techniques are compared and the relative advantages of each\nexplored.\nIntroduction\nPiezoelectric functional ceramics, such as lead zirconate titanate (PZT), find applications in a range\nof devices including ultrasound transducers, actuators, and sensors [1, 2]. There exists a desire to\nreduce the size of these devices to increase performance, portability and applications. While large\nscale devices can be fabricated with ease using bulk materials that are shaped and assembled\ntogether, it becomes increasingly difficult to produce such structures at progressively smaller scales.\nTo achieve the required reductions in size will require the use of microscale assembly techniques\ninstead of traditional bulk processing routes. With microscale assembly techniques multiple\nmaterials are typically integrated and processed simultaneously. One of the primary issues that\nneeds to be overcome when integrating ceramics with other materials typically employed in micro\nelectromechanical systems (MEMS) (e.g. silicon, metals, glass) is the requirement for high\ntemperatures to bring about densification of the ceramic material [2, 3].\nThe authors have combined multiple approaches for ceramic processing to develop a technique for\nproducing structured thick (10 – 50µm) films. By combining low temperature sol gel processing\nwith sintering aid assisted powder processing it has been possible to produce ceramic films with\ndensities in the region of 80-95% theoretical density, at temperatures between 600 and 720ºC [4].\nSuch low sintering temperatures are possible due to the use of the sol gel material which both\nincreases the green density of the film beyond that achievable using powder processing alone, and\nfuses the powder particles together with a compositionally matched material. The incorporation of\nthe small amount of sintering aid is then sufficient to still further increase the density of the film by\n5-10% and consolidate the sol gel phase. Figure 1 shows an example of the cross-section of such a\ncomposite sol gel film showing the incorporation of a thin metallic electrode structure between two\nlayers of ceramic. The figure demonstrates that it is possible to co-process ceramic and metallic\nmaterials on a silicon substrate.\nJournal Advances in Science and Technology Vol. 45 (2006) pp. 2440-2447\nFig. 1 – SEM photomicrograph showing a fracture cross section of a multilayer composite sol gel\nfilm, on a silicon substrate, incorporating multiple metal electrode layers each approximately\n100nm thick.\nThe combined use of sol gel and powder processing has been demonstrated to be capable of\nrealising integrated film structures with the potential to use such technology to produce functional\nintegrated structures at low temperatures. The ability to integrate these materials to produce layered\nstructures is, however, not sufficient to realise a functioning device. In order to produce a\nfunctioning device is also necessary to structure these films on a fine scale. This can be technically\nchallenging due to the chemical inertness of many of these materials – especially ceramic materials.\nThis paper will present and compare two approaches to structuring functional ceramics. The two\napproaches described are both based on the application of the composite sol gel technique, with\neither material removal or moulding being used to create structured features.\nExperimental\nComposite sol gel. The composite sol gel approach has been described in detail in previous\npublications [4]. Briefly, a sol is mixed with ceramic powder (and a sintering aid if required) to\nproduce a slurry which can be spin coated onto a substrate. Table 1 gives details of the composition\nof the sol and suspension used for the two approaches. For the purposes of this comparison the\nslight differences in the compositions of the two systems can be ignored as they do not influence the\nprocessing conditions used.\nTable 1 – Composition of the sol gel and slurry used\nWet etching [5] Micro-moulding [6]\nSol composition Pb(Zr0.49 Ti0.51)O3\nlead acetate, zirconium isopropoxide,\ntitanium propoxide,\nacetic acid\/2-methoxyethanol solvent\nPb(Zr0.5 Ti0.5)O3\nlead acetate, zirconium isopropoxide,\ntitanium propoxide,\nacetic acid\/1-propanol solvent\nSlurry composition 1.5 g of PZ26 powder (Ferroperm):\n1ml sol\nCu2O + PbO (sintering aid)\nKR55 (Dispersant- Kenrich\npetrochemicals)\n1.5 g of PZ26 powder (Ferroperm):\n1ml sol\nKR55 (Dispersant- Kenrich\npetrochemicals)\nJournal Advances in Science and Technology Vol. 45 (2006) pp. 2440-2447\nWet etching. Continuous films were fabricated using the sol gel approach where the substrate was\ncoated with the slurry which was then spun off at 2000rpm for 30 seconds to produce a uniform\nfilm approximately 2.5 µm thick. The film was then dried at 200ºC and pyrolysed at 450ºC to\nconvert the sol gel phase to an amorphous oxide ceramic. The density of the composite layer was\nthen increased by infiltrating the layer with pure sol which was again spun at 2000rpm, dried and\n200ºC and pyrolysed at 450ºC. This process was repeated either 2, 3 or 4 times to produce films of\ndifferent densities. The film thickness was increased by depositing further composite\/sol layers until\nthe required film thickness had been achieved.\nTo structure the film a 5µm thick layer of photoresit (AZ4562) was deposited and selectively\nexposed to UV light, and developed to create a patterned mask on the surface of the PZT layer. A\nHCl\/HF etchant was then used to etch the exposed areas of PZT and in doing so produce structured\nPZT micro-features.\nMicro-moulding. To produce the micro-moulds a thick layer of photoresit (AZ4562) was first\ndeposited onto the surface of the substrate. The phororesit was then selectively exposed to UV and\ndeveloped to create the micro-moulds. The micro-moulds were filled by coating the wafer with the\ncomposite slurry and spinning the substrate at 2000rpm to remove the excess. Instead of drying the\ncomposite slurry at 200ºC the slurry was allowed to dry at room temperature prior to another\ncomposite layer being deposited. The high temperature drying stages were not conducted at this\nintermediate stage as they would have resulted in damage to the phororesist micro-moulds. Once\nthe micro-moulds had been filled the wafer was dried and pyrolysed in a furnace using a ramp rate\nof 2ºC\/min and a hold temperature of 600ºC for 20 minutes. This drying\/pyrolysis stage was\nconducted with the wafer suspended upside down to that any unwanted PZT would fall away from\nthe sample and not contaminate the sample.\nResults\nWet etching. Figure 3 shows an example of a structure realised using wet etching of a continuous\nfilm of PZT. During etching a non soluble product (PbClF) is produced and remains as a white\nprecipitate which slows the etching process [5, 7]. For thin film processing this PbClF is typically\nremoved using a HNO3 wash at the end of the etching process. The presence of this residue during\netching does not result in a significant decrease in the etching rate of thin films as only a small\namount of material is formed. For etching of thick film structures the presence of larger amounts of\nPbClF can cause a noticeable decrease in the etching rate. Unfortunately, it is not possible to\nremove this precipitate at regular intervals as the HNO3 wash also removes the protective photoresit\nfrom the PZT. Instead a final water wash, with ultrasonic agitation, is used to remove the PbClF\nproduct at the end of the etcing process.\nThe structure shown in figure 3 demonstrates the small structures can be produced using this\netching process. The figure also clearly shows the characteristic side wall profile of the structures\nproduced. These characteristic sloped side walls are a results of the isotropic nature of the etching\nprocess where material is removed at the same rate in the through-thickness direction as is removed\nin the in-plane direction. The uniform etch wall shown in figure 3 is characteristic of etching of an\nisotropic material. Figure 4 shows how the profile achieved can be radically altered if an anisotropic\nmaterial is etched. In this case a larger number of intermediate sol infiltrations have been used with\nthe result that an inhomogeneity is introduced at the surface of each composite layer. This subtle\nchange in material properties (in particular etch characteristics) results in the through-thickness etch\nprocesses being momentarily slowed in relation to the in-plane etch process with the result that a\nstepped structure is obtained.\nJournal Advances in Science and Technology Vol. 45 (2006) pp. 2440-2447\nFig. 3 – SEM photomicrograph of PZT structure produced by wet etching a homogenous thick\n(~21µm) continuous film.\nFig. 4 – SEM photomicrograph of PZT structure produced by wet etching an inhomogenous thick\n(~40 µm) continuous film.\nMicro-moulding. Structures of comparable size can also be produced using the micro-moulding\ntechnique as can be seen in figure 5. Using the micro-moulding process the shapes are formed\ndirectly within moulds. In comparison to the edge profile of the features produced using wet\netching, the features produced using the micro-moulding technique exhibit more defined edge\nprofiles.\nFigure 5 also shows some of the defects that can occur when processing structures using the micro-\nmoulding technique. These defects occur when some of the ceramic material remains on top of the\npolymeric mould material. Where this occurs material may remain in place bridging two regions as\ncan be seen between the two vertical lines in figure 5. Alternatively, such bridges may break away\ncausing damage to the remaining structure as can be seen at the corners of the horizontal section.\nJournal Advances in Science and Technology Vol. 45 (2006) pp. 2440-2447\nFig. 5 – SEM photomicrograph of PZT structure produced using micro-moulding technique\nComparison of shaping techniques\nOverview. For the purposes of comparing the two shaping techniques it is useful to consider the\ngeometric requirements of a generic MEMS device. Typically the ability to produce small structures\nand to position them accurately and close to each other will be of interest. It is, therefore,\nappropriate to consider the minimum feature size achievable, accuracy and resolution as indicators\nof shaping capability. Table 2 and figure 6 provide a summary of the relative capabilities of the two\ntechniques in relation to the 3 shaping indicators.\nJournal Advances in Science and Technology Vol. 45 (2006) pp. 2440-2447\nFig 6. – Schematic representation of the relative limiting factors of the wet etching and micro-\nmoulding technuqes\nMinimum feature size achievable. For the wet etching process the minimum feature size\nachievable is primarily limited by the ability to control the etching process. Provided this is\ncontrolled it is possible to produce features with very small size. It should be noted, however, that\nthis small size will only relate to the top surface of the feature. As the features exhibit a marked side\nwall slope, the base of the feature will be significantly larger than the top. The ultimate extension of\nthis would the production of micro-pyramids where the tip of the pyramid is a point and the base is\nbetween 2 and 3 times the film thickness across.\nAccuracy. Both techniques use photolithograpy as a basis for positioning the features relative to\neach other. As this process is based on producing a chrome-glass shadow mask the positioning\naccuracy is dictated by the production of the shadow mask and subsequent photolithography\nprocess. In this respect the position of each feature relative to the other features is fixed by the\nquality of the mask produced.\nJournal Advances in Science and Technology Vol. 45 (2006) pp. 2440-2447\nThe exact control of the size of the final features is, however, subject to experimental variations. In\nthe case of wet etching, the etching time will influence the amount of material removed so that\nshorter etch times will result in larger features while longer etch time will result in smaller features.\nFor the micro-moulding process shrinkage\/swelling of the photoresit moulds will affect the\ndimensions of the final features. This degree of shrinkage\/swelling is much less than the size\nchanges observed when etching times are varied. In this respect micro-moulding has the potential to\nprovide greater accuracy in terms of final feature size.\nResolution. The resolution of the two processes are both dependent on the resolution of the\nphotolithographic process as without being able to resolve individual features in the photoresit\nstructure it will not be possible to create features. In addition to this criteria a second criteria based\non the interactions of the film must also be considered. With wet etching the isotropic etch\ncharacteristic of the material imposes a far larger limitation on the resolution. As has been shown in\nfigures 3 and 4, the resultant features exhibit a sloped side wall meaning that for a structure to be\nseparated at the base the separation at the top will be related to the slope of the side wall angle. In\npractice this equates to a spacing of between 2 and 3 times the film thickness. Hence the resolution\nof the wet etching process is strongly dependent on the film thickness. When micro-moulding is\nused the resolution is dependent on the ability to create a self supporting photoresit ‘wall’ in the fist\ninstance, and to remove the photoresit and any excess ceramic material remaining above the\nphotoresit. In practice it is the ability to create the self supporting photoresit ‘wall’ which will limit\nthe ultimate resolution of the process. This becomes particularly critical as the height of the mould\ncavities increase and the aspect ratio of these separating walls must increase.\nTable 2 – comparison of capabilities of wet etching and micro-moulding in terms of minimum\nfeature size, positioning accuracy and resolution\nWet etching Micro-moulding\nMinimum feature size Low angle side walls.\nMinimum size of feature near\ntop surface controlled by\ncontrol of etching. Minimum\nsize of feature at base is a\nfunction of etch wall angle and\nfilm thickness.\nHigh angle side walls.\nMinimum size of feature\nrelated to ability to fill mould\nand for structure to be self\nsupporting\nAccuracy Relative position of features to\neach other defined by the\nphotolithographic process.\nSize of final shape dictated by\nunder- or over-etch conditions.\nRelative position of features to\neach other defined by the\nphotolithographic process.\nSize of final shape dictated by\nshrinkage\/swelling of\nphotoresit mould and slurry\nink.\nResolution Low angle side walls.\nProximity of two adjoining\nfeatures dictated by etch wall\nangle and film thickness.\nRelated to ability to create self\nsupporting photoresist wall and\nsuccessfully remove photoresist\nand excess material after\nmoulding process.\nSummary. Both the micro-moulding and the wet etching technique can be used to produce a range\nof shaped functional ceramic features for integration into MEMS devices. Micro-moulding allows\nstructures with high side wall angles to be fabricated which could be advantageous for smaller\nJournal Advances in Science and Technology Vol. 45 (2006) pp. 2440-2447\nstructures where deviations from ‘ideal’ shapes may cause problems. However, with larger area\nstructures such slight changes in the shape would not be expected to have significant effects on the\nperformance of any devices produced.\nWhen considering micro-moulding the height of the feature is ultimately controlled by the thickness\nof the photoresist that can be deposited and patterned. The photoresist used in this study (AZ4562)\nis suitable for creating micro-moulds a few 10’s of micrometres high using standard UV lithography\ntechniques. However, to create much deeper moulds it would be necessary to use an alternative\nphotoresit (e.g. SU8) which may be significantly more difficult to remove without damaging the\nceramic structures produced.\nConclusions\nTwo techniques for shaping functional ceramics for use in integrated micro devices have been\ndescribed. The techniques, based on low temperature thick film processing, make use of selective\nmaterial removal and micro-moulding to create features with heights (or thicknesses) of a few\nmicrometres to a few 10’s of micrometres and widths\/lengths ranging from a few micrometres\nupwards.\nEach technique has relative advantages and disadvantages which limit the resolution, accuracy or\nminimum features size. In general, micro-moulding is most suitable for situations where small\nfeatures with high angle walls are required, while wet etching is more applicable to larger features\nwhere side wall definition is not as critical. However, used as part of suite of techniques, both\napproached offer potential to create a new generation of integrated functional devices combining a\nrange of materials including silicon, ceramics, metals and glasses.\nReferences\n[1] N. Setter: J.Euro.Ceram.Soc. Vol. 21 (2001), pp1279-1293.\n[2] R.A. Dorey, R.W. Whatmore: J. Electroceramics, Vol. 12 (2004), pp19-32.\n[3] S.M. Spearing: Acta mater. Vol. 48 (2000), pp179-196.\n[4] R.A. Dorey, S.B. Stringfellow, R. W. Whatmore: J.Euro.Ceram.Soc. Vol. 22 (2002), pp2921-\n2926\n[5] F. Dauchy, R.A. Dorey: Proceedings of the 4M conference 2005 (Elsevier).\n[6] A. Navarro, S.A. Rocks, R.A. Dorey: to be published in J. Electroceramics.\n[7] K. Zheng, J. Lu, J. Chu: Microprocesses and Nanotechnology Conference International 2003\nDigest of Papers Vol. 29-31 (2003), pp 248-249\n"}