{"doi":"10.1103\/PhysRevE.75.045601","coreId":"100751","oai":"oai:epubs.surrey.ac.uk:146","identifiers":["oai:epubs.surrey.ac.uk:146","10.1103\/PhysRevE.75.045601"],"title":"Chaotic bound state of localized structures in the complex Ginzburg-Landau equation","authors":["Turaev, D","Vladimirov, AG","Zelik, S"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-04-01","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"AMERICAN PHYSICAL SOC","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:146<\/identifier><datestamp>\n      2017-10-31T13:56:57Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:6D617468737075626C<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/146\/<\/dc:relation><dc:title>\n        Chaotic bound state of localized structures in the complex Ginzburg-Landau equation<\/dc:title><dc:creator>\n        Turaev, D<\/dc:creator><dc:creator>\n        Vladimirov, AG<\/dc:creator><dc:creator>\n        Zelik, S<\/dc:creator><dc:publisher>\n        AMERICAN PHYSICAL SOC<\/dc:publisher><dc:date>\n        2007-04-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/146\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Turaev, D, Vladimirov, AG and Zelik, S  (2007) Chaotic bound state of localized structures in the complex Ginzburg-Landau equation   PHYSICAL REVIEW E, 75 (4), ARTN 0.       <\/dc:identifier><dc:relation>\n        10.1103\/PhysRevE.75.045601<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/146\/","10.1103\/PhysRevE.75.045601"],"year":2007,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Chaotic bound state of localized structures in the complex Ginzburg-Landau equation\nDmitry Turaev,1,* Andrei G. Vladimirov,2,† and Sergey Zelik3,‡\n1Ben Gurion University, P.O.B. 653, 84105 Be’er Sheva, Israel\n2Weierstrass Institute for Applied Analysis and Stochastics, Mohrenstrasse 39, D - 10117 Berlin, Germany\n3Department of Mathematics, University of Surrey, Guildford, GU2 7XH United Kingdom\n\u0001Received 17 July 2006; revised manuscript received 29 December 2006; published 11 April 2007\u0002\nStable dynamic bound states of dissipative localized structures are found. It is characterized by chaotic\noscillations of distance between the localized structures, their phase difference, and the center of mass velocity.\nDOI: 10.1103\/PhysRevE.75.045601 PACS number\u0001s\u0002: 05.45.\u0001a, 42.65.Sf, 42.65.Tg\nThe complex Ginzburg-Landau equation describes the on-\nset of instability near a Hopf bifurcation in spatially extended\nsystems and, therefore, serves as a universal model for vari-\nous physical phenomena in hydrodynamics, superconductiv-\nity, and optics. In a certain parameter range this equation\nexhibits a spatially localized solution—a dissipative soliton.\nIn the classical setting with purely cubic nonlinearity, the\nsoliton is unstable, so the next order nonlinear terms should\nbe taken into account in order to describe stable solitons \u00031\u0004.\nIndeed, the quintic complex Ginzburg-Landau equation\n\u0001QCGLE\u0002 is widely used in nonlinear optics to describe phe-\nnomena related to pulse formation, e.g., mode locking in\nlasers \u00032,6\u0004, light propagation in nonlinear fibers \u00033\u0004, and\ntransverse pattern formation in nonlinear optical systems \u00034\u0004.\nIn particular, in mode-locked fiber lasers dissipative solitons\nappear as short optical pulses propagating along the cavity\naxis. Well separated from one another, the pulses interact via\nexponentially decaying tails. Interference between the tails\ncan produce spatial intensity oscillations responsible for the\nformation of bound states \u0001BS’s\u0002 of the dissipative solitons\n\u0001see, e.g., experimental studies in Refs. \u00035,6\u0004\u0002. Up to now,\neither stationary and uniformly moving \u00037–9\u0004, or uniformly\nrotating \u000310,11\u0004 BS’s were reported. Here we show that a\nslight breaking of the phase-shift symmetry yields a huge\nvariety of dynamic BS’s, characterized by undamped regular\nor chaotic oscillations of the solitons positions and phases.\nIn the course of weak interaction the shape of the solitons\nis preserved, while their positions and certain internal param-\neters, such as phases, evolve slowly in time. The Gorshkov-\nOstrovsky approach \u000313,14\u0004 allows one to derive a set of\nfinite-dimensional soliton interaction equations \u0001SIE\u0002 gov-\nerning the slow evolution of the soliton parameters. Being\nindependent of the specific details of a model, the form of\nSIE is determined by the asymptotical behavior of the soliton\ntails and by the symmetries of the model. When the model\nadmits only translational symmetry, SIE have a gradient\nstructure \u0001see, e.g., Ref. \u000314\u0004\u0002, which implies a trivial dynam-\nics for the weakly interacting solitons. For QCGLE, the ad-\nditional phase-shift symmetry changes the structure of SIE.\nStill, the dynamics of the weak two-soliton interaction re-\nmains simple and the only attractors are BS’s with time-\nindependent distance and phase difference between the soli-\ntons \u00038,9\u0004. We show that instead of making the interaction\ndynamics simpler the phase symmetry breakdown leads to\nthe explosion of the complexity of the two-soliton dynamics\n\u0001the gradient structure restores only at relatively large values\nof the symmetry-breaking parameter\u0002. Note that the localized\nin space and chaotic in time regimes which we discover are\nvery different from the earlier known ones, for whom the\nchaos was a feature of the internal dynamics of a single\nsoliton \u000312\u0004 or was related to a scattering process with un-\nbounded soliton trajectories \u000315\u0004. In our case, chaos is asso-\nciated with a strange attractor that forms solely due to the\nweak soliton interaction.\nWe consider 1+1 dimensional QCGLE in the form\n\u0001tA = \u0001\u0002 + i2\u0002\u0001xxA + A\u0003\u0003 + \u0001\u0004 + i\u0002\u0005A\u00052 + \u0001\u0005 + i\u0006\u0002\u0005A\u00054\u0004\n+ \u0007 exp\u0001i\bt\u0002 , \u00011\u0002\nwith complex amplitude A\u0001x , t\u0002. Equation \u00011\u0002 is symmetric\nwith respect to spatial translations, and at \u0007=0 with respect\nto the phase shifts A→A exp\u0001i\t\u0002. The parameter \u0002\n0 is the\ndiffusion coefficient \u0001the second-order dispersion is scaled to\n1\/2\u0002, \u0003\n0 describes linear losses; \u0004, \u0005, and \u0006 define the\nshape of nonlinearity. An important application concerns\nKerr-lens mode-locked lasers \u00036\u0004. Then, A is a normalized\nelectromagnetic field envelope, and the symmetry breaking\nterm \u0007 exp\u0001i\bt\u0002 corresponds to a weak signal injected into\nthe laser.\nLet A=A0\u0001x\u0002exp\u0001i\u000bt\u0002 be a soliton solution at \u0007=0. Away\nfrom the soliton core, A0\u0001x\u0002 decays exponentially:\nA0\u0001x\u0002 \u0006 p exp\u0003\u0001− \f + i\r\u0002\u0005x\u0005\u0004 as \u0005x\u0005→ \u000e . \u00012\u0002\nThe stability of the soliton is determined by the spectrum of\nthe operator L0 obtained by the linearization of the right-\nhand side of Eq. \u00011\u0002 on the soliton at \u0007=0. Note that L0 has\ntwo neutral modes, \u000f\u0001x\u0002= iA0\u0001x\u0002 and \u0010\u0001x\u0002=\u0001xA0\u0001x\u0002, corre-\nsponding, respectively, to the phase shift and translational\nsymmetries of the unperturbed QCGLE. It follows that the\nadjoint operator L0† has two neutral modes as well, \u000f†\u0001x\u0002 and\n\u0010†\u0001x\u0002. We fix their choice by the normalization conditions\n\u0007\n−\u000e\n\u000e \u000f†\u000fdx=1 and \u0007\n−\u000e\n\u000e \u0010†\u0010dx=1. Note that\n\u000f†\u0001x\u0002 \u0006 qe\u0001−\f+i\r\u0002\u0005x\u0005, \u0010†\u0001x\u0002 \u0006 se\u0001−\f+i\r\u0002\u0005x\u0005, \u00013\u0002\nas \u0005x \u0005→\u000e, with certain complex constants q and s.\n*Electronic address: turaev@math.bgu.ac.il\n†Electronic address: vladimir@wias-berlin.de\n‡Electronic address: S.Zelik@surrey.ac.uk\nPHYSICAL REVIEW E 75, 045601\u0001R\u0002 \u00012007\u0002\nRAPID COMMUNICATIONS\n1539-3755\/2007\/75\u00014\u0002\/045601\u00014\u0002 ©2007 The American Physical Society045601-1\nUp to the leading order in exp\u0001−\fr\u0002 \u0001where r is the dis-\ntance between the solitons\u0002, a BS of two weakly interacting\nsolitons has the form\nA = exp\u0001i\u000bt\u0002\u0003A0\u0001x − x1\u0002ei\u00111 + A0\u0001x − x2\u0002ei\u00112\u0004 , \u00014\u0002\nwhere the coordinates x1,2 and phases \u00111,2 of the individual\nsolitons are slowly varying functions of time t. By plugging\nthis ansatz into Eq. \u00011\u0002 and projecting the resulting equations\nonto the tangent to the space of functions of type \u00014\u0002, we\nobtain the following SIE:\n\u0001tr = ae\n−\fr sin\u0001\rr + \u00121\u0002cos \u0011 , \u00015\u0002\n\u0001t\u0011 = − be−\fr cos\u0001\rr + \u00122\u0002sin \u0011 − c\u0007 sin\n\u0011\n2\nsin\n\u0013\n2\n, \u00016\u0002\n\u0001t\u0013 = be−\fr sin\u0001\rr + \u00122\u0002cos \u0011 + c\u0007 cos\n\u0011\n2\ncos\n\u0013\n2\n+ 2\u0014 ,\n\u00017\u0002\nV = − ae−\fr cos\u0001\rr + \u00121\u0002sin \u0011 , \u00018\u0002\nwhere r=x2−x1, \u0011=\u00112−\u00111, \u0013=\u00111+\u00112−2\u0015, and\nV=\u0001t\u0001x1+x2\u0002 \/2. The parameter \u0014=\b−\u000b is the frequency\ndetuning between the injected field and the single soliton\nsolution. The other parameters are defined by\n−a exp\u0001i\u00121\u0002 \/q=b exp\u0001i\u00122\u0002 \/s=4p\u0003\u0001\f−2\u0002\r\u0002− i\u0001\r+2\u0002\f\u0002\u0004 and\nc exp\u0001i\u0015\u0002=4\u0007\n−\u000e\n\u000e \u000f†dx, where p, q, s are given by Eqs. \u00012\u0002 and\n\u00013\u0002.\nFor more details on the derivation of the SIE, see Ref. \u00039\u0004.\nBeing obtained formally, using a multiscale method, Eqs.\n\u00015\u0002–\u00018\u0002 require a justification. The strongest one is given by\nthe “invariant manifold theorem” of Ref. \u000316\u0004. It is a general\nstatement which holds for all multisoliton weak interaction\nprocesses in a large class of PDE’s under the condition of a\nnonzero diffusion. In our case, for \u0002\u00020, the theorem ensures\nthe existence of a closed set of four ODE’s \u0001“the true SIE”\u0002\nwhich give an exact description of the weak interaction of\ntwo solitons, valid uniformly on unbounded time intervals.\nMoreover, it follows from the proof, that the formal scheme\nemployed in the derivation of Eqs. \u00015\u0002–\u00018\u0002 yields an\no\u0003exp\u0001−\fr\u0002\u0004 approximation to the true SIE. Note the impor-\ntance of the nonzero diffusion: for conservative systems, for\nexample, the long-time validity of SIE must be questioned.\nFor \u0007=0 the phase-shift symmetry is retained and Eq. \u00017\u0002\nfor the sum of the soliton phases \u0013 decouples from the other\nequations. Then the dynamics of the soliton interaction is\ndescribed by the two-dimensional system\n\u0001tr = a exp\u0001− \fr\u0002sin\u0001\rr + \u00121\u0002cos \u0011 ,\n\u0001t\u0011 = − b exp\u0001− \fr\u0002cos\u0001\rr + \u00122\u0002sin \u0011 . \u00019\u0002\nThis system is reversible, i.e., invariant under the transfor-\nmation t→−t, \u0011→\u0016−\u0011. As usual in dimension two, the\nreversibility implies integrability. The integral is\nH = sin \u0011 exp\u0003− br sin\u0001\u00122 − \u00121\u0002\/a\u0004\u0005sin\u0001\rr + \u00121\u0002\u0005b cos\u0001\u00122−\u00121\u0002\/\u0001a\r\u0002.\nThe orbits of Eq. \u00019\u0002 comprise the level lines of H, so the\nphase portrait can easily be recovered. Depending on the\nsign of \u0017=ab\r cos\u0001\u00122−\u00121\u0002, two types of phase portraits are\npossible \u00039\u0004. Here we consider only the case \u0017\n0 when the\norbits are closed curves surrounding the neutrally stable\nequilibria Sk±\u0016\/2 : \b\u0011= ±\u0016 \/2 ,\rr+\u00122=\u0016\u0001k+1\/2\u0002\t \u0003Fig. 1\u0001a\u0002\u0004.\nIt follows from Eq. \u00018\u0002 that the ±\u0016 \/2-out-of-phase equilibria\ncorrespond to uniformly moving two-soliton states. The\nsaddle equilibria correspond to stationary BS’s, in-phase\nSk0 : \b\u0011=0,\rr+\u00122=2\u0016k\t and antiphase Sk\u0016 : \b\u0011=\u0016, \rr+\u00122\n=\u0016\u00012k+1\u0002\t. The separatrices of the saddles divide the phase\nplane into cells, from which the orbits can never escape \u0003Fig.\n1\u0001a\u0002\u0004.\nThe higher-order corrections destroy the reversibility, and\nhence the integrability, of Eqs. \u00019\u0002. Indeed, it is seen from\nFig. 1\u0001b\u0002 where the results of a direct simulation of Eq. \u00011\u0002\nare presented \u0001cf. Ref. \u00038\u0004\u0002, that rather than being closed,\norbits slowly spiral towards the weakly stable\n±\u0016 \/2-out-of-phase equilibria. Furthermore, the cells bound-\naries break: an orbit can flow from cell to cell until it is\ncaptured to one of the ±\u0016 \/2-out-of-phase BS’s, or leaves the\nweak interaction zone.\nThe boundary of this zone essentially coincides \u0001cf. Ref.\n\u00038\u0004\u0002 with the inner boundary of the cell shown in Fig. 1\u0001a\u0002. In\nour case the strong interaction does not produce interesting\neffects: its usual outcome is a collapse of the two-soliton\nsolution into a single soliton, as it is shown in Fig. 2. A\ndetailed discussion of validity of the weak interaction ap-\nproximation can be found in Ref. \u000316\u0004. Numerical study of\nstrong interaction of dissipative solitons was performed, e.g.,\nin Ref. \u000311\u0004.\nWhen \u0007\u00020, Eq. \u00017\u0002 couples with Eqs. \u00015\u0002 and \u00016\u0002. The\ndynamics is then determined by the ratios between \u0007, \u0014, and\nr cosφ\n-3 -2 -1 0 1 2 3\nS00\nS10\nS0π\nS1π\nS0+π\/2\nr cosφ\n-3 -2 -1 0 1 2 3\nr\nsi\nn\nφφ φφ\n-3\n-2\n-1\n0\n1\n2\n3\nS0−π\/2\nS0π\nS1π\nS10\nS00\nS0+π\/2\nS0−π\/2\n(a) (b)\nFIG. 1. Phase portraits obtained by numerical solution of \u0001a\u0002 the\nSIE \u00019\u0002 and \u0001b\u0002 the QCGLE \u00011\u0002 at \u0007=0. The parameters in all the\nfigures are \u0002=0.5, \u0003=0.02, \u0004=1.8, \u0005=0.05, \u0006=0.05. This corre-\nsponds to \r=−2.149, \f=5.195, a=0.118, b=7.55\u001810−4,\n\u00121=6.82\u001810−4, \u00122=2.25 in the SIE.\ntime 225000\n8\nx\nFIG. 2. Merging of two weakly interacting solitons after a tran-\nsition into the strong interaction zone. The bright spots correspond\nto higher values of \u0005A\u0005.\nTURAEV, VLADIMIROV, AND ZELIK PHYSICAL REVIEW E 75, 045601\u0001R\u0002 \u00012007\u0002\nRAPID COMMUNICATIONS\n045601-2\nexp\u0001−\fr\u0002. Let us show that chaos should be expected when\n\u0014\u0002\u0007, exp\u0001−\fr\u0002. Indeed, as the sum of the soliton phases \u0013\nrotates with nonzero velocity in this case, \u0013 can be taken as\na new time variable. Thus, the system \u00015\u0002–\u00017\u0002 is, effectively,\na periodically forced conservative integrable system \u00019\u0002.\nSuch systems do exhibit a chaotic behavior due to the de-\nstruction of resonances. So, near every resonance zone, i.e.,\nin the vicinity of those periodic trajectories of Eqs. \u00019\u0002 for\nwhich the increment of \u0013 during the period is commensurate\nwith 4\u0016, the soliton interaction dynamics can be chaotic.\nSince the higher-order corrections introduce a weak dissipa-\ntion into the SIE, most of the resonances are, in fact, erased.\nHowever, as we will see below, the chaotic dynamics pro-\nduced by the strongest resonances survives.\nOne more possibility for chaos is the splitting of the cell\nboundaries. As the phase \u0013 rotates, the in-phase and an-\ntiphase equilibria of Eqs. \u00019\u0002 become saddle periodic orbits\nof Eqs. \u00015\u0002–\u00017\u0002 at \u0007\u00020, and their stable and unstable mani-\nfolds may intersect. Thus, zones of a “metastable” ho-\nmoclinic chaos can be formed. This type of behavior is char-\nacterized by large oscillations in phase difference \u0019, i.e., we\nsee chaotic transitions between the cells in the \u0001r ,\u0019\u0002 plane\n\u0003Fig. 6\u0001g\u0002\u0004.\nIt is noteworthy that the spatial motion of chaotic BS’s is,\neffectively, a random walk at large time scales: as Eq. \u00018\u0002\nshows, when the dynamics of r and \u0011 is chaotic, the center of\nmass velocity V is a random function of time \u0001with a certain\nnonzero decay of correlation time\u0002, so the spatial position of\nthe chaotic BS is an integral of a random signal.\nAnother, nonrotational mechanism of chaos creation in\nthe SIE is related to multiple bifurcations of equilibrium\nstates. As we mentioned, the equilibria of Eqs. \u00019\u0002 corre-\nspond, in general, to periodic orbits of Eqs. \u00015\u0002–\u00017\u0002.\nHowever, at moderate values of \u0014 \/\u0007, due to a synchroniza-\ntion phenomenon, BS’s with stationary r, \u00111, and \u00112 can\nform \u0001see Fig. 3\u0002. The stability domains for the\n±\u0016 \/2-out-of-phase and in-phase equilibria of Eqs. \u00015\u0002–\u00017\u0002\nare shown in Figs. 4\u0001a\u0002 and 4\u0001b\u0002, respectively. The birth of\n±\u0016 \/2-out-of-phase equilibria is accompanied here by a si-\nmultaneous Andronov-Hopf bifurcation, i.e., in addition to a\nzero characteristic eigenvalue these equilibria have a pair of\npure imaginary eigenvalues. Such double bifurcation is\nknown \u0001see Ref. \u000317\u0004\u0002 to lead to a chaotic behavior via a\nShilnikov homoclinic loop. Another multiple instability, also\nleading to Shilnikov chaos \u000318\u0004, corresponds to a triplet of\nzero characteristic eigenvalues of the ±\u0016 \/2-out-of-phase\nequilibrium at \u0005\u0014 \u0005 =c \u0005\u0007 \u0005 \/\n8= \u0001\n\u0017+b2 \/4±b \/2\u0002exp\b−\f\u0003\u0016\u0001k\n+1\/2\u0002−\u00122\u0004 \/\r\t. While higher order corrections to SIE\n\u00015\u0002–\u00017\u0002 cause a decrease in the multiplicity of the local bi-\nfurcations, the chaos associated with them has to persist nev-\nertheless.\nThe above analysis is confirmed by the results of simula-\ntions of Eq. \u00011\u0002. The two-soliton solutions of Eq. \u00011\u0002 have, at\neach t, two points of maximum of \u0005A\u0001x , t\u0002\u0005. We identify them\nwith the soliton positions, x1,2\u0001t\u0002; the soliton phases \u00111,2 are\nthen defined as the phases of A(x1\u0001t\u0002 , t) and A(x2\u0001t\u0002 , t). As\none can see from Figs. 5 and 6, the dynamics of two-soliton\nstates of Eq. \u00011\u0002 can be well represented by the behavior of\nthe variables r\u0001t\u0002=x2−x1 and \u0011\u0001t\u0002=\u00112−\u00111. Figure 5\u0001a\u0002\nshows the evolution \u0001the “bifurcation tree”\u0002 for the\n\u0016 \/2-out-of-phase regime with the change of the injected sig-\nnal amplitude \u0007. Away from the synchronization range, the\nregime undergoes a number of period-doubling and period-\ntripling bifurcations \u0001strong 1:2 and 1:3 resonances\u0002 leading,\nin particular, to chaotic behavior \u0003see Fig. 5\u0001b\u0002\u0004. Different\nother dynamical regimes are shown in Fig. 6 where the phase\nportraits in the upper row are obtained by the numerical so-\nx\n0 2 4 6 8\n-4\n-2\n0\n2\n4\n6\n|A|\nφ\nx\n0 2 4 6 8\n0\n2\n4\n6 |A|\nφ\n(a) (b)\nFIG. 3. Stable BS’s with the phase difference \u0001a\u0002 \u0019=\u0016 \/2 and\n\u0001b\u0002 \u0019=0 between the solitons.\nFIG. 4. Stability domains \u0001grey\u0002 of the \u0016 \/2-out-of-phase and\nin-phase BS’s on the \u0001\u0007 ,\u0014\u0002 parameter plane.\nr cos φ\n-1 0 1\nr\nsi\nn\nφφ φφ\n1.5\n1.7\n1.9\nΩ\n-22.5 -22.4 -22.3 -22.2\nr\n1.4\n1.6\n1.8\n2.0\n2.2\nO _\n(a) (b)\nFIG. 5. Simulation results for the QCGLE: \u0001a\u0002 bifurcation tree\ncalculated for \b=−22.2; \u0001b\u0002 period three, \u0007=0.065; \u0001c\u0002 chaotic,\n\u0007=0.06623; \u0001d\u0002 period two, \u0007=0.08; \u0001e\u0002 period six, \u0007=0.083, soli-\nton BS.\n0.0 0.1\nr\nsi\nn\nφφ φφ\n1.7\n1.8\n1.9\n_\n-1 0 1\n1.2\n1.4\n1.6\n1.8\n2.0\nr cos φ\n-2 -1 0 1 2\n-2\n-1\n0\n1\n2\neta=0.02 Delta=0.023\nr cos φ\n-0.1 0.0 0.1 0.2\nr\nsi\nn\nφφ φφ\n1.7\n1.8\n1.9\nr cos φ\n-3 -2 -1 0 1 2\n-2\n-1\n0\n1\n2\neta=0.02, Delta=0.11\nr cos φ\n-1 0 1\n1.4\n1.6\n1.8\n2.0\n-2 -1 0 1 2\n-2\n-1\n0\n1\n2\n-2 -1 0 1 2\n0\n1\n2\n(a) (b) (c) (d)\n(e) (f) (g) (h)\nFIG. 6. Phase portraits obtained by solving numerically the\nQCGLE \u0001a\u0002–\u0001d\u0002 and SIE \u0001e\u0002–\u0001h\u0002. \u0001a\u0002 \u0007=0.02, \b=−22.3465;\n\u0001b\u0002 \u0007=0.4, \b=−22.2; \u0001c\u0002 \u0007=0.06, \b=−22.2; \u0001d\u0002 \u0007=0.02,\n\b=−22.25; \u0001e\u0002 \u0007=0.02, \u0014=−0.0164; \u0001f\u0002 \u0007=0.02, \u0014=0.023; \u0001g\u0002\n\u0007=0.02, \u0014=0.11; \u0001h\u0002 \u0007=0.11, \u0014=0.41.\nCHAOTIC BOUND STATE OF LOCALIZED STRUCTURES… PHYSICAL REVIEW E 75, 045601\u0001R\u0002 \u00012007\u0002\nRAPID COMMUNICATIONS\n045601-3\nlution of Eq. \u00011\u0002, while those in the lower row correspond to\nEqs.\u00015\u0002–\u00017\u0002. Figures 6\u0001a\u0002 and 6\u0001e\u0002 illustrate a desynchroniza-\ntion transition from the stationary \u0016 \/2-out-of-phase BS to a\nstable limit cycle via a homoclinic bifurcation \u0001cf. Ref. \u000319\u0004\u0002.\nA stable limit cycle born from a homoclinic loop to a saddle\nantiphase state is shown in Figs. 6\u0001b\u0002 and 6\u0001f\u0002. Figure 6\u0001c\u0002\nshows a metastable chaotic BS which corresponds to a stable\nchaotic regime of Eqs. \u00015\u0002–\u00017\u0002 \u0003see Fig. 6\u0001g\u0002\u0004. Finally, Fig.\n6\u0001d\u0002 illustrates multistability between different time-periodic\nBS’s of Eq. \u00011\u0002. The corresponding quasiperiodic solutions of\nEqs. \u00015\u0002–\u00017\u0002 are shown in Fig. 6\u0001h\u0002. The comparison of the\nphase portraits in the upper and lower rows in Fig. 6 reveals\na substantial similarity between the solutions of Eq. \u00011\u0002 and\nthose of Eqs. \u00015\u0002–\u00017\u0002. There is no one-to-one correspon-\ndence, however, because in Eqs. \u00015\u0002–\u00017\u0002 we have neglected\nsecond- and higher-order terms in exp\u0001−\fr\u0002 that are respon-\nsible for a weak dissipation. Though these terms are small,\nthey are not negligible in the first two elementary cells of the\nphase space that are depicted in Fig. 1\u0001a\u0002. In the next cells\nthat correspond to larger soliton separations one should ex-\npect a similar behavior, though with much weaker dissipation\neffects.\nAs we see, the weak interaction of two dissipative solitons\ncan produce a very rich dynamics. The mechanism of a cre-\nation of dynamic soliton BS’s is related to the breakdown of\nthe phase-shift symmetry and has a universal, model-\nindependent nature. Therefore, it should be typical for every\nspatially extended system which undergoes a Hopf bifurca-\ntion. In particular, in mode-locked lasers violation of the\nphase-shift symmetry can be easily achieved by an injection\nof an external signal. An experimental technique allowing\none to measure the parameters of interacting solitons with a\ngood precision is described in Refs. \u00035,6\u0004. This technique,\nbased on autocorrelation and spectral analysis of laser output\nradiation, seems to be quite capable of detecting the dynamic\nsoliton BS’s and distinguishing them from the static ones.\nThe fact that the two-soliton state in the QCGLE is a\nweakly damped nonlinear oscillator can be used to analyze\nthe dynamics of soliton BS’s in other situations. Thus, a sys-\ntem of four interacting solitons can be viewed as a pair of\ncoupled, weakly damped oscillators, i.e., is able to demon-\nstrate a rich dynamical behavior even without the phase-shift\nsymmetry breaking. Similar effects can be expected in the\ncase of rotating soliton BS’s in two space dimensions.\nThis work was supported by Grant ISF No. 926\/04 and\nthe joint Russian-Israeli project “Global bifurcations and\ncomplex orbit behavior.”\n\u00031\u0004 O. Thual and S. Fauve, J. Phys. \u0001France\u0002 49, 1829 \u00011988\u0002.\n\u00032\u0004 J. D. Moores, Opt. Commun. 96, 65 \u00011993\u0002.\n\u00033\u0004 N. N. Akhmediev and A. Ankiewicz, Solitons. Nonlinear\nPulses and Beams \u0001Chapman and Hall, London, 1997\u0002.\n\u00034\u0004 P. Mandel and M. Tlidi, J. Opt. B: Quantum Semiclassical Opt.\n6, R60 \u00012004\u0002.\n\u00035\u0004 D. Y. Tang, W. S. Man, H. Y. Tam, and P. D. Drummond, Phys.\nRev. A 64, 033814 \u00012001\u0002; D. Y. Tang, B. Zhao, D. Y. Shen, C.\nLu, W. S. Man, and H. Y. Tam, ibid. 68, 013816 \u00012003\u0002; P.\nGrelu et al., Opt. Lett. 27, 966 \u00012002\u0002; Opt. Express 11, 2238\n\u00012003\u0002.\n\u00036\u0004 P. Grelu and N. Akhmediev, Opt. Express 12, 3184 \u00012004\u0002.\n\u00037\u0004 H. R. Brand and R. J. Deissler, Phys. Rev. Lett. 63, 2801\n\u00011989\u0002; B. A. Malomed, Phys. Rev. A 44, 6954 \u00011991\u0002; V. V.\nAfanasjev and N. Akhmediev, Phys. Rev. E 53, 6471 \u00011996\u0002.\n\u00038\u0004 N. N. Akhmediev, A. Ankiewicz, and J. M. Soto-Crespo, Phys.\nRev. Lett. 79, 4047 \u00011997\u0002.\n\u00039\u0004 A. G. Vladimirov, G. V. Khodova, and N. N. Rosanov, Phys.\nRev. E 63, 056607 \u00012001\u0002.\n\u000310\u0004 D. V Skryabin and A. G. Vladimirov, Phys. Rev. Lett. 89,\n044101 \u00012002\u0002.\n\u000311\u0004 N. N. Rosanov, S. V. Fedorov, and A. N. Shatsev, Phys. Rev.\nLett. 95, 053903 \u00012005\u0002.\n\u000312\u0004 J. M. Soto-Crespo, N. Akhmediev, and A. Ankiewicz, Phys.\nRev. Lett. 85, 2937 \u00012000\u0002.\n\u000313\u0004 K. A. Gorshkov, L. A. Ostrovsky, and V. V. Papko, Sov. Phys.\nJETP 44, 306 \u00011976\u0002; K. A. Gorshkov and L. A. Ostrovsky,\nPhysica D 3, 428 \u00011981\u0002.\n\u000314\u0004 I. S. Aranson et al., Physica D 43, 435 \u00011990\u0002.\n\u000315\u0004 K. A. Gorshkov, A. S. Lomov, and M. I. Rabinovich, Nonlin-\nearity 5, 1343 \u00011992\u0002.\n\u000316\u0004 B. Sandstede, in Handbook of Dynamical Systems II, edited by\nB. Fiedler \u0001Elsevier, Amsterdam, 2002\u0002; S. Zelik and A.\nMielke, Memoirs of AMS \u0001in press\u0002.\n\u000317\u0004 J. Guckenheimer and P. Holmes, Nonlinear Oscillations, Dy-\nnamical Systems, and Bifurcations of Vector Fields \u0001Springer,\nBerlin, 1983\u0002.\n\u000318\u0004 A. Arneodo et al., Physica D 14, 327 \u00011985\u0002; S. Ibáñez and J.\nA. Rodríguez, J. Differ. Equations 208, 147 \u00012005\u0002.\n\u000319\u0004 N. K. Gavrilov and A. L. Shilnikov, Am. Math. Soc. Transl.\n200, 165 \u00012000\u0002; B. Krauskopf and S. Wieczorek, Physica D\n173, 114 \u00012002\u0002.\nTURAEV, VLADIMIROV, AND ZELIK PHYSICAL REVIEW E 75, 045601\u0001R\u0002 \u00012007\u0002\nRAPID COMMUNICATIONS\n045601-4\n"}