{"doi":"10.1103\/PhysRevC.77.014316","coreId":"100879","oai":"oai:epubs.surrey.ac.uk:279","identifiers":["oai:epubs.surrey.ac.uk:279","10.1103\/PhysRevC.77.014316"],"title":"Single-neutron knockout from intermediate energy beams of <sup>30,32<\/sup>Mg: Mapping the transition into the “island of inversion”","authors":["Terry, J. R.","Brown, B. A.","Campbell, C. M.","Cook, J. M.","Davies, A. D.","Dinca, D.-C.","Gade, A.","Glasmacher, T.","Hansen, P. G.","Sherrill, B. M.","Zwahlen, H.","Bazin, D.","Yoneda, K.","Tostevin, J. A.","Otsuka, T.","Utsuno, Y.","Pritychenko, B."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-01-29","abstract":"<p>The breakdown of the <i>N<\/i>=20 magic number in the so-called island of inversion around <sup>32<\/sup>Mg is well established. Recently developed large-scale shell-model calculations suggest a transitional region between normal- and intruder-dominated nuclear ground states, thus modifying the boundary of the island of inversion. In particular, a dramatic change in single-particle structure is predicted between the ground states of <sup>30<\/sup>Mg and <sup>32<\/sup>Mg, with the latter consisting nearly purely of 2p-2h <i>N<\/i>=20 cross-shell configurations. Single-neutron knockout experiments on <sup>30<\/sup>Mg and <sup>32<\/sup>Mg projectiles have been performed. We report on a first direct observation of intruder configurations in the ground states of these very neutron-rich nuclei. Spectroscopic factors to low-lying negative-parity states in the knockout residues are deduced and compare well with shell-model predictions.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:279<\/identifier><datestamp>\n      2017-10-31T13:57:33Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:70687973696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/279\/<\/dc:relation><dc:title>\n        Single-neutron knockout from intermediate energy beams of <sup>30,32<\/sup>Mg: Mapping the transition into the “island of inversion”<\/dc:title><dc:creator>\n        Terry, J. R.<\/dc:creator><dc:creator>\n        Brown, B. A.<\/dc:creator><dc:creator>\n        Campbell, C. M.<\/dc:creator><dc:creator>\n        Cook, J. M.<\/dc:creator><dc:creator>\n        Davies, A. D.<\/dc:creator><dc:creator>\n        Dinca, D.-C.<\/dc:creator><dc:creator>\n        Gade, A.<\/dc:creator><dc:creator>\n        Glasmacher, T.<\/dc:creator><dc:creator>\n        Hansen, P. G.<\/dc:creator><dc:creator>\n        Sherrill, B. M.<\/dc:creator><dc:creator>\n        Zwahlen, H.<\/dc:creator><dc:creator>\n        Bazin, D.<\/dc:creator><dc:creator>\n        Yoneda, K.<\/dc:creator><dc:creator>\n        Tostevin, J. A.<\/dc:creator><dc:creator>\n        Otsuka, T.<\/dc:creator><dc:creator>\n        Utsuno, Y.<\/dc:creator><dc:creator>\n        Pritychenko, B.<\/dc:creator><dc:description>\n        <p>The breakdown of the <i>N<\/i>=20 magic number in the so-called island of inversion around <sup>32<\/sup>Mg is well established. Recently developed large-scale shell-model calculations suggest a transitional region between normal- and intruder-dominated nuclear ground states, thus modifying the boundary of the island of inversion. In particular, a dramatic change in single-particle structure is predicted between the ground states of <sup>30<\/sup>Mg and <sup>32<\/sup>Mg, with the latter consisting nearly purely of 2p-2h <i>N<\/i>=20 cross-shell configurations. Single-neutron knockout experiments on <sup>30<\/sup>Mg and <sup>32<\/sup>Mg projectiles have been performed. We report on a first direct observation of intruder configurations in the ground states of these very neutron-rich nuclei. Spectroscopic factors to low-lying negative-parity states in the knockout residues are deduced and compare well with shell-model predictions.<\/p><\/dc:description><dc:date>\n        2008-01-29<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/279\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Terry, J. R., Brown, B. A., Campbell, C. M., Cook, J. M., Davies, A. D., Dinca, D.-C., Gade, A., Glasmacher, T., Hansen, P. G., Sherrill, B. M., Zwahlen, H., Bazin, D., Yoneda, K., Tostevin, J. A., Otsuka, T., Utsuno, Y. and Pritychenko, B.  (2008) Single-neutron knockout from intermediate energy beams of 30,32Mg: Mapping the transition into the “island of inversion”   Physical Review C, 77 (014316).       <\/dc:identifier><dc:relation>\n        10.1103\/PhysRevC.77.014316<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/279\/","10.1103\/PhysRevC.77.014316"],"year":2008,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"PHYSICAL REVIEW C 77, 014316 (2008)\nSingle-neutron knockout from intermediate energy beams of 30,32Mg: Mapping the transition into\nthe “island of inversion”\nJ. R. Terry, B. A. Brown, C. M. Campbell, J. M. Cook, A. D. Davies, D.-C. Dinca, A. Gade, T. Glasmacher, P. G. Hansen,\nB. M. Sherrill, and H. Zwahlen\nNational Superconducting Cyclotron Laboratory, Michigan State University, East Lansing, Michigan 48824, USA and\nDepartment of Physics and Astronomy, Michigan State University, East Lansing, Michigan 48824, USA\nD. Bazin and K. Yoneda\nNational Superconducting Cyclotron Laboratory, Michigan State University, East Lansing, Michigan 48824, USA\nJ. A. Tostevin\nFaculty of Engineering and Physical Sciences, University of Surrey, Guildford GU2 7XH, United Kingdom\nT. Otsuka\nDepartment of Physics and Center for Nuclear Study, University of Tokyo, Hongo, Tokyo 113-0033, Japan and\nRIKEN, Hirosawa, Wako-shi, Saitama 351-0198, Japan\nY. Utsuno\nAdvanced Science Research Center, Japan Atomic Energy Agency, Tokai, Ibaraki 319-1195, Japan\nB. Pritychenko\nBrookhaven National Laboratory, Upton, New York 11973-5000, USA\n(Received 5 March 2007; revised manuscript received 15 October 2007; published 29 January 2008)\nThe breakdown of the N = 20 magic number in the so-called island of inversion around 32Mg is well\nestablished. Recently developed large-scale shell-model calculations suggest a transitional region between\nnormal- and intruder-dominated nuclear ground states, thus modifying the boundary of the island of inversion.\nIn particular, a dramatic change in single-particle structure is predicted between the ground states of 30Mg\nand 32Mg, with the latter consisting nearly purely of 2p-2h N = 20 cross-shell configurations. Single-neutron\nknockout experiments on 30,32Mg projectiles have been performed. We report on a first direct observation of\nintruder configurations in the ground states of these very neutron-rich nuclei. Spectroscopic factors to low-lying\nnegative-parity states in the knockout residues are deduced and compare well with shell-model predictions.\nDOI: 10.1103\/PhysRevC.77.014316 PACS number(s): 21.10.Jx, 21.60.Cs, 25.70.Hi, 27.30.+t\nI. INTRODUCTION\nA disappearance of the N = 20 magic structure in neutron-\nrich nuclei was first suggested based on the mass measurement\nof 31Na [1]. Subsequent observations revealed a region of\ndeformation around the N = 20 isotones with Z\u0001 12 [2–9].\nShell-model calculations performed for a broad range of nuclei\nin this vicinity indicate that two-particle-two-hole (2p-2h)\nconfigurations across the N = 20 shell gap are lower in energy\nthan normal configurations for nuclei with 20\u0001N \u0001 22 and\n10\u0001Z\u0001 12, illustrated in Fig. 1. This region of nuclei, referred\nto as the “island of inversion” [10], represents a dramatic\nchange of structure with growing proton-neutron asymmetry\nand has attracted much attention from both experiment and\ntheory. Most notably, recent efforts have concentrated on the\nboundary of this region, which observations characterize as a\ntransitional region [11–14] as opposed to a hard border as was\noriginally suggested in Ref. [10].\nThe N = 20 island of inversion around 31Na provides an\nimportant benchmark for the understanding of mechanisms\nthat give rise to dramatic changes in single-particle structure\nand deformation in exotic nuclei. Although islands of inversion\nexist or are expected to exist in other regions of the nuclear\nlandscape [15], the N = 20 island lies in a mass region in\nwhich effective interactions can be developed with high pre-\ndictive power. As opposed to the region around 12Be in which\nan inversion is also observed [16,17] and effective interactions\nare also quite accurate, the nuclear landscape around 32Mg is\nmore extended, allowing a systematic investigation of changes\nin single-particle structure.\nWeakening of the N = 20 shell gap has been suggested in\nRefs. [18,19] as a consequence of the spin-isospin interaction.\nSuch a reduced gap poses a formidable task for nuclear shell-\nmodel calculations. The importance of np-nh configurations\nacross the N = 20 gap requires model spaces that include\nboth sd and fp single-particle states. Truncation schemes are\nnecessary to reduce the dimension of the effective Hamiltonian\nmatrix to a manageable size. Effective interactions have been\ndeveloped in which the configuration space is limited to 0p-0h\nand 2p-2h neutron cross-shell configurations. However, the\npossible pitfalls of such a truncation are discussed in Ref. [10].\nThe recent Monte Carlo shell-model (MCSM) approach offers\na framework in which much larger model spaces can be\n0556-2813\/2008\/77(1)\/014316(12) 014316-1 ©2008 The American Physical Society\nJ. R. TERRY et al. PHYSICAL REVIEW C 77, 014316 (2008)\n32Mg30Mg\n0 2\n=\nN\nZ=8\nStable\n31Mg\n30Na29Na\n28Ne\n28Na\n27Ne\n29Mg\n36S\nFIG. 1. Chart of nuclides around the island of inversion. Stable\nnuclei are shown in black and the island of inversion as discussed\nin Ref. [10] is shown in gray. The isotopes investigated in the\npresent work are circled. The heavy dotted line represents the recently\nobserved transition from normal-dominated to intruder-dominated\nground states in the magnesium and sodium chains. This transition is\nnot yet clearly delineated for the neon isotopes.\naccommodated and unrestricted mixing of np-nh configura-\ntions is allowed [18,20].\nThe SDPF-M effective interaction, developed with the\nMCSM approach, includes the 0d5\/2, 1s1\/2, 0d3\/2, 0f7\/2, and\n1p3\/2 single-particle states [21]. SDPF-M calculations have\nbeen shown to accurately model sd nuclei [21], i.e., nuclei that\nhave previously been well represented by effective interactions\nthat only include sd single-particle states (the USD interaction\n[22]). Further, the SDPF-M interaction has proven to be\naccurate in describing the onset of deformation in the island\nof inversion and provides a theoretical treatment of the\ntransitional region from ground states dominated by normal\nconfigurations to those dominated by N = 20 cross-shell\nintruder configurations [23].\nThe SDPF-M predictions of two-neutron separation ener-\ngies, E(2+1 ), and B(E2; 2+1 → 0+1 ) excitation strength for a\nnumber of nuclei in this region are found to be in agreement\nwith experimental values [24]. It is noted that, as opposed to a\ndefinite boundary, SDPF-M calculations suggest a transitional\nregion into the island of inversion [24]. For N > 17, a growing\namount of empirical evidence has been deduced in support\nof this transition from normal to intruder dominance for\nmagnesium and sodium isotopes. Although 30Mg (N = 18) is\nwell described without considering cross-shell configurations\n[5,25] indicating negligible intruder content in the ground\nstate, at N = 19 the low-energy level structure [26,27] and the\nrecently measured magnetic moment of its ground state [11]\nindicate a strong admixture of intruder configurations in 31Mg.\nTherefore, for Z = 12 isotopes there appears to be a sharp\ntransition at N = 19 into the island of inversion. For sodium\nwith just one proton less, recent systematic calculations [23],\nwhich agree with measured observables for this isotopic chain,\nsuggest a more gradual transition. The N = 19 nuclide 30Na\nis concluded to lie within the island of inversion [23], whereas\nmeasurements for 29Na, predicted to be outside of the island,\n0d5\/2 1s1\/2 0d3\/2\n0f7\/2\n1p3\/2\n0d5\/2 1s1\/2 0d3\/2 0f7\/2\n1p3\/2\n30Mg\n32Mg\nSDPF-M\nSDPF-M\nIPSM\nIPSM\nUSD\nUSD\n0 2 4 6 8 10\n120 2 4 6 8 10\nFIG. 2. Calculated neutron single-particle occupancies. Neutron\nsingle-particle occupancies calculated using the USD interaction and\nthe SDPF-M interaction are compared. The independent particle shell\nmodel (IPSM) represents normal filling.\nindicate a significant intruder admixture [12]. Sufficient data\ndo not exist to systematically track the transition in the neon\nisotopic chain. However, already at N = 18, 28Ne shows\ncharacteristics indicating that it is on the boundary of the\nisland of inversion [5,28], and for 27Ne, intruder states have\nbeen observed at low excitation energy [13,29,30].\nIn the present measurement the single-particle structures\nof the 30,32Mg ground states are probed by single-neutron\nknockout at intermediate beam energy. SDPF-M calculations\npredict a dramatic change in the single-particle structure\nof these nuclei. Whereas the SDPF-M 30Mg ground state\nwave function is dominated by normal configurations with\nan occupancy of only 0.6 neutrons in fp single-particle states,\nthe 32Mg ground-state wave function is a nearly pure 2p-2h\nconfiguration across the N = 20 shell gap with a neutron\nfp occupancy of 2.15. This shift in structure is illustrated\nin Fig. 2. In this figure, SDPF-M predicted neutron single-\nparticle occupancies are compared to Universal SD (USD)\nand independent-particle shell-model (IPSM) predictions. The\nUSD effective interaction includes only sd single-particle\nstates in its model space and, therefore, does not allow\nfor N = 20 shell-breaking effects [22]. The IPSM results\nrepresent normal filling of single-particle states. For both 30Mg\nand 32Mg, the 0d5\/2 and 1s1\/2 occupancies from all three\nmodels are in good agreement. The most significant differences\nare observed in the 0d3\/2 and fp orbits. Comparisons of the\n0d3\/2 occupancies from the USD and SDPF-M interaction\nreveal that a small fraction of the 0d3\/2 neutrons are promoted\nto fp orbits when shell-breaking effects are included. This\neffect is also observed in 32Mg but with a much larger fraction\npromoted. In effect, the two additional neutrons added to 30Mg\noccupy single-particle states in the fp shell as opposed to\nfilling the remaining sd space.\nNucleon knockout experiments in inverse kinematics are\nsensitive to the occupation number of single-particle orbitals\n[31,32] and represent a selective spectroscopic tool to inves-\ntigate the evolution of shell closures in rare isotopes. This\nmethod allows for detailed spectroscopy of the ground-state\nwave function of the projectile and can provide a quantita-\ntive measure of intruder content. Intruder configurations are\n014316-2\nSINGLE-NEUTRON KNOCKOUT FROM INTERMEDIATE . . . PHYSICAL REVIEW C 77, 014316 (2008)\nobserved in this direct reaction through the measurement of\nsignificant spectroscopic strength to states in the reaction\nproduct with the parity of the intruding shell. Further, the\nsingle-particle strength quantifies the extent of the admixture\nof intruder configurations in the ground state of the projectile.\nObservables in the present measurements include partial\nknockout cross sections to individual final states and longi-\ntudinal momentum distributions of the mass A-1 knockout\nfragments. These observables are modeled in a three-body\nreaction calculation based on the eikonal and sudden approx-\nimations and making use of Glauber theory [33,34]. Whereas\nthe partial cross sections are sensitive to the single-particle\nstructure of the wave function of the projectile, the longitudinal\nmomentum distributions are sensitive to the orbital angular\nmomentum quantum number \u0001 of the knocked-out nucleon,\nproviding spectroscopic information as well [35–37].\nII. EXPERIMENT\nThe experiment was performed at the National Supercon-\nducting Cyclotron Laboratory on the campus of Michigan\nState University. Radioactive ion beams of 30Mg and 32Mg,\nalso called secondary beams, were produced by fragmentation\nat the Coupled-Cyclotron Facility [38] and filtered in the\nA1900 fragment separator [39]. Specifics of the secondary\nbeam production process are listed in Table I.\nThe secondary beams impinged on a 376(4) mg\/cm2 beryl-\nlium reaction target located at the target position of the S800\nspectrograph [40]. Data for particle identification, by means of\na energy loss versus time-of-flight method, and for event-by-\nevent momentum reconstruction are collected using the S800\nfocal plane detector setup [41]. The segmented germanium\narray (SeGA) [42] was positioned around the reaction target\nto tag individual excited states populated in the reaction by\ndetection of γ radiation coincident with knockout residues.\nSeGA is an array of 18 32-fold segmented high-purity\ngermanium detectors designed for in-beam γ -ray spec-\ntroscopy at fragmentation energies. The array was arranged\nin the δ configuration consisting of nine angle pairs at\n24◦, 29◦, 40◦, 60◦, 78◦, 90◦, 126◦, 139◦, and 147◦ with respect\nto the beam axis. The response of the array is characterized by\na 2.4% photopeak efficiency for 1.0 MeV γ -rays emitted from\nTABLE I. Summary of radioactive ion beam pro-\nduction for the 30,32Mg secondary beams. The bottom\nrow lists the momentum spread (\u0004P\/P ) of the sec-\nondary beams. The energy at the center of the reaction\ntarget (at the S800 target position) is listed as the\nsecondary beam energy.\n30Mg 32Mg\nPrimary 40Ar 48Ca\nbeam 140 MeV\/nuc. 140 MeV\/nuc.\nProduction 9Be 9Be\ntarget 611 mg\/cm2 775 mg\/cm2\nSec. beam 85.8(15) 75.7(13)\nenergy MeV\/nuc. MeV\/nuc.\n\u0004P\/P 1% 2%\na stationary source and a 3% energy resolution for 1.0 MeV\nγ -rays emitted in-flight from a source with v\/c ≈ 0.4.\nTo maximize the secondary beam intensity, the spectro-\ngraph optics were set to focus the secondary beam on the\nreaction target. The longitudinal momentum of the knockout\nfragments is corrected on an event-by-event basis for the mo-\nmentum of the projectile, measured at the intermediate image\nof the S800 analysis line [40]. Resolutions of 45 and 50 MeV\/c\nfull width at half maximum (FWHM), or 0.38% and 0.43%,\nwere obtained for the 30Mg and 32Mg secondary beams.\nIII. ANALYSIS AND EXPERIMENT RESULTS\nA. Single-neutron knockout from 30Mg\nThe inclusive single-neutron knockout cross section from\n30Mg to 29Mg is determined to be 100(2) mb. Leading sources\nof uncertainty are the S800 acceptance (1%), software cuts for\nparticle identification (1%), the PID detector efficiencies (1%),\nand the target thickness (1%). This inclusive cross section\nincludes acceptance corrections within the acceptance of the\nS800 but not corrections based on extrapolation beyond the\nacceptance.\nThe Doppler-reconstructed γ -ray energy spectrum in co-\nincidence with 29Mg fragments in shown in Fig. 3. Nine\nphotopeaks are clearly observed in the spectrum as indicated\nin the figure. The peak at 0.3 MeV is found to be much broader\nthan the expected 15-keV FWHM for a photopeak at this\n0\n0.5\n1.0\n1.5\n2.0\n0.2 0.3 0.4\n0\n2.0\n4.0\n6.0\n1.0 1.5 2.0\n0\n0.5\n1.0\n1.5\n2.0 2.5 3.0 3.5 4.0\n=0.401\n=0.38529Mg =0.401x103 x103\nx103\nFIG. 3. Gamma-ray spectrum in coincidence with 29Mg frag-\nments. The upper-right panel shows the low-energy region of the\nspectrum that is Doppler reconstructed using the post-target fragment\nvelocity. The midtarget velocity is used in the Doppler reconstruction\nof the remainder of the spectrum. Results of a χ 2 fit to the low-energy\nregion and to the 0.5- to 4.0-MeV region are overlaid.\n014316-3\nJ. R. TERRY et al. PHYSICAL REVIEW C 77, 014316 (2008)\nenergy. This suggests that the emitting state has a relatively\nlong lifetime. Therefore, the low-energy region of the spectrum\nis Doppler reconstructed with the post-target fragment velocity\nof 0.385 c as the majority of these γ -rays are emitted after\nthe fragment has left the target. The angle for the Doppler\nreconstruction is still calculated assuming emission from the\ncenter of the target, giving rise to the low-energy tail. The\nremainder of the γ -ray spectrum, above 0.5 MeV, is Doppler\nreconstructed using the midtarget fragment velocity of 0.401 c.\nThe post-target velocity is calculated from the fragment\nmomentum measured in the S800 focal plane, whereas the\nmidtarget velocity is determined in two ways that give\nconsistent results: (1) an energy loss calculation through half of\nthe reaction target using ATIMA [43,44] within the LISE++\nprogram [45] and the fragment momentum measured in the\nS800 and (2) an iterative Doppler reconstruction procedure in\nwhich the reaction target position and the midtarget velocity\nare adjusted to align the 1.040-MeV transition at the known\nenergy for all detection angles.\nγ -ray intensities are obtained through χ2 fits of calculated\nresponse functions to the Doppler-reconstructed spectrum. The\nresponse of the array to a transition γ -ray is calculated in a\nGEANT3 simulation. A dead layer of germanium is included\nalong the outer circumference of the cylindrical crystal in the\nsimulation with a thickness adjusted to match the measured\nphotopeak efficiency from calibration data. The simulated full\nresponse function for a 1.332-MeV γ -ray, which includes the\nphotopeak, Compton continuum, and escape and annihilation\npeaks, deviates by no more than 10% from observations from\na stationary 60Co source. The simulated photopeak efficiency\ndeviates by no more than 5% from measured values obtained\nwith stationary sources from 0.25 MeV up to 3.2 MeV. Input\nparameters for the simulation include the γ -ray energy, the\nhalf-life of the emitting state, and the fragment velocity along\nwith the target position and fragment velocity assumed in the\nDoppler reconstruction.\nγ -ray intensities in the region between 0.7 and 4.0 MeV are\ntaken from a single fit to the spectrum that includes simulated\nresponse functions for each transition γ -ray and a continuum\nγ -ray distribution. The shape of the continuum is fixed for\nenergies above 1 MeV using data from a 9Be(28Ne,27Ne)X\nreaction [13] and from the 9Be(32Mg,31Mg)X data presented\nin the present article. No transition γ -rays are observed\nin coincidence with these reactions above 1 and 2.5 MeV,\nrespectively. As the background observed for the 27Ne and\n31Mg fragments does not extrapolate well below 1 MeV, a free\nvarying exponential is also included, which gives a negligible\ncontribution above 1 MeV after χ2 minimization.\nThe fit to the spectrum between 0.7 to 4.0 MeV includes\nsimulated photopeaks for seven known transitions within this\nregion of the spectrum that are clearly observed in the present\nmeasurement: 1.04, 1.64, 2.13, 2.21, 2.45, 2.56, and 3.23 MeV\n[46,47]. After an initial χ2 minimization, five simulated\nphotopeaks corresponding to previously observed transitions\nare added where inclusion would clearly reduce significant\nfluctuations in the fit residual. Two previously unobserved\ntransitions are added at 1.79 and 3.41 MeV. Although the\nstatistics are limited for these low-intensity photopeaks, both\nseem to appear in Doppler-reconstructed spectra from the\nforward (24◦, 29◦, 40◦), middle (60◦, 78◦, 90◦), and backward\n(126◦, 139◦, 147◦) groups of angle-pairs, suggesting that\nthese γ -rays are emitted from the fast-moving projectile-like\nresidue. The fit also includes energy offsets for a few response\nfunctions that do not align well with photopeaks in the data.\nWith the exception of the 2.21 MeV peak which requires a shift\nin energy of +17 keV to fit the spectrum, no other significant\noffsets are found. Given the large offset required for the\n2.21 MeV peak, this peak is not associated with any previously\nobserved transition.\nTo accurately deduce the intensity of the 0.336 MeV\nphotopeak the long half-life of the emitting state must be\nincluded in the simulation of the response function. Because\nthe half-life of the 1.431 MeV state is not known, response\nfunctions for several assumed half-lives are generated and fit\nto the data. In addition to the calculated response function,\nthe fit includes a γ -ray background and a Doppler-smeared\nannihilation peak. The γ -ray background in this energy region\nis dominated by backscattering, and the shape is estimated\nby analysis of the γ -ray energy spectrum in coincidence with\n28Mg fragments, which was collected simultaneously with the\n29Mg fragments and shows no photopeaks below 1.5 MeV.\nThe 0.511-MeV annihilation peak observed at forward angles\nis broadened and shifted to approximately 0.35 MeV by the\nDoppler reconstruction. This distorted peak is simulated and\nthen scaled to match the intensity of the 0.511-MeV photopeak\nin the forward-angle lab-frame energy spectrum. So the fit to\nthe 29Mg γ -ray energy spectrum includes four parameters: the\nhalf-life of the emitting state, the intensity and position of\nthe photopeak in the response function, and the scale of the\nbackground.\nA contour plot of the χ2 as a function of the half-life and\nintensity associated with the 0.336-MeV photopeak is shown\nin Fig. 4. For each point in this two-dimensional space, the\n1.0 1.5 2.0 2.5\n4.0\n6.0\n8.0\n10.0\n12.0\n1\/2\nFIG. 4. Analysis of 29Mg 0.336-MeV photopeak. The one-, two-,\nthree-, and four-σ contours are shown illustrating confidence intervals\nfor the simultaneous fit of both intensity and half-life associated with\nthe 0.336-MeV photopeak.\n014316-4\nSINGLE-NEUTRON KNOCKOUT FROM INTERMEDIATE . . . PHYSICAL REVIEW C 77, 014316 (2008)\nχ2 is minimized with respect to the remaining two parameters.\nA clear correlation between the half-life and intensity is\nobserved, and the contours represent one-, two-, three-, and\nfour-σ limits for the uncertainty in the deduced values for\nthese parameters. The half-life is found to be 1.43(51) ns,\nwhereas the intensity is 6.7(17)%, relative to the total single-\nneutron knockout cross section. In addition to the statistical\nuncertainties reflected in Fig. 4, a systematic uncertainty of 5%\nand 0.2 ns for the respective intensity and half-life are included,\narising from the matching of the simulation to measured\nphotopeak detection efficiencies. Because this experiment\nwas not designed for precision lifetime measurements and\nbetter measurements will likely become available, the figure\nalso includes, for future use, data points with statistical\nuncertainties representing the deduced intensity assuming a\nfixed half-life. An additional 5% systematic uncertainty must\nbe added to these data points as well.\nFigure 4 reveals a local minimum at 2.5 ns just inside the\n2σ contour. This minimum and the one at 1.43 ns are separated\nby \u0004χ2 = 6. However, if the slope of the background is\nflattened by 5%, the minimum at 2.5 ns falls just below\nthe one at 1.43 ns. The half-life of the state at 1.431 MeV\nis concluded to be 1.43(51) ns with 1σ uncertainty quoted\nand no systematic uncertainty in the shape of the background\nincluded. A precision measurement of the lifetime of this state\nwould be helpful in reducing the uncertainty in the present\nresults.\nResults of the γ -ray analysis for the 29Mg fragment are\nshown in Table II. Intensities are taken from the fit to the\nγ -ray spectrum and are normalized on the number of reactions,\ndeduced by simultaneous measurement of the number of\n29Mg fragments. Branching ratios are deduced by intensity\nbalancing. The three previously unobserved transitions are not\nincluded in the intensity balancing as their placement is not\nknown. However, it is noted that the 1.79-MeV transition,\nTABLE II. Gamma-ray intensities and branching ratios for 29Mg.\nElevel Eγ I (%) b (%) σ (mb) \u0001\n(MeV) (MeV)\n0.000 47.4(36) 47.4(38)\n0.055\n1.095 1.040 8.5(11) 4.3(15) 4.3(15) 1\n1.431 0.336 6.7(17) 6.7(17) 6.7(17) 3\n1.642 1.642 9.0(11) 7.3(15) 7.3(15)\n2.500 2.445 2.7(10) 3.7(14) 3.7(15) (2,3)\n2.500 1.0(10)\n2.615 2.560 5.9(11) 6.9(15) 6.9(15) (0,1)\n2.615 1.0(10)\n3.232 1.586 1.8(10) 21.5(22) 21.5(22) 2\n2.133 4.3(10)\n3.178 1.5(11)\n3.232 13.9(13)\n3.674 3.674 2.3(10) 2.3(10) 2.3(10)\n1.79(1) 1.4(10)\n2.23(1) 3.7(10) Unplaced transitions\n3.41(1) 1.2(10)\nbased on its energy alone, is a candidate for a transition\nbetween the doublet at 3.23 MeV and the state at 1.431 MeV.\nThe partial cross sections are deduced by multiplication\nof the extracted branching ratios by the inclusive cross\nsection of 100(2) mb. The rightmost column in Table II\nlists deduced angular-momentum quantum numbers \u0001 for the\nremoved nucleon based on analysis of longitudinal momentum\ndistributions discussed below.\nLongitudinal momentum distributions are extracted by\ngating on the 0.336- and 1.040-MeV photopeaks and the\n3.23-MeV doublet photopeak. Contributions to the distribu-\ntions from the γ -ray background are estimated by applying\nenergy gates just above these peaks in the spectrum. Back-\nground contributions are subtracted to yield the distributions\nshown in Fig. 5. Acceptance corrections are determined in a\nMonte Carlo calculation in which particles are tracked though\nthe known geometry and optics of the spectrograph using\nthe COSY infinity transport code [48]. Each plot is overlaid\nwith calculated distributions assuming a number of \u0001 values\nfor the knocked-out nucleon. The 3.23-MeV doublet shows\na clear \u0001 = 2 character, whereas the 1.040-MeV distribution\nsuggests \u0001 = 1 for this state. The overlaid distributions for\n11.0 11.25 11.511.0 11.25 11.511.0 11.25 11.5\nFIG. 5. Longitudinal momentum distribution for states populated\nin the knockout fragment 29Mg. The corresponding γ -ray energy\ngate is given at the top of each panel, and calculated distributions\nassuming \u0001 = 0 (solid), \u0001 = 1 (dashed), \u0001 = 2 (dotted), and \u0001 = 3\n(dot-dashed) are overlaid. Both \u0001 = 0 and \u0001 = 1 calculations for the\n1.040 distribution include a 50% \u0001 = 2 contribution to account for\nobserved indirect feeding.\n014316-5\nJ. R. TERRY et al. PHYSICAL REVIEW C 77, 014316 (2008)\nthe 1.040-MeV state include a 50% contribution by area of\n\u0001 = 2 to account for the observed indirect feeding from the\n3.23-MeV doublet. The 0.336-MeV distribution is very broad\nand consistent with an \u0001 = 3 assignment.\nThe distribution associated with direct population of the\nstate at 1.638 MeV, shown in Fig. 5, is consistent with\nan \u0001 = 2 assignment. However, the distribution may be\nbetter modeled by a combination of \u0001 = 2 and a narrower\ndistribution of either \u0001 = 0 or \u0001 = 1, suggesting the possibility\nof unobserved indirect feeding to this state. Distributions are\nalso extracted for direct population of the states at 2.500 and\n2.615 MeV, but, given the complexity of the γ -ray spectrum\nand the lower intensity of these photopeaks, subtraction of\ncontributions from the background and nearby photopeaks\nleads to significant statistical and systematic uncertainties.\nThe distribution for the state at 2.500 MeV appears broad,\nsuggesting an assignment of \u0001 = 2, 3, whereas the distribution\nfor the state at 2.615 MeV is clearly more narrow suggesting\n\u0001 = 0 or \u0001 = 1.\nThe limits of the momentum axis represent the momentum\nacceptance (≈0.6 GeV\/c) for this measurement. Depending\non the width, each distribution may be truncated by the finite\nacceptance of the spectrograph. Therefore, branching ratios\nextracted in this measurement must include a correction to ac-\ncount for events that occur beyond the momentum acceptance\nwindow. This correction can only be roughly estimated due\nto difficulty in extracting distributions of sufficient quality\nfor a number of the populated states. Losses beyond the\nacceptance window are estimated by linear extrapolation of\nthe momentum distribution with a reasonable slope based on\nthe shape of the distribution at the limit of acceptance. The\nestimated correction for the \u0001 = 30.336 MeV distribution is\n+15–20%, whereas a correction of +5–10% is found for most\nof the remaining distributions shown in Fig. 5. A negligible\ncorrection on the order of 1% is determined for the narrow\n2.615-MeV distribution. Because these corrections are not well\ndetermined, they are not applied to the deduced branching\nratios and serve as an estimate of additional systematic\nuncertainty.\nLow-momentum tails that are not reproduced by calcula-\ntions are apparent in all of the extracted distributions shown in\nFig 5. Although the origin of these tails is unknown, they are\npresumed to arise from dissipative processes already included\nin the momentum-integrated cross section [49]. Therefore, no\ncorrections are applied to deduced knockout cross sections\nbased on these tails, and fits to the extracted distributions\ninclude only momenta ranging from the low-momentum half-\nmaximum point to the high-momentum acceptance limit.\nB. Single-neutron knockout from 32Mg\nThe inclusive cross section for single-neutron knockout\nfrom 32Mg is determined to be 94(7) mb. The dominant\npart of this uncertainty arises from software cuts for the\nparticle identification (7%). The larger uncertainty in the\nparticle identification for the present measurement relative\nto that for the 30Mg measurement results from an addition\ncut on the position in the focal plane required as a result\nof the larger momentum spread in the secondary beam. This\n1.0\n1.5\n2.0\n0.1 0.2 0.3\n0.1\n0.2\n0.3\n0.5 1.0 1.5 2.0 2.5\n0.5\n0.0\n0.0\nx3\nx103\nx103\n31Mg\n=0.365\n=0.380\nFIG. 6. γ -ray spectrum detected in coincidence with 31Mg frag-\nments. The upper panel shows the low-energy region of the spectrum\nthat is Doppler reconstructed using a post-target fragment velocity.\nThe lower panel shows the remainder of the analyzed spectrum,\nDoppler reconstructed using a midtarget fragment velocity. Results\nof statistical fits to each region of the spectrum are overlaid with\nindividual photopeak response functions also plotted.\ncross section includes acceptance correction only within the\nS800 acceptance but does not include corrections based on\nextrapolation beyond the acceptance window.\nThe Doppler-reconstructed γ -ray energy spectrum coinci-\ndent with 31Mg fragments is shown in Fig. 6. Two strong\nphotopeaks are observed at 0.17 and 0.22 MeV with several\nmore at higher energies. The two low-energy photopeaks\nare clearly skewed on the low-energy side due to the long\nlifetime of the 0.221-MeV state from which they are emitted.\nThe half-life of this state has been measured to be 133(8)\nps [50] which corresponds to a mean flight path of 1.5 cm for\nparticles moving at approximately a third of the speed of light.\nTherefore, the low-energy region of the spectrum is Doppler\nreconstructed using the post-target beam velocity of 0.365c.\nWith this reconstruction, a shoulder is observed in the spectrum\non the high-energy side of the 0.221-MeV photopeak, which\nis consistent with the response of SeGA to a 0.240-MeV γ -ray\nemitted with a half-life on the order of nanoseconds. This\ntransition originates from the excited state at 0.461 MeV with\na known half-life of 10.5(8) ns [50] corresponding to a 1.2-m\nflight path. Therefore, a response function for the 0.240-MeV\ntransition assuming the known half-life is also included in the\nanalysis of the low-energy part of the spectrum. The remainder\nof the spectrum is Doppler reconstructed using a midtarget\n014316-6\nSINGLE-NEUTRON KNOCKOUT FROM INTERMEDIATE . . . PHYSICAL REVIEW C 77, 014316 (2008)\nTABLE III. Gamma-ray intensities and branching ratios for 31Mg.\nElevel Eγ I (%) b (%) σ (mb)\n(MeV) (MeV)\n0.000 39.2(63) 36.8(68)\n0.051\n0.221 0.221 6.50(45) 24.4(21) 22.9(26)\n0.171 19.1(12)\n0.461 0.240 22.1(58) 20.4(60) 19.1(58)\n0.673 0.673 1.1(11) 2.9(18) 2.7(17)\n0.623 1.4(11)\n0.452 0.0(10)\n0.945 0.895 4.8(11) 5.0(11) 4.7(11)\n1.154 0.697 1.7(11) 1.7(11) 1.6(10)\n2.244 2.244 3.82(79) 6.4(14) 6.0(13)\n2.193 1.38(78)\n2.023 1.23(78)\n1.100 1.1(10)\n1.215 1.8(10) Unplaced transitions\n1.790 2.1(8)\nvelocity of 0.380c, which is determined as discussed for the\n30Mg measurement.\nThe intensity of the 0.171-MeV photopeak is obtained from\na fit to the spectrum ranging from 0.125 to 0.195 MeV. The\nfit includes a simulated response function assuming a 133-ps\nhalf-life as well as a second-order polynomial background.\nThe 0.221- and 0.240-MeV photopeak intensities are obtained\nin a fit ranging from 0.178 to 0.400 MeV. This fit includes\nsimulated response functions and a background modeled\nby the sum of two exponentials. Intensities are reported in\nTable III, which includes corrections of +3% and +6% for\nthe 0.221-MeV and 0.171-MeV intensities, respectively, due\nto deviation of the simulated photopeak efficiency from the\nmeasured efficiency at 0.122 MeV.\nThe remainder of the spectrum is analyzed in two parts.\nThe region from 0.4 to 1.0 MeV is analyzed at a resolution\nof 5 keV\/bin, while the region from 1.0 to 2.5 MeV is\nanalyzed at 10 keV\/bin. Intensities are obtained from a fit to\nthe spectrum, which includes simulated response functions, a\nreaction-correlated γ -ray continuum, and Doppler-broadened\nγ -ray transitions emitted from rest resulting from neutron\ninteractions with the beam pipe and germanium detectors.\nThe shape of the background is modeled between 0.4 and\n5.0 MeV by the sum of two exponentials and a constant and\nis fixed by a statistical fit to the γ -ray spectrum obtained\nin the single-neutron removal measurement from 28Ne [13].\nThe 9Be(28Ne,27Ne)X measurement was performed with the\nsame setup as the present measurement, and no transition\nγ -rays were observed above 0.9 MeV. The fit to the 5 keV\/bin\nregion includes a free-varying exponential to correct the neon\nbackground; the correction becomes negligible for energies\nabove 0.6–0.7 MeV.\nPhotopeaks at 0.62, 0.67, 0.69, and 0.90 MeV are observed\nin the 5 keV\/bin region corresponding to previously observed\nγ -ray transitions [27,50]. Response functions for these and\nall other previously observed transitions are included in the\nfit, yet only the clearly visible peaks have intensities greater\nthan 0.5% of the inclusive cross section. In this region of the\nγ -ray spectrum, fluctuations in the residual of the fit suggest\nsensitivity to photopeaks with intensity of at least 1% of\nthe inclusive cross section. Therefore, intensities below this\nlevel are considered consistent with zero, and a systematic\nuncertainty of 1% is added to all other intensities extracted in\nthis region. The branching ratios for the depopulation of the\nstate at 0.673 MeV is not well measured in the present results\nbut is consistent with that reported in Ref. [27].\nThe 10 keV\/bin region clearly includes photopeaks at\n1.1, 1.2, 1.7, and 2.2 MeV. Transitions at 1.215, 2.244, and\n2.193 MeV have been previously observed. However, the 1.1-\nand 1.7-MeV transitions have not. To confirm that these peaks\nare associated with 31Mg, excited states were also populated by\nsecondary fragmentation of 34Si in a separate measurement us-\ning the same setup. From this data, new transitions at 1.100(5),\n1.257(7), 1.506(5), 1.708(8), 1.790(5), and 1.945(7) MeV\nwere established as belonging to 31Mg but a placement in\nthe level scheme was not possible. The new transitions and\nall previously known transitions in this energy region were\nincluded in the fit. However, several give intensities less\nthan 0.5% of the inclusive cross section and are considered\nconsistent with zero. Fluctuations in the fit residue are clearly\nmore statistical in this region than in the 5 keV\/bin region,\nbut the reduced photopeak efficiency results in a minimum\nsensitivity ranging from approximately 0.5% at 1 MeV to\n1% at 2.5 MeV. Branching ratios for the depopulation of\nthe 2.244-MeV state are compared with those presented in\nRef. [27], and a significant deviation is observed for the\n1.215-MeV transition. According to Ref. [27] the intensity\nof the 1.215-MeV transition should be approximately 1\/10th\nof the intensity of the 2.244 MeV transition. Further, the 1.215\nshould be accompanied by a subsequent 0.808-MeV transition\nthat is not observed. Therefore, the 1.2-MeV peak must be a\ndoublet with the majority of the intensity associated with a\nnew unplaced transition.\nBranching ratios are determined by intensity balancing of\npreviously known and placed transitions, and results of this\nanalysis are summarized in Table III. The entire intensity of\nthe 1.2-MeV transition is listed as unplaced, whereas clearly\nsome small part of it (0.4%, absolute) must be associated with\npopulation of the state at 2.244 MeV. However, according to\nthe branching ratios reported in Ref. [27], this small part is\nwell within the uncertainty of the total branch to the state at\n2.244 MeV.\nThe longitudinal momentum distribution associated with\nthe population of the state at 0.221 MeV is extracted by apply-\ning a combined gate on the 0.171- and 0.221-MeV photopeaks\nwith background contributions subtracted as discussed for the\n30Mg measurement. The 0.221-MeV momentum distribution\nis shown in Fig. 7. The momentum acceptance of 0.5 GeV\/c\nis reflected by the limits of the x axis, and acceptance losses\nare estimated for this distribution, as discussed for the 30Mg\nmeasurement, to be approximately 1–2%. The gate for this\ndistribution includes an approximate 6% contribution from the\nextended 0.240-MeV response functions, which should add a\nbroad but negligible \u0001 = 3 component, and the γ -ray analysis\nsuggests that 90% of the distribution is associated with direct\n014316-7\nJ. R. TERRY et al. PHYSICAL REVIEW C 77, 014316 (2008)\n11.0 11.2 11.4 11.0 11.2 11.4\n=0\n=1\n=2\n=1\n=2\n=3\nFIG. 7. Longitudinal momentum distributions for states popu-\nlated in the knockout residue 31Mg. The panel on the left shows\nthe distribution associated with the population of the excited state at\n0.221 MeV, whereas the right panel is that for the state at 0.945 MeV.\nThe 0.945-MeV distribution is overlaid with calculated curves assum-\ning \u0001 = 0 (solid), \u0001 = 1 (dashed), and \u0001 = 2 (dotted). The 0.221-MeV\ndistribution is not reproduced by a single \u0001-value distribution likely\ndue to indirect feeding. This distribution is fit with a combination\nof \u0001 = 1 and \u0001 = 2 with a fixed \u0001 = 3 component due to known\ncontamination in the γ -ray energy gate.\nfeeding of the state at 0.221 MeV. However, the distribution is\nnot reproduced by any single \u0001-value distribution. This leads\nto the conclusion that this state is populated indirectly by one\nor more unobserved or unplaced γ -ray transitions.\nThe 0.221-MeV distribution shown in Fig. 7 is overlaid\nwith a fit that includes a narrow \u0001 = 1 and a broad \u0001 = 2\ncomponent as well as a small and fixed \u0001 = 3 component\nto model the 0.240-MeV contamination. The result of the fit\nsuggests that the broad component accounts for 40(10)% of the\ncross section that feeds, either directly or indirectly, the state at\n0.221 MeV or 10(3)% of the inclusive cross section. A fit was\nalso performed in which the contamination is assumed to be\npurely \u0001 = 3 and the quoted estimate of the contamination is\nan average of the two results. No part of the contamination\nin this analysis is assumed to be \u0001 = 0 as this distribution is\ntoo similar to the \u0001 = 1 distribution. This presents a strong\nlimitation to this analysis. The observed indirect feeding to\nthe state at 0.221 MeV accounts for only 1.2(8)% of the\ninclusive cross section, leaving another 9(3)% of indirect\nfeeding unobserved.\nThree unplaced transitions with a total intensity of 4.9(16)%\nare observed in the γ spectrum and may feed the 0.221-MeV\nstate. This scenario would explain the shape of the 0.221 MeV\ndistribution assuming that all of these transitions are associated\nwith broad momentum distributions (\u0001 > 1) and feed the\nstate at 0.221 MeV. However, the possibility of indirect\nfeeding from states populated with a branching ratio below\nthe approximate 0.5–1% sensitivity cannot be excluded. It is\nimportant to note that this distribution is extracted by gating\non a sharp photopeak resulting from prompt emission of a\ntransition γ -ray. Therefore, feeding transitions contributing\nto this momentum distribution should also be prompt and\nthus of good resolution, reducing the possible modes of\nnonobservation to (i) an intensity below the above mentioned\nsensitivity or (ii) an energy below the 0.1-MeV threshold.\nThe longitudinal momentum distribution for events popu-\nlating the state at 0.945 MeV is also extracted by gating on the\n0.895-MeV photopeak. Low statistics in this photopeak limit\nthe quality of the extracted momentum distributions. However,\nthis distribution is clearly narrow, indicating \u0001 = 0 or \u0001 = 1\nand negligible acceptance losses. Given the limited statistics,\nit is not possible to extract a momentum distribution for other\npopulated states. Acceptance corrections are calculated within\nthe acceptance window as discussed for the 30Mg measure-\nment. Because momentum distributions are not available for a\nnumber of states in the present measurement, corrections due\nto momentum acceptance losses are estimated to be similar to\nthose measured in the 30Mg measurement for corresponding\n\u0001 values. These systematic uncertainties are included in the\ndiscussion of the 32Mg results.\nIV. DISCUSSION\nA. 30Mg\nThe level structure of the 29Mg knockout residue has\nbeen extensively investigated by means of fusion-evaporation\nreactions, multinucleon transfer, β decay, and β-delayed\nneutron decay [51]. The level structure of the knockout\nresidue 29Mg is compared to USD shell model calculations\nin Fig. 6 of Ref. [46]. Present results are consistent with\nthis interpretation of the level scheme. In particular, spin and\nparity assignments for the states at 2.500 and 2.615 MeV\nare supported by the respective broad and narrow momen-\ntum distributions observed for these states. Although no\ndirect feeding is observed to excited states at 1.095 and\n1.431 MeV in β decay from the positive-parity 29Na ground\nstate, they are populated in the β-n reaction from 30Na,\nsuggesting a negative parity assignment [46,47]. Cross sections\nto these states in the 30Si(13C,14O)29Mg reactions are approx-\nimately equal to those for the population of the first 3\/2− and\n7\/2− states of 27Mg in the 28Si(13C,14O)27Mg reaction [52],\nsuggesting assignments of 3\/2− and 7\/2− for the respective\nstates at 1.095 and 1.431 MeV. Momentum distributions\nobserved for these two states in the present measurement (see\nFig. 5) support this assignment.\nCross sections for the single-neutron knockout from 30Mg\nare compared to shell-model calculations in Table IV. Single-\nparticle cross sections σsp for single-neutron removal are\ncalculated in a three-body eikonal reaction model [33,34].\nDeduced spectroscopic factors C2Sexp are given as the ratio of\nthe measured partial cross sections to the corresponding calcu-\nlated single-particle cross sections. The deduced spectroscopic\nfactors carry an additional systematic uncertainty due to mo-\nmentum acceptance losses as discussed in Sec. III A. Predicted\nspectroscopic factors and single-particle occupancies obtained\nfrom an OXBASH [53] calculation using the USD interaction\n[22] are included as well as single-particle occupancies\nobtained from a Monte Carlo shell-model calculation [21]\nusing the SDPF-M interaction [54]. As indicated in Fig. 2\nand shown in Table IV, USD and SDPF-M single-particle\noccupancies are in good agreement for the 30Mg ground state\n014316-8\nSINGLE-NEUTRON KNOCKOUT FROM INTERMEDIATE . . . PHYSICAL REVIEW C 77, 014316 (2008)\nTABLE IV. Deduced spectroscopic strengths and calculated single-particle occupancies for 30Mg.\nWith the exception of \u0001 values given for the ground state doublet, the listed \u0001 values indicate values or\nconstraints deduced in the present work. Values given for the ground state doublet are assumed based\non spin and parity assignments from previous measurements.\nElevel \u0001 σexp σsp C2Sexp C2SUSD n\u0001j 〈n〉USD 〈n〉SDPF-M\n(MeV) (mb) (mb)\n0.000 (2) 47.4(38) 17.9 1.31 1d3\/2 2.27 1.82\n0.055 (0) 25.3 1.46 2s1\/2 1.90 1.81\n1.095 1 4.3(15) 22.8 0.19(7) 2p3\/2 – 0.08\n1.431 3 6.7(17) 16.4 0.41(10) 1f7\/2 – 0.52\n1.642 2 7.3(15) 16.0 0.46(9) 0.20 1d5\/2 5.83 5.77\n2.500 (2,3) 3.7(15) 16.1 0.23(9) 0.23\n2.615 (0,1) 6.9(15) 20.5 0.34(7) 0.22\n3.232 2 21.5(22) 15.5 1.39(14) 1.76a\n3.674 2.3(10)\naSummed C2SUSD for 3\/2 and 5\/2 states predicted at 3.23 and 3.04 MeV.\nwith the exception of a modest occupancy in fp single-particle\nstates included in the latter. Further, USD spectroscopic factors\npredict strong feeding to the 3\/2+ ground state, the low-lying\n1\/2+ excited state, and two 5\/2+ excited states near the\nneutron-separation energy. Observed partial cross sections are\nin qualitative agreement with this prediction showing strong\nfeeding of the ground state and low-lying first excited state\nand a doublet of states with \u0001 = 2 near the neutron threshold.\nAlthough the results of this measurement on 30Mg are\nin qualitative agreement with USD shell-model predictions,\nindicating the dominance of 0p-0h configurations in the ground\nstate, significant spectroscopic strength is observed to the\nlow-lying negative-parity states at 1.095 and 1.431 MeV,\nas shown in Table IV. Although spectroscopic factors are\nnot yet available from MCSM calculations, the observed\nspectroscopic strength is compared to upper limits provided\nby the SDPF-M-calculated total occupancy in each single-\nparticle state. The predicted occupancy in the ν2p3\/2 orbital\nis rather small at 0.081 neutrons. The observed spectroscopic\nstrength in the lowest 3\/2− state is already more than twice\nthe predicted full occupancy of the corresponding single-\nparticle state, revealing a significant deviation from SDPF-M\ncalculations. The observed 7\/2− spectroscopic strength is less\nthan the SDPF-M upper limit, accounting for 80(20)% of the\ncalculated ν1f7\/2 occupancy.\nThe observed spectroscopic strength to the lowest two\nnegative-parity states appears to be consistent with single-\nparticle occupancies calculated with the SDPF-M interaction.\nHowever, there is an additional negative-parity state suggested\nat 2.266 MeV based on β-delayed neutron emission mea-\nsurements [47]. In the present experiment, significant direct\nfeeding to a state at 2.28 MeV is observed. Although this\nstate is not definitely identified as that observed at 2.266 MeV\nin Ref. [47], this possibility is not excluded. The momentum\ndistribution for the state at 2.28 MeV is not well extracted (and\nnot shown in Fig. 5) making a definitive \u0001-value assignment\nimpossible. However, the width of the distribution makes \u0001 = 3\nunlikely. Therefore, if this state is found to be a negative-parity\nstate, then the present work indicates a spin constraint of\n(1\/2,3\/2); the former perhaps indicating the influence of the\n2p1\/2 single-particle state, which is outside of the SDPF-M\nmodel space, and the latter suggesting a more significant\nunderestimation of the total 2p3\/2 occupancy in the ground\nstate of 30Mg.\nB. 32Mg\nThe level scheme of 31Mg below 0.5 MeV based on previous\nexperiments is shown in Fig. 8. The ground-state spin and\nparity have been determined to be 1\/2+ [11]. Results from β\ndecay and β-delayed neutron measurements suggest positive\nparity for the two lowest states and negative parity for the\nstates at 0.221 and 0.240 MeV [27]. Measured lifetimes\nof the states at 0.221- and 0.461-MeV excited states [50]\nand the state at 0.051 MeV [27] limit multipolarities to\ndipole for the lower three transitions and quadrupole for\nthe 0.240-MeV transition. These results compare well with\nshell-model predictions [27,50] that include particle-hole\nexcitations across the N = 20 shell gap, motivating the given\ntentative assignments. Although these tentative assignments\ncannot be confirmed in the present analysis, they are adopted\nin discussing results.\n1\/2+\n(3\/2)+\n(3\/2)-\n(7\/2)-\n0.0\n0.1\n0.2\n0.3\n0.4\n0.5\n50\n.5\n(7\n)\n22\n1.\n0(\n4)\n17\n0.\n5(\n8)\n24\n0(\n1)\n31Mg\nL\n=\n1\nL\n=\n1\nL\n=\n1\nL\n=\n2\nFIG. 8. Observed level scheme for 31Mg. The L represent\nmultipole orders deduced by lifetime measurements.\n014316-9\nJ. R. TERRY et al. PHYSICAL REVIEW C 77, 014316 (2008)\nTABLE V. Deduced spectroscopic factors and calculated single-\nparticle occupancies for 32Mg. The \u0001 values given in parentheses are\nassumed based on previous measurements.\nElevel \u0001 σexp σsp C2Sexp n\u0001j 〈n〉SDPF-M\n(MeV) (mb) (mb)\n0.000 (0) 36.8(68) 25.9 2s1\/2 1.90\n0.051 (2) 17.4 1d3\/2 2.12\n0.221 (1) 15.4(28) 26.3 0.59(11) 2p3\/2 0.32\n0.461 (3) 19.1(58) 16.0 1.19(36) 1f7\/2 1.83\n0.673 2.7(17) 1d5\/2 5.83\n0.945 4.7(11)\n1.154 1.6(10)\n2.244 6.0(13)\nThe present measurement reveals strong feeding of the\nfirst two negative-parity states in 31Mg by the single-neutron\nknockout reaction. The observed spectroscopic strengths to\nthe low-lying 3\/2− and 7\/2− states are listed in Table V\nbut carry an additional systematic uncertainty as discussed\nin Sec. III B. The 7\/2− spectroscopic strength is assumed to\ninclude no unobserved indirect feeding and is consistent with\nthe predicted SDPF-M upper limit accounting for 65(20)%\nof the SDPF-M predicted full occupancy. The quoted 3\/2−\nstrength represents an upper limit extracted by a combination\nof γ -ray analysis and a fit to the momentum distribution.\nFrom the γ -ray analysis the fraction of the inclusive cross\nsection that feeds, both directly and indirectly, the state at\n0.221 MeV is obtained. From the fit to the momentum\ndistribution, 60(10)% of the cross section is attributed to \u0001 =\n0, 1 states. The quoted 3\/2− spectroscopic strength exceeds\nthe SDPF-M upper limit by nearly a factor of 2, suggesting\na possible systematic underprediction of the 1p3\/2 occupancy\nin SDPF-M calculations. However, systematic uncertainties in\nthe 3\/2− spectroscopic factor must be considered.\nThe upper limit of the 3\/2− spectroscopic factor is obtained\nby assuming negligible \u0001 = 0 indirect feeding to the low-lying\nstate at 0.221 MeV. To assess the validity of this assumption,\nit is noted that the 32Mg ground state is well reproduced,\nassuming a pure 2p-2h excitation across the N = 20 shell gap\n[10]. The observed large spectroscopic factor to the low-lying\n7\/2− state alone suggests the importance of particle-hole\nconfigurations across the N = 20 gap in the ground state of\n32Mg. In the present discussion we assume that the 32Mg\nground state can be treated as a pair of neutrons in the fp\nshell coupled to the 30Mg ground state such that spectroscopic\nstrength to positive-parity states (sd model space) should\ncompare well with those measured for the 30Mg ground state.\nIn fact, population of the ground state and\/or the low-lying first\nexcited state accounts for most of the positive-parity feeding,\nsimilar to the 30Mg measurement. In contrast to the 30Mg\nmeasurement, significant population of higher excited states\nis not observed in the present measurement. However, with\nthe low neutron separation energy of Sn = 2.378(15) MeV\n[55], the suggested higher-lying strength may fall beyond the\nneutron threshold, and overall results are consistent with the\nabove-mentioned assumption for the structure of the 32Mg\nground state.\nThe actual extent of \u0001 = 0 indirect feeding into the state at\n0.221 MeV cannot be determined. Consequently, the deduced\n3\/2− spectroscopic factor carries a systematic uncertainty.\nBased on the simple assumption for the 32Mg ground-state\nstructure, the systematic uncertainty is approximated by the\n\u0001 = 0 spectroscopic strength of 0.34(7) observed in the high-\nenergy level scheme of 29Mg in the 30Mg single-neutron\nknockout measurement. It is noted that if this spectroscopic\nstrength is observed in 31Mg, the cross section to the cor-\nresponding 1\/2+ state must be approximately 6 mb, which\nagrees quite well with the cross section observed to the state at\n2.244 MeV in 31Mg. The observed branch of this state to the\n0.211 MeV states is only 20%, giving a correction of −0.07\nto the deduced 3\/2− spectroscopic factor. Although no further\nevidence exists to support a 1\/2+ assignment to the 31Mg\nstate at 2.244 MeV, this discussion illustrates that the quoted\nsystematic uncertainty in the 3\/2− spectroscopic strength\nis likely overestimated because decay from a higher-lying\n1\/2+ state to the ground-state doublet would be energetically\nfavored.\nC. Transition into the island of inversion\nThe summed negative-parity spectroscopic strength of\n0.60(12) and 1.78(38) deduced for 30Mg and 32Mg, respec-\ntively, represents a direct observation of at least this many\nneutrons occupying fp single-particle states. The latter value\nis an upper limit because indirect feeding cannot be excluded in\nthe deduced cross sections. Because spectroscopic strength is\noften concentrated in the lowest-lying excited states of given\nspin and parity, this sum is taken as a good estimate of the\ntotal fp occupancy. These results suggest a dramatic increase\nin fp single-particle occupancy by a factor of approximately\n3 between 30Mg and 32Mg.\nA comparison of deduced negative-parity spectroscopic\nfactors to SDPF-M-calculated single-particle occupancies for\n30,32Mg is shown in Fig. 9. As shown in the right panel,\n30Mg 32Mg\n0\n1.0\n2.0\n30Mg 32Mg\n0\n0.5\n1.0\n0\n1.0\n2.0\n7\/2-\n3\/2-\nSum\nFIG. 9. Comparison of deduced spectroscopic factors to SDPF-\nM single-particle occupancies. Deduced spectroscopic factors are\nindicated by data points with systematic uncertainties shown as gray\nbars. SDPF-M occupancies are represented by bars. The left panels\nshow a comparison of deduced spectroscopic factors to the lowest\n7\/2− and 3\/2− states to the respective SDPF-M calculated 0f7\/2 and\n1p3\/2 occupancies. The panel on the right shows a comparison of\nthe sum of these deduced spectroscopic strengths to the summed fp\nSDPF-M single-particle occupancy.\n014316-10\nSINGLE-NEUTRON KNOCKOUT FROM INTERMEDIATE . . . PHYSICAL REVIEW C 77, 014316 (2008)\nthe summed negative-parity spectroscopic strength compares\nwell with fp single-particle occupancies obtained using the\nSDPF-M interaction [23,24]. These results provide a first direct\nobservation of a N = 20 cross-shell intruder admixture in\nthe ground state of 30,32Mg. Further, present results provide\na first observation of intruder admixtures in the ground state\nof 30Mg, providing an important test of the understanding of\nthe weakening N = 20 shell gap. Quantitative agreement with\nSDPF-M calculations for 30Mg indicate an accurate treatment\nof the transition from normal to intruder dominance in the\nground states of magnesium isotopes.\nV. SUMMARY\nSingle-neutron knockout measurements have been per-\nformed from 30,32Mg revealing significant direct population\nof negative-parity states in the 29,31Mg knockout residues.\nPopulation of negative-parity states in this reaction gives direct\nand quantitative evidence of the presence of N = 20 cross-\nshell intruder configurations in the ground states of 30,32Mg.\nWith Jπ assignments supported by analysis of extracted\nlongitudinal momentum distributions for excited states at\n1.095 and 1.431 MeV in 29Mg and by a number of previous\nobservations for states at 0.221 and 0.461 MeV in 31Mg,\nspectroscopic factors are extracted that quantify the extent\nof these intruder admixtures. Deduced spectroscopic factors\nfrom the present measurements are compared to SDPF-M\ncalculated single-particle occupancies, which provide occu-\npation numbers and thus an upper limit for the spectroscopic\nstrengths. Although the deduced 7\/2− spectroscopic strengths\ncompare well with SDPF-M calculations, 3\/2− spectroscopic\nstrengths are underpredicted by at least a factor of 2. The total\nobserved spectroscopic strength to negative-parity states for\n30Mg is 0.60(12), whereas, for 32Mg, it is three times as large\nat 1.78(38), indicating a dramatic shift in structure with the ad-\ndition of two neutrons. This sudden increase in fp occupancy\nis in good agreement with SDPF-M calculations, illustrating\nthe predictive power of the interaction in this region.\nACKNOWLEDGMENTS\nThis work is supported by the United States National\nScience Foundation under contracts PHY-0606007 and PHY-\n0555366, by the UK Engineering and Physical Sciences\nResearch Council (EPSRC) under grant no. EP\/D003628, by\na Grant-in-Aid for Specially Promoted Research (13002001)\nand a Grant-in-Aid for Young Scientists (14740176) from\nthe MEXT, by the RIKEN-CNS collaboration project on\nlarge-scale nuclear structure calculation, and by the JSPS\ncore-to-core project, EFES.\n[1] C. Thibault, R. Klapisch, C. Rigaud, A. M. Poskanzer, R. Prieels,\nL. Lessard, and W. Reisdorf, Phys. Rev. C 12, 644 (1975).\n[2] T. Glasmacher, Annu. Rev. Nucl. Part. Sci. 48, 1 (1998).\n[3] Y. Yanagisawa, M. Notani, H. Sakurai, M. Kunibu, H. Akiyoshi,\nN. Aoi, H. Baba, K. Demichi, N. Fukuda, H. Hasegawa et al.,\nNucl. Phys. A734, 374 (2004).\n[4] H. Iwasaki, T. Motobayashi, H. Sakurai, K. Yoneda, T. Gomi,\nN. Aoi, N. Fukuda, Z. Fu¨lo¨p, U. Futakami, Z. Gacsi et al., Phys.\nLett. B522, 227 (2001).\n[5] B. V. Pritychenko, T. Glasmacher, P. D. Cottle, M. Fauerbach,\nR. W. Ibbotson, K. W. Kemper, V. Maddalena, A. Navin,\nR. Ronningen, A. Sakharuk et al., Phys. Lett. B461, 322 (1999).\n[6] B. V. Pritychenko, T. Glasmacher, B. A. Brown, P. D. Cottle,\nR. W. Ibbotson, K. W. Kemper, L. A. Riley, and H. Scheit, Phys.\nRev. C 63, 011305(R) (2000).\n[7] B. V. Pritychenko, T. Glasmacher, P. D. Cottle, R. W. Ibbotson,\nK. W. Kemper, L. A. Riley, A. Sakharuk, H. Scheit, M. Steiner,\nand V. Zelevinsky, Phys. Rev. C 65, 061304(R) (2002).\n[8] K. Yoneda, H. Sakurai, T. Gomi, T. Motobayashi, N. Aoi,\nN. Fukuda, U. Futakami, Z. Gacsi, Y. Higurashi, N. Imai et al.,\nPhys. Lett. B499, 233 (2001).\n[9] J. A. Church, C. M. Campbell, D.-C. Dinca, J. Enders, A. Gade,\nT. Glasmacher, Z. Hu, R. V. F. Janssens, W. F. Mueller, H. Olliver\net al., Phys. Rev. C 72, 054320 (2005).\n[10] E. K. Warburton, J. A. Becker, and B. A. Brown, Phys. Rev. C\n41, 1147 (1990).\n[11] G. Neyens, M. Kowalska, D. Yordanov, K. Blaum, P. Himpe,\nP. Lievens, S. Mallion, R. Neugart, N. Vermeulen, Y. Utsuno\net al., Phys. Rev. Lett. 94, 022501 (2005).\n[12] V. Tripathi, S. L. Tabor, P. F. Mantica, C. R. Hoffman,\nM. Wiedeking, A. D. Davies, S. N. Liddick, W. F. Mueller,\nT. Otsuka, A. Stolz et al., Phys. Rev. Lett. 94, 162501 (2005).\n[13] J. R. Terry, D. Bazin, B. A. Brown, C. M. Campbell, J. A.\nChurch, J. M. Cook, A. D. Davies, D.-C. Dinca, J. Enders,\nA. Gade et al., Phys. Lett. B640, 86 (2006).\n[14] A. Gade, P. Adrich, D. Bazin, M. D. Bowen, B. A. Brown,\nC. M. Campbell, J. M. Cook, S. Ettenauer, T. Glasmacher,\nK. W. Kemper et al., Phys. Rev. Lett. 99, 072502 (2007).\n[15] B. A. Brown, Prog. Part. Nucl. Phys. 47, 517 (2001).\n[16] A. Navin, D. W. Anthony, T. Aumann, T. Baumann, D. Bazin,\nY. Blumenfeld, B. A. Brown, T. Glasmacher, P. G. Hansen,\nR. W. Ibbotson et al., Phys. Rev. Lett. 85, 266 (2000).\n[17] S. D. Pain, W. N. Catford, N. A. Orr, J. C. Ange´lique, N. I.\nAshwood, V. Bouchat, N. M. Clarke, N. Curtis, M. Freer, B. R.\nFulton et al., Phys. Rev. Lett. 96, 032502 (2006).\n[18] T. Otsuka, R. Fujimoto, Y. Utsuno, B. A. Brown, M. Honma,\nand T. Mizusaki, Phys. Rev. Lett. 87, 082502 (2001).\n[19] T. Otsuka, T. Suzuki, R. Fujimoto, H. Grawe, and Y. Akaishi,\nPhys. Rev. Lett. 95, 232502 (2005).\n[20] T. Otsuka, Y. Utsuno, M. Honma, and T. Mizusaki, Prog. Part.\nNucl. Phys. 46, 155 (2001).\n[21] T. Otsuka, M. Honma, T. Mizusaki, N. Shimizu, and Y. Utsuno,\nProg. Part. Nucl. Phys. 47, 319 (2001).\n[22] B. H. Wildenthal, Prog. Part. Nucl. Phys. 11, 5 (1984).\n[23] Y. Utsuno, T. Otsuka, T. Glasmacher, T. Mizusaki, and\nM. Honma, Phys. Rev. C 70, 044307 (2004).\n[24] Y. Utsuno, T. Otsuka, T. Mizusaki, and M. Honma, Phys. Rev.\nC 60, 054315 (1999).\n[25] O. Niedermaier, H. Scheit, V. Bildstein, H. Boie, J. Fitting,\nR. von Hahn, F. Ko¨ck, M. Lauer, U. K. Pal, H. Podlech et al.,\nPhys. Rev. Lett. 94, 172501 (2005).\n[26] F. Mare´chal, D. L. Balabanski, D. Borremans, J.-M. Daugas,\nF. de Oliveira Santos, P. Dessagne, G. Georgiev, J. Giovinazzo,\nS. Gre´vy, P. Himpe et al., Phys. Rev. C 72, 044314 (2005).\n014316-11\nJ. R. TERRY et al. PHYSICAL REVIEW C 77, 014316 (2008)\n[27] G. Klotz, P. Baumann, M. Bounajma, A. Huck, A. Knipper,\nG. Walter, G. Marguier, C. Richard-Serre, A. Poves, and\nJ. Retamosa, Phys. Rev. C 47, 2502 (1993).\n[28] H. Iwasaki, T. Motobayashi, H. Sakurai, K. Yoneda, T. Gomi,\nN. Aoi, N. Fukuda, Z. Fu¨lo¨p, U. Futakami, Z. Gacsi et al., Phys.\nLett. B620, 118 (2005).\n[29] A. Obertelli, A. Gillibert, N. Alamanos, M. Alvarez, F. Auger,\nR. Dayras, A. Drouart, G. de France, B. Jurado, N. Keeley et al.,\nPhys. Lett. B633, 33 (2006).\n[30] Z. Dombra´di, Z. Elekes, A. Saito, N. Aoi, H. Baba, K. Demichi,\nZ. Fu¨lo¨p, J. Gibelin, T. Gomi, H. Hasegawa et al., Phys. Rev.\nLett. 96, 182501 (2006).\n[31] P. G. Hansen and J. A. Tostevin, Annu. Rev. Nucl. Part. Sci. 53,\n219 (2003).\n[32] B. A. Brown, P. G. Hansen, B. M. Sherrill, and J. A. Tostevin,\nPhys. Rev. C 65, 061601(R) (2002).\n[33] J. A. Tostevin, Nucl. Phys. A682, 320c (2001).\n[34] J. A. Tostevin, J. Phys. G 25, 735 (1999).\n[35] P. G. Hansen, Phys. Rev. Lett. 77, 1016 (1996).\n[36] C. A. Bertulani and P. G. Hansen, Phys. Rev. C 70, 034609\n(2004).\n[37] C. A. Bertulani and A. Gade, Comput. Phys. Commun. 175, 372\n(2006).\n[38] P. S. Miller, F. Marti, D. Poe, M. Steiner, J. Stetson, A. Stolz,\nand P. Zavodszky, in Proceedings of the 17th International\nConference on Cyclotrons and Their Applications, edited by\nA. Goto and Y. Yano (Particle Accelerator Society of Japan,\nTokyo, Japan, 2005), p. 62.\n[39] D. J. Morrissey, B. M. Sherrill, M. Steiner, A. Stolz, and\nI. Wiedenhoever, Nucl. Instrum. Methods B 204, 90\n(2003).\n[40] D. Bazin, J. A. Caggiano, B. M. Sherrill, J. Yurkon, and\nA. Zeller, Nucl. Instrum. Methods B 204, 629 (2003).\n[41] J. Yurkon, D. Bazin, W. Benenson, D. J. Morrissey,\nB. M. Sherrill, D. Swan, and R. Swanson, Nucl. Instrum.\nMethods A 422, 291 (1999).\n[42] W. F. Mueller, J. A. Church, T. Glasmacher, D. Gutknecht,\nG. Hackman, P. G. Hansen, Z. Hu, K. L. Miller, and P. Quirin,\nNucl. Instrum. Methods A 466, 492 (2001).\n[43] G. Scheidenberger and H. Geissel, Nucl. Instrum. Methods B\n135, 25 (1998).\n[44] http:\/\/www-linux.gsi.de\/∼weick\/atima\/\n[45] D. Bazin, O. Tarasov, M. Lewitowicz, and O. Sorlin, Nucl.\nInstrum. Methods A 482, 307 (2002).\n[46] P. Baumann, P. Dessagne, A. Huck, G. Klotz, A. Knipper,\nG. Marguier, C. Miehe´, M. Ramdane, C. Richard-Serre,\nG. Walter et al., Phys. Rev. C 36, 765 (1987).\n[47] P. Baumann, P. Dessagne, A. Huck, G. Klotz, A. Knipper,\nC. Miehe´, M. Ramdane, G. Walter, G. Marguier, H. Gabelmann\net al., Phys. Rev. C 39, 626 (1989).\n[48] M. Berz, K. Joh, J. A. Nolen, B. M. Sherrill, and A. F. Zeller,\nPhys. Rev. C 47, 537 (1993).\n[49] A. Gade, D. Bazin, C. A. Bertulani, B. A. Brown,\nC. M. Campbell, J. A. Church, D.-C. Dinca, J. Enders,\nT. Glasmacher, P. G. Hansen et al., Phys. Rev. C 71, 051301(R)\n(2005).\n[50] H. Mach, L. M. Fraile, O. Tengblad, R. Boutami, C. Jollet,\nW. A. Plo´ciennik, D. T. Yordanov, M. Stanoiu, M. J. G. Borge,\nP. A. Butler et al., Eur. Phys. J. A 25, s01, 105 (2005).\n[51] P. M. Endt, Nucl. Phys. A521, 1 (1990).\n[52] C. L. Woods, W. N. Catford, L. K. Fifield, N. A. Orr, and R. J.\nSadleir, Nucl. Phys. A476, 392 (1988).\n[53] B. A. Brown, A. Etchegoyen, and W. D. M. Rae, Tech. Rep. 524,\nMichigan State University Cyclotron Lab (1988).\n[54] Y. Utsuno, T. Otsuka, T. Mizusaki, and M. Honma, Phys. Rev.\nC 64, 011301(R) (2001).\n[55] G. Audi, A. H. Wapstra, and C. Thibault, Nucl. Phys. A729, 337\n(2003).\n014316-12\n"}