{"doi":"10.1108\/13552510910961138","coreId":"141205","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/6908","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/6908","10.1108\/13552510910961138"],"title":"Observations of acoustic emission in a hydrodynamic bearing","authors":["Mirhadizadeh, S. A.","Mba, David"],"enrichments":{"references":[{"id":37929684,"title":"Acoustic Emission technology for detection of shaft-to-seal rubbing on power generation turbines; a qualitative verification.,","authors":[],"date":null,"doi":"10.1784\/insi.2006.48.12.754","raw":"M. Leahy, D. Mba, P. Cooper, A. Montgomery, D. Owen, Acoustic Emission technology for detection of shaft-to-seal rubbing on power generation turbines; a qualitative verification., INSIGHT, Vol. 48, no. 12, 754-755, Dec","cites":null},{"id":37929681,"title":"Acoustic emissions diagnosis of rotor-stator rubs using the KS statistic,","authors":[],"date":"2004","doi":"10.1016\/s0888-3270(03)00050-5","raw":"Hall L. D., and Mba, D., Acoustic emissions diagnosis of rotor-stator rubs using the KS statistic, Mechanical Systems and Signal Processing, Volume 18, Issue 4, Pages 849-868, 2004.","cites":null},{"id":37929674,"title":"An experimental investigation into the capabilities of Acoustic Emission for the detection of shaft-to-seal rubbing in large power generation turbines,","authors":[],"date":null,"doi":"10.4028\/0-87849-420-0.433","raw":"M. Leahy, D. Mba, P. Cooper, A. Montgomery, D. Owen, An experimental investigation into the capabilities of Acoustic Emission for the detection of shaft-to-seal rubbing in large power generation turbines, Journal of Engineering Tribology, Proc. Instn Mech. Engrs, Part J. 220(J7), 607 – 615,","cites":null},{"id":37929706,"title":"Application of acoustic emission technique for the detection of defects in rolling element bearings, Tribology International,","authors":[],"date":"2000","doi":"10.1016\/s0301-679x(00)00012-8","raw":"Choundhury, A. and Tandon, N., Application of acoustic emission technique for the detection of defects in rolling element bearings, Tribology International, 2000; 33, 39-45.","cites":null},{"id":37929708,"title":"Application of acoustic emission to the detection of bearing failures.","authors":[],"date":"1990","doi":null,"raw":"Tan, C.C. Application of acoustic emission to the detection of bearing failures. The Institution of Engineers Australia, Tribology conference, Brisbane, 3-5 December 1990, 110-114.","cites":null},{"id":37929710,"title":"Bearing defect diagnosis and acoustic emission,","authors":[],"date":"2003","doi":"10.1243\/135065003768618614","raw":"Morhain, A, Mba, D, Bearing defect diagnosis and acoustic emission, Journal of Engineering Tribology, I Mech E, Vol 217, No. 4, Part J, p 257-272, 2003. ISSN 1350-6501.APPENDIX A","cites":null},{"id":37929702,"title":"Comparison of accelerometer and acoustic emission signals as diagnostic tools in assessing bearing.","authors":[],"date":"1988","doi":null,"raw":"Bagnoli, S., Capitani, R. and Citti, P. Comparison of accelerometer and acoustic emission signals as diagnostic tools in assessing bearing. Proceedings of 2nd International Conference on Condition Monitoring, London, UK, May 1988, 117-125.","cites":null},{"id":37929670,"title":"Condition Monitoring and Diagnostic of Machines, Acoustic Emission – General Guidelines,","authors":[],"date":"2007","doi":null,"raw":"ISO 20096, Condition Monitoring and Diagnostic of Machines, Acoustic Emission – General Guidelines, 2007.","cites":null},{"id":37929700,"title":"Condition monitoring of very slowly rotating machinery using AE techniques.","authors":[],"date":"2001","doi":"10.1016\/b978-008044036-1\/50004-4","raw":"Holroyd, T. Condition monitoring of very slowly rotating machinery using AE techniques. 14th International congress on Condition monitoring and Diagnostic engineering management (COMADEM'2001), Manchester, UK, 4-6 September 2001, 29, ISBN 0080440363.","cites":null},{"id":37929704,"title":"Defect Detection of Rolling Element Bearings by Acoustic Emission Method,","authors":[],"date":"1990","doi":"10.1016\/0003-682x(90)90019-q","raw":"Tandon, N. and Nakra, B.C, Defect Detection of Rolling Element Bearings by Acoustic Emission Method, Journal of Acoustic Emission, 1990; 9(1) 25-28.","cites":null},{"id":37929676,"title":"Detecting shaft-to-seal rubbing in power generation turbines with the Acoustic Emission technology,","authors":[],"date":"2006","doi":"10.1115\/1.2346696","raw":"M. Leahy, D. Mba, Detecting shaft-to-seal rubbing in power generation turbines with the Acoustic Emission technology, Journal of Vibration and Acoustics, ASME, Volume 128, Issue 6, 798-800, 2006.","cites":null},{"id":37929678,"title":"Detection of shaft-seal rubbing in large-scale power generation turbines with Acoustic Emissions; Case study”,","authors":[],"date":"2004","doi":"10.1243\/095765004773644076","raw":"Mba, D., Cooke, A., Roby, D., Hewitt, G., (2004) “Detection of shaft-seal rubbing in large-scale power generation turbines with Acoustic Emissions; Case study”, Journal of Power and Energy - Part A, I Mech E, Vol. 218, No. 2, pp. 71-82.","cites":null},{"id":37929671,"title":"Development of Acoustic Emission Technology for Condition Monitoring and Diagnosis of Rotating Machines;","authors":[],"date":"2006","doi":"10.1177\/0583102405059054","raw":"Mba, D. and Rao, R.B.K.N., 2006, “Development of Acoustic Emission Technology for Condition Monitoring and Diagnosis of Rotating Machines; Bearings, Pumps, Gearboxes, Engines and Rotating Structure,” The Shock and Vibration Digest, 38\/1, pp 3-16.","cites":null},{"id":37929683,"title":"Experimental determination of the rubbing location by means of acoustic emission and wavelet transform,","authors":[],"date":"2001","doi":"10.1006\/jsvi.2001.3676","raw":"Wang, Q. and Chu, F., Experimental determination of the rubbing location by means of acoustic emission and wavelet transform, Journal of Sound and Vibration, vol. 248, no. 1, pages 91-103, 2001.","cites":null},{"id":37929686,"title":"Journal-bearing data book \/ editor Tsuneo Someya; with contributions by","authors":[],"date":"1989","doi":"10.1007\/978-3-642-52509-4_3","raw":"Journal-bearing Databook, Journal-bearing data book \/ editor Tsuneo Someya; with contributions by T. Someya, J. Mitsui, J. Esaki... [et. al.]. Berlin: Springer-Verlag, 1989. ISBN: 978-3540170747. Springer-Verlag Berlin and Heidelberg GmbH & Co. K (October 1989).","cites":null},{"id":37929698,"title":"Lies acoustic emission and process machines,","authors":[],"date":"2008","doi":null,"raw":"J.Z. Sikorska and D. Mba ,Truth, Lies acoustic emission and process machines, Journal of Mechanical Process Engineering, Part E, IMechE, Volume 222, Number 1, 1-19, 2008.","cites":null},{"id":37929696,"title":"Monitoring the onset and propagation of natural degradation process in a slow speed rolling element bearing with Acoustic Emissions,","authors":[],"date":"2008","doi":"10.1115\/1.2948413","raw":"M. Elforjani, D. Mba, Monitoring the onset and propagation of natural degradation process in a slow speed rolling element bearing with Acoustic Emissions, ASME, Journal of Vibration and Acoustics, 130, 041013 (2008).","cites":null},{"id":37929692,"title":"Natural mechanical degradation measurements in slow speed bearings, Engineering Failure Analysis,","authors":[],"date":"2009","doi":"10.1016\/j.engfailanal.2008.06.005","raw":"M. Elforjani, D. Mba, Natural mechanical degradation measurements in slow speed bearings, Engineering Failure Analysis, Volume 16, Issue 1, January 2009, Pages 521-532.19. Babak Eftekharnejad, D. Mba, ACOUSTIC EMISSION SIGNALS ASSOCIATED WITH DAMAGED HELICAL GEARS, INSIGHT, Volume: 50, Issue: 8, 450-453, Aug 2008.","cites":null},{"id":37929689,"title":"New acoustic emission source locating system for the study of rolling contact fatigue,","authors":[],"date":null,"doi":"10.1016\/0043-1648(82)90314-3","raw":"Yoshioka T, Fujiwara T. New acoustic emission source locating system for the study of rolling contact fatigue, Wear, 81(1), 183-186.","cites":null},{"id":37929691,"title":"Observations of changes in acoustic emission waveform for varying seeded defect sizes in a rolling element bearing,","authors":[],"date":"2009","doi":"10.1016\/j.apacoust.2008.01.005","raw":"Saad Al-Dossary, R.I. Raja Hamzah, D. Mba, Observations of changes in acoustic emission waveform for varying seeded defect sizes in a rolling element bearing, Journal of Applied Acoustics, Vol. 70, No. 1, Jan 2009, p 58 – 81, ISSN 0003-682X","cites":null},{"id":37929694,"title":"operational bearing parameters and acoustic emission generation,","authors":[],"date":"2008","doi":"10.1115\/1.2776339","raw":"J. Couturier, D. Mba, operational bearing parameters and acoustic emission generation, Journal of Vibration and Acoustics, ASME, Vol 130, 024502, April 2008.","cites":null},{"id":37929685,"title":"Opportunities offered by acoustic emission for seal and blade rub detection on large scale power generation turbines.","authors":[],"date":null,"doi":null,"raw":"10. Al Shaikh Mubarak, M., Mba, D., Cooper, P., Opportunities offered by acoustic emission for seal and blade rub detection on large scale power generation turbines. 16th International congress on Condition monitoring and Diagnostic engineering management (COMADEM'2003) Vaxjo, Sweden, August 27 th – 29 th 2003, p 513, ISBN 91-7636-376-7.","cites":null},{"id":37929672,"title":"Rotating Machinery Diagnosis with Acoustic Emission Techniques”,","authors":[],"date":"1990","doi":"10.1002\/eej.4391100211","raw":"Sato, I., (1990) “Rotating Machinery Diagnosis with Acoustic Emission Techniques”, Electrical Engineering in Japan, Vol. 110, No. 2.","cites":null},{"id":37929688,"title":"The application of vibration analysis and acoustic emission source location to on-line condition monitoring of anti-friction bearings. Tribology International,","authors":[],"date":"1979","doi":"10.1016\/0301-679x(79)90001-x","raw":"Rogers, L. M., The application of vibration analysis and acoustic emission source location to on-line condition monitoring of anti-friction bearings. Tribology International, 1979; 51-59.","cites":null},{"id":37929687,"title":"The detection of incipient failure in bearings,","authors":[],"date":"1969","doi":null,"raw":"Balerston, H. L., The detection of incipient failure in bearings, Materials Evaluation, Vol 27, 121-128, 1969.","cites":null},{"id":37929690,"title":"Use of Acoustic Emission for Machine Condition Monitoring,","authors":[],"date":"1993","doi":"10.1016\/0963-8695(94)90465-0","raw":"Holroyd, T.J. and Randall, N., (1993), Use of Acoustic Emission for Machine Condition Monitoring, British Journal of Non-Destructive Testing, 1993, 35(2), 75-78.","cites":null}],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2009-05-29T00:00:00Z","abstract":"<B>Purpose<\/B> - Numerous studies have been conducted in the field of acoustic\nemission (AE) technology applied to rotating machine fault diagnosis.\nPrincipally, most of the work to date has been focused on correlating AE\nactivity to the defect condition on rolling element bearings with limited\ninvestigations on hydrodynamic bearings. This paper aims to address this issue.\n<B>Design\/methodology\/approach<\/B> - This paper presents experimental tests\naimed at understanding the influence of speed and load on generation of AE in a\nhydrodynamic bearing. <B>Findings<\/B> - The research presented shows that the\npower losses associated which hydrodynamic bearing has a direct influence on the\ngeneration of AE. <B>Research limitations\/implications<\/B> - Further research\nshould include the application of the proposed methodology on a broad range of\noperational machines employing hydrodynamic bearings. <B>Practical\nimplications<\/B> - In developing the AE technology for monitoring hydrodynamic\nbearings operated under variable speed and load conditions, it is essential that\na relationship between the operational variables and the generation of AE is\nestablished, and this paper explores such a relationship. <B>Originality\/value<\/\nB> - The paper presents the first known correlation between AEs and the\noperating parameters of a hydrodynamic bearing","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/141205.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1108\/13552510910961138","pdfHashValue":"04b9a8005e020d1bdb9b9d33f66e195c81dcfb25","publisher":"Emerald Group Publishing Limited","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/6908<\/identifier><datestamp>2012-02-06T11:55:44Z<\/datestamp><setSpec>hdl_1826_19<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Observations of acoustic emission in a hydrodynamic bearing<\/dc:title><dc:creator>Mirhadizadeh, S. A.<\/dc:creator><dc:creator>Mba, David<\/dc:creator><dc:subject>Bearings<\/dc:subject><dc:subject>Condition monitoring<\/dc:subject><dc:subject>Hydrodynamics<\/dc:subject><dc:description><B>Purpose<\/B> - Numerous studies have been conducted in the field of acoustic\nemission (AE) technology applied to rotating machine fault diagnosis.\nPrincipally, most of the work to date has been focused on correlating AE\nactivity to the defect condition on rolling element bearings with limited\ninvestigations on hydrodynamic bearings. This paper aims to address this issue.\n<B>Design\/methodology\/approach<\/B> - This paper presents experimental tests\naimed at understanding the influence of speed and load on generation of AE in a\nhydrodynamic bearing. <B>Findings<\/B> - The research presented shows that the\npower losses associated which hydrodynamic bearing has a direct influence on the\ngeneration of AE. <B>Research limitations\/implications<\/B> - Further research\nshould include the application of the proposed methodology on a broad range of\noperational machines employing hydrodynamic bearings. <B>Practical\nimplications<\/B> - In developing the AE technology for monitoring hydrodynamic\nbearings operated under variable speed and load conditions, it is essential that\na relationship between the operational variables and the generation of AE is\nestablished, and this paper explores such a relationship. <B>Originality\/value<\/\nB> - The paper presents the first known correlation between AEs and the\noperating parameters of a hydrodynamic bearing.<\/dc:description><dc:publisher>Emerald Group Publishing Limited<\/dc:publisher><dc:date>2012-01-30T23:02:58Z<\/dc:date><dc:date>2012-01-30T23:02:58Z<\/dc:date><dc:date>2009-05-29T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>S. Ali Mirhadizadeh, D. Mba, Observations of acoustic emission in a hydrodynamic bearing, Journal of Quality in Maintenance Engineering, Volume 15, Issue 2, 2009, Pages 193 - 201.<\/dc:identifier><dc:identifier>1355-2511<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1108\/13552510910961138<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/6908<\/dc:identifier><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1355-2511","1355-2511"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":["Bearings","Condition monitoring","Hydrodynamics"],"subject":["Article"],"fullText":"OBSERVATIONS OF ACOUSTIC EMISSION IN A HYDRODYNAMIC\nBEARING\nSchool of Engineering, Cranfield University, Bedfordshire. MK43 0AL, UK\nS. Ali Mirhadizadeh, D. Mba\nAbstract\nNumerous studies have been conducted in the field of Acoustic Emission technology\napplied to rotating machine fault diagnosis. Principally most of the work to date has\nbeen focused on correlating Acoustic Emission (AE) activity to the defect condition\non rolling element bearings with limited investigations on hydrodynamic bearings. In\ndeveloping the AE technology for monitoring hydrodynamic bearings operated under\nvariable speed and load conditions it is essential that a relationship between the\noperational variables and the generation of AE is established. This paper presents\nexperimental tests aimed at understanding the influence of speed and load on\ngeneration of Acoustic Emission in a hydrodynamic bearing. It is concluded that the\npower losses associated which such bearings has a direct influence on the generation\nof AE.\nKeywords: Acoustic Emission, Condition monitoring, Hydrodynamic bearing.\n1. Introduction\nAcoustic Emission (AE) is defined as the range of phenomena that results in the\ngeneration of structure-borne and fluid-borne propagating waves due to the rapid\nrelease of energy from localised sources within and\/or, on the surface of a material\n[1]. The typical frequency content of AE is within the range of 100 kHz to 1 MHz.\nThe AE technology is continually developing into a complimentary technology to\nother condition monitoring technologies such as vibration analysis [2, 12-29 ].\nIn the application of AE to hydrodynamic bearings (journal bearings) Sato [3] was the first\ninvestigator that directly addressed monitoring the integrity of such bearings with AE.\nTypical problems that are associated with journal bearings include wear and metal wipe\nwhich is a direct consequence of the shaft making contact with the journal. Such frictional\ncontact is a prime source of AE. Others [4 to 8] have applied the AE technology to shaft-\nseal rubbing in large power generation turbines. Leahy et al [9] undertook the most\nrealistic controlled verification of applicability of AE to shaft seal rubbing and Al-\nShaikh Mubarak et al [10] attempted to apply the technology for monitoring blade\nrubbing. Whilst in all the cases highlighted above the measurement of AE was predominately\nmade at the journal bearing housing, no attempt was made to understand the factors that\ngovern the generation of AE within the bearing as a function of the operational variables such\nas load, film thickness and speed. The aim of this investigation is to ascertain the\nrelationship between rotational speed, applied load, theoretical film thickness and AE\nr.m.s for hydrodynamic bearing, which hitherto has not .been explored.\n2. EXPERIMENTAL PROGRAMME\nThe hydrodynamic bearing test rig employed for this study had an operational speed\nrange of between 500 to 4000 rpm . The test bearing had a radius of 40 mm, length of\n80mm and a recommended radial clearance of 0.04 mm. The bearing was lubricated\nwith Castrol Magna BD 68 (ISO 32) with a base oil kinematic viscosity at 40°C and\n100°C of 68cSt and 8.8cSt respectively. For these tests a maximum load of 800N was\napplied. One of the fundamental reasons for testing under very lightly loaded\nconditions was to ensure that a minimum film thickness of the test bearings was much\nlarger than the surface roughness of the bearing (3µm Ra).\nTwo Physical Acoustics Pico type sensors (200 KHz to 750 KHz frequency\nbandwidth) were placed directly onto the test bearing at each end, see figure 2. The\nsensor output was amplified at 40 dB. The ‘PICO’ type sensor was employed due to\nits size (5 mm in diameter and 5 mm in height) making it suitable for placement in\nconfined areas.\nFigure 1 Test rig layout\nIn addition, two thermocouples used for measuring the journal temperature during the\ntests were welded onto the bearing race adjacent to the AE sensors. The test\nconditions investigated included five rotational speeds 500, 1000, 2000, 3000 and\n4000 rpm and six load conditions, 300N, 400N, 500N, 600N, 700N and 800N.\nLoading was accomplished by placing weights onto a load plate linked to the rotating\nshaft either side of the test bearing, see figure 1. As such for a test condition of 800N,\n400N force was applied to each loading plate. Acoustic Emission r.m.s values were\ncalculated in real time by the analogue-to-digital converter over a time constant of\n10milli-seconds and at a sampling rate of 100 Hz. AE waveforms were sampled at\n2MHz.\nFigure 2 Location of AE and thermocouple sensors on test bearing\nFor this investigation tests involved varying the applied bearing load for fixed\nrotational speed whilst recording the AE r.m.s activity; each load condition was\ninvestigated under near constant temperatures. This was done in an attempt to\neliminate the influence of temperature during the tests. Prior to performing the tests,\nthe temperature of the test bearing was raised to approximately 40°C; this was\nachieved by running the test-rig in excess of 1000 rpm at 100N. As soon as the\ndesired temperature was reached, the test sequence began. The test involved running\nthe bearing at five rotational speeds and increasing the radial load, starting at 150N,\nand increasing the load in 50N increments every 5-minutes to a maximum of 400N.\nThe five speed conditions investigated were, 500, 1000, 2000, 3000, and 4000 rpm.\nThe test simulations under each load and speed condition was maintained at 5-minutes\nas longer operation would have significantly comprised the authors attempts to\nAE sensor\nmaintain near isothermal conditions. Over 4 experimental tests programmes were\nundertaken where the experimental procedure described was repeated.\n3. RESULTS AND DISCUSSIONS\nThe results of this test are presented in figures 3, 4 and 5. Figure 3 highlights\nobservations of theoretical minimum film thickness (h0) and AE r.m.s measured on\nthe bearing for a fixed speed condition. It is evident is that an increase in load resulted\nin a decrease in theoretical minimum film thicknesses and a corresponding increase in\nmeasured AE r.m.s values. This highlighted the sensitivity of the AE technology is\ndiscriminating such small differences in film thickness. Also It must be noted that\nduring these test conditions, the temperature varied by a maximum of approximately\n±3°C. All calculations of minimum film thickness and power losses were based on\nwell established procedures [11].\nFrom figure 4, it was noted that the change in load had a negligible influence on the\nlevel of AE activity for that particular speed condition, however, the change in\nrotational speed increased AE levels significantly even though the actual predicted\nchange in minimum film thickness with increased speed was of the order of less than\n1% for the tests conditions (see table A1 in Appendix). The corresponding increase in\nAE levels from changes in speed were in the order of over 150% on average, see table\nA2 in the Appendix. The authors attribute this significant change to the shearing\neffect of the lubricant which is a function of the rotational speed. As with\nhydrodynamic bearings there is no asperity contact and the corresponding increase in\nAE levels is attributed to the friction associated with the shearing of the lubricant. The\nvalues of AE r.m.s and minimum film thickness presented in figures 3 and 4 were\nobtained by averaging all AE r.m.s and ho values measured and calculated over the\nspecific load condition.\nObservations showed AE levels increased with power losses, see figure 5, and\naveraged data is given in the appendix, table A3. All calculations of power loss at\nevery test condition are presented in figure 5. It is worth stating that due to the\nminimal influence of load on film thickness under these test conditions, the power\nlosses associated with varying loads, at the same speed condition, was very similar,\nsee figure 5. The increase in AE with power loss was not surprising given that\nincrease in speed results in more power loss due to the increased friction in the\nshearing of the lubricant. A reduced minimum film thickness causes increased power\nlosses and such energy losses are noted by an increase in AE r.m.s levels. A\nrelationship between the power losses and AE r.m.s levels was determined:\nAE (r.m.s in volts) = A.W 3 - B.W 2 + C.W - D (1)\nwhere W = power loss (KW), A = .006, B = 0.005. C = 0.01 and D = 0.01\nThis equation holds based on the assumption that the load has minimal influence on\nthe film thickness which is the case for this investigation.\nFigure 3 AE r.m.s levels for Load conditions (4000 rpm)\nFigure 4 AE r.m.s levels for varying speed and load conditions (40dB amplification)\nFigure 5 AE r.m.s and total power loss for varying speed and load conditions\n3.2 Rubbing Test\nA presumption made for most of the results presented is that under hydrodynamic\nconditions there is no asperity contact between the rotating shaft the bearing. It was\nthought prudent to assess the sensitivity of the AE measurements to the onset of\ncontact between the shaft and the journal. In the rubbing tests the shaft was forced to\nrub against the journal. This was achieved by slowly increasing the load on the\nbearing at the drive end only; the loading of the bearing was changed rapidly at\nincremental values of 50N force to a maximum load of 400N. Initially the test was run\nat 1000 rpm (16.67 Hz) with a 50N load for 5 minutes, after which 50N increments\nwere made within a two minute time frame to the maximum load of 400N at the drive\nend only. Interestingly, at 350N a significant increase in AE levels was noted, see\nfigure 6. In addition, AE waveforms were acquired at each force increment as\ndepicted in figure 6. It was noted that associated with the rise in AE levels the AE\nwaveform was modulated at the rotational shaft speed, see figure 6 and 7. Figure 7\nhighlights a few AE waveforms showing varying degrees of amplitude of the\nmodulated waveform, which is postulated to be a function of the intensity of the rub.\nSuch observations validate the results of others [3, 4] as indicative of a rubbing\ncontact within the journal.\nFigure 6 AE r.m.s levels and associated sample waveform during rub tests\nFigure 7 Modulated AE waveforms due to rubbing between 170 seconds\nand 220 seconds of figure 6\n4. CONCLUSIONS\nThe observations presented have confirmed that in a properly maintained\nhydrodynamic lubrication regime a principal source of AE is the friction in the\nshearing of the lubricant. It has been shown that an increase in running speed\ngenerates higher AE activity in comparison to an increase in bearing load. This is\nattributed to the powers losses as a direct result of shearing of the lubricant film.\nLastly, the application of AE to detection of bearing wipe has been demonstrated and\nfurther research is needed to fully understand the influence of operational variables on\nAE over a much broader operating range, including oil viscosity and bearing material\neffects.\nREFERENCES\n1. ISO 20096, Condition Monitoring and Diagnostic of Machines, Acoustic\nEmission – General Guidelines, 2007.\n2. Mba, D. and Rao, R.B.K.N., 2006, “Development of Acoustic Emission\nTechnology for Condition Monitoring and Diagnosis of Rotating Machines;\nBearings, Pumps, Gearboxes, Engines and Rotating Structure,” The Shock and\nVibration Digest, 38\/1, pp 3-16.\n3. Sato, I., (1990) “Rotating Machinery Diagnosis with Acoustic Emission\nTechniques”, Electrical Engineering in Japan, Vol. 110, No. 2.\n4. M. Leahy, D. Mba, P. Cooper, A. Montgomery, D. Owen, An experimental\ninvestigation into the capabilities of Acoustic Emission for the detection of\nshaft-to-seal rubbing in large power generation turbines, Journal of\nEngineering Tribology, Proc. Instn Mech. Engrs, Part J. 220(J7), 607 – 615,\n2006.\n5. M. Leahy, D. Mba, Detecting shaft-to-seal rubbing in power generation\nturbines with the Acoustic Emission technology, Journal of Vibration and\nAcoustics, ASME, Volume 128, Issue 6, 798-800, 2006.\n6. Mba, D., Cooke, A., Roby, D., Hewitt, G., (2004) “Detection of shaft-seal\nrubbing in large-scale power generation turbines with Acoustic Emissions;\nCase study”, Journal of Power and Energy - Part A, I Mech E, Vol. 218, No. 2,\npp. 71-82.\n7. Hall L. D., and Mba, D., Acoustic emissions diagnosis of rotor-stator rubs\nusing the KS statistic, Mechanical Systems and Signal Processing, Volume 18,\nIssue 4, Pages 849-868, 2004.\n8. Wang, Q. and Chu, F., Experimental determination of the rubbing location by\nmeans of acoustic emission and wavelet transform, Journal of Sound and\nVibration, vol. 248, no. 1, pages 91-103, 2001.\n9. M. Leahy, D. Mba, P. Cooper, A. Montgomery, D. Owen, Acoustic Emission\ntechnology for detection of shaft-to-seal rubbing on power generation\nturbines; a qualitative verification., INSIGHT, Vol. 48, no. 12, 754-755, Dec\n2006.\n10. Al Shaikh Mubarak, M., Mba, D., Cooper, P., Opportunities offered by\nacoustic emission for seal and blade rub detection on large scale power\ngeneration turbines. 16th International congress on Condition monitoring and\nDiagnostic engineering management (COMADEM'2003) Vaxjo, Sweden,\nAugust 27th – 29th 2003, p 513, ISBN 91-7636-376-7.\n11. Journal-bearing Databook, Journal-bearing data book \/ editor Tsuneo Someya;\nwith contributions by T. Someya, J. Mitsui, J. Esaki... [et. al.]. Berlin:\nSpringer-Verlag, 1989. ISBN: 978-3540170747. Springer-Verlag Berlin and\nHeidelberg GmbH & Co. K (October 1989).\n12. Balerston, H. L., The detection of incipient failure in bearings, Materials\nEvaluation, Vol 27, 121-128, 1969.\n13. Rogers, L. M., The application of vibration analysis and acoustic emission\nsource location to on-line condition monitoring of anti-friction bearings.\nTribology International, 1979; 51-59.\n14. Yoshioka T, Fujiwara T. New acoustic emission source locating system for the\nstudy of rolling contact fatigue, Wear, 81(1), 183-186.\n15. Holroyd, T.J. and Randall, N., (1993), Use of Acoustic Emission for Machine\nCondition Monitoring, British Journal of Non-Destructive Testing, 1993,\n35(2), 75-78.\n16. Saad Al-Dossary, R.I. Raja Hamzah, D. Mba, Observations of changes in\nacoustic emission waveform for varying seeded defect sizes in a rolling\nelement bearing, Journal of Applied Acoustics, Vol. 70, No. 1, Jan 2009, p 58\n– 81, ISSN 0003-682X\n17. R.I. Raja Hamzah, D. Mba, , THE INFLUENCE OF OPERATING\nCONDITION ON ACOUSTIC EMISSION (AE) GENERATION DURING\nMESHING OF HELICAL AND SPUR GEAR, Tribology International, Vol.\n42, Iss. 1, 3-14, 2009\n18. M. Elforjani, D. Mba, Natural mechanical degradation measurements in slow\nspeed bearings, Engineering Failure Analysis, Volume 16, Issue 1, January\n2009, Pages 521-532.\n19. Babak Eftekharnejad, D. Mba, ACOUSTIC EMISSION SIGNALS\nASSOCIATED WITH DAMAGED HELICAL GEARS, INSIGHT, Volume:\n50, Issue: 8, 450-453, Aug 2008.\n20. R.I. Raja Hamzah, D.Mba, ACOUSTIC EMISSION AND SPECIFIC FILM\n7+,&.1(66\u0003\u000bȜ\f\u0003)25\u00036385\u0003*($56\u000f\u0003,16,*+7\u000f\u00039RO\u0011\u0003\u0018\u0013\u000f\u00031R\u0011\u0003\u0014\u0014\u000f\u0003\u0019\u0017\u0015\u0010\u0019\u0017\u0016\u000f\u0003\nNov 2008\n21. J. Couturier, D. Mba, operational bearing parameters and acoustic emission\ngeneration, Journal of Vibration and Acoustics, ASME, Vol 130, 024502,\nApril 2008.\n22. M. Elforjani, D. Mba, Monitoring the onset and propagation of natural\ndegradation process in a slow speed rolling element bearing with Acoustic\nEmissions, ASME, Journal of Vibration and Acoustics, 130, 041013 (2008).\n23. J.Z. Sikorska and D. Mba, Truth, Lies acoustic emission and process machines,\nJournal of Mechanical Process Engineering, Part E, IMechE, Volume 222,\nNumber 1, 1-19, 2008.\n24. Holroyd, T. Condition monitoring of very slowly rotating machinery using AE\ntechniques. 14th International congress on Condition monitoring and\nDiagnostic engineering management (COMADEM'2001), Manchester, UK, 4-\n6 September 2001, 29, ISBN 0080440363.\n25. Bagnoli, S., Capitani, R. and Citti, P. Comparison of accelerometer and\nacoustic emission signals as diagnostic tools in assessing bearing. Proceedings\nof 2nd International Conference on Condition Monitoring, London, UK, May\n1988, 117-125.\n26. Tandon, N. and Nakra, B.C, Defect Detection of Rolling Element Bearings by\nAcoustic Emission Method, Journal of Acoustic Emission, 1990; 9(1) 25-28.\n27. Choundhury, A. and Tandon, N., Application of acoustic emission technique\nfor the detection of defects in rolling element bearings, Tribology\nInternational, 2000; 33, 39-45.\n28. Tan, C.C. Application of acoustic emission to the detection of bearing failures.\nThe Institution of Engineers Australia, Tribology conference, Brisbane, 3-5\nDecember 1990, 110-114.\n29. Morhain, A, Mba, D, Bearing defect diagnosis and acoustic emission, Journal\nof Engineering Tribology, I Mech E, Vol 217, No. 4, Part J, p 257-272, 2003.\nISSN 1350-6501.\nAPPENDIX A\nTable A1 AE r.m.s and minimum film thickness values\nFilm Thicknesss\nʅm 800 N % 700 N % 600 N % 500 N % 400 N % 300 N %\n4000 rpm 38.81 -0.63 38.95 -0.37 39.05 -0.20 39.17 -0.10 39.31 -0.01 39.46 0.03\n3000 rpm 38.57 0.90 38.81 0.78 38.97 0.59 39.13 0.48 39.30 0.41 39.47 0.28\n2000 rpm 38.91 0.50 39.11 0.35 39.21 0.32 39.32 0.27 39.46 0.21 39.58 0.18\n1000 rpm 39.11 -0.19 39.25 -0.08 39.33 -0.06 39.42 -0.05 39.55 -0.07 39.65 0.03\n500 rpm 39.03 - 39.22 - 39.31 - 39.40 - 39.52 - 39.67 -\nTable A2 Changes in AE r.m.s levels for varying speed and load conditions\nAE r.m.s 800 N % 700 N % 600 N % 500 N % 400 N % 300 N %\n4000 rpm 0.0009 92.89 0.0006 165.32 0.0007 147.48 0.0006 178.42 0.0006 176.73 0.0005 192.01\n3000 rpm 0.0018 315.48 0.0017 324.53 0.0016 341.08 0.0017 311.93 0.0016 308.24 0.0016 318.60\n2000 rpm 0.0074 192.32 0.0070 204.87 0.0073 185.06 0.0069 200.75 0.0067 194.85 0.0065 219.97\n1000 rpm 0.0216 79.20 0.0215 76.94 0.0207 80.49 0.0209 81.97 0.0198 96.09 0.0209 80.20\n500 rpm 0.0387 - 0.0380 - 0.0374 - 0.0379 - 0.0389 - 0.0377 -\nTable A3 Relative percentage changes in AE r.m.s and total power loss\n% Total KW Total KW % AE r.ms AE r.ms %\n500 rpm 0.159 - 0.001 -\n1000 rpm 0.298 87 0.002 152\n2000 rpm 0.795 166 0.007 319\n3000 rpm 1.451 82 0.021 199\n4000 rpm 1.861 28 0.038 82\n"}