{"doi":"10.1103\/PhysRevLett.85.4831","coreId":"68626","oai":"oai:eprints.lancs.ac.uk:31908","identifiers":["oai:eprints.lancs.ac.uk:31908","10.1103\/PhysRevLett.85.4831"],"title":"Reversible transitions between synchronization states of the crdiorespiratory system.","authors":["Stefanovska, Aneta","Haken, H.","McClintock, Peter V. E.","Hozic, M.","Bajrovic, F.","Ribaric, S."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2000","abstract":"Phase synchronization between cardiac and respiratory oscillations is investigated during anesthesia in rats. Synchrograms and time evolution of synchronization indices are used to show that the system passes reversibly through a sequence of different phase-synchronized states as the anesthesia level changes, indicating that it can undergo phase transitionlike phenomena. It appears that the synchronization state may be used to characterize the depth of anesthesia","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/68626.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/31908\/1\/PRL2000RatSynch.pdf","pdfHashValue":"532b73866c6aaeb8a26e5264c3adde0dc096c996","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:31908<\/identifier><datestamp>\n      2018-01-24T02:57:14Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Reversible transitions between synchronization states of the crdiorespiratory system.<\/dc:title><dc:creator>\n        Stefanovska, Aneta<\/dc:creator><dc:creator>\n        Haken, H.<\/dc:creator><dc:creator>\n        McClintock, Peter V. E.<\/dc:creator><dc:creator>\n        Hozic, M.<\/dc:creator><dc:creator>\n        Bajrovic, F.<\/dc:creator><dc:creator>\n        Ribaric, S.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        Phase synchronization between cardiac and respiratory oscillations is investigated during anesthesia in rats. Synchrograms and time evolution of synchronization indices are used to show that the system passes reversibly through a sequence of different phase-synchronized states as the anesthesia level changes, indicating that it can undergo phase transitionlike phenomena. It appears that the synchronization state may be used to characterize the depth of anesthesia.<\/dc:description><dc:date>\n        2000<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/31908\/1\/PRL2000RatSynch.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1103\/PhysRevLett.85.4831<\/dc:relation><dc:identifier>\n        Stefanovska, Aneta and Haken, H. and McClintock, Peter V. E. and Hozic, M. and Bajrovic, F. and Ribaric, S. (2000) Reversible transitions between synchronization states of the crdiorespiratory system. Physical Review Letters, 85 (22). pp. 4831-4834. ISSN 1079-7114<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/31908\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1103\/PhysRevLett.85.4831","http:\/\/eprints.lancs.ac.uk\/31908\/"],"year":2000,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"VOLUME 85, NUMBER 22 P H Y S I C A L R E V I E W L E T T E R S 27 NOVEMBER 2000Reversible Transitions between Synchronization States of the Cardiorespiratory System\nA. Stefanovska,1 H. Haken,2 P. V. E. McClintock,3 M. Hožicˇ,1 F. Bajrovic´,4 and S. Ribaricˇ4\n1Group of Nonlinear Dynamics and Synergetics, Faculty of Electrical Engineering, University of Ljubljana, Tržasˇka 25,\n1000 Ljubljana, Slovenia\n2Center of Synergetics, Institute of Theoretical Physics 1, University of Stuttgart, Pfaffenwaldring 57, 70550 Stuttgart, Germany\n3Department of Physics, University of Lancaster, Lancaster LA1 4YB, United Kingdom\n4Institute of Pathophysiology, Faculty of Medicine, University of Ljubljana, Zalosˇka 4, 1000 Ljubljana, Slovenia\n(Received 30 June 2000)\nPhase synchronization between cardiac and respiratory oscillations is investigated during anesthesia in\nrats. Synchrograms and time evolution of synchronization indices are used to show that the system passes\nreversibly through a sequence of different phase-synchronized states as the anesthesia level changes,\nindicating that it can undergo phase transitionlike phenomena. It appears that the synchronization state\nmay be used to characterize the depth of anesthesia.\nPACS numbers: 87.19.Hh, 05.45.Tp, 05.45.Xt, 87.19.UvWhenever two or more oscillatory processes are weakly\ncoupled, there exists the possibility of their becoming syn-\nchronized. It is a scenario that is ubiquitous in nature,\nincluding living systems where rhythmic processes take\nplace on widely differing time scales, ranging from mil-\nliseconds for single cell activity up to years for ecological\nchanges.\nLiving systems are becoming increasingly accessible to\nmathematical modeling using the methods of dynamical\nsystems theory. However, they are inherently nonstation-\nary, being characterized by many oscillatory processes\nwhose frequencies also change in time. The fact that\nthey are quasiperiodic (with several characteristic frequen-\ncies) and nonstationary makes them difficult to study since,\nstrictly, most of the methods for linear and nonlinear time\nseries analysis require stationarity. The recently proposed\nconcept of phase-synchronization analysis of noisy nonsta-\ntionary bivariate data [1,2] provides a promising method\nfor reconstructing their dynamics.\nIn this Letter we use the concept of synchronization to\nanalyze interactions between cardiac and respiratory os-\ncillations during general anesthesia in rats. Under resting\nconditions, the cardiovascular-respiratory system has been\nshown to be characterized by oscillatory processes on mul-\ntiple time scales in both humans [3] and rats [4]. It has\nlong been recognized that heart and respiratory activity in-\nteract, leading, e.g., to frequency modulation of the heart\nrate by respiration, known as respiratory arrhythmia [5].\nThe adjustment of the rhythms of the two oscillators may\nbe expected to give rise to synchronization.\nEarly studies of the dynamics of coordinated activity\nbetween the respiratory and cardiovascular systems [6,7]\nassumed they behaved as almost periodic oscillators. His-\ntograms of ratios of their periods were analyzed and, for\nexample, an n:1 synchronization between the cardiac and\nrespiratory rhythms was found in healthy subjects during\nsleep [7]. Entrainment was also found to occur in anes-\nthetized rabbits [6] and humans [8]. It was proposed that\nsynchronization (or, as named, frequency and phase co-0031-9007\u000200\u000285(22)\u00024831(4)$15.00ordination) establishes a system of economical coaction\nand thus favors the functional economy of the organism\n[7]. In another study, however, only weak coupling be-\ntween cardiac and respiratory rhythms was found and it\nwas concluded that the two rhythms are generally not phase\nlocked [9].\nThe development of nonlinear methods has brought new\nattention to this problem [10]. Recently, using the concept\nof synchronization analysis in chaotic, noisy, and nonsta-\ntionary oscillators, episodes of phase synchronization be-\ntween cardiac and respiratory oscillations were observed\nin resting humans [11]. Cardiorespiratory synchronization\nduring paced respiration [12] and heart synchronization to\nexternal stimuli [13] were also demonstrated. It appears\nthat the degree of synchronization at rest differs in athletes\n(synchronization periods \u00011000 s [11]) and nonathletes\n(\u0001100 s [14]), and is inversely related to the extent of fre-\nquency modulation of the heart rate. Therefore, we may\nexpect that a better understanding of phase and frequency\nrelations among the oscillatory processes involved in blood\ncirculation may lead to deeper insight into the state of the\nsystem, with corresponding diagnostic possibilities.\nHere we investigate phase synchronization during the\nstate of anesthesia in rats, which in practice can be studied\nunder more precisely controlled conditions than are usu-\nally possible for humans. It has been shown that the dy-\nnamics of the cardiovascular-respiratory system in rats [4]\npossesses similar features to those observed in humans,\ndespite the cardiac and respiratory rhythms in rats being\napproximately 4 times faster than in humans. Moreover,\nduring anesthesia in rats, respiration need not be assisted.\nThis is an important point, as paced respiration has already\nbeen shown to influence the state of cardiorespiratory syn-\nchronization [12].\nThe electric activity of the heart (EKG) and excursions\nof the thorax, which are proportional to respiratory activ-\nity [15], were noninvasively recorded (Fig. 1) while the\nbreathing remained spontaneous and unassisted. Using a\n16 bit A\u0002D converter, each time series was digitized at© 2000 The American Physical Society 4831\nVOLUME 85, NUMBER 22 P H Y S I C A L R E V I E W L E T T E R S 27 NOVEMBER 2000−5\n0\n5 Respiration\n0 1 2 3 4 5\n0\n1\nEKG\nFIG. 1. Extracts from typical respiratory and EKG signals\nrecorded from a rat in anesthesia. The y axes are in arbitrary\nunits.\na sampling rate of 2000 Hz and recorded over the en-\ntire duration of anesthesia \u0003\u0001120 min\u0004. Recording started\n5–10 min after anesthetic drugs [16] were injected and\nended 5–10 min after the first signs of recovered reflex re-\nsponses, detected by a skin pinch test [17], were observed.\nFive rats were recorded in the same way. On each ani-\nmal the recording was repeated after one week, using the\nsame anesthetics and concentrations. The synchronization\nanalysis presented below revealed the same pattern in all\nanimals and was well reproduced in the second recording\nin each case.\nThe instantaneous cardiac, fh, and respiratory, fr , fre-\nquencies and their ratio were first calculated. To calculate\nthe instantaneous frequency the marker events method was\nused. The times of R peaks in the EKG signal and maxima\nof inspiration were taken as markers. Peaks were detected\nautomatically and also manually checked. One oscillatory\ncycle was determined as the interval between two consecu-\ntive peaks in each time series, at times tk and tk11. The in-\nstantaneous frequency was taken to be f\u0003t\u0004 \u0001 1tk112tk , and\nset constant within one cycle. In this paper, we use the\nsame method to calculate the relative cyclic phase.\nBoth frequencies were found to undergo dramatic\nchanges during the anesthesia (Fig. 2). During the first\n\u000125 min, fh decreases from 4 to 3.2 Hz; it then increases\nand decreases again and, after \u000170 min, varies randomly\nbetween 3.5 and 4.5 Hz. The fr slowly decreases from 2 to\n\u00010.8 Hz until at \u000140 min, it begins to increase again; it\nreturns to its initial value of 2 Hz at \u000170 min, at which\npoint it becomes highly variable, between 1 and 4 Hz.\nConsequently, fh\u0002fr first increases, from 2 to 5, then de-\ncreases back to 2 (top graph in Fig. 3), and as the effect of\nthe anesthetic drugs vanishes it becomes highly variable,\nspanning a wide amplitude range, between 1 and 4.\nThe instantaneous cyclic relative phase between cardiac\nand respiratory activity was then calculated. This quan-\ntity has been discussed in several recent papers [1,2,11,18]\nbut, briefly, the underlying idea is as follows. Classically,\nsynchronization of two periodic nonidentical oscillators is\nunderstood as an adjustment of their rhythms, or lock-\ning (entrainment) of their phases, wn,m \u0001 nf1 2 mf2 \u0001\nconst, where f1 and f2 are phases (here defined on the\nwhole real line and not on the circle \u00050, 2p\u0006), n and m\nare integers, and wn,m is the generalized phase difference,\nor relative phase. In this simplest case, the condition for\nphase locking is equivalent to the notion of frequency48320 20 40 60 80 100\n3\n3.5\n4\n4.5\nf h\n0 0.1 0.2\n0 20 40 60 80 100\n0\n2\n4\n6\nf r\n0 0.2 0.4\nFIG. 2. Evolution of the instantaneous cardiac and respiratory\nfrequencies during the period of anesthesia. The right-hand\ncolumn shows the corresponding distributions.\nlocking nf1 \u0001 mf2, where f1,2 \u0001 \u0007 \u0002f1,2\b and the brack-\nets mean time averaging. If n periods of the first oscillator\nhave exactly the same duration as m periods of the second\none, the rhythms are n:m entrained.\nRecently, the concept of synchronization was gener-\nalized to chaotic systems [19] and synchronizationlike\n0 20 40 60 80 100\n0\n5\n10\nf h\/\nf r\n0 0.1 0.2\n0 20 40 60 80 100\n2π\n  0\n  πΨ\n1\n0 0.05 0.1\n0 20 40 60 80 100\n0\n0.5\n1\nλ 1\n,2\n0 0.05 0.1\n0 20 40 60 80 100\n0\n0.5\n1\nλ 1\n,3\n0 0.05\n0 20 40 60 80 100\n0\n0.5\n1\nλ 1\n,4\n0 0.01 0.02\n0 20 40 60 80 100\n0\n0.5\n1\nλ 1\n,5\n0 0.01 0.02\nTime  (min)\nFIG. 3. Evolution of phase-synchronization measures during\nanesthesia. Top to bottom: frequency ratio, cardiorespiratory\nsynchrogram, and 1:2, 1:3, 1:4 and 1:5 synchronization indices,\nrespectively. Occurrence of 1:n synchronization is demonstrated\nboth by the appearance of n plateaus in C1 and by l1,n ap-\nproaching unity. The reflex responsiveness from the skin pinch\ntest [17] is given at the top.\nVOLUME 85, NUMBER 22 P H Y S I C A L R E V I E W L E T T E R S 27 NOVEMBER 2000phenomena have also been reported in purely stochastic\nsystems, where the noise controls a characteristic time\nscale [20]. For noisy, chaotic systems and\/or systems with\nmodulated natural frequencies a weaker condition of phase\nsynchronization, jwn,mj \u0001 jnf1 2 mf2 2 dj , const,\nwhere d is some (average) phase shift, was introduced\n[1,2]. Accordingly, synchronization is understood as\nthe appearance of peaks in the distribution of cyclic\nrelative phase Cn,m \u0001 wn,m mod2p and interpreted as the\nexistence of a preferred stable value of phase difference\nbetween two oscillators. In such a case, the n:m phase\nlocking is manifested as a time variation of Cn,m around\na horizontal plateau.\nIn analyzing synchronization, the integers n and m\nshould both be determined. In the case of two interacting\nnoisy oscillatory processes, n and m change in time. One\npossibility (similar to an earlier proposed method of en-\ntrainment analysis [6]), known as the phase stroboscope, or\nsynchrogram, is to fix the value of m and observe changes\nof n in time [11]. Accordingly, the cardiorespiratory syn-\nchrogram is constructed by plotting the normalized rela-\ntive phase of a heartbeat within m respiratory cycles,\nCm \u0001\n1\n2p \u0003fr\u0003tk\u0004 mod2pm\u0004, where tk is the time of kth\nheartbeat and fr is the instantaneous phase of respiration.\nHere we focus on phase synchronization for m \u0001 1\nsince, for most of the time, an integer value of the in-\nstantaneous frequency ratio was observed. We calculated\nthe normalized relative phase, C1, directly from the mea-\nsured data, exploiting the fact that both signals contain\nsharp peaks that clearly mark the instantaneous cycles (see\nFig. 1). Each successive peak was marked as an equiva-\nlence of one oscillatory cycle, corresponding to which a\n2p increment was added. The instantaneous phase is then\nf\u0003t\u0004 \u0001 2p\nt 2 tk\ntk11 2 tk\n1 2pk, tk # t , tk11 , (1)\nwhere tk is time of kth marker event. Defined in this way\nthe phase is a monotonically increasing piecewise-linear\nfunction of time defined on the real line.\nUsually, the first step in searching an n:m locking is\nto look for horizontal plateaus in C1, revealing the value\nof n in cases when synchronization exists. The distribu-\ntion of Cn,m\u0003t\u0004 is then a d function, smeared in the pres-\nence of noise. For strongly nonlinear oscillators it can be\nnonuniform even in the absence of noise [2]. To charac-\nterize the strength of synchronization we therefore need a\nrobust quantitative measure. Since in noisy systems phase\nsynchronization can be understood in a statistical sense as\nthe existence of preferred values of generalized phase dif-\nference, measures based on quantifying the distribution of\nphases\nh \u0001 f2 mod2pnjf1 mod2pm\u0001u (2)\nwere proposed. We will use an index based on conditional\nprobability which was introduced in [18] and was shown\nto facilitate reliable detection of synchronous epochs of\ndifferent order n:m [21]. Accordingly, the phase of thesecond oscillator is observed at fixed values of the phase\nof the first oscillator, u. The interval of each phase f1 and\nf2, \u00050, 2pm\u0006 and \u00050, 2pn\u0006, respectively, is divided into N\nbins. The values of f1 mod2pm that belong to bin l are\ndenoted as ul , while the number of points inside this bin\nis denoted as Ml , and, by using Eq. (2), Ml values of hj,l ,\nj \u0001 1, . . . ,Ml , are calculated.\nIf there is no synchronization between the oscillators, a\nuniform distribution of hj,l can be expected on the interval\n\u00050, 2pn\u0006, or else it clusters around a certain value result-\ning in a unimodal distribution. Hence, the distribution is\nquantified as rl\u0003tk\u0004 \u0001\n1\nMl \u0003tk\u0004\nPMl \u0003tk\u0004\ni\u00011 eif2\u0003tj\u0004 for each j when\nf1\u0003tj\u0004 belongs to the lth bin and tk 2 tp\u00022 # tj , tk 1\ntp\u00022. Ml\u0003tk\u0004 is the number of points in this bin at the kth\ninstant. An average over 10 periods, tp , of the slower os-\ncillator was used [18]. Where the phases are completely\nlocked, or completely unlocked we obtain jrl\u0003tk\u0004j \u0001 1 or\njrl\u0003tk\u0004j \u0001 0, respectively.\nTo improve reliability, we also calculate the average over\nall bins and obtain the index of synchronization ln,m\u0003tk\u0004 \u0001\n1\nN\nPN\nl\u00011 jrl\u0003tk\u0004j. Accordingly, ln,m is a measure of the\nconditional probability that f2 has a certain value within\nlth bin when f1 belongs to this bin.\nSome typical results are shown in Fig. 3. The syn-\nchrogram,C1\u0003t\u0004, indicates immediately that several phase-\nsynchronization states occur during anesthesia. This is\nconfirmed by time evolutions of the synchronization in-\ndices, l1,n, which were obtained using a sliding window\nwith tp \u0001 8 s. Three distinct stages during anesthesia may\nbe distinguished from the evolutions of fh\u0002fr , C1, l1,2,\nl1,3, l1,4, and l1,5. Stage 1, 0–40 min from the start of\nrecording, may be defined as the interval during which\nthe frequency ratio increases. Stage 2 of the recording\n(40–70 min) is where the frequency ratio decreases again.\nStage 3 consists of the interval (70–100 min) in which the\nfrequency ratio is hugely variable around a steady value.\nThese same three stages were observed in all recordings,\nwhich lasted between 70 and 130 min (until the rat started\nto run freely).\nDuring stage 1 all four states of synchronization, 1:2,\n1:3, 1:4, and 1:5, are clearly present and gradually switch\none into the other. The 1:2 phase-locked state seems to be\nobserved for as long as a reflex response (tested by skin\npinch test [17]) can still be obtained (depicted at the top\nof the figure). Approximately at the time when the re-\nflex disappears, the transition to 1:3 phase locking starts,\nwhich then changes into 1:4 locking, followed by 1:5 lock-\ning. One possible explanation is that nerve conductivity\ndecreases during this initial state of anesthesia, and this\ncauses changes of the overall nervous control of the car-\ndiorespiratory system, which then results in a series of\nphase-synchronized states.\nAs the effect of the drugs starts to decline, the phase-\nsynchronization states switch back in reverse order. The\nstrength of phase synchronization is slightly weaker on the\nway out of anesthesia than during entry. Shortly before the4833\nVOLUME 85, NUMBER 22 P H Y S I C A L R E V I E W L E T T E R S 27 NOVEMBER 2000end of anesthesia (stage 3), phase synchronization becomes\nvery weak.\nIn conclusion, we have shown that the cardiac and res-\npiratory systems possess dynamical properties and cou-\nplings that can synchronize their oscillations in a hierarchy\nof different phase-locked states. Kinetic phase transition\nphenomena between these states are reminiscent of those\nseen and analyzed in detail for physical systems such as\nlasers [22]. During the course of anesthesia, the transi-\ntions are found to occur in a reproducible sequence, sug-\ngesting that the state of synchronization may provide a\npotentially useful measure of the depth of anesthesia at\nany moment. Given the similarities in cardiorespiratory\ndynamics, in fh\u0002fr , and in other characteristic frequency\nratios for humans and rats [3,4], it seems plausible that\nsimilar results may also apply to humans.\nThis study was supported by the Slovenian Ministry of\nScience and Technology, and the Slovenian-German Sci-\nentific-Research Project Collaboration. A. S. was partially\nsupported by the Royal Society of London. We thank P. A.\nTass for valuable comments on the manuscript.\n[1] A. S. Pikovsky, M. G. Rosenblum, and J. Kurths, Europhys.\nLett. 34, 165 (1996); M. G. Rosenblum, A. S. Pikovsky,\nand J. Kurths, Phys. Rev. Lett. 76, 1804 (1996); M. G.\nRosenblum, A. S. Pikovsky, and J. Kurths, ibid. 78, 4193\n(1997); A. S. Pikovsky, M. G. Rosenblum, G. V. Osipov,\nand J. Kurths, Physica (Amsterdam) 104D, 219 (1997).\n[2] M. G. Rosenblum, A. S. Pikovsky, C. Schäfer, P. Tass, and\nJ. Kurths, in Handbook of Biological Physics, edited by\nS. Gielen and F. Moss [Elsevier Science, New York (to be\npublished)].\n[3] P. Ch. Ivanov, L. A. N. Amaral, A. L. Goldberger, S. Havlin,\nM. G. Rosenblum, Z. Struzik, and H. E. Stanley, Nature\n(London) 399, 461 (1999); A. Stefanovska and M. Bracˇicˇ,\nContemp. Phys. 40, 31 (1999); M. Bracˇicˇ, P. V. E. Mc-\nClintock, and A. Stefanovska, in Stochastic and Chaotic\nDynamics in the Lakes, edited by D. S. Broomhead, E. A.\nLuchinskaya, P. V. E. McClintock, and T. Mullin (AIP, New\nYork, 2000), pp. 146–153.\n[4] F. Bajrovic´, M. ˇCencˇur, M. Hožicˇ, S. Ribaricˇ, and A. Ste-\nfanovska, Eur. J. Phys. 439, R158 (2000).\n[5] S. Hales, Statistical Essays II, Haemastatisticks (Innings\nManby, London, 1773); C. Ludwig, Arch. Anat. Phys. 13,\n242 (1847); C. T. M. Davies and J. M. M. Neilson, J. Appl.\nPhys. 22, 947 (1967); J. A. Hirsch and B. Bishop, Am. J.\nPhys. 241, H620 (1981).\n[6] H. Passenhofer and T. Kenner, Pflügers Archiv. 355, 77\n(1975); T. Kenner, H. Passenhofer, and G. Schwaberger,\nibid. 363, 263 (1976).\n[7] G. Hildebrandt, in Temporal Disorder in Human Oscil-\nlatory System, edited by L. Rensing, U. an der Heiden,\nand M. C. Mackey (Springer, Berlin, 1987), pp. 160–174;\nF. Raschke, ibid., pp. 152–158; F. Raschke, in Rhythms4834in Physiological Systems, edited by H. Haken and H. P.\nKoepchen (Springer, Berlin, 1991), pp. 155–164.\n[8] D. C. Galletly and P. D. Larsen, Br. J. Anaesth. 79, 35\n(1997).\n[9] M. C. Mackey and L. Glass, From Clocks to Chaos: The\nRhythms of Life (Princeton University, Princeton, NJ,\n1988).\n[10] D. Hoyer, O. Hader, and U. Zwiener, IEEE Eng. Med. Biol.\n16, 97 (1997); M. Schiek, F. R. Drepper, R. Engbert, H.-H.\nAbel, and K. Suder, in Nonlinear Analysis of Physiological\nData, edited by H. Kantz, J. Kurths, and G. Mayer-Kress\n(Springer, Berlin, 1998), pp. 191–209.\n[11] C. Schäfer, M. G. Rosenblum, J. Kurths, and H. H. Abel,\nNature (London) 293, 239 (1998); C. Schäfer, M. G.\nRosenblum, H. H. Abel, and J. Kurths, Phys. Rev. E 60,\n857 (1999).\n[12] H. Seidel and H. P. Herzel, IEEE Eng. Med. Biol. 17, 54\n(1998).\n[13] V. S. Anishchenko, A. G. Balanov, N. B. Janson, N. B. Igo-\nsheva, and G. V. Bordyugov, in Stochastic and Chaotic\nDynamics in the Lakes, edited by D. S. Broomhead, E. A.\nLuchinskaya, P. V. E. McClintock, and T. Mullin (AIP, New\nYork, 2000), pp. 162–167.\n[14] M. Bracˇicˇ Lotricˇ and A. Stefanovska, Physica (Amsterdam)\n283A, 451 (2000).\n[15] A piezoelectric sensor was inserted into a rigid strap which\nwas wrapped around the thorax.\n[16] Experiments were performed on adult male Wistar\nrats under general anesthesia with ketaminhydrochlorid\n100 mg\u0002kg b.w. and xylazinhydrochorid 20 mg\u0002kg b.w.,\nadministered in a bolus, intraperitoneally. During the\nrecording the animal was placed on a homeothermic\noperating table that enabled the body temperature to be\nkept constant at 37 ±C.\n[17] The depth of anesthesia was assessed at 5-min intervals,\nstarting from the moment at which the drugs were applied,\nby the animal’s response to touch and to painful stimulus\nwith the skin pinch test. The plantar surface of the animal’s\nhind paws was stroked with the tip of a pair of tweezers\n(touch stimulus) or pinched (pain stimulus). The tests were\nconsidered positive if the animal responded by flexing its\nfingers or withdrawing its limb and were not perturbative\nto any of the quantities analyzed (see Figs. 2 and 3).\n[18] P. Tass, M. G. Rosenblum, J. Weule, J. Kurths, A. S.\nPikovsky, J. Volkmann, A. Schnitzler, and H.-J. Freund,\nPhys. Rev. Lett. 81, 3291 (1998).\n[19] L. M. Pecora and T. L. Carroll, Phys. Rev. Lett. 64, 821\n(1990); L. Kocarev and U. Parlitz, ibid. 74, 5028 (1995);\nN. F. Rulkov, M. M. Sushchik, L. S. Tsimring, and H. D. I.\nAbarbanel, Phys. Rev. E 51, 980 (1995).\n[20] A. Neiman, Phys. Rev. E 49, 3484 (1994); B. Shulgin,\nA. Neiman, and V. Anishchenko, Phys. Rev. Lett. 75,\n4157 (1995); A. Longtin and D. R. Chialvo, ibid. 81, 4012\n(1998).\n[21] R. Mrowka, A. Patzak, and M. Rosenblum, Int. J. Bifurca-\ntion Chaos Appl. Sci. Eng. (to be published).\n[22] H. Haken, Laser Theory (Springer, Berlin, 1970);\nH. Haken, Synergetics, An Introduction (Springer, Berlin,\n1983).\n"}