{"doi":"10.1111\/j.1934-6093.2003.tb00097.x","coreId":"55129","oai":"oai:eprints.lincoln.ac.uk:2229","identifiers":["oai:eprints.lincoln.ac.uk:2229","10.1111\/j.1934-6093.2003.tb00097.x"],"title":"Torque maximisation of the PMAC motor for high performance, low inertia operation","authors":["Stewart, Paul"],"enrichments":{"references":[{"id":18445687,"title":"A Systematic Approach to Selecting Optimal Flux References in Induction Motors,”","authors":[],"date":"1995","doi":"10.1109\/87.481963","raw":"Bodson, M., J. Chiasson, and R.T. Novotnak, “A Systematic Approach to Selecting Optimal Flux References in Induction Motors,” IEEE Trans. Contr. Syst. Technol., Vol. 3, No. 4, pp. 388-397 (1995).","cites":null},{"id":18445689,"title":"Brushless Permanent Magnet and Reluctance Motor Drives,”","authors":[],"date":"1993","doi":"10.1049\/pe:19900006","raw":"Miller, T.J.E., “Brushless Permanent Magnet and Reluctance Motor Drives,” University Press, Oxford (1993).","cites":null},{"id":18445696,"title":"Control of Electrical Drives,","authors":[],"date":"1996","doi":"10.1007\/978-3-642-97646-9","raw":"Leonhard,  W.,  Control of Electrical Drives, Springer Verlag, Berlin, 2 rd Ed. (1996).","cites":null},{"id":18445693,"title":"Dynamic Control of Permanent Magnet Synchronous Motors in Automotive Drive Applications,”","authors":[],"date":"1999","doi":"10.1109\/acc.1999.786116","raw":"Stewart, P. and V. Kadirkamanathan, “Dynamic Control of Permanent Magnet Synchronous Motors in Automotive Drive Applications,” Proc. IEEE Ame. Contr. Conf., San Diego, USA, pp. 1677-1681 (1999).","cites":null},{"id":18445691,"title":"Electrical Machines and Drives,","authors":[],"date":"1985","doi":"10.1016\/b978-0-08-031685-7.50012-3","raw":"Hindmarsh, J., Electrical Machines and Drives, Pergamon Press Ltd., Oxford, U.K. (1985).","cites":null},{"id":18445686,"title":"Field-weakening Operation of Cylindrical Permanent Magnet Motors,”","authors":[],"date":"1996","doi":"10.1109\/cca.1996.558980","raw":"Shi, J. and Y.-S. Lu, “Field-weakening Operation of Cylindrical Permanent Magnet Motors,” Proc. IEEE Conf. Contr. Appl., Dearborn, MI, pp. 864-869 (1996).","cites":null},{"id":18445694,"title":"Highspeed Parameter Estimation of Stepper Motors,”","authors":[],"date":"1993","doi":"10.1109\/87.260272","raw":"Blauch, A., M. Bodson, and J. Chiasson, “Highspeed Parameter Estimation of Stepper Motors,” IEEE Trans. Contr. Syst. Technol., Vol. 1, pp. 270-279 (1993).","cites":null},{"id":18445690,"title":"Modelling, Simulation, and Analysis of Permanent Magnet Motor Drives, Part 1: The Permanent Magnet Synchronous Motor Drive,”","authors":[],"date":"1989","doi":"10.1109\/28.25541","raw":"Pillay, P. and R. Krishnan, “Modelling, Simulation, and Analysis of Permanent Magnet Motor Drives, Part 1: The Permanent Magnet Synchronous Motor Drive,” IEEE Trans. Ind. Appl., Vol. 25, No. 2, pp. 265-273 (1989).","cites":null},{"id":18445695,"title":"Power Electronics and Variable Speed Drives,","authors":[],"date":"1996","doi":"10.1109\/9780470545553","raw":"Bose, B.K., Ed., Power Electronics and Variable Speed Drives, IEEE Press, Piscataway NJ., (chap 6) (1996).","cites":null},{"id":18445692,"title":"Speed Control of Interior Permanent Magnet Synchronous Motor Drive for the Flux-Weakening Operation,”","authors":[],"date":"1997","doi":"10.1109\/28.567075","raw":"Kim, J.M. and S.K. Sul, “Speed Control of Interior Permanent Magnet Synchronous Motor Drive for the Flux-Weakening Operation,” IEEE Trans. Ind. Appl., Vol. 33, No. 1, pp. 43-48 (1997).","cites":null},{"id":18445684,"title":"Torque Maximisation for Permanent Magnet Synchronous Motors,”","authors":[],"date":"1998","doi":"10.1109\/87.726535","raw":"Verl, A., and M. Bodson, “Torque Maximisation for Permanent Magnet Synchronous Motors,” IEEE Trans. Contr. Syst. Technol., Vol. 6, No. 6, pp. 740-744 (1998).","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-05","abstract":"This paper describes the techniques applied to maximise the torque en- velope of the permanent magnet AC (PMAC) motor operating under current and voltage constraints. Standard steady-state descriptions of the system are often suitable for control purposes when the rotor velocity is varying rela- tively slowly. In low inertia applications such as clutchless gearchange opera- tions, where in the pursuit of driveability, the motor is required to accelerate and decelerate its own rotor inertia as quickly as possible. In this case, the voltage drop due to the current dynamics start to become significant. This paper presents a method to reserve voltage headroom dynamically in the field-weakening region in order to maximise the torque envelope when the effective inertia is low. Experimental results show the effectiveness of this approach","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/55129.pdf","fullTextIdentifier":"http:\/\/eprints.lincoln.ac.uk\/2229\/1\/AJC.pdf","pdfHashValue":"04e975af0c55af1d3c7d416a30b6f98304281b66","publisher":"http:\/\/www.interscience.wiley.com\/ Chinese Automatic Control Society","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lincoln.ac.uk:2229<\/identifier><datestamp>\n      2013-03-13T08:35:18Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F48:6A6163735F48363630<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F48:6A6163735F48333630<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lincoln.ac.uk\/2229\/<\/dc:relation><dc:title>\n        Torque maximisation of the PMAC motor for high performance, low inertia operation<\/dc:title><dc:creator>\n        Stewart, Paul<\/dc:creator><dc:subject>\n        H660 Control Systems<\/dc:subject><dc:subject>\n        H360 Electromechanical Engineering<\/dc:subject><dc:description>\n        This paper describes the techniques applied to maximise the torque en- velope of the permanent magnet AC (PMAC) motor operating under current and voltage constraints. Standard steady-state descriptions of the system are often suitable for control purposes when the rotor velocity is varying rela- tively slowly. In low inertia applications such as clutchless gearchange opera- tions, where in the pursuit of driveability, the motor is required to accelerate and decelerate its own rotor inertia as quickly as possible. In this case, the voltage drop due to the current dynamics start to become significant. This paper presents a method to reserve voltage headroom dynamically in the field-weakening region in order to maximise the torque envelope when the effective inertia is low. Experimental results show the effectiveness of this approach.<\/dc:description><dc:publisher>\n        http:\/\/www.interscience.wiley.com\/ Chinese Automatic Control Society<\/dc:publisher><dc:date>\n        2003-05<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/2229\/1\/AJC.pdf<\/dc:identifier><dc:identifier>\n          Stewart, Paul  (2003) Torque maximisation of the PMAC motor for high performance, low inertia operation.  Asian Journal of Control, 5  (1).   pp. 58-64.  ISSN 1561-8625  <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1111\/j.1934-6093.2003.tb00097.x<\/dc:relation><dc:relation>\n        10.1111\/j.1934-6093.2003.tb00097.x<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lincoln.ac.uk\/2229\/","http:\/\/dx.doi.org\/10.1111\/j.1934-6093.2003.tb00097.x","10.1111\/j.1934-6093.2003.tb00097.x"],"year":2003,"topics":["H660 Control Systems","H360 Electromechanical Engineering"],"subject":["Article","PeerReviewed"],"fullText":" Asian Journal of Control, Vol. 5, No. 1, pp. 58-64, March 2003  58 \nTORQUE MAXIMISATION OF THE PMAC MOTOR FOR HIGH  \nPERFORMANCE, LOW INERTIA OPERATION \n \nPaul Stewart \n \nABSTRACT \n \nThis paper describes the techniques applied to maximise the torque en-\nvelope of the permanent magnet AC (PMAC) motor operating under current \nand voltage constraints. Standard steady-state descriptions of the system are \noften suitable for control purposes when the rotor velocity is varying rela-\ntively slowly. In low inertia applications such as clutchless gearchange opera-\ntions, where in the pursuit of driveability, the motor is required to accelerate \nand decelerate its own rotor inertia as quickly as possible. In this case, the \nvoltage drop due to the current dynamics start to become significant. This \npaper presents a method to reserve voltage headroom dynamically in the \nfield-weakening region in order to maximise the torque envelope when the \neffective inertia is low. Experimental results show the effectiveness of this \napproach. \n \nKeyWords: Permanent magnet AC synchronous motor, model reference, \nfield weakening, torque control. \n \n \nI. INTRODUCTION \n \nTorque maximisation for smooth rotor (surface \nmounted magnets) permanent magnet machines has been \naddressed [1] using steady-state (i.e. constant rotor ve-\nlocity) system description with the aim of yielding \nsmaller motors for given applications, or faster operation \nfor a given size of motor. The major control problem \nwhen considering both steady state and dynamic opera-\ntion of the PMAC motor can be seen to be the finite \nvoltage and current supply available from the DC link \nand the inverter. In order to maximise the torque enve-\nlope, it is necessary to apply field-weakening (advancing \nthe phase of the current vector to suppress the motor \nEMF) techniques which are derived assuming that rotor \nvelocity is constant. The assumption is made that the \nrotor velocity varies slowly enough so that the steady \nstate assumptions are valid [2]. The problem has also \nbeen addressed in [3], however since the approach is \ngeometrical, stator resistance is neglected. The PMAC \nmotor will be analysed in the d-q synchronous reference \nframe which is obtained via a non linear transform. It \nwill be shown that as the machine’s rotor accelerates, the \nrising value of back EMF restricts the magnitude of \ntorque producing current until further torque production \nis not possible. Field-weakening control [10] will be \nimplemented in such a manner which makes possible a \ncontroller which effectively increases the useful speed \nrange of the motor, and also takes account of the voltage \ndrop due to the current dynamics and phase resistance \nwhen operating as a low inertia, high performance drive. \n \nII. THE CONSTRAINED SYSTEM  \nDESCRIPTION \n \nIn the d-q model of the PMAC motor, the stator \ncurrents are transformed into an orthogonal frame of \nreference which is moving synchronously with the rotor \nflux. The orthogonal reference frame is derived from the \nphase currents via the nonlinear transform [5-7] \n2 2cos( ) cos( ) cos( )\n2 3 3\n2 23 sin( ) sin( ) sin( )\n3 3\na\nq\nb\nd\nc\nV\nV\nV\nV\nV\nπ πθ θ θ\nπ πθ θ θ\n   \n− +    \n=       \n− +     \n (1) \nwhere Vd, Vq are the d and q axis voltages, Va, b, c are the \nthree phase elements and id, iq are the d and q axis cur-\nrents. Which gives the system voltage drops in the syn-\nchronous frame \nManuscript received March 5, 2001; revised December 18,\n2001; accepted January 7, 2002. \nP. Stewart is with the Department of Electronic and Electri-\ncal Engineering, University of Sheffield, Mappin Street, Shef-\nfield S1 3JD, United Kingdom. \n P. Stewart: Torque Maximisation of the PMAC Motor for High Performance, Low Inertia Operation 59 \nq\nq q d\ndi\nV r i L i k L\ndt\nω ω\n \n= + + +     (2) \nd\nd d q\ndiV r i L i L\ndt\nω\n \n= − +     (3) \nWhere r is the phase resistance, ω is the rotor velocity, L \nthe phase inductance and k the back EMF constant in the \nreference frame as volts\/radians\/second. Electrical torque \ndeveloped by the motor is proportional to the q-axis cur-\nrent Te = ktiq where kt is the motor torque constant. This \ntransformation also applies to current and flux linkage \nquantities, and the three phase quantities may be ob-\ntained from the d and q axis variables by application of \nan inversion of the matrix in equation (1). The q-axis \ninductance is equivalent to the armature inductance, and \nthe d-axis inductance is equivalent to the field induc-\ntance. In the case of the surface mount PMAC motor, \nthese quantities are equal. High speed operation of the \nPMAC machine is constrained by the linear proportion-\nality of the back-EMF and inductive voltage drops to \nrotor velocity. The system operates subject to the con-\nstraints (4) on voltage and current, \n2 2 2 2 2 2\ns q d q dV V V I i i≥ + ≥ +  (4) \nwhere Vs is the magnitude of the voltage vector, and I is \nthe magnitude of the current vector. The amount of cur-\nrent that can be supplied by the three phase inverter is \nlimited by the heat dissipation properties of the motor, \nand by the current rating of the inverter. It is also limited \nby the converter DC link voltage, which must overcome \nboth the EMF, and the voltage drops across the synchro-\nnous reactance and resistance. Considering the system \nconstraints, maximum torque-per-amp operation below \nbase speed requires the d-axis current to be controlled to \nzero. Above this boundary, the rising EMF value can be \ncountered by advancing the current vector with respect \nto the rotor (field or flux weakening), and introducing \nnegative d-axis current The requirements of the flux \nweakening controller are to calculate the velocity at \nwhich flux-weakening is to be initiated, and to output \noptimal d-axis and q-axis current commands in steady- \nstate and dynamic operation. \n \nIII. TORQUE MAXIMISATION \n \nIf for the moment, resistance is neglected, then \nfrom equations (2) and (3) the steady-state system be-\ncomes equations (5), (6), and the instantaneous torque Te \nfor the surface mount PMAC motor is given [4] by equa-\ntion (7), where kt is the motor torque constant. \nq dV L i kω ω= +  (5) \nd qV L iω= −  (6) \ne t qT k i=  (7) \nThe current limit is defined by a circular locus de-\nfined by equation (4). Similarly, the DC supply voltage \nlimits the voltage vector to a circular locus with fre- \nquency dependant radius, and different center , 0k\nL\n−    .  \nThe voltage limit locus is derived from the identity in \nequation (4), then in steady-state: \n2 2 2 2 2( )q dV L i k Liω ω ω= + +  (8) \nand; \n2\n2\nq d\nV ki i\nL Lω\n \n= + +    (9) \nAs speed and frequency increase, the current limit locus \nremains fixed, however the radius of the voltage limit \nlocus decreases. Eventually the PWM control saturates \nwhen its duty cycle reaches maximum, and the available \nsinewave voltage from the inverter equals the phase \nvoltage. This operating point is known as ‘base speed’ \nand occurs at the intersection of the q axis, current limit \ncircle, and voltage limit circle. If the rotor velocity in-\ncreases further, the radius of the voltage-limit circle de-\ncreases further, and maximum current is defined by a \ncurrent vector terminating in the intersection of the two \ncircles. \n \n3.1. Model reference control \n \nThe operating principle of the model reference \ncontrol systems is to generate optimal d and q-axis \ncommand values to be tracked by PI controllers [8]. In \nthis particular case, to maximise the torque speed enve-\nlope of the motor in the presence of voltage and current \nconstraints. The model reference controller operates in a \nnumber of modes according to a decision tree (Fig. 1), \nand utilises the system equations to calculate the appro-\npriate command values. Rearranging the system equation \n(2) gives the reference model \n* * *\nq q di V Li kω ω= − −  (10) \nand by substituting equations (10) and (3) into the supply \nvoltage constrained voltage vector \n*2 *2\nq dV V V= +  (11) \nand the expression for instantaneous torque \n* * *3\n2e f q t q\nPT i k iφ= =  (12) \n60 Asian Journal of Control, Vol. 5, No. 1, March 2003 \n \nFig. 1.  Model reference controller decision tree. \n \nyields an expression which describes the torque produc-\ning component of the system in terms of the physical \nparameters, torque constant kt and speed variable ω; \n2 2\n* 2 2 2t\ne t\nk V kT V k k\nL L L\nω\nω ω\n   \n= − = −        (13) \nalso \n2 * 2 * 2( ) ( )d qV Li k Liω ω ω= + −  (14) \nCombining equations (13), (14) yields \n22 2 *\n*2 e\nd\nt\nV k Ti\nL L kω\n    \n= + +            (15) \nwhich describes the frequency dependent voltage vector \nin terms of the current components, and forms the model \nfor calculating the system command outputs for the \nPMAC drive operating modes. The omission of the cur-\nrent dynamics has the fundamental consequence that the \ncomponents which represent the advance of the current \nvector with respect to time are unmodelled, and conse-\nquently a maximum voltage drop of magnitude \n22\nqd didiV L L\ndt dt\n  ∆ = +        (16) \nhas been ignored. It is important to note here that in ap-\nplications where the motor is driving significant loads, \nthen the field-weakening controller based on the steady- \nstate equations is perfectly satisfactory. However in the \ncase of torque maximising field-weakening control with \nthe rotor inertia only, then the current dynamics become \nsignificant. Thus when the PMAC enters the field \nweakening region and the current regulators saturate, no \nspare voltage is available to acommodate the dynamic  \n \nFig. 2. PMAC motor as described by the steady state model reference \nimplementation. \n \nmovement of the current vector, and consequently the \noptimal path for the maximum torque profile cannot be \nfollowed. \n \n3.2 Calculating the dynamic voltage drop \n \nAn equation can be derived to describe the rate of \nchange of the angle of the current vector in the d-q ref-\nerence frame as the rotor accelerates. Ignoring resistive \neffects, we obtain an expression in the steady state which \nrelates the supply voltage to the rotor velocity. \n2 2 2 2 2( )q dV L i k Liω ω ω= + +  (17) \nThe control extension will be designed to reserve suffi-\ncient voltage headroom by dynamic allocation in the \nfield weakening region, avoiding the torque-speed enve-\nlope degradation experienced with the steady state model \nreference controller. This expression in equation 17 is  \ndifferentiated and solved for d\ndt\nσ  where σ is the angle  \nof current vector advance ahead of the q-axis. In order to \nobtain a description of the current vector dynamics, us-\ning \ntd T k Icos\ndt J J\nω σ\n= =  (18) \nwe obtain an expression for the current vector advance \nangle which allows calculation from the system parame-\nters and measured current, assuming that the limits I and \nV are treated as constants; \n P. Stewart: Torque Maximisation of the PMAC Motor for High Performance, Low Inertia Operation 61 \n2 2 2( 2 ( )td k L I LIsin k k\ndt kLJ\nσ σ\nω\n− + +\n=  (19) \nwhich shows the dependancy on the system inertia. The \nderivatives of the d-q currents are given by \nq\nd\ndi di\ndt dt\nσ   \n= −       (20) \nd\nq\ndi di\ndt dt\nσ   \n=        (21) \nand we obtain the voltage drop due to the current vector \nangle dynamics \n2 2 2( 2 ( ) )t s\ns\nk LI L I L I sin k kV\nkL J\nσ\nω\n− + +∆ =  (22) \nwhere ∆V is the dynamic voltage drop. \n \n3.3 Dynamic base speed \n \nUnder dynamic conditions, the onset of field \nweakening will occur at a lower frequency than in the \nsteady state due to the voltage necessary to drive the \ncurrent vector phase dynamics. At this new virtual base \nspeed, which represents the boundary between the con-\nstant torque and constant power regions, the d-axis cur-\nrent is set to zero, and the equation for dynamic voltage \ndrop reduces to \n2 2 2( )tI Lk L I kV\nkJω\n+∆ =  (23) \nAn expression can be derived from the circle diagram \ndescription to link the difference between the magnitudes \nof the voltage-frequency limi circles at dynamic and \nsteady state base speeds, where Vs is the magnitude of \nthe applied voltage. \n2\n2\n2s\nkV V I L\nL\nω∆ = − +  (24) \ncombining equations (1.11, 1.12) gives a quadratic in \nrotor velocity \n2 2 2 2\n2 2\n2\n( )0 ts\nk I Lk L I kL I V\nL kJ\nω ω\n+\n= − + + −  (25) \nThe solution of this equation gives the difference be-\ntween the dynamic and steady state base speed, and the \ndynamic base speed ωd where, \nd oω ω ω= − ∆  (26) \nand, \n2\ns t s\no\ns\nV k IL\nkJ\nω ω\nω\n ∆ =     (27) \n3.4 Implementing the scheme} \n \nIn the steady state model reference controller, the \ncurrent vector I is calculated as extending from (0, 0) in \nthe d-q frame to the intersection of the current limit cir-\ncle and the frequency related voltage limit circle with  \nradius V\nLω\n and center ( , 0)k\nL\n− . The outputs of the ref- \nerence model are the command quantities *qi  and *di  \n(which are changing as the motor accelerates). In order \nto reserve sufficient voltage headroom to allow the cur-\nrent dynamics to act effectively, the length of the voltage  \nlimit vector V\nLω\n must be reduced by an appropriate  \namount. The voltage reserved for this effect has d-axis \nand q-axis components and can be described as being a \nvector extending from the voltage limit vector in the \nreference model. The d-axis and q-axis current com-\nmands are now formulated as the intersection of the dy-\nnamic voltage drop (which augments the steady state \nvoltage limit vector) and the current limit circle. For the \nbenefit of reduced computation in the model reference \ncontroller, the voltage drop due to the dynamics can be \napproximated as a worst case. That is the magnitude of \nthe dynamic voltage drop is calculated and subtracted \nfrom the magnitude of the voltage limit vector, the new \nvoltage limit vector including the dynamic components \nbeing represented as Vl. \nl sV V V= − ∆  (28) \nSimilarly, the unmodelled voltage drop due to resistive \neffects can be included as a worst case effect, and thus \nthe voltage limit vector now contains all the significant \nsystem voltage drops, with any minor unmodelled drops \nbeing lumped together in the worst case adoption of \nvector directions. The voltage limit vector now becomes \nl\nkV V rI\nLω\n= − ∆ −  (29) \nIf this voltage can be reserved in operation, coupled with a \nrevised base speed to enable the reservation process, then \nthe machine should follow the optimal current trajectory \nwith current regulators held just within the bounds of \nsaturation. The geometric implementation in the model \nreference controller is shown in Fig. 3. \n \nIV. RESULTS \n \nSimulation of the model reference controller oper-\nating with an 87kW surface mount traction motor indi- \n62 Asian Journal of Control, Vol. 5, No. 1, March 2003 \n \nFig. 3. PMAC dynamic model reference control geometric implemen-\ntation. \n \n \nFig. 4.  PMAC simulated applied voltage magnitude. \n \ncated the potential for experimental implementation of \nthe torque maximising scheme. Firstly, of interest is the \npredicted voltage magnitude comparison shown in Fig. 4 \nThe controller with the dynamic extension is seen to \noperate at a lower rotor velocity than the controller based \non the steady-state description. Another interesting fea-\nture is that the controller does not saturate in the field \nweakening region, but operates just within saturation, \nthus retaining full control of the current vector. A veloc-\nity profile similar to that in a clutchless gearchanging \noperation was simulated in Fig. 5. The controller with \nthe dynamic extension was found to have an advantage \nof approximately 50ms at the end of the operation, an \namount which in terms of high performance vehicle \ndriveability, is significant. The model reference control-\nler with the dynamic extension reserving voltage head \n \nFig. 5.  Simulated velocity profile comparison. \n \n \nFig. 6. Performance comparisons of the reference model controller \nwith and without the dynamic extension. Rotor only inertial \nload. \n \nroom were implemented on a TI TMS320C5 digital sig-\nnal processing board, controlling a PMAC motor on a \nfour quadrant PWM controlled [11,12] dynamometer. \nDue to the dynamic bandwidth limitations of torque \ntransducers, the instantaneous torque is calculated from \nthe q-axis current. The first experiment is for the motor \nwith just the rotor inertia and no external load. This is \nthe most severe test due to rotor acceleration, and should \nshow the greatest deterioration in torque output. The \nrotor is allowed to accelerate freely from rest under \nmaximum torque demand in order to compare with the \nmaximum torque envelope. The relative performance \ncan be seen in Fig. 6. The optimal torque speed envelope \nis obtained by operating the motor at steady-state points, \nand ascertaining the maximum torque output on a dyna-\nmometer. This is labeled on the graph as max steady \nstate envelope. This is a set of discrete torque measure- \n P. Stewart: Torque Maximisation of the PMAC Motor for High Performance, Low Inertia Operation 63 \n \nFig. 7. Performance comparisons of the model reference controller-\nwith and without the dynamic extension. Rotor and external \nload motor inertial load. \n \nments taken at a range of speeds when all transients have \ndecayed to zero, and represents the maximum torque \nwhich can be produced by the system at any speed. The \nseries labelled steady state controller represents the \nmaximum torque envelope produced by a machine oper-\nating dynamically with model reference being produced \nby the steady state representation. Finally, the series la-\nbelled dynamic controller is the maximum torque enve-\nlope of the motor freely accelerating, and being con-\ntrolled by the model reference augmented by the dy-\nnamic voltage reservation scheme. The experiment \nshows that the dynamic controller has produced a greatly \nenhanced torque envelope when compared to the con-\ntroller based on the steady-state system description. The \ndifference in maximum torque at any point between the \ndynamic controller and the max steady state envelope is \ndue to the fact that under steady state conditions, no \nvoltage is required for the current vector dynamics, and \nconsequently more voltage is available for torque pro-\nduction. The experiment of the motor driving an external \nload motor giving a substantially greater inertia  was \nrepeated with the dynamic controller. The comparison of \nthe maximum torque envelope of this simulation is \nshown in Fig. 7. This maximum torque envelope is \ncompared with the steady state controller operating dy-\nnamically with the same inertia and also the maximum \nsteady state torque profile. The divergence between the \nperformance of the dynamic and steady state model ref-\nerence controllers is now markedly less pronounced as \npredicted. The torque profiles of the two regimes con-\nverge around 400 rads−1 as the unmodelled dynamic \nvoltage drop experienced by the steady state controller \nbegins to diminish. The experiments confirm the re-\nquirement of extending the model reference controller \nwith the dynamic voltage reservation scheme. The im- \n \nFig. 8. Test velocity profile, comparison of dynamic and steady state \nbased controller. \n \nprovement in performance when the motor is dicon-\nnected from its load is particularly pronounced. In the \ncase of the traction application under study here, much \nof the dynamic operation takes place around base speed, \nand the enhanced torque profile made available by the \ndynamic scheme allows the fastest possible gearchanges. \nThis enhancement would also be important for low iner-\ntia servo applications. \n \nV. CONCLUSION \n \nA controller has been designed, simulated and ex-\nperimentally investigated, which maximises the torque \nspeed envelope of the PMAC motor in low inertia oper-\nating mode. It has the advantages of relatively simple \nimplementation, and in practice requires no tuning for \nany arbitary motor. The approach is found to have par-\nticular benefits for maximizing the torque envelope with \nlow inertia applications, where the effects of the dynamic \nvoltage drop are the most pronounced, due to the fast \nacceleration of the rotor. As shown in Fig. 8, the con-\ntroller with the dynamic extensions is able to achieve \nfaster transition times due to the elevated torque enve-\nlope which has been made available. This has been \nfound to be of particular benefit in clutchless gearchang- \ning on electric vehicles, where the concept of “drive-\nability” indicates that lags which are only of the order of \nmilliseconds can influence the driver’s perception of the \nvehicle’s performance. The application of the dynamic \nextension can contribute to the increase in perception of \ndriveability, and is thus a useful implementation. The \nextension can be used with either the direct calculation, \nor current error methods of field weakening implementa-\ntion, and has been found to be reasonable to implement \nin a real-time controller. Although the entire technique \nrelies on motor parameters to effect the calculations, \non-line parameter estimation could easily be added to the \n64 Asian Journal of Control, Vol. 5, No. 1, March 2003 \nsystem to increase the controller’s robustness [9] The \ngeometrical approach to the model reference controller \nwas found to be easy to implement on DSP, and has the \nadvantage not only of including the current dynamics, \nbut also including resistive voltage drops, which have \nbeen neglected in previous implementations of geometric \ncontrollers. A further refinement was added to the con-\ntroller at a later stage, that is the minimisation of the \nmagnitude of the current vector at all times in order to \nreduce i2r losses in the motor windings. \n \nVI. APPENDIX - MOTOR PARAMETERS \n \nParameter Value \nL 0.000102H \nR 0.022Ω \nke 0.23V\/rad\/s \nVmax 87V \nImax 200A(rms) \nTemax 87Nm \n \nREFERENCES \n \n 1. Verl, A., and M. Bodson, “Torque Maximisation for \nPermanent Magnet Synchronous Motors,” IEEE \nTrans. Contr. Syst. Technol., Vol. 6, No. 6, pp. 740- \n744 (1998). \n 2. Shi, J. and Y.-S. Lu, “Field-weakening Operation of \nCylindrical Permanent Magnet Motors,” Proc. IEEE \nConf. Contr. Appl., Dearborn, MI, pp. 864-869 \n(1996). \n 3. Bodson, M., J. Chiasson, and R.T. Novotnak, “A \nSystematic Approach to Selecting Optimal Flux \nReferences in Induction Motors,” IEEE Trans. Contr. \nSyst. Technol., Vol. 3, No. 4, pp. 388-397 (1995). \n 4. Miller, T.J.E., “Brushless Permanent Magnet and \nReluctance Motor Drives,” University Press, Oxford \n(1993). \n 5. Pillay, P. and R. Krishnan, “Modelling, Simulation, \nand Analysis of Permanent Magnet Motor Drives, \nPart 1: The Permanent Magnet Synchronous Motor \nDrive,” IEEE Trans. Ind. Appl., Vol. 25, No. 2, pp. \n265-273 (1989). \n 6. Hindmarsh, J., Electrical Machines and Drives, \nPergamon Press Ltd., Oxford, U.K. (1985). \n 7. Kim, J.M. and S.K. Sul, “Speed Control of Interior \nPermanent Magnet Synchronous Motor Drive for the \nFlux-Weakening Operation,” IEEE Trans. Ind. Appl., \nVol. 33, No. 1, pp. 43-48 (1997). \n 8. Stewart, P. and V. Kadirkamanathan, “Dynamic Con-\ntrol of Permanent Magnet Synchronous Motors in \nAutomotive Drive Applications,” Proc. IEEE Ame. \nContr. Conf., San Diego, USA, pp. 1677-1681 \n(1999). \n 9. Blauch, A., M. Bodson, and J. Chiasson, “High- \nspeed Parameter Estimation of Stepper Motors,” \nIEEE Trans. Contr. Syst. Technol., Vol. 1, pp. \n270-279 (1993). \n10. Bose, B.K., Ed., Power Electronics and Variable \nSpeed Drives, IEEE Press, Piscataway NJ., (chap 6) \n(1996). \n11. Leonhard, W., Control of Electrical Drives, Springer \nVerlag, Berlin, 2rd Ed. (1996). \n12. Boldea, S.A., Electrical Drives, CRC Press, Boca \nRaton (1998). \n \n \n \nDr. Paul Stewart gained the Beng in \nElectronic Control and Systems En-\ngineering in 1996, and the PhD on \nPermanent Magnet AC Drives in \n1999, both from the University of \nSheffield in the United Kingdom. \nDr. Stewart is currently re-\nsearching the application of elec-\ntronically actuated inlet and exhaust valves for internal \ncombustion engines, applying multi objective evolution-\nary algorithms to the problem of optimal electromagnetic \ndesign. \n \n"}