{"doi":"10.1177\/1367877909356720","coreId":"215468","oai":"oai:eprints.lse.ac.uk:29265","identifiers":["oai:eprints.lse.ac.uk:29265","10.1177\/1367877909356720"],"title":"Post-humanitarianism: humanitarian communication beyond a politics of pity","authors":["Chouliaraki, Lilie"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-03","abstract":"This article offers a trajectory of humanitarian communication, which suggests a clear, though not linear, move from emotion-oriented to post-emotional styles of appealing. Drawing on empirical examples, the article demonstrates that the humanitarian sensibility that arises out of these emerging styles breaks with pity and privileges a short-term and low-intensity form of agency, which is no longer inspired by an intellectual agenda but momentarily engages us in practices of playful consumerism. Whereas this move to the post-emotional should be seen as a reaction to a much-criticized articulation between politics and humanitarianism, which relied on ‘universal’ morality and grand emotion, it is also a response to the intensely mediatized global market in which humanitarian agencies operate today. The article concludes by reflecting on the political and ethical ambivalence at the heart of this new style of humanitarian communication, which offers both the tentative promise of new practices of altruism and the threat of cultural narcissism","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/215468.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/29265\/1\/Post-humanitarianism%20%28LSERO%29.pdf","pdfHashValue":"047453b1b06c6fa4d083ef6b25468d4d7d865df5","publisher":"Sage","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:29265<\/identifier><datestamp>\n      2014-10-17T15:59:32Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4D43<\/setSpec><setSpec>\n      74797065733D43454E54524553:4C53455F52435F504F4C4953<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/29265\/<\/dc:relation><dc:title>\n        Post-humanitarianism: humanitarian communication beyond a politics of pity<\/dc:title><dc:creator>\n        Chouliaraki, Lilie<\/dc:creator><dc:subject>\n        HE Transportation and Communications<\/dc:subject><dc:subject>\n        HV Social pathology. Social and public welfare. Criminology<\/dc:subject><dc:subject>\n        PN1990 Broadcasting<\/dc:subject><dc:description>\n        This article offers a trajectory of humanitarian communication, which suggests a clear, though not linear, move from emotion-oriented to post-emotional styles of appealing. Drawing on empirical examples, the article demonstrates that the humanitarian sensibility that arises out of these emerging styles breaks with pity and privileges a short-term and low-intensity form of agency, which is no longer inspired by an intellectual agenda but momentarily engages us in practices of playful consumerism. Whereas this move to the post-emotional should be seen as a reaction to a much-criticized articulation between politics and humanitarianism, which relied on ‘universal’ morality and grand emotion, it is also a response to the intensely mediatized global market in which humanitarian agencies operate today. The article concludes by reflecting on the political and ethical ambivalence at the heart of this new style of humanitarian communication, which offers both the tentative promise of new practices of altruism and the threat of cultural narcissism.<\/dc:description><dc:publisher>\n        Sage<\/dc:publisher><dc:date>\n        2010-03<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/29265\/1\/Post-humanitarianism%20%28LSERO%29.pdf<\/dc:identifier><dc:identifier>\n          Chouliaraki, Lilie  (2010) Post-humanitarianism: humanitarian communication beyond a politics of pity.  International Journal of Cultural Studies, 13 (2).  pp. 107-126.  ISSN 1367-8779     <\/dc:identifier><dc:relation>\n        http:\/\/ics.sagepub.com\/<\/dc:relation><dc:relation>\n        10.1177\/1367877909356720<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/29265\/","http:\/\/ics.sagepub.com\/","10.1177\/1367877909356720"],"year":2010,"topics":["HE Transportation and Communications","HV Social pathology. Social and public welfare. Criminology","PN1990 Broadcasting"],"subject":["Article","PeerReviewed"],"fullText":"  \nLilie Chouliaraki \nPost-humanitarianism: humanitarian \ncommunication beyond a politics of pity \nArticle (Accepted version) \n(Refereed) \n \n \n Original citation: Chouliaraki, Lilie (2010) Post-humanitarianism: humanitarian communication beyond a politics of \npity. International journal of cultural studies, 13 (2). pp. 107-126. ISSN 1367-8779 \nDOI: http:\/\/dx.doi.org\/10.1177\/1367877909356720  \n \n© 2010 SAGE Publications \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/29265\/ \nAvailable in LSE Research Online: April 2012 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, \nincorporating any revisions agreed during the peer review process.  Some differences between \nthis version and the published version may remain.  You are advised to consult the publisher’s \nversion if you wish to cite from it. \n \n \n 1\nTitle: Post-humanitarianism: Humanitarian communication beyond a politics of pity \n \nAuthor: Prof. Lilie Chouliaraki \n \nAddress: Department of Media and Communications  \nLondon School of Economics and Political Science  \nSt Clements Building, Room S102 \nHoughton Street \nLondon WC2 2AE \nUnited Kingdom \nTel: +44 (0) 20 7852 3790  \nFax: +44 (0) 20 7955 7248 \nE-mail: L..Chouliaraki@lse.ac.uk \nWeb: http:\/\/www.lse.ac.uk\/collections\/media@lse\/whosWho\/LilieChouliaraki.htm \n \nTo appear in the International Journal of Cultural Studies, 2010 \n \n \nAbstract: This article offers a trajectory of humanitarian communication that suggests a \nclear, though not linear, move towards post-humanitarian styles of appealing. Drawing on \nempirical examples, the article demonstrates that the post-humanitarian sensibility breaks \nwith the emotional repertoire of pity and privileges a short-term and low-intensity form \nof agency, which is no longer inspired by an intellectual agenda but momentarily engages \nus in practices of playful consumerism. Whereas this move to the post-humanitarian \nshould be seen as a reaction to a much-criticised articulation between politics and \nhumanitarianism, based on universal morality and grand emotion, it is also a response to \nthe mediatized global market in which humanitarian agencies operate today. The article \nconcludes by reflecting on the political and ethical ambivalence at the heart of this new \nstyle of humanitarian communication, which offers both the tentative promise for new \npractices of altruism and the threat of cultural narcissism.  \n                              \n \n \n \n 2\n \n \n \nPost-humanitarianism: \nHumanitarian communication beyond a politics of pity \n                   \nIntroduction  \nHumanitarian communication seems to be under a constant threat of de-legitimization. \nFrom the early ‘shock effect’ images denounced for dehumanising the sufferer (Lissner \n1979, 1981; Benthall 1993) to ‘positive imagery’ campaigns accused of glossing over the \nmisery of suffering (Lidchi 1999, Smillie 1995) to the more recent critiques of the \ncommodification of solidarity (Nash 2008; Vestergaard 2008), no manner of representing \ndistant others as a cause of public action seems to do justice to the moral claim of \nsuffering.  \nIn this paper, I approach humanitarian communication as the rhetorical practices  \nof trans-national actors that engage with universal ethical claims, such as common \nhumanity or global civil society, to mobilize action on human suffering. Focusing on the \ntrajectory from ‘shock effect’ to ‘humanitarian branding’ appeals, I show how each style \nof appealing represents suffering as a cause for emotion and action and how, in so doing, \nit proposes distinct forms of public agency towards vulnerable others. My argument \nsuggests a clear, though not linear, move from emotion-oriented to post-humanitarian \nstyles of appealing that tend to privilege low-intensity emotions and short-term forms of \nagency. This shift, I argue, should be seen as a contemporary attempt to renew the \nlegitimacy of humanitarian communication – one that abandons universal morality and \ndraws on the resources of the media market in which humanitarian organisations operate \ntoday (Cottle and Nolan 2007).  \n \nThe crisis of pity \nBoltanski (2000: 1-6) approaches the question of de-legitimization not simply as a \nproblem of humanitarian communication but as a problem in the very relationship \nbetween humanitarianism and politics. He sees the problem as a consequence of the \ntactical use of humanitarian argument in the service of political interest that often \n 3\ndiscredits the appeal to suffering as a universal moral cause. For my purposes, his \nargument is helpful not so much as a critique of contemporary global politics but as an \nanalytical insight into the very nature of the political.  \nContemporary Western politics, founded as it is on an Enlightenment discourse of  \nthe public good, draws its legitimacy not simply from its adherence to principles of \ndemocratic governance but also from its adherence to a universal conception of welfare; \nfrom the articulation of justice with pity. Whereas this moral emphasis on pity has \nenabled, partially but significantly, the alleviation of suffering among large populations \nin modern times, it has simultaneously established a dominant discourse about public \naction that relies heavily on the language of grand emotions about suffering – a reliance \nthat, in Arendt’s famous critique, displaces politics into the ‘social question’; it displaces \nthe long-term concern with establishing structures of justice with the urgent concern to \ndoing something for those who suffer (1990: 59-114).  \nWhat Boltanksi calls the ‘crisis of pity’ today can, therefore, be understood  \nbroadly as the crisis of a particular conception of politics, where the justification of \npublic action in the name of universal ethics takes place by resort to an emotion-oriented  \ndiscourse of suffering: a language of indignation or guilt that blames the perpetrators, \nexamples ranging from peaceful civil protests to military state interventions, or the \nlanguage of sentimental gratitude that evokes appreciation for the benefactors, as in \ndisaster relief or development aid initiatives (1999: 35-54).  \nThe inadequacy of this conception of the political, I would argue, cannot be  \nsolely understood as an inadequacy of political practice, that is as the failure of global \ninstitutions to address injustice or alleviate suffering; on the contrary, despite criticisms, \nhumanitarian NGOs continue to be an important part of global governance structures and \nto nourish the moral imagination of the West (Calhoun 2008: 73-97). Instead, the \ninadequacy of this conception of the political can be understood, at least partly, as an \ninadequacy of the discourse of pity. Specifically, it can be understood as the inadequacy \nof this discourse to activate grand emotions, such as indignation and guilt or sympathy \nand gratitude, and so to sustain a legitimate claim for public action on suffering:  \n \n 4\nWhy is it so difficult nowadays to become indignant and to make \naccusations or, in another sense, to become emotional and feel sympathy – \nor at least to believe for any length of time, without falling into \nuncertainty, in the validity of one’s own indignation or one’s own \nsympathy? (Boltanksi 2000: 12).  \n \nIn this paper, I approach humanitarian communication as a mode of public  \ncommunication that both reflects and reproduces the inadequacy of this conception of the \npolitical, insofar as it aims at establishing a strategic emotional relationship between a \nWesterner and a distant sufferer with a view to propose certain dispositions to action \ntowards a cause.  \nMy argument develops as follows. First, I discuss the critique of humanitarianism  \nin the ‘shock effect’ and ‘positive image’ campaigns as a critique of grand emotions \nresulting to a reflexive turn in humanitarian communication (Critiques of humanitarian \ncommunication). Second, I turn to an analytical discussion of three contemporary appeals \n(by Amnesty International and the UN World Food Programme, 2006-07) in terms of \naesthetic quality and moral agency (An emerging style of humanitarian communication)i. \nMy discussion illustrates an emerging style of appealing that, though not replacing \nemotion-oriented styles, breaks with pity in favour of a potentially effective activism of \neffortless immediacy; in so doing, it abandons the appeal to suffering as a universal moral \ncause and challenges the relationship between humanitarianism and politics as we know \nit so far (Towards a post-humanitarian sensibility).  \n \nCritiques of humanitarian communication \nThe history of humanitarian communication can be productively recounted as a history of \nthe critique of its aesthetics of suffering. Specifically, it can be seen as a critique of the \nsocial relationships that the imagery of suffering establishes in the course of proposing a \ncertain emotional connectivity between spectator and sufferer. Two types of critique \nprevail in this account: a critique of the emotions of guilt and indignation that are \nassociated with the ‘shock’ aesthetics of early campaigns and a critique of the emotions \nof empathy and gratitude that are associated with the aesthetics of ‘positive image’ \n 5\ncampaigns (Dogra 2007). Both critiques acknowledge that the aesthetics of suffering is \ncatalytic in moving the spectator to action but challenge the ethical discourse that \nunderpins emotional motivations to action in each type of appeal.  \nMy discussion of these critiques relies on the assumption that studying  \nhumanitarian communication in terms of its aesthetic properties, that is in terms of the \nways in which it uses imagery to establish emotional connectivity between spectator and \nsufferer, can provide insights into the moral proposals to action that this form of \ncommunication makes possible in our culture. Drawing on a view of humanitarian \ncommunication as performative, enacting paradigmatic forms of feeling and acting \ntowards suffering, this analytical approach assumes that such communication does not \nsimply address the public as a pre-existing collectivity that awaits to engage in action but \nit has the power to constitute this collectivity as a body of action in the process of \nvisualising and narrating its cause (Boltanski 1999: 35-54).  \nFar from implying that publics become what campaigns intend them to become in  \na deterministic manner, the performative view emphasizes the role of humanitarian \ncommunication as ‘moral education’: as a series of subtle proposals of how we should \nfeel and act towards suffering, which are introduced into our everyday life by mundane \nacts of mediation (television, internet or urban advertising) and shape our longer-term \ndispositions to action by way of ‘habituation’ (Chouliaraki 2008: 831-47). Let me now \ndiscuss the two types of appeals, ‘shock effect’ and ‘positive image’.  \n \n‘Shock effect’ appeals: Early examples of humanitarian communication,  \nincluding the paradigmatic campaigns of Oxfam 1956 and Red Cross 1961 (see Appendix \n1), rely on a documentary mode of representing suffering in its plain reality. Oxfam’s \n1956 mother-child visual complex constitutes the classic imagery of the ‘ideal victim’ \n(Hojer 2004). The lack of eye contact suggests that the mother is unaware of being caught \nin camera, yet the picture is focalized on her arm reaching out to an imaginary benefactor \nin a plead for help, whereas the apprehensive urgency in her emaciated face testifies to \nthe despair of her conditionii. The Red Cross 1961 campaign also relies on raw realism to \ndepict human bodies in an extreme state of starvation. This image is a composition of \npeople devoid of individualizing features – biological, such as their age and sex or social, \n 6\nsuch as clothing. They are half-naked, exposing emaciated rib cases, arms and legs. \nCaptured on camera, these body parts, passively sitting in a row as they are, become \nfetishized (Hall 1997: 223-280): they do not reflect real human bodies but curiosities of \nthe flesh that mobilize a pornographic spectatorial imagination between disgust and \ndesire (Lissner 1981: 23).  \nBoth campaigns are ‘victim-oriented’: they focus on the distant sufferer as  \nthe object of our contemplation. In so doing, they establish a social relationship anchored \non the colonial gaze and premised on maximal distance between spectator and suffering \nother (Hall 1992\/2001: 275-310; Silverstone 2006: 118-23). This social relationship of \ndistance, produced by the contrast between the bare life of these sufferers and the civility \nof healthy bodies in the West, is associated with the affective regime of ‘guilt, shame and \nindignation’ (adapted from Cohen 2001:214). Thrown into relief by the circulation of \n‘shock effect’ images in contexts of affluence and safety, social distance operates as a \nmoralising force through a logic of complicity (Douzinas 2000: 153-4). On the one hand, \ncomplicity evokes the legacy of the colonial past of the West and, with it, the European \nresponsibility in systematically disfranchising distant others through imperial rule –  a \nsense of historical complicity that figures in the consciousness of Westerners as a \nsentiment of collective guilt (le Sueur & Bourdieu 2001: 148-84). On the other hand, \ncomplicity renders the spectator a witness of the horrors of suffering and, in so doing, \nmakes of our inaction a personal failure to take responsibility for their misfortune – a \nsense of everyday or banal complicity to distant suffering that taps into feelings of shame \n(Ahmed 2004: 105 for the guilt-shame distinction).  \nThis logic of complicity is a primary source of emotion in ‘shock effect’  \ncommunication: failure to act is failure to acknowledge our historical and personal \nparticipation in perpetuating human suffering. Guilt and shame, however, pivotal \nemotions as they may be in this type of imagery, do not exhaust the communicative \nreservoir of ‘shock effect’ appeals. In its most powerful manifestation, complicity \ntransforms these emotions, often regarded as introverted modes of feeling towards \nsuffering, into the more extrovert and assertive emotion of indignation. Here, the social \nrelations of complicity become political: they are externalized from the individual to \nsociety (Boltanksi 1999:61-3). Consequently, the figure of the persecutor is objectified in \n 7\nthe form of unequal structures of power and action is linked to the imperative of social \njustice: outrage into action is Amnesty International campaigns’ slogan during the early \n1990s. \nThere is, however, an inherent tension in forms of communication that rely on \ncomplicity. In evoking guilt, shame or even indignation, ‘shock effect’ appeals seek to \nturn grand emotions into action, by, at least partly, identifying the figure of the persecutor \nin the very audiences they address as potential benefactors – aren’t we, after all, part of \nthis Western legacy, participating in the systemic inertia that reproduce the power \nrelations between West and the rest? Guilt and indignation, in this sense, inform an \nambivalent form of moral agency that both presupposes the Western spectator’s \ncomplicity to world poverty, collectively and individually, and at the same time enacts \nthis complicity in the power relations that it seeks to expose and redress (Hattori 2003b: \n164-5). The critique of distance, which the ‘shock effect’ imagery establishes between \nthose who watch and those who suffer, captures precisely this ambivalence that makes \nthe West the benefactor of a world that it itself manages to symbolically annihilate.  \nThe popular resistance to ‘shock effect’ imagery, known as compassion  \nfatigue or the ‘I’ve seen this before’ syndrome (Moeller 1999:2), may not directly draw \non this theoretical critique of emotions, but it does reflect it in the form of two more \npragmatic risks: the ‘bystander’ effect and the ‘boomerang’ effect. The former risk refers \nto people’s indifference to act on suffering as a reaction towards negative emotion that \nultimately leaves people feeling powerless, as Cohen puts it, a sense of the situation so \nutterly hopeless and incomprehensible that we cannot bear to think about it (2001: 194). \nThe latter risk refers to people’s indignation not towards the imagined evil-doer but \ntowards the guilt-tripping message of the ‘shock effect’ campaigns themselves - for \nbombarding you with material that only makes you feel miserable and guilty  (Cohen \n2001:214). Rather than facilitating the call to public action on suffering, these risks may \nultimately undermine it. \n \n‘Positive image’ appeals: Developing in a responsive relationship to ‘shock effect’ \ncampaigns, ‘positive image’ ones also rely on photorealism to represent the reality of \n 8\nsufferingiii. The difference is that these campaigns reject the imagery of the sufferer as a \nvictim and focus on the sufferer’s agency and dignity.  \nThis is evident in Oxfam campaigns such as Save the Children (1991; Appendix  \n2), which sums up two key characteristics of the ‘positive image’ style: i) it personalizes \nsufferers by focalizing the appeal on distinct individuals as actors (for example, as \nparticipants in development projects) and ii) it singularizes donors by addressing each \none as a person who can make a concrete contribution to improve a sufferer’s life (for \nexample, through child sponsorshipiv). It is the presence of the benefactor, rather than the \nimplied persecutor, which is instrumental in summoning up the emotional regime of \n‘empathy, tender-heartedness and gratitude’ in ‘positive image’ appeals (adapted from \nCohen 2001: 216-18).  \nRather than complicity, the moralising function of this affective regime  \nrelies on ‘sympathetic equilibrium’, a logic of representation that orients the appeal \ntowards a responsive balance of emotions between the sufferer and the spectator as \npotential benefactor (Boltanski 1999:39). Specifically, the sympathetic equilibrium is \nestablished through the ways in which the imagery of suffering provides subtle evidence \nof the sufferer’s gratitude for the (imagined) alleviation of her suffering by a benefactor \nand the benefactor’s respective empathy towards the grateful sufferer.  \nOn the one hand, the personalization of the sufferer (in the photos of smiling  \nchildren, in the sentimental texts of child sponsorship or in the eye witness accounts of \naid workers) articulate such sense of fine-tuning between the donor and the receiver of \naid. This use of bilateral emotion not only empowers the sufferer, giving her a voice, but \nfurther animates the donor’s ‘modal imagination’: our capacity to acknowledge in the \nsuffering other a shared quality of humanity absent in ‘shock effect’ appeals. On the other \nhand, the singularization of the donor as an individual who can make a difference in a \npractical way similarly seeks to empower audiences by showing how our actions may \nlead to change.   \nThe representational practices of ‘positive image’ appeals, in this sense, address  \nthe evils of ‘shock effect’ appeals: people’s sense of powerlessness towards distant \nsuffering (the bystander effect) and people’s resistance to the negativity of campaigns \nthemselves (the boomerang effect). Importantly, however, these representational \n 9\npractices are also closely articulated with the new spirit of interventionism in the \nhumanitarian project, which goes beyond relief and aspires to transform the economic \nand political structures that can support a better life for vulnerable others. Imagery and \nthe vision it informs are thus inseparable parts of this project; as the 1989 Commission \nfor Images puts it, the problem of images and perceptions cannot be separated from the \nmethodology of interventionv. \nYet, even if these spectacles manage to provide us with a deeper  \nunderstanding of global divisions, they conceal crucial aspects of their complexity. They \nfail, for example, to critically address the hegemony of neo-liberal politics in world \neconomy, the competitive governance milieu in which NGOs operate, the conditions of \nmarketization and mediatization on which their legitimacy rests, the problematic links \nbetween NGOs and local regimes as well as the lack of local infrastructures often leading \nto failures of development. In suppressing these complex dimensions of development, \n‘positive’ appeals seem to lack a certain reflexivity as to the limits of the interventionist \nproject to promote sustainable social change (Sen 1999; 2006; Hattori 2003a). \nIt is the social relationship emerging out of spectacles of hope and  \nself-determination, embedded as they are in the power structures of development,  that \nthe critique of sameness describes as a classic instance of ‘misrecognition’, the \neuphemistic concealment of systemic power relations by the image of smiling children \n(Bourdieu 1977:183–97). Central to misrecognition is the focalization of ‘positive  \nimage’ appeals on the emotions of gratitude and fellow-feeling. Dialectically linked to \nempathy, through the logic of the sympathetic equilibrium, gratitude relies on the social \nlogic of the gift between unequal parties, which helps perpetuating the unequal relations \nof development. This is so, insofar as the gift without reciprocation, as is development \naid, binds the grateful receiver into a nexus of obligations and duties towards the \ngenerous donor. At the same time, the generosity and tender-heartedness of the West \nunite donors in a community of virtue that discovers in its own fellow-feeling for distant \nothers a narcissistic self- contentment (Hattori 2003b). Criticism against ‘positive image’ \nappeals centres precisely on this ambivalent moral agency that their imagery makes \npossible. While it appears to empower distant sufferers through discourses of dignity and \n 10\nself-determination, such imagery simultaneously disempowers them by appropriating \ntheir otherness in Western discourses of identity and agency.  \nThis critique of identity essentially addresses the ways that benevolent emotions  \noperate as instruments of power, to the extent that they render others the perpetual objects \nof ‘our’ generosity. Simultaneously, the critique reflects more pragmatic risks of \nmisrecognition that feed into an increasing compassion fatigue for ‘positive images’. \nFirst, there is the risk of positive examples of ‘aid in action’ to be misrecognized as fully \naddressing the problems of the developing world and, therefore, lead to inaction on the \ngrounds that ‘everything is already taken care of’; this is, what we may call, a \nmisrecognition of the systemic relations of inequality (Small 1997: 581-93). Second, \nthere is the risk that the plethora of smiling child faces may be misrecognized as children \nlike ‘ours’, leading to inaction on the grounds that ‘these are not really children in need’; \nthis is a misrecognition of the social relations of difference and identity that positive \nimages gloss over (Cohen 2001:183-4). Rather than enabling action on suffering, the \nmisrecognition risks inherent in ‘positive image’ campaigns deepen the crisis of pity by \nintroducing suspicion in the representation of suffering – a ‘how do I know this is real?’ \nsensibility further amplified by the public’s awareness of the capacity of the media to \nmanipulate images of suffering (Cohen & Seu 2002:187-201).   \n   \nDespite differences, the two types of appeal, ‘shock effect’ and ‘positive images’,  \nhave similar orientations: they share a reliance on photorealism and a belief in the power \nof grand emotions. Seeking to confront us with distant suffering in two of its most \nauthentic forms, shocking destitution and hopeful self-determination, humanitarian \ncommunication nonetheless seems suspended between distance and identity. The former \nanimates the affective regime of guilt and indignation to lead us into action, but such \nnegative emotions tie action to our own complicity in global injustice and run the risk of \nfatigue and apathy. The latter animates the emotional constellation of gratitude and \ntender-heartedness to persuade us to act, but such positive emotions tie action to a view \nof development as a gift, which glosses over asymmetries of power and runs the risk of \ndenying the need for action on the grounds that it may be unnecessary or, even, unreal.  \n \n 11\nAn emergent style of humanitarian communication  \nThe field of humanitarian communication seems to be a field of inherent tension. The \nthreat of de-legitimization, mentioned in the Introduction, occurs in this contradictory \nfield, where the reality of suffering appears through different norms of realism and \nactivates different emotions without, however, managing to transcend its contradictions – \nwithout managing to construe suffering as the cause of legitimate emotion and action for \nany length of time, in Boltanski’s quote. \nIt is in the light of this inherent instability that we need to examine the  \nemergence of a style of humanitarian appeal that departs from previous ones in terms of \naesthetic quality, problematizing photorealism, and in terms of moral agency, breaking \nwith the traditional registers of pity as motivations for action (guilt and indignation, \nempathy and gratitude). This style of appealing differs from the previous ones in that it \ndoes not seek to resolve the contradictions of humanitarian communication but to put \nthem forward in an explicit way.  \nThe implications of this shift go beyond the domain of communication  \nand return us to the relationship between humanitarianism and politics, insofar as this \nstyle of appealing reformulates the conception of public action on suffering that this \nrelationship presupposes. The emerging style, I argue, makes possible a new public \nsensibility that i) disengages public action from pity, that is from the activation of grand \nemotion towards suffering and ii) engages the reflexivity of the spectator, inviting us to \nrely on our own judgement as to whether public action is possible or desirable.  \nI focus on the Wold Food Programme’s ‘No food diet’ appeal  (2006) and the Amnesty \nInternational ‘Bullet. The Execution’ and ‘It is not happening here now’ (2006\/07) \nappeals (see Appendix 3)vi. I discuss each in terms of their aesthetic quality and moral \nagency.  \n \nAesthetic quality \nThe central aesthetic feature across all appeals is multi-modal juxtaposition: the contrast \nbetween different elements of each campaign’s meaning-making system. Each appeal is \nconstituted by particular forms of juxtaposition between i) verbal and visual modes, in the \nWFP ‘No food diet’, ii) visual form and content in Amnesty International’s  ‘Bullet. The \n 12\nexecution’ and iii) textual and physical space, in Amnesty’s ‘It’s not happening here but \nnow’. \nThe No Food Diet, World Food Programme (WFP), appeal relies on the contrast  \nbetween language and image. Imagery focuses on an African hut, showing the mother \nwho makes food and puts her children to bed, and evokes an aura of everyday \ndomesticity – further enhanced by the reassuringly intimate and familiar tone of the \nvoiceover that recites a recipe. Yet, the talk provides a different framing for the visual: \nthe recipe refers to the old trick of fooling children to sleep in the expectation of a dinner \nthat is never to come - the ‘no food diet’. The voiceover continues by contrasting the \neffectiveness of our familiar ‘Atkins diet’ with the ‘no food diet’ and concludes that \n…guess what… it is so effective that 25.000 people on the no food diet die everyday.  \nAt this point, the visual shifts to African people looking frontally at the camera;  \ndomesticity has now given way to the more traditional imagery of silent figures to be \ncontemplated at. The film’s last frame is WFP’s website address with a subtle invitation \nto act: www.wfp.org\/donate. This contrast between language and image works effectively \nto situate a Western diet discourse in the context of African famine and, in so doing, it \nmanages to throw into relief another contrast between a lifestyle of scarcity and a lifestyle \nof abundance. The rhetorical effect is a Bakhtinian ‘tragic irony’, a sense of the absurdity \nof our cultural habits echoed in the appeal’s two voices: theirs and ours. Unlike ‘shock \neffect’ appeals, this ironic double-voicedness does not work to remind us of the radical \notherness of the African poor, but of the otherness of our own cultural habits against the \nbackground of their struggle for daily survival.    \nThe Bullet. The Execution, Amnesty appeal relies on a different juxtaposition  \nbetween image form and content. In terms of form, the appeal consists of a 3-dimensional \nanimation technique, which simulates a prisoner’s execution. Three formal properties are \nimportant: colours, dark and subdued, rhythm, slow motion, and design, an exaggerated \nrealism that focuses on the detail of human figures, such as body posture, muscle \nmovement, gaze, but also on the detail of objects, such as the jerking of the gun, the gun \nfire, the vector of the bullet shooting through. The effect of these formal properties is \nhyperreality, a perfected sense of the real that can only be fictional (Baudrillard 1988:43-\n4). In terms of content, the story is about the rescuing of a prisoner’s life through the \n 13\npaper shield of petition sheets signed by Amnesty supporters. As we follow the bullet \nmoving slowly towards the prisoner’s body, petition papers start flying through and hover \nin space between the bullet and the body. They are being ripped by the bullet but \nultimately succeed in protecting the body – then there is an extreme close up to the \nprisoner’s eye and the sigh of his relief. The statement Your petitions are more powerful \nthan you think, followed by Amnesty’s e-address (www. AmnestyInternational.fr), is the \nonly linguistic text of the appeal. There is a sense of extreme intensity in this silent \nsequence, which endows the piece with an ecstatic sense of temporality where time \nstands still and a minute seems to last a lifetime (Barker 2002:75), a temporality that we \noften associate with the visual genres of adventure fiction. \nFinally, the It is not happening here…Amnesty appeal relies on yet  \nanother form of juxtaposition, ‘chronotopic reversal’ (Bakhtin 1986:10-59). This refers to \nthe reversal of the categories of space and time, where the imagery of distant suffering \ncomes to haunt some of the most banal spaces of our everyday life: the neighbourhood \nstreet or the bus stop. The campaign consists of 200 images of suffering from Iraq, \nMyanmar, Liberia and other places set in transparent advertizing frames across a number \nof cities in Switzerland – but quickly spread around the world through the phenomenal \nmedia response to the campaign. Devoid of background, these transparent images appear \nstrangely disembodied, as-if they suddenly emerged from a remote reality to interrupt our \nsafe lifeworld. The only bit of language, It is not happening here but now, functions to \nframe this optical illusion as a play between physical and textual space, blurring the \nboundaries between the two and bringing about the unsettling sense of urgency that \nchronotopic reversal can so powerfully activate. At the same time, Amnesty’s e-address, \nstanding unobtrusively at the bottom of the poster, gently invites us to visit the \norganization’s website as the access point for engagement with this cause \n(www.AmnestyInternational.sw).  \n \nIn so far as these appeals still rely on the force of the imagery of suffering to  \nconstruct the humanitarian cause, they do not drop photorealism. They do, however, shift \naway from photorealism as authentic witnessing towards photorealism as yet another \naesthetic choice by which suffering can be representedvii. This occurs through the use of \n 14\njuxtaposition that works to estrange us from a range of popular visual genres, such as \ndigital games or the advertizing genre of the trompe l’oeil, and introduces the imagery of \nsuffering as the new content of these genres. In inviting us to engage with their textual \ngames, these appeals come to remind us that we are confronted not with the ‘truth’ of \nsuffering but with acts of representation (Vestergaard 2009).  \n \nMoral agency \nRather than simply breaking with the aesthetic conventions of ‘shock effect’ and ‘positive \nimage’ appeals, these ones importantly also break with the moral mechanism of those \nappeals, whereby one thing, the immediacy of suffering, is assumed to be translated into \nanother, action on suffering. Which are the properties of moral agency in this style of \ncommunication where suffering becomes self-consciously aestheticized? I focus on two: \nthe technologization of action and the de-emotionalization of the cause.  \nTechnologization of action: A key feature of these campaigns is the simplicity of  \ntheir proposals to action: click your mouse. This figures modestly as a slash\/donate in the \nWFP web-address (www.wfp.uk.co\/donate) or simply as a reference to Amnesty’s \naddresses (eg. www.AmnestyInternational.fr). Such technologization of action \nsignificantly simplifies the spectator\/user’s mode of engagement with the humanitarian \ncause: all we need to do is click under the ‘sign petitions’ or ‘make donations’ links. \nThere are two dimensions to this simplification.   \nThe first dimension of simplification has to do with the use of the internet as the  \nvehicle for public action on distant suffering. Speed and on-the-spot intervention, both \nfeatures of online activism celebrated as catalysts for a new democratic politics (Bennett \n2003), are here instrumental in addressing the key problem of the humanitarian \nsensibility mentioned earlier: the non-sustainability of grand emotions towards a cause \nfor any length of time. The simplification of action, in this sense, is not only an inevitable \nbut also a desirable dimension of technologized humanitarian communication. More \nambivalently, however, this no-time engagement with technology suggests that \nexpectations of effortless immediacy, the most prominent element of contemporary \nconsumer culture, is increasingly populating the moral imagination of \nhumanitarianismviii. \n 15\nThe second dimension of simplification has to do with the absence of  \njustification in the appeals: there is simply no mention of the reasons why action may  \nbe important. As opposed to the other two styles of appealing that draw on universal \ndiscourses of ethics, this style abandons universal morality. What it communicates \ninstead is the organizational brand itself: the WFP and AI web-addresses constitute the \nonly linguistic text of the appeals. Responding to the communication risks of emotion-\noriented campaigns that ‘tell’ the public what they should feel (risks of cynicism, fatigue \nand suspicion), this style of campaigning relies instead on signalling the strong ‘brand \nequity’ of these organizations, that is their solid image and international reputation (Slim \n2003: 8-12)ix. Insofar as it strategically replaces moralistic exhortation with brand \nrecognition, thereby moving from an explicit marketing of suffering as a cause towards \nan implicit investment on the identity of the humanitarian agency itself, this emergent \nstyle can be seen as inspired by practices of corporate branding (Vestergaard 2008). \nRegarded as the most effective form of corporate persuasion, branding works through \nellipsis: it is not the verbalization of argument but the ‘aura’ of the brand  that sustains \nthe relationship between product and consumer (Arviddson 2006: 73-94).  \nIn this spirit, the branding of suffering abandons visual realism, grand  \nemotion and the question of why in order to tap into the readily available assets of \nhistorical organizations, such as WFP or Amnesty,  and to allow consumption-savvy \npublics themselves to engage with brand associations of solidarity and care as the \nautonomous creators of brand meaning. An important consequence of this highly \ntechnologized and elliptical style of humanitarian communication is the transformation of \nthe affective registers of suffering that these appeals produce. \nThe de-emotionalization of the cause: All three appeals inevitably articulate  \ncertain affective dispositions towards suffering, since without emotion no appeal to  \naction could be legitimate. These dispositions rely on the traditional affective regimes  \nof humanitarian communication: guilt and indignation or empathy and gratitude. These \nregimes, however, do not appear as immediate emotions that may inspire action but \nrather as objects of contemplation to be reflected upon. \nThe ‘No food diet’ campaign relies on irony, a textual trope characterized  \n 16\nby a high degree of self-consciousness that sets Western concerns about weight control \nagainst the drama of survival in Africa – echoing perhaps Bob Geldof’s words, ‘it is \nabsurd that in a world of plenty people die of want’. Rather than relying on the \ncontemplation of the other, this appeal relies on the contemplation of the self, through \nimagery that creates a distance from our own taken-for-granted habits in a world of \nabundance. This ironic self-reflexivity conveys a sense of suppressed guilt that gently \nhints at the affective regime of ‘shock effect’ appeals, in the final visual frame of African \npeople gazing at the camera. These images, however, do not seek to shock us by exposing \nthe extremities of ‘bare life’ but only perhaps to remind us of the absurdity of injustice at \nthe heart of our conditions of existence.  \nThe ‘Bullet. The Execution’ campaign relies on the sublimation of the  \nmoment of execution, where the battle of good versus evil works to evoke a suppressed \nreference to heroic sacrifice: the spectator’s noble power to do good, to save the live of a \nconscience prisoner. Again, this is not the heroism of indignant denunciation that has, in \nthe past, so powerfully inspired movements of international solidarity against tyrannical \nregimes. It is rather a dispassionate emotional regime, where the act of saving a life is \ncoded into the aesthetics of digital gaming and the proposal to action is disconnected \nfrom a rhetoric of justice: your petitions are more powerful than you think. \nFinally, the ‘It is happening now…’ campaign uses optical illusion to  \ninterrupt our ‘chronotopic unconscious’, the naturalized assumptions about where we are \nand how we orient ourselves to the world by placing the horrific event at the centre of our \nordinary visual experience (Holquist 2002:141-2). What the unexpected presence of \ntorture and near-death next to us evokes is a fleeting reference to compassion, an \nempathetic sentiment of urgency associated with the classic Christian figure of the Good \nSamaritan - the stranger who stops to provide aid to the wounded, without verbalizing \njustification or expressing emotion (Boltanski 1999: 5-9 for the pity-compassion \ndistinction).  \nIn summary, the uses of irony, hyperreality and optical illusion contribute  \nto the constitution of moral agency in this emerging form of campaigning, insofar as they \nmanage to refract grand emotions into, what we may call, low intensity affective regimes \n– regimes that insinuate the classic constellations of emotion towards suffering but do not \n 17\nquite inspire or enact them. Guilt, heroism and compassion re-appear not as elements of a \npolitics of pity, partaking a grand narrative of affective attachment and collective \ncommitment, but as de-contextualized fragments of such narrative that render the \npsychological world of the spectator a potential terrain of self-inspection.  \n \nTowards a post-humanitarian sensibility \nIt is this humanitarian sensibility, characterized by textual games, low intensity emotional \nregimes and a technological imagination of instant gratification and no justification, that \nwe may call post-humanitarian communicationx. Whereas still depending on realistic \nimagery (of the poor, the wounded or the about-to-die), the key feature of post-\nhumanitarianism lies precisely in loosening up this ‘necessary’ link between seeing \nsuffering and feeling for the sufferer and in de-coupling emotion for the sufferer from \nacting on the cause of suffering. Central to the post-humanitarian sensibility is the \nparticularization of the cause, whereby the representation of suffering becomes \ndisembedded from discourses of morality and relies on each spectator’s personal \njudgment on the cause for action.  \nIt is this contrast between the traditional, universalising styles of campaigning and  \nthe contemporary, particularizing ones that renders the post-humanitarian style vulnerable \nto critiques of commodification. In requiring no time commitment to the cause of \nsuffering, humanitarian branding obeys a market logic that is unable to defend a political \nvision of justice and social change or to inspire a sustained form of moral agency vis a vis \nsuffering othersxi. Whereas the commodification critique is fully justified in its suspicion \ntowards the strategic disembedding of suffering from a morality of justice, it overlooks \nthe fact that previous styles of campaigning were also informed by a similar tension \nbetween politics and the market - between awareness-raising and fund-raising (Lissner \n1979). Indeed, the dominant conception of the political, introduced earlier, that connects \nthe legitimization of public action with the production of grand emotion is not itself \ndevoid of economic interest. Rather, both ‘shock effect’ and ‘positive image’ campaigns \nare situated squarely within a market logic of persuasion, insofar as they also \ncommunicate emotion to their own ends. The production of negative or positive emotion, \nin these appeals, are at once articulations of political passion at the service of legitimizing \n 18\npublic action on suffering and simultaneously strategies of the market at the service of \nlegitimizing the humanitarian brand itself.  \nThe difference then between emotion-oriented and post-humanitarian   \ncampaigns lies essentially in the principle each style uses to secure legitimacy: moral \nuniversalism in the former and reflexive particularism in the latter. The particularization \nof the cause in post-humanitarian campaigns should be seen, in this light, as a market \nresponse to the universalization of the cause in the emotion-oriented ones. In portraying \nsufferers as powerless victims or as dignified agents, these campaigns intend to produce \neither a universal discourse of justice, through negative emotions that ultimately de-\nhumanize the sufferer, or a universal discourse of empathy, through positive emotions \nthat eventually appropriate the sufferer in a world like ‘ours’. Neither of these two forms \nof moral universalism ultimately manages to sustain a legitimate claim to action on \nsuffering.   \nFrom this perspective, rather than claiming that the post-humanitarian style  \ncommodifies communication, it would be more productive to claim that this style shifts \nthe terms on which the commodification of humanitarianism occurs today. Whereas the \npolitics of pity in earlier appeals assumes that emotions and their universal discourses \noperate in a moral economy of abundance, an economy where everyone can, in principle, \nfeel for and act on distant suffering in an unrestricted manner, post-humanitarian appeals \nassume instead that emotions operate, in fact, in an economy of scarcity where the \nemotional wealth of one agent necessarily comes at the expense of another (Gross \n2006:79).  \nIt is the recognition of this tension between the proliferation of moralizing  \ndiscourses, prescriptive and perhaps inauthentic as they are, and the public’s bounded \nability to feel and act on distant others, which lies at the heart of humanitarian branding \nand its new style of communication. By foregrounding the act of representation rather \nthan emotional affiliation towards suffering, this style acknowledges that compassion \nfatigue lies not so much in the excess of human suffering that transcends our individual \ncapacity to feel for or act on it, but rather in the excess of discourses of morality around \nwhich we are called to organize our feelings and action towards suffering.  \n \n 19\n \n \n \nConclusion: a new altruism or cultural narcissism? \nTo come full circle to the question of de-legitimization, I propose to understand the post-\nhumanitarian style as a specific response to the crisis of pity that reclaims the legitimacy \nof humanitarian appeals by removing grand emotion from the call to action on suffering. \nIt does so by recourse to the market practice of branding, which technologizes and \nparticularizes the premises for action, rendering such action irrelevant to the ethical \ndiscourses that have traditionally informed public agency on suffering.  \nAs a consequence, the post-humanitarian style offers an alternative vision of  \nagency – one whose political implications are deeply ambivalent. In activating low \nintensity emotions, this style proposes a conception of action that ‘cleanses’ public \ncommunication of sentimentalist argument and introduces individual judgment as our \nprimary resource for engaging with suffering as a cause. This focus on individual \njudgement further foregrounds the power of personal rather than collective action in \nmaking a difference in the lives of vulnerable others. What this form of agency asserts, in \nparticular, is the capacity of popular culture to expand the domain of politics towards \nmundane tactics of subversion, such as momentary estrangement and playful self-\nreflection, through the media tropes of irony, hyperreality and illusion (Harold 2004: 189-\n211); but also the capacity of new media to engage individual users in fleeting and \neffortless, but potentially effective, forms of solidarity activism (Bennett 2003: 17- 38). \nThe post-humanitarian sensibility thus comes to challenge traditional conceptions of \nagency, where such activism tends to presuppose a certain subordination of the self to a \nhigher moral cause and promotes instead a different disposition, where a playful \nengagement with the self without visionary attachments may also prove to make a \ndifference to the lives of vulnerable others (Gross 2006: 110).  \nAt the same time, however, in capitalizing on the reflexive resources of the  \nindividual without offering a moral justification for action, the post-humanitarian style \nconfronts the public it addresses with a mirror of their own world. In so doing, it runs  \n 20\nthe risk of failing to operate as an agent of ‘moral education’ – to go, that is, beyond \neveryday playfulness so as to inspire and re-constitute the moral agency of Western \npublics along the lines of civic virtues such as solidarity with and care for vulnerable \nothers. The danger then in removing the moral question of ‘why’ from humanitarian \ncommunication may be lying with perpetuating a political culture of communitarian \nnarcissism - a sensibility that renders the emotions of the self the measure of our \nunderstanding of the sufferings of the world at large.  \nEmbodied in the metaphor of the modern ‘homo sentimentalis’, this sensibility  \nfavours a public culture of private emotionality and indulgent self-inspection (Illouz \n2007: 36-9), which makes it almost impossible to engage, emotionally and practically, \nwith those who suffer outside the community of the West. What this narcissistic \nsensibility fails to recognize is that the public circulation of emotion and action, far from \ndistributed in random patterns of scarcity and abundance, is actually inscribed on \nsystematic patterns of global inequality and their hierarchies of place and human life – \nhierarchies that divide the world in zones of Western comfort and safety and non-\nWestern need and vulnerability (Chouliaraki 2006: 206-18).  \nIn conclusion, whereas the post-humanitarian style manages to reflexively address  \nthe limitations of a politics of pity, detaching the communication of suffering from grand \nemotion, it has, in one and the same move, also suppressed the articulation of ethical \ndiscourse on public action. This has important implications for humanitarian \norganizations’ practices, calling for a closer examination of their strategic communication \nchoices. The main implication is that, rather than challenging the historical patterns of \ninjustice inherent in the moral economy of scarcity, which these organizations have so \naccurately diagnosed, the post-humanitarian style may be reinforcing them. Out of an \ninterest to renew the legitimacy of humanitarian calls to action, such appeals may be \nfeeding back into a dominant Western culture, where the de-emotionalization of the \nsuffering of distant others goes hand-in-hand with the over-emotionalization of our safe \neveryday life.    \n \nBIBLIOGRAPHY \n 21\nArvidsson A. (2006) Brands. Meaning and Value in Media Culture Routledge, \nLondon \nBakhtin M. (1986) Bildungsroman in Emerson C. & Holquist M. (eds) Speech genres \nand other late essays University of Texas Press, Austin  \nBarker C. (2002) Alain Badiou. A critical introduction Pluto Press, London \n \nBaudrillard J. (1988) Selected Writings M. Poster (ed) Polity Press, Cambridge \n \nBauman Z. (2001) Liquid Modernity Polity, Cambridge \n \nBennett W.L. (2003) New Media Power: The Internet and Global Activism in Couldry N. \n& Curran J. (eds) Contesting Media Power Rowman and Littlefield \nBenthall J. (1993) Disasters, Relief and the Media I.B.Tauris, London \n \nBoltanski L. (2000) The Legitimacy of Humanitarian Actions and their Media \nRepresentations: The Case of France in Ethical Perspectives Vol. 7 Nr 1 pp. 3-16  \n \nBoltanski L. (1999) Distant Suffering. Morality, Media and Politics Cambridge \nUniversity Press, Cambridge \n \nBourdieu P. (1977) Outline of a Theory of Practice Cambridge University Press, New \nYork  \n \nCalhoun C. (2008) The Imperative to Reduce Suffering: Charity, Progress, and \nEmergencies in the Field of Humanitarian Action in Weiss T. and Barnett M. (eds.) \nHumanitarianism in Question: Power, Politics, Ethics. Cornell University Press, \nIthaca \n \nChouliaraki L. (2006) The Spectatorship of Suffering Sage, London \n \nChouliaraki L. (2008) Mediation as Moral Education in Media, Culture and Society \nVol. 30 Nr. 5 pp. 831-47 \n \nCohen S. (2001) States of Denial Polity, Cambridge \n \nCohen S. & Seu B. (2002) Knowing enough not to feel too much. Emotional  \nthinking about human rights appeals in Bradley M.P. & Petro P. (eds) Truth Claims: \nRepresentation and Human Rights pp. 187-201 Rutgers University Press, New \nBrunswick \n \nde Chaine R. (2005) Global Humanitarianism Lexington Books, Indiana \n \n 22\nDogra N. (2007) Reading NGOs visually’ – Implications of visual images for NGO \nmanagement in Journal of International Development Vol. 19 pp. 161-71 \n \nDouzinas C. (2000) The End of Human Rights Hart Publishing, London \n \nEllis J. (2000) Seeing Things: Television in an Age of Uncertainty IB Tauris Books, \nLondon \n \nFenton N. (2008) Mediating Solidarity in Global Media and Communication Volume 4 \nNr 1 pp. 37–57 \n \nFrosh P. & Pinchevski A. (2008) Witnessing in the Era of Mass-mediated \nCommunication Palgrave, London \n \nHall S. (1992\/2001) The West and the rest in Hall S. & Gieben B. (eds) Formations of \nModernity pp. 257-330 OUP & Blackwell  \nHarold C. (2004) Pranking rhetoric: \"culture jamming\" as media activism in Critical \nStudies in Media Communication Vol. 21 Nr 3 pp. 189-211 \nHattori M. (2003a) The Moral Politics of Foreign Aid in Review of International \nStudies Vol. 29 Nr.2 pp. 231–49 \n \nHattori M. (2003b) Giving as a Mechanism of Consent: International Aid \nOrganizations and the Ethical Hegemony of Capitalism in International Relations Vol. \n17 pp. 153-174 \n \nHojer B. (2004) The Discourse of Global Compassion: the audience and media reporting \nof human suffering in Media, Culture and Society Vol. 26 Nr. 4 pp. 513_31. \n \nHolquist M. (2002) Dialogism: Bakhtin and His World Routledge, London \n \nIllouz E. (2007) Cold Intimacies. The making of emotional capitalism Polity, \nCambridge \n \nLe Sueur J. and Bourdieu P. (2001) Uncivil War. Intellectuals and Identity Politics \nduring the Decolonization of Algeria University of Nebraska Press \nLidchi H. (1999) Finding the Right Image: British Development NGOs and the \nRegulation of Imagery in Skelton T. and Allen T. (eds.) Culture and Global Change \nRoutledge, London \nLissner J. (1979) The Politics of Altruism Lutheran World Foundation, Geneva \n \n 23\nLivingstone S., Bober M. & Helsper E. (2004) Active participation or just more \ninformation? Young people’s take up of opportunities to act and interact on the internet \nLSE Research Online, London (http:\/\/eprints.lse.ac.uk\/396\/) \n \nMestrovic S. (1997) Postemotional society Sage, London \n \nMoeller S. (1999) Compassion Fatigue: How the Media Sell Disease, Famine, War, \nand Death Routledge, London \n \nNash K. (2008) Global citizenship as show business in Media Culture & Society Vol. \n30 Nr. 2 pp. 167-81 \n \nOliver K. (2004) Witnessing and Testimony in Parallax Vol. 10 Nr 1 pp. 79-88 \n \nPeters J.D. (2001) Witnessing in Media, Culture and Society Vol. 23 Nr 6, pp. 707-27 \n \nSen A. (1999) Development as Freedom Oxford University Press, New York \n \nSen A. (2006) Identity and Violence. The Illusion of Destiny Penguin, London  \n \nSilverstone R. (2006) Media and Morality. On the rise of the mediapolis Polity, \nCambridge \n \nSlim H. (2003) Marketing Humanitarian Space: Argument and Method in Humanitarian \nPersuasion paper presented in the Humanitarian Negotiators Network 12-14th May \n2003 Talloires \n \nSmall D. (1997) Development education revisited: The New Zealand experience in \nMasemann V. (ed) Tradition, Modernity, and Post-modernity in Comparative \nEducation pp. 581-94 Springer Publications, New York \n \nSmillie I. (1995) The Alms Bazaar: Altruism under fire. Non-profit Organisations \nand International Development Intermediate Technology, London \n \nStevenson N. (2006) Technological citizenship: Perspectives in the recent work of M. \nCastells and P. Virilio in Sociological Research Online Vol. 10 Nr 3 \nhttp:\/\/www.socresonline.org.uk\/10\/3\/stevenson.html \n \n \nSznaider N. (1998) The Compassionate Temperament. Care and cruelty in modern \nsociety Rowman & Littlefield, Maryland \n \nVestergaard A. (2008) Branding the Humanitarian. The case of Amnesty International in \nJournal of Language and Politics Vol. 7 Nr. 3  \nVestergaard A. (2009) Identity, Integrity and Humanitarian Appeal in Chouliaraki, L. & \nMorsing, M. (eds) Media, Organisations and Identity Palgrave, London.  \n 24\n \n                                                 \n \ni My empirical focus is on European appeals across causes (poverty and human rights) and across \nmedia (television, internet and urban advertising space). In the European context, appeals by \nOxfam (eg ‘Be humankind’, UK 2008); Save the Children (eg ‘Saving children’s lives’, Sweden \n2008) and Red Cross (‘Aqua’, Denmark, 2006-7) demonstrate a similar move away from an \nemotion-oriented style of communication (Vestergaard 2008 for the Danish Red Cross \ncampaign).  \n \nii Red Cross image photographed by Werner Bischoff in Bihar, India (1951) for ‘Life’ magazine, \nwhere it appeared with the caption ‘Sir, we are dying’.  \n \niii ‘Shock effect’ and ‘positive image’ appeals should not be seen as following a linear \ndevelopment from the former to the latter. Despite criticisms against ‘shock effect’ imagery, \nevidence suggests that they are still a most effective style of appealing to the urgency of action – \nhence their continuing presence in the public communication of suffering. Both ‘shock effect’ and \n‘positive image’ appeals are today dominant styles of humanitarian communication, co-existing \nand often complementing one another. \n \niv Whereas Oxfam prefers community to child sponsorship, the latter spearheads the campaign \ncommunications of other international NGOs such as ActionAid, Plan, Children SOS, and World \nVision. \n \nv In the ‘Code of conduct on images and messages relating to the 3rd world’ (April 1989), where  \nNGOs were moreover advised to be attentive to messages that oversimplify or over-concentrate \nsensational aspects of life in the 3rd world.  The Code has been under revision since 2004, in the \nlight of surveys showing that, even though 60% of NGOs claim to have become more sensitive in \ntheir representational practices, there is little statistical difference in the actual imagery of \nsuffering used in the past ten years.   \n \nvi The WFP appeal (BBC World television; now available on WFP website, You Tube and other  \nnetworking sites); The AI ‘Bullet. The Execution’ appeal (French television, 2006, You Tube and \nother social websites). The ‘It is not happening here… ’ poster campaign (Swiss urban \nadvertising, May 2006; multiplied online visits to AI by 20 and brought the number of hits per \nday to hundreds of millions globally; source: www.osocio.com).  \n \nvii For theoretical perspectives on witnessing see Oliver (2004:79-88); Ellis (2001:2); Frosh & \nPinchevski (2008); Peters (2001: 709).    \n \nviii Fenton (2008: 37-57) for the risks of technological activism; Stevenson (2006) for a cautionary \nargument on ‘technological citizenship’; Livingstone (2004:10) et al for young people’s use \npatterns of civic\/political websites; Bauman (2001: 118-129) and Tomlinson (2007: 124-33) for \nrisks in the ‘culture of speed’. \n \nix AI ‘Bullet. The execution’: advertising agency, AOCPROD, Paris (Golden Lion at Cannes \nFestival in ad production, 2006); ‘It is not happening here…’: advertising agency, Walker \nWerbeagentur, Geneva (Silver Lion at the Cannes Festival in ad production, 2007); ‘No food diet’ \nappeal: part of a series of WFP outsourced productions, which includes celebrity interviews and \non-location visits to Africa as well as the use of Hollywood film trailers such as ‘Blood Diamond’ \n(Warner Bros 2006).   \n 25\n                                                                                                                                                 \n \nx This definition is inspired by Mestrovic’ thesis on the post-emotional society, which argues that \ncontemporary socio-political dispositions are removed from universal discourses of morality and \nare moving precisely towards a technological, low-intensity engagement with emotional states \n(Mestrovic 1997: xi-xii).  \n \nxi see Mestrovic (1997); Cohen (2001:195); but Sznaider (1998: 7-25) for the co-emergence of \ncommodification and humanitarian sentiment in modernity. \n"}