{"doi":"10.1029\/2009jc005783","coreId":"52743","oai":"oai:nora.nerc.ac.uk:13959","identifiers":["oai:nora.nerc.ac.uk:13959","10.1029\/2009jc005783"],"title":"Effects of self-attraction and loading on annual variations of ocean bottom pressure","authors":["Vinogradova,  Nadya T.","Ponte,  Rui M.","Tamisiea, Mark E.","Davis,  James L.","Hill,  Emma M."],"enrichments":{"references":[{"id":749453,"title":"A comparison of model and GRACE estimates of the large‐scale seasonal cycle in ocean bottom pressure,","authors":[],"date":"2007","doi":"10.1029\/2007GL029599","raw":null,"cites":null},{"id":749081,"title":"A preliminary model study of the large‐scale seasonal cycle in bottom pressure over the global ocean,","authors":[],"date":"1999","doi":"10.1029\/1998JC900028","raw":null,"cites":null},{"id":747411,"title":"Bottom pressure correlations in the South Atlantic,","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":746496,"title":"Dynamic and regression modeling of ocean variability in the tide‐gauge record at seasonal and longer periods,","authors":[],"date":"2007","doi":null,"raw":null,"cites":null},{"id":745093,"title":"Effect of gravitational consistency and mass conservation on seasonal surface mass loading models,","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":749549,"title":"Estimating weights for the use of time‐dependent gravity recovery and climate experiment data in constraining ocean models,","authors":[],"date":"2008","doi":"10.1029\/2008JC004903","raw":null,"cites":null},{"id":750699,"title":"Hughes (2004), Parameterization of ocean self‐ attraction and loading in numerical models of the ocean circulation,","authors":[],"date":null,"doi":"10.1029\/2003JC002034","raw":null,"cites":null},{"id":746996,"title":"Modeling the high‐frequency barotropic response of the ocean to atmospheric disturbances: Sensitivies to forcing, topography, and friction,","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":745584,"title":"Nature of global large‐ scale sea level variability in relation to atmospheric forcing: A modeling study,","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":749936,"title":"Ocean self‐attraction and loading in numerical tidal models,","authors":[],"date":"1998","doi":"10.1080\/01490419809388134","raw":null,"cites":null},{"id":748206,"title":"On post‐glacial sea level—II. Numerical formulation and comparative results on spherically symmetric models,","authors":[],"date":"2005","doi":"10.1111\/j.1365-246X.2005.02553.x","raw":null,"cites":null},{"id":748649,"title":"On postglacial geoid subsidence over the equatorial oceans,","authors":[],"date":"1991","doi":"10.1029\/91JB01284","raw":null,"cites":null},{"id":752329,"title":"Practical global oceanic state estimation,","authors":[],"date":"2007","doi":"10.1016\/j.physd.2006.09.040","raw":null,"cites":null},{"id":744196,"title":"Preliminary observations of global ocean mass variations with GRACE,","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":744638,"title":"Seasonal global mean sea level change from satellite altimeter, GRACE, and geophysical models,","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":746031,"title":"The effects of loading and self‐attraction on global ocean tides: The model and the results of a numerical experiment,","authors":[],"date":"1977","doi":null,"raw":null,"cites":null},{"id":752742,"title":"The global general circulation of the oceans estimated by the ECCO‐consortium,","authors":[],"date":"2009","doi":"10.5670\/oceanog.2009.41","raw":null,"cites":null},{"id":751256,"title":"The mean seasonal cycle in sea level estimated from a data‐constrained general circulation model,","authors":[],"date":"2008","doi":"10.1029\/2007JC004496","raw":null,"cites":null},{"id":747796,"title":"The NCEP\/NCAR 40‐year reanalysis project,","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":745724,"title":"The theory of the seasonal variability in the ocean, Deep Sea Res.","authors":[],"date":"1973","doi":null,"raw":null,"cites":null},{"id":750381,"title":"Time variation in hydrology and gravity,","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":751089,"title":"Vinogradova (2010), Impact of self‐attraction and loading on the annual cycle in sea level,","authors":[],"date":null,"doi":"10.1029\/2009JC005687","raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"The impact of self-attraction and loading (SAL) on ocean bottom pressure xi, an effect not previously considered, is analyzed in terms of the mean annual cycle based on decade long estimates of changes in land hydrology, atmospheric pressure, and oceanic circulation. The SAL-related changes in xi occur as a result of deformation of the crust due to loading and self-gravitation of the variable fluid loads. In the absence of SAL, net freshwater input and changes in mean atmospheric pressure over the ocean give rise to a spatially constant xi annual cycle with an amplitude similar to 1-2 cm in equivalent water thickness. Consideration of SAL physics introduces spatial variations that can be significant, particularly around continental boundaries, where the amplitude of deviations can exceed 1 cm. For the spatial variability induced by SAL effects, changes in both land hydrology and atmospheric pressure are important. Effects related to the changing ocean circulation are relatively weaker, apart from a few shallow coastal regions. Comparisons with a few in situ, deep ocean observations indicate that for the most accurate xi estimates, one needs to consider spatially varying SAL-related signals, along with the effects of mean atmospheric pressure and net freshwater input into the oceans. Nevertheless, the most complete estimates, including also effects of ocean circulation, are able to account for only similar to 1\/3 of the observed annual variances. Sources of the remaining contribution remain unclea","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/52743.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/13959\/1\/Vinogradova_2009JC005783.pdf","pdfHashValue":"88113078003fcdfb4e855b6655acfdcd228f03ff","publisher":"American Geophysical Union","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:13959<\/identifier><datestamp>\n      2012-11-22T12:19:26Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533230<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/13959\/<\/dc:relation><dc:title>\n        Effects of self-attraction and loading on annual variations of ocean bottom pressure<\/dc:title><dc:creator>\n        Vinogradova,  Nadya T.<\/dc:creator><dc:creator>\n        Ponte,  Rui M.<\/dc:creator><dc:creator>\n        Tamisiea, Mark E.<\/dc:creator><dc:creator>\n        Davis,  James L.<\/dc:creator><dc:creator>\n        Hill,  Emma M.<\/dc:creator><dc:subject>\n        Marine Sciences<\/dc:subject><dc:description>\n        The impact of self-attraction and loading (SAL) on ocean bottom pressure xi, an effect not previously considered, is analyzed in terms of the mean annual cycle based on decade long estimates of changes in land hydrology, atmospheric pressure, and oceanic circulation. The SAL-related changes in xi occur as a result of deformation of the crust due to loading and self-gravitation of the variable fluid loads. In the absence of SAL, net freshwater input and changes in mean atmospheric pressure over the ocean give rise to a spatially constant xi annual cycle with an amplitude similar to 1-2 cm in equivalent water thickness. Consideration of SAL physics introduces spatial variations that can be significant, particularly around continental boundaries, where the amplitude of deviations can exceed 1 cm. For the spatial variability induced by SAL effects, changes in both land hydrology and atmospheric pressure are important. Effects related to the changing ocean circulation are relatively weaker, apart from a few shallow coastal regions. Comparisons with a few in situ, deep ocean observations indicate that for the most accurate xi estimates, one needs to consider spatially varying SAL-related signals, along with the effects of mean atmospheric pressure and net freshwater input into the oceans. Nevertheless, the most complete estimates, including also effects of ocean circulation, are able to account for only similar to 1\/3 of the observed annual variances. Sources of the remaining contribution remain unclear<\/dc:description><dc:publisher>\n        American Geophysical Union<\/dc:publisher><dc:date>\n        2010<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/13959\/1\/Vinogradova_2009JC005783.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Vinogradova, Nadya T.; Ponte, Rui M.; Tamisiea, Mark E.; Davis, James L.; Hill, Emma M..  2010  Effects of self-attraction and loading on annual variations of ocean bottom pressure.   Journal of Geophysical Research, 115, C06025. 10, pp.  https:\/\/doi.org\/10.1029\/2009jc005783 <https:\/\/doi.org\/10.1029\/2009jc005783>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.agu.org\/pubs\/crossref\/2010\/2009JC005783.shtml<\/dc:relation><dc:relation>\n        10.1029\/2009jc005783<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/13959\/","http:\/\/www.agu.org\/pubs\/crossref\/2010\/2009JC005783.shtml","10.1029\/2009jc005783"],"year":2010,"topics":["Marine Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":"Click\nHere\nfor\nFull\nArticle\nEffects of self‐attraction and loading on annual variations of ocean\nbottom pressure\nNadya T. Vinogradova,1 Rui M. Ponte,1 Mark E. Tamisiea,2 James L. Davis,3\nand Emma M. Hill3\nReceived 4 September 2009; revised 9 December 2009; accepted 24 February 2010; published 29 June 2010.\n[1] The impact of self‐attraction and loading (SAL) on ocean bottom pressure x, an effect\nnot previously considered, is analyzed in terms of the mean annual cycle based on decade‐\nlong estimates of changes in land hydrology, atmospheric pressure, and oceanic\ncirculation. The SAL‐related changes in x occur as a result of deformation of the crust due\nto loading and self‐gravitation of the variable fluid loads. In the absence of SAL, net\nfreshwater input and changes in mean atmospheric pressure over the ocean give rise to a\nspatially constant x annual cycle with an amplitude ∼1–2 cm in equivalent water thickness.\nConsideration of SAL physics introduces spatial variations that can be significant,\nparticularly around continental boundaries, where the amplitude of deviations can exceed\n1 cm. For the spatial variability induced by SAL effects, changes in both land hydrology\nand atmospheric pressure are important. Effects related to the changing ocean\ncirculation are relatively weaker, apart from a few shallow coastal regions. Comparisons\nwith a few in situ, deep ocean observations indicate that for the most accurate x estimates,\none needs to consider spatially varying SAL‐related signals, along with the effects of\nmean atmospheric pressure and net freshwater input into the oceans. Nevertheless, the\nmost complete estimates, including also effects of ocean circulation, are able to account\nfor only ∼1\/3 of the observed annual variances. Sources of the remaining contribution\nremain unclear.\nCitation: Vinogradova, N. T., R. M. Ponte, M. E. Tamisiea, J. L. Davis, and E. M. Hill (2010), Effects of self‐attraction and\nloading on annual variations of ocean bottom pressure, J. Geophys. Res., 115, C06025, doi:10.1029\/2009JC005783.\n1. Introduction\n[2] Ocean bottom pressure (x) signals can be used to\ndescribe variability in ocean mass transports driven by\nsurface wind stress and heat and freshwater exchanges with\nthe atmosphere [e.g., Ponte, 1999]. Signals in x can repre-\nsent changes in deep ocean circulation, and thus be used to\nhelp infer changes in heat transports. Knowledge of x is also\nneeded to interpret fluctuations in sea level, which is an\nessential variable in ocean climate studies.\n[3] Variability in x at monthly and longer time scales has\nbeen studied using regional in situ observations [e.g.,\nHughes and Smithson, 1996], global gravity measurements\nfrom the GRACE (Gravity Recovery and Climate Experi-\nment) mission [e.g., Ponte et al., 2007], and theoretical [e.g.,\nGill and Niiler, 1973] and numerical [e.g., Ponte, 1999]\nmodels. For the annual cycle of interest to us here, com-\nparisons of model results and in situ observations have been\nrare, but recent analyses of GRACE data reveal observed\namplitudes considerably larger than the models indicate\n[Ponte et al., 2007]. Apart from possible problems with the\nobservations, there might be some issues in the use of\nnumerical models to simulate x variability. For example, in\norder to account for non‐Boussinesq processes, which are\ntraditionally neglected in general circulation models, x fields\nneed to be corrected a posteriori to allow ocean mass rather\nthan volume to be conserved [Ponte, 1999].\n[4] Similarly ignored in numerical models are changes in\nglobal mean bottom pressure \u0001 (throughout the paper,\noverbar denotes quantities that are spatially averaged over\nthe global oceans) that can be associated with net freshwater\nmass transfers into the ocean (\u0001F) and are related to the\nglobal hydrological cycle. Estimates of \u0001F have been made,\nhowever, using different methods, including temporal inte-\ngration of global mean freshwater flux from atmospheric\nreanalysis [Vinogradov et al., 2008], using estimation from\nGRACE observations [Chambers et al., 2004], removing\nfrom altimetric sea level thermosteric effects calculated from\nin situ temperatures [Chen et al., 2005], and scaling the\nglobal mean halosteric height by an appropriate constant\n[Vinogradov et al., 2008]. These studies suggest a signifi-\ncant annual cycle in \u0001F with annual phase peaking around\nOctober and amplitude of 0.5–0.8 cm. (Throughout the\n1Atmospheric and Environmental Research, Inc., Lexington,\nMassachusetts, USA.\n2National Oceanography Centre, Liverpool, UK.\n3Harvard‐Smithsonian Center for Astrophysics, Cambridge,\nMassachusetts, USA.\nCopyright 2010 by the American Geophysical Union.\n0148‐0227\/10\/2009JC005783\nJOURNAL OF GEOPHYSICAL RESEARCH, VOL. 115, C06025, doi:10.1029\/2009JC005783, 2010\nC06025 1 of 10\npaper, values of x are given in equivalent centimeters of\nwater obtained by normalizing x by constant gravity g and\nconstant seawater density r0.) Another contribution to \u0001 that\nis usually not accounted for in numerical models is that\nassociated with atmospheric pressure forcing. On seasonal\nscales, the resulting x signal is spatially constant due to the\nocean’s isostatic response to atmospheric pressure loading\n[Ponte, 1999]. The amplitude of the annual cycle in the\nmean atmospheric pressure averaged over the global oceans\n(\u0001A) is significant and can reach up to 1 cm [Ponte et al.,\n2007].\n[5] An effect that has not been considered at all in\nnumerical studies of annual variability in x is that of self‐\nattraction and loading, abbreviated as SAL hereafter [after\nGordeev et al., 1977]. A change in mass of the air and water\ncolumn exerts a load on the seafloor, causing its deforma-\ntion. The implicit change in earth and water mass distribu-\ntion modifies the gravitational field, which leads to further\nadjustments of the mass field. These effects can act on the\ndynamical x changes associated with atmospherically driven\nmass redistribution in the ocean. In addition, any change in\nmass loads over land from, e.g., hydrologic and cryospheric\nprocesses and changes in atmospheric pressure, leads to\nsimilar effects and can potentially affect x fields.\n[6] Analysis of SAL terms requires solving integrodifferential\nequations for x using iterative methods or calculating con-\nvolution integrals on global grids [Stepanov and Hughes,\n2004]. Such calculations are computationally expensive,\nwhich is part of the reason why these effects are not included\nin ocean circulation models. The importance of SAL for the\nstudy of tides has been long recognized. The effects are\nhighly parameterized in tidal calculations and can change\ntheir amplitudes by up to 50% [Ray, 1998; Gordeev et al.,\n1977]. The impact of SAL on the annual cycle in x has\nnever been studied, to our knowledge, but recently Tamisiea\net al. [2010] have shown that SAL effects cause variations of\nthe annual amplitude of relative sea level on the order of 1 to\n2 cm, supporting previous studies by Clarke et al. [2005],\nwho found spatial patterns of sea level response being highly\nnonuniform. Such perturbations are similar in amplitude to\nexpected x variability at the annual period [Ponte, 1999;\nVinogradov et al., 2008]. Here we attempt to evaluate the\nrelative importance of the SAL and \u0001 effects on the annual\ncycle in x.\n2. Models\n[7] To investigate the magnitude of the SAL‐related\nchanges in x (xSAL) we use spatially varying monthly\nanomalies derived by Tamisiea et al. [2009] for the period\nfrom 1980 to 1997. A water load is introduced into the oceans\nthat balances the change in water mass on the continents and\nin the atmosphere. An iterative solution of the spatial dis-\ntribution of this water load is determined by assuming an\ninitial uniform load together with the specified continental\nand atmospheric loads, calculating the impact on the crust\nand geoid height, and then allowing the ocean to adjust to\nthese changes [Mitrovica and Peltier, 1991; Kendall et al.,\n2005]. The xSAL corrections are derived under the assump-\ntion that SAL effects give rise to a static ocean response.\nThree different effects are represented by (1) continental\nwater mass changes using hydrological fields from LadWorld\n[Milly and Shmakin, 2002], (2) atmospheric pressure using\nthe reanalyses from the National Centers for Environ-\nmental Prediction\/National Center for Atmospheric Research\n[Kalnay et al., 1996], and (3) dynamic bottom pressure\ndriven by atmospheric forcing and provided by the output of\nthe MIT general circulation model described by Hill et al.\n[2007]. The resulting x changes due to these sources of\nmass variation are referred to as xSALH, xSALA, and xSALD,\nrespectively. Contributions of snow and ice from Greenland,\nAntarctica, Alaska and other sources to the total water\nstorage are not considered here.Values of xSAL can be con-\nsidered as a sum of its global mean and a deviation from\nthat mean:\n\u0001SAL ¼ \u0001SAL þD\u0001SAL ð1Þ\nThe deviations DxSAL represent spatially varying anomalies\nof the SAL‐related changes in x. Computation of the global\nmean \u0001SAL term involves spatial integration of xSAL fields\nunder different loads:\n\u0001SAL ¼\n1\nA\nZ\nA\n\u0001SALdA ¼ 1A\nZ\nA\nð\u0001SALH þ \u0001SALA þ \u0001SALDÞdA ð2Þ\nwhere A is the surface area of the global ocean. The first\nterm in (2) represents net input of freshwater into the ocean\nfrom the land via the hydrological cycle; the second term\nrepresents freshwater exchange between the ocean and\natmosphere due to changes in atmospheric water vapor; and\nthe third term is equal to zero by definition. Thus, \u0001SAL reflects\nnet mass transfer into the ocean due to freshwater flux:\n\u0001F ¼ \u0001SAL ð3Þ\n[8] Time series of the global mean \u0001 is estimated as a sum\nof the net mass transfer into the ocean due to freshwater\nexchange and the mean surface atmospheric pressure over\nthe ocean:\n\u0001 ¼ \u0001F þ \u0001A ð4Þ\nwhere the atmospheric term \u0001A is calculated as by Ponte\net al. [2007].\n[9] The impact of the SAL and \u0001 terms is analyzed by\ncomparing these signals with dynamic bottom pressure\nvariations (xd) associated with mass redistribution in the\nocean and generally driven by atmospheric surface forcing.\nEstimates of xd used here are based on monthly averaged\nfields from one of the ECCO solutions (version 2, iteration\n216) described by Wunsch and Heimbach [2007] and\nWunsch et al. [2009], which covers the period from 1992 to\n2004. These solutions use the MIT general circulation\nmodel and its adjoint to produce an optimized estimate of the\nocean state that is consistent with most available observa-\ntions, each weighted according to the best existing estimate\nof the data and model errors. The optimization is achieved\nthrough adjustments of the initial temperature and salinity\nfields and the surface fluxes of momentum, heat and\nfreshwater. To account for non‐Boussinesq processes that\nare not represented in the solution, sea level and bottom\npressure are corrected by unmodeled volume changes that\nare, following the approach described by Ponte [1999],\nequal to the spatial mean steric height.\nVINOGRADOVA ET AL.: SAL EFFECTS ON ANNUAL BOTTOM PRESSURE C06025C06025\n2 of 10\n[10] As mentioned earlier, inserting the SAL effects\ndirectly into numerical ocean models involves calculating\nthe SAL convolution integrals at each time step, which\nrequires far more computing resources. Such procedures will\nbe necessary when studying the ocean response at high\nfrequencies, for which dynamic effects are likely to be\nimportant [Stepanov and Hughes, 2004]. In this study,\nhowever, we focus on monthly and longer scales at which an\nequilibrium response is assumed, and the effect of SAL on x\nis calculated a posteriori after the model is run.\n3. Bottom Pressure Data\n[11] To investigate how well x signals are modeled, and in\nparticular to examine the relative importance of SAL and \u0001\neffects, it is useful to compare our x estimates with ob-\nservations. Satellite gravity data provide global x fields but\nwith considerable noise [Quinn and Ponte, 2008]. In this\nstudy, we choose instead to examine in situ deep ocean\nmeasurements from bottom pressure recorder (BPR) stations\nprovided by several programs, including (1) DART (Deep‐\nocean Assessment and Reporting of Tsunamis) stations\nmaintained by NOAA, (2) GLOUP (Global Undersea\nPressure), and (3) ACCLAIM (Antarctic Circumpolar Current\nLevels by Altimetry and Island Measurements) maintained\nby the National Oceanography Centre, United Kingdom.\nLocations of BPR measurements can be seen in Figure 1.\n[12] The DART BPRs collect data at a 15 s interval and\nrecord pressure in meters that represents the height of the\nocean surface above the seafloor. The DART measurements\nare fairly recent and cover the period from 2003 to present.\nThe GLOUP and ACCLAIM data contain pressure in mil-\nlibars (hPa) which is sampled either every 15 min, hourly, or\ndaily. The GLOUP measurements cover the period from\n1975 to 1995, and the ACCLAIM data contain the time\nperiod from 1985 to 2006, although there are many gaps\nduring the sampling period. Prior to analysis, all data sets\nwent through careful quality control, in which we estimated\nand eliminated artificial shifts in the data and averaged all\ndata sets to daily series.\n4. Methods\n[13] The x series are analyzed in terms of the mean annual\ncycle. The mean annual cycle is estimated by first averaging\nthe fields corresponding to the months of January, February,\netc. into a 12 month mean time series and then calculating\nthe annual harmonic of this series. The mean annual cycle\nfor the ECCO solution and SAL terms is computed based on\n13 year and 17 year periods, respectively. The mean annual\ncycle for the in situ BPR observations is based on different\nrecord lengths depending on data availability. It is worth\nnoting that the estimated mean annual cycle for the SAL and\nECCO fields was not particularly sensitive to the time\nperiod as long as the series length was sufficiently long. Our\nsensitivity analyses, in which we compared annual cycles\ncomputed based on periods with different length, indicate\nthat the root‐mean‐square (rms) difference between the\nmean annual cycle based on record lengths of 6 years and\nlonger is only a few percent of the annual RMS values.\nAnnual cycles of BPR observations, however, are usually\nbased on a shorter period (1 to 3 years), and thus are less\nrepresentative of true mean values.\n[14] Prior to analysis, each data set was converted to\nmonthly series that have had a mean removed. ECCO and\nSAL fields were defined on the same grid, and were col-\nlocated with BPR stations based on the grid point that is the\nnearest to the station location. Initially we started with\n100 BPR stations that cover time periods longer than 1 year.\nA number of BPR stations contain x measurements that\nwere collected during different periods in time but at the\nsame locations. Such stations, and also those stations that\nare located within 1° of each other, are grouped together,\nwhich reduced the number of BPR series to 30.\n[15] In the comparisons with data, we examine three dif-\nferent models, gradually adding the effects of \u0001 and SAL to\nthe fields xd from the ECCO estimates. The three models are\ndefined as\nm0 ¼ \u0001d ð5Þ\nm1 ¼ \u0001d þ \u0001 ð6Þ\nm2 ¼ \u0001d þ \u0001 þD\u0001SAL ð7Þ\nwhere model m0 is the initial ECCO solution, model m1\nrepresents x simulations corrected by the changes in tem-\nporally varying global mean bottom pressure \u0001, and m2 is the\nmost complete model that includes both temporal and spatial\nvariations in xSAL.\n5. Mean Annual Cycle of x\n[16] As previously mentioned, the focus of this study is\nthe mean annual cycle. Although high‐frequency variations\nin x can dominate the spectrum, annual signals in \u0001 and xSAL\ntend to be large compared to those at other periods, which\nwould make these effects more significant. All bottom\npressure results are presented in terms of equivalent water\nthickness.\n5.1. Annual Cycle in xd and x\n[17] Amplitudes of the mean climatological annual cycle\nin xd estimated using the ECCO solution do not exceed\n2 cm, except for some areas in the Southern Ocean and\nalong shallow coastal regions (Figure 1). In particular, in the\nIndian sector of the Southern Ocean xd shows strong annual\nvariability with amplitudes comparable to those in sea level\n[e.g., Fukumori et al., 1998]. The phase of the mean annual\ncycle mostly displays a basin‐scale pattern. Variations in xd\nover most of the Pacific and Indian oceans appear to be in\nphase, with the exception of the central part of the sub-\ntropical North Pacific gyre; seasonal changes in xd in the\nAtlantic and Pacific oceans are roughly out of phase with\neach other. The amplitude and phase patterns in Figure 1 are\nconsistent with previous estimates by Ponte [1999] and\nVinogradov et al. [2008].\n[18] As previously mentioned, xd does not include the\neffects of \u0001 caused by the changes in atmospheric pressure\n(\u0001A) and those related to net freshwater exchange with the\nland and atmosphere (\u0001F), as defined in (4). Our estimates of\n\u0001 yield an annual cycle of about 2.5 cm peak to peak, with\nVINOGRADOVA ET AL.: SAL EFFECTS ON ANNUAL BOTTOM PRESSURE C06025C06025\n3 of 10\nmaximum value of \u0001 occurring in late August (Figure 2f).\nThe atmospheric effect \u0001A has an annual amplitude of about\n1 cm, with a maximum in July, that is caused primarily by\nvariable atmospheric air loadings, such as the shift of air\nmasses toward Siberia in winter. Freshwater effects \u0001F\namount to peak‐to‐peak annual variations of about 2 cm,\npeaking in October. The estimates are consistent with those\nof Vinogradov et al. [2008], Ponte et al. [2007], and Chen\net al. [2005], which are based on different methods, data\ntypes and time periods. Large amplitude annual cycles in \u0001,\nrelative to xd, indicate the significance of the annual oscilla-\ntions in \u0001 and thus should be taken into account in studies of x.\n5.2. Annual Cycle in xSAL\n[19] Spatial patterns of the annual cycle in x can be\naffected by xSAL fluctuations that are not treated in section\n5.1. Figure 2 shows mean annual cycle of variations\ncaused by different loads (xSALH, xSALA, and xSALD) and their\ncombination (xSAL). As previously mentioned, the constant\npart of the SAL‐related fluctuations \u0001SAL approximates net\nmass transfer into the ocean \u0001F due to freshwater flux from the\nland and atmosphere. The deviations from this mean (DxSAL)\nresult from the relative balance of the globally averaged\nbackground ocean mass variation and the local effects of\nthe crustal deformation due to loading, the gravitational\nFigure 1. Amplitude and phase of mean annual cycle in xd estimates from the ECCO solution and\nestimates from in situ BPR measurements (shown as circles). All amplitude values are given in equivalent\ncentimeters of water. The color scale extends beyond 5 cm. Phase ranges from −180° to +180°, with −180°\nphase corresponding to a peak occurring in mid‐January, −90° corresponding to a peak in mid‐April, 0°\ncorresponding to a peak in mid‐July, 90° corresponding to a peak in mid‐October, and so on.\nVINOGRADOVA ET AL.: SAL EFFECTS ON ANNUAL BOTTOM PRESSURE C06025C06025\n4 of 10\neffects of this deformation, and the direct gravitational\nattraction of the load.When a land coastal region loses a large\nvolume of water, for example through glacial melt or river\ndischarge, the local crust, including the nearby seafloor, up-\nlifts and changes the local gravity field. In addition, because\nthe mass in the region decreased, its gravitational attraction\ndecreases, causing the nearby sea surface to fall. Simulta-\nneous to these local changes, the total ocean mass is varying.\nThese effects can amplify or cancel each other, resulting in\nspatial variability of the xSAL changes.\nFigure 2. Annual amplitude (in cm) and phase of x corrections for the SAL effects under (b–d) individ-\nual loads and (a, e) their combination. Phases are indicated by the lines with the origin denoted by dots. A\nphase of 0° corresponds to a peak in the month of July and is shown by a line pointing in the eastward\ndirection; phase increases anticlockwise and is defined as in Figure 1. (f) Annual cycle of \u0001 is computed\naccording to equation (4) as a sum of atmospheric (\u0001A) and freshwater (\u0001F) terms. The time labeling\ncorresponds to the middle of the month from January to December.\nVINOGRADOVA ET AL.: SAL EFFECTS ON ANNUAL BOTTOM PRESSURE C06025C06025\n5 of 10\n[20] As seen in Figure 2, most of the deep ocean, including\ntropical regions, exhibit annual xSAL fluctuations of the order\nof 1–2 cm or smaller. Larger amplitudes (>2 cm) can be seen\nover parts of the Indian ocean. Among the three sources of\nmass variations considered in this study, hydrological load\ndominates xSAL (Figure 2b). Whereas most of the oceans\nare in phase, with the annual maximum occurring around\nOctober, the amplitude of xSALH varies in space, ranging\nfrom a few millimeters at high latitudes to about 2 cm in\nthe Bay of Bengal. Spatial variability of xSALH, with higher\namplitudes in the Pacific, lower amplitudes in the Atlantic\nand variations along the coasts, reflects spatial distribution\nof hydrological processes. Estimates of the seasonal storage\nvary from less than 1 cm water equivalent in areas with\nuniform climatic conditions to 45 cm water equivalent in\ntropical river basins with a strong seasonal cycle [Riegger\nand Güntner, 2005].\n[21] Variations in atmospheric pressure are the second\nlargest contributor to the xSAL changes (Figure 2c). Spatial\nvariations in annual amplitudes and phases of xSALA are\nsignificant, resulting from seasonal fluctuations in atmo-\nspheric pressure that cause a shift in air masses between the\nhemispheres and over different latitudinal zones. Although\ngenerally xSALA is weaker compared to xSALH, they are of the\nsame order of magnitude and thus xSALA needs to be taken\ninto account. For example, in the regions around Antarctica\nand the Asian coastline, annual amplitudes of xSALA are\nlarge, responding to a strong seasonal cycle in atmospheric\ncirculation in the southern polar cell and large seasonal\nvariations of the Asian summer monsoon, respectively. In\nthese regions, the amplitudes of xSALA and xSALH are com-\nparable and their phase difference decreases the signal in the\ntotal xSAL.\n[22] Variations in xSALD are the weakest among the three\nloads (Figure 2d). However, there is a high level of spatial\nvariability both in amplitude and phase. Variability of xSALD\nis higher in the Southern Ocean, Indonesian Seas, and in the\nGulf of Carpentaria (northern Australia), where amplitudes\nof 1 cm are attained. Some regions of high xSALD variability\ncorrespond to closed contours of planetary potential vor-\nticity f\/H (with f being the Coriolis parameter and H the\nocean depth), and were pointed out as energetic regions by\nprevious studies as well [e.g., Fukumori et al., 1998].\nOverall, spatial patterns of xSALD are close to the amplitudes\nof xd seen in Figure 1. On average, the amplitude of xSALD\nrepresents about 15% of xd signal and can reach 20–30%\nin areas of high xSALD variability.\n[23] The spatially varying patterns introduced by consid-\neration of SAL physics and seen in DxSAL (Figure 2e)\nillustrate most clearly the importance of the SAL effects\nover the globe. In the open ocean, xSAL and \u0001SAL are very\nsimilar, as indicated by the very small amplitude of DxSAL\n(0.2 cm or smaller aside from an area in the South Pacific).\nHowever, around many boundary regions, DxSAL has an\nannual cycle with amplitudes of around 1 cm that are of the\nsame order as x. Strong signals in DxSAL are seen near\nAntarctica, the Gulf of Carpentaria, and the Amazon river\nbasin, in response to individual loads of atmospheric pres-\nsure, dynamic ocean, and hydrology, respectively, or to their\ncombination as, e.g., in Southeast Asia. In these regions,\nSAL effects play an important role in seasonal variations of\nx, and DxSAL fluctuations cannot be neglected.\n5.3. Annual Cycle in Observations of Ocean Bottom\nPressure\n[24] Observed amplitudes of the mean annual cycle in x,\ninferred from our BPR analysis, are shown as colored circles\nin Figure 1. The strongest annual amplitudes (7–9 cm) are\ndetected in the Bay of Bengal, western Pacific and southern\nAleutian Islands. Moderate annual amplitudes (2–6 cm) can\nbe observed in the Indian Ocean sector of the Southern\nOcean, southern Atlantic and in the Gulf of Alaska. The\nweakest annual amplitudes (<2 cm) are found along the\nwestern coast of the U.S., Hawaii and Central America.\nThere are regions (e.g., in the Gulf of Alaska, along the\nwestern coast of the US) where observations show a high\nlevel of spatial variability in the annual cycle. In these\nregions, amplitudes between the nearest stations can differ\nby more than a factor of two, possibly reflecting sensitivity\nof x to short length scale oceanic features, such as highly\nvariable bottom topography in the area.\n6. Model and Data Comparison\n[25] To investigate the contribution of \u0001 and DxSAL to the\nannual cycle of x in a more quantitative manner, we compare\nx measurements from the BPR stations with xd estimates\ncorrected by the two effects defined in equations (5)–(7). The\nimpact of each effect will be quantified in terms of the model\/\ndata agreement.\n[26] As mentioned earlier, comparisons of the simulated\nx signals with in situ observations are rare. Hirose et al.\n[2001] compared high‐frequency x signals from a baro-\ntropic model with BPR observations at 18 sites in the\nSouthern Ocean and showed that the simulated x under-\nestimated observed variances at all sites, with an average\nmodel\/data correlation of 0.43. Here we compare simulated\nand observed annual x signals based on in situ measurements\nfrom 30 grouped BPRs. To quantitatively measure model\/\ndata agreement we compare observations in terms of\npercentage of the annual variance explained by each model\nmi in (5)–(7). The explained variance is computed as\n\u0003i ¼ \u0004\n2ðdÞ \u0002 \u00042ðd \u0002 miÞ\n\u00042ðdÞ \u0003 100% ð8Þ\nwhere s2(X) denotes variance of X, d are BPR observa-\ntions, and mi for i = 0, 1, 2 are models defined by (5)–(7).\nValues of the modeled and explained variances computed\nat 30 BPR sites are given in Table 1 and Figure 3. With\ndefinition (8), high values of a indicate good model\/data\nagreement.\n[27] The ECCO solution m0 explains a small percentage\nof annual variances, only 17% on average. Values of xd tend\nto underestimate observed variability almost at all sites (see\nstandard deviations in Tables 1 and 2 for details). Typical\nvalues for the explained variance a0 are small (<10%) or\nnegative. A few exceptions of high a0 values include\nstations where both xd and data show strong signals (e.g.,\nstations 4, 17).\n[28] Adding a spatially constant correction \u0001 to the ECCO\nsolution improves model\/data agreement in half of the sta-\ntions and almost doubles global average value of the ex-\nplained variance. The number of stations where m1 explains\nmost of the data variance also increases (see Table 2).\nVINOGRADOVA ET AL.: SAL EFFECTS ON ANNUAL BOTTOM PRESSURE C06025C06025\n6 of 10\nTypically, stations that exhibit smaller amplitudes in the\ndata, i.e., ≤2–3 cm, benefit the most due to the comparable\namplitude of the \u0001 term (e.g., station 24 in Figure 4).\nHowever, if there is a phase shift between m0 and observed\nannual cycles, m1 does not improve model\/data agreement.\nSee for example stations along the North American west\ncoast (stations 5 and 10 in Figure 4). As was discussed in\nsection 5.3, these regions show high spatial variability,\nwith quite different annual cycles at stations that are geo-\ngraphically close, which indicates the importance of fine\nspatial structures that are not resolved by coarse‐resolution\nmodel m0.\n[29] Spatially varying correctionDxSAL can further improve\nmodel\/data agreement, although the difference between m2\nand m1 is less dramatic compared to that between m1 and m0.\nOn average, m2 improves the variance explained by ∼3%\nmostly by reducing the number of negative values of a2\ncompared to a1. Typically, m2 performs better at stations\nwhere DxSAL amplitudes are large (e.g., Bay of Bengal,\nstation 2 in Figure 4) and phase representation is better\nFigure 3. Percentage of annual variance explained by models (top) m_0, (middle) m_1, and (bottom)\nm_2, computed according to equation (8).\nVINOGRADOVA ET AL.: SAL EFFECTS ON ANNUAL BOTTOM PRESSURE C06025C06025\n7 of 10\n(e.g., station 22 in Figure 4). This result indicates that spatial\nvariability provided by xSAL effects is important in the\ntreatment and understanding of x seasonal signals.\n[30] Simulated and observed seasonal variations in x are\ncompared in terms of the mean annual cycle, which is based\non a 13 year period for the models and 1–3 year period for\nthe data, depending on availability of observations. To\nassess the uncertainty related to averaging over different\ntime periods, we compute the standard deviation of xd\nannual amplitudes during the 13 year period. The values\nshown in Table 1 range from a few millimeters to less than\n1 cm, with a global average value of 0.3 cm, which is only\nabout 10% of the global average amplitude of the BPR mean\nannual cycle. In contrast, a number of amplitudes of BPR\nand the various models differ by factors of more than two.\nThus, most of these differences cannot be attributed to the\nexpected year‐to‐year variability of the annual cycle and the\ndifferent record lengths used in our comparisons.\n7. Conclusions\n[31] Annual variability in x reflects in part the internal\nmass redistribution associated with the ocean dynamic\nresponse to momentum, heat and freshwater fluxes at the\nboundaries with the atmosphere and land. The wind stress\ncurl is particularly significant in driving large‐scale dynamic\nsignals xd [Ponte, 1999; Gill and Niiler, 1973]. Fluctuations\nin xd are commonly treated in model‐based estimates of x\nand, apart from shallow coastal regions, have annual am-\nplitudes of order 1 cm (Figure 1). Two other effects on x\narise from net freshwater exchanges with the land and\natmosphere and from changes in surface atmospheric pres-\nsure over the oceans. Under a quasi‐static response to\nloading, such effects give rise to spatially constant annual\nsignals in x [Ponte, 1999]. These signals are usually not\nrepresented in ocean models, as they are not dynamically\nrelevant, but we find that they have annual amplitudes\ncomparable to xd (Figure 2) and thus are very important to\nconsider when comparing and combining models and\nobservations of the annual cycle in x, as also found in pre-\nvious studies [e.g., Ponte et al., 2007].\n[32] A component of the x signal that has not been con-\nsidered before has to do with the physics of SAL. Annual\nfluctuations in x associated with SAL effects were docu-\nmented here (Figure 2) based on the calculations of\nTamisiea et al. [2010]. The spatial variations DxSAL asso-\nciated with SAL effects (Figure 2e) can introduce changes in\nx annual amplitudes ranging from a few millimeters to more\nthan 1 cm, which are of the same order of magnitude of the\nseasonal variations in xd over many ocean regions. The\nimportance of spatially varying xSAL corrections is particu-\nlarly clear in coastal regions, where the amplitude of DxSAL\nanomalies can reach more than 1 cm.\n[33] Spatial patterns in xSAL fields are primarily driven by\nseasonal changes in land hydrology, which yield strongest\namplitudes near India and Southeast Asia and weakest\namplitudes in the high northern latitudes (Figure 2b).\nSeasonal changes in atmospheric pressure drive significant\nspatial anomalies around Asia and Antarctica, and in the\nMediterranean (Figure 2c). Effects of SAL associated with\nthe dynamic component xd are generally weaker, except in\nsome shallow coastal regions where strong annual vari-\nability is found. Our results point to the need to account for\nall these SAL effects when treating the annual cycle in x.\n[34] The ability to represent and understand the variability\nof x seen in the records, and in particular the annual cycle,\ncontinues to be a challenge. Our current “best” estimates,\ncombining xd, the spatially varying xSAL and constant \u0001\ncorrections, can explain on average 32% of the variance in\nthe observed annual cycle in the set of BPRs analyzed here.\nThis value is significantly higher than the value of 17%\nobtained when only xd estimates are used. However, even\nthe most complete x estimates considered here fall short of\nexplaining the observed annual variability. Similar findings\nresult from comparisons with GRACE data [Ponte et al.,\n2007].\n[35] Apart from uncertainties in the measurements,\nincluding the limited temporal coverage of BPRs that limit\nthe ability to calculate a robust mean annual cycle, a long\nTable 1. Annual Variance Explained by Each Model, Standard\nDeviation of the xd Annual Amplitudes From the ECCO 13 Year\nSeries, and Standard Deviation of the Data and Each Model\nStation\na0\n(%)\na1\n(%)\na2\n(%) ERRa\ns(D)\n(cm)\ns(m0)\n(cm)\ns(m1)\n(cm)\ns(m2)\n(cm)\n1 −14 −24 −23 0.4 9.4 1.7 2.2 2.2\n2 24 45 52 0.2 7.6 1.2 1.9 2.1\n3 −19 −40 −34 0.2 3.8 1.1 1.6 1.5\n4 81 98 97 0.5 3.9 1.6 2.1 2.0\n5 91 −4 37 0.3 2.0 1.0 1.5 1.2\n6 −8 −24 −19 0.4 4.3 1.0 1.5 1.4\n7 −7 −10 −9 0.4 2.4 1.3 1.9 1.7\n8 −5 −8 −7 0.3 4.9 1.2 1.7 1.5\n9 −3 −5 −4 0.4 3.5 1.1 1.6 1.5\n10 −8 −14 −13 0.4 1.9 1.1 1.6 1.6\n11 74 91 95 0.7 3.6 2.8 3.0 3.0\n12 −1 −15 −16 0.4 6.2 1.0 1.2 1.3\n13 2 32 35 0.4 5.9 1.0 1.4 1.5\n14 9 31 32 0.4 9.4 1.1 1.6 1.6\n15 2 −3 −3 0.4 10.3 1.1 1.4 1.5\n16 10 39 42 0.4 6.1 1.1 1.6 1.7\n17 74 91 95 0.7 3.6 2.8 3.0 3.0\n18 8 −7 −6 0.5 3.7 0.7 1.1 1.0\n19 46 76 80 0.7 2.7 2.1 2.3 2.3\n20 24 59 59 0.7 3.7 2.3 2.6 2.6\n21 9 44 50 0.3 4.3 0.8 1.3 1.3\n22 16 0 34 0.5 8.4 1.1 1.3 1.4\n23 −2 7 2 0.3 8.4 0.9 1.2 1.3\n24 22 100 98 0.2 2.2 0.4 1.0 1.0\n25 6 26 23 0.4 7.9 0.8 1.4 1.3\n26 −6 −58 −58 0.3 2.7 0.8 1.2 1.2\n27 1 31 30 0.5 5.8 0.8 1.2 1.2\n28 −0 −7 −7 0.0 9.8 0.1 0.8 0.8\n29 −2 55 50 0.3 2.0 0.4 0.9 0.8\n30 21 35 43 0.3 7.2 1.1 1.7 1.6\naERR, standard deviation of the xd annual amplitudes from the ECCO 13\nyear series.\nTable 2. Statistical Summary of Table 1\nModel\nGlobal Average Percent Where Percent Where Percent Where\nPercent a < 10% a > 40% a ≥ 80%\nm0 17 63 17 10\nm1 29 50 30 13\nm2 32 43 36 17\nVINOGRADOVA ET AL.: SAL EFFECTS ON ANNUAL BOTTOM PRESSURE C06025C06025\n8 of 10\nlist of errors affecting our estimates of x is possible [e.g.,\nPonte et al., 2007]. Insufficient knowledge of the atmo-\nsphere and hydrology fields driving xd and xSAL is always an\nissue, but perhaps most important for the case of BPR data\ncomparisons is the use of smoothed topography and coarse\nspatial resolution (1°) in estimating xd. The BPR data rep-\nresent point measurements that can be affected by fine\nstructures in xd variability, possibly related to topography.\nSuch high spatial variability will be absent from model\nestimates of xd and can perhaps explain some of the\nmodel\/data discrepancies discussed in this paper.\n[36] One way to mitigate the errors in x estimates is to\nassimilate observations of x into ocean models. Such under-\ntakings, currently being considered for both BPR and\nGRACE data, require estimates of the data uncertainties, and\nthe model\/data comparisons presented here provide a good\nbasis to arrive at proper weights for BPR data, necessary for\nthe constraining procedures. Another way for error mitiga-\ntion is to include missing physics in numerical ocean models\nas much as possible. While seasonal changes in xSAL have\nbeen used here under the assumption that SAL effects give\nrise to a static response, the equilibrium assumption most\nlikely does not hold at higher frequencies [Stepanov and\nHughes, 2004], in which case explicit inclusion of SAL\nphysics in time‐stepping numerical ocean models will be\nnecessary.\n[37] Acknowledgments. The authors are grateful to Patrick Heimbach\nfor making ECCO model output available. The work was supported in part\nby NASA grants NNX07AM77G and NNX08AJ79G. Additional support\nwas provided by the National Oceanographic Partnership Program through\nits sponsorship of the ECCO project and by the Natural Environment\nFigure 4. Mean annual cycles of the data (D) and the initial (m0) and corrected ECCO solutions (m1 and\nm2) at selected locations. Station locations and uncertainties of the estimated annual cycle (in cm) are\nshown as colored circles.\nVINOGRADOVA ET AL.: SAL EFFECTS ON ANNUAL BOTTOM PRESSURE C06025C06025\n9 of 10\nResearch Council’s Oceans 2025 Program. Useful interactions in the\ncourse of this work with many ECCO colleagues are gratefully acknowl-\nedged. The authors also thank two anonymous reviewers for commenting\non the manuscript.\nReferences\nChambers, D. P., J. Wahr, and R. S. Nerem (2004), Preliminary observa-\ntions of global ocean mass variations with GRACE, Geophys. Res. Lett.,\n31, L13310, doi:10.1029\/2004GL020461.\nChen, J. L., C. R. Wilson, B. D. Tapley, J. S. Famiglietti, and M. Rodell\n(2005), Seasonal global mean sea level change from satellite altimeter,\nGRACE, and geophysical models, J. Geod., 79, 532–539.\nClarke, P. J., D. A. Lavallée, G. Blewitt, T. M. van Dam, and J. M. Wahr\n(2005), Effect of gravitational consistency and mass conservation on sea-\nsonal surface mass loading models, Geophys. Res. Lett., 32, L08306,\ndoi:10.1029\/2005GL022441.\nFukumori, I., R. Raghunath, and L.‐L. Fu (1998), Nature of global large‐\nscale sea level variability in relation to atmospheric forcing: A modeling\nstudy, J. Geophys. Res., 103, 5493–5512.\nGill, A. E., and P. P. Niiler (1973), The theory of the seasonal variability in\nthe ocean, Deep Sea Res. Oceanogr. Abstr., 20, 141–177.\nGordeev, R. G., B. A. Kagan, and E. V. Polyakov (1977), The effects\nof loading and self‐attraction on global ocean tides: The model and the\nresults of a numerical experiment, J. Phys. Oceanogr., 7, 161–170.\nHill, E. M., R. M. Ponte, and J. L. Davis (2007), Dynamic and regression\nmodeling of ocean variability in the tide‐gauge record at seasonal\nand longer periods, J. Geophys. Res., 112, C05007, doi:10.1029\/\n2006JC003745.\nHirose, N., I. Fukumori, V. Zlotnicki, and R. M. Ponte (2001), Modeling\nthe high‐frequency barotropic response of the ocean to atmospheric dis-\nturbances: Sensitivies to forcing, topography, and friction, J. Geophys.\nRes., 106, 30,987–30,995.\nHughes, C. W., and M. J. Smithson (1996), Bottom pressure correlations in\nthe South Atlantic, Geophys. Res. Lett., 23, 2243–2246.\nKalnay, E., et al. (1996), The NCEP\/NCAR 40‐year reanalysis project,\nBull. Am. Meteorol. Soc., 77, 437–470.\nKendall, R. A., J. X. Mitrovica, and G. A. Milne (2005), On post‐glacial\nsea level—II. Numerical formulation and comparative results on spheri-\ncally symmetric models, Geophys. J. Int., 161, 679–706, doi:10.1111\/\nj.1365-246X.2005.0553.x.\nMilly, P. C., and A. B. Shmakin (2002), Global modeling of land water and\nenergy balances. Part I: The land dynamics (LaD) model, J. Hydrome-\nteorol., 3, 283–299.\nMitrovica, J. X., and W. R. Peltier (1991), On postglacial geoid subsidence\nover the equatorial oceans, J. Geophys. Res., 96, 20,053–20,071.\nPonte, R. M. (1999), A preliminary model study of the large‐scale seasonal\ncycle in bottom pressure over the global ocean, J. Geophys. Res., 104,\n1289–1300.\nPonte, R. M., K. J. Quinn, C. Wunsch, and P. Heimbach (2007), A compar-\nison of model and GRACE estimates of the large‐scale seasonal cycle in\nocean bottom pressure, Geophys. Res. Lett., 34, L09603, doi:10.1029\/\n2007GL029599.\nQuinn, K. J., and R. M. Ponte (2008), Estimating weights for the use of\ntime‐dependent gravity recovery and climate experiment data in con-\nstraining ocean models, J. Geophys. Res., 113, C12013, doi:10.1029\/\n2008JC004903.\nRay, R. D. (1998), Ocean self‐attraction and loading in numerical tidal\nmodels, Mar. Geod., 21, 181–192.\nRiegger, J., and A. Güntner (2005), Time variation in hydrology and gravity,\nEarth Moon Planets, 94, 41–55, doi:10.1007\/s11038-005-1831-8.\nStepanov, V. N., and C. W. Hughes (2004), Parameterization of ocean self‐\nattraction and loading in numerical models of the ocean circulation,\nJ. Geophys. Res., 109, C03037, doi:10.1029\/2003JC002034.\nTamisiea, M. E., E. M. Hill, R. M. Ponte, J. L. Davis, I. Velicogna, and N. T.\nVinogradova (2010), Impact of self‐attraction and loading on the annual\ncycle in sea level, J. Geophys. Res., doi:10.1029\/2009JC005687, in press.\nVinogradov, S. V., R. M. Ponte, P. Heimbach, and C. Wunsch (2008), The\nmean seasonal cycle in sea level estimated from a data‐constrained gen-\neral circulation model, J. Geophys. Res., 113, C03032, doi:10.1029\/\n2007JC004496.\nWunsch, C., and P. Heimbach (2007), Practical global oceanic state estima-\ntion, Physica D, 230, 197–208.\nWunsch, C., P. Heimbach, R. M. Ponte, I. Fukumori, and ECCO‐GODAE\nConsortium Members (2009), The global general circulation of the\noceans estimated by the ECCO‐consortium, Oceanography, 22, 88–103.\nJ. L. Davis and E. M. Hill , Harvard‐Smithsonian Center for\nAstrophysics, 60 Garden St., Cambridge, MA 02138, USA.\nR. M. Ponte and N. T. Vinogradova, Atmospheric and Environmental\nResearch, Inc., 131 Harwell Ave., Lexington, MA 02421, USA.\n(nadya@aer.com)\nM. E. Tamisiea, National Oceanography Centre, 6 Bronwlow St.,\nLiverpool L3 5DA, UK.\nVINOGRADOVA ET AL.: SAL EFFECTS ON ANNUAL BOTTOM PRESSURE C06025C06025\n10 of 10\n"}