{"doi":"10.1080\/17405629.2010.533955","coreId":"103091","oai":"oai:epubs.surrey.ac.uk:2799","identifiers":["oai:epubs.surrey.ac.uk:2799","10.1080\/17405629.2010.533955"],"title":"Findings, theories and methods in the study of children’s national identifications and national attitudes","authors":["Barrett, MD","Oppenheimer, L"],"enrichments":{"references":[],"documentType":{"type":0}},"contributors":[],"datePublished":"2011","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2799<\/identifier><datestamp>\n      2017-10-31T14:06:35Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6865616C7468616E646D65646963616C:50737963686F6C6F6779<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2799\/<\/dc:relation><dc:title>\n        Findings, theories and methods in the study of children’s national identifications and national attitudes<\/dc:title><dc:creator>\n        Barrett, MD<\/dc:creator><dc:creator>\n        Oppenheimer, L<\/dc:creator><dc:date>\n        2011<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2799\/2\/Barrett_%26_Oppenheimer_%282011%29.pdf<\/dc:identifier><dc:identifier>\n          Barrett, MD and Oppenheimer, L  (2011) Findings, theories and methods in the study of children’s national identifications and national attitudes   European Journal of Developmental Psychology., 8 (1).  pp. 5-24.      <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1080\/17405629.2010.533955<\/dc:relation><dc:relation>\n        10.1080\/17405629.2010.533955<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/epubs.surrey.ac.uk\/2799\/","http:\/\/dx.doi.org\/10.1080\/17405629.2010.533955","10.1080\/17405629.2010.533955"],"year":2011,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"FINDINGS, THEORIES AND METHODS IN THE STUDY OF CHILDREN’S NATIONAL\nIDENTIFICATIONS AND NATIONAL ATTITUDES\nMartyn Barrett1 and Louis Oppenheimer2\n1\n Department of Psychology, University of Surrey, UK,\n2\n Department of Developmental Psychology, University of Amsterdam, NL\nAbstract\nThis paper reviews some of the relevant background findings against which the  empirical  studies\nreported in this special issue were designed. Particular attention is given  to  previous  findings  on\nthe development of children’s national knowledge, national attitudes and  national  identifications.\nThe  paper  also  reviews  five  existing  theories   which   have   been   proposed   to   explain   the\ndevelopment of children’s  intergroup  attitudes:  cognitive-developmental  theory  (Aboud,  1988,\n2008), social identity development theory (Nesdale, 2004,  2008),  social  identity  theory  (Tajfel,\n1978; Tajfel & Turner, 1986), societal-social-cognitive-motivational theory (Barrett,  2007,  2009;\nBarrett & Davis, 2008) and integrative  developmental-contextual  theory  (Bar-Tal  &  Teichman,\n2005; Teichman & Bar-Tal, 2008). The paper concludes  by  describing  the  shared  methodology\nwhich was utilised by all of the following studies  that  are  reported  in  this  special  issue.  These\nstudies were designed to examine how children’s attitudes to other nations develop within a  range\nof different national contexts, some of which have not experienced violent  conflict  in  the  recent\npast (England,  The  Netherlands)  but  others  of  which  have  recently  experienced,  or  still  are\nexperiencing, conflict, violence or warfare (Basque  Country,  Bosnia,  North  and  South  Cyprus,\nNorthern Ireland, Israel).\nThis special issue of the European Journal of Developmental Psychology is devoted to a series  of\nstudies that have emerged  from  a  multinational  research  project  which  investigated  children’s\nnational identifications and attitudes to national ingroups  and  outgroups  as  determinants  of  the\nunderstanding of enemy and the presence of enemy images  (Barrett,  2007;  Oppenheimer,  2005,\n2006). One of the distinctive features of  this  project  is  that  data  were  collected  in  a  range  of\ndifferent national contexts, some of which have not experienced violent conflict in the recent  past\n(England  and  The  Netherlands)  but  others  of  which  have  recently  experienced,  or  still   are\nexperiencing, conflict, violence or warfare (Basque  Country,  Bosnia,  North  and  South  Cyprus,\nNorthern Ireland and Israel). In  total,  children  from  12  national  groups  participated,  including\nJewish and Arab children (Israel), Bosniak and Serbian children (Bosnia), Catholic and  Protestant\nchildren (Northern Ireland), Greek-Cypriot and  Turkish-Cypriot  children  (Cyprus),  Basque  and\nSpanish children (the Basque Country), and  Dutch  and  English  children  (The  Netherlands  and\nEngland).[1] The project was based on the assumption that children’s national  identifications  and\nattitudes are related to the  everyday  patterns  of  discourse  and  practices  that  occur  within  the\nparticular socio-historical settings in which they are living, and for this reason the  contrast  in  the\ndevelopment of children growing up within relatively  peaceful  vs.  conflict-ridden  contexts  was\nexpected to be particularly marked.\n            In this paper, we describe some of the relevant  background  findings  and  theories  in  the\nfield, so that readers are able to situate the present work within its broader  research  context.  This\npaper also describes the shared methodology which was employed by all of the studies reported in\nthis special issue.\nPrevious  findings  on   children’s   national   knowledge,   national   attitudes   and   national\nidentifications\n            Studies exploring children’s geographical knowledge of their own  country  have  typically\nfound that such knowledge begins to be acquired from about 5 years of age (Barrett, 2005a,  2007;\nJahoda, 1963a; Piaget & Weil, 1951), with the mass media (especially television) and travel being\nimportant sources of information (Gould & White, 1986). Children’s  geographical  knowledge  of\nother  countries  starts  to  develop  at  a  slightly  later  age,  with  a  significant  increase  in   such\nknowledge occurring at about 8 years (Barrett, 1996; Jahoda, 1962; Wiegand,  1991a).  Children’s\ngeographical knowledge of other countries is largely derived from foreign travel,  formal  teaching\nat school and television  and  films,  and  varies  as  a  function  of  their  social  class,  nationality,\nethnicity  and  geographical  location  (Axia,  Bremner,  Deluca  &  Andreason,  1998;  Bourchier,\nBarrett & Lyons, 2002; Holloway & Valentine, 2000; Wiegand, 1991a, 1991b).\n            Most children already know some of the symbolic emblems (e.g., flags, national  anthems,\netc.) which are used to represent their  own  country  by  5-6  years  of  age,  and  this  emblematic\nknowledge continues to develop over subsequent years (Barrett, 2007; Helwig &  Prencipe,  1999;\nJahoda, 1963b;  Moore,  Lare  &  Wagner,  1985;  Weinstein,  1957).  There  is  significant  cross-\nnational variability in such knowledge (Barrett et al., 1997), and there  are  also  variations  within\ncountries in children’s use of, and affect for,  national  emblems  as  a  function  of  their  language\ngroup, ethnicity and gender (Moodie, 1980; Moore et al., 1985).\n            Other studies which have investigated the development of  children’s  national  stereotypes\nhave shown that stereotypes of some groups are acquired already by the age of 5  or  6  (Barrett  &\nShort,  1992;  Barrett,  Wilson  &  Lyons,  2003;  Bar-Tal,  1996;  Lambert  &   Klineberg,   1967;\nOppenheimer & Hakvoort, 2003), with these stereotypes gradually being elaborated over the  next\nfew years so that, by 10 or 11 years,  children  hold  extensive  beliefs  about  the  typical  physical\nfeatures, clothing,  habits,  psychological  and  personality  traits  of  a  large  number  of  different\nnational groups. Children obtain their beliefs  about  other  national  groups  from  many  different\nsources,  including  television,  films,  books,  school  work,   teachers,   parents,   visits   to   other\ncountries, and personal contact with foreigners  (Barrett,  2007;  Barrett  &  Short,  1992;  Bar-Tal,\n1997; Holloway & Valentine, 2000; Lambert & Klineberg, 1967).\n            Schools, in particular, usually provide a great deal of  explicit  teaching  to  children  about\ntheir own  nation  via  the  curriculum  in  subjects  such  as  history,  geography,  civic\/citizenship\neducation, language and literature. It is therefore especially noteworthy that  school  curricula  and\ntextbooks in these subjects frequently contain  ethnocentric  biases,  with  the  child’s  own  nation\nusually being presented in  a  highly  positive  light  compared  with  other  nations  (Apple,  1993;\nSchleicher & Kozma, 1992).\n            Children’s attitudes to and feelings about other nations are often idiosyncratic before about\n7  years  of  age.  However,  an  exception  occurs  in  the  case  of  those  nations  which   are   the\n‘traditional enemies’ of the child’s own  country,  which  are  often  disliked  from  an  earlier  age\n(Barrett, 2007; Jahoda, 1962; Oppenheimer & Hakvoort, 2003; Piaget &  Weil,  1951;  Teichman,\n2001). Indeed, in countries which have experienced warfare, extreme negativity may be  displayed\ntowards enemy groups as early as 2 or 3 years of age (Bar-Tal, 1996; Bar-Tal & Teichman,  2005;\nPovrzanovi?, 1997). From 7 years  onwards,  many  children  exhibit  a  preference  for  their  own\ncountry  and  national  group  over  all  others,  and  express  strong  national  pride,  with  ingroup\npreference and national  pride  sometimes  strengthening  still  further  through  middle  childhood\n(Barrett & Short, 1992; Hess & Torney, 1967; Johnson, Middelton & Tajfel, 1970; Jaspers, van de\nGeer, Tajfel & Johnson, 1972). However, some other countries and national  groups  may  still  be\nvery positively liked and, in a few cases, may even be preferred over the  child’s  own  country  or\nnational group (Middleton, Tajfel & Johnson, 1970; Moore et al., 1985;  Tajfel,  Jahoda,  Nemeth,\nRim & Johnson, 1972). Hence, contrary  to  popular  notions,  ingroup  favouritism  and  outgroup\ndenigration are not universal phenomena in this domain.\n            In addition, children’s attitudes towards national groups display  considerable  variation  in\nhow  they  develop  through  middle  childhood.  For  example,  with  increasing   age,   children’s\nnational attitudes sometimes become more positive, sometimes  more  negative,  sometimes  more\nnegative before becoming more positive again, sometimes more  positive  before  becoming  more\nnegative again, and sometimes children’s national attitudes do not show any changes at  all  across\nmiddle   childhood   (Barrett,   2007;   Lambert   &   Klineberg,   1967).    Furthermore,    different\ndevelopmental profiles may be exhibited depending on the particular national  outgroup  involved.\nThese differential patterns seem to  be  related  to  a  number  of  factors,  including  the  perceived\ncharacteristics of the target group involved, the national context within which the child is growing\nup, and the child’s own specific geographical, ethnic and linguistic  position  within  that  national\ncontext (Barrett, 2007).\n            As far as children’s national identifications are concerned, by the age of  6,  most  children\ndo usually acknowledge  their  membership  of  their  own  national  group,  but  their  strength  of\nsubjective identification with that group varies at this early  age  (Barrett,  2007).  There  is  also  a\ngreat deal of variation in the subsequent development of children’s  national  identifications.  This\nvariation  seems  to  depend  on  the  specific  country   in   which   the   child   lives,   the   child’s\ngeographical location within that country, the child’s ethnicity, the use of language  in  the  family\nhome, and the child’s language  of  schooling  (Barrett,  2005b,  2007).  The  strength  of  national\nidentification is usually correlated with the  child’s  general  affect  towards  the  national  ingroup\n(Barrett, 2007; Barrett, Lyons & del Valle, 2004). However, the strength of national  identification\nis only sometimes related to the positive distinctiveness which  is  attributed  to  the  ingroup  over\noutgroups as measured using trait attribution tasks (Barrett, 2007).\nTheoretical accounts of the development of intergroup attitudes in childhood\n            Several theoretical accounts have been proposed to explain the development  of  children’s\nintergroup attitudes. Here, we focus on the five theories which are the most pertinent to the studies\non children’s national attitudes reported in this special issue.\n             Cognitive-developmental   theory.   Cognitive-developmental   theory   (CDT)   has   been\nprimarily expounded and elaborated by Aboud (1988,  2008;  Aboud  &  Amato,  2001;  Doyle  &\nAboud, 1995; Doyle, Beaudet & Aboud, 1988). She argues that children’s intergroup attitudes  are\ndriven  by  their  underlying  cognitive  and  socio-cognitive  development.  Strongly  Piagetian  in\norientation, CDT postulates that there is a watershed in the development  of  children’s  intergroup\nattitudes at the age of about 6-7 years. Prior to this age, Aboud  suggests,  children’s  egocentricity\nand affective processes dominate their responses to people from other national,  ethnic  and  racial\ngroups, with the result that they exhibit pronounced ingroup bias  and  negative  prejudice  against\noutgroups. These biases are hypothesised to peak at 6-7  years,  after  which  they  decline.  Aboud\nargues that, at 6-7 years, children attribute mainly positive traits to their own ingroup  and  mainly\nnegative traits to outgroups; however, between 6-7 and 11-12 years, children increasingly attribute\nmore  negative  traits  to  the  ingroup  and  more  positive  traits  to  outgroups.  This  results  in  a\nreduction in levels of both ingroup bias and outgroup prejudice. These shifts  are  hypothesised  to\nbe driven by the development of the child’s underlying cognitive and socio-cognitive skills.\n            In her more recent formulations, Aboud (2008; Aboud & Amato, 2001) has  acknowledged\nthat socialization factors  may  sometimes  influence  children’s  intergroup  attitudes,  particularly\nthose of ethnic minority children who do not always exhibit outgroup prejudice before  6-7  years.\nHowever,  she  argues  that  the  effectiveness  of  parental  discourse,  media  representations  and\neducational input in altering children’s attitudes depends on  the  child’s  cognitive  mindset,  with\nchildren’s own cognitive abilities determining which social inputs are influential.\n            Because of its postulation of a  single  normative  pattern  of  development  grounded  in  a\nuniversal sequence of  cognitive-developmental  changes,  CDT  has  difficulty  in  explaining  the\nsheer variety of different developmental  patterns  which  children’s  attitudes  to  national  groups\ndisplay during middle childhood (Barrett, 2007; Lambert & Klineberg, 1967). Aboud  and  Amato\n(2001, p.78) themselves also acknowledge that CDT  lacks  a  clear  explanation  of  why  children\ndifferentiate between outgroups, attaching positive evaluations  to  some  outgroups  and  negative\nevaluations to others.\n            Social identity development theory. In  recent  years,  social  identity  development  theory\n(SIDT) has been put forward by Nesdale (2004, 2008) as an  alternative  to  CDT,  and  the  theory\ndoes indeed make very different predictions from CDT. SIDT postulates that there are four phases\nin the development of children’s intergroup attitudes. Before 2-3 years of age, cues about people’s\nracial, ethnic and national group memberships are not yet salient to  the  child.  The  second  phase\nstarts at about 3 years, when awareness of these cues begins  to  emerge.  In  addition,  during  this\nsecond phase, the child acquires the awareness that he or she is a  member  of  the  ingroup.  SIDT\npostulates that, during the third phase, which commences at about 4  years,  the  child  focuses  on,\nand prefers, the ingroup over outgroups. During this  phase,  the  child  does  not  dislike  or  reject\noutgroups.  Instead,  the  ingroup  is  merely  preferred  over  other  groups.  The  fourth  phase  of\ndevelopment postulated by SIDT begins at about 7 years, when the child’s focus shifts away  from\nthe ingroup and towards outgroups and negative  prejudice  against  outgroups  begins  to  emerge.\nHowever, Nesdale argues that not all children enter this final phase. Whether they  do  so  depends\non  whether  the  child  internalises  prejudices  current  amongst  members  of  the   ingroup.   The\nlikelihood of this occurring is driven by the strength of the  child’s  subjective  identification  with\nthe ingroup, how widespread the negative attitudes are among members  of  the  ingroup,  and  the\nextent to which ingroup members feel under threat from the outgroup  concerned.  SIDT  therefore\npredicts that negative prejudice against  ‘enemy’  nations  will  arise  after  the  age  of  7  in  those\ncountries which perceive themselves to be under  threat  from  other  nations  and  where  negative\nattitudes to the ‘enemy’ nations are widely held by ingroup members.\n            CDT and SIDT are polarised in the predictions which they make about the development of\nprejudice,  with  CDT  proposing  that  outgroup  prejudice  increases  up  to  6-7  years  and   then\ndecreases, and with SIDT proposing that it is only after 7  years  that  prejudice  starts  to  develop\n(and even then may not develop  in  all  children).  CDT  has  drawn  much  of  its  evidence  from\nstudies which have used trait attribution tasks to test children’s  explicit  attitudes  towards  groups\n(e.g., Doyle & Aboud, 1995; Doyle et al., 1988). One of the potential problems with such  tasks  is\nthat children can  tailor  their  responses,  particularly  where  there  are  social  norms  against  the\nexpression of prejudice. Nesdale argues that  the  apparent  reduction  in  prejudice  across  middle\nchildhood  is  a  result  of  children’s  increasing  awareness   of   the   unacceptability   of   openly\nexpressing prejudice against outgroups, rather than of prejudice reduction per se. He suggests  that\nalternative measures of children’s implicit rather than explicit attitudes  are  therefore  required  to\ntest between the two theories. However,  evidence  from  recent  studies  using  implicit  measures\n(e.g., Davis, Leman & Barrett, 2007; Dunham, Baron & Banaji, 2006) do not support  SIDT,  with\nlevels of implicit prejudice either remaining steady after 6-7 years of age or declining  rather  than\nincreasing  after  this  age.  SIDT  also  has  difficulty  explaining  why,  in  countries  which  have\nexperienced inter-ethnic conflict or warfare, extreme negativity can be  exhibited  towards  enemy\ngroups at the age of 2-3 years (Bar-Tal, 1996; Bar-Tal & Teichman, 2005; Povrzanovi?, 1997).\n            Social identity theory. Social identity theory (SIT) does not  make  predictions  about  age-\nlinked developmental changes  in  children’s  attitudes,  but  it  does  make  predictions  about  the\ncircumstances under which ingroup bias and outgroup prejudice will occur. SIT was developed by\nTajfel (1978; Tajfel & Turner, 1986), who argued that when individuals internalise a social  group\nmembership as part of their self-concept, those individuals are motivated to view that social group\nin a positive way. In order to do this, the ingroup is compared against outgroups using dimensions\nof comparison which yield more positive representations of the  ingroup  than  of  outgroups.  The\npositive distinctiveness which  is  ascribed  to  the  ingroup  over  the  outgroups  on  these  chosen\ndimensions is then used as a source of positive self-esteem. However, SIT postulates that this only\noccurs under certain  conditions.  First,  the  individual  must  have  internalised  the  social  group\nmembership  as  part  of  his  or  her  self-concept.  If   internalisation   has   not   occurred,   or   if\nidentification with the group is weak, then these effects will  not  occur.  Second,  the  comparison\noutgroups must be relevant to the ingroup’s own self-definition. If outgroups  are  not  relevant  to\nhow the ingroup views itself, then ingroup favouritism and\/or outgroup denigration will not occur.\nThird, the situation in which these social comparisons take place  must  allow  comparisons  to  be\nmade on dimensions which are relevant for the ingroup’s own self-definition.\n            In addition, Tajfel and Turner (1986) argue that, where an outgroup is perceived to  have  a\nclearly superior status to the ingroup, alternative  strategies  need  to  be  used  instead  to  achieve\npositive  self-esteem.  These  include  leaving  the  ingroup  (individual  mobility),  redefining  the\ningroup or changing the dimensions which are being used for  the  comparison  (social  creativity),\nor changing the social structure itself (social competition).  Individual  mobility  may  occur  when\ngroup boundaries are viewed as being permeable, while  social  creativity  and  social  competition\nmay occur when group boundaries are viewed as being impermeable. Social  competition  is  most\nlikely to occur  when  status  differentials  are  perceived  to  be  illegitimate  or  the  status  of  the\noutgroup is perceived  to  be  unstable.  Because  the  strategy  depends  on  perceptions  of  group\nboundary permeability and the legitimacy and stability of  status  differentials,  SIT  proposes  that\nintergroup attitudes and behaviours vary depending on a wide range of different factors.\n            More recent research inspired by SIT (e.g., Crocker & Quinn, 2001; Ellemers & Barreto,\n2001; Ellemers, Spears & Doosje, 1999; Mummendey, Kessler, Klink & Mielke, 1999; Simon,\n2004) has examined the consequences of belonging to a social group which is perceived to be\nunder threat. This work has revealed that members of threatened groups tend to have higher levels\nof identification with the ingroup, show higher levels of outgroup prejudice and\/or ingroup\nfavouritism, are more sensitive to status differentials between groups, and perceive the ingroup as\nbeing more homogeneous and more cohesive. However, these effects only occur among\nindividuals with high levels of ingroup identification; individuals with weak identifications may\nsimply disidentify with the group still further under conditions of theat. Patterns of national\nidentifications and attitudes will therefore differ in relatively peaceful countries where the national\ngroup is not perceived to be under threat vs. countries characterised by intergroup conflict,\nviolence or warfare. \n            SIT can explain why children belonging to  different  groups  display  different  intergroup\nattitudes depending on their strength of identification with the ingroup, the perceived status of  the\ningroup and perceptions of threat. It also helps to explain why attitudes towards  outgroups  which\nvary in status are differentiated so  that  attitudes  towards  one  outgroup  may  be  different  from\nattitudes towards another outgroup.\n              Societal-social-cognitive-motivational    theory.    Societal-social-cognitive-motivational\ntheory (SSCMT) has recently been put forward by Barrett (2007, 2009;  Barrett  &  Davis,  2008).\nLike SIT,  this  theory  does  not  make  predictions  about  the  particular  ages  at  which  ingroup\nfavouritism or outgroup prejudice occur. Instead, this theory attempts to integrate  within  a  single\nover-arching framework all of the influences which impact on children’s intergroup attitudes.\n            SSCMT is represented diagrammatically in Figure 1. SSCMT starts  from  the  observation\nthat  the  child  always  develops  within  a  particular  societal  niche   characterised   by   specific\nhistorical, geographical, economic and  political  circumstances.  These  circumstances  define  the\nrelationships between the child’s ingroups and salient outgroups, their status differentials and their\nhistory of peaceful co-existence and\/or conflict. Adult members of the  child’s  society  hold  their\nown beliefs and attitudes concerning these circumstances, and  these  can  drive  their  behaviours.\nFrom the point of view of the developing child,  the  most  relevant  individuals  here  are  parents,\nteachers and the  people  who  produce  materials  for  school  curricula,  textbooks  and  the  mass\nmedia.\n\n            SSCMT proposes that parents’ discourse and actions can directly influence their children’s\ndeveloping intergroup attitudes. However, parents  can  also  have  indirect  effects,  because  they\ndetermine where the family lives, where they go on holiday and the kinship relations  of  the  child\n(all of which may affect the nature of the child’s personal contact with people from other national,\nethnic and racial groups). Parents also determine which school  the  child  attends,  and  hence  the\neducational curriculum, textbooks, teachers and peer group  to  which  the  child  is  exposed.  The\nschool itself can also influence the child’s personal contact with people from other national, ethnic\nand racial groups (depending on its own ethnic and racial mix). In addition, parents buy goods  for\nthe family home such as books, televisions, computers connected to the Internet,  etc.  In  the  case\nof younger children, parents may also control access to some of these information sources.\n            Hence, there are many sources of information about  other  groups  available  to  the  child:\npersonal contact with members of  those  groups,  the  school  curriculum  and  textbooks,  teacher\ndiscourse and practices, parental discourse and practices, peer group discourse and  practices,  and\nrepresentations of other groups in the  mass  media  (Barrett,  2007;  Bar-Tal  &  Teichman,  2005;\nOppenheimer, in press). However, which information sources are actually attended to by the  child\nare  influenced  by  the  child’s  own  perceptual  and  attentional  processes.  These   in   turn   are\ninfluenced by the  child’s  cognitive,  affective  and  motivational  processes  (including  levels  of\nidentification with national, ethnic and racial  ingroups).  Hence,  different  sets  of  environmental\nfactors  may  be   influential   for   different   children   depending   on   their   own   psychological\ncharacteristics. In addition, the child’s own discourse and actions may be responded to by parents,\nteachers,  peers,  etc.,  and  these  actors  may  either  provide  further  information   to   the   child,\nchallenge what the child has said or done, or punish or praise the child.\n             SSCMT  postulates  that  different  constellations  of  factors  are  the  primary  drivers  of\nintergroup attitudes in different children, depending  on  their  own  psychological  characteristics,\nthe groups to which they belong, and the particular societal contexts in which  they  live.  In  other\nwords, SSCMT proposes that the relative  weightings  which  may  be  attached  to  the  arrows  in\nFigure 1 vary from one child to another, and  from  one  socio-historical  setting  to  another.  Both\ncognitive development and social identity processes may play important  roles,  as  CDT  and  SIT\nsuggest, but SSCMT proposes that these factors  can  be  over-ridden  in  some  contexts  by  other\nfactors  such  as  parental  discourse,  media  representations  or  educational   influences.   Hence,\nSSCMT postulates that there is substantial variability in the development of children’s  intergroup\nattitudes depending on the specific contexts in which they live.\n              Integrative   developmental-contextual   theory.   Integrative    developmental-contextual\ntheory (IDCT) has been developed by Bar-Tal and Teichman (2005; Teichman &  Bar-Tal,  2008)\nto  account  for  the  development  of  children’s  intergroup   attitudes   within   societal   contexts\ncharacterised by intractable  intergroup  conflict.  The  theory  is  therefore  especially  relevant  to\nseveral of the empirical studies reported in this special issue.\n            IDCT proposes that when there is serious and ongoing conflict between the ingroup and an\noutgroup,  ingroup  members  acquire  a  shared  psychological  intergroup  repertoire   (SPIR)   in\nrelationship to that outgroup. This repertoire consists  of  stereotypes  of  the  outgroup,  prejudice,\nassociated emotions and behavioural intentions towards the outgroup. The acquisition of a SPIR is\ninfluenced by affective states, cognitive development and  identity  development.  While  all  three\nfactors can  potentially  operate  at  all  ages,  the  prevailing  social  context  affects  their  relative\nsalience. In contexts involving intractable conflict, affective states tend to be the  dominant  factor\nin the preschool years, and so, between the ages of 2 and 6, negative affect dominates, resulting in\nstrong negative feelings towards members of the enemy outgroup. Once established,  this  kind  of\nSPIR can then swamp out possible cognitive effects in later childhood. The result is that prejudice\nagainst the enemy nation is acquired early (at 2-3 years of  age),  no  reduction  in  prejudice  takes\nplace during middle childhood (7-9 years), and during early adolescence (10  years  plus)  identity\nconcerns and their motivational correlates may lead to a further increase  in  hostility  towards  the\nenemy outgroup. The content of the SPIR itself is  transmitted  by  socialisation  agents,  including\nparents, the mass media and the school.\n            According to IDCT, once it has been formed, a SPIR will influence the relative salience of\naffective, cognitive and identity factors, so that the SPIR and  these  factors  reinforce  each  other,\nconsolidating negative attitudes and prejudice towards the enemy. Extreme ethnocentrism  results,\nwhich is highly resistant to change. For this reason, attempts at intervention and  the  amelioration\nof negative attitudes (e.g. through education) may be ineffective.\n             Thus,  according  to  IDCT,  in  societies  characterised  by  intractable  conflict,   attitudes\ntowards the enemy outgroup develop in a different way from the way in  which  attitudes  to  other\nneutral outgroups develop, and from the way in  which  intergroup  attitudes  develop  in  peaceful\nsocieties. Hence, like SIT and  SSCMT,  IDCT  emphasises  that  the  development  of  intergroup\nattitudes does not follow a universal trajectory.\n            Bar-Tal and Teichman (2005; see also Teichman &  Bar-Tal,  2008)  provide  a  wealth  of\nevidence that, in Israel, which is a context characterised by an  intractable  conflict  between  Jews\nand Arabs, Jewish children do indeed exhibit high levels of prejudice  towards  Arabs  at  an  early\nage, do not moderate their prejudice across the  years  of  middle  childhood,  and  show  a  further\nelevation in this prejudice in early adolescence. These studies also reveal that majority Jewish and\nminority Arab children in Israel display different patterns  of  attitude  development.  Bar-Tal  and\nTeichman argue that the Jewish children’s attitudes are driven mainly by Israel’s ongoing  conflict\nwith its neighbouring states, whereas the Arab children’s attitudes  are  driven  primarily  by  their\nminority status within Israel.\n            IDCT and SSCMT clearly have considerable conceptual  overlap  but  different  foci,  with\nthe  former  theory  providing  a  specific  account  of   children’s   development   within   contexts\ncharacterised by intractable intergroup conflict, and  the  latter  theory  providing  a  more  general\naccount of the full range of possible factors which may impact on  children’s  development  across\nall types of  societal  context.  Despite  this  difference  in  focus,  the  two  theories  share  several\ncommon  postulates.  For  example,  both   theories   emphasise:   (i)   the   absence   of   universal\ndevelopmental  trajectories  and  the  existence  of  pervasive  variability  in  the  development   of\nintergroup  attitudes;  (ii)  the  role  of  parents,  the  mass  media  and  education   in   transmitting\nrepresentations  of  prevailing  intergroup  relations  to  the  child;  (iii)  the  possible  influence  of\ncognitive, affective, motivational and identity factors in the development  of  intergroup  attitudes;\n(iv) the idea that cognitive, affective, motivational and  identity  factors  can  affect  the  uptake  of\ninformation from the environment; and (v) the idea that different factors and causal pathways may\ndominate in a child’s development depending on the  specific  societal  setting  within  which  that\nchild is living.\nThe shared methodology used by the studies reported in this special issue\n            The present  multi-national  study  was  conducted  against  this  empirical  and  theoretical\nbackdrop. One of the aims of the study was to examine the  extent  to  which  the  development  of\nchildren’s attitudes to other nations varies across different societal contexts. This comparative aim\nrequired  identical  methodology  to  be  used  with  all   groups   of   children   to   permit   formal\ncomparisons  to  be  made.  The  shared  methodology  which  was  used  included  the   following\nmeasures.\n            Strength of Identification Scale.   The  Strength  of  Identification  Scale  (SoIS)  (Barrett,\n2007) is a scale which has been developed to measure the  strength  of  national,  ethnic,  racial  or\nreligious  identification  in  children  and  adolescents.  It  consists  of  a  short   set   of   questions\nadministered in an interview format to 5- to 11-year-olds (with response options being  written  on\ncards and read out to the child) or in a questionnaire  format  to  11-  to  16-year-olds  (with  rating\nscales being used instead to capture responses). The full set of six items  in  the  5-  to  11-year-old\nversion of the scale are as follows (where X represents the targeted identity):\n1. Degree of identification\nQuestion: Which one of these do you think best describes you?\nResponse options: very X, quite X, a little bit X, not at all X\n2. Pride\nQuestion: How proud are you of being X?\nResponse options: very proud, quite proud, a little bit proud, not at all proud\n3. Importance\nQuestion: How important is it to you that you are X?\nResponse options: very important, quite important, not very important, not important at all\n 4. Feeling\nQuestion: How do you feel about being X?\nResponse options: very happy, quite happy, neutral, quite sad, very sad (administered  using\na set of five ‘smiley’ faces)\n5. Negative internalisation\nQuestion: How you would feel if someone said something bad about X people?\nResponse options: very happy, quite happy, neutral, quite sad, very sad (administered  using\na set of five ‘smiley’ faces)\n6. Positive internalisation\nQuestion: How you would feel if someone said something good about X people?\nResponse options: very happy, quite happy, neutral, quite sad, very sad (administered  using\na set of five ‘smiley’ faces)\n            The questions are scored so that low scores represent low levels of identification, and  high\nscores represent high levels of identification. Because the questions  use  a  mixture  of  4-  and  5-\npoint scales, either the item scores are standardised before they are averaged, or the scores  on  the\n4-point scales are rescaled onto 5-point scales before averaging.[2] All six items need not be used,\nparticularly where  the  wording  of  a  particular  question  is  awkward  and\/or  unnatural  for  the\nidentity which is being tested.\n            The SoIS has previously been used to measure the strength of national,  ethnic,  racial  and\nreligious identification in various populations, including national identifications in  white  English\n11- to 16-year-olds (Dixon, 2002; Forrest & Barrett, 2001),  national  identifications  in  6-  to  11-\nyear-olds in Scotland and Wales (Penny,  Barrett  &  Lyons,  2001;  Trimby,  2005),  national  and\nethnic identifications in an ethnically mixed group of 11- to 16-year-olds  in  London  (Alexander,\n2002), religious identifications in Muslim,  Hindu  and  Christian  5-  to  11-year-olds  in  England\n(Takriti, 2002), national, ethnic and religious identifications in English, Indian and Pakistani 7-  to\n11-year-olds (Vethanayagam & Barrett, 2007), racial and national identifications in  5-  to  9-year-\nold children in England (Davis et al., 2007), national identifications in Iranian 11- to  17-year-olds\nin England and Iran (Sahlabadi, 2002), national identifications in 12- to 18-year-olds  in  Germany\n(Maehr, 2005), and ethnic and religious identifications in Albanian 8-  to  13-year-olds  in  Greece\n(Manouka, 2001). These studies have found that SoIS item scores always load onto a single factor\n(eigenvalues ranging between 2.02 and 3.30; % of variance explained  ranging  between  40.8  and\n80.1) and scale reliably (Cronbach’s alpha ranging between .60 and .91, with the sole exception of\nyoung  white  children’s  racial  identifications  in  the  study  by  Davis  et  al.,  2007,  where   the\nreliability was only .41). In addition, the  test-retest  reliability  of  the  SoIS  over  an  eight  week\nperiod has been found to be .68 (Barrett, 2007).\n            In the following studies which are  reported  in  this  special  issue,  the  5-  to  11-year-old\nversion of the SoIS was used to assess the strength of children’s national identifications.  In  order\nto control possible order effects, for each child individually, the order of administration of  the  six\nquestions was randomised. In addition, to avoid possible left-right response biases, response cards\nwere laid out in sequence always keeping the “don’t know” card on the far right but  reversing  the\norder of layout of the other cards within each set across successive children.\n            The trait attribution task and the affect questions.  Attitudes  to  ingroups  and  outgroups\nwere measured using a trait attribution task (taken from Barrett et al., 1997). The task used a set of\n12  cards,  on  each  of  which  one  of  the  following  traits  was  written:  clean,   dirty,   friendly,\nunfriendly, smart, stupid, hard working, lazy, happy, sad, honest  and  dishonest.  The  cards  were\nrandomly ordered for each individual child. The pile of cards was shown to the child so that he  or\nshe could see the word on the first card, and the following instructions were given: Here are  some\ncards with words on them that describe people. So, we can say that some people are (word on first\ncard). (First card removed, and child shown  the  second  card.)  And  some  people  are  (word  on\nsecond card). (Second card removed.) And some people  are  (word  on  third  card).  Right?  Now,\nwhat I want you to do is to go through all these words one by one, and I want you to sort out those\nwords which you think can be used to describe X people (where  X  represented  the  name  of  the\ntarget national group). Can you do that for me please? (Child  given  the  complete  set  of  cards.)\nSort out the words which you think describe X people. When the child  had  finished  the  task,  the\ncards were gathered up in a randomly ordered pile, ready  for  testing  the  next  target  nationality.\nThe child was then asked two further questions to assess general affect towards the target group of\npeople: Now, I just want to ask you one  more  thing  about  X  people.  Do  you  like  or  dislike  X\npeople? If the child said that he or she liked or disliked them, the second question was then  given:\nHow much? Do you like\/dislike them a lot or a little?\n            At the end of this sequence of questions, the child was told: Right now,  let’s  do  the  same\nthing again, but this time thinking about X people (where X was the name of the next target  group\nto be tested). Can you sort out for me those words  which  you  think  can  be  used  to  describe  X\npeople? In total, the children in the present sequence of  studies  were  given  the  above  task  and\nquestions in relationship to  their  own  national  ingroup,  an  outgroup  which  was  a  ‘traditional\nenemy’ of their own ingroup, plus two relatively neutral outgroups. The order  in  which  the  four\ntarget national groups were tested was randomised for each individual child.\n            The wordings used in the trait attribution task and the affect questions have been  found  to\nwork well with children in a range of different national settings (Bennett, Lyons,  Sani  &  Barrett,\n1998;  Vila,  del  Valle,  Perera,  Monreal  &  Barrett,  1998;  Castelli,  Cadinu  &   Barrett,   2002;\nGiménez, Canto, Fernández & Barrett, 2003; Bennett et al., 2004;  Reizábal,  Valencia  &  Barrett,\n2004). The quantitative scores which were derived from the trait attribution task included the total\nnumber of positive traits and the total number of negative traits attributed to each individual target\ngroup. In addition, by subtracting the number of negative traits from the number of positive  traits,\nan overall positivity score was derived for each target group. The responses to the affect questions\nwere scored on a 5-point Likert scale ranging from like a lot (5) to  dislike  a  lot  (1)  with  neutral\nresponses being scored at the midpoint (3).\nProcedure\n            The above tasks were administered to the children as follows. Each child  was  interviewed\nindividually in a quiet room in their school. After establishing rapport,  it  was  explained  that  the\ninterviewer was interested in what they thought about certain things and that  the  child  would  be\nasked to complete some tasks and answer  some  questions.  Each  child  was  reassured  that  they\nwere not being tested, that there were no good or  bad  answers,  and  that  no  one  other  than  the\ninterviewer would know what they had  said.  The  children  were  then  asked  to  give  their  age,\ngender, and ethnicity. Their responses to these initial questions, as well as  their  responses  on  all\nthe tasks, were recorded on individual response sheets.\n            Because the research took place in  different  languages,  backtranslation  procedures  were\nused. The initial draft of the tasks  was  drawn  up  in  the  English  language,  and  this  draft  was\ntranslated into the target language by one translator,  and  then  backtranslated  into  English  by  a\ndifferent translator. The product  was  compared  with  the  original  English  version  to  ascertain\nwhether any changes in meaning had occurred. If they had, the translators discussed the change  in\nmeaning and agreed on an appropriate translation in the target language.\nConclusion\n            In this paper, we have provided a brief overview of some of the previous research  findings\nin this field and of the five principal  theories  which  may  be  applied  to  explain  developmental\nphenomena in this domain. These  overviews  should  enable  the  reader  to  locate  the  following\npapers in this special issue within  their  broader  research  context.  In  this  paper,  we  have  also\ndescribed the measures and procedures which were used in the studies  reported  in  the  following\npapers.  These  papers  report  and  interpret  the  findings  obtained  in  the   following   countries:\nEngland, Bosnia, Northern Ireland, northern Cyprus, southern Cyprus,  and  the  Basque  Country.\nThe sequence  of  papers  ends  with  a  final  paper  reporting  the  findings  of  the  cross-national\ncomparative analyses, which also incorporate the data collected in The Netherlands and Israel.\nReferences\nAboud, F.E. (1988). Children and Prejudice. Oxford: Blackwell.\nAboud, F.E. (2008). A social-cognitive developmental theory of prejudice. In In S.M. Quintana &\nC. McKown (Eds.), The Handbook of Race, Racism and  the  Developing  Child  (pp.  55-71).\nHoboken, NJ: John Wiley & Sons.\nAboud, F.E. & Amato, M. (2001). Developmental and socialization influences on intergroup  bias.\nIn R. Brown & S.L. Gaertner (Eds.), Blackwell Handbook of  Social  Psychology:  Intergroup\nProcesses (pp. 65-85). Oxford: Blackwell.\nAlexander,  E.  (2002).  National  and  ethnic  identity  in  British  adolescents.  Unpublished  BSc\ndissertation, University of Surrey.\nApple, M. (1993). Official Knowledge: Democratic Education  in  a  Conservative  Age.  London:\nRoutledge.\nAxia, G., Bremner, J.G.,  Deluca,  P.  &  Andreasen,  G.  (1998).  Children  drawing  Europe:  The\neffects of nationality, age and teaching.  British  Journal  of  Developmental  Psychology,  16,\n423-437.\nBarrett, M. (1996). English children’s acquisition of a European identity.  In  G.  Breakwell  &  E.\nLyons  (Eds.),  Changing  European  Identities:  Social   Psychological   Analyses   of   Social\nChange (pp. 349-369). Oxford: Butterworth-Heinemann.\nBarrett,  M.  (2005a).  Children’s  understanding  of,  and  feelings  about,  countries  and  national\ngroups.  In   M.   Barrett   &   E.   Buchanan-Barrow   (Eds.),   Children’s   Understanding   of\nSociety (pp. 251-285). Hove: Psychology Press.\nBarrett, M. (2005b). National identities in children and young people. In  S.  Ding  &  K.  Littleton\n(Eds.), Children’s  Personal  and  Social  Development  (pp.  181-220).  Milton  Keynes:  The\nOpen University\/Blackwell Publishing.\nBarrett, M.  (2007).  Children’s  Knowledge,  Beliefs  and  Feelings  about  Nations  and  National\nGroups. Hove: Psychology Press.\nBarrett, M. (2009). The development of children’s intergroup attitudes. In A. Hu & M. Byram\n(Eds.), Interkulturelle Kompetenz und Fremdsprachliches Lernen: Modelle, Empirie,\nEvaluation\/Intercultural Competence and Foreign Language Learning: Models, Empiricism,\nAssessment (pp. 69-86). Tübingen, Germany: Gunter Narr Verlag.\nBarrett, M. & Davis,  S.C.  (2008).  Applying  social  identity  and  self-categorization  theories  to\nchildren’s racial, ethnic, national and state identifications and attitudes.  In  S.M.  Quintana  &\nC. McKown (Eds.), The Handbook of Race, Racism and the Developing  Child  (pp.  72-110).\nHoboken, NJ: John Wiley & Sons.\nBarrett, M., Lyons, E., Bennett, M., Vila, I., Giménez,  A.,  Arcuri,  L.  &  de  Rosa,  A.S.  (1997).\nChildren’s Beliefs and Feelings about  Their  Own  and  Other  National  Groups  in  Europe.\nFinal Report to the Commission of the European  Communities,  Directorate-General  XII  for\nScience,  Research  and  Development,  Human  Capital  and  Mobility  (HCM)   Programme,\nResearch Network No. CHRX-CT94-0687.\nBarrett, M., Lyons, E. & del Valle, A. (2004).  The  development  of  national  identity  and  social\nidentity processes: Do social  identity  theory  and  self-categorization  theory  provide  useful\nheuristic  frameworks  for  developmental  research?  In  M.  Bennett  &  F.  Sani  (Eds.),  The\nDevelopment of the Social Self (pp. 159-188). Hove, UK: Psychology Press.\nBarrett, M. & Short, J. (1992). Images of European people in  a  group  of  5-10  year  old  English\nschool children. British Journal of Developmental Psychology, 10, 339-363.\nBarrett, M., Wilson, H. & Lyons, E. (2003). The development of national  in-group  bias:  English\nchildren’s attributions of characteristics  to  English,  American  and  German  people.  British\nJournal of Developmental Psychology, 21, 193-220.\nBar-Tal, D. (1996). Development of social categories and stereotypes in early childhood: The case\nof  “the  Arab”  concept  formation,  stereotype  and  attitudes  by  Jewish  children  in   Israel.\nInternational Journal of Intercultural Relations, 20, 341-370.\nBar-Tal, D. (1997). Formation and change of ethnic and national stereotypes: An integrative\nmodel. International Journal of Intercultural Relations, 21, 491-523.\nBar-Tal, D. & Teichman, Y. (2005). Stereotypes and Prejudice in Conflict: Representations of\nArabs in Israeli Jewish Society. Cambridge: Cambridge University Press.\nBennett, M., Barrett, M., Karakozov, R., Kipiani, G., Lyons,  E.,  Pavlenko,  V.  &  Riazanova,  T.\n(2004). Young  children’s  evaluations  of  the  ingroup  and  of  outgroups:  A  multi-national\nstudy. Social Development, 13, 124-141.\nBennett, M., Lyons, E., Sani, F. & Barrett, M. (1998). Children’s subjective identification with the\ngroup and ingroup favoritism. Developmental Psychology, 34, 902-909.\nBourchier,  A.,  Barrett,  M.  &  Lyons,  E.  (2002).  The  predictors   of   children’s   geographical\nknowledge of other countries. Journal of Environmental Psychology, 22, 79-94.\nCastelli, L.,  Cadinu,  M.  &  Barrett,  M.  (2002).  Lo  sviluppo  degli  atteggiamenti  nazionali  in\nsoggetti in età scolare. Rassegna di Psicologia, 19, 49-65.\nCrocker, J. &  Quinn,  D.M.  (2001).  Psychological  consequences  of  devalued  identities.  In  R.\nBrown  &  S.L.  Gaertner  (Eds.),  Blackwell  Handbook  of  Social   Psychology:   Intergroup\nProcesses (pp. 238-257). Oxford: Blackwell.\nDavis, S.C., Leman,  P.J.  &  Barrett,  M.  (2007).  Children’s  implicit  and  explicit  ethnic  group\nattitudes, ethnic group identification,  and  self-esteem.  International  Journal  of  Behavioral\nDevelopment, 31, 514-525.\nDixon, A.  (2002).  Social  identity  theory  and  the  development  of  national  identity  in  British\nadolescents. Unpublished BSc dissertation, University of Surrey.\nDoyle, A.B. & Aboud, F.E. (1995). A longitudinal study of white children’s racial  prejudice  as  a\nsocial-cognitive development. Merrill-Palmer Quarterly, 41, 209-228.\nDoyle, A.B., Beaudet,  J.  &  Aboud,  F.E.  (1988).  Developmental  patterns  in  the  flexibility  of\nchildren’s ethnic attitudes. Journal of Cross-Cultural Psychology, 19, 3-18.\nDunham, Y., Baron, A.S. & Banaji,  M.R.  (2006).  From  American  city  to  Japanese  village:  A\ncross-cultural investigation of implicit race attitudes. Child Development, 77, 1268-1281.\nEllemers, N. & Barreto, M. (2001). The impact of relative group status:  affective,  perceptual  and\nbehavioral consequences. In R. Brown & S.L. Gaertner (Eds.), Blackwell Handbook of  Social\nPsychology: Intergroup Processes (pp. 324-343). Oxford: Blackwell.\nEllemers, N., Spears, R. & Doosje, B. (Eds.) (1999). Social Identity. Oxford: Blackwell.\nForrest,  L.  &  Barrett,  M.  (2001).  English  adolescents’  sense   of   national   identity,   identity\nmotivations and national historical  icons.  Unpublished  paper,  Department  of  Psychology,\nUniversity of Surrey.\nGiménez,  A.,  Canto,  J.M.,  Fernández,  P.  &  Barrett,  M.  (2003).  Stereotype  development   in\nAndalusian children. The Spanish Journal of Psychology, 6, 28-34.\nGould, P. & White, R. (1986). Mental Maps (2nd edition). Boston: Allen & Unwin.\nHelwig, C.C.  &  Prencipe,  A.  (1999).  Children’s  judgments  of  flags  and  flag-burning.  Child\nDevelopment, 70, 132-143.\nHess, R.D., & Torney, J.V. (1967). The Development of Political Attitudes in  Children.  Chicago:\nAldine.\nHolloway, S.L. & Valentine, G.  (2000).  Corked  hats  and  Coronation  Street:  British  and  New\nZealand children’s imaginative geographies of the other. Childhood, 7, 335-357.\nJahoda, G. (1962). Development of Scottish children’s ideas and  attitudes  about  other  countries.\nJournal of Social Psychology, 58, 91-108.\nJahoda, G. (1963a). The development of children’s  ideas  about  country  and  nationality,  Part  I:\nThe conceptual framework. British Journal of Educational Psychology, 33, 47-60.\nJahoda, G. (1963b). The development of children’s ideas about  country  and  nationality,  Part  II:\nNational symbols and themes. British Journal of Educational Psychology, 33, 143-153.\nJaspers, J.M.F., van de  Geer,  J.P.,  Tajfel,  H.  &  Johnson,  N.  (1972).  On  the  development  of\nnational attitudes in children. European Journal of Social Psychology, 2, 347-369.\nJohnson, N., Middleton, M. & Tajfel, H. (1970). The relationship between  children’s  preferences\nfor and knowledge about other nations. British Journal of Social and Clinical  Psychology,  9,\n232-240.\nLambert, W.E. & Klineberg, O. (1967). Children’s Views of Foreign  Peoples:  A  Cross-National\nStudy. New York: Appleton-Century-Crofts.\nMaehr, S. (2005). “How can one  be  proud?  I  am  not  a  Nazi!”:  An  investigation  of  German\npupils’ sense  of  national  identity  and  knowledge  of  national  symbols.  Unpublished  BSc\ndissertation, University of Surrey.\nManouka, A. (2001). Self-concept and ethnic identity of Albanian children who have emigrated in\nGreece. Unpublished MSc dissertation, University of Surrey.\nMiddleton, M., Tajfel, H. & Johnson, N.  (1970).  Cognitive  and  affective  aspects  of  children’s\nnational attitudes. British Journal of Social and Clinical Psychology, 9, 122-134.\nMoodie,   M.A.   (1980).   The   development   of   national   identity   in   white    South    African\nschoolchildren. Journal of Social Psychology, 111, 169-180.\nMoore, S.W., Lare,  J.  &  Wagner,  K.A.  (1985).  The  Child’s  Political  World:  A  Longitudinal\nPerspective. New York: Praeger.\nMummendey, A., Kessler, T., Klink, A. & Mielke, R. (1999). Strategies to cope with negative\nsocial identity: Predictions by social identity theory and relative deprivation theory. Journal\nof Personality and Social Psychology, 76, 229-245.\n Nesdale, D. (2004). Social identity processes and children’s ethnic prejudice. In M. Bennett &  F.\nSani (Eds.), The Development of the Social Self (pp. 219-245). Hove, UK: Psychology Press.\nNesdale, D. (2008). Social identity development and  children’s  ethnic  attitudes  in  Australia.  In\nS.M. Quintana & C. McKown (Eds.), The Handbook  of  Race,  Racism  and  the  Developing\nChild (pp. 313-338). Hoboken, NJ: John Wiley & Sons.\nOppenheimer, L. (2005). The development of enemy images:  Measurement  and  initial  findings.\nBritish Journal of Developmental Psychology, 23, 645-660.\nOppenheimer, L. (2006). The development of enemy images:  A  theoretical  contribution.   Peace\nand Conflict:  Journal of Peace Psychology. 12, 269-292.\nOppenheimer, L. (in press). Are children’s views of  the  \"enemy\" shaped  by  a  highly  publicized\nnegative event?  International Journal of Behavioral Development.\nOppenheimer, L., & Hakvoort, I.  (2003).  Will the Germans ever be forgiven?   Memories  of  the\nSecond World  War  generations  later.   In  E.  Cairns  and  M.  D.  Roe  (Eds.),   The  role  of\nMemory in ethnic conflict (pp. 94-104).   Houndmills, Basingstoke, UK:  Palgrave-Macmillan\nPenny, R., Barrett, M. & Lyons, E. (2001). Children’s  naïve  theories  of  nationality:  a  study  of\nScottish  and   English   children’s   national   inclusion   criteria.   Poster   presented   at   the\n10th  European  Conference  on  Developmental  Psychology,  Uppsala  University,   Uppsala,\nSweden, August 2001.\nPiaget, J. & Weil, A.M. (1951). The development in children of the idea of  the  homeland  and  of\nrelations to other countries. International Social Science Journal, 3, 561-578.\nPovrzanovi?, M. (1997). Children, war and nation: Croatia 1991-4. Childhood: A  Global  Journal\nof Child Research, 4, 81-102.\nReizábal, L., Valencia, J. &  Barrett, M. (2004). National identifications and  attitudes  to  national\ningroups and outgroups amongst children  living  in  the  Basque  Country.  Infant  and  Child\nDevelopment, 13, 1-20.\nSahlabadi, M. (2002). The strength of national identity, identity motivations and beliefs about war\nof Iranian adolescents raised in England and Iran. Unpublished BSc dissertation,  University\nof Surrey.\nSchleicher, K. & Kozma, T. (Eds.) (1992). Ethnocentrism in Education. Frankfurt: Peter Lang.\nSimon,  B.  (2004).  Identity  in  Modern  Society:  A  Social-Psychological  Perspective.   Oxford:\nBlackwell Publishing.\nTajfel, H. (1978). Social categorization, social identity and social comparison. In H.  Tajfel  (Ed.),\nDifferentiation  between  Social  Groups:  Studies  in  the  Social  Psychology   of   Intergroup\nRelations (pp. 61-76). London: Academic Press.\nTajfel, H., Jahoda, G., Nemeth, C., Rim, Y. & Johnson, N. (1972). The devaluation by children  of\ntheir own national and ethnic group: Two case studies. British Journal of Social and  Clinical\nPsychology, 11, 235-243.\nTajfel, H. & Turner, J.C. (1986). The social identity theory of intergroup behaviour. In S. Worchel\n& W.G. Austin (Eds.), Psychology of Intergroup Relations, 2nd  edition  (pp.  7-24).  Chicago:\nNelson-Hall.\nTakriti,  R.  (2002).  The  Development  of  Religious  Identity  in  Christian,  Hindu  and   Muslim\nChildren. Unpublished PhD thesis, University of Surrey.\nTeichman, Y. (2001). The development of Israeli children’s images of Jews  and  Arabs  and  their\nexpression in human figure drawings. Developmental Psychology, 37, 749-761.\nTeichman, Y. &  Bar-Tal,  D.  (2008).  Acquisition  and  development  of  a  shared  psychological\nintergroup repertoire in a context of an intractable conflict. In S.M. Quintana  &  C.  McKown\n(Eds.), The Handbook of Race, Racism and the  Developing  Child  (pp.  452-482).  Hoboken,\nNJ: John Wiley & Sons.\nTrimby, H. (2005). The development of Welsh children’s sense of  national  identity.  Unpublished\nBSc dissertation, University of Surrey.\nVethanayagam, S. & Barrett, M. (2007). English, Indian and Pakistani children’s  national,  ethnic\nand  religious  identifications.  Poster  presented  at  the  Annual  Conference   of   the   Social\nPsychology Section  of  the  British  Psychological  Society,  University  of  Kent,  September\n2007.\nVila, I., del Valle, A., Perera, S., Monreal, P. & Barrett, M. (1998). Autocategorizacion,  identidad\nnacional y contexto linguistico. Estudios de Psicologia, 60, 3-14.\nWeinstein, E.A. (1957). Development of the concept of  flag  and  the  sense  of  national  identity.\nChild Development, 28, 167-174.\nWiegand, P. (1991a). The ‘known world’ of primary school children. Geography, 76, 143-149.\nWiegand, P. (1991b). Does travel broaden the mind? Education, 3, 54-58.\n------------------------------------\n[1] In this special issue, the data collected in The Netherlands and in Israel are not reported\nseparately in individual papers. However, these data are included in the cross-national\ncomparative analyses reported in the final paper by Oppenheimer.\n[2] In rescaling, 1 = 1, 2 = 2.33, 3 = 3.66 and 4 = 5.\n"}